{
    "title": "This sub in a nutshell",
    "author": "qchto",
    "subreddit": "SteamDeck",
    "rank": 2,
    "score": 2172,
    "upvote_ratio": 0.8,
    "num_comments (reported by reddit)": 530,
    "url": "https://i.redd.it/v96utoy9wgpe1.png",
    "id": "1je7rpe",
    "selftext": "",
    "comments": [
        {
            "author": "DAHbaddest",
            "body": "A Monster Hunter Wilds player made this",
            "score": 1308,
            "replies": [
                {
                    "author": "hardsleaz",
                    "body": "A Monster Hunter Wilds player made this and posted it to reddit between 2 frames",
                    "score": 409,
                    "replies": [
                        {
                            "author": "probablyuntrue",
                            "body": "Mmm my favorite slideshow",
                            "score": 29,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PaleontologistWest47",
                    "body": "Facts. I got downvoted in the weekly thread of “what are you playing this week” because my response was MH Wilds..\n\nSomeone then asks “streaming right?”\n\nWhich is a yes, but the thread isn’t “what are you playing that is installed on the steam deck?”\n\nLike you’ll get flak on the sub just for saying you’re playing MH wilds or that you think it’s a great game simply because it doesn’t run flawlessly (or really at all) on the steam deck natively.",
                    "score": 182,
                    "replies": [
                        {
                            "author": "brandont04",
                            "body": "I'm glad I'm old. N64 Zelda OoT ran at 20 FPS. Im not too snobby when it comes to fps in my games. If it's playable and fun, I'm going to enjoy it.",
                            "score": 84,
                            "replies": [
                                {
                                    "author": "xEmptyPockets",
                                    "body": "It's not really a snob thing, at least not for everyone. Sub-30 FPS gives me motion sickness and/or headaches.",
                                    "score": 42,
                                    "replies": [
                                        {
                                            "author": "pearljamman010",
                                            "body": "It does come off as snobby, I can see that.  But every since I've gotten 165Hz monitors and play at 100, 120Hz, or 165Hz/FPS on PC with FreeSync, a 30FPS cutscene from the same game feels like a slide show.  That drop from 120 to 30 is an eye-opener for sure.",
                                            "score": 30,
                                            "replies": [
                                                {
                                                    "author": "Meeesh-",
                                                    "body": "It’s a matter of comparison. When you switch from 120 to 30 it is absolutely jarring, but you get used to it pretty quickly. Movies in the theatre are usually 24fps. I think most gamers that go to the movies aren’t bothered by it after a couple minutes if at all.\n\nI think many people who say it gives them motion sickness only feel that way because they’ve gotten used to higher frame rates. I know I felt motion sick when first getting into blu-rays at 24fps, but it was gone like an hour in and I haven’t felt it since.\n\nDont get me wrong, I love 120+ fps and pretty much use the steam deck only for games that I get a consistent 60+fps. Just I see how you can easily get used to 30fps with bad graphics if that’s the best that you have. Many “older” (not even that old, even Xbox One had many AAA games at 30fps) gamers will have grown up playing twitchy games at lower fps.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "EVPointMaster",
                                                            "body": "I am distracted by it in movies every now and then, but I'm also used to 120+fps gaming.\n\nThen I went to watch Avatar 2: The Way of Water, thinking the whole movie would be HFR. But no, it switches back and forth between 24 and 48fps all the time and that was very jarring to watch",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "SpHoneybadger",
                                                    "body": "Rather it's a sign of superiority for me since I can enjoy games they cannot. I'll take 25-30FPS.\n\nI've never experienced anything higher than 90Hz.",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "pearljamman010",
                                                            "body": "Some games 30 FPS works, especially if it's consistent.  It's the frame-dips and stuttering that make it seem worse than it actually is.  I still play my DS-Lite and Gameboy Color and it's perfectly fine.  Or my son's un-docked Switch.  I think consistency is the bigger difference.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "CMDR_Galaxyson",
                                            "body": "That's fine but people around here and pc gaming spaces in general will act like you're stupid for enjoying a game at 30fps.",
                                            "score": 16,
                                            "replies": [
                                                {
                                                    "author": "Kittyk4y",
                                                    "body": "Hell, in 2012 I played Skyrim at 20-25fps on my laptop and LOVED every second of it!",
                                                    "score": 10,
                                                    "replies": [
                                                        {
                                                            "author": "Ecstatic_Driver_1506",
                                                            "body": "Everyone loved the PS2 and a bunch of popular titles ran around 24 FPS.\n\nI had the same experience as you did but with WoW back in the 00s.",
                                                            "score": 12,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "KingBobIV",
                                            "body": "It's wild how many people obsess of a stupid number, rather than just playing games.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "MarthMain42",
                                                    "body": "I agree that some people value the number too highly, but it is also reflective on how the game *feels*? There is a reason games like Devil May Cry worked to run at 60fps on the PS2 and it's not because they were worried that snobs would be doing deep analysis of their games.\n\nNow, frame pacing is way more important but that's significantly harder to convey and figure out than just a big FPS number.",
                                                    "score": 9,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "LongFluffyDragon",
                                                    "body": "Unstable sub 30 fps just feels awful and frustrating in realtime games. Dont need a framerate counter to instantly tell the difference, and it has a real impact on gameplay.\n\nsynced 30 is tolerable in some games. 45 is usually fine.",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "tyrenanig",
                                                    "body": "My guess is probably because a lot of Steam deck users are also PC gamers. And no type of demographic is more obsessed with FPS than PC gamers.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "No_Mix_5059",
                                                            "body": "Kinda true but since am getting older turned 40 recently and I have 4 kids..I have a gaming laptop with 4060 and 32gigs ram, yet I use my 1tb OLED, connected to a 4k tv and I’m happy playing Elden Ring at 720p and red dead 2 at 800p at 30 frames.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Desperate-Minimum-82",
                                            "body": "I thought I was the same way, then I got into retro console emulation where there is often 30 fps hard caps\n\nbut I was fine\n\nturns out what was causing it for me wasn't 30 fps, it was inconsistent frame timings\n\n30 fps with a rock solid 33ms per frame? golden\n\n30 fps jumping between 16 and 60 ms per frame? vomit enducing\n\nits now to the point where as long as the frame timings are smooth, I can play at 30 fps in VR without motion smoothing (VRs frame gen that does not add latency)\n\nso I'd recommend trying to see if your the same, pay attention to frame pacing instead of frame rate, lock a game to 30 if you have to just to see if a smooth 33ms a frame does the same to you",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Desperate-Minimum-82",
                                    "body": "The classic case of consistent frame pacing > higher FPS\n\nI'd much rather take 60 fps with a rock solid 16ms a frame then take 120 fps that jumps between 5ms and 12ms a frame",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Comfortable_Line_206",
                                    "body": "I think a bigger issue is locked fps. Like you said, even 20fps OoT was fine but a variable 45-60 feels annoying on the deck.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "VonLoewe",
                                    "body": "You can't compare N64 to a modern AAA game. 20fps then is not the same as 20fps now.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "MadOliveGaming",
                                    "body": "Same tbh. Im happiest with 30fps and i run all of my games on a 40fps lock even if they could do tripple that. But ill take between 20 and 30 if it mean being able to play a game i enjoy",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "secret3332",
                                    "body": "There is a difference though for sure. OoT was actually impressive and cutting-edge for its time. Wilds looks pretty bad, at least imo, even at the highest settings, isn't doing anything crazy with its design or pushing any boundaries, and still runs horribly. Also, Capcom set themselves up for flak by releasing recommended specs and setting with DLSS and Frame Gen on lol.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "VonLoewe",
                                    "body": "You can't equate N64 to a modern AAA game. 20fps then is not the same as 20fps now.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "No_Mix_5059",
                                    "body": "Same with peace walker was caped at 20 frames on psp and it was great.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "deathblade200",
                                    "body": "the ironic thing is \"old\" people are the ones  that SHOULD want 60FPS since gaming started at 60FPS and for the longest time most games were 60FPS. people have this stuff so ass backwards and seem to think all older games ran worse. hell F-Zero was 60FPS on N64",
                                    "score": -20,
                                    "replies": [
                                        {
                                            "author": "boomb0xx",
                                            "body": "That was the only game though and most were capped at 20 to 30 and some even less. But honestly, I grew up in that generation and FPS wasn't even talked about ever at least not in my circle.",
                                            "score": 15,
                                            "replies": [
                                                {
                                                    "author": "deathblade200",
                                                    "body": "N64 was the exception not the rule. the fact it still had a 60FPS shows they werent some mystical beast either. up until after PS2 most games were 60FPS. N64 was truly just a bad console with a tiny library. its so odd to me how people pretend games back then were 30FPS when the majority were 60FPS.",
                                                    "score": -8,
                                                    "replies": [
                                                        {
                                                            "author": "boomb0xx",
                                                            "body": "Just a horrific take and shows you definitely didn't grow up in that generation.",
                                                            "score": 7,
                                                            "replies": [
                                                                {
                                                                    "author": "Wasted-Instruction",
                                                                    "body": "That was my first thought too, seems like someone younger trying to be some sorta retro snobe. \n\nFor N64, 60 FPS was the limit, though very few games actually ever ran that fast. Most were 30 FPS or less. The Zelda games ran at 20 FPS, for instance. Inconsistent frame rates were the standard.",
                                                                    "score": 8,
                                                                    "replies": [
                                                                        {
                                                                            "author": "deathblade200",
                                                                            "body": "is this the way we have to cope about this subject now? I lived through it I know what I am talking about even if people for whatever reason wish to pretend otherwise. hell PS2 to this day still has the most 3D 60FPS games of any console.",
                                                                            "score": -7,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Wasted-Instruction",
                                                                                    "body": "What am I coping about?\n You gave the wrong statistics for the N64. You're right that the PS2 had a lot of 60 FPS games, though my favorite ff-x was capped at 30fps. \nA lower fps is the sacrifice people make to play something on portable hardware.. I'm away from home for months at a time for work, I played Spider-Man 2 at a locked 25fps, would it have been better on my computer at home? Sure, am I happy that I was able to play it while away for work? Yeah, did I still enjoy it? Yeah. \n\nThe modern game industry sucks, but that has nothing to do with acting like people can't enjoy something just because it isn't running at a certain fps. Just as buddy above pointed out, in the course of my life, I've enjoyed a lot of games with wonky frame rates.. who cares what other people do?",
                                                                                    "score": 7,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "deathblade200",
                                                                                            "body": ">What am I coping about? You gave the wrong statistics for the N64.\n\nso calling the N64 the exception not the rule, saying it had an insanely tiny library, and was a commercial failure is wrong? notice how the only way people can reply back to me saying most games ran at 60FPS back then is just pointing out how bad the n64 truly was. like ps2 has more 60fps games than the whole size of the n64 library.",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "boomb0xx",
                                                                                                    "body": "\nAre you from the US? Only asking because your take would make way more sense if you aren't. The N64 in the US was not even close to a commercial failure. Definitely overshadowed by the PlayStation, but still sold very well and had some of the most iconic games of the 90s.",
                                                                                                    "score": 6,
                                                                                                    "replies": []
                                                                                                },
                                                                                                {
                                                                                                    "author": "zabbenw",
                                                                                                    "body": "Yes... That famous \"commercial failure\" the N64 🙄",
                                                                                                    "score": 2,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "deathblade200",
                                                                    "body": "bud I grew up with snes and genesis give it at rest. n64 was a commercial failure and thats a fact.",
                                                                    "score": -3,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "zabbenw",
                                                                    "body": "I think you're getting it confused with the Sega Saturn. The N64 was the cartridge based machine from Nintendo, that pioneered the analogue stick.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "deathblade200",
                                                                    "body": "ah yeah I'm totally confusing the Sega Saturn that has vastly more games with the N64 with far fewer games, worse performance, and the worst controller ever created that basically requires 3 hands. it was a bad console with a handful of good games that make people act like its better than it is.",
                                                                    "score": 0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "zabbenw",
                                                                    "body": "The Saturn was objectively a commercial failure, though, and was basically just a worse Playstation. The N64 had loads of killer exclusives that were defining games of the era. Tbh with so much shit being released on the switch, I'm kind of nostalgic for the SNES and N64 days when Nintendo put the \"official seal of quality\" on their games. That shit's gone right out the window, lol.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "SnooRecipes1114",
                                                            "body": "The majority of console games from the n64 up until the Xbox one/ps4 were 30 fps",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "deathblade200",
                                                                    "body": "PS2 literally has the most 3D 60FPS games of any console. 60FPS was the standard up until then.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "SnooRecipes1114",
                                                                            "body": "That is a bit skewed, the PS2 also has the biggest games library of any console. It was also the exception, from n64 up virtually every console prioritized 30fps. Also including the switch, the second most successful console which is still going has mostly 30fps titles",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "zabbenw",
                                            "body": "yes. NSTC was 60hz and pal was 50hz, but... also so many games ran slow back in the day.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "Ph33rDensetsu",
                                            "body": ">since gaming started at 60FPS and for the longest time most games were 60FPS.\n\nNot 3d gaming.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "deathblade200",
                                                    "body": "PS2 literally has the most 3D 60FPS games of any console. 60FPS was the standard up until then. its wild to me how people don't know this.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Ph33rDensetsu",
                                                            "body": "Nope.  PS1 and N64 titles often ran lower and inconsistently, and PCs were even worse off, because most people didn't spend money on gaming hardware. \n\nIf you claim to have grown up in this era, then you are either misremembering, don't know what you're talking about, or come from some kind of alternate dimension. \n\nNot only was 60fps not the standard, *consistent* fps locking wasn't either.\n\nShit, dude, even 2d games didn't run at a locked 60.  Like, did you even ever play MegaMan?",
                                                            "score": 4,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "tyrenanig",
                                                            "body": "“The most”. Out of how many 30fps titles?",
                                                            "score": 2,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Jonaldys",
                                                            "body": "How many games in the PS2 library ran at 60 FPS?",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Lor9191",
                            "body": "Do streamed games count for deck statistics? No salt just curious",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "Reiver_Neriah",
                                    "body": "No",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "Lor9191",
                                            "body": "Wow so that many people are actually playing MHW on deck, that's cool. \n\nI'm debating giving it a go, got a main pc if I don't like the deck experience.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "Reiver_Neriah",
                                                    "body": "It's alright but you're sacrificing a lot just to get it subpar. It isn't even a locked 30.\n\nI've done hunts with just the deck but I'll just be doing equipment management/resource gathering on it and streaming the rest of the time.",
                                                    "score": 6,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "-FourOhFour-",
                                                    "body": "The performance issues for wilds were bloated at launch having no issues on my machine at a perfectly stable 60 launch weekend, so I wouldn't be surprised if that bled over into steamdeck as well",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Reiver_Neriah",
                                                            "body": "The updates didn't really do anything to help the deck",
                                                            "score": 7,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Andrea_Notte90",
                                                            "body": "as someone who only owns a deck, (no pc no console) nah it hasnt improved at all since release optimization wise, less crashes tho and im still having fun and can do any content",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "NoCareNewName",
                            "body": "I sort of get the annoyance though. Whether its b/c you are playing away from home, don't have good wifi, or don't have other machines, there are a lot of people who don't care about streaming on the deck.\n\nIf people are asking \"what are you playing (on the deck)?\" Its implied that they mean, on the deck, no asterisk or anything.",
                            "score": 19,
                            "replies": []
                        },
                        {
                            "author": "Balikye",
                            "body": "Every time I've mentioned I play Wilds I've got a pretty steep negative karma, lol. I couldn't even post memes about playing Wilds.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "CtrlAltEvil",
                            "body": "Same thing happened when Space Marine 2 released.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "adelin07",
                            "body": "How are you streaming it? I tried directly in steam, but all I got was a black picture. Sound was coming through though. Are you using moonlight?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "PaleontologistWest47",
                                    "body": "I’ve done both Steam Stream And Moonlight/Sunshine.\n\nMoonlight is the much better, more consistent option that I’ve had. Mind you, I live in a smaller house, with WIFI6E and 3gbps internet speeds, plus wired to PC.\n\nSteam Streaming has worked well for me in the past, but the lags, poor resolution, and freezes are WAY more frequent than Moonlight.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "RageReq",
                            "body": "Wait I played the entire first hunt on steam deck(not streaming), was that not supposed to be possible? It lagged in cutscenes but the gameplay was good(I had it at 30 fps though).",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "PaleontologistWest47",
                                    "body": "No I think it’s actually OK for most. I’m just VERY in my ways about performance and frame rate.\n\nGoing from a monitor at 165fps and ultra settings with RT on to 30 on the deck isn’t it for me so I prefer to stream and get 90fps, max settings, OLED, etc.\n\nI set my bitrate at 30mbps btw for streaming.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "OutlawBlue9",
                            "body": "Side question for you: how does streaming work on the deck? Do you use something like Nvidia or does it stream from your PC?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Pilot_Enaki",
                            "body": "I stream it from my Xbox with xplay. Works like a charm and I can make macros for my hunting horn",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "minilandl",
                            "body": "To be fair that's just in general you shouldn't be supporting developers putting out broken PC ports. People say gaming on Linux is hard but to be fair it's about as hard as on windows because of how broken current games are .\n\nGames journalists and other people are giving avowed and wilds a pass don't support games that are broken.\n\nMonster hunter wilds was rushed out and has awful performance in general because developers just for e games through FSR instead of putting work in",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "shuuto1",
                                    "body": "Not running on steam deck doesn’t make it a broken port",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "Andrea_Notte90",
                                    "body": "You are not completely wrong, but also not really right, Monster Hunter wilds was rushed a bit to fit in the fiscal year BUT a ton of the performance issues are just because the engine is terrible at handling open world games which is not smth they can fix without a lot of investment which they wont cause they already working on a new engine that works better for open world but still needs some years",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "kinos141",
                    "body": "You say Monster Hunter Wilds.  I say Dragon's Dogma 2.  We are not the same.\n\nwait...",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "OrganTrafficker900",
                    "body": "I'm playing on 4 fps the game looks so nice you just need to get used to it.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "qchto",
                    "body": "I wish.... I got FFXVI in the sale though, and I'm liking it on the go. 6 hours in and loving the reportedly 15fps cutscenes (gameplay stays at 25-30fps with FSR3 performance btw, and I don't feel I miss much in terms of gameplay after having experienced the game in PS5).",
                    "score": -4,
                    "replies": [
                        {
                            "author": "IndexLabyrinthya",
                            "body": "What",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Repulsive-Willow55",
                            "body": "Why was this so heavily downvoted?",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "qchto",
                                    "body": "Too much fun I guess... 😅",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "Repulsive-Willow55",
                                            "body": "You literally just said “I got this game and I’m enjoying it” and people were like “Noooo, boooooo!”",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "Potijelli",
                                                    "body": "Life imitating meme art. 😂 \n\nYou only have to scroll through this thread to see people doubling down on the \"quit having fun\" mentality and trying to move the goal posts to justify the hate.",
                                                    "score": -1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "SnooRecipes1114",
                                            "body": "This sub is literally one of the most negative and depressing subs I browse just because of how hateful people can be in these discussions, this post showcases that pretty well too. God forbid you enjoy playing a game at a frame rate consoles have been using for decades until the ps5/xbsx and even still if you include the Switch.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "tyrenanig",
                                                    "body": "Crazy. You would have thought SD users would love to tinker with it just so you can play anything. Turns out they just want to be told not to try.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "SnooRecipes1114",
                                                            "body": "That was what I thought too, I remember we started getting our hands on them I was excited to see what people would do with it and how far people would push its limits and keep it going by tinkering, nope you just instantly get burnt at the stakes by absolutely everyone for even thinking in that direction.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "Emergency-Ball-4480",
                                                                    "body": "There's absolutely a community for that though. So many people are enjoying squeezing every drop of performance (myself included), but there's a very vocal crowd that looks down on it and takes every opportunity to bash people having fun. All part of being included in the PC gaming community, I suppose. Though there were a lot of people doing the same thing with the Switch and the \"impossible\" ports it got, saying they weren't worth playing. I played through all of Doom 2016 and Doom Eternal on Switch (in handheld mode, to boot!) and loved them.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "SnooRecipes1114",
                                                                            "body": "You're right, it's easy to forget that it's the minority that are bashful like this and that they are just so vocal so it looks this way when in reality the majority of people just don't care and are happily enjoying themselves. It is a shame that's what we have to deal with though in a community like this sub, you're right on with the switch games too I remember the exact same thing whilst enjoying playing through them myself. Wish these people could just be more chill but it is what it is.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Jonaldys",
                                                    "body": "I think it's an over correction. For a good while, people were delusional about Steam Deck performance. They would lie about frame rates just to claim the deck ran at game consistently. Hell, people actually believed that the steam deck could emulate the Switch perfectly, called it the switch killer for months",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "IvanVodka",
                                                            "body": "It can but the experience is clunky at best, I was able to play through ToTK but, it crusher then I registered horses for example, and after 60k shader cash, so I being forced to clean the cash and have some staters again, the gyro work isn't perfect, and many fps drops in some locations, it's like playing the game on PC with requirements less then recommend by developers.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "Jonaldys",
                                                                    "body": "Hence why I included the \"perfectly\" modifier. It can run some games decently, but not all games. Certainly not the killer it was touted as.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "MarthMain42",
                                                            "body": "People still are delusional about the performance, but yeah for sure there is unwarranted negativity that is reflexive as a result.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "paperjin",
                    "body": "As if we haven't been here before in this exact situation with other games lol",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Eatitapple",
                    "body": "Played almost 30 hours on the deck",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "SuperSaiyanIR",
                    "body": "I wouldn't be caught dead playing that game on the deck. I have been streaming it and it's been lovely. Even my 4080S struggles to run that game at 4k60.",
                    "score": -27,
                    "replies": [
                        {
                            "author": "Elegant_Relief_4999",
                            "body": "Drop the resolution. I feel like the textures in the game don't even look different between 4k and 1440p, and you get a huge frame rate boost.",
                            "score": 10,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Elegant_Relief_4999",
                    "body": "Just stream it, ffs. My PC gets 120+ fps on 1440p without frame gen. I cap it to 60 when streaming cause that's the refresh rate of the LCD deck.",
                    "score": -67,
                    "replies": [
                        {
                            "author": "Dragon_Small_Z",
                            "body": "You say this as if everyone has that option.",
                            "score": 59,
                            "replies": [
                                {
                                    "author": "masohak",
                                    "body": "My other PC is a busted laptop from the early 2010s lol",
                                    "score": 10,
                                    "replies": []
                                },
                                {
                                    "author": "Elegant_Relief_4999",
                                    "body": "Meh, if my options were playing it on deck at 30 fps with frame gen, or not play it at all, I would not even bother with the game. There are like 10 other titles in the series that would run fine on the deck emulated.",
                                    "score": -25,
                                    "replies": [
                                        {
                                            "author": "sourcesys0",
                                            "body": "I sold my watercooled PC with a 420W OCed RTX 3090, because the Deck just is enough for me.\n\nI rather play on the Steam Deck with upscaled 240p and 24fps than going back to Windows and losing all that comfort I got with the Deck.\n\nI learned that once I play a fun game, I just forget if its 4k/120fps or upscaled 800p/30fps, because thats not where my attention/focus is anymore.\n\nI am currently playing MGS5 with FSR and 30fps lock at 4-5w, and when playing the game, I dont even think about resolution or fps anymore. MGS5 ran with 30fps on the PS3 and it was great.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "Elegant_Relief_4999",
                                                    "body": "That's cool if that's working for you, I do like 80% of my gaming on the deck myself, but most of that is streaming from my PC. The deck will not be able to run cutting edge games in the next year or so. It's going to be like trying to run Crysis on a machine built for Windows 98.",
                                                    "score": -3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "sourcesys0",
                                                    "body": "Maybe, but as right now, the Steam Deck plays 99.9% of games just fine (to me).\n\nI also streamed Stalker2 from my Laptop, but I also could have played it on the SD. DLSSFG mods help a lot.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "NoWayJoseMou",
                                            "body": "I hate when people don’t do things like I do.",
                                            "score": 14,
                                            "replies": [
                                                {
                                                    "author": "No-Ad9763",
                                                    "body": "I mean he didn't say he hates what others do, just what he wouldn't do.\n\nIt sounds like you hate it more that he wouldn't do it than he ever cares that you would",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "author": "NoWayJoseMou",
                                                            "body": "I’ve made my stance clear on this. People should do what I do.",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Elegant_Relief_4999",
                                                    "body": "I don't care what other people do, it just seems like torture to try to play Wilds on the deck natively ¯\\\\_(ツ)_/¯",
                                                    "score": -9,
                                                    "replies": [
                                                        {
                                                            "author": "sourcesys0",
                                                            "body": "It sounds like a torture to be an elite gamer.",
                                                            "score": 3,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Elegant_Relief_4999",
                                                            "body": "I don't have to deal with games crashing, so not really.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "sourcesys0",
                                                            "body": "Games crashing?",
                                                            "score": 2,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Elegant_Relief_4999",
                                                            "body": "Yeah, I saw countless posts of the Wilds obt crashing for people trying to get in on it, and I had zero trouble. If your hardware doesn't meet minimum requirements for a game, it won't run well, and can often crash during gameplay. The steam deck is not super powerful, and is going to show its age in the next year or two. I remember trying to run Crysis when it came out on my Dell XPS from 2006, and it was just awful. I've been building my own PCs ever since.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "migstrove",
                                            "body": "The down votes in this subreddit are insane",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SirLoiso",
                            "body": "Are you offering your PC for me to stream from?",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "Elegant_Relief_4999",
                                    "body": "I'm not, but there are a handful of streaming options that honestly look like a good deal. I would definitely consider that if I didn't already have a powerful machine.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "iPlayViolas",
                            "body": "Woah what! What is your gpu? The 5080 is getting 60-70 at 1440p. \n\nI’d kill to get 120+ no frame gen",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Elegant_Relief_4999",
                                    "body": "I have a 4080 Super. Graphics settings are \"custom\", but just the recommended as set in the Nvidia app.",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "iPlayViolas",
                                            "body": "According to benchmarks you are 100% scaling way lower than 1440p for that 120. The game scaled at 1080p on a 4080super averaged about 78-90 fps in non combat scenarios.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Elegant_Relief_4999",
                                                    "body": "I can take a screenshot the next time I play, but Nvidias overlay is definitely showing over 100 fps on Wilds for me on 1440p",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "iPlayViolas",
                                                            "body": "It’s 100% scaling bro.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Elegant_Relief_4999",
                                                                    "body": "Yeah, that's possible, I'll have to check what the scaling is set at, all I know is that I selected the resolution that corresponds to 1440p in the options.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "JameSdEke",
            "body": "People can enjoy what they want but some Steam Deck fans and youtubers can embellish the truth an awful lot when saying games run flawlessly. \n\nIf they say \"I'm enjoying this game a 30fps but it has some dips and its on very low presets\" - fair enough. But when they're like \"this game runs flawlessly I can't believe how good it is\", that's when they begin to set expectations for everyone else when its actually running at like 24fps.",
            "score": 393,
            "replies": [
                {
                    "author": "Boring_Isopod_3007",
                    "body": "Exactly. Many times I have read comments about games that \"run butter smooth\" and when I tried them, it was under 30fps with huge stuttering.",
                    "score": 72,
                    "replies": [
                        {
                            "author": "Whiteguy1x",
                            "body": "Sometimes proton versions make a huge difference.  Not often, but I've had experimental muck things up and lose 5-10fps for example ",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "quajeraz-got-banned",
                                    "body": "5-10 fps is not the difference between \"unplayable mess\" and \"buttery smooth\"",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Thick-Tip9255",
                                            "body": "Maybe not, but stable 30 vs unstable 20 is playable & unplayable for me.",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Capable-Commercial96",
                                    "body": "Oh really? Which games?",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Emergency-Ball-4480",
                                    "body": "I usually find ProtonGE gives me a bit more stability and a very slight boost in peak FPS. Not always though, but definitely worth trying it out just to eke a bit more out of it.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Shuppogaki",
                    "body": "Not just this, but also making recommendations based on it. AAA games are standard $70 now. That's a hell of a lot of money and people deserve honest recommendations.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "Bspammer",
                    "body": "Yeah the problem isn't that you're having fun, it's that you're going online and lying about the performance you're getting because you can't tell the difference.",
                    "score": 41,
                    "replies": [
                        {
                            "author": "BadThingsBadPeople",
                            "body": "🥴 maybe take a chill pill?\n\nlying is such strong language....\n\ni've lived my whole life living intentionally ignorant to performance. resolution? frame rate? these words mean nothing to me 🥴.\n\nso you can't call me a liar. i am a hobbyist. my hobby is going online and telling people \"it runs fine on my nintendo/xbox/playstation/\" and now steam deck. since i don't know what im talking about, you can't call me a liar. it's literally not illegal to not know something 🥴.",
                            "score": -9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "havoc1428",
                    "body": "And this attitude only serves to hurt the reputation of the SD. Imagine the hundreds of customers who could or will potentially buy a SD only to be disappointed because it turns out it cannot do what they thought it would because some of these people embellished its performance. \n\nThat point is what really grinds my gears, the SD is an honest product, and I want it to remain that way.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "DessertTwink",
                            "body": "It's a handheld gaming device, and people need to have realistic expectations about what it can run smoothly. Which is quite a lot, but there's a lot of sensationalists pushing out falsehoods about the capabilities of an already great system.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "0pyrophosphate0",
                                    "body": "It's a handheld device, and that's why it's perfectly fine to admit that a game actually *doesn't* run that well on it, and it's perfectly okay to enjoy it anyway.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "DessertTwink",
                                            "body": "Exactly, but some people would rather pretend it's a godly PC in your hands. It's not. It can run a wide range of games very well, but there's a clear difference between a game for your deck, and a game for your PC. It's better to be honest about what games are in the latter category",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "boy_blue1982",
                    "body": "Yeah, I Enjoy Skill up, but he said on his podcast that the Resident 4 Evil Remake ran well on Deck, It does not. Trying to play that game on Deck feels like Playing it with Vaseline in your eyes, and keep in mind I turned down all settings to the lowest possible.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "EverydayFunHotS",
                    "body": "I think the sad reality is the vast majority of gamers simply do not notice these things. Like Digital Foundry will often say, sometimes a game has glaring flaws and the general sentiment will be 'it runs great!'\n\n\nPower to them! They just shouldn't be making appraisals.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "OTISElevatorOfficial",
                    "body": "yea I tried silent hill 2 on my steam deck (didn’t buy buy it specially for that but just tried it out) because people said worked pretty good on low settings.\n\nIt does not lol. It looked like a weird hybrid of an N64 and PS3 game.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "deathblade200",
                    "body": "hell calling 30FPS \"flawless\" in the first place is just incorrect. you are having to limit the game to a lesser frame rate than its intended to run at in order to compromise. that is in fact not \"flawless\"",
                    "score": 16,
                    "replies": [
                        {
                            "author": "SheepherderGood2955",
                            "body": "Is there even really an “intended” rate nowadays? I personally will only play games at 45fps+ because I get motion sick otherwise, but unless the physics are tied to frame rate, I don’t know that I’d agree about “intended frame rate.”",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "Elarisbee",
                                    "body": "For the Deck the minimum is 30fps. \n\nThat’s the number Valve said in interviews before launch was their base low-end for a game  to be considered “playable”. Importantly, that was the number early adopters based our pre-orders on.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Darder",
                                    "body": "There are. It's mostly called \"performance target\". A dev team will target a certain set of hardware, with a certain framerate. Then they will optimize until they reach that target.\n\nExample: if I make, say, Doom (2016), I could target the PS5 at 60 fps in 1080p. I could also target the nintendo switch at 30fps in 720p. \n\nThese are the \"intended framerates\", only in the sense that it was optimized to reach this. It can also be playtested at this framerate.\n\nBut, in the end, what it mostly means is the devs may not give a shit about \"5090 cannot run this in 4k at 144fps\" , but also won't give a shit if \"gtx 960 can't run this at more than 30fps\". You meet the target, and that's the goal.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "EVPointMaster",
                                    "body": "Yes. 60fps is the standard",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "squishyjellyfish95",
                                    "body": "60fps is pretty much needed for most games to look smooth",
                                    "score": -5,
                                    "replies": []
                                },
                                {
                                    "author": "deathblade200",
                                    "body": "for a PC game? yes the bare minimum for PC games is 60FPS. if this was really the PC community people would be expecting 120FPS+. 45FPS while not as bad as 30FPS is still compromising and not a great experience.",
                                    "score": -20,
                                    "replies": [
                                        {
                                            "author": "SheepherderGood2955",
                                            "body": "Maybe for you, but you’re definitely in the minority, especially in this sub. I’m all for higher frame rates, if I can hit them on my Deck, I’ll go for them, but most people are fine with 30fps, especially if the frame times are consistent.",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "Deputy_Beagle76",
                                                    "body": "30 consistent is better than 60 with frequent dips, especially if it’s an execution heavy game where frame dips mess with your inputs",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Deputy_Beagle76",
                                                    "body": "30 consistent is better than 60 with frequent dips, especially if it’s an execution heavy game where frame dips mess with your inputs",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Deputy_Beagle76",
                                                    "body": "30 consistent is better than 60 with frequent dips, especially if it’s an execution heavy game where frame dips mess with your inputs",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "deathblade200",
                                                    "body": "if I was the minority then posts like this wouldn't need to be made. the 30FPS people are just extremely loud defending 30FPS.",
                                                    "score": -10,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "SheepherderGood2955",
                                                    "body": "I see almost no one “defending” 30fps. Instead, I see people saying that they don’t mind 30fps. I don’t agree with them, but it doesn’t matter, what they do doesn’t affect me.",
                                                    "score": 7,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "soapd1sh",
                                                    "body": "No, posts like this are made because of people who can't mind their own business and tell others they are wrong for being perfectly happy playing at anything less than 60 fps. It is completely subjective. That said, I do agree people need to stop saying a game runs flawlessly when it clearly does not.",
                                                    "score": 6,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "soapd1sh",
                                                    "body": "No, posts like this are made because of people who can't mind their own business and tell others they are wrong for being perfectly happy playing at anything less than 60 fps. It is completely subjective. That said, I do agree people need to stop saying a game runs flawlessly when it clearly does not.",
                                                    "score": 4,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "deathblade200",
                                                    "body": "so let me get your logic straight. the \"minority\" are a big enough of a problem that they need to have a post about them made. kind of sounds like they aren't the minority huh.",
                                                    "score": -2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "soapd1sh",
                                                    "body": "I never said anything about anyone being the minority. You did. I just gave my opinion on why these posts exist.",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "asmallercat",
                                            "body": "I'm so glad I'm not in the portion of the community that hates 30fps. Maybe cause I've been gaming since the 90's - 30fps is fine lol.",
                                            "score": 16,
                                            "replies": [
                                                {
                                                    "author": "deathblade200",
                                                    "body": ">Maybe cause I've been gaming since the 90's - 30fps is fine lol.\n\nso you do understand most games were 60FPS back then correct?",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "author": "asmallercat",
                                                            "body": "Not on N64 lmao. Most of them were 20-30. A ton of gamecube games were also 30fps. I've never once noticed a game's framerate looking choppy at 30 unless it's a huge dip from the norm.\n\nLike, I get it that you can see the difference between 120, 60, 30, etc. That's cool. I'm saying that I don't notice it while I'm actually playing unless it's a huge dip mid-game, and I'm glad for that.\n\nEdit - I mean, hell, BOTW was 30 FPS on handheld and people seemed mostly fine with it.",
                                                            "score": 7,
                                                            "replies": [
                                                                {
                                                                    "author": "deathblade200",
                                                                    "body": "bud 60FPS was the standard until after PS2 which came out in 2000. N64 was the exception not the rule. it barely had any games and failed majorly for a reason. PS2 to this day still had the most 3D 60FPS games of any console.",
                                                                    "score": 7,
                                                                    "replies": [
                                                                        {
                                                                            "author": "asmallercat",
                                                                            "body": "Cool I didn't own a ps2. Why are we arguing about this? You're allowed to care a lot about FPS. I'm allowed not to. \n\nAnd sure, NES and SNES (and even my dad's Atari 2600 that I played as a kid) ran at 60fps, but like, that wasn't something people talked about back then (we talked about all the slowdown from too many sprites on screen in NES games lmao).",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "deathblade200",
                                                                                    "body": "just because you didn't talk about it doesn't mean it wasn't a reality. your literal first post was \"i lived with 30fps because i'm old and all old games were 30FPS\" which is factually incorrect",
                                                                                    "score": 6,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "asmallercat",
                                                                                            "body": ">\"I'm so glad I'm not in the portion of the community that hates 30fps. Maybe cause I've been gaming since the 90's - 30fps is fine lol.\"\n\nMy literal first post. Wtf are you walking about? I never said \"every game in the 90's was 30fps.\" I've been gaming for a long time and played a ton of 30fps games, and I find it fine.",
                                                                                            "score": -1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Balikye",
                                                    "body": "Games like C&C 3 being locked to 30FPS even on PC by the engine itself. (Making it 60FPS makes the game run at 2x speed.) They'd never survive playing C&C.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Great_Necessary4741",
                                            "body": "eh, most of them are still fun and playable at 30. ",
                                            "score": 14,
                                            "replies": [
                                                {
                                                    "author": "Inclinedbenchpress",
                                                    "body": "While it's playable and you can have fun once you go 60 fps it's hard to get back to 30, but it's all down to compromises expectations. A 15w hanheld isn't delivering good experience overall on the latest and greatest games",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "muldersposter",
                                                            "body": "I've played games at 30 fps and 60 fps. I perceive very little difference in my enjoyment of the game between either. As long as motion is fluid I don't care what the frame rate is.",
                                                            "score": 4,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Great_Necessary4741",
                                                            "body": "maybe i'm just way too used to low framerates because i was stuck on 7th gen game consoles for most of my life lol",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Inclinedbenchpress",
                                                                    "body": "Last console I had was a ps3, had a blast on it for over half a decade!",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Great_Necessary4741",
                                                                            "body": "PS3 was my main console for years, but it broke a few years ago and I haven't had it plugged in since. I wanna fix it at some point but ik that's gonna be expensive.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "hayt88",
                                            "body": "I enjoy my high fps gameplay as much as everyone but can you please provide me with some source about how 60 fps is the bare minimum for PC? One that is not made up by you?\n\nPlease one that is officially recognized by most game devs and not just some single rando critic.\n\nI am fairly sure I can go into a game, set the settings so high that I run below 60 fps l and no game will tell me that it is currently running below the \"expected\" frame rate.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "deathblade200",
                                                    "body": "show me one person that uses a 30hz screen anymore. if 30FPS was intended then we would just use 30Hz. if 60FPS wasn't intended then do tell why we use 60Hz screens as the minimum.",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "author": "Balikye",
                                                            "body": "I use 50hz.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "deathblade200",
                                                                    "body": "50Hz monitor is very uncommon and bad for gaming.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "hayt88",
                                                            "body": "well a) I think the refresh rate of the monitor is unrelated to fps and you just made that connection up. But just benefit of the doubt so B: when were 30hz monitors a mainstream thing? CRTs could do more and afaik monitors after that were always 60, probably some had 50 depending on region, but the 30fps = 30hz monitor correlation is made up.\n\nYou still claimed that it is the bare miminum. Not \"for you\" but the general bare minumum. If you make such claims, you are better prepared to back that up and not by some correlation, without even proving the causation here.\n\nAnd I personally have games I prefer to limit at below 60 fps, because they don't need more and I rather safe the power.\n\nAlso this steam group would not exist, if 60 fps was the official \"Bare minimum\" for  recognized by the all the game devs: [https://steamcommunity.com/groups/frameratepolice](https://steamcommunity.com/groups/frameratepolice)\n\n60 as minimum would be nice sure. but that also depends on the hardware. Nobody will sit there and think \"oh gosh my games run at 55 fps instead of 60, It's not in the official \"bare minimum\" specs anymore I am not allowed to play that game and need to buy new hardware\".\n\nI really hope you realize what you are saying when you make a statement that 60 fps is the bare minimum and not just for you.\n\nYou really need to come up with something better here than \"30 hz monitors\" if you want to make any claim that this is not just your subjective benchmark here.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "jamieh800",
                                            "body": "Doesn't this depend entirely on the game though? Like, an indie turn based game with retro graphics wouldn't have much difference between 30 and 60 fps. A Visual Novel could run at 15 fps and you'd barely notice. Really, the only games where 30 fps impacts the gaming experience to an appreciable extent is in new, triple A action games. And even then... only sometimes? Idk, maybe I'm just not that picky, but I barely see a difference in experience when playing something at 30-45 fps and 60 fps. It's a little smoother looking, but that's kinda it. It's like the difference between a medium rare and a medium steak, but some of yall act like it's the difference between a medium rare steak and one that's so overcooked you need to chew for half an hour to get through a single bite. And it's not.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "deathblade200",
                                                    "body": ">Doesn't this depend entirely on the game though? Like, an indie turn based game with retro graphics wouldn't have much difference between 30 and 60 fps.\n\nyou can very much see the difference. this comparison is always based on reaction time instead of actual appearance. the animations look worse at 30fps.\n\n>A Visual Novel could run at 15 fps and you'd barely notice. \n\nI don't care about them but you would be able to notice 30fps in any animations that happen though nobody would care when it comes to that kind of game\n\n30FPs feels slow motion and jumpy compared to 60FPS it looks massively different.",
                                                    "score": 9,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Ok_Dragonfruit_8102",
                    "body": "I got screwed over by this recently.  Bought a 1tb OLED model mainly for emulation after being inspired by countless youtube videos talking about flawless emulation performance, only to find out Gran Turismo 4 runs like shit and even 3DS games stutter.  They say you can always tweak settings to improve performance, but then that means running at internal resolutions that I'm not satisfied with.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "deathblade200",
                            "body": "when it comes to 3DS don't use OpenGL and when you do use Vulkan it will stutter the first time it sees something new but it will be saved in the shader cache so after awhile you shouldn't see anymore stutters in games. outside of shaders 3DS games should run perfectly. as for PS2 emulation I haven't played that specific game but typically bad performance is due to blending accuracy being set too high which is extremely demanding.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "GMBethernal",
                            "body": "Get an ally, sounds like you wouldn't mind the battery thing (I didn't either, I just wanted the performance)",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "flashmob321",
                    "body": "Got this issue with doom 2016 it runs stable 30fps but the way they all made it sound was like it'd run 60fps non stop very disappointed lol",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "plzdontbmean2me",
                    "body": "I use it play old games on a big ass tv (among other things), it’s genuinely ideal for what I use it for. \n\nThat being said it isn’t perfect by any means. I love mine and it is awesome, but just blindly saying it’s great for everything (especially AAA games) just hurts the credibility of fans overall",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "MoneyMakingMugi",
                    "body": "And the same is true for the other side. The number of times I've seen people on this sub say a game is unplayable because it doesn't run the way they want it to run is just as annoying.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "reddit_sells_you",
                    "body": "On the other end of the spectrum, people insist that if a game doesn't run at 60FPS on this 7.4 inch screen, it's unplayable.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Swirly_Eyes",
                            "body": "What does the size of the screen have to do with frame rate exactly? Your logic ain't making sense.\n\n99% of the games released for the GB-GBA ran at 60fps. By your logic, that shouldn't happen because those screens are less than 3 inches wide 🙄",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "reddit_sells_you",
                                    "body": "Because on a smaller screen it is less noticeable?\n\nBecause on a smaller screen, RDR2 running at 30 FPS and it running at 60 FPS makes  no difference?\n\nBut hey, I understand . . . You need FPS to validate your gamer cred.  It's ok.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "Swirly_Eyes",
                                            "body": "Lmao, you're not making any sense. By your logic, the OLED Deck running at 90hz is indistinguable from the LCD model running at 60hz. Heck, I bet you're going to tell me a game running at 30fps on the OLED Switch's 7 inch screen is unnoticeable when running at 90fps on the OLED Deck.\n\nEven better, my phone is smaller than all of those and runs at 120hz. I'd wager you're probably blind if you have trouble seeing this in motion.\n\nBut honestly, this whole thing sounds like a weird cope. I hope you get it sorted out eventually.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "aperturedream",
            "body": "What people are you running into in this sub that think the deck verification system is worth anything",
            "score": 41,
            "replies": [
                {
                    "author": "aceshades",
                    "body": "It’s not? I still use it a lot as a first data point",
                    "score": 13,
                    "replies": [
                        {
                            "author": "aperturedream",
                            "body": "It's not totally worthless, but ProtonDB is a lot more reliable. Thankfully, it's actually a lot more often you'll find an Unsupported game that plays great rather than a Verified game with issues, though there are exceptions i.e. BG3, Spider-Man 2. Though even then I did get through BG3 just fine, though I'd say Act III pushes it well into \"playable\"...",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Perfect_Track_3647",
                            "body": "It’s not reliable in terms of how the game might actually perform. Many games are marked unsupported due solely to a multiplayer aspect being unsupported, no matter how inconsequential (i.e. Ghost of Tsushima). On the flip side, there are quite a few games that are marked as verified that run poorly without multiple mods or tweaks. ProtonDB should be the standard you use when deciding what games to purchase for SD play.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "rNBA_Mods_Be_Better",
                    "body": "I've been subbed here for years and I don't think I've ever seen a conversation like this, let alone \"this is what this entire subreddit is\"",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Ancient-Carry-4796",
                            "body": "Ikr. This sub is the opposite. Most posts I see here are people talking about how 30 FPS is playable or that “the amount of 60FPS snobs are overrepresented”. Sure if it’s a turn based game. I’m not about to play any first person shooters on anything below 45.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SynthBeta",
                    "body": "It seems to be GTA 5. \"If you can't play online, it shouldn't be verified\" except the verification is about how the game runs. The inability to play online isn't due to the hardware, it's due to the implementation of DRM.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SnooRecipes1114",
                            "body": "And it's not even verified either, it's just got the playable badge.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "dsmiles",
            "body": "![gif](giphy|IDGNYvFLkJKLK)",
            "score": 141,
            "replies": [
                {
                    "author": "SproutsLucky",
                    "body": "The post is just cope tbh, as someone without a gaming pc",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "rayshmayshmay",
                    "body": "OP:\n\nhttps://preview.redd.it/xzlcdhsilhpe1.jpeg?width=1170&format=pjpg&auto=webp&s=1df9c86ad84a7a9059e76e2e162a299e5143a88d",
                    "score": 10,
                    "replies": [
                        {
                            "author": "HEY_YOU_GUUUUUUYS",
                            "body": "Lil Kev!",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "strooiersunion",
                    "body": "Anytime somebody uses this meme format im convinced it's 100% bait",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "R4wden",
                    "body": "![gif](giphy|njPdRtrrdyoVO)",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "BillCipherTrianglMan",
            "body": "\"Criticism of any kind.\"\n\nResponse: this meme.",
            "score": 247,
            "replies": [
                {
                    "author": "YobaiYamete",
                    "body": "This meme has been a plague to The Gaming Community since it was made. It's literally only ever used by salty Fanboys and nothing else",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "DripRoast",
                    "body": "I'm not a fan of this meme. The implication that the salty dissenter is trying to ruin the fun of others is not accurate. Why would he even care? It is just as likely that he has been burned in the past by the dubious claims those apparently \"having fun\" and is simply trying to warn others that the fun to be had might not be up to normal human standards. This seems reasonable to me.",
                    "score": 52,
                    "replies": [
                        {
                            "author": "Jer_Sg",
                            "body": "Really has the classic vibe of \"i depicted myself as the chad and you as the wojack\"\n\nFor example try saying anything remotely negative in the mh sub about wilds, runs bad, looks blurry, the game is objectively easier or the game lacks content and you get hit with this kind of attitude.\n\nI dont want to ruin anyones damn fun, i just want my feedback to be heard",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "dsmiles",
                                    "body": ">I dont want to ruin anyones damn fun, i just want my feedback to be heard\n\nCompletely agree. 99.9% of people on the internet aren't trying to ruin anybody's fun. Of course there are always a few assholes out there, but most people are just discussing their opinions. The problem is that so many people view any sort of differing opinion as a personal attack these days, and it's *exhausting.*",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Dystharia",
                            "body": "There are a lot people that unnecessarily care about such things. Just read the comments on that post.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Vox_R",
                            "body": "You had the right sentiment right up to \"normal human standards\".",
                            "score": -4,
                            "replies": []
                        },
                        {
                            "author": "punk_petukh",
                            "body": "Like you have the power to decide what \"normal human standards\" are... We're not talking about sanitary conditions, food safety, basic accommodations etc... It's just a bunch of pictures changing on the screen",
                            "score": -2,
                            "replies": []
                        },
                        {
                            "author": "137-451",
                            "body": "Look, it's the guy from the meme!",
                            "score": -2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PaleontologistWest47",
                    "body": "True and real",
                    "score": 21,
                    "replies": [
                        {
                            "author": "checkpoint_hero",
                            "body": "The upvote button exists for a reason",
                            "score": -54,
                            "replies": [
                                {
                                    "author": "linderlake",
                                    "body": "So does the downvote button! Get him, fellas",
                                    "score": 38,
                                    "replies": [
                                        {
                                            "author": "Miserable-Potato7706",
                                            "body": "https://preview.redd.it/mcrz625sbhpe1.jpeg?width=1125&format=pjpg&auto=webp&s=a06c7dfc4705548ba05ecdd1e0116474fda22352",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "checkpoint_hero",
                                            "body": "I knew what I opened myself up to 🤣, I just can't stand replies that consist of \"this\"",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -9,
                    "replies": [
                        {
                            "author": "deathblade200",
                            "body": "people on here hate to live in reality. if you try to have a conversation about how a game truly runs people get insanely pissy, 30FPS is not good performance even if you like it and people are allowed to call it out. people on here rather stifle any conversation though and get into cock swinging matches.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "NamiRocket",
                                    "body": "Corny.",
                                    "score": 0,
                                    "replies": []
                                },
                                {
                                    "author": "SnooRecipes1114",
                                    "body": "30fps is completely fine as long as it's stable, especially for something like the steam deck.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Reiver_Neriah",
                                            "body": "Wilds is far from stable 30",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "SnooRecipes1114",
                                                    "body": "Okay? Did I say anything about wilds?",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "Reiver_Neriah",
                                                            "body": "Literally what the OP is about",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "SnooRecipes1114",
                                                                    "body": "I am replying to the person who is talking about 30fps not being good performance. Nothing about mh wilds\n\nWhat bozos are downvoting this, explain lol",
                                                                    "score": -1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "RunningGargle",
            "body": "If a game doesn't run natively on a steam deck then I try and tweak the shit out of it. If that doesn't work then I stream from my PC using Moonlight/Sunshine. Hell, I mostly just stream from my PC since I mostly game at home.",
            "score": 25,
            "replies": [
                {
                    "author": "Noonites",
                    "body": "My Deck is used for two things: games that run great on the Deck for when I'm out and about, and streaming games like The Plucky Squire that I want to play on my couch.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "lemonylol",
                    "body": "I do this with my tablet",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Superb_Country_",
            "body": "No the issue is people claiming 'x' game runs great, when in reality it runs terribly, giving others false hope.",
            "score": 68,
            "replies": [
                {
                    "author": "maijami",
                    "body": "Saw that with Alan Wake 2. Someone was claiming it runs 30 fps and posted a video of a scene where absolutely nothing was happening the they were looking out into a lake so almost nothing was being rendered",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Elarisbee",
                    "body": "Exactly.\n\nPeople keep trying to reframe this, but the issue - as you rightly pointed out - is people having to spend €70 based on game review from a fan site which turns out to be complete bull.\n\n“It runs great. 40fps…please don’t notice that I’m not moving in this empty dark space…60fps in the menus!”",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "SproutsLucky",
                    "body": "This happened to me with far cry 5, people said it ran perfectly on the deck. It looks like shit and just manages 45 fps after a ton of tinkering and I still get a ton of frame drops during some moments. And some vehicle controls do not work. \nFun game though",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "cryptofreddd",
                    "body": "That happened to me with Helldivers 2. It runs well but looks awful.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Reiver_Neriah",
                            "body": "Eh but there I can actually see people playing. HD2 runs way better in comparison",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "CollieDaly",
            "body": "The people on the couches should be saying 'rock solid 60fps frame rate' while the screen shows a sub 30 counter.",
            "score": 52,
            "replies": [
                {
                    "author": "Inclinedbenchpress",
                    "body": "With frame gen on",
                    "score": 16,
                    "replies": [
                        {
                            "author": "GMBethernal",
                            "body": "And FSR Ultra Performance",
                            "score": 11,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "_byrnes_",
            "body": "Not even, unless you're sitting in NEW all day. This sub in a nutshell would be \"look my new perfect gf I take everywhere\" \\*Steam Deck pic in location\\*. And then a bunch of posts trying to convince us Steam Deck is better than anything else ever, don't ever buy another console ever Steam Deck is the best.",
            "score": 6,
            "replies": [
                {
                    "author": "Elarisbee",
                    "body": "Hey now, just because the Deck can’t cure cancer yet, doesn’t mean Valve’s not planning it in a future firmware update.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "gizmoglitch",
            "body": "For console players that are using Steam Deck as a gateway to PC gaming, it's perfect and they don't really obsess about FPS, lol.",
            "score": 63,
            "replies": [
                {
                    "author": "max13007",
                    "body": "I have a buddy who has only ever really played games on Nintendo hand-helds. They recently took the plunge on a Steamdeck and while we were chatting about it I mentioned how some games don't run all that well. He basically said that had never even crossed his mind. \n\nNow, are some games so poorly optimized or so graphically demanding that even he would notice? Sure. But I think the key is that for many, Steamdecks are what gets them into the PC gaming space for the first time, and those folks often care way less, if at all, about FPS and optimization. As long as a game runs well enough to experience it, they'll have a good time.",
                    "score": 47,
                    "replies": [
                        {
                            "author": "artemus_who",
                            "body": "I'm the same way. My whole life I've played mostly Nintendo. Steam Deck was mind blowing and only on a few occasions have I REALLY noticed something running poorly.",
                            "score": 18,
                            "replies": []
                        },
                        {
                            "author": "jawnisrad",
                            "body": "This absolutely. I experienced Pokémon Scarlet on Switch, so I can handle low FPS lol",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "mr_chub",
                                    "body": "Its best to play that game all the way through with no breaks because once you leave and come back, it truly looks and feels like dogshit",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "jawnisrad",
                                            "body": "Yep. I played through the main storyline (even the post-game) in a couple months and haven't been back other than for a couple raids. Haven't even bought the dlc for it.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Atimes2",
                            "body": "Can confirm, as a new steamdeck owner. Having an absolute blast with it.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "tyrenanig",
                            "body": "I already have a PC, and even then I’m impressed by the Steamdeck. It can play most of what I want, which are mostly PS4 gen games, at an acceptable performance, sometimes exceeding my expectations even.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "cnio14",
                    "body": "That's because they never experienced 60+ fps bliss",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "IsenMike",
                    "body": "I've been a PC gamer for decades.  I cannot remember the last time I turned on the performance overlay on my Deck, or looked at any kind of FPS counter on my desktop.\n\nPC gamers *on Reddit* seem to think that obsessing about FPS and technical performance is universal for all of us.\n\nIt really isn't.\n\nIf a game is hitching in a way that detracts from my experience, I'll lower some settings to get it smoother.  But I'm convinced that obsessing over that FPS number is making games less enjoyable for the folks who do it.  \n\nLike, I know that folks complain they can notice every time their games dip below 60, and are distracted by it.  And I believe them; but in all likelihood it seems to me like they've probably *trained themselves into that situation* by focusing on the FPS counter, instead of just using their own subjective experience of whether the game is enjoyable to play.\n\nIf you aren't playing a high-twitch fast-reaction-time competitive game, there's just no need to obsess over FPS.  Yeah 60 might look a bit smoother than 45, which looks smoother than 30, when you compare footage side-by-side; but if you're actually focused on playing and enjoying the game, I just can't imagine why those differences would matter unless you've actively trained yourself to spot them and be bothered by them.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Merciless972",
            "body": "I get to play it on a airplane",
            "score": 28,
            "replies": []
        },
        {
            "author": "K-Shrizzle",
            "body": "Anyone is welcome to play a game at potato performance if they would like. I don't really get it, but you do you. \n\nThe problem is when people post here saying \"it runs great!!!\" when it very clearly doesn't. You're potentially influencing others to buy a game that they think runs well on their Deck. You need to specify that your definition of \"great\" is, to the rest of us, doo doo unacceptable performance. I don't play games at 30 FPS in the year 2025.",
            "score": 57,
            "replies": [
                {
                    "author": "SkullDox",
                    "body": "Exactly this. It's how I feel about Monster Hunters Wilds on the deck. I really wanted to enjoy it but some places (like the big yellow plains) it's a slideshow. Some folks have a greater tolerance for that but I wouldn't recommend it.\n\nLet people play what they want but also don't lie if it doesn't run well either.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "battlerumdam",
                    "body": "I almost bought Dragon Ball Sparking Zero because this sub kept claiming it runs perfectly fine - the games engine literally breaks below 60 fps and turns into slowmotion.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "UrsaMajor920",
                    "body": "Everyone's got a different use case. My Steam Deck is my main system, dont own a $2K+ gaming rig, gotta work with what I got.\n\nSometimes I wonder why y'all PC master race elitist types even bother with the deck,  I'd hardly use mine if I had a computer like yours.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "K-Shrizzle",
                            "body": "Honestly I love my Steam Deck but I wouldn't use it to play these big games. Some of them do run pretty well on it, like I've heard good things about Cyberpunk and God of War Ragnarok. But you're right, I don't play them on my deck because I have the option to play them on my PC. \n\nTruthfully, I don't think the Deck should be your main system. It's understandable to not be able to have a PC, but even just an Xbox Series S would run these big games much better than the Deck would. \n\nMy Deck is mainly for being able to play the indie games I love, but on the go. There is absolutely something to be said for playing a smaller game on a system that is overqualified for it. I was playing Hollow Knight on my Deck and was blown away by how much better it looked in OLED 90 FPS than it had looked on my Switch.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "paperjin",
                    "body": "the problem is \"it runs great!\" is subjective and people take it as a green light to buy it",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Inevitable_Try577",
                    "body": "“I don’t play games at 30 fps in the year 2025” sounds so silly 💀",
                    "score": -11,
                    "replies": [
                        {
                            "author": "K-Shrizzle",
                            "body": "No it doesn't, and I'll say it again. I dont play games at 30 FPS in the year 2025. I didn't in 2024, either.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "Ok_Dragonfruit_8102",
                            "body": "It seems silly to me that you *are* still playing games at 30fps.  On my PC I play most games at 180fps.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Inevitable_Try577",
                                    "body": "keyword: PC. We are talking about the steam deck smart one",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "author": "GMBethernal",
                                            "body": "I rather go play something on mobile if my Ally can't get to 60 fps at minimum on 720p (BARE MINIMUM)",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "Ok_Dragonfruit_8102",
                                            "body": "Damn my comment really upset you huh?",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Inevitable_Try577",
                                                    "body": "Yes it did 😔☝🏽",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "NaturalSelecty",
                            "body": "No it doesn’t. Lmao.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "conte360",
                            "body": "I'll bet you're the kind of person that thinks the human eye can't see above 30 frames per second",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "Inevitable_Try577",
                                    "body": "Omg am I!? 😟",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "SnooRecipes1114",
                                    "body": "Or maybe they just think that 30fps is still completely fine, are y'all forgetting the switch? Like 90% of it's games run at 30fps with dips and only has the biggest user base of nearly any console with players that love gaming on it.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "conte360",
                                            "body": "The switch was an underpowered console when it was released 8 years ago and its constantly referenced as a console that can run its own games well. What claim are you trying to make with that? You can see my other comments where i said enjoy what you want, but dont come in and tell people things run well when they dont go above 30fps. Thats not running well, even if you enjoy it.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "SnooRecipes1114",
                                                    "body": "The switch can hardly run its own games well, all the Zelda games dip below 30 at times and the Pokémon games barely hit 30. The flagship Kirby is 30 too. Only a few Mario games and some remasters/ports really hit 60. The point is the majority of console gamers don't give a f if a game is 30fps and will enjoy it anyway. 30fps is completely fine for the average gamer. I understand on pc with a mouse 30fps feels especially worse, with a controller it is far more acceptable.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "conte360",
                                                            "body": ">The point is\n\nThis is the main thing you are wrong about. The original comment we are talking about is talking about how it's fine to enjoy that. But that doesn't mean it runs well. Running well and being able to enjoy things are different things. And these don't run well.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "SnooRecipes1114",
                                                                    "body": "I don't think I am wrong and I entirely disagree with this, it was a standard for the majority of many console generations and is very obviously considered running well for the majority of regular gamers. Obviously a higher FPS is better but a stable 30fps is running well and very playable. The switch audience as well as all these other console gens say so too.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "conte360",
                                                                            "body": "Running well and running acceptably are 2 different things. It's that simple",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "sgeep",
                    "body": "> I don't play games at 30 FPS in the year 2025.\n\nWell, if you plan on playing modern AAA games, then the Steam Deck is not the gaming device for you\n\nAnd most people saying \"it runs great\" are assuming there's a base level of intelligence that people assume they mean \"it runs great for the Steam Deck\" and aren't objectively comparing the Steam Deck performance to a gaming rig with a 4090",
                    "score": -7,
                    "replies": [
                        {
                            "author": "K-Shrizzle",
                            "body": "No, that is not assumed at all",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "sgeep",
                                    "body": "Well, as this is a Steam Deck sub and we talk about how games perform on the Steam Deck, it makes sense that we can assume we're talking about Steam Deck performance and not comparing a tiny handheld gaming device to a $5,000+ desktop gaming rig",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "conte360",
                                            "body": "You are the one creating the other side of this argument at $5,000 for the PC. Yes when somebody says it runs great in this subreddit we do know that they're talking about on the steam deck but running great does not equal 30 frames per second or less at medium to low settings or equivalent. If you genuinely don't see the issue and people just blindly saying that things run right on the steam deck when they objectively don't then you are part of the problem",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "K-Shrizzle",
                                            "body": "We are talking about when people say \"it runs great\" (referring to their steam deck) and it absolutely does not run well at all. Nobody is talking about desktop PCs here.  So I'm not sure what your argument is.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "sgeep",
                                                    "body": "The argument is people saying \"it runs great\" are assuming people on *the Steam Deck sub on threads about how the game runs on the Steam Deck* are speaking in terms relative to the Steam Deck. Obviously a massive gaming rig is going to run it better\n\nIn that sense, someone saying anything \"runs great\" will always be met with someone else saying \"HA! My PC gets 4x the performance! It runs like shit!\"\n\nAll that said, obviously just saying something \"runs great\" is a shitty measure of performance. It's entirely subjective and doesn't really mean anything. But the \"Actually...\" crowd always seems to come out in full force anytime someone dares suggest something runs well on the Deck. It's just as annoying to me",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Inevitable_Try577",
                                                    "body": "And there is no way you think the steam deck should still be able to achieve 60 stable fps on new modern triple A games? 💀",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "K-Shrizzle",
                                                            "body": "Yeah, some of them it does well. I still prefer the \"big game, big PC\" myself but games like God of War Ragnarok or Cyberpunk or Ghost of Tsushima run really well on Deck. I'll never play them there, but that's because I have the PC for that purpose",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "forbiddenvoid",
                    "body": "No one \"needs\" to do anything. If you're running out to buy a game for your steam deck based on a random Reddit comment, that's on you, my friend.",
                    "score": -16,
                    "replies": [
                        {
                            "author": "K-Shrizzle",
                            "body": "Oh my god, it's almost like we just shouldn't have the subreddit. If people are gonna put up these useless \"it runs great!!!\" posts but nobody holds them accountable for proving what they mean by great, then why does the post exist? Just to spread misinformation?",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "MDPROBIFE",
                            "body": "Ohh yes, everyone should do a deep peer reviewed analysis before they buy games!",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "ThisLazyLion",
                                    "body": "No, but they should do their due diligence when purchasing anything. Which should include reviews and opinions from multiple sources.",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "SnooRecipes1114",
                                    "body": "Well yea really for something like the steam deck you should definitely look into the game a bit more before buying it instead of relying on a random redditor",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "battlerumdam",
                            "body": "So I just should pretend everyone here lies about games to begin with?",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "reddit_sells_you",
                    "body": "Yes, it is super important that a non twitch game on a 7.4 inch screen runs at 60FPS.\n\n/s",
                    "score": -3,
                    "replies": []
                },
                {
                    "author": "K-Shrizzle",
                    "body": "What is a non twitch game? A game not being streamed on twitch? That's not relevant, neither is the size of the screen.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "reddit_sells_you",
                    "body": "Games that require very quick reflexes to play, often competitively.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "aperturedream",
                    "body": "Then just say non-competitive lol",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "reddit_sells_you",
                    "body": "Sorry, I'm a geezer. The term has been around far longer than Twitch or you, likely.\n\nhttps://en.m.wikipedia.org/wiki/Twitch_gameplay\n\nFurthermore, I'm sure there are competitive games that don't rely on high reflex where FPS doesn't necessarily matter and one could play competitively with 30 FPS.\n\nBut then most of the people I'm arguing with here are PCMRs who only care about FPS and nothing else.  SpiritFarer MUST run at 60FPS!!!  Baulder's Gate 3 must run at 60 FPS!!!!!  Stardew Valley must run at 60 FPS!!!!",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "aperturedream",
                    "body": "Well being in my mid-30s I was ready to argue that but having read the wiki you aren't wrong! Learned something today",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "othelloisblack",
            "body": "[quit having fun mfers when I show them how i downloaded more RAM to my steam deck to make my games run better](https://youtu.be/C9EjXYZUqUs?si=xdfJZe-hwK9oeEOU)\n\nhttps://preview.redd.it/an4nqf4hfhpe1.jpeg?width=1179&format=pjpg&auto=webp&s=9d7451fb6c129cea9d8bddbfe4071cb8b3765a07",
            "score": 6,
            "replies": []
        },
        {
            "author": "SplendidPunkinButter",
            "body": "I want to post this next week",
            "score": 8,
            "replies": [
                {
                    "author": "Ok_Dragonfruit_8102",
                    "body": "What's happening next week?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dull_Half_6107",
            "body": "The issue is people giving false hope and even sometimes lying at how “well” they can run modern games on Steam Deck.",
            "score": 7,
            "replies": []
        },
        {
            "author": "AdditionInteresting2",
            "body": "Getting ff7 rebirth and monster hunter wilds playing on the deck is already a small miracle. I dont mind playing in 30 fps if it means I get to play them wherever I go. Overclocking and undervolting made such a difference. Then a few preset configs from nexusmods for the deck and its all good.\n\nA friend of mine tried going from his beefy desktop to his 3060 laptop and he couldnt stomach playing Wilds on it. So now he's on vacation not playing Wilds at all. Just find your own fun I guess. Forget the haters.",
            "score": 6,
            "replies": []
        },
        {
            "author": "personahorrible",
            "body": "I just posted about how RoboCop: Rogue City runs on my Steam Deck and it got me thinking about this post and the never ending argument over what constitutes \"good\" performance on the Steam Deck. \n\nI tried to be as detailed as I could: What settings I used, the lowest FPS dip I saw as well as the average range and what upscaling artifacts I noticed using XeSS. \n\nWhile it would be useful if everyone could do the same when talking about performance, I think it's kind of insane to dogpile on posters for saying \"this game runs great!\" Some people are just genuinely excited to be able to play new games on their Steam Deck, even with compromises. Not everyone is going to open up a game and provide detailed benchmark data every time they talk about a game. \n\nAnd the argument that \"people buy their games based on other people's feedback\" doesn't hold water for me. If you have doubts about a game's performance, you should be looking at ProtonDB, SteamDeckHQ, YouTube performance videos, etc. \n\nIf you rushed out and bought a game based on a reddit comment and it didn't live up to your expectations, well, that's why the 2 hour refund window exists.",
            "score": 8,
            "replies": [
                {
                    "author": "Lerosh_Falcon",
                    "body": "I agree 100%. Btw, playing Robocop rn. I have the strange flickering of puddle textures when I move the camera. Have you encountered this graphical glitch?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Franz_Thieppel",
            "body": "The argument is that by accepting crap like framegen and upscaling you're conditioning the market for the foreseeable future. If you accept it today you won't have a choice tomorrow. You're screwing us players who can notice input lag and a blurry screen as well as yourselves.",
            "score": 29,
            "replies": [
                {
                    "author": "qchto",
                    "body": "I never said framegen though, just FSR upscaling.  \nAnd I can agree with that, in my experience I agree that framegen is not ideal in the Deck (mostly because of RAM usage, in most games when the 16gb threshold is surpassed, framegen fails because the Deck uses swap memory, which makes the loading times slower and drops a whole lot more frames than what it generates).",
                    "score": -21,
                    "replies": [
                        {
                            "author": "FairEngineering2469",
                            "body": "That's actually not the main issue. Framegen needs at least 60 raw  frames to increase smoothness without you still feeling the lag of a 20fps game.",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "MDPROBIFE",
                                    "body": "I think you can easily get used to it if what you see is smooth...\n(Depending on the game ofc)\nBut for example, some games have a weighted movement, where it slows down direction changes, this is basically what I believe it feels like to play with framegen (haven't played a 20fps games with it, nor do I want to). But I believe for people not very picky it could be adjusted as you adjust to different types of games",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Franz_Thieppel",
                            "body": "No, the problem is the technology by its very nature creates input lag. This wouldn't be such a big issue if it weren't for the fact that input lag is already pretty bad across the board in modern games (look at the Deck's built-in frame limiter, and a lot of people tolerate even that). They should already be working on drastically lowering it and instead they're making it worse.\n\nI absolutely champion people trying to find ways to play their games on Steam Deck that shouldn't run on it, it lets developers know there is a market, but all these \"optimization\" should be seen as the crutch they are and not accepted as good in place of real optimization.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Luxamongus",
            "body": "Me using my steam deck as a nubbys number factory machine: uhhh",
            "score": 3,
            "replies": [
                {
                    "author": "nebber3",
                    "body": "This is the way.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Inevitable_Try577",
            "body": "Idk why people think most new games well run an average of 60 fps and up nowadays 🧍🏽",
            "score": 3,
            "replies": [
                {
                    "author": "str9_b",
                    "body": "Most of the time it’s because people exaggerate how well the deck runs modern games. I wouldn’t call an extremely blurry game or one with an inconsistent frame rate a game that runs flawlessly.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "TacoSpacePirate",
            "body": "What does the deck verification badge have to do with anything?",
            "score": 3,
            "replies": []
        },
        {
            "author": "elsDodo",
            "body": "Me when I'm playing Elden Ring in Switch quality on my TV",
            "score": 3,
            "replies": []
        },
        {
            "author": "TheWeebMemeist",
            "body": "I'm so used to playing on crappy machines that any game that's non competitive I can play at 30 fps and enjoy the hell out of it",
            "score": 3,
            "replies": []
        },
        {
            "author": "Antogames97",
            "body": "FPS doesn't really matter for me as long it's not 1 FPS",
            "score": 3,
            "replies": []
        },
        {
            "author": "TheMailman36928",
            "body": "If you get a Steam deck for modern AAA games, you didn't do enough research before buying. You don't get a Steam Deck to play modern AAAs at 60fps. You get it to play whatever the fuck it can play in a nice, comfortable, handheld form factor.\n\nAnd also for emulation. So much emulation. Yarrr 🏴‍☠️",
            "score": 3,
            "replies": []
        },
        {
            "author": "Hukama",
            "body": "even sub 30fps is fine as long as it's stable",
            "score": 3,
            "replies": []
        },
        {
            "author": "Analyst_Lost",
            "body": "also when someone says to just stream from pc like... this is my pc 😭 i only had a surface laptop before this",
            "score": 5,
            "replies": []
        },
        {
            "author": "Schnitzelfighter",
            "body": "I saw someone on youtube say that the original gta5 is \"unplayable and the input lag is the worst\". I almost always hot 60fps and never had any input lag",
            "score": 5,
            "replies": [
                {
                    "author": "Legitimate-Muscle152",
                    "body": "Could be a old review the deck in its early release days was a unstable piece of crap lol it had really bad quality control my first steam deck I returned had extremely horrible backlight bleed",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Bitter_Lab_475",
            "body": "I always laugh when people say \"Cyberpunk 2077 is unplayable in the Steam Deck at 39-45 FPS\".\n\nLike dude, I played Crysis at 28 FPS and finished because I didn't have money, this is still more than playable for me.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Fit-Organization1858",
            "body": "Honestly it’s more about the posts that say “The game runs like butter!!” Then you click the post and the user says “you get a stable 40 fps on low-medium”. okay. Idk, I’m not an FPS snob because I was able to get through BoTW on its 30 FPS wothout caring at all, but we gotta hold the steam deck and the games it has to a different standard. I like getting 70-90 fps on the 90 refresh rate screen",
            "score": 8,
            "replies": []
        },
        {
            "author": "Accomplished_Run9449",
            "body": "That's because steam deck is for pc gamers or a way for console gamers to move to pc gaming. Pc gaming is not just 4090 and 4080 users. Some people are OK even if their games are barely running and others have some demands to consider a game playable.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Justmejtcz8",
            "body": "I think I'd draw that line of unplayable when the deck can't do more than 20fps. \n\n\n\n\n\nMy helldivers 2 runs just fine at 12 fps at the worst case scenarios btw..",
            "score": 3,
            "replies": []
        },
        {
            "author": "battlerumdam",
            "body": "Oh look, r/Steamdeck trying to defend its performance lies again.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Gaylittlebrother",
            "body": "People who bought a deck for Stardew valley 🙋RISE UP",
            "score": 2,
            "replies": []
        },
        {
            "author": "DeathscytheShell",
            "body": "Eh. I've run an HP Pavillion for five years that was barely able to run Crysis, if it plays halfway decent it's fine",
            "score": 2,
            "replies": []
        },
        {
            "author": "Th3Grimmi",
            "body": "The same as with the etched/gloss screen back when the Deck launched, where by simply stating that you dont see any issue with the etched screen (or even applying an etched protector) you'd be cast into reddits downvote hell",
            "score": 2,
            "replies": []
        },
        {
            "author": "KendrickBlack502",
            "body": "I’ve found that I start and finish a game on the Steam Deck, I never once think about graphics quality. However, if I start it on my PC and then pick it up on Steam Deck, I start to notice the differences.",
            "score": 2,
            "replies": []
        },
        {
            "author": "layeofthedead",
            "body": "pcmasterrace hurt itself in confusion!",
            "score": 2,
            "replies": []
        },
        {
            "author": "claudiocorona93",
            "body": "That's why you activate the ProtonDB plugin on Decky. Sometimes it says a game is Gold or Platinum while the verification says \"not compatible\".",
            "score": 2,
            "replies": []
        },
        {
            "author": "SpikedApe",
            "body": "I just couldn't im low key jalous but i've been spoiled for too long",
            "score": 2,
            "replies": []
        },
        {
            "author": "Giodude12",
            "body": "I installed a fuck ton of mods to get a semi stable 20fps frame gen'd to 40. It doesn't look great and there's a second of input lag but for a laggy game like monster Hunter it got me through a vacation away from my PC.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Spnwvr",
            "body": "I personally just don't see why you would  \ni dunno, I feel like my away from computer time shouldn't include more smaller gaming computer time",
            "score": 2,
            "replies": []
        },
        {
            "author": "FReeDuMB_or_DEATH",
            "body": "My brother in Christ if you can play a game at sub 30 frames a second in the good Lord's Year of 2025.\n\n\nCount yourself fucking goddamn lucky. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "stprnn",
            "body": "No you don't understand 40 fps is the new 60 fps.\n\nThis shit was said unironically and up voted in this sub.",
            "score": 2,
            "replies": []
        },
        {
            "author": "isucamper",
            "body": "i understand that we all hold pc to a higher standard, but for a console gamer sub 30 fps for a new release is not something unusual. at least historically. maybe that's less the case today, but look at ocarina of time, twisted metal, shadow of the colossus and the last guardian, red faction, star fox, gta 3\n\nthese are just off the top of my head. we all loved these games anyway",
            "score": 8,
            "replies": [
                {
                    "author": "gingegnere",
                    "body": "I agree, but that was 20 year ago.\nI'm not happy when a Switch game cannot hit 30fps, and I'm not happy when a Deck games doesn't.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "KobeJuanKenobi9",
            "body": "I think the issue is people are buying $100 games because this sub told them it would run well on their platform of choice. If you enjoy playing a new AAA game at 20fps that’s fine, but I feel like you should disclose that when you recommend it to other people \n\nI mostly played Starfield on my pc, but this sub was filled with people playing it at 15fps on deck claiming it was “more than playable”",
            "score": 3,
            "replies": [
                {
                    "author": "Balikye",
                    "body": "Y'know I tried it again recently and I dunno if they optimized it but I was managing to get 60FPS in town on medium. Used to be sub 20 no matter my settings. Still dips heavily any time something happens, though. (I.e. pirates show up and start shooting rockets n' stuff, sudden 40FPS)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Away_Chance_1841",
            "body": "OP has a point though lol, too many high expectations. Its a damn handheld not a PC or a console",
            "score": 8,
            "replies": [
                {
                    "author": "battlerumdam",
                    "body": "No OP doesn’t has a point, OP just downplays the biggest issue with this sub. Literally nobody ever cared if you in particular are enjoying a game at subpar performance, that’s just made up, but people care when you lie about performance.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Away_Chance_1841",
                            "body": "but isnt that just caring in the grand scheme of it all? Ive seen so many people rag on people who play AAA games at such a low framrate lol",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "battlerumdam",
                                    "body": "You see people rag on people claiming those AAA run great.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Away_Chance_1841",
                                            "body": "but why care about it? they think they run great 20-30 fps, they dont need the 120 fps that majority of people pray and beg for.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "battlerumdam",
                                                    "body": "Because they are literally spreading misinformation? Why is that fine for you?",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "Away_Chance_1841",
                                                            "body": "Why does it matter to you that people have their opinions😂 Like dude, its a video game not a life or death scenario",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "MarthMain42",
                                                                    "body": "If it's objectively wrong it's not an opinion. If you don't know the numbers just don't use them.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Away_Chance_1841",
                                                                            "body": "its unrealistic yeah to expect the steamdeck to run anymore than 25-30 fps for games like elden ring or monster hunter world. But my point is that good for someone who isnt worried about frame rate is 25-30, but for those like yourself require 60-90, ya know, the decks limit. I really don't understand why people get so upset about this stuff. kinda ridiculous....",
                                                                            "score": -1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "MarthMain42",
                                                                                    "body": "I don't actually expect or require 60-90. I do expect people to not fucking lie about how a game performs though.\n\nIf you are pulling out numbers, actually pull them from a frame counter. If it's fine for you it's for you and that's not an issue good, but don't spread misinformation.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Away_Chance_1841",
                                                                                            "body": "are you saying when people say it \"playable\" thats a lie? like genuinely",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "MarthMain42",
                                                                                                    "body": "\"playable\", no, that's subjective. Saying \"it runs at 60fps at high settings\" when it absolutely does not (running at 30 fps) then yes, that's misinformation.\n\n\"Running great\", also does not mean \"it can't reach a stable 30 fps at any setting\". You can be having a great time, but that's not the same thing.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Away_Chance_1841",
                                                                                                            "body": "oh my fucking god, \"objective\" this \"subjective\" that. Just fuckin buy the game, play the game, if it doesnt meet expectations, return the fuckin game. Max the fuckin thing, min the fuckin thing idgaf. Theres no right or wrong way to play the steamdeck.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "MarthMain42",
                                                                                                                    "body": "That's not helpful? Sometimes the game has a long lead in, or it doesn't *really* get intensive until a few hours in, past the refund period. \n\nI don't have any skin in the game for Baldur's Gate 3, I've not played it and it's not in a genre I care about, but Act 3's performance is significantly worse than everything before it. It's well known, and you are going to be WELL past the refund window before you get to that point, so maybe don't just say things that aren't true?\n\nNo one remotely reasonable is angry if you find 5 fps to be playable, but if you tell everyone \"hey this game is running great on the Deck\" then yeah, you are spreading misinformation.",
                                                                                                                    "score": 3,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Windows-XP-Home-NEW",
                                                                                                                            "body": "5 fps isn’t fucking playable it’s a laggy mess. This is a handheld PC. AAA games running at 30 FPS is fine and expected.",
                                                                                                                            "score": 2,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "MarthMain42",
                                                                                                                                    "body": "I agree that 5 FPS is awful, but hey if someone wants to play a game like that I do not give a fuck. I do have a problem if they say it runs well though.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Balikye",
                            "body": "That is 100% NOT made up. I have been downvoted into oblivion for simply stating I am playing games this sub don't like on the deck. (Such as playing Wilds.)",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "battlerumdam",
                                    "body": "It is made up. Nobody cares if you want to torture yourself.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Windows-XP-Home-NEW",
                                            "body": "It’s not torture though. Stop forcing your views on others.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SnooRecipes1114",
                            "body": "People here absolutely care when others are enjoying a game they cannot. I constantly see people here getting shit for enjoying games at 25-30fps, this sub is actually one of the most depressing and negative subs I browse. And the lying is hardly a thing and is so overblown. It is very toxic and hateful here at times just full of big babies.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Walnut156",
                    "body": "If I've learned anything with steam deck is have very low expectations",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Away_Chance_1841",
                            "body": "EXACTLY! Just play it how you want and don't judge lol I dont think there is a right or wrong way to use this thing",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SirenMix",
            "body": "Too many people here believe that everyone with a Deck must also have a high end computer or a PS5 on the side. They forget that lot of people just have a Deck and are ok with playing games on low graphics. The game might look like a psp game but guess what, it didn't stop us from playing psp games in the first place.",
            "score": 3,
            "replies": [
                {
                    "author": "ItsNotJusMe",
                    "body": "lmao really, I remember playing world on my 1050 laptop on lowest possible setting and lower resolution. \n\nYeah I get that when there is a post about monster hunter wilds having 30 fps with some dips and looks shit can be disappointing for someone, but for the others that just wants to play wilds can definitely relate to that post. It's not false hope, you just have a high fucking standard for gaming. It doesn't meet your expectation, guess what? Nobody gives a shit, let some people share their experience and those who care can give their opinion.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "sylinowo",
            "body": "Yall say wilds is playable and i just throw up in my mouth",
            "score": 7,
            "replies": []
        },
        {
            "author": "mlvisby",
            "body": "Yea, I hate gatekeepers. Let people enjoy what they want, even if it's not the best experience they could have.",
            "score": 4,
            "replies": [
                {
                    "author": "battlerumdam",
                    "body": "Literally nobody cares if you enjoy it, nobody, people start to care when you lie about performance.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "mlvisby",
                            "body": "Lying is different. I was stating the people here who talk about the sub-par performance they are getting with a game but they are still enjoying it, and the comments will flood in telling them they are wrong, they shouldn't play it that way etc. Let people play what they want on whatever device they want. Without bitching and moaning.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "battlerumdam",
                                    "body": "I never saw anyone saying *“I know the game runs bad but that’s fine for me!“* getting shit on, only those people claiming it runs great.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Magic-Griffin",
            "body": "I grew up on zx spectrum and Amiga... 30fps is more than enough 😂",
            "score": 3,
            "replies": []
        },
        {
            "author": "Z0idberg_MD",
            "body": "This is one of the few \"stop having fun\" memes where I identify as they guy yelling.",
            "score": 3,
            "replies": []
        },
        {
            "author": "FairEngineering2469",
            "body": "God of war Ragnarok deck players when you tell them the audio is broken:",
            "score": 2,
            "replies": []
        },
        {
            "author": "stardust-99",
            "body": "I love the 4 players on a couch playing on such a small screen 😂",
            "score": 2,
            "replies": [
                {
                    "author": "jorgejhms",
                    "body": "I used to play Goldeneye or Mario Kart on a 14 inches CRT TV (that was the average in those days). Playing on a 4 split on an flat 55 inches is massive to me.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "stardust-99",
                            "body": "Ah same here, but we used to sit on the floor 30 ft away from the screen 😂",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Jadey4455",
            "body": "Isnt FSR supposed to boost fps? Whenever i use it my fps tanks. It used to not be like that",
            "score": 2,
            "replies": [
                {
                    "author": "qchto",
                    "body": "Well, FSR is for upscaling. FSR3 provides a framegen tool, but I don't really recommend it on the Deck (in the cases I used it, RAM swap ended up making any gain too costly for the device to keep up).",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MongooseDirect2477",
            "body": "This used to be switch before steam deck. And boy, switch have one of the worst ported games. but it was the only portable console, at an affordable price. imagine they had 4 gbs of ram and somehow people played Witcher on the go.   \n\n\nSteam deck is a marvel in portable consoles, you can play absolutely any imaginable games with emudeck, even switch games. Not to mention almost every game till 2023 at least 40 fps. I feel like steam deck is like 10 years ahead of how the portable consoles developed in time.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Khalmoon",
            "body": "That’s fine, run at 20fps see if I care lmfao.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Domsdad666",
            "body": "To be honest I cannot tell the difference between 30 FPS and 60. I'm a senior gamer though.",
            "score": 2,
            "replies": [
                {
                    "author": "spore35",
                    "body": "better go for an eye check up and maybe stop inhaling copium daily then",
                    "score": -1,
                    "replies": [
                        {
                            "author": "Domsdad666",
                            "body": "mmmm. Sweet, sweet copium.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "crocodilepickle",
            "body": "A cyberpunk player made this",
            "score": 2,
            "replies": [
                {
                    "author": "SnooRecipes1114",
                    "body": "Really? Cyberpunk at high settings at a pretty solid 30fps is entirely possible, I played through the entire game just fine on the deck. People are able to get up to 40fps lowering some settings. It's more accurate to reference wilds really.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "crocodilepickle",
                            "body": "Tbh cyberpunk is one of those games that have extremely conflicting info on the performance so idk, I just said cyberpunk since it's the first graphically intense game I thought of",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Mizurazu",
            "body": "Shit meme. People don't have an issue with you playing at sub 30 fps. It's peolpe like you claiming it's \"playable\". While what's playable is subjective, there needs to be some baseline accurate data on the decks' capabilities, especially for newcomers.",
            "score": 2,
            "replies": [
                {
                    "author": "ItsNotJusMe",
                    "body": "The term playable is subjective, thats why people can use it based on their experience. Thats why when people post about a game they often include graphic settings, these are the facts. \n\nAll low setting, Fsr on, 30 fps, stuttering only when loading shader, and no to minimal input lag. Is my definition of playable. You will be surprised how many people are okay with this, and how many people are against this. \n\nYeah I can understand that the newcomers can be given false hope when they see these types of post, but if they already have gone here in the subreddit seeking for answers and ignoring the not playable badge on steam. Then you might as well expect that they have a similar standard with me. And these types of post can help them gather information if its up to their standard or not.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "r_GenericNameHere",
            "body": "As someone who used to play R6 siege at an average of 20-25 fps, I never understood the hate of lower frame rates. Like yeah 60+ is great, but 30 or less is playable in a lot of scenarios. 30s is completely fine for a LOT of games",
            "score": 2,
            "replies": [
                {
                    "author": "battlerumdam",
                    "body": "From all games you could choose from, you used a competitive sweat fps as an example for 20fps being fine?",
                    "score": 0,
                    "replies": [
                        {
                            "author": "r_GenericNameHere",
                            "body": "I’m just yea, a game that people would bitch about fps being low on, being playable (and I was decent highly ranked at the time) on 24fps. Was it a huge improvement moving to a computer that played it locked at 120fps? Of course. Was it playable, decent, and still fun at 24? Heck yeah\n\nAlso this is back when it came out, so much less competitive/sweaty back then, we played for fun.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "LolcatP",
            "body": "if you can tolerate bad fps keep it to yourself and don't preach that it's better then it is",
            "score": 1,
            "replies": [
                {
                    "author": "qchto",
                    "body": "Ok.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "LolcatP",
                            "body": "not being rude, it just sets up false expectations",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Inevitable_Try577",
                                    "body": "You’re using a deck running new games, what expectations?",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "LolcatP",
                                            "body": "just because a game is new doesn't mean it has to run bad",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "Windows-XP-Home-NEW",
                                                    "body": "What? New games often run at 30 fps on the Deck and that isn’t bad.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "LolcatP",
                                                            "body": "30 is wishful thinking with games like mh wilds",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Inevitable_Try577",
                                                    "body": "Just because a tripe a game comes out doesn’t mean it has to cater to the deck?",
                                                    "score": -3,
                                                    "replies": [
                                                        {
                                                            "author": "LolcatP",
                                                            "body": "catering to the deck isn't necessary by any means, the game just has to be scalable and well optimised. many new games use upscaling as a crutch for that which isn't a good dev practice. \n\nA bare minimum thing for example is aspect ratio support. many games need mods despite the fact every new gaming laptop is 16:10 like the deck screen.",
                                                            "score": 4,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "aperturedream",
                                                            "body": "Are you just making up opposing arguments so you have someone to fight with?",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "Windows-XP-Home-NEW",
                                                                    "body": "This is insane, no, he’s arguing a valid point.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "aperturedream",
                                                                            "body": "What?",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Windows-XP-Home-NEW",
                                                                                    "body": "Wdym what?",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "aperturedream",
                                                                                            "body": "I don’t understand what you’re saying, from your comments it seems like you agree with the people you’re replying to while thinking you’re disagreeing. What are you trying to agree with?",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "KTMman200",
            "body": "I play farming simulator 25 which is not rated for steam deck, and sims 4 which is not recommended.",
            "score": 1,
            "replies": []
        },
        {
            "author": "tydumpington",
            "body": "I did this with DB Sparking Zero. I take some games as a mission. How good can I get it to look while still getting a decent frame rate? Also the deck has so much that it can play, that I'm not too worried about whatever it can't.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TelephoneActive1539",
            "body": "Just turn off FSR and suck up the resolution.",
            "score": 1,
            "replies": [
                {
                    "author": "qchto",
                    "body": "Agreed about the resolution... 800x500 is an awesome alternative for both old and new games.   \nThe embedded FSR though is pretty decent for cases that allow to apply it (I played SH2 remaster @540p iirc, and it was a pretty good experience in terms of performance, presentation and battery life).",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "player_three33",
            "body": "I understand both sides here, but there's something to be said for wanting games to be better optimized for the steam deck. If Capcom looks at those steam deck numbers and says they don't have to spend any time optimizing their games, we're all worse off.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ryurain2",
            "body": "Me making it to lvl94 HCSSF in PoE 2 seeing everyone complain how unplayable it is. My first rip wasn't even til act 5 stupid glitched titan boss back than.",
            "score": 1,
            "replies": []
        },
        {
            "author": "spartan195",
            "body": "No one here ever relied on steam verification status lmao",
            "score": 1,
            "replies": []
        },
        {
            "author": "Eggbag4618",
            "body": "Cope post",
            "score": 1,
            "replies": []
        },
        {
            "author": "80cCecilia",
            "body": "If my Raspberry Pi 5 can boot up every game I've tested so far you can surely make the Steam Deck work.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ChuggsTheBrewGod",
            "body": "It's fine if you want to play a game at 30 with FSR on. But I prefer to not play games where the visuals but out and it also feels like shit since you're generated frames have worse input latency than native frames.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FCA_Eughhh",
            "body": "Play what you want and have fun absolutely it’s just annoying when people get on here saying a game runs and looks “good” when that’s just not the case lol the last of us part one is a good example .. definitely playable but it’s not a “great experience on deck” like most people would say it is . Play what you want just don’t stretch the truth to fit your narrative ya know",
            "score": 1,
            "replies": []
        },
        {
            "author": "Salter_KingofBorgors",
            "body": "I actually kind of like trying unverified games. It's fun to see how the deck handles them. But yeah I've had a few games that I disagree with the rating for",
            "score": 1,
            "replies": []
        },
        {
            "author": "margieler",
            "body": "People need to realise what's unplayable for you, may be the best quality someone has to play that game.\n\nYes, you may NEED 4k, 120 fps on every game (though let's be honest, we were all using 1080p 60fps for years)  \nOther people can only game on a steam deck.",
            "score": 1,
            "replies": []
        },
        {
            "author": "beamerBoy3",
            "body": "I had Mh wilds running on my desktop with the settings turned well above what NVDIA recommended and decided to try on steam deck just for fun. I legit don’t get why anyone would consider that playable but it’s too 10 on deck status kinda disproves anything we could say",
            "score": 1,
            "replies": []
        },
        {
            "author": "LordWarlockDathamir",
            "body": "Uhhh anyone know what i can do to get crulty squad working?????",
            "score": 1,
            "replies": []
        },
        {
            "author": "conte360",
            "body": "Having fun is fine but if you're going to come in here and say that it runs well when you're getting 20 frames per second on low to medium settings you're just objectively wrong and you're coping",
            "score": 1,
            "replies": []
        },
        {
            "author": "cnio14",
            "body": "Man I hate this meme...",
            "score": 1,
            "replies": []
        },
        {
            "author": "UnsettllingDwarf",
            "body": "Sorry but I have no fucking clue how some of you play action/ fps games at sub 30 fps dropping to even 15 fps most of the time. That’s not fun to me. That’s just enduring pain to “play the game”",
            "score": 1,
            "replies": [
                {
                    "author": "qchto",
                    "body": "In my defense, back when I was a kid, Quake @15fps was considered playable, and I got through the first half of the 00s gaming in a Pentium 2, so Max Payne @10fps was really enjoyable to me.",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "TrickyStrawberry7765",
            "body": "I see more people bitching about imaginary people the. actual people bitching",
            "score": 1,
            "replies": []
        },
        {
            "author": "Whiteguy1x",
            "body": "One of my most played games on the deck is starfield.  Fsr 3, all low settings, and it was good to go.\n\n\nHowever i was always honest that it's a terrible way to play it.  Around 30fps, while akilia is more like 20fps.  Very noticeable upscaling.  Sometimes companions faces didn't load in and you were talking to teeth.\n\n\nI think some people just have much higher tolerance to low preformamce ",
            "score": 1,
            "replies": []
        },
        {
            "author": "FriendlessExpat",
            "body": "Cope\n\nI mean it's nothing wrong if you are having fun. You do you but you have to be realistic about SD.",
            "score": 1,
            "replies": []
        },
        {
            "author": "the_millenial_falcon",
            "body": "Wat?",
            "score": 1,
            "replies": []
        },
        {
            "author": "jollyjam1",
            "body": "This is me with Age of Empires 2/3. I play the SD plugged into a stand with a mouse and keyboard, and just squint at it closely lol. I just got a monitor I intend to also use for work, but it will make playing some games much easier haha",
            "score": 1,
            "replies": []
        },
        {
            "author": "childofthemoon11",
            "body": "Are you having fun at sub 30fps, tho?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alienhaslanded",
            "body": "In all fairness, people also used their hands to dig holes and they were totally ok with it until someone showed them how to use a shovel. Same thing happened when excavators were invented.",
            "score": 1,
            "replies": []
        },
        {
            "author": "custom2112",
            "body": "No matter the sub, no matter the game, good or bad, this is the first thing posted after any new release.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cataclysmic_orbit",
            "body": "Does MHWilds actually work on the deck?",
            "score": 1,
            "replies": []
        },
        {
            "author": "DeliciousAd6345",
            "body": "Jokes of them, I play any game I want on my deck LOL",
            "score": 1,
            "replies": []
        },
        {
            "author": "Yoshadii",
            "body": "🤣🤣🤣 as long as I’m having fun I could care less, this is me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bunny_Flare",
            "body": "Kinda annoyed on this argument from both sides….Playing games at 30fps and bellow is fine as long as it doesn’t dip to much it is fine and using FSR is fine for the Steam Deck. But at the same time some people will over exaggerate the performance just a bit.\n\nBut i also get annoyed when the entire sub get annoyed about the person saying its running well at 30fps fsr with sometimes dips. I understand why they are annoyed about those people but just ignore the post.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Walnut156",
            "body": "Oh we are doing this shitty circlejerk template now, huh?\n\nAlright let's get into a circle everyone",
            "score": 1,
            "replies": []
        },
        {
            "author": "AirmanProbie",
            "body": "I literally ignore the “unsupportive” tag. I got RWBY and THQ Summoner working and they are tagged as “unsupportive”",
            "score": 1,
            "replies": []
        },
        {
            "author": "OldschoolGreenDragon",
            "body": "Look at me, I'm playing Biogun not giving a damn about 30 FPS!",
            "score": 1,
            "replies": []
        },
        {
            "author": "megas88",
            "body": "I love how I literally only have a single game in my entire library that runs poorly and it has nothing to do with the deck itself lol. Sonic frontiers just has denuvo and is a poorly optimized mess. I still enjoy the ever loving hell out of it though cause it’s my mess.\n\nEvery time I pick up my deck, I’m filled with this sense of gratitude towards the people who made this experience accessible and possible for me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Major_Philosophy1030",
            "body": "I wanted to try Xenoverse 2, but says unplayable, as well as Garden Warfare, and seeing this reminded me of that, do they work even tho they say unplayable",
            "score": 1,
            "replies": []
        },
        {
            "author": "EndlessCola",
            "body": "I dunno man, my experience has largely been one of acceptance and helpfulness in this sub. Maybe there are some loud minority opinions here and there but my experience has been that this is a group of people who just love the deck like I do",
            "score": 1,
            "replies": []
        },
        {
            "author": "DazzlerPlus",
            "body": "The quit having fun meme has got to be the absolute worst meme format in existence",
            "score": 1,
            "replies": []
        },
        {
            "author": "SandyTaintSweat",
            "body": "Set the monitor to 50 Hz and then set the FPS limit to 25 FPS. I only do this as a last resort in conjunction with an external upscaler, but it can make that critical bit of difference.\n\nYou can get used to it, for the most part.",
            "score": 1,
            "replies": []
        },
        {
            "author": "akamun",
            "body": "Deck verification can be hit/miss. For eg.  Ghost of tsushima is marked unplayable but it works flawlessly",
            "score": 1,
            "replies": [
                {
                    "author": "HisDivineOrder",
                    "body": "The Unplayable badge has a note from the developer explaining how the online game mode is what makes it considered Unplayable. Valve isn't going to start doing Verified for one mode and Unverified for another.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Legitimate-Muscle152",
            "body": "This post reeks of copium",
            "score": 1,
            "replies": []
        },
        {
            "author": "C3H8_Tank",
            "body": "Reddit in a nutshell*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Xirasora",
            "body": "I'm apparently VERY tolerant about framerates.  I played through the entirety of Bioshock Infinite on my laptop, averaging maybe 18-24fps the whole time.\n\nOnly once did I actually stop to figure out the problem: Mirror's Edge on SD with PhysX enabled. Holy crap, it was a slideshow when police were onscreen. I think the Deck was desperately trying to crunch the numbers on all the broken glass.  Remember, this was back when you could buy a dedicated PhysX processing card for your computer because it was so numbers-intensive.",
            "score": 1,
            "replies": [
                {
                    "author": "Dr_Axton",
                    "body": "I think there was something with physX in general. It was also an issue for me back when I used a 2070, but IDK what",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Auldnoir_",
            "body": "People play on the Switch and have fun, I see no difference.",
            "score": 1,
            "replies": [
                {
                    "author": "deathblade200",
                    "body": "many MANY people including myself (or atleast used to before getting a Steam Deck) hack the switch to add graphics mods, overclock, and unlock 60FPS in games.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Auldnoir_",
                            "body": "What percentage out of the 150 million switch sold do you think do that?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "deathblade200",
                                    "body": "feel free to go count up the hacking community its in no way shape or form a small amount. the only limitation is ignorance in the console space.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Dr_Axton",
            "body": "15 years ago I was still playing on PS3 and had a slow laptop. I’m completely fine with 30 FPS, just add motion blur and focus on the fun",
            "score": 1,
            "replies": []
        },
        {
            "author": "crownofgrey",
            "body": "It’s honestly the people who have nothing else besides a steam deck that are obsessive weirdos about things like this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "EfficientNet3124",
            "body": "I play Cities Skyline 2 WITH like 42 mods, on my steam deck. All setting on low. Everything looks like shit but damnit, it's my favorite game. How could I NOT play it? Anything is better than nothing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Herbie_We_Love_Bugs",
            "body": "Monster Hunter Wilds on GeForceNOW is dope on the deck.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JensonBrudy",
            "body": "I often dock my Deck and play on a 4K TV, it actually feels kinda fun to try and push it to the extreme",
            "score": 1,
            "replies": [
                {
                    "author": "nebber3",
                    "body": "I've resorted to running games at 1080p on my 4K TV. It sacrifices less performance and still looks ok scaled up to 4K.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "author": "battlerumdam",
                    "body": "I doubt that anyone told you that aren’t allowed to have fun, you probably just made claims about performance that simply were a lie.",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "JishoSintana",
            "body": "Basically….that and “we don’t play the games we buy”\n\nBut that part is kinda fun I won’t lie",
            "score": 1,
            "replies": []
        },
        {
            "author": "lululock",
            "body": "Me when I played Robocop Rogue City on my Steam Deck during Christmas vacations...\n\nYes, it was very ugly. But at least I had fun...",
            "score": 1,
            "replies": []
        },
        {
            "author": "FurtherArtist",
            "body": "And then I’ll appreciate it a whole lot more when I finally get an actual gaming pc. Win win.",
            "score": 1,
            "replies": []
        },
        {
            "author": "kellymcq",
            "body": "This sub is generally the opposite. Deck runs everything butter smooth and you should buy Balatro and Dave the Diver.",
            "score": 1,
            "replies": []
        },
        {
            "author": "tomkatt",
            "body": "People should enjoy what they want, but my beef is with people saying “it runs great!” Or the running joke of “locked 30 fps with some dips” (if it dips, it’s not locked).\n\nHave fun with what you like, but don’t give other people unrealistic expectations. I personally find 30 fps and lower unplayable for modern games, the input latency and jerkiness is unbearable to me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hunt3r_S3p",
            "body": "I see more posts trying to sell people on them having fun on obviously shitty performance experiences than i see people criticizing it, if they were having fun they wouldnt be recording shitty videos on phones without being honest about the performance drops and settings instead of having fun.\n\nLike, if this meme was even half true that bullshit video of spiderman 2 running at 480p 4:3 on lowest with framegen that looked terrible and unplayable wouldnt have had 4k upvotes.\n\nAnyway, good bait, go have fun playing at 240p 20fps instead of crying about it here?",
            "score": 1,
            "replies": []
        },
        {
            "author": "poeBaer",
            "body": "Lol and here come all the \"yeah but...\" and \"whatabout\"s... vocal minority\n\nMeanwhile, over at the [Deck top played charts](https://store.steampowered.com/charts/steamdecktopplayed) the actually majority are playing all the games they wouldn't touch with a 10-foot pole\n\n[\"Am I so out of touch? No, it's the children who are wrong\"](https://www.youtube.com/watch?v=hYAuR5bkIlQ)",
            "score": 1,
            "replies": []
        },
        {
            "author": "AngryWaffleMob",
            "body": "I’m tired man, I just want to play games while shitting",
            "score": 1,
            "replies": []
        },
        {
            "author": "kermitthehedgefrog",
            "body": "I’ll say it right now and continue to say it till I’m dead. Let people enjoy their shit, just because you have a long check list of requirements to enjoy a game, doesn’t mean everyone else does. Everyone enjoys things differently, that being said this doesn’t just apply to video games either I’m talking about everything else too.",
            "score": 1,
            "replies": [
                {
                    "author": "JuanAy",
                    "body": "The problem is that people will overstate a games performance, claiming it runs really well when it doesn’t at all.\n\nIt’s fine to enjoy something. Just be honest about the experience.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "kermitthehedgefrog",
                            "body": "That is a fair point.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "pizzalover89",
            "body": "How dare i play at 30 fps!! For real tho like some of us grew up on the og gameboys, ataris.. i dont give a damn about it running at 60 fps",
            "score": 1,
            "replies": [
                {
                    "author": "ItsNotJusMe",
                    "body": "people will be shocked to know that most of ps4 games run at 30 fps.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "deathblade200",
                    "body": "so you grew up on 60FPS devices and whining about people wanting 60fps. how do so many people that claimed to have lived through that generation not know the devices were 60FPS?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CarpetCreed",
            "body": "No one has ever said that",
            "score": 1,
            "replies": []
        },
        {
            "author": "klortle_",
            "body": "The problem is people who are egregiously incorrect about how their game runs, misinforming those who want to know if it will be playable enough for *them*. Not everyone can stomach a 10 FPS (sorry, an amazing 20 FPS with input gore framegen) after being told “tHe GaMe RuNs PeRfEcTLy!!”\n\nSo yeah, it’s a mix of “quit having fun” and “quit lying about your fun”",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gex2-EnterTheGecko",
            "body": "You're allowed to play whatever you want, but it does get annoying when people come on this sub and go \"OMG [insert game] RUNS ABSOLUTELY FLAWLESSLY!!\" and their definition of \"flawlessly\" is basically that it launches and doesn't crash, but otherwise looks and plays like dogshit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dank_bobswaget",
            "body": "If movies are at 24 fps, then I have no problem playing my games at the same frame rate",
            "score": 1,
            "replies": []
        },
        {
            "author": "The_Invisible_Hand98",
            "body": "30  fpswith frame Gen and upscaling on my PC 🤢🤮\n\n30 fps with frame Gen and upscaling on my steam deck hooked up to a TV 😃😃",
            "score": 1,
            "replies": []
        },
        {
            "author": "PedosVoteTrumpDotCom",
            "body": "People seem to forget that almost EVERYTHING on the Nintendo Switch runs at sub 30 FPS and it's the best selling handheld of all time",
            "score": 1,
            "replies": [
                {
                    "author": "deathblade200",
                    "body": "you seem to forget than console gamers have very low standards because they have been forced to deal with 30FPS and low quality graphics since the PS3 era. even now though console gamers are starting to get tired of 30FPS",
                    "score": 1,
                    "replies": [
                        {
                            "author": "PedosVoteTrumpDotCom",
                            "body": "You seem to forget that the Steam Deck is the most accessible and affordable PC gaming experience currently available, and a huge amount of users come from console and have no experience with PC.The Steam Deck wasn't made for PC gaming enthusiasts. If it was, it'd be 3x more powerful, 5x more expensive, and run Windows.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "eestionreddit",
            "body": "I'm sorry, but I need a stable 30 at minimum to consider a game playable, emphasis on stable.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ousantacruz",
            "body": "There’s always some a-hole elitist that wants to tell you everything is “unplayable” (makes you wonder why they even have an SD if they hate it so much) It’s a handheld and it’s convenient. I’ll take some compromises while playing in bed over not playing at all. I play games, not here to watch the FPS counter in the corner.",
            "score": 1,
            "replies": []
        },
        {
            "author": "poopymcfarts",
            "body": "Most people here never owned a Switch, and it shows",
            "score": 1,
            "replies": []
        },
        {
            "author": "HeftyChonkinCapybara",
            "body": "This was made by someone with really low standards in their life",
            "score": 0,
            "replies": [
                {
                    "author": "qchto",
                    "body": "True... But in an industry where everything is hype-induced and non-standard, that's a plus.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "HeftyChonkinCapybara",
                            "body": "If you’re okay with games running like that, it’s fine by me. It’s just that devs and publishers will assume that the state of, let’s say, wilds on PC is acceptable.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "deathblade200",
            "body": "see the issue is 30FPS is bad performance regardless if people like you wish to accept it or not. nobody gives a shit if YOU want to run games at 30FPS but stop going around telling others how \"playable\" and \"smooth\" it is. inb4 the typical \"but movies run at 24FPS\" or \"but old games ran at 30 FPS (completely wrong btw)\" posts like this completely ignores the toxic individuals on the other side.",
            "score": -16,
            "replies": [
                {
                    "author": "K-Shrizzle",
                    "body": "I don't give a fuck what frame rate a movie runs at. I'm not sitting there with a movie for 30+ hours of my life",
                    "score": 4,
                    "replies": [
                        {
                            "author": "deathblade200",
                            "body": "its a defense people love to use in order to defend low frame rates though. I see it far too often on here",
                            "score": -3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Windows-XP-Home-NEW",
                    "body": "Then I guess the Steam Deck is a shitty device since it runs many games at a solid 30.\n\nAnd 30 is the bare minimum for smooth. Anything below that is too choppy for me, IMO.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "deathblade200",
                            "body": "Steam Deck runs a majority of game ever made at 60FPS. stop making it into something it isn't people just try to cope hard when it comes to newer games. 30FPS is not smooth 30FPS was a compromise made in consoles after the PS2.",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "Windows-XP-Home-NEW",
                                    "body": "That’s your (unpopular) opinion. Notice how I said IMO? Do you know what that means?\n\nThe games that most people play on their Decks on here are getting solid 30, 40 at most. Not everyone plays old ass or undemanding games.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "deathblade200",
                                            "body": "its not an unpopular opinion. the fact we need to make posts like this to demonize people who want good performance really shows how popular the opinion is. you are one of those toxic people I was referencing. no not all new games run at 30FPS and can in fact hit 60fps but lets keep lying to ourselves",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Windows-XP-Home-NEW",
                                                    "body": "No it doesn’t? Look out how downvoted you are lol. Damn near every Steam Deck owner is perfectly fine with playing at 30 FPS.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "deathblade200",
                                                            "body": "do you understand what toxic means? people on here will downvote anything even when they make up placebos. if thats your only defense then you truly have no argument. you can pretend all you want though.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "Windows-XP-Home-NEW",
                                                                    "body": "Trying to convince yourself that your opinion isn’t unpopular and it’s others that are just being toxic towards you is pure delusion. Well done.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "deathblade200",
                                                                            "body": "so since you clearly lack logic here do explain why a post like this one has to be made in the first place if its so unpopular then why does 30FPS need to be defended so hard? or is it that the 30FPS people are just loud as hell?",
                                                                            "score": 5,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Windows-XP-Home-NEW",
                                                                                    "body": "Because people are spoiled with their fancy PCs and 60+fps vs the people who are happy with the still relatively smooth 30fps and the portability. If you think 30 fps is garbage this isn’t the device for you.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "deathblade200",
                                                                                            "body": "aka people want good performance so they are \"spoiled\" while other people want to compromise with lower performance and pretend its good enough. sprinkle in a little lie of \"Steam Deck is a 30FPS device\" and you have the typical cliché 30FPS defense. but according to you these \"spoiled\" people are the ones with the unpopular opinion",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Windows-XP-Home-NEW",
                                                                                                    "body": "They are. This post has two fucking thousand upvotes. You guys are buried at the bottom of the comment section though",
                                                                                                    "score": 2,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "gentlepigeon",
                                                                    "body": "Nah im down voting you cause my PC is worse than the deck so I'm just happy it'll run shit my OC can't",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TristanTheta",
                    "body": "If you think a solid 30 FPS isn't \"playable\", you're spoiled.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "deathblade200",
                            "body": "you misspelled realistic.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "TristanTheta",
                                    "body": "Huh? In what world is complaining about a solid 30 FPS on a handheld \"realistic\"?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "deathblade200",
                                            "body": "in what world is bashing people for wanting 60FPS which is what gaming started at realistic?",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "TristanTheta",
                                                    "body": "Well regardless of if games started at 60 FPS, (which isn't really an argument because FPS mattered a lot less in the Atari / Arcade era) nobody is bashing anyone for wanting 60 FPS. Its also a faulty comparison since all of those consoles are not mobile, and were far more expensive than a Steam Deck.\n\nTo say that 60 FPS is the bare minimum for mobile hardware running AAA titles from 5 years ago or less is insane, and should be bashed. Especially given that the Steam Deck is extreamly affordable and can run many of these games at 60 FPS. If you want your 60 FPS so bad, go buy the MSI Claw at $1200.\n\nA solid 30 FPS on a handheld is totally acceptable for demanding titles. Stop trying to argue that its \"muh realistic\" to expect anything more from a $500 handheld.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "deathblade200",
                                                            "body": ">To say that 60 FPS is the bare minimum for mobile hardware running AAA titles from 5 years ago or less is insane, and should be bashed.\n\ngames such as DMC5 would love to have a word with your bias. people can compromise all they want but lets not pretend its actually a good experience.",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "TristanTheta",
                                                                    "body": "Ok? Now let's talk about the HUNDREDS of other games released in 2019 that the Steam Deck can run. How about Control, also released in 2019? RE2 Remake? You're cherry-picking on top of being an FPS snob.\n\nOnce again, you're insane if you think that anything less than 60 FPS is unplayable. Would it be nice to have? Sure, and we should be improving the tech to get there. But saying it's unplayable is screaming entitled and spoiled.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "deathblade200",
                                                                            "body": "me :points out an example that destroys their bias them: \"RAGE!!! how dare you give an example that makes me wrong now list more\". my god can you be anymore insufferable. just to piss you off further Sekiro ran at 60FPS too and guess what was released in 2019.",
                                                                            "score": -1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "TristanTheta",
                                                                                    "body": "I'm not mad here. DMC5 struggles to run at 60 FPS on budget / mid-tier desktops from 2019. So why would you expect a mobile platform using tech from 2021-2022 to run it?\n\nAnyway, for every pre-2019 game you mention that can run at 60 FPS, I can list 2 more that can.\n\nI don't get your last point, Sekrio can run at 60 FPS on the Steam Deck. Cool.\n\nAnd you're still operating on the faulty assumption that anything less than 60 FPS is unplayable.\n\nI'd take a look at the downvotes on your original comment and take the L.",
                                                                                    "score": 3,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "Balikye",
                                                                                    "body": "60 FPS on what settings??? I got a choppy 20 on low on the deck...",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "deathblade200",
                                                                                            "body": "now you are just straight lying. I 100% played it on deck at 60FPS",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Balikye",
                                                                                                    "body": "Uhuh... Again, you're not posting these supposed videos and still won't tell me your settings.",
                                                                                                    "score": 3,
                                                                                                    "replies": []
                                                                                                },
                                                                                                {
                                                                                                    "author": "Balikye",
                                                                                                    "body": "You're the one lying... You won't even say how you managed to get 60FPS on a deck... My RTX 2070 SUPER i7-8700k overclocked to 5ghz on all cores with 32GB DDR4 couldn't even do that, lol...",
                                                                                                    "score": 2,
                                                                                                    "replies": []
                                                                                                },
                                                                                                {
                                                                                                    "author": "Balikye",
                                                                                                    "body": "You're the one lying... You won't even say how you managed to get 60FPS on a deck... My RTX 2070 SUPER i7-8700k overclocked to 5ghz on all cores with 32GB DDR4 couldn't even do that, lol... Had to turn the game down to 1080p.",
                                                                                                    "score": 2,
                                                                                                    "replies": []
                                                                                                },
                                                                                                {
                                                                                                    "author": "None",
                                                                                                    "body": "[deleted]",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                },
                                                                                                {
                                                                                                    "author": "Ancient_Tomato7337",
                                                                                                    "body": "Dude's talking out of his ass for a Reddit argument. 💀 That shit struggled to hit 45 on medium outside of combat even on OLED. Bro was really running the game at 800x600 on low and thinking he made a point. 💀💀💀",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Bagel_Bear",
                    "body": "30fps with no frame drops is perfectly fine. Better than 40-60 going all over.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mr-T-1988",
            "body": "I guess some people have no standards anymore",
            "score": -1,
            "replies": []
        },
        {
            "author": "handymanning",
            "body": "Sub 40 fps is unplayable. My mind won't change.",
            "score": -2,
            "replies": [
                {
                    "author": "Windows-XP-Home-NEW",
                    "body": "Skill issue.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "xEmptyPockets",
            "body": "Saying that sub-30 FPS is horrible is less of a \"quit having fun\" and more of a \"stand up for yourself\"/\"have a little more self respect\". There are so many amazing games you could be playing instead, that won't be actively uncomfortable to play. Why let someone charge you $70 dollars for software that your hardware can't handle?",
            "score": -1,
            "replies": [
                {
                    "author": "nebber3",
                    "body": "This is my take. Games like Monster Hunter Wilds are terribly optimized AND look bad, even on higher end rigs. Pretending that your Steam Deck can run it just fine is kinda letting Capcom off easy, and possibly convincing others to spend $70 on the unoptimized game that won't run well on their hardware.\n\nWe're not entitled for wanting better optimized games, and we aren't telling people to stop having fun.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "j0e_dirt_0f_ding",
            "body": "They must be the same soulsborne people, too 😂",
            "score": 0,
            "replies": []
        },
        {
            "author": "No-Ad9763",
            "body": "30fps is not playable to me usually",
            "score": 0,
            "replies": []
        },
        {
            "author": "MadukaBig",
            "body": "Gotta be my most hated meme format",
            "score": 0,
            "replies": []
        },
        {
            "author": "Rhymelikedocsuess",
            "body": "We need steam deck 2",
            "score": 0,
            "replies": []
        },
        {
            "author": "mo177",
            "body": "Yeah I play kcd2 on the deck and it runs great! I think people just get jealous because some people know what settings to tweak to make these games work while others can't seem to figure it out.",
            "score": 0,
            "replies": []
        },
        {
            "author": "mak112112",
            "body": "Kind of a related question, but has anyone tested Sengoku Dynasty on Deck? I'm curious about how it runs.",
            "score": 0,
            "replies": []
        },
        {
            "author": "mak112112",
            "body": "Kind of a related question, but has anyone tested Sengoku Dynasty on Deck? I'm curious about how it runs.",
            "score": 0,
            "replies": []
        },
        {
            "author": "lKrauzer",
            "body": "Or just don't play those unoptimized pieces of trash",
            "score": 0,
            "replies": []
        },
        {
            "author": "Strider_DOOD",
            "body": "I mean, if you play at sub 30 fps with fare you deserved to be called out",
            "score": 0,
            "replies": []
        },
        {
            "author": "annaleigh13",
            "body": "I’ve never understood those who have the “it doesn’t have 60fps, it’s unplayable” mentality. If someone is having fun playing at 20 fps, then good for them.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Fenrir79",
            "body": "I just find super funny how corners watchers hate on everyone that has fun with their game running in a completely normal way.",
            "score": -2,
            "replies": [
                {
                    "author": "JuanAy",
                    "body": "It’s more about the people overstate a games performance. Claiming it runs extremely well, when the actual experience is nothing like the claims.\n\nThere’s nothing wrong with enjoying a game that doesn’t run particularly well. Just be honest about the experience. Dont hype it up. Dont be all like “It runs at a locked 30fps!” when it spends half the time lower than that while having the settings and resolution as low as possible.\n\nI remember when people were claiming Baldurs Gate 3 ran well on the deck. When I tried it the performance was sub-30 fps, fairly unstable and ran at a full 25W meaning battery life was poor and thermals were high.\n\nOr that one time a guy claimed to have Alan Wake 2 running fine. But when pressed for proof only showed a clip of the game running with the camera pointed away from anything remotely demanding and it was still barely hitting 30-40fps.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Flyak1987",
            "body": "30 fps is absolute trash.",
            "score": -2,
            "replies": []
        },
        {
            "author": "FlyingCaravel10",
            "body": "This is an awfully dismissive response to a topic that requires discussion and nuance.",
            "score": -2,
            "replies": []
        },
        {
            "author": "ConradMcduck",
            "body": "Disingenuous at best. \n\nThe issue is not with people enjoying poor performance, but misrepresentation of performance. \n\nThat is: saying things like \"runs flawlessly\" or \"runs perfectly on deck\" when referring to the performance mentioned in your meme.\n\nIf you can't understand the difference between the two, that's on you.",
            "score": -3,
            "replies": []
        },
        {
            "author": "DeathOfArt",
            "body": "Who is having fun at under 30fps on low details? We have switch for that",
            "score": -4,
            "replies": []
        }
    ]
}