{
    "title": "Regarding the 3.7 Preview",
    "author": "reverend_dak",
    "subreddit": "SteamDeck",
    "rank": 10,
    "score": 78,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 25,
    "url": "https://www.reddit.com/r/SteamDeck/comments/1je7nx4/regarding_the_37_preview/",
    "id": "1je7nx4",
    "selftext": "Im sure most people are now aware of the SteamOS 3.7 Beta Preview. But I think that some people might not understand that testing betas, especially Beta Previews, is not for the casual everyday user. I'm seeing complaints on this sub that should be properly reported through the bug reporting channels to Valve. I don't have a problem with people mentioning bugs here to see if there are easy solutions, but that's not what I'm seeing. I'm noticing people upset that things are broken when identifying regressions, bugs, and other broken things is the whole point of the beta program, especially beta previews. \n\nCheck here: https://steamcommunity.com/app/1675200/discussions/1/",
    "comments": [
        {
            "author": "darkuni",
            "body": "YES YES YES\n\nPreview especially.  BETA I would even warn against the non-friction-comfortable people against.",
            "score": 24,
            "replies": []
        },
        {
            "author": "mojaal",
            "body": "Addition of HDR on desktop mode is the most meaningful new feature for me",
            "score": 10,
            "replies": []
        },
        {
            "author": "Bar_Har",
            "body": "Does remote play on Ethernet finally work?",
            "score": 4,
            "replies": [
                {
                    "author": "Wombo194",
                    "body": "What doesn't work about it right now?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Bar_Har",
                            "body": "It just doesn’t. Ever since launch remote play works fine over WiFi, but if you’re connected to Ethernet through a dock it will try to start remote play but disconnect before showing the stream.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "wolfegothmog",
                                    "body": "Last time I used remote play I had to turn WiFi off if I was using Ethernet, obviously not ideal but it worked, if something changed in the last few months then I'm not sure",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "cwistofu",
            "body": "This update fixes the weird thing where my Deck is stuck scrolling Right randomly when I wake from sleep, right?",
            "score": 2,
            "replies": [
                {
                    "author": "N3WG4M3PLVS",
                    "body": "I think I read somewhere you should not touch the right pad when you wake it up otherwise it does this sort of things",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "flashmob321",
            "body": "I'm on 3.8 idk how but I am",
            "score": 1,
            "replies": []
        },
        {
            "author": "MemeGuyB13",
            "body": "My favorite thing about the new update (which I'm honestly not sure if it's a bug or not haha) is the fact that it's no longer limited by 15 watts. This and all the other performance improvements have absolutely boosted my FPS to insane heights!",
            "score": -1,
            "replies": [
                {
                    "author": "Sjknight413",
                    "body": "This definitely isn't the case, are you sure you're not just reading the total system draw? The 15W TDP limit only applies to the APU.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "MemeGuyB13",
                            "body": "Ah, apologies; I thought that limit only applied to the system draw, not the APU. Maybe the performance improvements went towards improving the efficiency of the power draw? I'm definitely getting more FPS on the same games that I play compared to being on the stable channel, so they must've done something right!",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Sjknight413",
                                    "body": "The performance improvements will be coming from the Mesa graphics driver updates and the new kernel base.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "MemeGuyB13",
                                            "body": "https://preview.redd.it/lrix3y1dxgpe1.png?width=1568&format=png&auto=webp&s=124b5dfe9061c035295367b7aa94ca6fe7da2b50\n\nWhat about the new frequency control?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Sjknight413",
                                                    "body": "P-states were always there I believe this just exposes them for manual control, it won't actually affect how P-States behave by default.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "MemeGuyB13",
                                                            "body": "Interesting... I'll investigate further on this. Thank you for your answers! Everyone-- including myself-- that's reading this thread appreciates the info very much!",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "idleblessings",
                                                                    "body": "in what games exactly are you seeing such improvements?",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "PhyloBear",
                                                            "body": "Not really, they were actually broken on Linux for AMD APUs for years. The Steam Deck for instance could only jump between very few CPU power states, with little to no granularity. Now that it's fixed you can expect small but real improvement to 1% low lag spikes and a tiiiiny bit of extra battery.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "pineapple6969",
                                            "body": "What can we realistically expect for performance improvements tho? I just bought my first deck a few weeks back and although I’m happy enough with the performance, more Is always welcome haha",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Sjknight413",
                                                    "body": "There will likely be barely any performance gains, if there is it'll be in specific scenarios and hard to measure. Usually it'll only be if a problematic game has been specifically targeted with fixes and improvements at a driver level.",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "pineapple6969",
                                                            "body": "Ah ok fair enough thanks!",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AdditionInteresting2",
                    "body": "Damn got me all excited that we can increase TDP easily now... Oh well.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "PhyloBear",
            "body": "You're complaining about... people reporting bugs on a public preview designed to collect bug reports?",
            "score": -2,
            "replies": [
                {
                    "author": "shimian5",
                    "body": "no you see, betas and previews are for the elite to use and gatekeep from normal folks.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Bar_Har",
            "body": "Does remote play on Ethernet finally work?",
            "score": -5,
            "replies": []
        }
    ]
}