{
    "title": "While replacing the caulking in the tub of our new house, this was on the back side of the caulking. Does this warrant a whole tear-out?",
    "author": "AwkwardPancakes",
    "subreddit": "Home",
    "rank": 16,
    "score": 611,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 136,
    "url": "https://www.reddit.com/gallery/1jcr103",
    "id": "1jcr103",
    "selftext": "Hi. We just bought a house recently (<6 mo.) and found this while replacing the caulk. I noticed some pink mold on the top of the caulking so I'm stripping it all. I'm guessing that the plastic allowed humidity to condense on the back side of the plastic without being allowed to vent, since it is more or less hermetically sealed. Caulk around everywhere in the shower. \n\nSince there is both pink and a dark mold on the back of the caulking, does this mean that it is likely all behind the plastic shower? Does this warrant a complete tear out? Or is this normal?",
    "comments": [
        {
            "author": "Immediate-Relief-248",
            "body": "Pretty much impossible to avoid mold in every nook and cranny in a shower. Every shower that I’ve ever worked on has had some form of mold. Even the cleanest of homes. This is normal. Make sure you are using your fan in the washroom when showering.",
            "score": 689,
            "replies": [
                {
                    "author": "AwkwardPancakes",
                    "body": "Thank you for your response. We don't have a fan yet, so we open the window pictured in the second image. I plan on installing a fan as well, since the window doesn't seem to be cutting it",
                    "score": 99,
                    "replies": [
                        {
                            "author": "LighTMan913",
                            "body": "I've seen a few people that don't have shower fans have a small dehumidifier in the bathroom.",
                            "score": 64,
                            "replies": [
                                {
                                    "author": "systemfrown",
                                    "body": "We have single digit to low teens humidity where I live, so we enjoy just opening the bathroom door 😂",
                                    "score": 33,
                                    "replies": [
                                        {
                                            "author": "amica_hostis",
                                            "body": "That's what I do, I open the bathroom door, my living room plants love the humidity it brings too. \n\nI live in Northern Colorado and this winter it got to minus 15 F and using that fan in the bathroom makes it so cold when you get out of the shower!  Even colder than opening the bathroom door. Brrrr I hate getting the chills after a shower.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "HiImNugget2020",
                                                    "body": "My wife introduced me to space heater in the bathroom. I haven't been able to go back to, cold bathroom showers.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "Marko941",
                                                            "body": "If you ever get a chance to renovate or build new. Heated floor in the bathroom and kitchen are top tier. The electric ones are sometimes unreliable but hydronic heating is solid.",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "gljackson29",
                                                                    "body": "That’s what I am doing to do when I win the lottery one day lol",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "systemfrown",
                                                                            "body": "They make electric bathroom mats if you happen to have a conveniently located outlet.",
                                                                            "score": 5,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "gljackson29",
                                                                                    "body": "😮 of course I do not have a conveniently located outlet but I will keep this in mind for the future!! Thank you kind redditor",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "ForgottenJedi",
                                                                    "body": "What's the benefit of additional heat in a kitchen?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "10takeWonder",
                                                                            "body": "i believe the additional heat IS the benefit lol (personally I'm thinking of warm feet while I'm doing dishes)",
                                                                            "score": 3,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "dleef31",
                                                                            "body": "I think it's because it's often tiled because of the water in the area, just like a bathrobe is usually tiled for the same reason. Tile is colder to the touch than most other types of flooring. The other reasons would be be barefoot midnight snack runs and barefoot morning breakfast and such.  Those are usually the coldest times of day.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "sgags11",
                                                            "body": "Yep! We have one in our bathroom, and it’s fantastic.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "amica_hostis",
                                                            "body": "Those little heaters can warm up a room quick! I love mine. I had a really cool one that had Bluetooth but it was recalled and I had to return it to get my money back because it could start fires... When I went to buy a new one I could not find any more that had Bluetooth so I don't get to pre-warm the bathroom anymore from the bed lol I have to get up and physically press the switch.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "systemfrown",
                                                    "body": "I’m in the Colorado Mountains and finding a bathroom fan solution that doesn’t leak warm air when not in use is a serious challenge I’ve been trying to overcome every fall for the past three years.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "amica_hostis",
                                                            "body": "It's always so cold in my bathroom. Every time I use the bathroom I have to turn on my little space heater and pre-warm it before I even sit down on the toilet lol",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "systemfrown",
                                                                    "body": "Time for a heated toilet seat id say",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "amica_hostis",
                                                                            "body": "[shivers] ahhh I'd be king of the universe....",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "systemfrown",
                                                                                    "body": "You’d certainly have a throne worthy of the position.",
                                                                                    "score": 2,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "juzme99",
                                                            "body": "Have you looked at 3 in 1 bathroom heaters for the ceiling",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "gljackson29",
                                                    "body": "I live in the southeast, and I still keep a tiny space heater in the bathroom for this very reason (and I hate/am scared of space heaters). Until I can win the lottery and get a house with heated floors in the bathroom that’s how it’s gotta be lol",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "amica_hostis",
                                                            "body": "I have my little space heater in the bathroom too lol 👍🏻",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "gljackson29",
                                                                    "body": "Idk how y’all survive the winters up there… I’d turn into a 5’9” popsicle before October hit lol",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "amica_hostis",
                                                                            "body": "It wasn't so bad when I was young I actually used to wear shorts in snowstorms lol but now that I'm old I get cold when it's 50° outside 😆 \n\n\nI can barely even move my body when it gets below zero. 😞",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "StandAgainstTyranny2",
                                                    "body": "It's a bit of a project, but you could plumb makeup air into your bathroom, opposite the exhaust fan, so it wouldn't drag cold air into the rest of your house.  Any exhaust fans and even laundry rooms should have makeup air, especially in cold winter climates like Colorado.  Not always practical but always useful for energy savings, what for keeping the outside air mostly outside lol",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "manny0103",
                                            "body": "Low teens humidity. Sounds like a dream. Summer just ended and we are still in 50+% 😂",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "gljackson29",
                                                    "body": "Georgia here- we are about to get it big time. Humidity is something else around here…",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "systemfrown",
                                                    "body": "It’s too low unless you like cracked lips, dry skin, and potential damage to wood flooring and furniture, not to mention drinking water like it’s going out of style. \n\n30% to 40% really is ideal.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "healywylie",
                                            "body": "Light socket fan is also good!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "IceCubeDeathMachine",
                                    "body": "125 year old house + here.  Dehumidifier runs every shower and we let it go about an hour after.",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "Virtual-Marzipan-557",
                                    "body": "Just got a small dehumidifer from lowes and I'm surprised as how big of a difference it's making!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Immediate-Relief-248",
                            "body": "Definitely apart of the reason you’d have more mold then. A lot of older homes don’t have exhaust fans because they just didn’t think of it at the time. I’d definitely suggest getting one asap.",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "AwkwardPancakes",
                                    "body": "Great idea. I'll hopefully get that done in the next few days",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "Dugley2352",
                                    "body": "Oh, I’m sure they thought of it, but the typical subdivision homes were/are usually built as cheap as possible. Code only requires “ventilation” and that’s in the form of an exhaust fan,  or a window that can be opened. \n\nMy current home had the same arrangement, just a window… and one of my first DIYs was to add a fart fan to the bathroom. A few years later I upgraded it to a fan with an LED light.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "StandAgainstTyranny2",
                                            "body": "I really need to do that, but I'd end up tearing out the whole ceiling because there's definitely mold in the drywall by now.  50+yo house with single pane glass and windowsills so rusted I'm shocked they still hold glass.  It needs all the help it can get😅",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "binzy90",
                                    "body": "Our house was built in 1800 and had bathrooms added later. Neither one of our bathrooms has a fan, and only one of them has a window.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "josephmadder",
                                    "body": "I'm broke as a bloke is this something that's easy enough to do yourself",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "StandAgainstTyranny2",
                                            "body": "Easy?  Not typically.  Doable?  Usually. \n\nYou'll need the fan unit, a drywall saw, studfinder, ducting, a hole saw for getting from the attic to the outside, and don't forget to accurately measure your hight on the outside siding or drill a small pilot hole and stick something through from the outside as a reference once you're in the attic.\n\nHow hard it'll be depends on whether you have attic access to the ceiling above, and if you understand how to walk on the ceiling joists so you don't fall through the damn drywall ceiling and bust the absolute piss put of your nuts on one.  Ask me how I know. 😅\n\nYou'll also have to run independent power from the switch to the unit, unless there's already a light in your ceiling, and you're good with either swapping the fan unit to where the light is, or having them come on together.  Then you can just run a section of the appropriatepower cable between them.  Exhaust fan with the shower light on the same switch is a popular option.\n\nIt's definitely doable but you need to put some time into researching not only how to do the whole process, but code requirements, and whether you'll need a permit in your area.  Some places are worse than others. \nAlso, be really fucking careful with electrical and look up what you're doing, or hire a professional to make the terminations.\n\nEdit: Not making an intelligence or capability judgement on you, but I really feel like I'm morally and professionally obligated to warn you that doing any of this yourself could be hazardous and/or violate your homeowner's insurance/mortgage insurance, so really make sure you're allowed to by law and also comfortable enough with it before you DIY anything with electrical.\n\nSincerely  -  residential electrician who's done a few.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "samantha_xyz",
                                                    "body": "You are very knowledgeable of this process; I have a question for you.  I have an exhaust fan in the bathroom, but it's small, not powerful enough to remove the humidity.  The ductwork for the exhaust fan is too small to install a larger fan and the ductwork does not vent to the outside. \n\nI need to hire a professional to correct this situation.  I think I need an hvac person to put in the larger duct, but who (type of professional) do I hire to cut the hole to vent the exhaust fan to the outside; is that also the hvac person?  I think I may need a larger hole in my bathroom ceiling to accommodate a larger fan; would the hvac person also do that?  Can you offer any advice on how to get this done..........thank you",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Dark_Side_0",
                                                            "body": "not the person you commented to: However I may add the following:  check with your local contractors or DIY folks. Code requirements, climate particulars and so forth are important.  My concern is mold, fungus and compliance issues with a half-assed job.  All the best.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "samantha_xyz",
                                                                    "body": "Thank you for the information.  That is my concern too; which is why I have not hired a handyman.  I want to get the type of professionals where this would be part of their everyday work; especially since they need to cut a hole in the side of my house!",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "september27",
                                                                            "body": "I am not a professional, but I think if you have a vented soffit/open roof overhang, then you don't actually need to vent through a wall, you can just run duct to the overhang in the attic.\n\nI am certainly open to being corrected by someone more knowledgeable.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "BucketOfGhosts",
                            "body": "We also bought a small fan that just blows the steamy air out the window in our rental home. For you, it would just be a stop gap but it does help immensely, especially when we let it run for like 20 minutes after the shower\n\nhttps://a.co/d/1nGZrmA",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "ColHannibal",
                            "body": "Get a moisture sensor switch for the fan so it turns on if humidity hits a certain point.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "NecessaryExotic7071",
                            "body": "A window indeed doesnt cut it. You need a powered exhaust fan. And in no way is this caulk having a little mildew on it worrisome. As others have said, you cannot avoid that in any tub or shower. Just properly remove the old caulk, clean it up nice and let it dry thouroughly, then re-caulk.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "waterwateryall",
                            "body": "Why put a small fan on the window ledge exhausting out until you get a permanent solution? You can get battery-powered fans.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Ruenin",
                            "body": "Fans don't help as much as people think. Keep the door open, and the window if you can.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Immediate-Relief-248",
                                    "body": "You ever been in a hotel that doesn’t have an exhaust fan? They 100% do more than you think.",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "Eyerate",
                                    "body": "Lol what? Fans move wet air out and draw dry air in from the house. Even cheap ass low cfm broan models are effective, though the higher cfm models are worth the extra few bucks. Quit lying to people.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Worst-Lobster",
                            "body": "Yeah you def would benefit from a fan. Ain’t no getting away from mold if moisture and organic material is present",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "TheDangerist",
                            "body": "Open that window when you shower.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "fillmygullet",
                            "body": "Search a product called RMR-86 Pro....stuff is magic on black mold",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "12Afrodites12",
                            "body": "When you install a fan, have it on a timer switch so it'll stay on for 15-20 minutes after a shower. Air circulation is the answer.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ShrillRumble239",
                            "body": "You can also leave your bathroom door open while showering and put a floor fan in the doorway, it really helps",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Morscerta9116",
                            "body": "Splurge for one with a sensor so it turns on/off on its own. I've never met anyone who runs a bathroom fan long enough post shower.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "North_South_Side",
                            "body": "Get a timer switch for the fan! You can set it to 10 minutes, or up to an hour. I usually take a shower and hit one hour, so it runs for a while after I'm done then shuts off.\n\nThey aren't very expensive, either.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "hagak",
                    "body": "I am into home automation and one of the first automation I did was turn on the fans when the humidity pops up.  I also have it so the fans run for XX minutes once you turn them on so that you can leave them running after you leave the bathroom.  Good for both showers and other reasons you may want the air to leave the bathroom.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "shavenyakfl",
            "body": "Do you see mildew on the wall above?  If not, you're probably good.  \n\n1) Remove all the caulk\n\n2) Bleach where the caulk was, let it dry completely.\n\n3) Re-caulk with a silicone-based caulk.  Keep caulk lines thin and clean.  Follow the cure times before using the shower.\n\nIf caulking is done right, it should be mold free for years.",
            "score": 83,
            "replies": [
                {
                    "author": "TC1544",
                    "body": "Be careful with silicone caulk working with it is a skill. If you’re not used to working with it put tape down so you can have nice clean seams. Do not use latex caulk it will not prevent issues in the future. Been a plumber for 38 years, trust me on this one.",
                    "score": 28,
                    "replies": [
                        {
                            "author": "goforsamford",
                            "body": "I used tape for silicone caulk for the first time ever after many instances of \"I'll just be careful,\" and I can not express what a game changer that was. Clean, uniform, and fast - made me feel like a professional.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "ElonsPenis",
                                    "body": "I don't like the ridges the tape leaves",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "W4ff1e",
                                            "body": "Have a small tub of warm soapy water (I use sugar soap). Dip your thumb in the water and run your thumb along the seam. Reset and repeat as required.\n\nEdit: I use the back of a wet spoon to quickly take off any large excesses of caulk before I take the tape off, then use the thumb.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "SpicyFriedChicken44",
                                                    "body": "Husky sells a $5 tool with a rubber foot that you can adjust for the size of the bead you want to leave (1/4\", 3/8\", 5/8\"...)",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Many_Act_2990",
                                    "body": "Also buy the tool that makes perfect lines",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "techotech111",
                                            "body": "Can you provide an online link to it? Thanks in advance",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "thatsnotamachinegun",
                    "body": "Do not use bleach. It’s water based and won’t kill the mold just make it die off on the surface. The moisture in it will continue feeding the spores and it will come back worse.\n\nUse a white vinegar / water solution or a specific mold killer spray from the store.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "themexitalian69",
                            "body": "Is the vinegar water mixture not also…water based? What’s the difference?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Lost_Ad_4882",
                    "body": "Yes, except I would scrub with a vinegar solution instead of bleach. It probably won't be perfect, but it'll be better than just caulking over the old mold.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "present_rogue",
            "body": "I would spray some mold killer down and let it dry for a day before putting new caulk in",
            "score": 23,
            "replies": [
                {
                    "author": "wlaugh29",
                    "body": "After cleaning, I spray it down with Concrobium, making sure to get in the crack. Let it dry then recaulk. Some suggest to fill the tub with water to widen the crack and then caulk, but I'm usually in it so same result.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "ElonsPenis",
                    "body": "aka chlorine",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Notyourfriendbuddyy",
                            "body": "White vinegar is really good too. I was shocked when I was able to clean fabric with mold and get the same results as bleach without the color staining that bleach does.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Puzzleheaded-Suit641",
                                    "body": "I've had great luck with vinegar as well. The little bit of research online that I have done has actually shown that vinegar is supposedly better than bleach. All I can confirm is identical results for me.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "ttbtinkerbell",
                                            "body": "Wish Vinegar would remove the mold in my grout. I apply it straight. Scrub it with a bristled brush. Then get a paper towel and soak in vinegar and place on grout. I pour more vinegar to be heavy handed. Check after an hour, repeat the previous steps. I check and do one more round of steps before I give up. I have a mold killer in a green bottle, smells like bleach x10. But it I seems to only kill the surface and not deep in the grout. Sort of reduces the appearance by 80%, never all the way and it always returns. I just bought another mold killer (RMR). I’m hoping I can finally get the mold gone. It started as two small mold spots. They are growing and I want it to stop.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "AwkwardPancakes",
            "body": "Thank you everyone! I removed the soap tray to take a look behind it. Looks like what is happening is the steel support for this shower has a little bit of rust on it and is directly behind the joint of where the tub meets the surround. Looks like it's rust. No mold down inside of there. It's not rusted through, just a bit of rust coating the surface. \n\nEverything in there looks dry as can be down there, though, and I just showered about 2 hours ago. Thanks again!",
            "score": 10,
            "replies": [
                {
                    "author": "apoletta",
                    "body": "Good news! Removing the faucet surfing and looking down, or aiming a moisture meter under the bath could also confirm issues if present.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Reedsbeach",
            "body": "Replace all caulk and redo it with silicone...",
            "score": 13,
            "replies": []
        },
        {
            "author": "figurefuckingup",
            "body": "Not sure if anyone will see this, but I’m a renter and I noticed some caulk gave away in my shower/bath. There’s some mold behind where the caulk was. Should I do anything about that? How big of a deal is it? Should I tell my landlord? \n\nI like my landlord a lot (he’s very responsive) but I like to only escalate issues with him when absolutely necessary.",
            "score": 6,
            "replies": [
                {
                    "author": "friendIdiglove",
                    "body": "Tell the landlord.  Neither of you want the water leak that the caulk was preventing.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "RaceMaleficent4908",
                            "body": "Caulk (actually silicone) does not prevent leaks. The tub must be sealed behind the tiles for it to properly seal.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Confident-Run7064",
                    "body": "This post reminded me of the same thing. Caulk drying out and chipping, leaving a seam where water can get in the wall. I just took a photo and sent it via email and asked if they thought it was worth having the maintenance guys redo it. This way, they are informed and can make that determination instead of you.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "dingdong6699",
            "body": "You are cray cray",
            "score": 3,
            "replies": []
        },
        {
            "author": "BronzeAgeMethos",
            "body": "Remove all the caulk, clean the areas and spray them with bleach, and redo the caulk using bathroom caulk that has anti-mold properties in it. Use one of the rubber scraper tools with a rounded triangular tip for an expert job. Good luck!",
            "score": 9,
            "replies": []
        },
        {
            "author": "WatchLover26",
            "body": "Nah.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Fluid-Arachnid-8716",
            "body": "That's mildew not mold",
            "score": 3,
            "replies": []
        },
        {
            "author": "Odd-Candidate-9235",
            "body": "Get rid of all the caulk. Disinfect with vinegar or bleach, LET IT ALL DRY OUT, then recaulk. You’ll be fine.",
            "score": 3,
            "replies": [
                {
                    "author": "AwkwardPancakes",
                    "body": "I did just that. We are all good and sealed back up. Thanks!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "koolaidismything",
            "body": "Wear gloves 🧤",
            "score": 2,
            "replies": []
        },
        {
            "author": "Tav00001",
            "body": "My current condo when I moved in, the upstairs shower had been recaulked and resurfaced. I did not know it, but a few weeks into it, the shower seam between the shower and the backsplash developed mildew.\n\nIt had obviously been sealed up with that there, but the resurfacing made it hard to handle the tub is like chaulk, so scraping it is iffy.\n\nI periodically recaulk, and the mildew returns. There is little I can do, as that lip and edge just invite mildew and with the gap, it comes back, no matter what I do since I'm sure its living where I can't reach.\n\nI try to keep it dry, but I except when I sell it back to the owner, they will resurface it again and sell it with the mildew strain alive and well. \n\nSome showers I think just have the tendency to develop mildew.",
            "score": 2,
            "replies": []
        },
        {
            "author": "mcg00b",
            "body": "Thought I'd mention, there's anti fungal silicone caulk. It's been holding up pretty great after I redid our bathroom. Original shit turned yellow and got moldy pretty quick, no idea what garbage was used here.",
            "score": 2,
            "replies": [
                {
                    "author": "AwkwardPancakes",
                    "body": "That's exactly what I used. Thanks!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "skidmarkz69",
            "body": "When you install an exhaust fan make sure your wife uses it ( my wife doesn’t like to use it because she gets cold……) or wire it to come on with the light",
            "score": 2,
            "replies": [
                {
                    "author": "AwkwardPancakes",
                    "body": "If I'm honest, I think that may be part of what's going on... She never opened the window! I'm going to wire it to the light.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Opening_Perception_3",
            "body": "It's mold, not anthrax.... every building in America probably has mold in it somewhere",
            "score": 1,
            "replies": []
        },
        {
            "author": "jolin8911514",
            "body": "No just from Moisture, do what your doing and replace the caul with a acrylic caulk",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok-Sir6601",
            "body": "I would want to start clean, so yes, tear it all out and caulk. How is the bathroom vented? You may need to get a strong bathroom ventilation fan.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RespectSquare8279",
            "body": "Always use a bathroom exhaust fan. Leave it on, even after the shower or bath. A timer switch or a humidistat is helpful.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bluecamaro1969",
            "body": "The bogeyman of mold 😂.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Radiant-Spirit6129",
            "body": "The tub looks resurfaced. Careful scraping that off or a simple recaulk will turn into a full resurfacing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dirty_spatula",
            "body": "A whole tear out!?! Good lord no.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HandymanJonNoVA",
            "body": "I'm no expert, but I think that's mildew, not mold\n\nWhen you are ready to apply new caulk, remember that less is more",
            "score": 1,
            "replies": []
        },
        {
            "author": "IntelligentSample489",
            "body": "Always take old caulking out and clean then tape and caulk then back tool.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Body1586",
            "body": "Do you know what type of shower wall brand this is? I’m looking to do something similar for my remodel.",
            "score": 1,
            "replies": []
        },
        {
            "author": "woodworkerForLyfe",
            "body": "Gut job",
            "score": 1,
            "replies": []
        },
        {
            "author": "Front_Car_3111",
            "body": "yep.  \n100% removal.  \nBleach/clean/dry.  \nLay a new bead of 100% silicone.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Conwaysp",
            "body": "Besides the various recommendations to add a ventilation fan/dehumidifier/open window, I suggest using a window squeegee to remove excess water from the entire tub surround after each use, then a small dry towel to (lightly) dry the caulking. \n\nIt will take less than a minute, prevents water remaining pooled on the caulking, which allows it to dry much more quickly and significantly increases replacement time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "comfysynth",
            "body": "Normal keep your fan on after showers. Use a squeegee. If you’re using a shower with a door leave the door open, if it’s a curtain keep both sides open for air for flow after the shower. Keep your bathroom door open after shower.",
            "score": 1,
            "replies": []
        },
        {
            "author": "grammarpopo",
            "body": "No. Scrape out the old caulk, disinfect the area with a bleach solution. When it dries rub the area with alcohol. Let it dry. Recaulk with white silicone caulk. Wet finger to smooth it down.\n\nAnd like someone else said, keep the room ventilated as much as possible.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RaceMaleficent4908",
            "body": "This is 100% expected.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CableFit940",
            "body": "Install a timer switch for the fan so it can run for a bit after a shower",
            "score": 1,
            "replies": []
        },
        {
            "author": "PacificArchitect",
            "body": "Ventilation is key.\n\nBathrooms must breathe and dry out to prevent mold. Always use your bath fan, and whenever possible, open a window, skylight, or even leave the door slightly ajar to improve airflow. \n\nBreathing in mold is unhealthy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "magicimagician",
            "body": "LOL. no. Not a whole tear out. Except for tearing out all the old caulk, dehumidifying the room and recaulking.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RandomMcBott",
            "body": "No. I repeat, NO. \nRecall and be done.",
            "score": 1,
            "replies": []
        },
        {
            "author": "str8shot4u",
            "body": "Ya , that sounds like the toaster outlet.. outlets next to a shower is why they have to put warning labels on hair dryers . And not to use them in the shower or bathtub..",
            "score": 1,
            "replies": []
        },
        {
            "author": "Opposite_Yellow_8205",
            "body": "Recaulk with a quality silicone and move on.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DavidinCT",
            "body": "Nah, unless the wall is falling off. pull it all off, use something to get rid of the mold, clean it all up, re-apply...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Motor-Pick-4650",
            "body": "You could buy a dehumidifier for when you rake showers until you get the fan installed",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThirdHandTyping",
            "body": "Leave a fan overnight pointed at the new openings to get it real dry before resealing. I 'd even squirt bleach along the line.\n\nbut not a full rip-out. until someone shows sickness or breathing issues, if you pay for an air spore check count,  or more mold starts popping up elsewhere repeatedly or in a very large patch. that's not even thick mold, just unconnected tiny circles",
            "score": 1,
            "replies": []
        },
        {
            "author": "kmfix",
            "body": "Normal. Just redo what’s loose.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Thin-Chard5222",
            "body": "It’s super easy and takes 5 min to replace caulking…. Get a scraper. Clean the area and put new caulking… 10min later you can move on with your life.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThrillHouse802",
            "body": "Mold finds a way somewhere in a bathroom, no matter what.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wide-Accident-1243",
            "body": "Agree with others that this is no big deal.  Thoroughly clean off the old caulk.  You might need to use a stainless steel scrubber pad OR a \"red\" ScotchBrite pad to remove all the crud.  We have a plastic tub, and the stainless scrubber pad doesn't harm the surface if you don't go overboard with pressure.  \nClean up the mold...here's how:  [https://www.epa.gov/mold/what-are-basic-mold-cleanup-steps](https://www.epa.gov/mold/what-are-basic-mold-cleanup-steps)  \nLet the whole mess dry and air out for a couple days.  Perhaps bring a portable fan into the bathroom, pointed into the enclosure, to ensure good airflow and thorough drying.\n\nNow the fun part...how to PROPERLY install caulk.  This technique does a nearly perfect job of caulking with straight lines, deeply embedded caulk, and an excellent seal.  \nVery simple:  lay down painter's masking tape on either side of the crevice.  In the case of your tub/shower, place the tape about 1/4\" to 3/8\" on either side of the crevice.  Make sure the tape adheres to the surface well.  \nAdd caulk more sparingly than you might expect.  Wearing a nitrile glove, or with a wet fingertip, press the caulk hard into the crevice; draw out the caulk with your finger to the point where you can see the edge of the tape; smooth it well.  Remove the tape carefully while the caulk is wet.  Have a large trash bag on hand to collect the messy tape.  Stand back and admire your work.  Let the caulk dry according to the directions on the caulking tube.    \nPerfect caulking job with no ugly spread into the tub/shower pan and up the wall.  AND THE CAULK IS PRESSED FIRMLY INTO THE CREVICE FOR AN EXCELLENT SEAL.",
            "score": 1,
            "replies": []
        },
        {
            "author": "realandmagnificent",
            "body": "p",
            "score": 1,
            "replies": []
        },
        {
            "author": "Altruistic_Water3870",
            "body": "No.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Performance_Fancy",
            "body": "When you redo the silicone, fill the tub as full as you can with water. Leave the water there until silicone is cured. Silicone works much better if it’s being squeezed slightly vs pulled slightly. This might even be the reason water was allowed between the tub and silicone to cause this problem. It was likely done with an empty tub, then when weight is in the tub it pulled the tub and silicone apart.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DaBronxbaby",
            "body": "Nothing to worry about it's normal. Just clean it good using Ajax with bleach",
            "score": 1,
            "replies": []
        },
        {
            "author": "rudefruit99",
            "body": "Just cover it back up and pretend it's not there like everyone else.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bright_cold_day",
            "body": "This cannot be real.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Intelligent-Nose4495",
            "body": "Ur joking right",
            "score": 0,
            "replies": []
        },
        {
            "author": "awesumpawesum",
            "body": "If they did not claim mold damage, they may have to pay to remediate. Did u buy as is? That looks like new wall board in the shower, if it's all mold under that... well that's a cover up. A lot of variables but you should really look into this.",
            "score": -5,
            "replies": [
                {
                    "author": "AwkwardPancakes",
                    "body": "The shower is at least a few years old. There is several layers of paint on the edge of the caulking that I am pulling. About 4 layers of paint. And some caulk is new and some is old. I think they installed it when the older couple that lived here before began suffering mobility issues. I think I'm going to try to see if I can take the corner nook off to peek behind there",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Choice_Pen6978",
            "body": "That mold is there because that area is NOT supposed to have caulk",
            "score": -5,
            "replies": [
                {
                    "author": "TC1544",
                    "body": "Yes it is, if it a cast iron tub the lip around the top of tub is only about 3/8”. If it plastic or steel it probably has a 1/2” lip on it. If it isn’t caulked water will get into the edge of tub and run to the front, and down to front corner of the tub. From there the drywall will absorb it, rot the plywood and eventually leak to the ceiling below. If it’s on a slab, the drywall absorb the water, but eventually the studs will mold. The only type tub you don’t need to caulk is a sterling brand with a wall surround for that brand tub. There might be some other brands that have a similar drain design built in.\nThen I stand corrected but from what I see from the pictures you definitely need to caulk it.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "DadVader77",
                            "body": "Look at the pictures. It’s an acrylic tub and shower surround",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "moderndaymedic",
            "body": "Just say no! Caulking is the lazy way...",
            "score": -3,
            "replies": []
        }
    ]
}