{
    "title": "what can i do to cover up this gap?",
    "author": "Educational_Steak794",
    "subreddit": "Home",
    "rank": 18,
    "score": 1,
    "upvote_ratio": 0.67,
    "num_comments (reported by reddit)": 6,
    "url": "https://i.redd.it/mx388ngubdpe1.jpeg",
    "id": "1jdw326",
    "selftext": "light bleeds in through the gap, and i can hear everything that’s happening in the other room. it’s very annoying. help please. ",
    "comments": [
        {
            "author": "Beatrixie",
            "body": "That’s the top of a …door??",
            "score": 2,
            "replies": [
                {
                    "author": "Educational_Steak794",
                    "body": "my house is old as dust so they don’t sell “commercial” (?) doors that fit the dimensions of my frames. a custom would have been far too expensive. some door is better than no door, which is what i had before, but if there’s anything i can do i’d like to know.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Tav00001",
            "body": "They sell 1 inch foam weather stripping that sticks on. It might not be beautiful but I might put it on top of itself to fill the gap. I had to do this on a door to my kitchen  too narrow for the gap you might be able to stack it\n\nOr better yet stick a stip on the door  frame and on the top of the door\n\nhttps://www.amazon.com/dp/B0CBLZ3PF7?ref_=ppx_hzsearch_conn_dt_b_fed_asin_title_4&th=1",
            "score": 2,
            "replies": []
        },
        {
            "author": "BreakingBadYo",
            "body": "Valence curtain or board? Coordinate with adjacent and make it look like one window treatment?",
            "score": 1,
            "replies": []
        },
        {
            "author": "BoringBasicUserID",
            "body": "Either replace the door frame with one that fits modern sized doors or test your carpentry skills by building the door jam and door stop down to meet the height of the current door. You just need some finish grade lumber and some good measuring and cutting skills so it fits properly. Then paint to match. Carpentry just takes time and patience to get it right. Or hire it out to a good finish carpenter who has experience. Like some Amish guy who builds custom furniture could do it in an hour. Call around and find a qualified craftsman rather than a do it all handyman.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Last-Hedgehog-6635",
            "body": "You need a door stretcher! That, or a piece of pine milled to the right thickness and size, then doweled and glued to the top of the existing door.",
            "score": 1,
            "replies": []
        }
    ]
}