{
    "title": "Above Range Microwave or Range Hood Debate",
    "author": "Allora-Va-Bene",
    "subreddit": "Home",
    "rank": 8,
    "score": 2,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/Home/comments/1je2hip/above_range_microwave_or_range_hood_debate/",
    "id": "1je2hip",
    "selftext": "(Only seen old posts on this topic)\n\n**Debate**: Replace above range microwave or get a range hood instaed.\n\n**Background:** Condo is owned-  middle unit so vents up through a cabinet and then out.  Previous microwave vent combo gathered a lot of grease, was hard to clean and the ventilation was a suggestion at best.\n\n**Context**: Above range microwave broke- we have a replacement in the garage but I cook a lot and rarely microwave even when reheating food.  Previous ventilation when cooking on the stove was shockingly bad- couldn't cast iron sear a steak without  the kitchen window and  patio door open (and no it wasn't burnt).\n\nQuestion:  Does anyone recommend installing a range hood instead and if so any recommendations on specs/ features for a similar set up?  Has anyone used/looked into  refurbished range hoods (we have an older kitchen and may opt to remodel in a few years)?  \n\n\n  \n\n\n  \n",
    "comments": [
        {
            "author": "random_precision195",
            "body": "yes get the range hood. pay attention to CFM. low CFM = 200 area, high = 500 area. more powerful = louder though. The light on the range hood is very helpful for cooking. get one that has many filters. very worthwhile investment.",
            "score": 1,
            "replies": [
                {
                    "author": "NinjaCoder",
                    "body": "... but keep in mind, that if you go above some CFM (usually 400) your local building code might require you to provide make up air. \n\nAlso, above 400 CFM requires 6\" duct, whereas OP might currently only have 4\" duct.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}