{
    "title": "How to fill these cracks on front porch?",
    "author": "Ok_Bill_9249",
    "subreddit": "Home",
    "rank": 4,
    "score": 2,
    "upvote_ratio": 0.75,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.reddit.com/gallery/1je7qxs",
    "id": "1je7qxs",
    "selftext": "Which product do you recommend I use? Thank you in advance! ",
    "comments": [
        {
            "author": "Longjumping_Key_5008",
            "body": "I thought this was the kitchen of a mcdonald's",
            "score": 5,
            "replies": [
                {
                    "author": "Ok_Bill_9249",
                    "body": "lol it’s not 😂 came with the house. Not in budget to replace at this moment so am trying to fix what’s there for now",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RagTagTech",
            "body": "I'm not sure you can fill those cracks with anything that will not result in more cracking down the line. you can try grout but I'm not sure if it will be worth it.  this tile is also giving me flash backs of the years i worked in the meat department of the local grocery store..",
            "score": 1,
            "replies": [
                {
                    "author": "Ok_Bill_9249",
                    "body": "Not the meat department!! 😫 I’m not a fan either, trust me, but am trying to fix what’s there until I can replace the tiles.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Venturians",
                            "body": "How big is it, I would get a rotary hammer and drill all of that up. \n\nWhat would you replace it with?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Ok_Bill_9249",
                                    "body": "There are lots of cracks tbh, and I have a feeling it’s seeping into my crawlspace. We may just have to replace the whole thing to be honest. Brick maybe? I thought I could just put some grout in but reading the comments I don’t think that’s the way to go.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Last-Hedgehog-6635",
            "body": "My 2 cents:\n\nBad way: use anything. Snot, top ramen, glue... Granite countertop guys are really good at mixing epoxy fillers to match colors.\n\nBetter way: remove cracked tiles, remove enough substrate to fit an isolation mat without making a trip hazard, then put new tiles on top.\n\nBest way: demo the cracked concrete beneath, or at least enough to ensure you have a stable foundation, pour new concrete with more rebar, retile (over an isolation mat).\n\nYour decision will be helped by knowing how fast that crack is growing and how much money you want to throw at it.\n\n[https://www.youtube.com/shorts/lvEM9VkfE4A](https://www.youtube.com/shorts/lvEM9VkfE4A)",
            "score": 1,
            "replies": [
                {
                    "author": "Ok_Bill_9249",
                    "body": "Thank you. We may need to go with option 3. We don’t love the tile so may as well replace altogether. I have a feeling it’s causing water to leak into our crawlspace, causing other issues.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}