{
    "title": "'Danish Viking blood is boiling.' Danes boycott US goods with fervor as others in Europe do so too",
    "author": "ApprehensiveBat6508",
    "subreddit": "worldnews",
    "rank": 3,
    "score": 6312,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 383,
    "url": "https://apnews.com/article/denmark-europe-france-boycott-usa-trump-6e4b568ef4ae5705ac200a3986a8ebf6",
    "id": "1je3th9",
    "selftext": "",
    "comments": [
        {
            "author": "sock_full_of_mustard",
            "body": "Better to fight and fall than to live without hope. From one red and white to another. 🇩🇰 🇨🇦",
            "score": 891,
            "replies": [
                {
                    "author": "Ghoulius-Caesar",
                    "body": "I’m Canadian of Danish-Ukrainian descent. Trump has my blood boiling from three different angles.\n\nAmerica, why? Do you really want to burn bridges with all your allies for a corny nepo baby who lies every time he opens his mouth?",
                    "score": 307,
                    "replies": [
                        {
                            "author": "Jonsnow_throe",
                            "body": "> mouth\n\nThat's generous. More like a prolapsed second anus.",
                            "score": 94,
                            "replies": [
                                {
                                    "author": "JestaKilla",
                                    "body": "The human body has one hole in it, and it goes all the way through.",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "legos_on_the_brain",
                                            "body": "Yeah, but it's still divided into sections! Don't downplay the sphincters, dude!",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "BaconCheeseZombie",
                                                    "body": "In their relaxed state they all open up, it's why you might poop yourself when you die. It's also why you could conceivably use a corpse as a convoluted crazy straw.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "GeneralTonic",
                                                            "body": "That's really really really interesting.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "BaconCheeseZombie",
                                            "body": "I dunno, that VSauce video on the topic makes a compelling argument for there being seven holes in the body (not counting injuries)\n\n[https://www.youtube.com/watch?v=egEraZP9yXQ](https://www.youtube.com/watch?v=egEraZP9yXQ)",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "The_Corvair",
                                            "body": "I feel there's a case to be made for a second such hole for some particularly deserving humans, but I guess that takes a special sort of plumbing, and talking about plumbing on some platforms seems to have gotten hazardous - so I shan't opine.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "ViciousIsland",
                                            "body": "Why would you tell me that? The mental image is just...T\\_T",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "LongGoneLonesomes",
                            "body": "Apparently they would rather trade with Russia than all of us. That’s the only country trump has said anything good about.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "Ghoulius-Caesar",
                                    "body": "North Korea too…",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Karfedix_of_Pain",
                            "body": "> America, why?\n\nCapitalism, I guess.\n\nThis country has been bought.  They're burning it down to buy-up the ashes.",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "rseed42",
                                    "body": "Not really. This is not good for business. It is more about enrichment of individuals and favors for certain Eur/Asian friends.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "Karfedix_of_Pain",
                                            "body": "> Not really. This is not good for business. \n\nNo, it's not good for business...  But it's great for billionaires.\n\nThey're clearly going to lose money, but they've got enough to weather the storm.  The smaller businesses that go bankrupt can be bought-up for pennies.  And when the economy eventually rebounds they'll own more than they did before.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "rseed42",
                                                    "body": "Sure, I just don't like people who rail against capitalism without qualifiers. Socialism is a whole lot worse, check any post-socialist country. Of course, we are talking about monopolies and oligarchy, which is not capitalism. Capitalism requires governance so that efficient markets are a level  playing field, such that competition rewards innovation. That's what brings prosperity, not socialism. Unfortunately, concentrating money and power tends to distort the system grotesquely, and the resulting inequalities lead to the shit show that we are observing now.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "bever2",
                            "body": "I can't speak for everyone, but there are at least some of us who are just as angry and appalled as you. I've cut off all contact with my parents because my \"conservative christian\" father can perceive no wrong from Trump or Musk or any of their lackeys. It's disgusting, and I'm begging everyone out there to make this hurt. \n\nBoycott American goods, put pressure on your governments. This infection will only get worse unless swift decisive action is taken, and as someone trapped on the inside, I am genuinely concerned that we don't have the power to fix it ourselves anymore.",
                            "score": 22,
                            "replies": []
                        },
                        {
                            "author": "ramblinyonder",
                            "body": "American here, I am disgusted by this shit head. It is pretty obvious he is only out for Russia, himself and his billionaire cabinet.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "No_Date1927",
                            "body": "This American tried everything I could to stop him from being re-elected. All my family connections are trashed now because of it. They’re all brainwashed by a billionaire conman, but I’m an “elitist lib.”",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "SgtWeirdo",
                            "body": "Half of us hate him more than you. The other half are fucking morons.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "an_agreeing_dothraki",
                            "body": "it's the end result of a 50 year campaign of propaganda to ensure autocrats would face no effective backlash followed by, first, a crypto-fascist dismantling the protections of rule of law and 40 years of neoliberal rot.  \n\nThe last 12 years of elections we have been asked to choose between a slow agonizing decay of our lives under the neoliberal policies or immolation. In this context, the third of people who chose the flame and the third that chose not to choose make more sense.",
                            "score": 43,
                            "replies": [
                                {
                                    "author": "MachineOfSpareParts",
                                    "body": "This strikes me as the accurate timeline, which I've been trying to place for a while now. I was teaching politics in the US in 2015 and noticed rhetoric from all the prospective Republican candidates that conformed *precisely* to notes I had on rhetoric from the lead-up to multiple genocides. It was only then that I noticed the grooming process, which is how I see it, but for it to have got that far already, I knew I was late in noticing. 50 years sounds like around what it takes, and certainly there are seeds one can see through the benefit of hindsight in the 1980s.\n\nThe dirtiest secret of genocide (and I do see something like that on the horizon, though perhaps not against a genos in the strictest sense) is that we wouldn't even need a word for it but for the active, willing participation of perfectly ordinary people who love their spouses and kids and cheer for their sportsball team, and in many contexts look pretty decent. And it takes a long, long time to groom these people for genocide. I use the word grooming because it's not even an analogy, it's the same thing: a population needs to be drawn in to commit more and more, without ever realizing the direction in which they're moving until it feels too late to back out.\n\nOf course, we normally use that word when it's a minor being groomed, and it's not their fault. In the present context, we are mostly talking about adults, and they bear significant responsibility in not bothering to notice where they're going. \n\nBut while it may *feel* too late to back out, you can always, always say NO. And in this context, if enough people say no, the event will not take place. Remember, without the active participation of ordinary people, we don't even need the word \"genocide.\"",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "an_agreeing_dothraki",
                                            "body": "context on the timeline: I was referring to Fox News being founded to protect a future Republican president post-Watergate. Nixon himself was the first successful use of modern racial animus through the use of the Southern Strategy.",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "author": "MachineOfSpareParts",
                                                    "body": "That makes a LOT of sense. I buy it fully.",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "hooperman71",
                                            "body": "Thanks for educated, first hand insight. Mid-European here, 50+ living in Western Europe. \n\nFrom what i gather last months... Is the brutal, chaotic civil war in the US inevitable?\n\nThis is my very conservative forecast... More like total anarchy, citizens with legal guns, structures like police & army pushed in situation with no clear belief in who to trust.\n\nApathy and confusion... So until there are no eggs in supermarkets and parents finding out in front of daycare/school that teacher has been deported?\n\nI only visualise rage, panic and again street violence and looting to start with.\n\nAnd the US will not restore credibility internationally, next few decades.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "42nu",
                                    "body": "About as well reasoned as a Dothraki can get.\n\nAmericans don't elect enough Democrats to the House, Senate and Presidency to get FDR level legislation passed and THEN use that as a reason to not vote for Democrats.\n\nMaybe progressive people should actually vote reliably instead of being manipulated into not voting by social media manipulation by adversaries?",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "an_agreeing_dothraki",
                                            "body": "I believe you're missing a huge chunk of what I was saying. Going back to Clinton, the dems haven't... even attempted to try this, instead seeking to appease the bad actors on the right. And this never worked. Remember how the ACA was completely bowing to Republican ideas and they still wouldn't vote for it?  \n\nWhen you're choices are hell, and hell but slower, Posad stops looking so bad.",
                                            "score": 19,
                                            "replies": [
                                                {
                                                    "author": "ErikETF",
                                                    "body": "Its infuriating when the messaging is....\n\nRepublicans: Our platform is 4 men should own everything and have unlimited control over your lives, and have total control over the information you see!  \nDems: AKSHULALLY..... We think it should be 10 people... 3 should be women, and at least ONE should be BLACK, and one possibly closeted but not TOO Gay..",
                                                    "score": 12,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "42nu",
                                                    "body": "The ACA is a perfect example.\n\nThey only had the 60 votes necessary for a period of a few weeks due to special elections and a Senators failing health.\n\nThey COULDN'T pass anything more progressive because they needed Joe Manchin for it to pass.\n\nYour example is literally exactly what I was referring to in terms of needing to elect more Democrats... and you turned it into of example of how when they even have the votes they don't do anything.\n\nI'm sorry, but that is completely, 100% misinformed.\n\nThere's a several hour long Frontline PBS documentary that covers the facts if you're curious. The process of vying for bipartisan votes DID exist, but it had nothing to do with the final ACA bill.\n\nAt one point, the Pharma lobby went from supporting the bill ot not supporting it and that's when votes like Manchin and Lieberman dropped out until the ACA was more neutered. THEY NEVER HAD THE VOTES THAT'S WHY WE NEED TO VOTE **MORE** NOT *LESS* FOR DEMOCRATS.",
                                                    "score": 7,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Pentosin",
                                            "body": "Maybe you should have more options than two?",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "42nu",
                                                    "body": "So I guess we'll call a Constitutional convention and switch to a Parliamentary system then?\n\nOh, wait, non-realistic idealism IS THE PROBLEM ADVERSARIES EXPLOIT.\n\n\"I won't vote until we have first past the post!\"\n\nOh, but to get FPTP we have to vote people in who want that (otherwise known as Democrats).\n\nSee the chicken-egg thing here?\n\nOr, we could not vote and end up losing our Democracy to an authoritarian who stands for the exact opposite of everything I believe in. THAT WILL REALLY SHOW THOSE MODERATE DEMOCRATS. So many downright stupid people with zero foresight on both sides.\n\nNot saying that's you. Just expressing how that works.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "Pentosin",
                                                            "body": "That isnt me.   \n But you are missing a big point here, what you are doing now isnt working.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "42nu",
                                                                    "body": "I think the establishment (legacy Dems and Reps, media, govt workers, etc) had a misplaced faith in the American electorates ability to see everything Trump did AFTER the last election (insurrection, not returning documents, 34 felonies, found culpable of rape, 'finding' votes in Georgia, every thing he says when he opens his mouth) and not give him back power.\n\nThe gamble was \"we'll prove to the world that Trump was a one off, no intervention needed, then he'll be convicted and face consequences and go back to normal\".\n\nThe problem is losing that gamble was, well, everything. The end of our Republic level of everything.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Pentosin",
                                                                            "body": "This has been a problem for MUCH longer than the last few terms. Its just become very obvious how broken your system is, with Trump.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "42nu",
                                                                                    "body": "The U.S. was basically Iteration 1 of modern democratic republics.\n\nWe were like the Beta test that inspired and informed other European nations/states when making their own that they were able to improve upon.\n\nWe just kept slapping on software updates to hold it together for 250 years and it's become a bit of a Frankenstein's monster.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Pentosin",
                                                                                            "body": "Haha, interesting way to put it.   \n\nWhat i find abit wild is that its not impossible to add another party (In theory at least). The Republican party started of as a third party...",
                                                                                            "score": 2,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "SophiaKittyKat",
                                    "body": "I really hope that \"Well, uh, lots of propaganda!\" works out well for you all in history.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Jamaz",
                            "body": "We voted for and failed to vote against self-inflicted mental illness. A cult is now burning down our neighborhood and looking to burn yours and get more followers. Do not follow in our footsteps.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "BaddestPatsy",
                            "body": "The best I can do to try and answer “why” is to say that despite being a melting-pot a lot of Americans are pretty culturally isolated and clueless about the rest of the world. As a Canadian you understand living in an enormous landmass where your biggest international border is a country so culturally similar that we often can’t be told apart. I mean I know there’s important differences between Canada and the USA, but not like the difference across borders of like China and Russia, or even France and Italy.\n\nBut then on top of that you add what I call the “singing in the shower” effect. Our biggest export is media, and it’s loud enough to be heard all over the world. But when you’re in the shower where it’s being sung it doesn’t sound particularly loud even though it’s drowning out everything else.\n\nTrump is very good at playing in the margins of our country’s ignorance and isolation. He’s really good at amplifying and reflecting a collective main character syndrome that’s already there. And because of the singing in the shower effect a really huge amount of us are literally unable to view how this makes us look from the outside. So we loose the sanity check that comes from shame on the global stage. Trump is much more travelled and worldly than most of us, not to mention he has personal relationships with all these foreign leaders. When he says that the country is respected and admired under his leadership but a laughingstock under Biden, a lot of people just assume he’d know better than they would.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "cfmonkey45",
                            "body": "Man, I am so disappointed in my own country. I know people that voted Trump, and their excuse is basically just apathy, or delusion. They think all of this is a negotiating tactic, and that nothing bad will happen.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Ghoulius-Caesar",
                                    "body": "Are many Americans aware of his actual business record? He’s bankrupted a casino for Christ sake. How does anyone believe he’s a “business genius”? Is Fox News just that good at propaganda, or are people that stupid? Or both?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "cfmonkey45",
                                            "body": "YES! We have been told literally since 2015. They don’t care.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "battlesnarf",
                            "body": "Not nearly all of us do. My blood is boiled with you brother, I’m livid.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "boinabbcc",
                            "body": "He's not the problem. He's a symptom of the problem.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Sniper22106",
                            "body": "American here. \n\nWe're not all with this asshole.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "jimothee",
                                    "body": "Not in support...but we'll be going wherever he's taking us",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "No-Eagle-8",
                                            "body": "Shh, don’t tell the repugnants, they’ll think it’s socialism that when a ship sinks everyone that can’t get off sinks too. Not that they’ll do anything about it at all, but they’ll throw a temper tantrum over something else and fuck us over just a little bit more because of it.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "jimothee",
                                                    "body": "God I hate how stupid yet likely this sounds...",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "SophiaKittyKat",
                                    "body": "Less posting about \"don't be mad at *me*\", more protesting physically in real life.",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "lordlors",
                                    "body": "The sad thing is there is not much resistance ala French Revolution style happening in America. Lots of your countrymen are happy with the way things are turning. You seem to be in the minority.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "greiton",
                            "body": "no, but \"And he [Elon Musk] knows those computers better than anybody. All those computers, Those vote counting computers.\" -Donald Trump",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "donnavan",
                            "body": "I know one person who voted for him the first time and zero who voted for him a second time. It baffles me so.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Ghoulius-Caesar",
                                    "body": "What about the third time? He’s been a candidate for three elections: 2016, 2020, and 2024 (four if you count his pathetic 2000 run)",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "PerceptionUpbeat",
                            "body": "I'm Danish with dual Canadian citizenship and I have never been so pissed in my entire life. I studied in the US and I would vacation there \\~1-2 times per year over the last 10 years. Now I want to literally punch every single American in the nose. Whether you voted for the scumbag or not, you are complicit, and I will never forgive you!\n\nEdit: That might have come off a bit too harsh. If you are doing something to stop him and his cronies I don’t blame you. If you are not doing anything I do.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Brilliant-Option-526",
                                    "body": "Blaming people who actively rallied their communities and voted against the mango menace is not a good look.\n\n\\*Edit\\* Thank you for the clarification. We are angry inside the US as well. It's humiliating that even our \"left\" politicians are doing nothing",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "SmokeAlarmsSaveLives",
                                    "body": "So people who voted against him, donated money to his opponents, and campaigned against him are complicit as well? Yeah, doesn’t work that way. \n\nCollective guilt leads to bad, bad things.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "zefiax",
                                            "body": "Until I see Americans taking an actual stand and willing to risk their own well being by starting general strikes, I will keep seeing Americans complicit in allowing this to happen. Democracy doesn't end at the polls. It must be defended every single day and it can't be done without a willingness to risk your own.",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "BigInconsideration",
                                            "body": "Oh shit. The true victim of the threatened annexation. The American.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "OutandAboutBos",
                                                    "body": "He wasn't playing the victim, he was pointing out how there are Americans who are against what's going on. And FYI, there's a lot of fucked up stuff he's doing **within** our borders, too. So yeah, there are Americans that are also suffering.",
                                                    "score": 4,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "SmokeAlarmsSaveLives",
                                                    "body": "Really? You’re going to made snide comments to Americans who loathe Trump? That’s what you woke up to do today? That’s your big goal of the week? You feel good now? \n\nAnd in case you need it spelled out for you - a LOT of people are under threat from Trump and his cronies. The people of Ukraine, Gaza, Canada, Greenland, Taiwan… all the countries of NATO. In America, immigrants, LGBTQ, Federal employees, scientists, professors, judges. The list is long and getting longer. \n\nThose of us inside are doing what we can to preserve and protect our communities and our vulnerable people, and encourage our officials to fight. \n\nIf you don’t want to believe that, then I don’t know what to tell you.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "rusty_103",
                                                            "body": "\"Encourage our officials to fight\" And that's why the rest of us are rightly looking down on you. I've watched other countries fill their streets with millions of protesters and force the issue over much, MUCH smaller issues. You need to learn from places like France and Hong Kong. Until then, you're all just complicity sitting there.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "mightystu",
                                                                    "body": "You have no idea how big and decentralized the US is if you think either of those countries have a comparable ability for people to just “fill their streets” like it’s a matter of taking an hour train ride to get to the capitol for most people.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "mightystu",
                                                                    "body": "You have no idea how big and decentralized the US is if you think either of those countries have a comparable ability for people to just “fill their streets” like it’s a matter of taking an hour train ride to get to the capitol for most people.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "mightystu",
                                                                    "body": "You have no idea how big and decentralized the US is if you think either of those countries have a comparable ability for people to just “fill their streets” like it’s a matter of taking an hour train ride to get to the capitol for most people.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "mightystu",
                                                                    "body": "You have no idea how big and decentralized the US is if you think either of those countries have a comparable ability for people to just “fill their streets” like it’s a matter of taking an hour train ride to get to the capitol for most people.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "SophiaKittyKat",
                                                            "body": "Sorry, no participation trophies.",
                                                            "score": 2,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "BigInconsideration",
                                                            "body": "I actually woke up to go to my career that America is actively trying to takeaway from me, in my country that America is threatening to take away from me.   \n\nSo keep the “not all Americans are bad, why won’t you love me?” Bullshit to yourself. No one wants to hear about it. If it helps you to sleep at night then feel free to fool yourself with it. \n\nYou are not the victim in this situation. At all.",
                                                            "score": -2,
                                                            "replies": [
                                                                {
                                                                    "author": "SmokeAlarmsSaveLives",
                                                                    "body": "Take swings at me all day if you need to, pal. \n\nThe True North MUST stay strong and free. Stay united.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "SmokeAlarmsSaveLives",
                                                                    "body": "Never said I was, pal.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "BigInconsideration",
                                                                            "body": "You sure act like one when someone calls you out on your useless platitudes. \n\n“How dare someone make a mean comment to me? I did the absolute bare minimum. These people should love me!”\n\nI paraphrased.",
                                                                            "score": -2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Snow_source",
                                            "body": "Seemingly the only thing that would appease people who act like this is the US launching into a bloody civil war.\n\nThat's an unequivocally worse situation than what we're in right now for everyone around the globe, not just us. I don't want to be forced to fight and kill my countrymen no matter how much I think some of them are a blight upon the earth.\n\nBut since February all the whackos have crawled out from under their rocks and are screaming for Americans to kill each other to prove we're not all evil. \n\nThat's psycho shit.\n\n75 Million of us voted against TFG and continue to organize, push back and protest.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "SophiaKittyKat",
                                                    "body": "No. Americans just say civil war is the next step because it absolves them from feeling the need to do anything.  \nThe fact that hundreds of thousands of people aren't protesting is really indicting for the rest of the world, you all seem largely complicit or at best uncaring at this point.\n\nI find the people making comments like this are the most likely to be doing nothing, because those willing to do something simply understand the anger, rather than trying to explain why they shouldn't be angry.",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Reclaimer2401",
                                                    "body": "No.\n\nThe overwhelming Majority are not organizing and protesting. A tiny fraction of you are actually actively organising against the fascists.\n\ncountries of 7 million in Europe have movements of 100k+ showing up to protests. America, a country of 350+ Million, has crowds in the hundreds. What does that tell you?\n\n99% of you are complicit.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "OutandAboutBos",
                                                            "body": "This is a massive misunderstanding of the US. We have a huge population.... that's spread out over a distance that's as big as the majority of Europe.",
                                                            "score": 5,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "zefiax",
                                                    "body": "Why do you Americans always think violence is the only option? You are not the only country to have faced these challenges in the past or presently, you are just the only democracy not taking action against it. General strikes. Shut down the economy. Be willing to suffer in the short term to defend your country. Not everything requires violence.",
                                                    "score": 0,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "orzosavo",
                                                    "body": "75 Million voted for Trump and another 90 Million more couldn't get off their collective asses to fucking do their civic duty in preventing all of this bullshit.",
                                                    "score": 0,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "PerceptionUpbeat",
                                                    "body": "\nHyperbole much? Most Americans are not actively protesting what is going on right now. That is the issue. I get that Redditors probably are doing more than the average American, but the reality is that most Americans are just going on with their life as usual, while their tax dollars are already being used to wage war against allies.\n\nNobody wants to see a civil war, just like no one wants to see an annexation.",
                                                    "score": -1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "8fenristhewolf8",
                                    "body": "> Whether you voted for the scumbag or not, you are complicit, and I will never forgive you!\n\n\nMuch like I blame and never forgive Danish people for rolling over as Nazis 🙄",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "PivotRedAce",
                                    "body": "You have every right to be pissed off, but blaming people who ostensibly are on the same side as you is not a productive mindset to have. The opposition to orange man needs support, not derision by association.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "mightystu",
                                    "body": "The important thing is you get to feel righteous indignation so you can justify this sort of wrathful vitriol.  This is painting with a brush so broad to be damaging.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "cobywaan",
                                    "body": "Please explain to me my complicity in voting against him and MAGA in every elect, local, state and Federal, since 2016.\n\nPlease explain to my complicity in campaigning against him and donating towards other parties and candidates.\n\nI am pissed and hurting. You want to blame me for something I did literally all that I can as an individual to avoid? I cannot stop you, but I hope you realize that by holding this stance, you are on your first step to becoming MAGA yourself.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "zefiax",
                                            "body": "Until Americans are willing to risk their short term financial well being by launching general strikes, no I do not think Americans have done all they can to stop this madness.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "AccomplishedCat8083",
                            "body": "Do you think there aren't Danish or Ukrainians in the USA?",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "CoquitlamFalcons",
                            "body": "Want it or not, it is happening.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "subnautus",
                            "body": "> America, why?\n\nI wish I could speak on behalf of the imbeciles who voted for Trump, but...I can't.  I simply can't understand what drives them to care so little about the world, their fellow Americans, and even themselves.\n\nAt best, I guess it's because they're victims of the worst kinds of propaganda--like if you look at what Fox News puts out compared to just about any other news outlet, you'll see not only does Fox *not* talk about things like this post's article, they replace it with scare-mongery bullshit.\n\nIt's not surprising that Fox News is like that.  After all, it was founded and still owned by a guy who made it his life's goal to put a \"conservative spin\" on the news after watching how people reacted to *the truth* about Nixon's Watergate scandal.  What surprises me is how much people who watch it don't see it for the blatant propaganda that it is.  Worse, they accuse anything that disagrees with Fox News as being \"fake news.\"  It's baffling.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Different-Hyena-8724",
                            "body": "He represents a discontent with the status quo and no vision for the future. Most americans republican or democrat are tired of financing the worlds problems and proxy wars and possibly where the less hateful sentiment is coming from this time around.  Liberals themselves started being called racists, homophobic, etc and I think they just checked out and said \"fuck this, I'm taking my toys and going home\" and didn't give a shit about the outlook as the perception of a liberal led country didn't provide again a vision for the future.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Ghoulius-Caesar",
                                    "body": "Punk/rebellious movements can’t ever be led by billionaires. \n\nPeople voting for Trump to “stick it to the man”, yet they’re really giving it all to the richest 1%? \n\nDoes this piss anyone else off?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Different-Hyena-8724",
                                            "body": "Are you American or not? I'll try to tailor my responses accordingly. And I agree with the movements can't be led by billionaires.  But we have a problem of 'offing anyone who goes against the grain of public sentiment.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Cptn_Canada",
                    "body": "Well fucking said. Wethenorth 🇩🇰🇨🇦",
                    "score": 24,
                    "replies": []
                },
                {
                    "author": "sweeeeeeetjohnny",
                    "body": "The red dye actually blood from all of the Authoritarians",
                    "score": 16,
                    "replies": [
                        {
                            "author": "MachineOfSpareParts",
                            "body": "And their enablers.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "log1234",
                    "body": "If not for the fact that we are both so cold in the north, we would make Denmark our new Florida!",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Low_Tell9887",
                    "body": "Not sure if you’re Danish or Canadian, but regardless WE are the North. Red and white need to stick together 🇨🇦 🇩🇰",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "PartyOnAlec",
                    "body": "I'm an American who absolutely loved my time in Denmark. Please please make us feel this. Please make it less possible for us to delude ourselves into this situation again. Show us that the rest of the world won't take our bullshit. I say this as someone who believes we can and must be better. Help the...*simpler* members of our population understand.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ninjastampe",
                            "body": "\"Make us feel this\"? Man what the fuck? Fix your own god damn country, you voted for this nonsense. America got what it wanted, and in the eyes of everyone else, what it deserves. And don't come back to EU when the going gets hard. Show the test of the world that there are Americans left who are worth believing in, and show it by actions and not words.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "silos_needed_",
                    "body": "How come you caved against the nazis lol",
                    "score": -2,
                    "replies": [
                        {
                            "author": "bbcversus",
                            "body": "How? They helped thousands of Jews for being deported…",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "silos_needed_",
                                    "body": "Whe the Germans invaded they surrendered in 6 hours... that's caving",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "bbcversus",
                                            "body": "Yea and? They still saved thousands of Jews and managed to form a strong resistance… why are we talking about this? What is your point?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "silos_needed_",
                                                    "body": "The original said it's better to fight than fall, i asked why didnt the Danes do that in ww2?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "bbcversus",
                                                            "body": "The government at the time caved but not the people as they formed a strong opposition and helped thousands… the original commenter is part of the people not the government.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "silos_needed_",
                                                                    "body": "Nope, the people voted for the leaders in 1939, which means the people of Denmark are responsible. Just like how the people of the USA are to blame for Trump.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "bbcversus",
                                                            "body": "The government at the time caved but not the people as they formed a strong opposition and helped thousands… the original commenter is part of the people not the government.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "zenbu-no-kami",
                    "body": "Can england join? 🏴󠁧󠁢󠁥󠁮󠁧󠁿 \n\nOur children have grown arrogant.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "ninjastampe",
                            "body": "After you fix Brexit then yes, you'll be happily welcomed.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Low_Tell9887",
                            "body": "Only if you’re down for CANZUK. I think now more than ever is the time.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Downtown_Snow4445",
            "body": "Canada too. All of our grocery stores here have Canadian items marked on the price tag so we can skip over the American products",
            "score": 303,
            "replies": [
                {
                    "author": "HamRove",
                    "body": "While I’m no fan of Loblaws I think their tariff symbol will be helpful for weeding out American items specifically.",
                    "score": 75,
                    "replies": [
                        {
                            "author": "JackBlackBowserSlaps",
                            "body": "Just fyi, there have been many anecdotal stories of loblaws marking American products as Canadian. Don’t just trust their symbols, check yourself.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "nitpickr",
                                    "body": "While I'm not from Canada I'm pretty they will have an ombudsman that a complaint can be sent to.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Fluid_Jellyfish9620",
                            "body": "don't buy at Loblaws...",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "NinjaRedditorAtWork",
                                    "body": "Not everyone has an option to.",
                                    "score": 22,
                                    "replies": []
                                },
                                {
                                    "author": "proofofderp",
                                    "body": "👆",
                                    "score": 0,
                                    "replies": []
                                },
                                {
                                    "author": "Konstiin",
                                    "body": "Why",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "pacey494",
                            "body": "If we trust it, then yeah. Seems like an easy way for them to bolster their margins by sprinkling some T's here and there",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "Downtown_Snow4445",
                                    "body": "Piss off",
                                    "score": -25,
                                    "replies": [
                                        {
                                            "author": "pacey494",
                                            "body": "You trust Loblaws to do the right thing? The company that got done for price-fixing bread?!",
                                            "score": 15,
                                            "replies": []
                                        },
                                        {
                                            "author": "paradigm_shift2027",
                                            "body": "Just saw a post showing that Walmart is putting Maple Leafs on American & other foreign products. If you think these companies are moral, you haven’t seen how rich their owners are.",
                                            "score": 17,
                                            "replies": []
                                        },
                                        {
                                            "author": "Itsprobablysarcasm",
                                            "body": "You're out of line. That person's comment is absolutely correct. Loblaws cannot be trusted. They were caught fixing the price of bread and deliberately ripping off their own customers for years.\n\nThey were also bragging about record profits during Canadians inflation because they were juicing their product prices and using inflation as cover.\n\nThem slapping a 'T' on popular brands is a stealthy way to jack up prices and blame it on the tariffs.",
                                            "score": 16,
                                            "replies": []
                                        },
                                        {
                                            "author": "HamRove",
                                            "body": "Simmer down there pal.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "RickySan65",
                            "body": "the same loblaws that raised prices on Canadian products? $3 extra on toiletpaper then marks it as a deal, while the normal price is $3 lower? that loblaws?",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "Flash604",
                                    "body": "Where I live (and no, it's not remote), the choices are either stores that are even more expensive than Loblaws or American stores such as Walmart and Amazon. I was boycotting Loblaws for almost a year, but as I'm not rich I'm forced to return to them to ensure my money isn't going to the US.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "42nu",
                                    "body": "Less Loonies on labels?\n\nWe lampoon loblaws listing lower lamp, lentil, lo', even litter bin prices. Lamentingly listed lower only AFTER lifting listed Loonies per lollypop.\n\nLitigious litigation likely limits loblaw later; lest we lose logic!",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "houlio79",
                    "body": "We need a “Not USA” tag. I’d buy from other places.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "FantasticDuplex",
                    "body": "If we had that in America, I too would skip the American products and only buy Canadian.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Downtown_Snow4445",
                            "body": "Thanks for saying that 🤙",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "FantasticDuplex",
                                    "body": "I love Canada. Always wanted to live there. Now I am stuck in the US with a crazy fascist dictator, trying to hunker down and prepare to survive the next 4+ years. We have literally become preppers. On top of that, I am stuck in a red state. Please don't forget that SO many of us tried SO hard to prevent this, and are still trying.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "topsyturvy76",
                    "body": "Some stores are being deceiving, check the label not the aisle tag .. if it’s American - flip it upside down, then flip it off and go find a *Canadian* or *friendly ally* alternative. \n\nSorry US, *not actually sorry*",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "log1234",
                    "body": "Very soon Trump doesn't have to subsidize us! /s",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Moronto_AKA_MORONTO",
            "body": "Love hearing this, Canada is with you on this. \n\nAlso avoid all types of travel to the US, one for his annexation threats, and two ICE are detaining internationals over there.\n\nEdit: Also boycott brands like Apple.  If you can't live with Apple, then don't upgrade until its absolutely necessary or look at the second hand market.",
            "score": 187,
            "replies": [
                {
                    "author": "Pandoras_Fate",
                    "body": "Man I hate this. Canadians absolutely rock and always bring the party positivity. We miss you, but we get it.\n\nI feel like I can't be friends with the kid next door anymore cause my dad is an asshole and I'm so embarrassed.",
                    "score": 87,
                    "replies": [
                        {
                            "author": "Moronto_AKA_MORONTO",
                            "body": "It's sad, and we know that like 80 million didn't vote for the Orange Hitler, but we need that 80million to boycott the red state economies until they are squashed.",
                            "score": 44,
                            "replies": [
                                {
                                    "author": "sun_and_stars8",
                                    "body": "Trying to!",
                                    "score": 21,
                                    "replies": [
                                        {
                                            "author": "Moronto_AKA_MORONTO",
                                            "body": "Stay strong, the world is with you as we know you're basically prisoners in your own country.  \n\nLaws and democracy don't mean anything anymore in the US, you are the least safe.",
                                            "score": 11,
                                            "replies": []
                                        },
                                        {
                                            "author": "MachineOfSpareParts",
                                            "body": "Trying is all we can ask. \n\nHistorically, authoritarian regimes have generally been ousted from within, but with support from transnational networks. The classic presentation of this is laid out in Daniel Thomas' Helsinki Effect, but long (and probably physically inaccessible) story short, civil society in country A connects with civil society in countries B-Z who a) provide material and organizational support, and b) pressure their own governments to hold country A's accountable. Thus, Government A gets boxed in from all directions.\n\nThat's my way of saying your civil society organizations just have to say the word. Tell us what you need. We're doing part b) already, but give the world a shout as to how we can help with part a).\n\nYou *will* restore democracy. It's going to suck for a while, and I have some dark predictions I'll keep to myself for now, but so long as enough of you are trying, *you will prevail in the long run*.\n\nThey want you to lose faith in yourselves. Don't let it happen.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "danvsmondays",
                                                    "body": "What we need is for the rest of the world to make it hurt. Those of us who are still sane have been trying to fight Trump for years but there's simply nothing we can do when so many people still support him. They really need to feel the consequences in order for them to wake up",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "NinjaRedditorAtWork",
                                    "body": "80 million didn't vote for him but the rest either did or didn't care if he won. It's not just the red states that are fucked with america right now.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Pilot0350",
                            "body": "That's is absolutely the correct analogy. One of the other bartenders at my work just went home to Canada because of all this and now my work bestie is gone and I hate it. Dump and Peeon can eat my whole ass. This sucks",
                            "score": 18,
                            "replies": []
                        },
                        {
                            "author": "puppylovenyc",
                            "body": "Exactly how I feel.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "JackBlackBowserSlaps",
                            "body": "Speak up now more than ever, and normalize hating Trump. The more you appease him and his followers, the worse it becomes. (Acknowledging that this is easy for me to say from Canada)",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "LongGoneLonesomes",
                            "body": "You can still come to our house. Our dads cool and has weed.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Thosam",
                    "body": "Dane here. Doing my best. \nMy planned trip to NYC and EastCoast will be Montreal/Toronto instead.",
                    "score": 19,
                    "replies": [
                        {
                            "author": "Moronto_AKA_MORONTO",
                            "body": "💪🇩🇰",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Thosam",
                                    "body": "At some point you guys may want to go into r/danmark and/or r/denmark with a LOT of travel advice and suggestions for trips and sights in Canada.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Moronto_AKA_MORONTO",
                                            "body": "Will do, though they would probably get better and more widespread info at r/buycanadian. \n\nThat sub should be the outline for other subs for countries to follow.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "dannypants143",
                    "body": "As an American, I’m with everybody on this!  For what it’s worth, there are so many Americans just like me who absolutely hate what is being done in our name.",
                    "score": 21,
                    "replies": [
                        {
                            "author": "Moronto_AKA_MORONTO",
                            "body": "We know half the country is against the Orange Fuhrer and this fight is to liberate you as well seeing the attack on democracy and law puts you most are risk. \n\nA combined effort to destabilize all the red states by boycotting their economies would go a long way with the educated half of the US helping 😀",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "Fit_Pangolin6410",
                                    "body": "much closer to a third than half. Non voters (that were eligible to vote obviously, not talking about children) deserve the same blame as trump voters.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Moronto_AKA_MORONTO",
                                            "body": "Very true.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "FantasticDuplex",
                                    "body": "There are some of us who are trapped in red states who absolutely hate the orange goon and never supported him or anyone like him. We are prisoners in our own city, state and country. It really sucks, and is quite terrifying.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Moronto_AKA_MORONTO",
                                            "body": "Yes its unfortunate that you in those states are caught in the crosshairs like this, but hopefully you'll be on the right side of sanity soon enough. Its the only way.",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "treemanswife",
                                            "body": "Yep, I am one of those.  Don't want to leave my home, don't want to move to a city.  Lose lose.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "huehuehuehuehuuuu",
                            "body": "Honestly while we are getting tariffed and having our sovereignty and livelihoods threatened, you guys are in serious danger too. They are stealing money from you, outright dismantling weather, disaster, healthcare, environmental services, the parks, and research. People die from mistakes made in these services. More will die as they mess with it all intentionally to destroy the country.\n\n\nIt is both sad and scary to see as a neighbour.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "danvsmondays",
                                    "body": "They're doing it on purpose. Their goal is to break everything so that private companies can swoop in and \"save the day\" when everyone is desperate.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "noradicca",
                    "body": "Thank you friends, from Denmark. I believe most Danes always have felt that we have a lot more in common with Canada. Watching you stand so strong against the attacks from the US is inspirational and gives us hope.                 \n🇨🇦🇩🇰",
                    "score": 25,
                    "replies": [
                        {
                            "author": "Moronto_AKA_MORONTO",
                            "body": "Likewise. \n\nCanada is more Euro than American, only geography links us to them in reality. Had a few Dane friends growing up, Stregt Flaesk I think it is?  FTW 🇩🇰🇨🇦",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "noradicca",
                                    "body": "Very close, it’s “stegt flæsk”, but you are excused of course, not having the letter “æ” in your alphabet. How funny that you know about our national dish 😃                 \nOne of my best friends moved to Canada and is now married to the most kind, funny and chilled Canadian woman. They both confirmed the many similarities in our societies, people, politics, worldview etc etc.                        \nWe stand united, with the rest of Europe too, in fighting this madness.                        \nFTW 🇨🇦🇩🇰",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Moronto_AKA_MORONTO",
                                            "body": ">How funny that you know about our national dish 😃\n\nI've had it many many times as a kid every time we'd go play at their house. So much so I would try to get my mom to make it 🤣",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "noradicca",
                                                    "body": "😄 It’s amazing if made right (pretty easy tho). Just had it myself two days ago. On my top 5 favourite foods list👍",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Moronto_AKA_MORONTO",
                                                            "body": "I haven't had it in decades, I also remember a fruit berry dessert dish I would eat there that I have no clue its name lol.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "noradicca",
                                                                    "body": "Oh we have a lot of berry desserts, apples too. Because they grow here naturally. But I’d think you would have a lot of that as well, since our climate is in the same zone (don’t know how to say that exactly, but you know). \n\n\nI’ve never been to Canada myself, but I hope I’ll be able to visit my friend and his new family over there soon.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Drahy",
                                            "body": "* æ = ae\n*  ø = oe\n*  å = aa",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "noradicca",
                                                    "body": "You got it.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "UnluckySeries312",
                                    "body": "You know there’s an element of truth in this.  I found Canada to look like America but the people felt more European. I can’t really explain it",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Moronto_AKA_MORONTO",
                                            "body": "That's because most of us are Euro blood here lol. \n\nThe high school I went to had more first generation Canadians born to Euro born parents than actual 2nd+ generation Canadians. \n\nTwo of my best friends growing up happened to be Dane (actually I could say that about every country in Europe I bet). Massive Michael Laudrup fan growing up 💪🇩🇰",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Pentosin",
                    "body": "The rest of the world can manage fine without Apple. Apples market share is largest in the US.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Moronto_AKA_MORONTO",
                            "body": "Yes, its inherent that people in Blue States/Democrats recognize this and notice the trends\n\n*Apple is investing heavily in US manufacturing, including a new server facility in Houston and expanding data center capacity in states like North Carolina, Iowa, and Arizona, while also expanding its advanced manufacturing fund and opening a manufacturing academy in Detroit.*\n\nNotice what color those States are...",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Ares6",
                    "body": "Yeah, but also Reddit. ",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Moronto_AKA_MORONTO",
                            "body": "I'd argue that the net effect of the info sharing over this on Reddit is actually a negative to the Americans lol.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Ares6",
                                    "body": "I get it. But it’s still a US service and regardless revenue is still flowing into the US. People aren’t going to stop using WhatsApp or Instagram in other countries. Despite the fact that Meta gave money to Trump. Or Amazon which is also doing the same thing. Not buying American liquor won’t even do much. But not using Amazon, Apple, Meta or other large products from US companies would make a much larger impact. Hitting the US tech industry would make the biggest change. ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Moronto_AKA_MORONTO",
                                            "body": "I've cut off using Amazon, and have never used  any of those services apart from this, only because I think the crowd sourcing of info will be a net negative for them as a whole.  Hopefully\n\nThere are necessary evils one must take for the greater good ATM",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "acathode",
                    "body": ">  If you can't live with Apple\n\nThe Apple-only stuff is a very American thing - in Europe very few people gives a shit what phone you use. \n\nObviously there are people who prefer Apple's products due to the UI, OS, ecosystem, etc - but there's far less of them and we don't have the whole \"OMG YUK! He's texting us from an Android!!!\" thing.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "PlasticEyebrow",
            "body": "Dutchman here (sry about the spineless Rutte act with Trump the other day, it was cringeworthy). \n\nThis situation made me realize how many US products I was always buying, a lot on Amazon as well. I have been doing what I can to not buy US products anymore, I stopped using Amazon, I cancelled a lot of US subscriptions, ordering non US products where before I would. \n\nTogether we are strong! Fuck Trump and his first lady, Elon.",
            "score": 122,
            "replies": [
                {
                    "author": "AskMoreQuestionsPls",
                    "body": " Canadians are doing the same ! Hopefully, we can make better and stronger relationships !",
                    "score": 22,
                    "replies": [
                        {
                            "author": "Lunarath",
                            "body": "That's the Danish, not the Dutch flag. Close enough I guess.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "AskMoreQuestionsPls",
                                    "body": "Oh man, sorry, I need more coffee .",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Lunarath",
                                            "body": "Don't worry lol. Confusing the Dutch and Danish is more common than you may think.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "AskMoreQuestionsPls",
                                                    "body": "Thanks ! I don't think I'll tell you Danish friend tho.... she kinda scares me a little 🤣",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "didasrooney",
                    "body": "Cancelling my subscriptions like  🏴‍☠️",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "DistanceRelevant3899",
            "body": "If the US economy tanks the Trump administration will blame liberals and wokeness. And the MAGA crowd will believe him.",
            "score": 64,
            "replies": [
                {
                    "author": "Pristine-Test-3370",
                    "body": "It maybe part of their plan, their 2025 agenda and the minds of people like Steve Bannon and Stephen Miller, who are the ideologues. Support for totalitarian regimes is always based on a framework of “us” vs. “them”.\n\nEdit: typos",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "Irr3l3ph4nt",
                    "body": "Well, let them. Not my problem.",
                    "score": 39,
                    "replies": []
                },
                {
                    "author": "boostman",
                    "body": "And immigrants. And use it to justify tighter control and the sale of the public sector to private enterprise.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "WackHeisenBauer",
                    "body": "Let them tear each other apart. Fuck em.",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "SmurfStig",
                    "body": "This is exactly what will happen. We already went through this once and too many didn’t learn. At this point we need to get royally fucked like this in the hope we can get people to realize our Conservative Party is gawd awful for anyone who likes to live.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "kiwiphoenix6",
                            "body": "Case in point - Brexit.\n\n\\- Brits voted the conservatives into office in 2010.  \n\\- In 2016 they voted 51-49% to screw the Euros.  \n\\- Tory government then got 4 ***more*** years to prep for said Brexit, and then 4 ***more*** years to execute it.\n\nFinally last year people looked around and realised that, hey, after all that ***still*** nobody seems to know what the fuck they're doing, and everything's only gotten worse.\n\nAfter ***fourteen years of uninterrupted rule***, 2024 saw the bastards delivered the most crushing electoral defeat they've suffered in two centuries, losing 2/3 of their seats overnight. It was glorious.\n\nIf people suffer badly enough for long enough, ***eventually they do learn***.\n\n  \nPS: 'course, given what's happened in the first 57 fucking days, it'd be nice if folks over there could kindly speedrun things a bit. Not sure what'll be left to save after 1400 more days of this.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "SmurfStig",
                                    "body": "1400 more days will make North Korea look like a vacation hot spot.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "DoireK",
                                    "body": "Unfortunately the only reason the defeat was so heavy was because the far right reform UK party (led by Farage) split the vote with them and that was fatal in a fptp voting system. A lot of votes went further right instead of to the centre unfortunately.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "onFinal",
                    "body": "He's already doing that.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "danvsmondays",
                    "body": "That's why the world needs to keep getting in front of cameras and saying loud and clear who's responsible",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "fortuneandfameinc",
                    "body": "Or it is a wag the dog and this riles up anti Canadian sentiment to justify putting US soldiers in canada to 'secure' critical resources l.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "HorseSashimi",
            "body": "Even around the other side of the world, in another hemisphere, we have taken notice. \n\nIf the Yanks want to shaft their allies, lets hit them back and not buy their products and services.",
            "score": 36,
            "replies": [
                {
                    "author": "Patriots_throwaway",
                    "body": "So like can you back out of AUKUS and return our F-35s? I heard China is selling new stuff ;)",
                    "score": -34,
                    "replies": [
                        {
                            "author": "austic",
                            "body": "Pretty sure Canada is evaluating European options instead of the F35 as well.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "Caveman-Dave722",
                            "body": "Aukus could be scrapped I guess make it just uk\nAnd Auz they using rolls Royce reactors.so uk could build them some astute class if auz wished.\n\nCanada is looking at dropping f35 for eurofighters not ideal with the no stealth, but can’t trust the US to allow them to be used.  We saw this in Ukraine, no point having fancy equipment you can only use when the US approves",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "HorseSashimi",
                            "body": "AUKUS was about getting the next gen UK nuclear attack submarines. The Virginia class is a stop gap measure till they come online.\n\nAs for the F35's, that will probably be the last subsidised, and codeveloped airframe the USA has with western nations.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Gammelpreiss",
            "body": "And just like that the US has changed from a 80 year old ally too an enemy like Russia and China. But then again americans were probably always a bit too high on their own \"shining beacon on the hill\" propaganda.",
            "score": 64,
            "replies": [
                {
                    "author": "floatingsaltmine",
                    "body": "From an eurocentric view, the US is more of an enemy in the sense of being an irrational actor than China, by far. Russia is threat #1, followed by the US by quite a distance and then China.",
                    "score": 22,
                    "replies": [
                        {
                            "author": "Brisby820",
                            "body": "Based on what actions specifically?  What has the US, in fact, done to make it an enemy to Europe?  A lot of cheap talk and some tariffs \n\nEdit:  I’m actually asking, this isn’t a rhetorical question ",
                            "score": -18,
                            "replies": [
                                {
                                    "author": "Username_075",
                                    "body": "No-one in Europe thinks it is cheap talk. The President of the United States is talking. That makes it the literal expression of US policy. \n\nNot just talking though, he's making real threats to former allies to incorporate them into the US. Then launching a programme of economic warfare in support of that goal. In the past wars have started over less. \n\nAnd let's not forget suddenly reversing US policy and appeasing Russia, making Europe a materially more dangerous place. Before this is over US policy will cost European lives as a result.  \n\nSo that's why. The US has thrown away everything they worked for since ww2 and that hits Europe like a bombshell. Actions have consequences.",
                                    "score": 38,
                                    "replies": []
                                },
                                {
                                    "author": "BaronMostaza",
                                    "body": "Threatening invasion...",
                                    "score": 19,
                                    "replies": []
                                },
                                {
                                    "author": "sittinginanappletree",
                                    "body": "By cheap talk, do you mean 'meaningless' talk? Assuming for the moment that the invasion threats are meaningless and an actual invasion is notintended, a massive nation state with financial and military dominance that communicates meaninglessly will still get viewed as irrational. Any irrational actor with a lot of power will be viewed as a serious risk.  Enemy is not the right word, but  America being the biggest Danger could have the same negative impacts as if it were an enemy. \n\nHe's not being serious, he's just joking around, it's just negotiation tactics...yeah maybe,who knows (if they're not deliberately tanking the entire Nation to buy it back for pennies), but it's naive to expect other nations to be mind readers. At some point words have to mean something, it's the whole point of having language. Don't expect trust without honesty.",
                                    "score": 17,
                                    "replies": []
                                },
                                {
                                    "author": "DeliberatelyDrifting",
                                    "body": "The US is completely compromised.  It's clear to the world that our laws are meaningless.  It's clear that our current administration, and by proxy many Americans, have no respect for our allies, or anyone for that matter.  It's clear that this is not a fluke and is getting worse by the hour.  Would you share a vital secret with trump?  Do you trust trump to not get mad at something and randomly jail your citizens who happen to be here?  What would you call the current US policy regarding Canada and Greenland if not \"openly hostile?\"",
                                    "score": 13,
                                    "replies": []
                                },
                                {
                                    "author": "floatingsaltmine",
                                    "body": "There has been a lot of unprecedented, hostile talk and the Trump administration has started a trade war against basically every other western nation that have been key allies of the US for decades. The US have abandoned Ukraine on a whim and are cozying up to Russia. Trump has basically buried Pax Americana within a few weeks. There has also been talk about leaving NATO, invading Canada or Greenland and other insane stuff. The current administration over the last ~two months has been so erratic that it's impossible to predict what the world will look like in two months.\n\nWhy Russia is a threat is obvious. It remains the main threat to Europe.\n\nChina however is currently no military threat, in fact they are building soft power across the globe while the US squandered it. China is by far the most rational actor of the three.",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "42nu",
                                            "body": "I would contest that its \"been so erratic that it's impossible to predict what the world will look like in two months\".\n\nThe administrations legal (and illegal) moves have been very well choreographed and clearly have a planned trend of boiling the frog going further and further into unconstitutional actions.\n\nThe chaos itself is planned and is there to destabilize the world order that the U.S. led.\n\nWe can pretty easily predict where we'll be in 2 months:\n\n1. Closer to ending sanctions on Russia while tariffs on our allies keep rising, thus magically making Russia a no brainer to trade with (without tariffs).\n\n2. The goal of nullifying the judicial system and enacting martial law domestically without being stopped will keep pushing forward\n\n3. The goal of arresting U.S. citizens without due process will either have happened or imminent. Over months this escalates to journalists, political foes, protestors and people exercising free speech that is relabeled as 'inciting terrorism'.\n\nThis is not chaos. This is a well choreographed plan.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Overwatchingu",
                                    "body": "1. Undermining Ukraine by cutting off support for systems such as HIMARS guidance and intel sharing while Ukrainians are fighting back against a genocidal invasion. \n2. Offering up parts of Ukraine to Russia as if it’s theirs to give.\n3. Seeking to end sanctions on Russia, which would allow them to make money on the US market and bring in more funding for their war against Ukraine.\n4. Threatening to annex Greenland\n5. Threatening to annex Canada\n\nIn general, just trying to help Russia and hinder Europe and Ukraine.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "lebennaia",
                                            "body": "We can add to that Musk, who seems to be running the US government at the moment as royal favourite, has called for the invasion of the UK, and been promoting neo-Nazis both in Germany and the UK.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "42nu",
                                                    "body": "Musk hasn't done an interview or been attention seeking since he teared up on Fox about his businesses doing poorly.\n\nSide note: TSLA is down over 5% today... again.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Pentosin",
                                                            "body": "> TSLA is down over 5% today... again\n\nGood. Make him feel that his shitty actions have consequences.",
                                                            "score": 4,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "42nu",
                                            "body": "Ending sanctions on Russia would be a big nail in the coffin of SWIFT and USD hegemony over international trade.\n\nWould give a large incentive for the largest economy on the planet (the EU) to implement more trade in Euros to ensure their sanctions are harder to avoid.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Brisby820",
                                            "body": "His actions with respect to Ukraine have been awful, no question about it.  At its most generous, he’s trying to negotiate a peace deal and is in way over his head and too stupid to realize he’s getting played.  I don’t think that makes the US an enemy of Europe more generally though, unless you think the last 2 months cancel out the prior years.  On balance, we’ve done more to help Ukraine than hinder it.\n\nThe annexation stuff — yes, bad.  But it’s all bullshit ",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "author": "UnluckySeries312",
                                                    "body": "You cannot threaten a neighbouring nation without consequences.  Canada boycotting goods will be the start of it. Next they will cancel defence contracts as will Europe. This alone will take years to fix, other nations will stop dealing and cooperating with the US. they will instead sign trade agreements and decide to either manufacture defence equipment in house or more collaboration between them. They will look to more stable relationships.  None of this fixable overnight.\n\nIt’s not just ‘I was joking bro’ and it all goes back to normal.",
                                                    "score": 5,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Gammelpreiss",
                                                    "body": "no, he is not negotiating a peace deal, he is factually helping and supporting Russia to achieve all their goals. The result of that if it happend would not be peace, but the prelude to a much bigger conflict. you folks have no idea what is going on in Europe currently and how your appeasment and reaproachment with Russia is worse then even Munich 38.\n\n\nthe US has become a real and extremely dangerous threat to Europe and the continent is currently acting accordingly. Germany just enacted it's greatest rearmament program since the 30ies of last century not just with Russia in mind. Other european countries are acting similiarly.\n\n\nthis is not just silly talk from a clown, no, this will end in blood, one way or another",
                                                    "score": 4,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "42nu",
                                                    "body": "Why be so generous?\n\nThere is DECADES of evidence that Trump is a Russian puppet and is thus directly antagonistic to Europe.\n\nIt DOES cancel out former support for Europe and Ukraine because he is OBVIOUSLY trying to become an authoritarian who is 180 degrees different from the U.S. we knew for 80 years.",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Black08Mustang",
                                                    "body": "> unless you think the last 2 months cancel out the prior years.\n\nIf your child picks up a drug habit and start steeling from you, do you continue to leave money and valuables available because they did so well the first 16 years? No, they've broken a sacred trust that will take years to rebuild. This is the same thing.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "Brisby820",
                                                            "body": "Yeah, I understand.  The flip side is that the only US leverage is that it provides so much support.  That’s why we’re able to meddle in this.  If European countries made up for the lost US support, then the US would have no leverage here.  Which begs the question why the outcome of a European war turns on US involvement.  \n\nI’m playing devil’s advocate — I think the US should support Ukraine and help it fight Russia.  But it’s kind of odd to view the US leaving Europe to its own devices as being an enemy",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Black08Mustang",
                                                                    "body": "Because we set them up. Any time a European agency start creating a military system that will really compete with something we make we undercut it in some way. Usually, we cut them a deal on our stuff that does not make it worth the development effort. When we blame them for a situation we intentionally created, we become the enemy.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Overwatchingu",
                                                    "body": "The US is taking actions that aid Russia in their goal of annexing Ukraine, which goes against Europe’s goal of maintaining Ukraine’s borders. They’re supporting Russian interests and opposing European interests, that precludes them from being considered an ally.\n\nThe last 2 months are more indicative of the future direction of the current US regime than anything before that. We don’t know how long the current regime will last.\n\nEdit: the “annexation stuff” isn’t something that a world leader should joke about. We’re not treating it like a joke, even if you want to bury your head in the sand and pretend the US president isn’t making daily threats to the sovereignty of other countries.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "UnluckySeries312",
                                    "body": "When you are the president, what you say matters. Threats to invade Panama and to Annex Canada HAVE to be taken seriously. Geopolitics isn’t a joke. Trade wars have the potential to turn into kinetic ones, history has shown us that. \n\nThis will shape what the world looks like going forward for decades.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Ok-Indication202",
                                    "body": "Threatening allies with military and economic consequences if they don't hand over part of their territory is not cheap talk.\n\nSecond we have always cooperated with America, including their use of article 5 after 9/11. Now they are against NATO and don't want to help us?\n\nThis is all on top of the absolutely insane dumb shit that comes out of Trumps mouth.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "SlakingsExWife",
                                    "body": "Hey what are you too 3 IR books you can recommend, since you’re well versed.\n\nAny sources books of channels you use?\n\nThis should be fairly quick.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Brisby820",
                                            "body": "I graduated with degrees in political science and history in 2011, and then went to law school for 3 years.  I’m now a lawyer who reads the news every day and often reads history books at night (currently reading the Russian Revolution: A New History by McMeekin; it’s ok, not great).   \n\nI couldn’t tell you any IR books I read without digging them out -- probably had titles like “International Relations:  Foundational Concepts” —  but I was a particular fan of the Spirit of the Laws, Wealth of Nations, and Democracy in America during my Political Science classes",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "SlakingsExWife",
                                                    "body": "Just wanna make sure we’re on the same jargon page. \n\nI’m shocked at your question “ what has america done?…”\n\nHow many responses are sufficient for you?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Brisby820",
                                                            "body": "In my mind it’s:\n\n1.  Undercut the effort in Ukraine.  Very and and I totally disagree with it.  At the same time, it’s only possible because the US is playing such a large role.  If Europe could replace US support, the US wouldn’t be in a position to negotiate anything.  So, basically, by withdrawing from Ukraine — going back to neutral, effectively — we become an enemy.  Again, I think we should support Ukraine, but sort of bristle at the idea that we are automatically an enemy if we leave Europe to its own devices on a war taking place in Europe.  \n\n2.  Greenland.  Bad, but it’s going nowhere.  Trump wants to purchase it (fair enough) but his only mode of negotiation is being a giant asshole.  It won’t amount to anything.\n\n3.  Tariffs.  Also bad, but I don’t think it’s “enemy” worthy.\n\nOn balance, for 2 months, we have been a bad ally.  I don’t think we’ve been an enemy though ",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "SlakingsExWife",
                                                                    "body": "How many responses are sufficient for you?",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "PossibleProgressor",
                    "body": "American has a.lo g Tradition in Making their own enemy's, examples would be Al Qaida, Saddam Hussein.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "CousinsWithBenefits1",
                            "body": "Germany has a long tradition of rounding up jews, poles, slavs, gays, the elderly and the infirmed, rounding them up, stealing their possessions and murdering them. At least they had the dignity to take detailed records and photographs of their crimes. It almost seems like Germans were proud to do it.",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "PossibleProgressor",
                                    "body": "Don't know what my great great Grandparents, who i never met did or if they were proud of it. But Tell me about the native americans, africans again, and how you Bring \"freedom\" to those country's with ressources or the multiple Times where you trained,.payed and equipped your own enemy's ( al Qaida is one example ), don't try to shame me when your country's History Starts with Genocide, yeeeeehaw!",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "CousinsWithBenefits1",
                                            "body": "Your great grandparents got exactly what they wanted and allowed.",
                                            "score": -2,
                                            "replies": []
                                        },
                                        {
                                            "author": "CousinsWithBenefits1",
                                            "body": "Right. So. I think what you're saying is. Countries that commit genocide aren't allowed to claim any sort of moral high ground?",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "PossibleProgressor",
                                                    "body": "Since when did i become a country? I'm not the smallest Person but damn, i am far from American Walmart Driver Away.",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "CousinsWithBenefits1",
                                                            "body": "Am I all of America then?",
                                                            "score": -1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "glarbung",
                    "body": "The US isn't China or especially Russia yet. They are now at the crossroads that both Russia and China found themselves during the 90s with the fall of the Soviet Union and end of Maoism in China.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Gammelpreiss",
                            "body": "Naw, the point of no return has already passed, mate. ppl may not realize it yet, but their inaction and Trumps open contempt for the consitution and the rule of law without facing any kind of opposition pretty much sets the stage for what' to come.\n\nWe've seen that book play out too many times in world history and americans will do nothing about it but write comments on social media, just like all the other ppl in such situations did nothing.",
                            "score": 23,
                            "replies": [
                                {
                                    "author": "glarbung",
                                    "body": "Well, we also don't remember the cases when it failed. I have hope (for a lack of a better word) in the incompetence of the Trump admin. I'm hoping he's more Wilhelm II than Hitler. More of an Elagabalus than Ceasar. More of a Robespierre than a Napoleon.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Gammelpreiss",
                                            "body": "And yet all of those options will lead you to misery regardless",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Brisby820",
                                    "body": "We’ve got through a lot worse than this brother.  US will be fine in 5 years, you can take that you the bank ",
                                    "score": -9,
                                    "replies": [
                                        {
                                            "author": "42nu",
                                            "body": "Funny because actual historians keep saying we've never been anywhere near this level of fascism in our republic's entire history.\n\nBut, hey, what to U.S. historians and constitutional lawyers know about what we've been through before anyway?",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Brisby820",
                                                    "body": "Would it make any difference if I told you that I graduated from college with degrees in political science and history, got an A in constitutional law during law school, was on my law school’s national constitutional law moot court team, and have been practicing as a lawyer for ten years?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "42nu",
                                                            "body": "I'd say you're lacking historical context if you were to, say, copy-paste something like the Civil War and a myriad of other things that happened before the modern era.\n\nDo you think he'll be removed from office once he disobeys a Supreme Court order? That's about the only way I see their plan failing.\n\nBut we may disagree about how far this administrations plans go in the first place.\n\nTo me, it is obvious they plan on doing what Putin did to Russia and it's Democracy and there's no signs our system is coming to save us just because it's been around awhile and has norms and precedents.\n\nBut yes, if that's your background I am genuinely curious for you to elucidate your thoughts as they will be well educated and informed.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "Brisby820",
                                                                    "body": "I think that Trump is extremely bad, and would prefer to rule as an autocrat.  \n\nThe Courts’ performance in 2020/2021 gave me confidence that they’ll hold up.  They unanimously shut down his election bullshit.  I think they’ll continue to do that and do their part to maintain the separation of powers.  \n\nI’m much, much less confident in Congress.  But I hope that, if Trump precipitated a true constitutional crisis — e.g. ignoring a Supreme Court order — that Congress would restrain him and either impeach him or neuter him via funding.  I’m not 100% confident in that, but it’s what I would expect to happen.  Maybe I’m too optimistic but I think we’re a lot more resilient than letting a single president during a single term derail the whole thing, since he tried that once and failed miserably.  ",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "42nu",
                                                                            "body": "Is anything stopping him from removing security clearances for any judge or lawyer that he thinks will rule against him? This could limit the course of various judicial actions to friendly courts.\n\nSteven Miller yesterday gave away perhaps their largest strategy for nullifying the courts:\n\nHe noted that there is no judicial review for actions taken by the POTUS in the capacity of Commander in Chief (using the example that even the Supreme Court has no say over troop movements and international affairs).\n\nSo you keep using your Federalist lawyers (many of which are very adroit and knowledgable) to create these edge cases that you feed up to the Supreme Court until you get rulings that carve out a segment of Executive action that is untouchable by the court (under the guise of acting as Commander in Chief and on international affairs).\n\nThen, once that leg work is done and you use the Insurrection Act to begin using your powers as Commander in Chief domestically you are carving out your ability to have extrajudicial enforcement actions that bypass due process on U.S. citizens.\n\nThat's why they tested this El Salvador thing AS WELL AS the green card holding student expressing their freedom of speech (since they have the same rights as a U.S. citizen).\n\nTo me, this all indicates that they know EXACTLY what they are doing and they are setting up the specific scenarios they need to carve their way to the end goal of extrajudicial (no due process) enforcement actions.\n\nThis even ignores the fact that they've fired all the JAGs in the military and Project 2025s plans for replacing fired federal employees at every level with registered loyalists who will break the law because they'll get pardoned.\n\nThere is a coherent, exquisitely layered and nuanced plan and I think a lot of people, even knowledgable lawyers like yourself, are just missing a number of puzzle pieces and a bit hopeful due to the 1st terms incompetence. They had 4 years and a very methodical plan from day 1 this time and from everything I've seen that plan is going off perhaps even better than they'd imagined.\n\nI appreciate your participation and feedback. I do find it illuminating and would love any inputs on why you're more confident besides the audaciousness of hope and America's complicated history. In terms of science and logic, just because every other example worked out doesn't mean the next unheralded test will. That's often a pervasive cultural meme (as Richard Dawkins defined memetics, sorry my degree is Biology/Chemistry) that empires/civilizations experience at their peak due to having no counter examples yet).",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Gammelpreiss",
                                                            "body": "as a german I can tell you all your laws and chexks and balances and due process mean jack when nobody standa in for those or enforces them. in rhe end it is just in on a paper and only work of we believe it works.\n\n\nand the US is failing here top to bottom. wverybody expect someone else to do it or does not care in the first place. all the while Trump is creating facts.\n\n\nUS democrac has already failed but you have not gotten the memo yet",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Gammelpreiss",
                                            "body": "No, you have not. And I heared \"it will be fine\" for the last couple decades so often I wonder what rock you hid under to be that naive.\n\nEven the civil war was more in line with constitional questions and respect for the constitution by both sides involved then what happens here right now.",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "Brisby820",
                                                    "body": "Dude we split in 2 and fought a horrible civil war",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[deleted]",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Brisby820",
                                                                    "body": "I didn’t say that.  My point is that we’ve been through worse times.  1862 was objectively a worse time for the US, unless you’re on crack ",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Black08Mustang",
                                                                            "body": "I had to delete that; it was the wrong war. Regardless, are you really saying we should wait until citizens are shooting each other to start complaining? We know what's coming and where it could lead. Now it the time to address it.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Gammelpreiss",
                                                            "body": "then you know what is going to happen, that or outright dictatorship\n\n\nsorry mate, the time to make this purely a matter of political process is over. For that Trump has destroyed too much trust in the system itself, has installed too many loyalists in important positions, is toonsuccessful to create facts on the fround and was too successfull into intimidating his opposition. and his voters are going nowhere.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Jaimeedoesthings",
            "body": "Danish Viking Blood would be a good name for a metal band.",
            "score": 29,
            "replies": [
                {
                    "author": "Ok-Use-8890",
                    "body": "I believe there is mead that is called Viking blod and it’s pretty dam good and I’ve got the danish stuff in the USA as well",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Sparkycivic",
                    "body": "I am picturing an existing band already stirring that sentiment, albeit less metal than usual. Lookup The live performance of \"Krigskaldr\" by Heilung on YouTube for the perfect song for this occasion!",
                    "score": 4,
                    "replies": [
                        {
                            "author": "onFinal",
                            "body": "I love this band.  Simply artistic.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "FunDog2016",
            "body": "Yes! Return to the shelf upside down to warn others!",
            "score": 30,
            "replies": [
                {
                    "author": "Style75",
                    "body": "Great idea! Will do this now, thank you.",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "tabascocheerios",
            "body": "Nobody wants USA made products  \n\nEnjoy your fucking recession,  you stupid Maga fucks.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Seagull84",
            "body": "5calls.org\n\n3-5 calls a day, 5 minutes total to call your rep and senators with pre-prepared messaging to express your outrage over the GOP, Trump admin, Musk, oligarchs, and the cabinet.\n\n5 minutes a day to do the most effective thing you can do as a constituent and voter, other than voting.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Upset_Nothing3051",
            "body": "We’d like to thank every last one of you, from Canada. Seems like it’s Donald Dump against the world, and we love you, and we are buying your products too. There’s strength in numbers.",
            "score": 16,
            "replies": []
        },
        {
            "author": "Hartvigson",
            "body": "I am a Swede but will also try to avoid buying US products for at least the coming 4 years. After 4 years I guess I might have found better alternatives that I might want to stick to permanently.",
            "score": 16,
            "replies": []
        },
        {
            "author": "Killerrrrrabbit",
            "body": "Trump is a traitor who is harming Americans with his outrageous policies.  He should be removed from power.",
            "score": 10,
            "replies": []
        },
        {
            "author": "Unusual-Ad4890",
            "body": "The world is done with America. The great divorce is under way.",
            "score": 7,
            "replies": []
        },
        {
            "author": "4920185",
            "body": ">Google trends showed a spike in searches for the term “Boycott USA,” and “Boycott America,” as Trump announced new tariffs, with the top regions including Denmark, Canada and France. At the same time, a global backslash is also building against Tesla as the brand becomes tied to Trump, with plunging sales in Europe and Canada. In Germany, police were investigating after four Teslas were set on fire Friday.",
            "score": 12,
            "replies": []
        },
        {
            "author": "MariposaPeligrosa00",
            "body": "As an ashamed American, I think the whole world should boycott us. We deserve it because of the clown in chief and circus we currently have in power.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Boxed_pi",
            "body": "As an american, I’m also boycotting american made goods",
            "score": 3,
            "replies": [
                {
                    "author": "treemanswife",
                    "body": "Seconded!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CFCYYZ",
            "body": "Protest with your feet and your bucks  \nNo Pepsi or Musk Cybertrucks  \nAllies betrayed  \nMeans USA made  \nWon't sell to those folks out of fux",
            "score": 5,
            "replies": []
        },
        {
            "author": "Glidepath22",
            "body": "Feeling the win now, MAGAts?",
            "score": 6,
            "replies": []
        },
        {
            "author": "No-Flan6382",
            "body": "Every American with common sense or an education past 8th grade history supports you. \n\nThe irony is that right wing voters have referred to the left as a bunch of sheep - then followed their dear Shepard right into authoritarianism.",
            "score": 20,
            "replies": [
                {
                    "author": "Username21045619",
                    "body": "The word “Irony” doesn’t exist in the MAGA vocabulary.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "No-Flan6382",
                            "body": "The word “vocabulary” probably doesn’t either",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "TheJollyHermit",
                                    "body": "The new Trump(tm) brand dictionary is out next week. That's right. \"All the Words, the Best Words\" is Trump's new book that has all the best words you need to be a great patriotic American.  No woke mind virus.  No DEI.  No evil demoncrat librul lies.  \n\nGet you own at the next Oval Office merch extravaganza!  Only $299.99 or 10 easy installments of $39.99.  \n\n\"It's the only book you need other than the Trump Bible.\" \n\n\"I've already burned every other book I owned!\"",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Neanderthalknowsall",
                                            "body": "lol   The worst product ever.  A dictionary only works if you can spell! har!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "russellamcleod",
                    "body": "Thoughts and prayers do nothing though.\n\nIt’s getting exhausting to hear over and over again. If you sit back and do nothing you’re just as bad as the Maga crowd so I don’t want to hear it.",
                    "score": -3,
                    "replies": [
                        {
                            "author": "BlackieDad",
                            "body": "I’m so sick of hearing from people who think that writing “tRump” on a poster board and waving it around in front of a Tesla dealership is doing something. These same dorks are gonna be waving signs saying “DONALD DUMP WANTS TO GRAB CANADA BY THE REGINA” as tanks pour over our border and pat themselves on the back for doing all they could do to prevent it. The hell with all of them.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "LonelySwordfish5403",
            "body": "Jack Daniel’s is done for everywhere except America. Feel the pain and remember that the consumer rules.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Irr3l3ph4nt",
            "body": "Trump learning one new enemy at a time that the US was still riding the Marshall Plan's coat tails and he just messed it up.",
            "score": 5,
            "replies": []
        },
        {
            "author": "deafpolygon",
            "body": "Doing my part here!",
            "score": 5,
            "replies": []
        },
        {
            "author": "insanemembrain666",
            "body": "Cheers from Canada! Elbows up friends!!",
            "score": 10,
            "replies": []
        },
        {
            "author": "Rose1832",
            "body": "Hell yeah, kick our ass",
            "score": 1,
            "replies": []
        },
        {
            "author": "lovestostayathome",
            "body": "Im an American and I approve this message.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cmg4champ",
            "body": "Congrats Donald.  You got the whole world against ya.\n\nHappy Repubs?  Are ya?\n\nIf so...how are those townhalls coming along?  eh? eh? eh?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Briebird44",
            "body": "As an American with ancestral danish blood, YES! Keep boycotting products. Cut these super corps profits and then the billionaire owners will get pissed at Trump and might actually cause positive action. The Walton’s aren’t a family to be ignored. The Meijer family too.",
            "score": 4,
            "replies": []
        },
        {
            "author": "backtotheland76",
            "body": "As an American it's sad to see much of the World doing a better job boycotting American oligarchs than we Americans are. I encourage you to keep it up. I understand that a downturn in international sales will hurt many American families. But I believe the sacrifice must be made. The oligarchs are deeply entrenched and it will take a lot of effort to topple them. \n\nJust remember, the oligarchs are nothing without customers.",
            "score": 4,
            "replies": []
        },
        {
            "author": "ContrarianDouche",
            "body": "Our European border brothers \n\n🇨🇦🤝🇩🇰",
            "score": 2,
            "replies": []
        },
        {
            "author": "sabres_guy",
            "body": "Canada has been doing it for well over a month and is something tariffs and threats can't do anything about.\n\nIf people just decide they don't want to buy American products anymore in response to their nonsense, it will have a much bigger effect than they will ever admit.\n\nWhat is Trump gonna do? Threaten people of other countries that they have to buy American products?",
            "score": 1,
            "replies": [
                {
                    "author": "okeleydokelyneighbor",
                    "body": "Try and force Americans to buy up the unsold stock.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "FewCelebration9701",
                    "body": "These hypotheticals are kind of pointless. What’s Trump to do? Perhaps issue a blockade on Canada. \n\n\nI mean, who is going to stop us? Who would even try against the most powerful military—one without peer—in the world? \n\n\nOver Canada?\n\n\nThat’s the problem with hypotheticals on the internet. It is endless non-falsifiable escalation. ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "parisianpicker",
            "body": "France here : I’ve been removing spending on US products / trips etc as best as I can, so far have shaved off around 60k euros in planned expenses (Tesla, 2 week trip, new guitar purchase, etc etc)",
            "score": 5,
            "replies": []
        },
        {
            "author": "sambadanne",
            "body": "Crazy that Denmark helped out a ton on global excursions, like sending elite soldiers to Afghanistan, and then getting stabbed in the back like this. You can't do things like that toward any of our Scandinavians brothers and expect that any of us will want to have anything to do with America anymore.",
            "score": 5,
            "replies": []
        },
        {
            "author": "thesquidsquidly22",
            "body": "As an America this is good. Keep it up. Maga will never ever come to their senses until their wallet feels the pain. If they want to be isolationist and xenophobic they should feel how badly everything sucks without the awesome variety of food and culture and products we've been blessed with for so long.",
            "score": 5,
            "replies": []
        },
        {
            "author": "KamalasSepticTank",
            "body": "I’ve never read so many jingoistic titles in one place.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Agimamif",
            "body": "As a Dane who is angry about American choice in leadership, I don't support these posts or sentiments. \n\nI'm not anti-American, I don't want to see America suffer, I just want sanity to return.\n\nAll this reminds me of all the \"death to America\" propaganda spit out of Russia, the middle east and China over the last 20 years. It's not a good look, and I don't support it.",
            "score": 4,
            "replies": [
                {
                    "author": "flipflapflupper",
                    "body": "> All this reminds me of all the \"death to America\" propaganda spit out of Russia, the middle east and China over the last 20 years. It's not a good look, and I don't support it.\n\nI'm seeing the exact opposite, i'm Danish too. The boycott is specifically against American produced products and services. It has little to do with Americans at all.\n\nAmericans aren't facing anything bad in Denmark. I mean if you sport a MAGA cap, then yes, people will approach you and talk shit. But outside of that, not much.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "HorseSashimi",
                    "body": "You have a long wait till sanity returns. \n\nThey voted for isolation, not once but twice. We forgave them once, this time around, they will get a full dose of what they want.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Agimamif",
                            "body": "I dont intent to wait, I suggest we give them the tough love we show family and not the destructive hate we show enemies, that is all.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "larve1",
                                    "body": "But boycotting IS the tough love you talk about. The hate would be military action or completely severing ties. That is not what we want, unless forced to. We want them to return to that sanity you talk about, and a way to show them that we think what they are doing is wrong is by boycotting.\nHow do you propose we show them tough love if not with our wallets?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "hellomot",
                    "body": "Yeah, just sit still and do nothing. I'm sure sanity will magically return.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Agimamif",
                            "body": "In a world where not hating America equals necessarily doing nothing, your comment would not be a waste of everybody's time. \nSuch as it is, that is not the world we live in.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "KilluaCactuar",
                    "body": "Not buying is the same as protesting.\n\nIt sends a message, that the whole policy of trump in regards to Europe is wrong.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "No_Bad_Juju",
            "body": "Vikings hating Americans will break their fragile little hearts. American (white men) think and act like they are descendants of Vikings, so this is just poetic justice and I love it. Break hearts, Danes.",
            "score": 2,
            "replies": [
                {
                    "author": "FewCelebration9701",
                    "body": "Yeah, these people aren’t Vikings. The leading quote is ridiculous and I’m hoping was a mistranslation. Vikings were a tiny subculture, and I wouldn’t think a modern electrician would be down with all the nasty stuff Vikings got up to. \n\n\nIt’s no different than when Americans puff up their chests and say we saved Europe in WW2. It’s bluster that nobodies say to feel a cult-like connection to something bigger than themselves which they are otherwise totally divorced from. ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "theidiotsareincharge",
            "body": "American here, I applaud the Danes!  I can’t believe that Trump is going after all of our allies, as if nobody will do anything about it. Keep up the good fight!",
            "score": 1,
            "replies": []
        },
        {
            "author": "JackBlackBowserSlaps",
            "body": "Keep up the good fight ✊",
            "score": 2,
            "replies": []
        },
        {
            "author": "Loki-L",
            "body": "What are Americans gonna do in retaliation, boycott Ozempic?\n\nThey would need to eat healthy or risk supersizing again.",
            "score": 2,
            "replies": []
        },
        {
            "author": "TheOTownZeroes",
            "body": "Good. As an American please keep boycotting US goods; it is miserable here right now.",
            "score": 2,
            "replies": [
                {
                    "author": "FewCelebration9701",
                    "body": "What exactly do you think boycotting will do? Make things here better? Have you lived through a major recession? I have. It’s rough. Real rough. I’m positioned for it; are you? Your neighbors? Your family? \n\n\nThe true cost is paid by those who can least afford it. These countries need to do what they need to do in order to send a message or become less reliant. That’s their rational priority. \n\n\nBut effectively wishing for bad times to get worse on your own citizens is wildly unempathetic. ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "OntarioLakeside",
            "body": "🇩🇰❤️🇨🇦",
            "score": 2,
            "replies": []
        },
        {
            "author": "MisterGoo",
            "body": "The USA don’t seem to understand that in this day and age, it’s pretty easy to find or make substitutes. And once people have become used to the substitute (that may be even better), they won’t go back to your products, even if you end the tariff policy.",
            "score": 1,
            "replies": [
                {
                    "author": "Rukoo",
                    "body": "Europe accounts for about 1% of US GDP for non-services or energy exports. I don't see Europe cutting energy imports from the US anytime soon, unless they start up their Russian pipelines again. And I doubt Europe is unified in a US boycott of products. I just wouldn't get my hopes up to expect significant policy change. \n\n&nbsp;\n\n50% of that 1% is medical, petro products, power generating equipment, etc. \n\n&nbsp;\n\nGrocery store products from US probably won't even be a blip on the GDP. Europe is already set up to be very Europe only and that's totally fine. I think what Europe is pissed at is that the US imports almost twice as much Europe and that will have a significant damage to a already stagnant EU economy. \n\n&nbsp;\n\nIf US leaves NATO, EU will have to step up a large amount of their GDP to fill the vacuum.",
                    "score": -4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Head-Ordinary-4349",
            "body": "As a Canadian with an absolute adoration for Denmark after travelling there for 2 weeks, stay strong! We’re with you, and together our purchasing power can be stronger than any tariff ever will be ❤️",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThinOpinions",
            "body": "Good, even better if they boycott products from republican states",
            "score": 0,
            "replies": [
                {
                    "author": "ram-tough-perineum",
                    "body": "They're all Americans and should be treated equally.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "MkRmBwPa",
                            "body": "Should more people only listen to the small minority of Canadians who want to join the US as a 51st state?  Canadians are all the same, right?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "ram-tough-perineum",
                                    "body": "If that \"small minority\" voted in a secessionist government, then yes.",
                                    "score": -2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "backtotheland76",
                            "body": "I understand why you might feel that way but we Americans are not all the same. Treating us the same is just another form of bigotry, which is part of what got us into this mess in the first place",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "IncompetentPolitican",
                                    "body": "He won your vote. Even the popular vote. Most Americans wanted this or did not care about it enough. So treat this as a lesson: if the leader of a country fucks up, the whole country suffers. Next time you all go to vote (if you still get to vote) and vote for sanity. If you are fast enough to fix your \"democracy\", then maybe we are not used to buying from the EU instead of you.",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "ram-tough-perineum",
                                    "body": "Trump's a product of \"the best democracy on earth\". You (collectively) voted this asshole into power. Wear it.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "ThinOpinions",
                                            "body": "We didn’t, his cult did. We are all not like him, never were, never will be.",
                                            "score": -1,
                                            "replies": []
                                        },
                                        {
                                            "author": "backtotheland76",
                                            "body": "Gee, thanks",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "AbbeyRoadMoonwalk",
            "body": "Good. This American applauds you.",
            "score": 2,
            "replies": []
        },
        {
            "author": "McBraas",
            "body": "Salling is so great for adding those stars",
            "score": 1,
            "replies": []
        },
        {
            "author": "Early_Commission4893",
            "body": "Yup. Made for America. Let em keep it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Happy-go-lucky-37",
            "body": "Didn’t the vikings “discover” America centuries before Amerigo?\n\nAmerica belongs to the vikings ffs, not the other way around!",
            "score": 1,
            "replies": []
        },
        {
            "author": "retardsmart",
            "body": "From savage raiders to pastry chefs.  Keep up the good work.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok-Yogurtcloset-2735",
            "body": "U.S. citizen here. Thank you Danes and Europe. Thank you for standing on principals that the Trump admin doesn’t believe in.",
            "score": 1,
            "replies": []
        },
        {
            "author": "donnavan",
            "body": "Thank you, Daneland.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Shine_Flight",
            "body": "As an American, I encourage this. As a Californian, the boycott of California products hurt a bit. The only way these MAGA voters will learn is when they have repercussions. I have slowed my spending to essentials only and am boycotting any company that supported Rethuglicans so No Amazon, no Target, no Airbnb.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ShaolinTrapLord",
            "body": "Are we great yet?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tarskin_Tarscales",
            "body": "I havent gone to a McDonald's since the election, and started skipping certain sodas... That way I help the boycott and my own health.\n\nShould present this as a win-win initiative!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Low-Celery-7728",
            "body": "Look at all these brothers brother!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mirewen15",
            "body": "Russia is crippling America on purpose.  Who will America turn to when they alienate all of their allies?  They will turn to get help from Russia and that is exactly what Putin wants.  It is what he is orchestrating.  Isolating the US.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MiniMini662",
            "body": "F DT and his shitler Regime 🖕🏻🖕🏻🍊💩🇺🇸🖕🏻🖕🏻 never trust the USA again",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cr4shK00l",
            "body": "\"their viking blood is boiling\"? Are they going to rape and pillage?",
            "score": -4,
            "replies": [
                {
                    "author": "Deinosoar",
                    "body": "Hear my voice, this is Odin calling you\n\nTimes have changed, I'm a Gentlegod\n\nNo more war, just design of furniture\n\nMaster of IKEA\n\nJust like Jesus I'm a carpenter\n\nForging shelves with the hammer of Thor\n\nGloria patri furnituribus",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "ScriptThat",
                    "body": "> Are they going to rape and pillage?\n\n\"But you're in England!\"  \n\"I said WHERE IS THE MONASTERY?\"",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "I_Am_Vladimir_Putin",
            "body": "\"Viking blood is boiling\" is one of the most terrifying things I'd never want to hear lol",
            "score": 0,
            "replies": []
        },
        {
            "author": "iamtehryan",
            "body": "Hell, there are a whole lot of americans that would stand and fight alongside you guys against trump every day of the week. We stand with our brothers and sisters across the world.",
            "score": 0,
            "replies": [
                {
                    "author": "EVIL5",
                    "body": "You had your chance at the vote. You put this asshole there TWICE. It’s who you are. Own it",
                    "score": 1,
                    "replies": [
                        {
                            "author": "okeleydokelyneighbor",
                            "body": "Can’t blame all of us. Countries should focus their tariffs on anything made in deep red states, the cult that allowed this, twice.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "circular_file",
            "body": "I'm a US citizen and I am doing the same; avoiding made in US, and purchasing items made in Europe and Canada wherever possible.  It used to be, where applicable, 'buy organic and local, or buy organic, or buy local', but now we've added another layer 'buy organic and Canadian or EU or local, or buy organic, or buy Canadian or EU or local, or buy local.  \nBecause someone is going to mention it, obviously I'm speaking where applicable, e.g., I'm not talking about organic electronics.",
            "score": 0,
            "replies": [
                {
                    "author": "Lower_Inspector_9213",
                    "body": "Potato Clock",
                    "score": -1,
                    "replies": [
                        {
                            "author": "circular_file",
                            "body": "Smartass.  :)",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MumrikDK",
            "body": ">But now they’re discussing doing without Netflix, and that is a step too far for the kids.\n\nThis is the issue. \n\nBoycotting the US in the grocery store is actually super easy for us - they're a distant nation, so it's not like we get any fresh foods from the US. \n\nProperly boycotting the US means dropping their services, and that's a lot more challenging for people, and there are fewer decent replacements.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Unasked_for_advice",
            "body": "So all these countries are mad that the US is making the tariffs equal to what they were already charging the US...balanced trade makes their blood boil...",
            "score": -7,
            "replies": [
                {
                    "author": "Neanderthalknowsall",
                    "body": "Trumps balanced trade like the balanced trade with Canada?    $22Billion out of almost $800billion on trade.   That $22 billion was oil that the US wanted.\n\nTrump started a trade war and broke an trade agreement he signed over $22 billion in trade deficit in oil?   It's fucking insane.\n\nI don't think you understand how tariffs work.   You Americans are being taken for a ride.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Unasked_for_advice",
                            "body": "That statement works even better if you turn it around, Canada going nuts over 22 billion out of almost 800 billion in trade.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "santathe1",
            "body": "Can’t stop buying iPhones though. Skipping $50 whiskey is nothing compared to $1000 tech purchases.",
            "score": -1,
            "replies": []
        },
        {
            "author": "Pure_Spare_8081",
            "body": "That's a title I wouldn't expect to read.",
            "score": 0,
            "replies": []
        },
        {
            "author": "emryldmyst",
            "body": "🤣🤣🤣",
            "score": 1,
            "replies": []
        },
        {
            "author": "Minimum_Crow_8198",
            "body": "Watch out for those vikings, they'll...not buy at your stores\n\nPlease take yourselves more seriously, or maybe it's the media making it ridiculous",
            "score": -8,
            "replies": []
        },
        {
            "author": "No_Worldliness_7106",
            "body": "They larping as Vikings or something? What a weird headline.",
            "score": -4,
            "replies": []
        },
        {
            "author": "egric",
            "body": "As much as i support this, i gotta say, that title is cringe af. Like how do you \"boycott with fervor\"? Bro, you're just not buying anything american lol",
            "score": -4,
            "replies": []
        },
        {
            "author": "itchyfrog",
            "body": "We need a world trade conference where we can unwind some of the overly complicated transnational trades and get the people who have the stuff and the people buying it to reorganise to avoid the US. \n\nThis could actually make things cheaper, as much of the complicated shipping of materials is unnecessary and is done largely for the benefit of Wall Street companies.\n\nWhile the US is a naturally wealthy country, it's oversized market share is largely due to the dollar, and being where companies are based.",
            "score": -1,
            "replies": [
                {
                    "author": "ms4720",
                    "body": "The US should leave nato also and stop keeping the seas open also.",
                    "score": -9,
                    "replies": [
                        {
                            "author": "itchyfrog",
                            "body": "They are heading that way, let's hope it makes them happy.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ms4720",
                                    "body": "It sure as hell won't make Europe or China happy.  Neither has the navy to secure their sea lanes and Europe does not have the military to protect itself",
                                    "score": -6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Kvaw",
            "body": "€209 for Jack Daniels Apple? I'd boycott too.",
            "score": -1,
            "replies": []
        },
        {
            "author": "AccomplishedCat8083",
            "body": "That's like Europe boycotting itself 😂",
            "score": -5,
            "replies": []
        },
        {
            "author": "TheyStillLive69",
            "body": "All the countries who believe mainstream media the most are the same countries who \"boycott with fervor\". Funny how that works.",
            "score": -10,
            "replies": []
        },
        {
            "author": "Specialist-Way-648",
            "body": "they sure are pussies for \"vikings\"",
            "score": -15,
            "replies": []
        },
        {
            "author": "mcjc1997",
            "body": "If their viking blood was truly boiling surely they'd simply steal the goods instead of refusing to buy them",
            "score": -10,
            "replies": []
        }
    ]
}