{
    "title": "Germany approves massive spending package to boost defense",
    "author": "washingtonpost",
    "subreddit": "worldnews",
    "rank": 8,
    "score": 2140,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 88,
    "url": "https://www.washingtonpost.com/world/2025/03/18/germany-defense-spending-debt-trump/?utm_campaign=wp_main&utm_medium=social&utm_source=reddit.com",
    "id": "1je73fh",
    "selftext": "",
    "comments": [
        {
            "author": "WukongSaiyan",
            "body": "Who would've thought - German Rearmament would be the solution to Russian led US fascism.",
            "score": 291,
            "replies": [
                {
                    "author": "Newone1255",
                    "body": "Classic Europe.  In WW1  it must have seemed crazy to a British person that their biggest allies would be the French after it took all of Europe teaming up like the avengers to take them down 100 years prior",
                    "score": 39,
                    "replies": []
                },
                {
                    "author": "BubsyFanboy",
                    "body": "\\*european in general",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "DrKaasBaas",
                    "body": "Let's not jump to any conclusions.  We may yet see all of this take a nose dive.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "kellyguacamole",
                            "body": "Humans are definitely known to fuck things up.",
                            "score": 18,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "user23187425",
                    "body": "There's more to come. This will boost european political integration.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "WarOnFlesh",
                    "body": "what if all of europe unites and then eventually becomes nationalistic and fascist?  then we get to live in a world where all the major powers are dictatorships.\n\nAnyone looking for freedom will have to flee to the impoverished countries and try to just live off the land and not be caught up in turf wars by the super powers",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "BubsyFanboy",
            "body": "Good work, Germany.\n\n\\- a Pole",
            "score": 30,
            "replies": [
                {
                    "author": "user23187425",
                    "body": "In all this depressing madness, i'm really happy that this is bringing Europe together, and particularly Germany and Poland (I'm German). Yes, it will take some more time, but nobody who's not paid by Putin can deny that this is in our mutual best interest.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "WalterWoodiaz",
                    "body": "Poland has been doing most of the heavy lifting military spending, it is good Germany is pulling their own weight against Russia.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "MITOX-3",
            "body": "Time for more Leopards to roam the fields of Europe.",
            "score": 99,
            "replies": [
                {
                    "author": "That1TimeN99",
                    "body": "This is not the same Germany of your great-grandfather. Germany can lead the EU economically and militarily.",
                    "score": 58,
                    "replies": [
                        {
                            "author": "SportsFanBUF",
                            "body": "It’s ironic really, what’s next, Italy following their lead?",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "That1TimeN99",
                                    "body": "Not Italy no. They barely spend anything and are essentially free loaders.",
                                    "score": 29,
                                    "replies": [
                                        {
                                            "author": "dumbestsmartest",
                                            "body": "So things are basically like they were back then?",
                                            "score": 15,
                                            "replies": [
                                                {
                                                    "author": "ErlendJ",
                                                    "body": "Italy will just change sides midway, so the weaker they are the better!",
                                                    "score": 10,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "1337duck",
                                    "body": "About that. Apparently Italy's anti air system by Leonardo (?) is the second best, after patriot system. And Ukraine has been getting them.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "cuntbasher666",
                            "body": "Leopards are tanks from postwar Germany tho. \n\nAnd if German leos fucks russia with ukrainian forces why not",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "TheDreamWoken",
                            "body": "Pear help older Nemo",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BubsyFanboy",
                    "body": "Amazing tech names after beautiful big cat",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "justbecauseyoumademe",
            "body": "LETS FUCKING GO",
            "score": 35,
            "replies": []
        },
        {
            "author": "washingtonpost",
            "body": "BERLIN — German lawmakers passed a mammoth spending plan Tuesday that could allow for up to a trillion dollars in debt-fueled investments in defense and infrastructure over the next decade, according to some estimates.\n\nThe package amends the country’s constitution to relax strict limits on debt that have long set the parameters of German spending, as [Europe scrambles ](https://www.washingtonpost.com/world/2025/03/06/european-defense-overhaul-trump-putin/)to strengthen its security amid concerns over U.S. commitments under President Donald Trump.\n\nA [clash](https://www.washingtonpost.com/world/2025/03/01/ukraine-trump-zelensky-reaction/) between President Donald Trump and Ukrainian President Volodymyr Zelensky in the Oval Office last month, followed by a temporary U.S. suspension of Ukraine aid, accelerated in Germany a rethink of the country’s tightly drawn purse strings, just days after an [early federal election](https://www.washingtonpost.com/world/2025/02/23/german-election-results/).\n\nRead more here: [https://www.washingtonpost.com/world/2025/03/18/germany-defense-spending-debt-trump/?utm\\_campaign=wp\\_main&utm\\_medium=social&utm\\_source=reddit.com](https://www.washingtonpost.com/world/2025/03/18/germany-defense-spending-debt-trump/?utm_campaign=wp_main&utm_medium=social&utm_source=reddit.com)",
            "score": 22,
            "replies": []
        },
        {
            "author": "hei04",
            "body": "Germany is about to fuck 🔥",
            "score": 16,
            "replies": [
                {
                    "author": "Elect_SaturnMutex",
                    "body": "Or get fucked, again. One can only speculate.\n\nEdit: forgot the word 'again'.",
                    "score": -24,
                    "replies": []
                }
            ]
        },
        {
            "author": "Typingman",
            "body": "The US had prevented this for over 80 years, and now they chose to let go.",
            "score": 59,
            "replies": [
                {
                    "author": "nagrom7",
                    "body": "Eh, more like 30 years. Germany was 2 different states during the Cold War, and both were fairly militarised and fortified considering they would start a hypothetical WW3 *being* the front line.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "ElenaKoslowski",
                            "body": "Fairly? West Germany had the largest standing army in Europe through out the Cold War...",
                            "score": 12,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Appropriate-Ant6171",
                    "body": "Germany was encouraged to arm itself during the Cold War, this is more a reversal of short-sighted defence spending cuts than American foreign policy. \n\n\nWhat the US *has* prevented is Germany spending significant amounts on US arms.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Some_other__dude",
                            "body": "Nah, was not just \"short-sighted spending cuts\". It was a condition for German unification.\n\nMany nations feared a German unification. West Germany and east Germanies militaries combined where massive. Especially the UK under Thatcher opposed unification. It was demanded by many nations that after unification Germany had to demilitarise.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Perais1909",
                    "body": "We prevented it ourself. Also wenn spent a shit Ton of money for our army in the cold war.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Pale-Assistance-2905",
                            "body": "Make no mistake, the call for EU NATO states to spend more was not just paternalistic desire for Europe to take on their own defense. Spending target increases were pushed to also feed the US arms industry. In the past, 80 % of Germany’s 2% GDP boost in defense would have gone to US weapons manufacturers. Things will likely soon be different if Germany starts to channel this to Volkswagen and other German arms manufacturing",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "author": "Rough_Information302",
                                            "body": "Yeah as much as a free ride as US companies are free riding on the good will of European customers. See Tesla sale numbers for reference what will be happening as US pulls back.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[deleted]",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "Pale-Assistance-2905",
                                                            "body": "I am not saying that Europe was actively prevented. But, I am saying a big part of the motivation to get EU NATO states to spend more was to line the pockets of US corporations.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "WalterWoodiaz",
                            "body": "They are just revising history, it is good Germany is doing this, but it isn’t like the US wasn’t wanting them to increase spending.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "nuttininyou",
                    "body": "You say it like it's a bad thing. Suddenly people are so disappointed that Europe has to invest in its defense and rely less on the US.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Typingman",
                            "body": "I do? My post is very objective.\n\nThe way the WH is informing everyone about it is crazy but my post says nothing about that.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "MorePhinsThyme",
                            "body": "Americans should be disappointed in that.  Having Europe reliant on us was a huge lever for us to get them to do what we wanted around the world, and we've just tossed that aside.  It also meant that much of what they spent went to us to buy our weapons, something that could have been maintained while we pushed them to spend more on their militaries (which would benefit us).  \n\nInstead, Trump has gotten them to spend more, but also convinced them that we can't be trusted to be a military supplier, so we don't benefit from that at all, while also creating a world where we need to keep spending on our own military, so we don't see any savings. \n\nSo yes, it's a bad thing that we're in our current situation.  We've fucked over our allies, lost a ton of money and trade, and gained nothing.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -9,
                    "replies": [
                        {
                            "author": "Trollimperator",
                            "body": "Which wont go down just because you send some government worker home. Or start Trade wars with half the world.\n\nThe USA is dumb enough, to attack what was making them great, in order to defend the things, which are creating all thier problems. Just a hint, immigrants are not the reason the USA, with more than a 25% of the worlds GDP is in debt.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "Trollimperator",
                                            "body": "sure sure mister. You will fix 35trillion in debt, by randomly removing everyone the tech billionaire deems problematic. That will save you like a 20Billion each year. Will make a great impact.\n\nYou people are so dumb, its really fitting that you get fucked like that, by the dumbest, most pathetic con men ever. The world is laughing at you and you still think others are the joke...",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "TexasInsights",
                                            "body": "Exactly right. Apparently, according to Reddit,  the USA is the only country to be racist when we control our borders. Literally every other country on Earth enforces immigration but only the USA is racist to do so.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Former_Friendship842",
                            "body": "Not really, as US military spending is still increasing massively this year",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Former_Friendship842",
                                            "body": "This is from November 2024. Look at the current Republican bill that adds another 100 billion. \n\n\nhttps://www.military.com/daily-news/2025/02/21/republicans-advance-massive-defense-budget-boost-pentagon-eyes-offsets.html",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[deleted]",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Former_Friendship842",
                                                            "body": "This is for the CR which is to prevent another shutdown. This not the final bill on the matter and Republicans still seek to increase spending by 100 billion.\n\n\nAlso, even this CR adds another 8 billion, on top of the spending agreed in November.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "[deleted]",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Former_Friendship842",
                                                                            "body": "Yes. 150 billion increase and 50 billion in offsets. That's 100 billion.\n\n\nYour point was wrong. It wasn't about the debt. Otherwise they wouldn't increase military spending by 1.7% + 8 billion/100 billion",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "BrexitHangover",
            "body": "We're so back",
            "score": 27,
            "replies": [
                {
                    "author": "Lorik_Bot",
                    "body": "Make Germany Great Again,-MGGA LoL",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "frango2408",
            "body": "LFG!!",
            "score": 6,
            "replies": []
        },
        {
            "author": "gtafan37890",
            "body": "Germany is rearming their military to prepare for a war with the Russians from the east and the Americans from the west, exactly like 80 years ago, except this time, Germany is the good guy defending democracy from fascism.",
            "score": 29,
            "replies": [
                {
                    "author": "WalterWoodiaz",
                    "body": "War with the US? What are you smoking?\n\nThis is purely against Russia. The US wouldn’t be able to attack Europe logistically, it would be suicidal.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Kiwithegaylord",
                            "body": "Thank god our commander in chief is known to make rational level headed decisions that carefully weigh the potential risks.\n\n\n\n\nWe’re screwed",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "WalterWoodiaz",
                                    "body": "You might be on reddit too much if you think something this impossible would happen. It would be like China invading Japan, would never happen and even the dumbest people know it is impossible.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "WalterWoodiaz",
                                    "body": "A war with Europe would be impossible lol, any plans for something like that would take years to set up and it would be known.\n\nEven Trump loyalists in the military would laugh any proposal out of the room.\n\nI hate Trump, I hate everything about him, but a war with Europe is impossible.",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "author": "Solar-MarSpawn",
                                            "body": "We thought war with Canada was too but not so much anymore",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "WalterWoodiaz",
                                                    "body": "Canada would at least be possible, against all of European NATO? Literally zero chance.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "MorePhinsThyme",
                                                            "body": "The US allying themselves with Russia against NATO wasn't something anyone thought there was a chance of, and yet that's happening.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "WalterWoodiaz",
                                                                    "body": "Oh yeah, let’s just ignore the logistics of fighting a war like that across the Atlantic and how little American support there would be.\n\nTrump being friendly to Russia is one thing, the US at war with Europe is completely bonkers.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "MorePhinsThyme",
                                                                            "body": "Support doesn't appear to be stopping him on anything else he's doing. \"The same reasons why he should be (but isn't) stopping what he's doing now will totally stop the next crazy thing he wants to do!\" is not the strong argument that you seem to think it is.\n\nThe only thing that's completely bonkers here is Trump, and he's tearing our nation up, and the people waving the flag the hardest are supporting him as he does it.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "WalterWoodiaz",
                                                                                    "body": "US war with Europe will never happen, keep trying to compare things of completely different magnitudes though.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "MorePhinsThyme",
                                                                                            "body": "It's amazing how many times I've heard Trump supporters claim that he'll never do something bad, and then he does that something bad anyway.\n\nMaybe you'll be right this time, hopefully you are.  But so far it seems that he's close to guaranteed to do the things that you guys say he won't.\n\nEither way, keep defending Trump, I'm sure that he appreciates your efforts and would never throw you under the bus to enrich himself.  Have a nice day, I don't see us agreeing on Trump any time soon.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "WalterWoodiaz",
                                                                                                    "body": "I am not defending Trump, don’t put words in my mouth. I am defending reality. The logistics of a US war against Europe would be insane.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "MorePhinsThyme",
                                                                                                            "body": "You're right, the logistics would be impressive.  If only we designed our military to focus on the incredible logistical challenge of engaging in a ground war in any continent on the world, while also still staying relevant in the rest of the world.  Oh wait, that's exactly what we built our military to do, after we had to build our military to do exactly that in WW2.\n\nYou aren't defending reality.  Reality is that the US military is explicitly good at logistics like you're talking about.  Meanwhile, you are 100% defending Trump, even if that's not your intention (but it sure seems like it is your intention, given what you've said so for).\n\nAnd I'm never going to put anything in your mouth, we don't have that kind of relationship.  If you're unable to realize what you're doing as I point it out, that's on you.\n\nIt's amusing how you deny the reality of your own argument as you are \"defending reality\".",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "kuldan5853",
                                                            "body": "Doesn't mean he won't try. Remember, attacking Greenland would be attacking EU would be attacking Nato.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Zamoniru",
                                            "body": "Also Trump has no interest in attacking Europe at all (except Greenland ofc). And even IF the extremely unlikely case happens that he does for some reason, he would just ship some weapons to Russia to do the job for him.",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "author": "ElenaKoslowski",
                                                    "body": "So a proxy war?",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "kuldan5853",
                                                    "body": "> (except Greenland ofc).\n\nSo he has interest in attacking Europe.\n\nGreenland is Europe, attacking Greenland is attacking Denmark is attacking the EU is attacking NATO.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "I-always-argue",
                                    "body": "You know very well it's not going to happen.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Override9636",
                                            "body": "Everything that I *knew* wasn't going to happens has already taken place in the last 2 months. We still have 4 years to go.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Eurasia_Zahard",
            "body": "Calls on RNMBY 🚀🚀",
            "score": 12,
            "replies": []
        },
        {
            "author": "Hkja4",
            "body": "A tale as old as time.",
            "score": 3,
            "replies": []
        },
        {
            "author": "hsoftl",
            "body": "My Rheinmetall stock is up 50% in less than a month",
            "score": 1,
            "replies": []
        },
        {
            "author": "Glidepath22",
            "body": "Thier congress did it democratically since it’s a change to their constitution, instead of some whack job just making it up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Low-Role7056",
            "body": "\\[deleted\\]",
            "score": 1,
            "replies": []
        },
        {
            "author": "ambientocclusion",
            "body": "As usual, Norm MacDonald gets it: https://youtu.be/uXdtafGdIVM",
            "score": 1,
            "replies": []
        },
        {
            "author": "Additional-Map-2808",
            "body": "It was only a matter of time that one of Russia, US or China was going to act like a bully. Europe was stupid not to re arm and be energy independent sooner.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Quoven-FWT",
            "body": "Not massive, that should be the #1 focus and be expedited.  The only way to stop a bully is to have a bigger stick",
            "score": 1,
            "replies": []
        },
        {
            "author": "Glidepath22",
            "body": "Thier congress did it democratically since it’s a change to their constitution, instead of some whack job just making it up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "multisubcultural1",
            "body": "Is Volkswagen going to produce military equipment for Germany? If so I know where I’m going to invest!",
            "score": 1,
            "replies": [
                {
                    "author": "knallfix",
                    "body": "There have been talks between Rheinmetall and VW last week.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -6,
            "replies": []
        },
        {
            "author": "WorldsLongestPenis",
            "body": "nooooo they’re throwing the salute!",
            "score": -7,
            "replies": []
        }
    ]
}