{
    "title": "Turkey Cuts Russian Oil Imports by 31% Amid G7 Sanctions",
    "author": "Silly-avocatoe",
    "subreddit": "worldnews",
    "rank": 15,
    "score": 825,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 18,
    "url": "https://united24media.com/latest-news/turkiye-cuts-russian-oil-imports-by-31-amid-g7-sanctions-6827",
    "id": "1je73hy",
    "selftext": "",
    "comments": [
        {
            "author": "ernapfz",
            "body": "Every bit helps.",
            "score": 43,
            "replies": []
        },
        {
            "author": "Catymandoo",
            "body": "Better late than never. Keep turning the screw on Putin, he only understands superior strength.",
            "score": 13,
            "replies": []
        },
        {
            "author": "Killerrrrrabbit",
            "body": "They should have done it years ago.  Turkey has the gall to say it supports Ukraine while funding Russia.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Milton_McGee",
            "body": "I find it hilarious how much virtue signaling Europe does about Trump and Putin being friends.    \n      \n    \nYet they still buy oil from Russia.  Looks like at the end of the day it's about money and not Ukraine.",
            "score": -55,
            "replies": [
                {
                    "author": "OutandAboutBos",
                    "body": "Stupid, uninformed comment.",
                    "score": 36,
                    "replies": []
                },
                {
                    "author": "wishmaster8787",
                    "body": "for europe its pretty much impossible to get around buying russian energy without strangling itself.\n\n  energy is the absolute foundation of pretty much everything. regarding production, manufacturing, heating homes, transport/mobility - you name it.\n\n russia provides the world with more than 10% of the available crude oil. the oil finds a way, one way or another. we are trying to shift to renewables but this takes decates if not a century. you can't flip a switch and turn off your lifeline of oil and gas.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "ProfPragmatic",
                            "body": "> for europe its pretty much impossible to get around buying russian energy without strangling itself.\n\nThe bigger issue folks have is EU being incredibly unhappy and accusing the global south of bankrolling the Russians, despite doing the same themselves. At the end of the day, oil is essential to modern living so countries will buy it be it directly or indirectly - just dont be sanctimonious hypocrite. \n\n> you can't flip a switch and turn off your lifeline of oil and gas.\n\nThing is the EU and allies need to put their money where their mouth is, you cant switch now, but if you want to switch at some point fund it now. Fund mass switching to greener tech like solar, nuclear, etc",
                            "score": -4,
                            "replies": []
                        },
                        {
                            "author": "Milton_McGee",
                            "body": "There's plenty of oil in Europe.  And nuclear power options. Just too many nonsense environmental laws",
                            "score": -23,
                            "replies": [
                                {
                                    "author": "Genocode",
                                    "body": "No lmao.\n\nThe only thing being held back by environmental laws is the Groningen Gasfield and thats not even oil.",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "Milton_McGee",
                                            "body": "Then why are there no new nuclear power plants.  Why no new oil pipelines.   \n     \nEurope needs to learn to take care of itself.",
                                            "score": -14,
                                            "replies": [
                                                {
                                                    "author": "Genocode",
                                                    "body": "That has nothing to do with environmental laws lmao.\n\nOil pipelines to which country? Which country could we create a oil pipeline to without going through Russia?\n\nAnd there are new nuclear power plants in the process of being built right now.\n\nIf you don't know what you're talking about then just say so instead of just making shit up.",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "author": "Milton_McGee",
                                                            "body": "Look up an oil reserves map for natural resources.  You also could use hydro fracking like we do in the USA.   Why don't they?  Because they are tree huggers.   \n    \nGermany alone has shut down 10 nuclear reactors in the last 15 years.   Bad leaders without common sense.    \n    \nBut hey it's not my business.  I'm cool with doing business with Putin. Europe can make it's own choices",
                                                            "score": -9,
                                                            "replies": [
                                                                {
                                                                    "author": "Genocode",
                                                                    "body": "Stop looking at funnily colored maps and start looking at the statistics.\n\nNorway and the UK are the only countries in Europe with meaningfully large oil reserves, Norway has (best case scenario) 8.5 billion barrels giving them the 21st largest oil reserve and the UK 2.5 billion barrels (also best case scenario) giving them the 34th largest.\n\nEurope uses 18.5 million barrels a day, even if they pumped as hard as they could they would run out in less than 600 days.\n\nThe 3rd largest oil reserves in Europe are in Romania, with only 600 million barrels, it would disappear in 45 days.\n\nGermany shut down its Nuclear reactors before the invasion, and it was a policy decision not environmental laws. And there are murmurs that they're considering turning them back on again.\n\nAside from Germany, there are 58 nuclear reactors in various stages in Europe right now.\n\nHonestly just stop basing your political opinions on what the American MSM tells you, its fucking garbage.",
                                                                    "score": 11,
                                                                    "replies": [
                                                                        {
                                                                            "author": "AxelF1982",
                                                                            "body": "This man is a stupid idiot. Don‘t come with facts. MAGAs only believe what Trump says. They have little education and think the USA are the greatest country in the world. They do not now shit how the world is operating.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "AxelF1982",
                                                                    "body": " Cool with doing Business with Putin is something a traitor to the American values would say. Congratulations you are dump af.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Milton_McGee",
                                                                            "body": "No one has American values but Americans.  We live in dangerous world where nuclear war could break out at any moment.    \n    \nWe should be appeasing Putin after the damage western sanctions have done to Russia.  We have treated them very badly.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "AxelF1982",
                                                                                    "body": "That is just bs and what Trump says. Who treated who badly? Poor Vladimir the world is so mean to me.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Milton_McGee",
                                                                                            "body": "Why is the radical left determined to extend the cold war for all of eternity.  Do you need a boogie man to be scared of?  \n    \nI'd rather have world peace.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}