{
    "title": "Nothing is free",
    "author": "kalcif",
    "subreddit": "KidsAreFuckingStupid",
    "rank": 11,
    "score": 5325,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 28,
    "url": "https://i.redd.it/2iaw31lyc6pe1.jpeg",
    "id": "1jd48hn",
    "selftext": "",
    "comments": [
        {
            "author": "Zestyclose-Sink4438",
            "body": "Wholesome stupid is my favorite",
            "score": 375,
            "replies": [
                {
                    "author": "Icy_Sector3183",
                    "body": "Is it because both kid and dad are dumb?",
                    "score": 28,
                    "replies": [
                        {
                            "author": "Ok_Violinist_9820",
                            "body": "How is the dad dumb in this?",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "Icy_Sector3183",
                                    "body": "Breathing doesn't cost money.\n\n\"But hurr durr taxes!\"\n\nFalse correlation. Sure, you pay taxes while you live, you breathe while you live, but the amount of tax isn't related to the amount of air you breathe.\n\nTelling the kid breathing isn't free is misleading to the point of being ignorant.",
                                    "score": 31,
                                    "replies": [
                                        {
                                            "author": "kalcif",
                                            "body": "This was my dad, and I remember when I asked him this he was in the middle of going through finances. Once a month, he’d go through all the receipts (this was in the 90s), and he’d always be pissed off because he’d say “we’re pissing away money! Nothing is free!” So I asked about breathing and his response was more like disgruntled dad, not LITERALLY nothing is free. I just took it literally because I was a kid.",
                                            "score": 35,
                                            "replies": [
                                                {
                                                    "author": "Icy_Sector3183",
                                                    "body": "I'll add \"frustraded with the f***ing bills\" to my list, then. :)",
                                                    "score": 7,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Ok_Violinist_9820",
                                            "body": "I thought it meant “nothing is free” as in how breathing cost oxygen created from plants and trees and how pretty much everything cost something else. I didn’t even think of the mindset of connecting it to money.",
                                            "score": 9,
                                            "replies": []
                                        },
                                        {
                                            "author": "FusionNexus52",
                                            "body": "I assumed the father was making a Joke about the fact that living itself isnt free, since you kinda need to breathe to live, and to live you need money (or some ridiculously top notch survival skills)",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "softserve-4",
                                            "body": "Something not being free doesn't always have to mean money. Nothing is free because everything has a cost, regardless of whether is costs money. The cost of breathing is a tiny amount of energy and a tiny bit of O2 being removed from the atmosphere. \n\nPlus, think of the movie The Lorax. Poor air quality could lead to people paying money for clean air. Part of our taxes do go towards efforts made under the clean air act.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "SqueakiestSquid",
                                            "body": "If you wanted to be pedantic you could argue that breathing isn't free because we have to spend effort (and yes, taxes) to keep it clean through regulations.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Kgwasa20sfan",
            "body": "Ohhhh... Thats why i pay taxes",
            "score": 52,
            "replies": [
                {
                    "author": "fnording",
                    "body": "You are also responsible to pay taxes on the sunlight that comes in through your blinds!",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Kgwasa20sfan",
                            "body": "I dont have any blinds. Or curtains",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "EuroXtrash",
            "body": "Gravity is.",
            "score": 63,
            "replies": [
                {
                    "author": "manguythingdude",
                    "body": "Not any more it ain't, imma be rich",
                    "score": 38,
                    "replies": []
                },
                {
                    "author": "SomeDudeWithALaptop",
                    "body": "Hey there's something we have in common.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "cjongeling",
            "body": "When I was six, a Catholic friend told me that if I held one hand to my heart when I slept, Jesus would be with me.  I'm now atheist, but I still do it.",
            "score": 19,
            "replies": [
                {
                    "author": "kalcif",
                    "body": "Dang that’s cute as hell. Thanks for sharing that. I’m not catholic anymore, but I still punch my chest twice, kiss my knuckles, then throw a peace sign in the air when I’m wishing health on my family. I used to do that after every prayer when I was a kid like it was my little handshake with God lol\n\nAlso someone told me their uncle was strangled by a demon in his sleep when I was in elementary school, so I started sleeping on my side to make it harder for a demon to sit on top and strangle me. I still sleep on my side because I feel too vulnerable on my back or stomach in case *something* strangles me",
                    "score": 10,
                    "replies": [
                        {
                            "author": "KayQuesue",
                            "body": "I love how the habits we pick up as innocent children still accompany us in our everyday lives. Makes the day a bit more joyful for me.\nAs a kid, I started wishing every car with sirens good luck, because I thought the cars were scared to respond to emergencies. Still do it and can only recommend starting it haha",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "alwaysflaccid666",
            "body": "How are your lungs doing?",
            "score": 17,
            "replies": [
                {
                    "author": "FractalGeometric356",
                    "body": "How is his brain doing?",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "weird-dude-bro-6386",
            "body": "Know what is free? That would be your mo-",
            "score": 6,
            "replies": []
        },
        {
            "author": "Least_Money_8202",
            "body": "“I can give you the style but nothin is free” -The Alchemist.",
            "score": 2,
            "replies": []
        },
        {
            "author": "KnockedBoss3076",
            "body": "With the amount of pollution these days yes not wrong, breathing is starting to cost you your health",
            "score": 1,
            "replies": []
        },
        {
            "author": "Owachato1",
            "body": "Then the kid faints for not breathing correctly and all that saving goes to the drain at the hospital 💀",
            "score": 1,
            "replies": []
        },
        {
            "author": "Automatic-Art-4106",
            "body": "Cause and effect. Every action has a consequence",
            "score": 1,
            "replies": []
        },
        {
            "author": "caffeinefamine",
            "body": "💀😂",
            "score": 2,
            "replies": []
        }
    ]
}