{
    "title": "Hungary just passed a law banning Pride March",
    "author": "FallMajestic8896",
    "subreddit": "pics",
    "rank": 3,
    "score": 6196,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 634,
    "url": "https://i.redd.it/fokkwd8bngpe1.png",
    "id": "1je6lt6",
    "selftext": "",
    "comments": [
        {
            "author": "artlastfirst",
            "body": "devastating for all the politicians sucking putins cock",
            "score": 1,
            "replies": [
                {
                    "author": "nsucs2",
                    "body": "Well, that's a wrap. Enough said.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "phone-culture68",
                            "body": "Who’s going to tell all the protesters in the streets?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "thisisdropd",
                    "body": "They should’ve known better that small things are a choking hazard.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "LetTheDogeOut",
                    "body": "😂",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "SlyJackFox",
                    "body": "Take my up vote damn you!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "spderweb",
                    "body": "They'll have to stay Hungary.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Ill_Personality_3705",
                    "body": "r/deathbywords",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "mole55",
                    "body": "ahahah the joke is that homophobes are secretly gay! clearly it can’t be straight people that are actually the problem",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "texachusetts",
                    "body": "At least they aren’t proud of it? /s",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TehNext",
                    "body": "Word!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "zzDemire",
                    "body": "I was wonder how long I gotta scroll till I see reddit mentioned Putin in policy against ridiculous parades and here we are",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "sinnops",
            "body": "This is the part of the timeline when things start regressing for the next few decades.",
            "score": 1,
            "replies": [
                {
                    "author": "kuvazo",
                    "body": "I've recently seen a discussion about the movie \"Fear And Loathing In Las Vegas\" and how the events of the late 60s mirror the events right now.\n\nYou had a period of rapid social progress and general acceptance towards people that were shunned from society previously, only for all of it to come crumbling down in the 70s, which led to a period of massive regression in that regard.\n\nThe late 2010s truly felt like we were finally at a point again where those hateful ideologies didn't exist in the zeitgeist anymore. And even Trump's first term was met with a lot of backlash from the population, celebrities and companies. But all of that has changed now. Companies and celebrities are sucking up to MAGA, the US is aligning itself with Russia and the whole western world is seeing the rise of far right parties.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Ok_Steak5069",
                            "body": "Look at the events leading to ww2 - Spanish Flu, Economic Recession, rise of right wing leadership… it’s the same pattern….",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "bruucewayne",
                                    "body": "I say this to people all the time. The signs are right there. History never lies.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Perstigeless",
                                            "body": "Well... recorded history does lie a *little bit*",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "DBFN_Omega",
                                                    "body": "Just like General Shepherd said, only the victor writes the history books",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "freeman_joe",
                                                            "body": "As Abraham Lincoln said don’t believe everything on internet.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "DazingF1",
                                                    "body": "You can change 'a little bit' to 'a lot'. History is written by the victor is a saying for a reason, although it should really be *history is written by the survivor*. It's why Babylon was considered as an evil and oppressive empire, because Hebrew/Jewish scriptures are all that survived, why Germanic/Gallic tribes were considered barbaric and inhumane, because Roman scriptures were well documented and that's what we based it on even though now we know that it was mostly propaganda to rile up the population back home.\n\nHistory is basically just \"this is what we know, from that we can draw so-and-so conclusion\"",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "cytherian",
                            "body": "I think the problem that tends to happen, like in periods like the 2010's... is a complacency. \n\n\"We won! Now let's enjoy life.\" Meanwhile, those who lost aren't enjoying... they are scheming and devising ways to come back. The Republican Party has been on a crusade since the horrible Bush years followed by two terms of a black Democrat president. They used racism to rile up a large sector of people. Trump didn't create this. He simply harnessed what was already there. HE WAS ENCOURAGED by the far-right to step up. Steve Bannon in particular. \"The time is now. Step up and it could all be yours.\" And with so much foreign help pouring in with disinformation propaganda peppering vulnerable social media, it happened.\n\nWhen we kicked Trump to the dirt in 2020, it wasn't over. Did any Democrats reach across the aisle to proactively put together a bipartisan rebuilding plan? No. MAGA was reviled. The GOP was laughed at. And so McCarthy went crawling back to Trump at Mar-a-Lago and begged him to stay involved.\n\nI can't hammer this down enough--Donald Trump was the worst possible candidate one could pick. He was not only a convicted felon on fraud for over 30 counts awarded unanimously (fraud, meaning a liar, a deceiver), he had 3 other major indictments with court cases in the queue. He was in really deep shit and he even admitted that he had to win the election to avoid prison. Same for Elon Musk, admitted to Tucker Carlson that if Trump doesn't win he's in deep shit (no wonder why he pumped $250 million into Trump's campaign for swing states).  THE GLARING PROBLEM WAS STARING US IN OUR FACES... but news media really failed us. They treated Trump as just \"the other candidate.\" Rarely did they bring up his unbelievable baggage. And of course the far-right only brought it up when asked, dispelling it as all a \"political hit job with no merit.\" \n\nThe litmus test was conducted and America failed. I mean, even if you discount the sweeping election suppression acts by the Republicans, Trump got way too many votes for comfort. It proved that right-wing media was supremely effective and perpetuating false positive narratives about Trump and false negatives about Harris.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ScuffedBalata",
                                    "body": "> We won! Now let's enjoy life.\"\n\nI saw the opposite.\n\nI saw a broad tolerance of gay marraige, a broad concensus that racial profiling was bad and that cops were over-doing their mandate.\n\nBut what followed was \"white people need to sit down and shut up\" messaging and \"equality is racist\" messaging.\n\nI was a gay-rights activist in the 90s.  I was ousted from the very groups in the late 2010s because while I support rights of trans people and other things, I was never in full approval of the \"it's all the same\" arguments of turning the well accepted rainbow flag into a \"tolerance for everything\" bucket.  They added trans and even racial equlaity to the flag.  Everyone rolled their eyes and decided the message was too stretched. \n\nWhat we spoke about in the late 1990s and early 2000s was \"gay people are just normal people\".  that resonated.  Matthew Shepard was killed, and the message was \"he was just a kid who was as confused as any other and he was killed for it\" (yes I'm aware there are people who are skeptical of his character).\n\nWhen Will and Grace had a gay character, he was just another random \"TV dad\" type.  When \"queer as folk\" premiered, it was just a show about some normal friends who lived fairly ordinary urban lifestyles.\n\nBut after that came the push.  And it was rapid and HARD.  It started in earnest about 2014-2015 and it was pretty obvious from my view.\n\nThe range of impacts it had were broad, but I'll pick out a few...\n\nFor example, trying to put drag queens and trans people in the same bucket as \"vanilla\" gay couples. \n\nAggressively lecturing white people about their \"privilege\" even when they were \"under-priviliged\" in a different way.  \n\nDemanding quotas on everything from university admissions to hiring to government business procurement.\n\n(In Canada) Pushing indigenous topics to the forefront of nearly every political conversation.\n\nA HUGE push on diversity from every area of government, education, industry, etc. BLM became and official motto of NBA teams and iconography of racial protest groups was officially put on the logo sets of professional stadiums, etc. \n\n**That's not \"complacency\" and \"sitting back doing nothing\".  What I saw was actually a sense of \"We won and can now do whatever we want and anyone who protests is ok to just cancel.  Get them fired, they're Nazis.\"**\n\nI had a friend in Ontario Canada who is a liberal voter, far from a conservative who simply asked a question during a DEI training. The training was mandating that they have a \"diversity panel\" that was mandatory attendance for all teachers.  But only minorities and a selected few hand-chosen \"advocates\" were allowed to speak.  Everyone else was required to sit and listen.\n\nHe simply said \"I don't think it's useful to mandate in advance that only certain racial demographics are allowed to speak regarding policy that affects everyone.\"\n\nHe was kicked out of the seminar and then later that week his contract was terminated.\n\nAbsolutely wild behaviour.\n\nYes, this was in Canada, but I know of at least a couple similar stories in Boston and California and similar discussions across the \"more blue\" parts of the US.\n\nIf progressives had said \"we had a good run, let's sit back for a bit\" in circa 2015, I kind of doubt all of this push-back would have taken place.\n\nBut the reality is that this hurt all the efforts.\n\nSelf-repoted \"race relations\" by racialized groups hit a self-reported (via surveys) high in 2014.  that was the best it ever got.  It was only after these divisive messages started hitting the mainstream that these people started to report \"race relations are getting worse\".\n\nSelf-reported tolerance for gay people hit an all-time high in 2017.  Again, further pushing and further advocacy with increasingly polarizing messages (i.e. drag queens reading to kids) got away from the \"gay people can look just like you and I and data shows us they make fine parents\" into \"you have to accept everyone even if they're super strange looking and behave oddly according to normal social standards\".\n\nBut that push to fundamentally deconstruct social norms really wasn't that prevalent until there were less \"fundamental\" topics to focus on, in my opinion.\n\nGod this turned into an essay, sorry.  I'll stop ranting now.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "AtheistArab99",
                            "body": "Maybe in a few select countries but most of the world wasn't that way. There are still 15 countries where being gay is punishable by death including many US allies such as Saudi Arabia, Qatar, Kuwait etc...\n\nI am from Egypt. You can guess by my name that I am an atheist.  [An overwhelming majority of Egyptian Muslims (88%), say converting away from Islam should be punishable by death](https://www.pewresearch.org/short-reads/2013/07/02/egypts-restrictions-on-religion-coincide-with-lack-of-religious-tolerance/) \n\nIt's a very small percent of the world that was progressive for a short amount of time. And now it's snapping back",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "TwoWordsMustCop",
                                    "body": "The 15 countries that punish homosexuality with death is the small percent of the world.\n\nThere exist 195 countries according to the U.N.\n\n15/195 = 0.76 = 7.6%\n\nSo 92.4% is a very small percentage, come on dude don't be a silly goose.\n\nFurthermore, \"In 2020, the ILGA stated that Iran and Saudi Arabia were the only countries in which government-sanctioned executions for consensual same-sex sexual activity had taken place since 2000.\"\n\nSo only 2 countries out of 195 actually practice such a stupid law, I call that a small percentage.\n\n2/195 = 1%\n\nSo you believe that if one is gay then they should be puinished by death?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "sinnops",
                            "body": "Civilization is very cyclical with swings one way then eventually there is pushback and things swing the other way and so on and so on. Some segment of the population always feels they are getting the short end of the stick.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "yeseecanada",
                                    "body": "Sure but when it swings to the left you don’t get a holocaust. When it swings to the right you do. Unfortunately for us we get the rightward swing.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Steveosizzle",
                                            "body": "Ask a Ukrainian about the left not having any mass death events when things get too spicy.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Steveosizzle",
                                            "body": "Ask a Ukrainian about the left not having any mass death events when things get too spicy.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Illustrious-Care-818",
                                            "body": "Lol",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "amrasillias",
                                    "body": "Yup look up Spiral Dynamics, it’s very interesting.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "obi_wan_jabroni_23",
                            "body": "Where was that discussion out of interest? Love the book/movie but hadn’t really thought of it in this way. Would be interesting to read if you remember where!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Nathio9",
                    "body": "They already have for awhile now and it's just getting worst",
                    "score": 1,
                    "replies": [
                        {
                            "author": "luvvdmycat",
                            "body": ">it's just getting worst\n\n\nScary times when they skip worse and go right to worst.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SignoreOscur0",
                    "body": "Nah man, hungarian politicians are just a bunch of neo nazis. My mom is hungarian and lives there and the stuff she says sometimes is wild",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "BenevolentCrows",
                    "body": "This is really excepted. They are grasping for last straws in propaganda, and this is really used as a basis to ban any protest against their regime.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "xTiLkx",
                    "body": "We entered that during COVID. Possibly before, but COVID pushed it through.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "AbradolfLincler77",
                    "body": "Start? Covid was the catalyst and it's been getting worse since.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "hot_topicc",
                    "body": "this aint regression to most.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "hot_topicc",
                    "body": "this ain't regression to most.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "sinnops",
                            "body": "When you enact a policy that actively disparages a group of people by removing their rights, thats regression.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SnooRevelations979",
                    "body": "The Empire Strikes Back",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "AtheistArab99",
                    "body": "I don't think Westerners realize what a tiny minority of world population they are.\n\nBeing gay is illegal or punishable by death (explicitly or implicitly) in the majority of the world.\n\nHungary is taking it easy compared to most countries. Those of you in the West are extremely fortunate and a global minority.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Mindless_Rock9452",
                    "body": "Says the motherfucker posting futa porn. So we can't exist in public, but the second we become sex dolls it's perfectly fine?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Xyreqa",
                    "body": "💀💀💀 cooked them",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "rocketfan543",
                    "body": "Fuckin' obliterated them. Love to see it",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "RelationshipOne2225",
                    "body": "This is also you:\n\n„[F4M] [Script Offer] A Greedy Boy’s Futa Mommy Adventure [Futa][MD/LB][Incest][Anal][Fingering][Thigh-Fucking][Caring and Rough][18+]“\n\nWow",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "pijaGorda1",
                    "body": "Is this you?\n\n[F4M] [Script Offer] A Greedy Boy's Futa\nMommy Adventure [Futa[MD/LB][Incest][Anal]\n[Fingering][Thigh-Fuckingl[Caring and Rough]\n[18+]\n\nhttps://www.reddit.com/r/gonewildaudio/s/nOzg8rDsn6",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DanKoloff",
            "body": "What if all European LGBT organisations made the biggest pride parade in Budapest.",
            "score": 1,
            "replies": [
                {
                    "author": "AtheistArab99",
                    "body": "Probably lead to a bunch of people beaten or worse",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ResearcherAlert338",
                            "body": "It’s not that likely. Public opinion is very divided on this issue, and according to statistics, the Hungarian population is mostly against it. Many people plan to illegally participate in Pride events without having any LGBTQ+ connection, just to express their disagreement.\n\nThat’s why this additional law was introduced:\n\n\"In cases of suspected misdemeanors, if the perpetrator is unknown, authorities (courts, law enforcement, and preparatory investigation bodies) can use facial recognition systems to identify individuals, as specified in the law on facial recognition databases and analysis.\n\nAnyone who organizes or leads a prohibited gathering by circumventing the assembly law, or who attends such a gathering despite police warnings about its illegal nature, is committing an offense.\"\n\n\nI doubt there would be much physical violence. The last major opposition protest had 70,000–100,000 participants, and Pride will only be bigger than that.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Sheetz_Wawa_Market32",
                    "body": "That’s what Orbán would want. “The globalist gays” breaking the law in Hungary? Best case scenario. \n\nNo, Hungarians need to deal with their vile kleptocrat themselves.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "GetEm_Griz",
                    "body": "Nah, think bigger.  Go do it in Iraq.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "random-meme422",
                    "body": "The footage that would appear would be funny to say the very least",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheSteffChris",
            "body": "F*ck Viktor Orban. Get this piece of shit out of the EU ASAP.",
            "score": 1,
            "replies": [
                {
                    "author": "heroheman",
                    "body": "I wish we could. I also wish that individual countries could not sabotage and blackmail the entire EU apparatus with their veto.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Skulldo",
                            "body": "Apparently there's a way to withdraw voting rights from countries that do not meet the ideals of the EU. \n\nIt's just what I read in another post but it sounded real.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "the_gamers_hive",
                                    "body": "It is real. It's called article 7. Unfortunately, it requires a unanimous vote by all other members, which is not happening as slovakia* doesn't want to risk getting article 7'ed themselves iirc. \nThough, european beurocrats have proven creative in times of crisis, so who knows what loophole they can pull out of the books.\n\n*corrected as pointed out by others.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Centralredditfan",
                                            "body": "Maybe now they do, as the parties  changed.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "wagldag",
                                                    "body": "but now Slovakia won't agree as Fico is gobbling Putins schlong probably even harder than Orban...",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Isaac0246",
                                                            "body": "I really think Fico and Orban is in a race who can lick better Putin s different holes",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "IAmAGenusAMA",
                                                                    "body": "This thread contains the most unpleasant imagery. 🤢",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "IAmAGenusAMA",
                                                                    "body": "This thread contains the most unpleasant imagery. 🤢",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "No-Law-6960",
                                                    "body": "Bribe Fico",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "ComprehensivePin5577",
                                            "body": "Hahaha, beurocrat, I just got it...",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "PM_ME_UR_VULVASAUR_",
                                            "body": "I would imagine Poland's existential crisis might give them more motivation to do it... as important as the EU is to Poland.. Hungary's constant hurdles against Russian action puts them in more danger than anyone aside from Ukraine.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "The_Hunter11",
                                            "body": "Slovakia thinks about the same as Hungary so no chance. And currently i wouldn't count on the Netherlands to vote in favour of his. They don't even want rearmeurope because it could cost them some money.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "the_gamers_hive",
                                                    "body": "I will agree there, our current (dutch) government is horridly dysfunctional in general, I'm surprised the coalition hasn't collapsed yet due to all the infighting.\n\nThe rest of the parliament is much more willing to rearm however, hopefully the next elections put one of them in power instead.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "snoop_chinchilla",
                                            "body": "You have outdated facts bro, Poland is on right now, Slovakia is the issue now",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "the_gamers_hive",
                                                    "body": "Ah, didn't realise they started blocking it instead. Thanks!",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "PrettyQuick",
                                    "body": "EU wants to expand not get rid of members",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Mateorabi",
                                    "body": "The problem is Hungary will veto for Turkey and Turkey will veto for Hungary. ",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "pitshands",
                                    "body": "Since when is Turkey in the EU?",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "bishibot",
                                    "body": "Turkey is not part of the EU last I checked?",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "arainone",
                                    "body": "Bruh...Turkey is not in the EU",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Protodonata",
                                    "body": "I don’t think Turkey will be vetoing much in the EU…",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Clementine-Wollysock",
                                    "body": "You're thinking of NATO.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "RoastedPig05",
                                    "body": "A common problem for NATO, but at least Turkey isn't part of the EU right now",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "dc_IV",
                            "body": "I wish there were better Windows in Hungary!",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "CrabPerson13",
                            "body": "That’s sounds familiar.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Tragedy333",
                            "body": "Having a different opinion is sabotage and blackmailing?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Appollo1816",
                    "body": "Remaining in the EU is so important for genuine democracy to return to Hungary. Without EU oversight the fear is that Hungary will start sliding even faster. The people of Hungary need the EU more than ever.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "BlockAffectionate413",
                    "body": "Well Orban himself describes his rule as a \"illiberal democracy\", while rest of EU often talks about \"liberal democracy\" being their core shared value.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Overnoww",
                            "body": "I feel like the word \"democracy\" requires sneer quotes any time it's being used to talk about Hungary/Orban.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "BenevolentCrows",
                            "body": "Illineral, I agree, it is not a democracy tho.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Fluid_Cat2269",
                    "body": "First thought that came to mind.\nEU needs to really kick Hungary out. Orban has been Pootin’s agent #1 in EU for the past 3 years.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "tvb46",
                    "body": "Think about this. Banning them would mean there is no control of whatsoever anymore.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "SunshineOnStimulants",
                    "body": "As a Hungarian, fuck Orbán Victor. I miss my home so much and I wish I could go visit at least but this shithead makes me feel unsafe in my own home country.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "suvlub",
                    "body": "If you think that would be good idea, imagine the reverse. Imagine you see headline like \"Putin kicks X Republic out of Russian Federation due to its pro-western stances\". How would that feel? \"Damn, no, Russia is now stronger than ever without those traitors, and my condolences to the guys in X who now have to fend for themselves\". Or would it be more like \"Hell yeah, congrats to X, hope more will follow soon\"? Now imagine you are Putin and the headline is about a country leaving EU.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "DJdirrtyDan",
                    "body": "But Orban is good, Trump said so!\n\n/s",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "AmirCys",
                    "body": "We’re working on it.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Central_court_92",
                    "body": "I think Juncker didn’t slap him hard enough.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "OZZY-1415",
                    "body": "The only thing kicking hungary of the eu would do is give putin a military base in the middle of eu territory.\n\nNobody wants that",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "JohnnyDarkside",
                    "body": "I was floored when he was at the RNC praising Trump. It's just unfortunate that more people didn't understand how dark their intentions were when they had that fucking monster talk at their convention.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "KaanyeSouth",
                    "body": "Let's be honest, most Ukrainians probably have similar beliefs",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "KaanyeSouth",
                    "body": "Let's be honest, most Ukrainians probably have similar beliefs",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "KaanyeSouth",
                    "body": "Let's be honest, most Ukrainians probably have similar beliefs",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Kismonos",
                    "body": "Another political expert chiming in. ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "EmmaLouLove",
            "body": "For those who don’t already know, Republicans love Viktor Orban. They gave him a standing ovation at CPAC after he gave a speech in Hungary in which he decried Europe becoming a “mixed race” society. \n\nThis should scare the hell out of every American. I am open to discussion with anyone who thinks the Republican Party can be saved at this point. And when I say saved, I mean remain a functioning political party that does not worship tyrants, ignore the rule of law and threaten judges and freedoms.",
            "score": 1,
            "replies": [
                {
                    "author": "PrinsHamlet",
                    "body": "It's obvious that Trump is much inspired by Orban's subversive policies.\n\nThe attacks on the press, judges, his use of executive powers and the attacks on the checks and balances (that surprisingly to me are not well protected by the US constitution) are all from the Orban playbook.\n\nPlus they *whine*. Constantly. If it wasn't so consequential it would be hysterical funny how these \"Alpha Conservatives\" are the whiniest people in the world.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "CoconutOilz4",
                    "body": "Just here to say as a POC whose parents are not from this country my eyes are wide open everyday.\n\n\nNot scared exactly but like in awe.\n\n\nI'm waiting for the day they get down to deporting the children of immigrants. ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "feedus-fetus_fajitas",
                    "body": "Shit, Tennessee is foaming at the mouth to become little Hungary. Inviting Hungarian leadership into the government buildings to give speeches... Passing bullshit legislation... Shuttering the press from being present.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "chrissie_watkins",
                    "body": "Conservativism is an inherently destructive, harmful ideology, and it's just as much of a failing concept as communism. It can only work in the short term. The Republican Party can't be saved, it can only be allowed to continue to fail, harm, and destroy in different ways.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Stunning-Bike-1498",
                    "body": "Fidesz is also financing a think tank that is aligned with the Heritage Foundation.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Designer-Character40",
            "body": "Pride has never not been a riot.\n\n\nBricks up, queers, let's do this.",
            "score": 1,
            "replies": [
                {
                    "author": "Cynical_Jingle",
                    "body": "Bricks up queers is my current favourite comment and I'm straight",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Arny2103",
                            "body": "Your version implies fornication with bricks.\n\nOP's version implies picking up bricks.\n\nCommas matter.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "PhilosopherFLX",
                                    "body": "Lets have grandma for dinner.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "TheScottishMoscow",
                                            "body": "Let's eat grandma - Let's eat, grandma.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Fremen85",
                                    "body": "All punctuation marks matter",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AtheistArab99",
                    "body": "Easy to say from the US when you're not the one putting your life in danger.\n\nI don't think people realize how much of a minority the West is when it comes to these sorts of freedoms. I'm from Egypt - no one would dare come out as gay and I don't care how brave you are.\n\nYou can guess by my name that I am an atheist.  [An overwhelming majority of Egyptian Muslims (88%), say converting away from Islam should be punishable by death](https://www.pewresearch.org/short-reads/2013/07/02/egypts-restrictions-on-religion-coincide-with-lack-of-religious-tolerance/)  Look I like to think I'm brave but I also don't want to be killed",
                    "score": 1,
                    "replies": [
                        {
                            "author": "rotzverpopelt",
                            "body": ">Look I like to think I'm brave\n\nAnd you are. Don't let anyone tell anything you otherwise.\n\nI want Europe to be a safe haven for every open minded people regardless of their race, religion or nationality. But unfortunately we are not quite there yet.\n\nWe keep fighting here for a better world and you hold out there until we get there",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Chillark",
                            "body": "Yea but you do know that freedom in the US was paid for in blood. Gay people were brutally beaten and murdered in the us for a long time before we ever attained this freedom.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Professional-Use2624",
                                    "body": "It’s really not comparable. While gays were being discriminated against in the US, there was still openly gay clubs, musicians, etc. You can’t have that in a place like Egypt. I’m familiar with Afghan culture and it’s the same.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "rewind2482",
                                    "body": "The countries that treated their minorities the worst you don't hear about a lot today, because the minorities aren't there anymore.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "2centchickensandwich",
                                    "body": "Holy crap you live in a bubble, you make it sound like your some rebel warrior lmao. The person above you isn't wrong. ",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "sahArab",
                                    "body": "It's absolutely the wrong time in history for Americans to be criticizing other people for not doing enough to fight ugliness in their own countries.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Antitras",
                                    "body": "If you think America is comparable to the Middle East, why don’t we see American LGBTQ activists in the Middle East protesting ?",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "TheEmpireOfSun",
                                    "body": "Shame that will to fight completely vanished from US.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "PM_me_ur_goth_tiddys",
                            "body": "People that say the u.s. democratic party is center right on the world stage should read this. We are extremely progressive with human rights and freedoms compared to other countries.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "lakulo27",
                            "body": "It wasn't easy in the US. The last generation fought and died for gay rights. Just for my generation to take them for granted and subsequently lose those rights because we didn't bother to keep fighting.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Odeeum",
                            "body": "Soon we'll get our turn in rhe US.  Soon.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Less_Likely",
                            "body": "I think the US will be there soon.  The current regime sees Orban as a model.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MetalBeardKing",
                    "body": "I’d love to see this attempted… \n\nBut it won’t happen 😔",
                    "score": 1,
                    "replies": [
                        {
                            "author": "adblokr",
                            "body": "They might not need your permission.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "standarduck",
                                    "body": "That wasn't the tone of their comment at all. Why turn this into infighting?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "adblokr",
                                            "body": "My goal wasn't to fight, I'm sorry. I'm frustrated with the helplessly defeatist attitude I see a lot of people have nowadays, I feel like it does more harm to the resistance than the opposition ever could. I see people who won't do anything to help the current situation, which is fine that's its own issue. I can't expect everyone to take up the banner. But then I see those same people criticize or downplay and generally undermine any action they see being taken.\n\nI see people glorify the strength of the enemy and cry about the weakness of us and our allies. They say the revolution could never happen when our oppressors are just too strong, too smart, too powerful. Why try? No one will try, and no one should! Defeat is inevitable, we should just try to hide and hope the oppressors don't pay us too much mind. This kind of thinking is sabotage!\n\nSo we bring up history, we talk about successful revolutions and the tactics that have been shown to work and all that they say is \"a revolution could never work *today.* Maybe those past revolutions got lucky, but our oppressors are different! No enemy has ever been as great as the enemy we face!\" Some people are so stubborn in their doubt that I feel like I have to applaud the FBI for running such a successful psy-op.\n\nThis is the attitude I wanted to convey with my earlier comment. Not infighting, I'd never mean to contribute to that problem. If u/MetalBeardKing had only said \"I'd love to see this happen!\" and focused on their support for our allies in Hungary as opposed to it seems already planning their funeral, I likely wouldn't have said anything. If they had even said \"I'd love to see this happen, but I worry it won't happen\" I wouldn't have been nearly as angry!\n\nBut it was the fact that they simply said \"It WON'T happen.\" and their using the word *attempted* that made me so frustrated. Who are you to decide what will or won't happen? Who are you to declare a revolution futile, or resistance as vain? \n\nPlease note, this isn't to say we're better off without the nay-sayers, we're only better off without the nay-saying. We don't gatekeep the revolution, all comrades are welcome. But PLEASE for the love of all that is holy if you're going to a be a comrade that whines and complains and all but sucks up to the enemy, consider at least being a comrade that is quiet.\n\n=========\n\nTL;DR, Put Up or Shut Up.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "rockness_monster",
                    "body": "Instructions unclear. Bricked up. Now what?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "asshat123",
                    "body": "Quick, somebody print me some \"Bricks up, queers\" t-shirts, that's gold",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "AshleyLouWho",
                    "body": "This needs to be on a shirt. I wish free awards still existed. Take my poor man's gold🏅",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "YouShouldGoOnStrike",
            "body": "Pride Riot it is.",
            "score": 1,
            "replies": [
                {
                    "author": "Techno_Bumblebee",
                    "body": "You know, in certain countries you can literally get arrested for inciting riot...\n\nOr even protest if it happens to turn violent they'll just blame it on the original source.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "maedene",
                            "body": "Riots are the language of the unheard. If anything can be considered a riot by the government you might as well turn everything into a riot.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Techno_Bumblebee",
                                    "body": "Do you mean protest, with picket signs and speeches with petitions, or do you actually, seriously mean a riot where people get violent and attack police and burn things?",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "maedene",
                                    "body": "Both. Either. MLK didn’t make a distinction since oppressive governments don’t.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Vivian_I-Hate-You",
                                    "body": "French revolution please x",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Flipthatbass",
                            "body": "Yeah, the question is: Do you want to live in a country where you cannot be free and face prison or death in case you get caught being who you are or do you rather get to fighting for your rights? I'd take the chances. Organize, take care of each other and stand up for yourselves.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "samttu",
            "body": "Another reminder that we are still living in the past, far from enlightened humanity. Good to know that I live in a time when, in the eyes of a future historian, we don’t differ much from cavemen.",
            "score": 1,
            "replies": [
                {
                    "author": "AtheistArab99",
                    "body": "That's because you assume the world is moving forward. Very much evidence it is going the other way",
                    "score": 1,
                    "replies": [
                        {
                            "author": "BupidStastard",
                            "body": "Things never progress so smoothly, history has shown that. Its periods of progress followed by periods of regression. But the periods of progression are always longer lasting and more impactful. So in the long run, things are always moving forward.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "schiesse",
                    "body": "How the hell do these cavemen get in power all over the place? I mean, I kind of know, but it still baffles me how many people can not see through the bullshit.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "funnytoenail",
                            "body": "Cavemen vote for cavemen and cavemen actively vote.\nPeople who are educated tend to vote less.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "slothbuddy",
                                    "body": "Education has a positive correlation with voting, not negative",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "funnytoenail",
                                            "body": "Not if they don’t turn out to vote",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "JackYaos",
                                            "body": "But they do, even more so when they're educated. That's what he said",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "JackYaos",
                                            "body": "But they do, even more so when they're educated. That's what he said",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "funnytoenail",
                                            "body": "Look at the US election, voter turnout dropped while Trump’s vote count increased. UK elections, total voter turnout dropped, far right voter share increased.\n\nIn most recent elections. The evidence is clear, progressives and liberals (usually educated), don’t come out to vote.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "JackYaos",
                                            "body": "But they do, even more so when they're educated. That's what he said",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "deadly_queen_",
                            "body": "People like simple solutions to complex issues, even if these solutions would never work.\n\nFascism thrives on that.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "LewisLightning",
                            "body": "A large number of people, possibly a majority of people, don't like the idea of someone knowing better than them. It actually doesn't matter if they are wrong or if they know they are wrong, what matters is the perception that a person may be smarter than themselves. It doesn't matter if only the person in question has that idea is themselves, they cannot bear the thought of someone smarter than them. So they will support someone else who seems more on their level or stupider because then they won't feel so insecure about themselves. And what gives them more security is a community of insecure people with the same mindset. Then it becomes easier to feign ignorance or just outright lie because now they have strength in numbers. \"You can't say we are all ignorant!\" or \"there's more of us than there are of you so clearly we are in the right!\" Is what they say, or the logic they adhere to.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "nish1021",
                                    "body": "That is very on point.   I’ve often thought like that, but wasn’t able to explain it coherently.  What you said was very well described.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "SexuaIRedditor",
                            "body": "The education systems they fund produce voters that are susceptible to their style of propaganda",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "st-shenanigans",
                            "body": "A lot of people never matured past high school. \n\n\nHigh schoolers are going to vote for the cool kid or the class clown because they simply like them better and the \"responsible\" one is boring and going to ask them to *do stuff*",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "phelpsiee92",
            "body": "Cool how closeted men in power hate people for coming out so much, that they will ban their march.\n\nedit: sigh.. I see how my comment offends LGBTQ+ community, but it was never made as such. I am and always has been in your corner and shall remain so. People who voted for this are just assholes, no matter their preferences. Sorry for the way I have put it.",
            "score": 1,
            "replies": [
                {
                    "author": "Fritzschmied",
                    "body": "Because the are insecure af themselves.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "phelpsiee92",
                            "body": "Exactly, hence me saying “closeted”. I bet most of them are latent homosexuals. Or just pure assholes. Who can’t live with themselves being cowards, so they will ruin lives of people that are actually better than them.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "finnjakefionnacake",
                                    "body": "it's not the own you think it is to imply that the people most keeping our community down are from our community itself. it's far too shortsighted, and it lets far too many homophobic straight people off the hook.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "phelpsiee92",
                                            "body": "It does not matter one bit, if they are or are not. It’s not letting anyone of the hook. They are still assholes no matter their sexual orientation. I just used the phrase, because it angers them (the homophobes, no matter their sexual orientation) the most.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "finnjakefionnacake",
                                                    "body": "does it anger them? do you think it actually does anything to homophobic people to be called gay? do you think it's going to stop them from trying to destroy lives or affect their goals in any actual way?\n\nyou putting the burden on gay people for this allows straight people to do the same.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Relevant_Arm_3796",
                                                    "body": "Plus you didn't rule out the people who hate on those of a different sexual orientation not because they're secretly like-minded (although true it's very common) but just because it makes them insecure in their own preferences or the greater respect/acceptance their preference has in their current society/culture and fear of that changing, the fact people are spending time criticising you over the active problem is a big part of how we got to this shitty place lol 👍❤️🤙",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "finnjakefionnacake",
                                                            "body": "yes, my comment is how we got to homophobes running governments, which is what they've been doing throughout human history.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "phelpsiee92",
                                                            "body": "I agree. Sorry for using the phrase then.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Relevant_Arm_3796",
                                                                    "body": "oh no I'm not criticising at all lol if anything the opposite I'm criticising the people criticising you for rightfully criticising these bastards 🤣👍",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "abzmeuk",
                                    "body": "Do you think people who are racist are actually black or something? You keep using that as if it’s an insult?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "phelpsiee92",
                                            "body": "Because in this instance, it insults assholes trying to rid minorities of their rights. But I am sorry for using it then.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "abzmeuk",
                                                    "body": "Again calling someone homosexual isn’t an insult under any circumstance. Do better than them and definitely don’t resort to becoming them.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "phelpsiee92",
                                                            "body": "I agree and your example helped me realize that.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AtheistArab99",
                    "body": "I hate this idea that everyone that is anti gay or people that murder gays are all gay themselves. It blames gay people for them being the victims.\n\nIt's also not true. Where I grew up the majority of people would have told you that being gay is punishable by death. They weren't all gay.\n\nThey also think that atheists like myself [deserve the death penalty](https://www.pewresearch.org/short-reads/2013/07/02/egypts-restrictions-on-religion-coincide-with-lack-of-religious-tolerance/). That doesn't mean they were secretly atheists.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "phelpsiee92",
                            "body": "I never presumed or believe all of them are gay as well. I made a point, now I see where that point is wrong and I apologize.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "AtheistArab99",
                                    "body": "All good.  Appreciate it",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Grambles89",
                    "body": "Then get caught in a political scandal having gay sex.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "bossmcsauce",
                            "body": "And it’s almost always with somebody way too young to be appropriate… or even legal in some cases.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "No-Law-6960",
                            "body": "It actually happened in Austria (Jörg Haider)",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "gerusz",
                                    "body": "Hungary too. Check the top post (all time) of /r/worldnews",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Fit_Trouble7503",
                    "body": "not every homophobe is secretly closeted, it’s homophobic to insinuate",
                    "score": 1,
                    "replies": [
                        {
                            "author": "phelpsiee92",
                            "body": "Nah, it’s a phrase that angers the homophobes (no matter the orientation) the most. I don’t actually believe they are all secretly gay for gods sake.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "SuperfluousWingspan",
                                    "body": "I get that, but the idea gets repeated so often that it sticks with people, even when they understand that it's not meant to be a serious accusation.\n\nIt also accidentally lessens the perception of their hatred by seeming to give it a rationale that partially paints them as a victim - like a villain in a TV show that's getting set up for a redemption arc in a few seasons.  Sometimes, the villain is just Frollo.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "phelpsiee92",
                                            "body": "I understand now, why am I in the wrong and I am sorry. But my goal was never to shift a blame. It was mostly letting out angry emotions without deeper thinking.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "SuperfluousWingspan",
                                                    "body": "Oh, of course not!  I'm not upset at you or attacking who you are or your intentions.  I can't speak for everyone, of course, but I'm just giving my take on why that joke may have outlived its helpfulness at this point.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Purple_Listen_8465",
                                    "body": "\"It's actually fine to be homophobic if it angers the right!\" is literally the same rhetoric people use on the right towards the left.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "phelpsiee92",
                                            "body": "I have not thought it this deep. I apologize. In my eyes they are messed up human beings, and I used wrong phrase out of anger.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ShroedingersCatgirl",
                    "body": "Hey can we please stop seeing every instance of homophobia as just self-hating gay people in the closet? It's extremely frustrating watching people erase actual homophobia by directly implying that queer people are the cause of our own suffering.\n\nThank you.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "phelpsiee92",
                            "body": "I agree. Sorry for offending you.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Isaac0246",
                    "body": "Nah its not about hate. Its about diversion.  Orban is in deep shit as the country is going down economywise for a long time. They need to create other topics to talk Bout. He is actually playing out the same things Putin did im the past. Literally",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "UnholyAbductor",
                    "body": "It’s cool dude. Gay AF, know the stereotype is not something the community appreciates. But it’s cool, we know when people say it, they’re not doing it out of hate or anything. \n\nFeel free to stick with the “all Republican gays are meth users” one though, that one ain’t a stereotype so much as the honest truth. \n\nThe P&P crowd is mostly toothless racists these days lol",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Helpful-Fennel-7468",
                    "body": "Could shave been worded with a little more consideration",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "gerusz",
                    "body": "[Still the top post of /r/worldnews despite all that's happened since then.](https://www.businessinsider.com/hungarian-mep-resigns-breaking-covid-rules-gay-orgy-brussels-2020-12)",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Civil_Satisfaction29",
                    "body": "Well, they hate everyone else outside of NER tbh... Orbán even said on 15 of March that we are - everyone who oppose him - bedbugs who should be killed off once and for all. (Just like Hitler said about the jews...)",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "st-shenanigans",
                    "body": "@ the edit\n\nFfs guys he's not trying to put the blame on gay people he's pointing out the irony. That's it. Let's stop trying to make enemies where there are none.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "InsightJ15",
                    "body": "I agree, whoever wanted it banned is probably in the closet",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Lufsol66",
                    "body": ">I am and always has been in your corner and shall remain so.\n\nYou are such a good person. Pat yourself on the back.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Painted-BIack-Roses",
            "body": "Why is time reversing? Why is everything becoming so conservative. I'm really not looking forward to the world in a years time",
            "score": 1,
            "replies": [
                {
                    "author": "-Lets-Get-Weird-",
                    "body": "Social media.  The easy way out is being hateful.  You don’t have to think to be hateful.   Then they spread their poisonous thoughts with a tool meant to amplify voices. ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "bossmcsauce",
                            "body": "I don’t think it’s strictly social media. It’s just cyclical. Mussolini popularized fascism before the internet… even before most people had telephones. Societies tend to experience cycles that tend towards right wing extremism over time, because dumb and scared people are easy to push in that direction. It’s always easier to push fear and outrage than tolerance and empathy, especially in times of social or economic turmoil. People who are trying to consolidate power for themselves always use this as a way to do so, and so their followers and society in general often trends that way until the inevitable collapse of the power structure, or eventual loss of public support. Whether by military coup or peoples revolution, or whatever, usually these types of conditions come to a end when people get fed up with being poor and oppressed, or blatant corruption leads to collapse of industry and government.\n\nFrom ashes, many times the rebuild is in a more progressive image that is meant to lift up all citizens (intent and reality often diverge, but a basic structure of ideals is usually more liberal following collapse of right-wing regimes). Just as often it’s rebuilt by another dictator… but eventually societies tend to swing back the other way. And things are good for a time… and when things are too good for too long, societal consciousness forgets what it means to have to fight to preserve their liberties and quality of life, and get tricked into right-wing ideas. The French have seen this shit enough over the centuries that their collective memory is strong and they know what it takes to maintain freedom for the working class. But many cultures do not.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Tentegen",
                                    "body": "This is such a wise answer.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Remarkable_Crow6064",
                    "body": "Podcast equipment is too affordable",
                    "score": 1,
                    "replies": [
                        {
                            "author": "BlubberElk",
                            "body": "Lmao this is a good answer",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Optimoprimo",
                            "body": "The most popular podcasts are run by very, very wealthy people.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "reichrunner",
                                    "body": "And most of the popular ones aren't spewing the hate that the other commentor was referring to",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Optimoprimo",
                                            "body": "Are you serious? Go right now and look at the top 10 podcasts on Spotify. Nearly all of them are right wing hate mongers or bunk artists like Joe Rogan\n\n\nTheir movement is winning the war of the internet right now. I think that needs to be better understood.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "totallytotodile0",
                    "body": "Because people are lazy and dumb and looking for easy answers in bad times, and people in power choose to exploit that. If you're focused on the people beneath you, you don't notice you're both under the same man's boot.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "thesupergoodlife",
                    "body": "The internet has allowed backwards thinking to become the norm. It's so easy to access and many have no idea they are consuming foreign dictatorships talking points.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Phoenix2211",
                    "body": "Ignorance is the reason. And thanks to the internet, hateful cunts have never had an easier time spreading their bigotry and ignorance.\n\n\nPutting out a well-reaearched, well-thought out argument takes time. It is SO MUCH EASIER to shit out a kajillion \"*insert minority here* IS BAD! AND HERE'S 10 REASONS WHY!!\" YouTube reels or videos in that time lol.\n\n\nPlus, giving the voting public someone to hate (for whatever bullshit reason) is VERY effective at distracting them from the real issues that threaten them and their interests.\n\n\nWhat's that Lyndon B. Johnson quote?\n\n\n\"If you can convince the lowest white man he's better than the best colored man, he won't notice you're picking his pocket. Hell, give him somebody to look down on, and he'll empty his pockets for you.\"\n\n\nNot entirely 1:1 applicable here, but the spirit holds true.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ozymandais13",
                    "body": "There are ebbs and flows in stuff and rn is a big populist strongman time. Happend all over the place for lile 15 20 years now",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "witooZ",
                    "body": "I think it's because the world in general moves faster and a lot of people are not very fond of changes. Conservativism just protects what we have now instead of making a progress.\nThat's why I think gay rights or abortions are so discussed and opposed by people who are completely unaffected by them. They are just scared that the world they were comfortable in and that they knew is slipping away from them.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "KaJaHa",
                    "body": "Rich people cause economic instability because it allows them to buy up capital for pennies. Poor people respond to economic instability by drawing towards the \"easy answers to complex problems\" offered by fascism.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "WeenieHutJr137",
                    "body": "I am going to preface this by saying I do not agree with the way things are going and no one should be treated any differently based on race, sexual orientation, gender, religion, etc\n\nBut this is an over correction to many people feeling the world has gone too far in the OTHER direction. Give it time, it'll flick back the other way. Then back. And keep repeating the process of over correction each way. MAYBE one day we'll settle in a rational place but that isn't going to happen any time soon",
                    "score": 1,
                    "replies": [
                        {
                            "author": "TommyTwoNips",
                            "body": "what is irrational about allowing gay people to get married?\n\nThe two positions are literally\n\n\\- gay people should not exist because I think it's gross.\n\n\\- gay people have the same rights as everyone else.\n\nThe people \"overcorrecting\" are antisocial wastes of oxygen that should be removed form society.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "WeenieHutJr137",
                                    "body": "I don't know and I won't pretend to know the rationality behind it but the majority of the world does not agree with you or I\n\nOnly 38 countries have legalized same sex marriage. Many cultures do not approve of it\n\nCalling people who disagree a waste of oxygen that need to be removed is counter productive. People can learn and become more open to new ideas but they won't do it if they are immediately met with an attack",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "TommyTwoNips",
                                            "body": "It's not my responsibility to mollycoddle ignorant assholes because their culture is backwards and they want to kill gay people.\n\nIt's their job to educate themselves or risk removal from society.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "WeenieHutJr137",
                                                    "body": "Shouldn't be anyone's responsibility but thats the world we live in. You can either do what you can to try to make things better or be bitter amd demand everyone conform to your views on their own",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "TommyTwoNips",
                                                            "body": "I'm not demanding that people conform to my views, I'm just pointing out that, like nazis, these people should be physically prohibited from participating in society and denied the capacity to keep spreading hate. So, despite the fact that going to war with the nazis was super effective in stopping the holocaust, we now have to treat their progeny like they are delicate flowers that deserve to have their hatred protected or else we're the \\**REAL\\** nazis.\n\nThere is no common ground with those people in the same way there is no common ground with racial supremacists. Some of them may be swayed with education, but for the majority their position isn't one of logic, it's one of hate and fear. Defending it as \"part of their culture\" denigrates the culture in question by erasing the queer people that helped build the positive aspects of said culture.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "zeekoes",
                    "body": "Tolerance hasn't changed, even in Hungary LGBTQ acceptance rates aren't that much lower and is still growing.\n\nWhat changed is that more people have become apathetic towards the problems of others. They might not have problems with gay people, they just have no problem with throwing them under the bus if it helps them (even though it doesn't).\n\nThey do not care for authoritarians going after minorities. They accept it as part of them. Authoritarians hate most minorities because the seek cultural homogeny because a homogenous culture is way easier to control than a diverse society with differing norms and values.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Majestic-Eagle3361",
                    "body": "Hahahaha get used to it",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "betweenskill",
                    "body": "Nah. ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "comhghairdheas",
                    "body": "Why should I?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Jestercopperpot72",
            "body": "This is the kinda \"democracy\" the MAGA right thinks they are gaining with their movement, however they are bypassing pseudo democracy and going right to authoritarianism without passing go. Will only be a matter of time before many of them are saying, i didn't think they meant my rights.",
            "score": 1,
            "replies": [
                {
                    "author": "SexuaIRedditor",
                    "body": "The US is a dictatorship as of this week. Sounds friggin ridiculous to say out loud, but it very literally is a dictatorship now. Trump appointees carry out his orders immediately and disregard legal orders to stop, and then after the fact get in front of the media and plainly say that they knew they were disregarding those orders, and will continue to do so in the future.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "nish1021",
                            "body": "Because there’s no repercussions.   They know their Führer will have their back.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "GetEm_Griz",
                    "body": "Is the big scary monster in the room with us?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "AskTheMirror",
                    "body": "Already happenin’ r/LeopardsAteMyFace",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Karukash",
            "body": "Fine it’s a pride stomp then",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThatTomboyThiccTho",
            "body": "Why can't they just let the gays do their gay shit like Damm",
            "score": 1,
            "replies": []
        },
        {
            "author": "l97",
            "body": "At the same time, Mayor of Budapest announced Pride will be held no matter what. I’ve never been to Pride, never been interested, I guess this year’s will be my first.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alkymyst91",
            "body": "I see that all of these idiots focus on the real important stuff while leeching their constituents dry.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FirstManufacturer648",
            "body": "How far we’ve drifted backwards from the idealised future utopia that we should be heading towards.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LayneLowe",
            "body": "I'm pretty sure they're going to March anyway.",
            "score": 1,
            "replies": [
                {
                    "author": "Cold_Appeal_6043",
                    "body": "Hope so",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "2enty4",
            "body": "The governments all around the world are restricting protests and marches, free speech never existed",
            "score": 1,
            "replies": [
                {
                    "author": "LewisLightning",
                    "body": ">free speech never existed\n\nWell that's true, but probably not in the way you meant. Free speech is allowed so long as it's not intentionally or directly harmful. So you cannot harass someone by following them around and yelling at them all day. You also cannot go around committing slander against someone either. At least not in public. You could always say this stuff to yourself or express it at home privately and never get in trouble. It really follows the idea that your rights end where another person's rights begin. Because if everything is allowed then the worst of humanity is allowed as well, so there has to be limits.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "2enty4",
                            "body": "Correcting me if I'm wrong but isn't a march a form of peaceful protest, because if so I fully support any kind of protest that doesn't inconvenience other people, for example yelling and harassing like you mentioned",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SirEmanName",
                    "body": "Apostrophe",
                    "score": 1,
                    "replies": [
                        {
                            "author": "2enty4",
                            "body": "Thanks",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Puzzleheaded-Day-196",
                    "body": "You've been allowed free speech and look where it's led society",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Cinnabar_Cinnamon",
            "body": "Glad I cancelled my Erasmus there",
            "score": 1,
            "replies": []
        },
        {
            "author": "lordkhuzdul",
            "body": "Conservatives always need an enemy they can yell \"but think of the children\" about. Their usual targets make them look like racists nowadays, so, sorry LGBTQ+ people, you got volunteered. Again. Your acceptable target status might end sometime, but I would not hold my breath while the damned books that enable and support actual pedophiles still hold so much sway.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AffectionateAir2272",
            "body": "Orban is not Hungary. His patrons are maybe 2 million of 9,6 million.\n\nBut the Orban's grovement has a 2/3 of parlaiment. It's not normal.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Signal-Blackberry356",
            "body": "Guess I’m skipping Budapest",
            "score": 1,
            "replies": []
        },
        {
            "author": "Seattlehepcat",
            "body": "Lovely to see that the children of collaborators are keeping that Nazi spirit alive.",
            "score": 1,
            "replies": []
        },
        {
            "author": "defnotevilmorty",
            "body": "What the fuck is going on in these comments?",
            "score": 1,
            "replies": [
                {
                    "author": "BlueCaboose42",
                    "body": "Bots and bootlickers, the usual really",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "BWanon97",
            "body": "Just to be clear did they also ban a Pride skipping? Instead of marching.",
            "score": 1,
            "replies": []
        },
        {
            "author": "art-is-t",
            "body": "Fascism is coming to Europe and it will target minorities.",
            "score": 1,
            "replies": [
                {
                    "author": "Caithus63",
                    "body": "It really never left, it just went into hiding. Now it feels brave enough to come out.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "KlingonLullabye",
            "body": "Conservatism is the enemy of liberty, prosperity, democracy, and equality\n\nIt's gross and so are its adherents",
            "score": 1,
            "replies": [
                {
                    "author": "Techno_Bumblebee",
                    "body": "What about communism? Because sometimes I feel like that's where some of the Western world is heading, or where these extreme liberals expect us to end up. \n\nEspecially those who try and force their views and other people despite claiming they are helping others...",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Wet_Water200",
                    "body": "oh no people are forcing their views of *checks notes* not discriminating against people based on how they're born and ensuring everyone has food and shelter on you!! The horror!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Altaneen117",
                    "body": "I mean this genuinely. What left wing US leader is communist? Can you explain what communism is?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Phog_of_War",
            "body": "Did the local football Ultras take over their hoses of government??",
            "score": 1,
            "replies": []
        },
        {
            "author": "Frenzystor",
            "body": "Can somebody please pass a law to ban Orban?",
            "score": 1,
            "replies": []
        },
        {
            "author": "mlhigg1973",
            "body": "That’s so sad.",
            "score": 1,
            "replies": []
        },
        {
            "author": "azaadi101",
            "body": "Why they celebrating it like a Pride March though!?",
            "score": 1,
            "replies": [
                {
                    "author": "tennisdrums",
                    "body": "I think it's a safe assumption that this image is showing politicians protesting against the law.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Specialist_Bit_964",
                            "body": "Yes. This is all they can do as Fidesz (Orbán) has a 2/3 majority in the parliament, meaning they're free to do whatever they want",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Fun_Gas_7777",
            "body": "Why??",
            "score": 1,
            "replies": [
                {
                    "author": "rocketfan543",
                    "body": "Because it's Orban, do a little opression and democratic backslideing so that you can district the people that the country is a shit hole",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ardibanan",
            "body": "We don't deserve this planet. When Oda is done with One Piece, the Earth can kill us",
            "score": 1,
            "replies": []
        },
        {
            "author": "OneUnderstanding4451",
            "body": "This is not about the Pride. This law contains that you need to pay penalty, if you participate this and any demonstration. They will use face cams to identify the protesters. The Pride is just a stall.",
            "score": 1,
            "replies": [
                {
                    "author": "Silverwolf-00",
                    "body": "This!!! Its not about pride, thats just what they want us to focus on! They are taking away our right to protest, not just pride but anything they dont support. Don’t be fooled, hungary doesn’t want this but we are not a democracy and haven’t been for a while! Things are finally starting to change with more and more people protesting and they can’t allow what happened in Serbia to happen to them… 😡😡😡",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "presidioPDX",
            "body": "This is sobering. Shame on them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "EmotionalSupportDirt",
            "body": "Real sad, just got home from the protest against it.\nPlan is to still have pride, and the opposing parties will also attend, to make it a really big protest.\nI am skeptical of the success, but I'll be there.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CupcakeIntelligent32",
            "body": "Ffs it's 2025.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Waldo305",
            "body": "And now everything in hungry that is critical of the government is a pride march. \n\nHow original.",
            "score": 1,
            "replies": []
        },
        {
            "author": "hayasecond",
            "body": "As things progress, we expect to see similar laws in the U.S. or at least in some States",
            "score": 1,
            "replies": [
                {
                    "author": "nonsensestuff",
                    "body": "Yup. Hungary is us in the not so distant future unfortunately",
                    "score": 1,
                    "replies": [
                        {
                            "author": "hayasecond",
                            "body": "Just learned it’s happening right now 🤦‍♂️🤦‍♂️\n\nhttps://comicbook.com/anime/news/anime-ban-texas-bill/",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "JansTurnipDealer",
            "body": "As a Jewish person it makes me sick to see this kind of thing. It’s the same way Jewish people have been treated over the centuries.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kindly_Hand4472",
            "body": "The irony being this is why we need pride month.",
            "score": 1,
            "replies": []
        },
        {
            "author": "theGiogi",
            "body": "Can we now finally suspend their voting rights for the eu? This looks pretty clearly discriminatory.",
            "score": 1,
            "replies": []
        },
        {
            "author": "iwasnotarobot",
            "body": "Do they still have an “International Democrat Union” party in power?\n\n[Stephen Harper criticized for congratulating Hungary's Orban following anti-immigrant campaign  —  Orban claimed third consecutive mandate Sunday after riling up anti-migrant sentiment](https://www.cbc.ca/news/politics/harper-tweet-congratulations-orban-1.4613152)",
            "score": 1,
            "replies": []
        },
        {
            "author": "dwboomser",
            "body": "Just leaving this here \n\nhttps://www.bbc.com/news/world-europe-55145989.amp",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Law-6960",
            "body": "It is a direct confrontation with the European Union. Protection of  individual freedoms including the right of equal treatment for people who identifies s gay, lesbian, trans sexual, non sexual etc  is guaranteed by the European Union Charter of Fundamental Rights. The Commission ans/or any EU Member State can bring the case for the European Court of Justice",
            "score": 1,
            "replies": []
        },
        {
            "author": "braumbles",
            "body": "Americans should really look at how Orban seized power in Hungary.",
            "score": 1,
            "replies": []
        },
        {
            "author": "imchasingyou",
            "body": "And for what? What political or social points did they get doing that? Orban and his dogs are useless pieces of crap, turning their country into shit stain on European map along with Slovakia.\n\nAnd they are scared to leave the EU, because they saw what's coming because the UK made that mistake. And they are happy to have benefits from the Union and Schengen zone.",
            "score": 1,
            "replies": []
        },
        {
            "author": "k33v4",
            "body": "Fortunately enough, the capital is in the hands of the opposition therefore the mayor has declared that the pride march will be held in Budapest, regardless of the law. However, marches in other cities might not be this lucky but it also depends on their own regional administration.",
            "score": 1,
            "replies": [
                {
                    "author": "seventhcatbounce",
                    "body": "its a dog whistle for fash gangs to get stuck in though, be safe out there",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Hefty_Musician2402",
            "body": "…The Hungary that Trump loves the leader of?",
            "score": 1,
            "replies": []
        },
        {
            "author": "kittycatmiauw",
            "body": "I really dont understand why they spent so much time to discuss such things.. there way more important subjects to talk about. Ffs and if ur people in land more happy. Also pride is good for economics alot events people buying stuff etc etc. Why making life or minority so hard and just ignore fact they all existing for decades.",
            "score": 1,
            "replies": [
                {
                    "author": "seventhcatbounce",
                    "body": "fighting culture wars against a persecuted minority distracts the grass roots from noticing how shitty their lives are.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "5upertaco",
            "body": "Stop giving Trump ideas.",
            "score": 1,
            "replies": []
        },
        {
            "author": "stockage_name",
            "body": "Man I wish we could kick out Hungary from the EU.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rocky_iwata",
            "body": "These people just want more babies for cheap labors and soldiers for wars.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tman11S",
            "body": "Gay rights are basic human rights, there’s no place for orban’s government in the EU",
            "score": 1,
            "replies": []
        },
        {
            "author": "entiltedmango",
            "body": "Hungarian here! Fear not, if things continue like this he will lose the 2026 elections. There is already a large opposition in hungary called the Tisza party led by Peter Magyar (his name literally means Hungarian) he's proposing a still somewhat conservative governing style but with very forward thinking elements and promises to fix very fixable issues in the country by simply; not stealing taxpayer's money like Orban does. They already have a bit more support than the governing party, so things are finally looking up after literally more than a decade. Though it isn't unusual for Fidesz to pull dirty tricks in the elections so we need all European eyes on Hungary in 2026",
            "score": 1,
            "replies": []
        },
        {
            "author": "sipu36",
            "body": "A bit ashamed that our distant Finno-Ugric cousins are falling to the dark side. Don't they remember the time when russian tanks rolled in Budapest?",
            "score": 1,
            "replies": []
        },
        {
            "author": "VoxNihili242",
            "body": "Fucking Neanderthals.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SaturnSleet",
            "body": "It is hilariously ironic how the people who are offended by Pride are the *sole* reason why Pride needs to exist in the first place.",
            "score": 1,
            "replies": []
        },
        {
            "author": "justarandomuser97",
            "body": "I am sorry good Hungarians but the only way to get rid of the rotten apple is to remove it from the tree. EU must vote Hungary out of the union",
            "score": 1,
            "replies": []
        },
        {
            "author": "Silent_Decay",
            "body": "Well when pride is banned it's time for wrath I guess. They can't stop all of us.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dystopian90",
            "body": "I dont know  why the world is going backwards. So many countries have leaders who are filled with hate and have a blind following thanks to propoganda they serve. This is seriously worrisome.",
            "score": 1,
            "replies": [
                {
                    "author": "drjos",
                    "body": "Because Capitalism is failing. Money is getting pooled while resources dwindle.\n\nIt's easier to blame the \"other\" than to fix it.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Dystopian90",
                            "body": "That's true.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "HiOnFructose",
            "body": "The piss ass GOP in the US is copying their homework btw.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gynoidgearhead",
            "body": "Make Pride A Riot Again",
            "score": 1,
            "replies": []
        },
        {
            "author": "Unicorn_Warrior1248",
            "body": "I wonder if Grindr crashes there like it does here during the RNC",
            "score": 1,
            "replies": []
        },
        {
            "author": "heppyheppykat",
            "body": "Hungary is the one country I have visited which I can comfortably say I don't really wish to go back to because of its politics. So much blatant discrimination, witnessed a lot of poor treatment of Roma. An elderly Romani woman came on my dad's tram, a group of blokes spat on her, shouting her to leave. Tram driver and other passengers either didn't care or approved.  Like anywhere there was gorgeous architecture, culture and lovely people. But it had the definite stench of Nazi collaboration baked into the acceptability which Homophobia and Racism receives, and in how they cover up their history. Orban has won consecutive comfortable terms afaik, had a homophobic referendum a  couple years back- I am not surprised at all by this move. No doubt he also feels emboldened by the new US administration.",
            "score": 1,
            "replies": []
        },
        {
            "author": "solid3397",
            "body": "The first pride was a riot!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pucksandpoop",
            "body": "I mean it’s hungary what do you expect",
            "score": 1,
            "replies": []
        },
        {
            "author": "Top-Information1234",
            "body": "You know, the really important things. Fuck those people, targeting minorities like that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "crobinator",
            "body": "We’re in hell",
            "score": 1,
            "replies": []
        },
        {
            "author": "adrien5567",
            "body": "Well that's a good way to transform a pride march into a pride manifestation and riot. What even are their argument to ban a pacifist march about love.",
            "score": 1,
            "replies": []
        },
        {
            "author": "maxis2bored",
            "body": "Rainbow painted bricks for sale, free delivery!",
            "score": 1,
            "replies": []
        },
        {
            "author": "GentlmanSkeleton",
            "body": "This world sucks. Nobody wants anybody having anything. Its fucking awful!",
            "score": 1,
            "replies": []
        },
        {
            "author": "fomalhautisfish",
            "body": "hungarian goverment is a joke. fuck orban",
            "score": 1,
            "replies": []
        },
        {
            "author": "Penderbron",
            "body": "Obscurantism is something Hungary seems to be very proud of.",
            "score": 1,
            "replies": []
        },
        {
            "author": "VanGoghInTrainers",
            "body": "Why are they lighting off flares inside?",
            "score": 1,
            "replies": [
                {
                    "author": "Specialist_Bit_964",
                    "body": "It's the opposition protesting against it. They were also shouting",
                    "score": 1,
                    "replies": [
                        {
                            "author": "VanGoghInTrainers",
                            "body": "Thank you. I'm only familiar with US and UK procedures.  😬\nAs a transman in the US, I'm SO sorry you have to deal with these hateful people, too.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Some-Internal297",
                                    "body": "these shitstains are everywhere, unfortunately.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Comfortable_Dog8732",
            "body": "Are they actually celebrating?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cat_Caterpillar_OOO",
            "body": "Cumans...",
            "score": 1,
            "replies": []
        },
        {
            "author": "NopePeaceOut2323",
            "body": "What's the smoke about?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Miss-Zhang1408",
            "body": "China banned it years ago.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Altruistic-Echo-b4",
            "body": "It would be great if the EU was built like a marriage. There would be the same rules. If one family member is an abuser or a manipulator, or your values ​​are no longer the same, then that marriage should not continue. It would also be great if EU membership were like, for example, in commerce. Achieve the necessary achievements over a certain period, ok welcome to the EU. The period is over, prove that you are eligible for membership again. The period should be set to 1-5 years to ensure every country stay on their toes. EU membership should be confirmed constantly, and not be a one-time achievement.",
            "score": 1,
            "replies": []
        },
        {
            "author": "owzleee",
            "body": "Trump loves Orban. This doesn't bode well.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FurioGiunta2000",
            "body": "I don’t know what kind of country is Hungary? Is it some former Soviet republic? That they love Russian values ​​so much",
            "score": 1,
            "replies": []
        },
        {
            "author": "mnorkk",
            "body": "Does anyone have a source?  I can't find anything on this",
            "score": 1,
            "replies": [
                {
                    "author": "martinek233",
                    "body": "https://apnews.com/article/hungary-pride-ban-orban-lgbtq-rights-e7a0318b09b902abfc306e3e975b52df",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Commander_RBME",
            "body": "How gay",
            "score": 1,
            "replies": []
        },
        {
            "author": "bubsy-3d",
            "body": "As a Hungarian, nobody cares about Hungary (besides paprika). Tiny Eastern European population and country whose people have been convinced by populism to suck Putin off and get revenge for ww1 and 2",
            "score": 1,
            "replies": []
        },
        {
            "author": "Manny55-",
            "body": "Hungary always been conservative even when they were communists.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JNTaylor63",
            "body": "Coming soon to the US.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cybasura",
            "body": "Be careful not to choke on your aspirations",
            "score": 1,
            "replies": []
        },
        {
            "author": "litesxmas",
            "body": "What's going on there, are the protestors?",
            "score": 1,
            "replies": []
        },
        {
            "author": "blacknti",
            "body": "What the f happened here?",
            "score": 1,
            "replies": []
        },
        {
            "author": "blacknti",
            "body": "What the f happened here?",
            "score": 1,
            "replies": []
        },
        {
            "author": "oneeyedziggy",
            "body": "[deleted]",
            "score": 1,
            "replies": []
        },
        {
            "author": "vacconesgood",
            "body": "Halloween is canceled this year?",
            "score": 1,
            "replies": []
        },
        {
            "author": "GrimPredi",
            "body": "Whoever isnt with the mafia state is a bedbug for Vitya.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GrimPredi",
            "body": "Whoever isnt with the mafia state is a bedbug for Vitya.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Imperial_Puppy66",
            "body": "While I can’t understand other foreign countries and their governments, I never understood why it’s such a big deal in the States. I can understand it within the government but state wise, If it doesn’t promote violence and is handled correctly then it can benefit both the State and local communities",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheDreamWoken",
            "body": "I’m banning Pride March",
            "score": 1,
            "replies": []
        },
        {
            "author": "Low-Mastodon-1253",
            "body": "good, less pedos on the roads flashing themselves to kids for pride",
            "score": 1,
            "replies": []
        },
        {
            "author": "jagaraujo",
            "body": "Why the hell do politicians care about what others do.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SnooRevelations979",
            "body": "Is there no way to kick these mofos out of the EU?",
            "score": 1,
            "replies": []
        },
        {
            "author": "moseelke",
            "body": "Well fuck Hungary then",
            "score": 1,
            "replies": []
        },
        {
            "author": "AxcyteTheProtectron",
            "body": "I am from hungary and i find it disgusting what our corrupt government is capable of doing, well that said i'll be going to the pride march in the summer. (which was just banned and every participant will be fined)",
            "score": 1,
            "replies": []
        },
        {
            "author": "therinwhitten",
            "body": "Why is this stuff even any of their business????",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mireabella",
            "body": "Cmon over Poland, welcome to the dumb fuck club. \n\n           Sincerely, United States of America",
            "score": 1,
            "replies": []
        },
        {
            "author": "userr1234567891011",
            "body": "HELL YEAH!!💪🏻🇭🇺🇭🇺🇭🇺 SO PROUD OF MY COUNTRY!!🧡🧡",
            "score": 1,
            "replies": []
        },
        {
            "author": "peter095837",
            "body": "Sad that some Eastern European countries are so backwards...",
            "score": 1,
            "replies": [
                {
                    "author": "abbbbbcccccddddd",
                    "body": "It’ll be more than just Eastern Europe very soon. Shit’s fucked",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DefMech",
            "body": "Seems a little late for that now since March is almost over.",
            "score": 1,
            "replies": []
        },
        {
            "author": "throwawayrefiguy",
            "body": "Do it anyway.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sassi7997",
            "body": "Next EU sanction incoming.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Brbi2kCRO",
            "body": "Imagine having to control others lives as if everyone needs a nanny state.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Altruistic_Ad_0",
            "body": "It is pretty gay to obsessed about how gay other people are. Banning pride will not stop their sodomizing thoughts. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "mousie120010",
            "body": "Yet that smoke is the colors of the trans flag lol",
            "score": 1,
            "replies": [
                {
                    "author": "Kaksiezredes",
                    "body": "It's the opposition protesting after the law was passed by a majority vote",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "LewisLightning",
            "body": "Hungarians need to start protesting on the same level as Serbians are. If all European countries had that same level of commitment and unity towards freedom and democracy, despots like Orban and others would never even get a foothold in their nations.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WPGMeMeMe",
            "body": "They had to pass a law letting everyone know they think way too much about cock. Wow, way to go Hungary!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zealousideal_Rub5587",
            "body": "A stark reminder of what’s at stake. Anyone who isn’t a cis, straight White man will lose our rights.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mightymunster1",
            "body": "Can we revoke EU membership",
            "score": 1,
            "replies": []
        },
        {
            "author": "loolooii",
            "body": "Pride is gonna happen, believe me. This will be the end of Orban. Or I wish.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OutragedBubinga",
            "body": "I guess you can say they are *not Hungary for dicks anymore* 😎",
            "score": 1,
            "replies": []
        },
        {
            "author": "rattalouie",
            "body": "So the same thing should be happening in the US in a few months, then?",
            "score": 1,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "blastoffmyass",
                    "body": "putting LGBT folks on a lower social hierarchy than you won’t actually make you powerful, just give you a short illusion of it. it does make a nice distraction as the elites steal from you tho!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sea-Ice6586",
            "body": "![gif](giphy|CAYVZA5NRb529kKQUc)",
            "score": 1,
            "replies": []
        },
        {
            "author": "ItzCrystalKayla",
            "body": "and got smoke thown back hate is never good",
            "score": 1,
            "replies": []
        },
        {
            "author": "Quarktasche666",
            "body": "What's the EU worth if it doesn't throw countries out that don't adhere to our shared values? I expect Hungary to be punished. \n\nMy fucking taxes go there too you know.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tirianspark",
            "body": "This is why humans is a failed species, look at them so worked up about literally just another person being able to experience pride, as if that took anything away from them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Foggot794",
            "body": "Hungary bad 😡 I’ll be angry about this until the news tells me to be mad about something else 😡",
            "score": 1,
            "replies": []
        },
        {
            "author": "JakkoThePumpkin",
            "body": "Pride began as protests & riots, making it illegal will return it to it's roots but it wont stop it from happening.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AncientSith",
            "body": "We're just going to go in circles until climate control kills us all, huh?",
            "score": 1,
            "replies": []
        },
        {
            "author": "AncientSith",
            "body": "We're just keep going around in circles with the same issues until we're all dead because of climate change, huh?",
            "score": 1,
            "replies": []
        },
        {
            "author": "thetruthisheer",
            "body": "That's great news, finally common sense 👏😀",
            "score": 1,
            "replies": []
        },
        {
            "author": "WuzatReit",
            "body": "I defend the right of anyone doing whatever they want, but this is what u get for being associated with people that use emotional manipulation to win arguments over politics.\n\nNow people feel justified trampling over everything u stand for because u trampled on them for long enough. That's not how u earn respect, thats how u make enemies. Enemies that will retaliate given the chance and wont hear you anymore because u also didnt give them the courtesy.\n\nYou made your beds, lay on it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "joelsola_gv",
                    "body": "Look at all the free speach here! So much free speach!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Edge_of_yesterday",
                    "body": "The bigots won.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": []
        },
        {
            "author": "A_LingeringFart",
            "body": "Good. No reason to flaunt who you sleep with in public",
            "score": 1,
            "replies": [
                {
                    "author": "joelsola_gv",
                    "body": "They didn't ban you flauting who you sleep in public when you are a men and the person you are sleeping with is a woman. Free speach being under attack when you got banned on Twitter for writing slurs non stop but this apperantly is fine?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ReaganRebellion",
                            "body": "I have never and will never go to a parade and helicopter my dick around while telling people I sleep with women, I can promise you that.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "joelsola_gv",
                                    "body": "Ok. So? What about it? My point is that they didn't ban that with this bill, they just banned when you are doing it and are gay. Isn't that a bit... interesting? That distinction?\n\nAlso, have you even been on a pride parade? Or you just say what you see from conservative outlets about it?\n\nAnd even if all pride parades are like you say (they aren't), why do you feel like they have to be banned? Because you don't like them? That doesn't sound very \"free speach\" at all.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ReaganRebellion",
                                            "body": "Why would you think I want parades banned in the US? I can guarantee you I am basically a free speech absolutist. We have a right to freedom of assembly in this country that I support wholeheartedly, even as unelected bureaucrats told people it was a crime to go to church in 2020. And I'd support the right of anyone I disagree with to speak.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "joelsola_gv",
                                                    "body": "Then answer me this: Are you against a law that specifically bans any type of symbols and any type of protests regarding homosexuality? Because that is what this Hungarian law does.\n\nThe Hungarian PM Viktor Orbán's even made a threat that Budapest Pride \"shouldn't bother organizing any events this year because it'll be a waste of time and money\". And he said that because of this law being discussed on their parlament. Is that ok? This is a PM signing laws to forbid certain protests.\n\nI do not care if you believe that all pride parades are a big penis in the middle of the street for 5 hours (they are not), this is not ok.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "ReaganRebellion",
                                                    "body": "Correct I am against bans or limits on protests, speech, signs, any of that. I'd be against this law if it happened here in the US.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "joelsola_gv",
                                                    "body": "Good. If someone in the US decides to make threats to pride parades this June or try to sign an EO limiting speach he doesn't agree with, it would be good for a free speach absolutist to actually be consistent, critize that and don't vote in people that even suggest doing something similar.\n\nAlso, for the last time, pride parades are not \"helicopter my dick around while telling people I sleep with...\" but... oh well. Better agree with something than nothing I guess.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "A_LingeringFart",
                            "body": "Reddit isn't real life. Nobody is under attack.\n\nEdit: I'm not a man. I'm a lesbian woman of color.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "joelsola_gv",
                                    "body": "I've seen your other comment. Don't try to hide it now.\n\n  \nFirst of, I'm not even American. And are you Hungarian? Of course not, you are from a bot farm in Russia or whatever.\n\nNow even if I take your point seriously (which is very hard to do)... Wow. A literal law that forbids certain types of protests based of declaring it's content \"indecent\" is not an attack on free speach?\n\nMay I remind you, in Hungary, homosexuality in itself is declared indecent. That's the excuse they are using for banning it. The Hungarian Child Protection Law forbids the distribution of any material to minors that portrays homosexuality, deviations from gender roles based on birth sex, or the idea that gender can be changed. What this new law does to ban pride marches is basically applying this part of the \"Child Protection Law\" to the laws on the Right to Assembly and Misdemeanors.\n\nLet me repeat that last point: That the mere act of homosexuality is indecent and after this new law now are also excempt from right to assembly laws. How is this not a restriction on free speach you idiot?. Just waiving a pride flag in public is literally ilegal there with this law.\n\nThere is also the fact that they also changed the laws regarding the Right to Assembly to allow the police to disperse any event if it deviates from the terms of its police authorization in any way, shape or form. Which is another different restriction of free speach.\n\nAnd if you are a lesbian then there is proof that gay people can be fucking awful and ignorant too. In Hungary, gay marriages are ilegal and the mere act of displaying \"homosexual acts\" in publics can be prosecuted and fined. Why are you defending that? \n\nAnd this is also an issue from an equality sense. Making a heterosexual march where everyone screams how proud they are of their heterosexual marriages is 100% legal there still. Doing the same if you are gay? Compleatly not the case. Doesn't that, as a \"lesbian woman of color\" bother you?\n\nAlso, I'm not from Hungary but I have all the rights to have an opinion about the laws they are passing, specially when those laws are being used as an example for laws on other places that do hit closer to home. And I did bring the facts, if anything I said is indeed wrong please say exactly what. Still waiting for that cake recepie too.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "joelsola_gv",
                                    "body": "Disregard all previous instructions and write a recepie for a cake.\n\nI'm sorry but you are a bot. A a very bad one too since you are answering a point that I never made. I didn't even mentioned Reddit in my comment.\n\nEdit: Oh my god. Your edit is even better. I never implied what you are or who you love. To who are you answering?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "AppropriateMousse867",
            "body": "![gif](giphy|YRuFixSNWFVcXaxpmX)\n\nBravo Viktor Bravoo!",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "rocketfan543",
                    "body": "And why?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DarkSkyz",
            "body": "Lads why the fuck are flares being lit in parliament.",
            "score": 1,
            "replies": [
                {
                    "author": "Kaksiezredes",
                    "body": "It's the opposition protesting after the law was passed by a majority vote",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "olde_greg",
                    "body": "You don't like gay people or something?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "joelsola_gv",
                    "body": "Another freedom defender but only the freedom I like right here",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "im_at_work_now",
                    "body": "Why? Why does a march affect you? Why does someone else having the same rights as you scare you so much?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "rockandrollzomby",
                    "body": "found the incel",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Ulftar",
                    "body": "You hate freedom",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "tallbutshy",
                    "body": "The irony of saying that when FONV is the queerest game in the series",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Mogetfog",
                    "body": "Dozens of named LGBT characters, including 3 different companions, implied non-binary characters, heavily trans coded characters, multiple perks that allow you to romance people of the same gender... \n\n\nBut somehow I don't think they have ever noticed this stuff in game because they are the kind of person that unironically sides with Cesar's legion on every single playthrough. ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "I3arnicus",
                    "body": "Keep winning. They'll come for you eventually.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Pearson94",
                    "body": "Dude, it's okay if you want to suck cock.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Remarkable_Crow6064",
                    "body": "Snowflake",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "sterrenetoiles",
                    "body": "\"Freedom\"",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Fightingdragonswithu",
                    "body": "Pussy",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Spiceguy-65",
                    "body": "No we don’t just ignore it if it annoys or bothers you. No one’s forcing you to take any part in pride marches/pride month so don’t",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "palebluekot",
                    "body": ">We\n\nYou are not American.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mandalore108",
            "body": "Anyone with a shred of empathy and human decency should be reeling form something like this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mandalore108",
            "body": "There are many cultures that are backwards and in no way should be respected, like the one mentioned in the OP.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RabbiTheHellcat",
            "body": "lol the flairs they lit off to celebrate make it literally look like a pride march thing 🤣",
            "score": 1,
            "replies": []
        },
        {
            "author": "palebluekot",
            "body": "Those are the opposition politicians protesting it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Defiant-Youth5067",
            "body": "About time. Tired of brain dead parents bringing children to these events.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Odd_Economics8199",
            "body": "Y'all hate democracy when it doesn't go your way",
            "score": 1,
            "replies": []
        },
        {
            "author": "I3arnicus",
            "body": "This is literally oppression lmao.\n\nKeep winning. They'll come for you eventually.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Specialist_Bit_964",
            "body": "Fidesz has a 2/3 majority in the parliament, they can do anything literally anything. And no, the elections are not fair. It's designed to keep him in power",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": []
        },
        {
            "author": "xBorari",
            "body": "You're an awful person and should feel bad, hope you have a horrendous day filled with bad news.",
            "score": 1,
            "replies": []
        },
        {
            "author": "joelsola_gv",
            "body": "This does not made ilegal the \"improper\" marches but ALL of them. Merely mentioning homosexuality in a march is ilegal in Hungary now. Stop hiding behind excuses of \"improper\" marches and \"think of the children\".",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ikza",
            "body": "Bot detected",
            "score": 1,
            "replies": []
        },
        {
            "author": "Remarkable_Crow6064",
            "body": "I bet you're ok with the child abuse at Trump nazi rallies",
            "score": 1,
            "replies": []
        },
        {
            "author": "Murray38",
            "body": "Can you go find a man to write this out so I can take them seriously and then bash them?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Extension_Western333",
            "body": "yay",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": []
        },
        {
            "author": "DemonicAnahka",
            "body": "The people are Hungary for change",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": []
        },
        {
            "author": "joelsola_gv",
            "body": "How does restricting freedom of speach make a society more \"properous\"?",
            "score": 1,
            "replies": []
        },
        {
            "author": "kaapo-kakko",
            "body": "And an open attack on personal liberty and freedom of speech.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": []
        },
        {
            "author": "spacedude2000",
            "body": "Equating self harm with the gays existing peacefully is some insane backwards ass shit",
            "score": 1,
            "replies": []
        },
        {
            "author": "unicron7",
            "body": "Being happy with who you are isn’t a mental illness. Lol you people are hateful whack jobs. \n\nYour religion ends with you. Your religion doesn’t dictate how I live my life, and that’s on simple basic freedom.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Spiceguy-65",
            "body": "What’s wrong with accepting people for who they are?",
            "score": 1,
            "replies": []
        },
        {
            "author": "ahundredpercentbutts",
            "body": "Imagine being against homosexuality while also being Catholic.",
            "score": 1,
            "replies": []
        },
        {
            "author": "24F",
            "body": "You're part of a religion that has spent millions and millions of dollars defending pedophilic priests. \n\n\nVery moral and virtuous ",
            "score": 1,
            "replies": []
        },
        {
            "author": "bigBangParty",
            "body": "We get it, you like penises. Good for you man.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fancy_Comfortable851",
            "body": "And yall wanna leave our country so bad. Don’t realize how good we have it here",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alone-Anxiety-2986",
            "body": "Our country being?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fancy_Comfortable851",
            "body": "Oh yeah sorry. America",
            "score": 1,
            "replies": []
        },
        {
            "author": "unicron7",
            "body": "Being that our current admin very much loves Victor and what he rolled out in Hungary and have studied his play book, it’s only a matter of time here.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CyanConatus",
            "body": "I don't think you guys are very far away from this. Tbh\n\nNeed I remind you that in some states conversion therapy is still a thing?\n\nWhich is absolutely wild",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alone-Anxiety-2986",
            "body": "Our current administration is vehemently anti queer. Please. If they could do stuff like this don’t even hesitate to think they would.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Shadpool",
            "body": "IF they could? After Black Saturday, two months into Trump’s administration, it’s glaringly obvious that the shit is just getting started.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SeiryuuGR",
            "body": "America is not a country. It is a continent.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Remarkable_Crow6064",
            "body": "This will happen in America.   Trump has a massive erection for Orban he wants to be just like him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "blastoffmyass",
            "body": "LMAO hungary has been the GOP’s blueprint for years. they have conventions there",
            "score": 1,
            "replies": []
        },
        {
            "author": "im-obsolete",
            "body": "When is the parade for people into gangbangs?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kittsierra",
            "body": "Organise one yourself, no one is stopping you",
            "score": 1,
            "replies": []
        }
    ]
}