{
    "title": "Is Jelly Roll just 2020s Kid Rock?",
    "author": "ShoedJoeJackson",
    "subreddit": "Music",
    "rank": 15,
    "score": 2150,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 522,
    "url": "https://www.reddit.com/r/Music/comments/1jdjnb0/is_jelly_roll_just_2020s_kid_rock/",
    "id": "1jdjnb0",
    "selftext": "Granted Kid Rock grew up in a mansion, and jelly roll seemed to have actually struggle. But does anyone remember Jelly Roll trying to be a trail park rapper a la Yelawolf? Now he’s being touted as a country star and is getting gigs for commercials. So someone who started out trying to be a “country rapper” that failed and grifted to country",
    "comments": [
        {
            "author": "jacmrose",
            "body": "Jelly Roll was a good story at first but every fucking song is about struggling with addiction and it’s exhausting",
            "score": 2715,
            "replies": [
                {
                    "author": "alek_hiddel",
                    "body": "You forgot about finding hope through faith.  That is a key part of his formula.",
                    "score": 1487,
                    "replies": [
                        {
                            "author": "MOLightningBro",
                            "body": "So he’s the 2025 version of Eric Cartman in Faith + 1?",
                            "score": 700,
                            "replies": [
                                {
                                    "author": "THIS_ACC_IS_FOR_FUN",
                                    "body": "![gif](giphy|l41lKiR8jFdqiMsms)",
                                    "score": 288,
                                    "replies": [
                                        {
                                            "author": "Nobodygrotesque",
                                            "body": "https://i.redd.it/mzx0gp43kcpe1.gif",
                                            "score": 133,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "baummer",
                            "body": "It's like an HGTV show",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "cheezeyballz",
                            "body": "Gross.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ShaunLucPicard",
                            "body": "Wow. Now I hate him even more.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "LaflairWorlddd",
                            "body": "What’s wrong with that?",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "elebrin",
                                    "body": "Christian music doesn’t make Christianity better, it makes music worse.",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "DLottchula",
                                            "body": "Gospel music is good Christian-“music” is buns and I swear people try and guilt you into enjoying it.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -158,
                            "replies": []
                        },
                        {
                            "author": "bullcitytarheel",
                            "body": "Was that man’s name Jesus by chance",
                            "score": 167,
                            "replies": []
                        },
                        {
                            "author": "getdemsnacks",
                            "body": "I think it was Albert Einstein, actually.",
                            "score": 30,
                            "replies": []
                        },
                        {
                            "author": "BlackJack407",
                            "body": "Jesus Christ actually, but no relation",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "micalakap",
                            "body": "#hegetsusinjailtho",
                            "score": 21,
                            "replies": []
                        },
                        {
                            "author": "FixedLoad",
                            "body": "And it was only a plan for an idea of hope.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "IShookMeAllNightLong",
                            "body": "Concepts of a plan.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "gunluver",
                            "body": "Nah,it was Hayzuse",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "BradyBunch12",
                            "body": "AA also forces faith",
                            "score": 64,
                            "replies": []
                        },
                        {
                            "author": "Reasonable_Cod_487",
                            "body": "GA does too, but I haven't gambled in almost 3 years now. \n\nI'll take a group leader talking about their faith once a week if it means not being stuck in that hellish addiction. You gotta have some people to talk to that understand what it's like, otherwise it just feels like constant judgement.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "matt_minderbinder",
                            "body": "Glad it works for some people but it's a hurdle that understandably keeps others from wanting anything to do with it.  It's also often required by a court system that's supposed to be secular absolutely stomping church/state limitations and constitutional rights.",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "jsalfi1",
                            "body": "Depending on the group it can actually work really well for people who aren’t religious. The founders were Christian but the current AA groups have their own standards and culture that varies. Some are more traditional than others, depends on the members. NA and most of the others are usually less religious than AA",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "arrre_yooouu_meeeeee",
                            "body": "Talking about AA isn’t the same as talking about faith though",
                            "score": -1,
                            "replies": []
                        },
                        {
                            "author": "GoochManeuver",
                            "body": "When I hear Jelly Roll, all I can think is that every dude ever named Ronnie (or Ronnie, Jr.) must be fuckin’ loving this.",
                            "score": 24,
                            "replies": []
                        },
                        {
                            "author": "optimis344",
                            "body": "It fundamentally is. If you say AA helped you, you are saying the Christian faith helped you. \n\nAA is the same as a physical church. It's just the box that holds the religion inside.",
                            "score": -1,
                            "replies": []
                        },
                        {
                            "author": "BWChristopher5",
                            "body": "Um...no",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "optimis344",
                            "body": "Sorry bud. Hate to break the news to you, but that it how it works.",
                            "score": -6,
                            "replies": []
                        },
                        {
                            "author": "fatherOblivion69",
                            "body": "You're wrong.  AA encourages you to find a \"Higher Power\".  Your \"Higher Power\" can be just about anything other than yourself.  A lot of people in AA choose their HP to be God.  There are also a lot of atheists in AA, and they choose their HP to be the group they're in.  AA doesn't force you to believe in God or admit to his existence.  They just encourage you to chuck your ego at the door.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "BWChristopher5",
                            "body": "I must have had very different experiences than you.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "fatherOblivion69",
                            "body": "They're talking out their ass.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "logicWarez",
                            "body": "This is not true at all. As someone who very much hates that courts push people into AA/NA and finds AA's use of faith troublesome. There is no requirement for Christianity in AA, just faith in a higher power.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "optimis344",
                            "body": "Yeah, just like the Mason's don't have a technical requirement for it. But that's what it is. \n\nThey use faith, and fill it entirely with Christian ideas and ideals, and make it into \"legally district not Christianity because then we would lose funding if it wasn't technically secular\".",
                            "score": -1,
                            "replies": []
                        },
                        {
                            "author": "arrre_yooouu_meeeeee",
                            "body": "> If you say AA helped you, you are saying the Christian faith helped you.\n\nThis is factually incorrect.\n\n> AA is the same as a physical church. It’s just the box that holds the religion inside.\n\nNo, it isn’t. You don’t have to accept any religion in AA. \n\nTelling a story about a guy you talked to in AA isn’t talking about faith. Just like telling a story about talking to a guy in a hospital isn’t talking about your medical history",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "PewterPplEater",
                            "body": "Faith doesn't equate religion or a belief in god. It's faith in a higher power of your understanding.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "tree_squid",
                            "body": "That's both struggling with addiction AND faith. AA is a Christian organization that likes to lie about it",
                            "score": 16,
                            "replies": []
                        },
                        {
                            "author": "CDawgbmmrgr2",
                            "body": "Wild example soldier.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "internetlad",
                    "body": "It's the funniest shit. I know a guy who loves \"save me\" and I asked him if he likes \"somebody save me\" from Eminem because he featured it and he goes \"man Eminem is just acting like he's hurt because he got too high to appreciate his kids. We all got problems\"\n\n\n\n\nFuckin lol ok",
                    "score": 410,
                    "replies": [
                        {
                            "author": "Jlx_27",
                            "body": "Em literally toured less to be a father....",
                            "score": 201,
                            "replies": [
                                {
                                    "author": "OctoDoctoe",
                                    "body": "He skipped the Grammys to watch cartoons with his daughter and fell asleep before checking to see that he in fact won one ",
                                    "score": 167,
                                    "replies": [
                                        {
                                            "author": "Jlx_27",
                                            "body": "That too. Like him or hate him, he did the right things to raise his kids.",
                                            "score": 74,
                                            "replies": [
                                                {
                                                    "author": "OKidAComputer",
                                                    "body": "Lol he literally wrote a song about murdering his wife with the child next to him.",
                                                    "score": -18,
                                                    "replies": [
                                                        {
                                                            "author": "Lifecoachingis50",
                                                            "body": "Quite literal seperate the art from the artist. Would you rather he wrote a song about how kind he is to wife and kids and then was an asshole to both in real life?",
                                                            "score": 30,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Jlx_27",
                                                            "body": "Thoughts put into song, thats all that is.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "steveo1978",
                                            "body": "Wasn’t that the Oscars? I think Em wouldn’t attend the Grammys if they paid him to show up.",
                                            "score": 37,
                                            "replies": [
                                                {
                                                    "author": "Jewrisprudent",
                                                    "body": "So he can sit next to Carson Daly and Fred Durst?",
                                                    "score": 80,
                                                    "replies": [
                                                        {
                                                            "author": "Grimvold",
                                                            "body": "I heard there might a story between those two about being the first to a prize.",
                                                            "score": 12,
                                                            "replies": [
                                                                {
                                                                    "author": "DiligentProfession25",
                                                                    "body": "From a lil bitch who put him on blast on MTV 👀",
                                                                    "score": 6,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Traditional-Music485",
                                                            "body": "And hear them argue about who she gave head to first",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "ratjar32333",
                                                    "body": "Yea he fucking hates the Grammys. There's an interview where he calls it out and says it's all scripted bullshit.",
                                                    "score": 11,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "OctoDoctoe",
                                                    "body": "It was an important award show ",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "KinoHiroshino",
                                                            "body": "Important? [Even in the 90s the Grammys were considered a joke.](https://youtu.be/Tf9V0hwJ6qk?si=FohLEDStbI1DoAji)",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "r31ya",
                                    "body": "50 cent noted Em turned down like 8 millions of dollar offer for some world cup performance and prefer to stay at home.\n\nsame thing with touring, Em tour less just so he could be at home more.\n\nalso many musician noted that em treat this music gig like 9 to 5 job to give more family stability.\n\n50 cent also noted that he doesn't quite understand the decision, until he saw haelie wedding (and his own strained relation with his kid)",
                                    "score": 37,
                                    "replies": [
                                        {
                                            "author": "MechanicalTurkish",
                                            "body": "Good for him. He’s got more money than he’ll ever need anyway.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "azlan121",
                                    "body": "he's also known to be fierce about music being a 9-5, when he's working as a producer, or generally doing stuff in a studio, he will only do office hours and then leave and go and be a human outside his job.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "AmputeeBall",
                                            "body": "I don’t know much about Eminem, but this makes me like him more. As much as practical everyone should be able to do this, obviously not everyone can, e.g. doctors and nurses.",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "Jlx_27",
                                            "body": "The Bill Murray of music.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "AnarkittenSurprise",
                            "body": "Some people just love to roll around in ignorance and let their imagination inform their opinions.\n\nEminem is a bit too goofy for me sometimes, but he's famously a great dad.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "pslickhead",
                    "body": "But his fans live, eat, drink, and breath that trope. Some are in my immediate family. They are equally exhausting with that stuff.",
                    "score": 284,
                    "replies": [
                        {
                            "author": "getdemsnacks",
                            "body": "I call it 12 step energy. My wife has a co-worker in the program and she says he is exhausting to have a conversation with.",
                            "score": 147,
                            "replies": [
                                {
                                    "author": "I_amnotanonion",
                                    "body": "I have a buddy that’s been sober 25 years and still actively participates in AA as a sponsor. He doesn’t have that energy, but said it’s super common with people who aren’t that long removed from their vice because that voice/urge hasn’t faded much.\n\nI’m sure there are also people who have that energy forever",
                                    "score": 127,
                                    "replies": [
                                        {
                                            "author": "Shredpuppy",
                                            "body": "My sponsor puts it this way…I go to AA so I can live, I don’t live to go to AA.  But for some people especially in the first couple of years it needs to be both.",
                                            "score": 56,
                                            "replies": [
                                                {
                                                    "author": "Stillwater215",
                                                    "body": "For some people it’s initially about replacing one addiction with a less destructive one. It’s better to be addicted to AA than to alcohol.",
                                                    "score": 22,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "WeedFinderGeneral",
                                            "body": "It's the next addiction they move onto. It's like that Vice doc about a bunch of meth heads doing placebos to tap into that same frame of mind and saying they're like \"crackheads for Jesus\" or whatever the fuck. https://youtu.be/_Zj7OJjMcnM?si=f3ALaKc0mFKdhLOy",
                                            "score": 47,
                                            "replies": [
                                                {
                                                    "author": "your_evil_ex",
                                                    "body": "To be fair, when people replace their addiction to crack/alcohol/etc with an addiction to going to AA and talking about it a lot, that's still a *very* good trade off",
                                                    "score": 79,
                                                    "replies": [
                                                        {
                                                            "author": "YELLING-IN-YOUR-HEAD",
                                                            "body": "Hugely important point! Like if a nationwide network of diabetics started a fan club for manufactured insulin, ... yeah, I 100% get it. Happy for you. Just stay alive.",
                                                            "score": 12,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "upstart10",
                                                            "body": "It’s more useful to think of it like going to the gym and surrounding yourself with other people who want to train and be in that lifestyle.  It’s a shift in how you live your life and your perspective about it.  Yeah, there are a lot of people who go overboard and can be annoying about it, but compared to the people who just quietly attend to better themselves far outweigh the other troupe.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Devmax1868",
                                                    "body": "My parents joined crazy ass churches in the 80s (like faith healing and talking in tongues blend of crazy). They went head first into it and didn't come up for air. We went to church 3-6 days a week for services or volunteering. Now as an adult I am convinced they stayed in churches b/c they found a replacement dopamine source from the drugs and alcohol they did in the 70s.",
                                                    "score": 31,
                                                    "replies": [
                                                        {
                                                            "author": "doyletyree",
                                                            "body": "Mom went booze/church/booze/AA.\n\nno complaints, but I'm no fool, either.",
                                                            "score": 8,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "phillosopherp",
                                                    "body": "Substitution method. Not a bad way to go for those dying, they just become insufferable for a while",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "ozymandais13",
                                            "body": "It ca. Help them get away . Like a religious convert being the most dangerous",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "Ivotedforher",
                                            "body": "\"Nothing worse than a reformed sinner.\"",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "SipowiczNYPD",
                                            "body": "My uncle has been sober for 40+ years, still very active in AA, says the exact same thing.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "bigpancakeguy",
                                    "body": "My ex and I have both been sober for 3+ years. The first time we (unsuccessfully) quit drinking together, we went to AA for a couple months. I got big cult energy from it. “You’re powerless against your drinking and you can’t do this without ~~the organization~~ God!” And I don’t know if this was specific to the spot I went or if this is generally the case at AA, but it just felt like a pissing contest to see who was the most pathetic at their rock bottom every meeting. When my ex relapsed, then tried to quit again a couple months later, some of the people there welcomed her back happily, while a few chose to politely chastise her and blame her relapse on the fact that she wasn’t going to enough meetings.  \n\nI believe AA genuinely helps a lot of people, but I don’t care for the organization’s ethos. Jelly Roll is re-telling this story over and over again because a lot of the people who recover through the 12-step program make it their entire personality. I’m very happy for him and his fans who relate and/or get help because of him, but it is absolutely exhausting to be around",
                                    "score": 38,
                                    "replies": [
                                        {
                                            "author": "CO_PC_Parts",
                                            "body": "My buddy had to go to AA mandated by his work because he failed a random drug test at work.  He legit doesn’t have a drinking or drug problem he was just stupid at a birthday party with a bunch of rich people and had to work the next day and every time you clock in it randomized if you take a test. \n\nAnyways he got threatened by the people running the meetings saying he wasn’t giving himself up to the higher powers and until then he could never defeat his demons and save his life.   They openly threatened to get him fired.  So for the last 3 weeks he had to play their little game.  \n\nEven 15+ years later if someone brings up AA he gets pissed off. He said he’d rather join Scientology than go back to AA.",
                                            "score": 25,
                                            "replies": [
                                                {
                                                    "author": "therealpilgrim",
                                                    "body": "I got lucky with the group I went to when I had a court order to go after a minor in possession charge. A couple of them asked me if I felt that I actually had a drinking problem. When I said no they told me I was welcome to stay and listen, but they would sign my sheet and send me on my way if I wanted. \n\nI was so relieved to not have to sit through that shit any more. A lot of them seemed like pretty normal people trying to get better, but the true believers were absolutely insufferable. \n\nOnce I found out that most probation officers don’t actually verify your attendance unless your sheet is obviously forged, I just got friends and coworkers to sign it. I took several drug tests a week and did the required community service days that I had to pay to attend, but I’d rather go to jail than actually go to meetings.",
                                                    "score": 10,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "DiligentProfession25",
                                            "body": "It’s not specific to the spot lol it’s like that everywhere \n\nBut I’ll take AA over NA every time because NA is not a serious organization. Everyone there is present just to get their court slip signed, and afterwards instead of coffee & cigarettes & yap, it’s “hey anybody got a plug for some percs?” “hey can I bum a cig?” “Hey beautiful you got a boyfriend?” Or “ay can I get I ride? I’m on the opposite side of town from the direction you’re going that’s chill rite?” Ugh ugh UGH.",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "S3simulation",
                                            "body": "“We’re not a religious organization, now let’s all pray to Christian god using a traditional Christian prayer”",
                                            "score": 8,
                                            "replies": []
                                        },
                                        {
                                            "author": "PewterPplEater",
                                            "body": "It made sense for me to admit I was powerless against my addiction because every other thing I ever tried to stop using always led me right back to using drugs, so the first step is basically surrender, the drugs won, I lost, I'm not fighting this battle anymore.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "boo99boo",
                                    "body": "I was a junkie. There is nothing I hate more than 12 step true believers. They make me want to do heroin again. ",
                                    "score": 32,
                                    "replies": [
                                        {
                                            "author": "BankLikeFrankWt",
                                            "body": "Well said.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "eatmydonuts",
                                    "body": "As a recovering addict, I've made it a conscious part of my recovery never to be a self-important Sober Person™",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "stumblinghunter",
                                            "body": "I'm in the process of quitting nicotine. I found this nicotine free vape thing and the only place in my city that carried it was a kava bar. I took a long lunch to drive there, and the whole place just felt like a bar full of people that were super enthusiastic about making sobriety their whole personality. The whole thing just left a weird taste in my mouth. As someone that needed a massive wakeup call when I had my kids, I get the road to sobriety can be tough, but it felt so...pretentious.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "augustschild",
                                    "body": "this is very much like the classic \"super annoying ex-smoker\" trope.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "NuPNua",
                                    "body": "Looking in from the outside, the way Yanks deal with alcoholism is bizarre. Every country has their piss heads, but we treat it as a health issue, not some weird religious thing where people love to mention how long they've been without a drink and you're all supposed to praise them.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "KeepItSimpleSoldier",
                                            "body": "Yeah, we generally treat sick people like shit because collective care goes against the “good American values” being pushed these days. \n\nThe whole vibe over here is just *”How are you supposed to pull yourself up by your boot straps if we help you? Have you tried praying?”*",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "PewterPplEater",
                                            "body": "12 step programs are not uniquely American. I've been to NA meetings from all over the world..",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "thewetwet30",
                                    "body": "Imagine ripping on someone for trying to becoming sober and telling people about it, was probably exhausting for that person when they were in addiction but I’m sure it’s even more exhausting for your wife to hear about it from time to time. Damn, hope no one in your family has to go through addiction…",
                                    "score": -29,
                                    "replies": [
                                        {
                                            "author": "nice_lookin_vehicle",
                                            "body": "We've all got our own problems to deal with. If you're not an immediate loved one, don't pile your shit on me.",
                                            "score": 15,
                                            "replies": [
                                                {
                                                    "author": "thewetwet30",
                                                    "body": "Ok bud, so that kinda counts out all social causes that don’t directly affect you but are a problem to others? Every time you bring up a social cause that affects you but not others, they shouldn’t listen to you then, am I reading that correctly? I don’t like AA because I’m not a religious person but have some empathy and don’t expect empathy from others if you don’t",
                                                    "score": -16,
                                                    "replies": [
                                                        {
                                                            "author": "lumshots",
                                                            "body": "TIL AA is religiously affiliated.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "Im_Borat",
                                                                    "body": "From my experience, they aren't religious but seek a higher power than themselves.  I have heard all sorts of \"gods\" from the ocean, the moon, love, even a doorknob was once suggested... didn't quite understand that one. But again, not religion, more like spirituality.",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "nice_lookin_vehicle",
                                                            "body": "You're exhausting.",
                                                            "score": 8,
                                                            "replies": [
                                                                {
                                                                    "author": "getdemsnacks",
                                                                    "body": "That's it, that 12 step energy. They've got it in spades.",
                                                                    "score": 13,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "thewetwet30",
                                                                    "body": "Solid reply, very thoroughly refuted the argument",
                                                                    "score": -9,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Human_Err",
                                                                    "body": "You’re kinda making the argument for him bud",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "onexbigxhebrew",
                                    "body": "Oh no, your poor wife!",
                                    "score": -5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "matito29",
                            "body": "I had a coworker a couple years ago who would play music on a Bluetooth speaker instead of using headphones like everyone else in the shop does. He usually played pretty standard 70s/80s classic rock, but occasionally mixed it up with some pop country.\n\nThis guy was absolutely the type that would have made fun of teens his kids’ age listening to emo music, but there he was, mouthing along to “Need A Favor” like it’s not the exact same kind of whiny lyrics that every emo band wrote in 2005.",
                            "score": 25,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "lovetherager",
                    "body": "He sounds like a rapper named Rod Wave. His songs all all about being depressed and people close to him dying.",
                    "score": 46,
                    "replies": [
                        {
                            "author": "jacmrose",
                            "body": "Yes he’s very similar to Rod Wave",
                            "score": 21,
                            "replies": []
                        },
                        {
                            "author": "crowtheory",
                            "body": "Guess I’ll put my heart on ice 🧊 😫",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "ConcreteBackflips",
                            "body": "Man leave rod wave out of this, last album wasn't nearly as depressing",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "lovetherager",
                                    "body": "😂😂😂😂 he makes depressing melodic YN music",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "ConcreteBackflips",
                                            "body": "Sounds like some oldhead hater energy\n\nEdit: he do be making sad music though I can't even dispute that",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "lovetherager",
                                                    "body": "Bruh, they were playing his song tombstone at funerals😂😂😂😂😂.",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "PublicfreakoutLoveR",
                    "body": "🎵IIIIIAMMNNNAWTTOHKAAAY🎵",
                    "score": 24,
                    "replies": [
                        {
                            "author": "DiligentProfession25",
                            "body": "I was thinking My Chemical Romance lol\n\nThat music video is really fun tho",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Happy_Maintenance",
                    "body": "In Jelly Roll’s defense food is very addicting. ",
                    "score": 49,
                    "replies": []
                },
                {
                    "author": "BoSocks91",
                    "body": "This happens with so many things.  \n\nSomething starts out as a feel good story/something fresh and then it is just over exploited and saturated.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "rubinass3",
                    "body": "That shit gets old so quickly. We get it.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "masterskink",
                    "body": "He's got a Russel Brand career written all over him, everyone liked him at first, but then his schtick just ran out of steam and he still needs attention",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "Zech08",
                    "body": "Wish he wouldnt have the occasional stupid take on things especially given his experiences could be a slip of the tongue or just some bad sound bites.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Troubador222",
                    "body": "Eh, probably not as exhausting as actually being addicted.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "MrANC21",
                    "body": "I mean, he’s passionate about it 🤷🏽‍♂️",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "LogInternational1462",
                    "body": "What about his prostitute wife",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Introverted_Extrovrt",
                    "body": "He does a lot of good works for a lot of communities. So long as people use their powers for good, I’m okay with it",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Chicken-picante",
                    "body": "So many people were playing jelly roll in rehab. I got so sick of him and that Tennessee whisky song",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TheUnknown_General",
                    "body": "They say \"write what you know\" and he clearly knows what it's like to deal with addiction.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "pipinngreppin",
                    "body": "He’s not ok",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TarnishedAccount",
                    "body": "He needs to do one about struggling with obesity",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "KennyBlankenship_69",
                    "body": "He’s an industry plant, his addiction songs are relatable to middle America hence how he came out of literally nowhere to immediately being mainstream and on everything ad nauseam",
                    "score": -27,
                    "replies": [
                        {
                            "author": "quechal",
                            "body": "He didn’t come out of nowhere. He’s been in the scene for a decade.",
                            "score": 55,
                            "replies": [
                                {
                                    "author": "BP619",
                                    "body": "He switched to country when he flopped at rap. He wasn't grinding at trying to be a country singer. He's 100% an industry plant.",
                                    "score": 21,
                                    "replies": [
                                        {
                                            "author": "matt_minderbinder",
                                            "body": "I think it was Steve Earle that said something like so much modern country seems to be about tailoring rap style approaches but for white kids who are afraid of black people.",
                                            "score": 24,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "KennyBlankenship_69",
                                    "body": "Sure he was on the scene, but no one outside of shitty southern rap circles heard of him until he was all of a sudden plastered everywhere",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "uncanny_mac",
                                            "body": "just because you never heard of them before, does not mean they are an industry plant.",
                                            "score": 8,
                                            "replies": []
                                        },
                                        {
                                            "author": "FoggyInc",
                                            "body": "My sister used to listen to him a little way back in the day. Was so strange seeing what he was into what he is",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "slapshots1515",
                                    "body": "Pretty sure they’re saying he came out of nowhere when he came up, not in 2025",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "tubular1845",
                                            "body": "He didn't show up out of nowhere and immediately become part of the mainstream with his music being everywhere though, which is what they're saying.",
                                            "score": 11,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Kanthalas",
                            "body": "I hate this term to death, everyone uses it to describe artists they don’t like that became popular. The way success works in everything is effort + opportunity, and some people just have more opportunities than others due to family connections.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Vraxk",
                                    "body": ">some people just have more opportunities than others due to family connections     \n      \nWe call those nepobabies and they are fucking everywhere nowadays. On a related note, you missed the massive part luck plays in that little success equation of yours.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Kanthalas",
                                            "body": "I feel like opportunities include luck. You don't know how many you get or when they will happen, but you need to standout when they happen, but maybe it wasn't explained well.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Dukes_Up",
                            "body": "He’s been building a fan base since at least 2010. Just being ignorant.",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "KennyBlankenship_69",
                                    "body": "Lmao yeah sure, making mixtapes no one’s ever heard of then to jail and then suddenly corporations are making your addiction related music known to the masses as an opioid epidemic is going on isn’t fishy at all",
                                    "score": -7,
                                    "replies": [
                                        {
                                            "author": "ShoedJoeJackson",
                                            "body": "Yea kinda weird how he was sticking with the rapping stick and getting nowhere, switched to country and now he’s in commercials?",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "KennyBlankenship_69",
                                                    "body": "Exactly, Post Malone already made having face tattoos palatable to use him to market things to the mainstream, 2021 rolls along and they have a new tattooed faced musician that happens to know the struggles your family is going through first hand!!🤮",
                                                    "score": 9,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Dukes_Up",
                                            "body": "I don’t know what you want to be told. He is a musician who kept at it for 20 years and eventually put out an album that had some smash hits on it. Jelly Rolls 2021 album is what put him on. He made that album himself, and it turned him into a star. You act like some people high up in the music business just chose him or something and it came out of nowhere. \n\nBill Withers came out of nowhere and became a star. Maybe Christ Stapleton is a plant because he wasn’t a mainstream artist until his late 30s. Going  back further, Willie Nelson put out a bunch of underwhelming pop songs and wasn’t until he was 40 that he became a huge country star.\n\nJelly Roll is literally no different from anyone I mentioned in terms of how they got famous.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "adelaarvaren",
                                                    "body": "\" Willie Nelson put out a bunch of underwhelming pop songs and wasn’t until he was 40 that he became a huge country star.\"\n\n\n\nI wouldn't call  \"Crazy\" - Patsy Cline being an underwhelming pop song....  Willie was a well respected song writer who eventually began singing songs himself.",
                                                    "score": 6,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "KennyBlankenship_69",
                                                    "body": "\"You act like some people high up in the music business just chose him or something and it came out of nowhere.\"\n\n  \nUhhh yes because that is exactly what happened lmfao",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Dukes_Up",
                                                            "body": "I mean, that didn’t happen but okay. Apparently you think it’s impossible for someone to get popular off their music. As if no one has ever done that before. \n\nAlso, what is the incentive of picking someone like JellyRoll? Wouldn’t they pick someone who is younger, healthier, better voice? Your conspiracy makes no sense.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "KennyBlankenship_69",
                                                                    "body": "Normally yes, an ugly fat addict with tattoos over their entire body is not the most appealing pick but its the 2020s, things have changed. Post Malone was already incredibly mainstream and able to help companies sell products with ease, so his looks weren't a factor, they know it works. Jelly Roll's song are about alcohol and opioid addiction, something that is affecting millions of people throughout the country. They see Jelly Roll as an easy way for them to have someone to relate to, thus getting them to open their pocketbooks to whatever he's shelling for",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "bitey87",
                                            "body": "I'm not a fan, but I don't doubt his story. It makes sense from this perspective. There's an opioid epidemic, of the recovering addicts someone is producing music about experiences of recovery and addiction. Similar story different tastes for Corey Taylor of Slipknot.\n\nI also don't doubt that if he didn't make money for the industry he wouldn't have gotten the exposure he did. But that's true of nearly everyone that \"makes it\".",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -4,
                    "replies": [
                        {
                            "author": "thelingeringlead",
                            "body": "He’s not sober.  He’s very clear about that",
                            "score": 9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "XuX24",
                    "body": "It connects with a demographic, that’s what artists do.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "Sea-Beginning4850",
                    "body": "Then don't listen",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "Chubuwee",
                    "body": "Oh shit it’s trashy AC/DC",
                    "score": -3,
                    "replies": [
                        {
                            "author": "Risethewake",
                            "body": "That’s redundant.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Chubuwee",
                                    "body": "White trashy",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Risethewake",
                                            "body": "That’s redundant too! Lol",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "gregcm1",
            "body": "I thought Jelly Roll was the dude that used to do that bad country rap, and I was really confused now that he is so mainstream as a \"country\" artist. I wasn't going crazy after all",
            "score": 644,
            "replies": [
                {
                    "author": "pooponacandle",
                    "body": "Yeah it was super weird, at least to me, he all a sudden just became super popular all at once.  I had heard of him a couple times, but then all a sudden ALL my friends on facebook were posting about him like they had know of him for 20 years or something.  It was super weird.  \n  \nThe only other time I have seen that was with Matt Rife or whatever that comedians name is.  Went from barely heard of him to all a sudden everyone I know is all a sudden a huge fan and posting about it.",
                    "score": 105,
                    "replies": [
                        {
                            "author": "TheDriestOne",
                            "body": "I saw it a lot when Young Dolph died. Suddenly everyone was posting about him on his story despite no one ever talking about him or his music when he was alive. Super weird",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "yungoldmane",
                                    "body": "In hip hop where dying a violent death at a young age is common, Dolph’s death hit different. Idk if it was all the videos of him with his wife and his kids showing he was a true family man or if it was the fact that he seemed like a fierce hustler who rose to fame bc of his grind in the music game. Either way his death was much different than say Juice WRLD or King Von or something.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Princess_Spammi",
                            "body": "He did ballads of the broken and it changed his image",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "OriginalNord",
                            "body": "Rat Knife*",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "mikaeleleivas",
                    "body": "Nah fr first time I heard of him was in 2016 on The Games album and he was using the N word lol",
                    "score": 185,
                    "replies": [
                        {
                            "author": "kingcrackerjacks",
                            "body": "Wow I remember him doing the hook on Summertime, never connected him to the opening on Hashtag. Went back and listened to it again, ~~I counted 6 times damn~~\n\nNvm good news it's a different Jelly Roll on that song. https://rapindustry.com/jelly-roll-hip-hop-producer/",
                            "score": 79,
                            "replies": [
                                {
                                    "author": "GodKamnitDenny",
                                    "body": "I was going to say, I researched this a year or so ago because I remember Hashtag being a fun rap song featuring a Jelly Roll and was very concerned for a bit lol. You had me scared for a minute my research wasn’t great, but yeah different person.",
                                    "score": 14,
                                    "replies": []
                                },
                                {
                                    "author": "AdSudden3941",
                                    "body": "I thought that was lil Jon in hashtag for some reason lol",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "puremotives",
                            "body": "That’s a different Jelly Roll",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "tonallyawkword",
                                    "body": "TIL there are 3 musical artists known as Jelly Rolls.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AdSudden3941",
                    "body": "He was rapping with tech nine for a second I thought , never liked him then because he reminded me of another fat white rapper, rittz maybe but he wasn’t as good…\n\nNow that he acts like an actual country musician is beyond me , just because that one song that made popular charted on country I guess .. it’s fake like mgk ",
                    "score": 35,
                    "replies": [
                        {
                            "author": "IllustriousEnd2211",
                            "body": "Both rittz and jelly roll fucked with yelawolf back then",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "AdSudden3941",
                                    "body": "Yeah it was probably yelawolf then .. I used to listen to him till he fell off , I thought him and rittz were going to be huge",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "IllustriousEnd2211",
                                            "body": "I still fuck with my box chevy",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "rvasshole",
                                            "body": "i had high hopes for yelawolf and cyhi",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ATRGuitar",
                            "body": "I think you're thinking of murkules",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "I_am_a_dick_ted",
                                    "body": "Used to be good now it’s all being rich",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Asplashofwater",
                            "body": "I first heard of jelly roll in 2016 when a co worker told me she was going to see him. She also told\nMe in the same time period she was a fan of ritz lol",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "GoLionsFTP86",
                            "body": "Rittz is the man! Not nearly as fat as Jelly Roll either, that was kind of harsh lol. But I wish Rittz blew up, he deserves it. He's a way better rapper than Jelly Roll, it ain't even close. Rittz is far superior to anyone you hear on the radio as well but that's just how it goes in today's fake world.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MonkeySherm",
                    "body": "I thought he was some sort of iPhone app…",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "DLottchula",
                    "body": "He has a display in the country music HoF",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "gregcm1",
                            "body": "Big props to you if you could stay sober in those conditions",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "rawonionbreath",
                    "body": "The ven diagram of rap and country didn’t exist 20 years ago whereas now it’s starting to become a thing.",
                    "score": -14,
                    "replies": [
                        {
                            "author": "Scrantonicity_02",
                            "body": "Tim McGraw and Nelly would like a word",
                            "score": 48,
                            "replies": [
                                {
                                    "author": "Tay0214",
                                    "body": "Bubba Sparxxx has been around forever, and to a lesser extent Colt Ford\n\nHick Hop/Trailer Trap/Country Rap wasn’t super common but it wasn’t necessarily bad either\n\nAlso I loved Jellys earlier stuff with Jennings, and his solo stuff. He also went pretty big on rock radio/sirius with a couple songs a couple years ago\n\nI dunno why anyone would hate him, even his current mainstream stuff is still better than 90% of todays pop country crap\n\nAnd people always act like an artist always sucked once they turn out to be shitbags or someone they disagree with, but even after shifting to country Kid Rock was huge for awhile lol",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "Sa7aSa7a",
                                            "body": "Bubba Sparxxx was amazing, too. ",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "JunkHead1979",
                                                    "body": "I only heard his very first album. But I enjoyed the shit out of it. When his major label debut came out, they used a lot of the songs from the first one, but not all. Still good though.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "OttoBlado2",
                                                            "body": "His next one, Deliverance is really good, a couple of my favorite Timbaland beats are from that album.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "JunkHead1979",
                                                                    "body": "Yeah I think Ive heard some of that one before. And I was at work earlier and couldn't remember the name of the first album. It was \"Dark Days, Bright Nights\". The earlier version is not as well produced, as it was with a lower budget. But it's still awesome. The 2nd version of it, uses a lot of the same songs, but changes the order around and has new songs as well. The original has a song called \"Kuntry Folks\". Which follows the beat/progression of \"Country Boy Can Survive\". And it didn't have \"Ugly\", which I think was a big hit. I can't remember. According to Wikipedia, the Interscope version came out in 2001. No clue when the Newtown version came out.\n\nEdit: 2000 https://www.discogs.com/release/493188-Bubba-Sparxxx-Dark-Days-Bright-Nights",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "OttoBlado2",
                                                                            "body": "I didn’t know about the original but looking at both track lists it looks like they’re pretty different, I’m going to have to check it out. Ugly was the first song of his I heard.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "JunkHead1979",
                                                                                    "body": "https://www.mediafire.com/file/u2bcoqf3t7jcay8/Bubba_Sparxxx_-_Dark_Days%252C_Bright_Nights_%255BNewtown%255D.zip/file\n\nSee if this works.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "OttoBlado2",
                                                                                            "body": "It does, thanks!",
                                                                                            "score": 2,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "spain-train",
                                                    "body": "Booty booty booty booty rockin' everywhere",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "xelop",
                                            "body": "A)hate jelly rolly. Not heard a single song that didn't give me the \"ugh this\" vibe like kid rocks shit did when he got big. Hated kid rock. My favorite part of joe dirt is kid rock getting dunked on repeatedly through the movie.\n\nB) I despise pop country",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "rawonionbreath",
                                    "body": "A one-off collab they did. There was also Cowboy Troy and Bubba Sparxxx but that’s still barely constituting a sub-genre compared to what they have now.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "BravoCharlieDelta",
                                    "body": "From that traditional country music mecca, Seattle.  Before there was Baby Got Back, there was Square Dance Rap  (Swass for the oldheads)\n\n[https://youtu.be/-oDjadti6-8](https://youtu.be/-oDjadti6-8)",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Andabariano",
                            "body": "It did it's just the generally accepted opinion was that it was garbage lol",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "rawonionbreath",
                                    "body": "I wasn’t commenting on its quality. It’s funny to get downvoted for simply pointing out a factual trend.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "thelingeringlead",
                                            "body": "It’s not factual. The crossover started a long ass time ago.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "rawonionbreath",
                                                    "body": "Outside of a few one-offs, no it was not. Now you have multiple artists doing it whereas you could count with one hand and have a few fingers leftover in 2005.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "WizardsOfTheRoast",
            "body": "For a long time, people would be like, \"I love Jelly Roll\" and I thought they were talking about Jelly Roll Morton and assumed, very incorrectly, that ragtime piano had gotten realy cool recently.   \nRE: The Kid Rock comparison: Jelly Roll has never had a song as wildly fucking good as Bawitdabaw.   \nOn the other hand, Jelly Roll doesn't seem like the human embodiment of feces smeared all over a rest stop toilet, despite recording unfuckwithable banger Bawidabaw.",
            "score": 614,
            "replies": [
                {
                    "author": "SlimySquamata",
                    "body": "I've recently learned about Jelly Roll Morton and ragtime when researching the history of jazz! Just finished listening to his recording at the Library of Congress, and I'd recommend any music fan to check it out. What a character.",
                    "score": 47,
                    "replies": []
                },
                {
                    "author": "Karmasmatik",
                    "body": "It warms my heart to know that other people still know Jelly Roll Morton.",
                    "score": 34,
                    "replies": []
                },
                {
                    "author": "jacobius86",
                    "body": "Man, your right.  That song and a few others are such bangers.  Even saw him live once and it was a good/fun show.   But man, what he has become in the last 8 years just makes me never want to listen to him again.  Same feelings about Kanye.",
                    "score": 54,
                    "replies": [
                        {
                            "author": "peekay1ne",
                            "body": "Yes. Jelly Roll seems like a genuine good dude whereas Robert’s just a prick.",
                            "score": 33,
                            "replies": [
                                {
                                    "author": "Hondalol1",
                                    "body": "For sure, this is the main thing that makes the comparison fall apart for me",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Curlydeadhead",
                    "body": "Ragtime/syncopated piano is amazing!  It’ll never stop being cool to me. I feel like I’m in an old saloon with one of them pianos playing by itself while a fight breaks out and someone goes tumbling out the front swinging door while someone is walking in only for the guy to get up and run back into the bar continue the fight. ",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "corrigible_iron",
                    "body": "Same here! Though Morton wasn’t ragtime, he’s the self-proclaimed inventor of jazz, but also the most-documented inventor of it. Also, did you know that Jelly Roll is barrelhouse slang for vagina? The more you know! 🌈",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "MysteryBagIdeals",
                    "body": "> unfuckwithable banger Bawidabaw.\n\nI agree that \"Bawitdaba\" is unfuckwithable but boy has Kid Rock done his best to fuck with it",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "Jesus_Is_My_Gardener",
                    "body": "That's who I legitimately thought this thread was about at first and was confused. Fuck I'm old.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "pipinngreppin",
                    "body": "Frequest guest on the Colgate comedy hour.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "eatmydonuts",
                    "body": "Thank you for acknowledging that song's kickassery. As a staunch defender of nu-metal, fuck Kid Rock, but that song is a fuckin' banger.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "username161013",
                    "body": "I want to upvote this so bad, but the double praise for that horrible annoying song prevents me. Everything else you said is right on. Jelly Roll Morton deserves more recognition these days.\n\n\nEdit: Before the downvote army comes, he didn't even write that chorus. Skip to 4:20 to hear the far superior original...\n\n\nhttps://youtu.be/mcCK99wHrk0?feature=shared",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "clangan524",
                    "body": ">unfuckwithable banger Bawidabaw.\n\nFuck Kid Rock but when *Bawitdabaw* inevitably drops at a sporting event, it always hits.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "marinerverlaine",
                    "body": "Kid Rock's numetal era had a lot of really fun songs that seems to never be replicated in tone/spectacle/humor/inexplicably goofy genre-mixing. I wish somebody would bring back the fun part of the trashy energy he brought back then in songs like Bawidaba, Cowboy, American Bad Ass, I Got One For Ya, etc\n\nIt's real sad his meteoric level of personal dumbassery has retroactively removed it from the Y2K revival canon.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "dannydirtbag",
            "body": "https://preview.redd.it/p2c2cfsdbcpe1.jpeg?width=1320&format=pjpg&auto=webp&s=6c2d6283616f44149c3bf35ce0cc9096d56e13e4",
            "score": 88,
            "replies": []
        },
        {
            "author": "Troubador222",
            "body": "So I was skeptical of him until I heard a story from a family member who has met him. \n\nMy adult daughter is a bartender at a high end restaurant in a major city where he plays. After his shows, he and his entourage come to the restaurant where she works. She said he personally makes sure all his people treat the staff well and personally makes sure everyone serving them gets tipped and tipped well. \n\nI started thinking maybe he is a bit genuine. After hearing that. And she has dealt with a lot of celebrity customers. She swears he is the best.",
            "score": 348,
            "replies": [
                {
                    "author": "roysourboys",
                    "body": "I know he takes his faith VERY seriously. When he played here he did a show at a prison and he talked on the radio how he does that or feeds the homeless or something like that on every tour stop. He seems to walk the walk and I respect that even if I've never heard his music.",
                    "score": 112,
                    "replies": [
                        {
                            "author": "TrumpetOfDeath",
                            "body": "He grew up in a bad neighborhood and spent much of his youth in prison, where he got into music. I think that gives him a perspective that most artists lack",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "RainbowCrane",
                                    "body": "His story is a bit like Merle Haggard’s, as far as the authenticity of his music goes. Both he and Merle went to prison and made their way out of that life to a healthier path. Merle Haggard’s “Sing Me Back Home” is about a death row inmate he met while he was incarcerated.",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "FloppySpatula-",
                            "body": "He has stopped by and visited jails in my area, and he has dropped in to talk to and perform for recovery programs, inside and outside jails. He really is about the personal touch. Genuinely good guy.",
                            "score": 54,
                            "replies": [
                                {
                                    "author": "OldManAndTheBench",
                                    "body": "When he was in my city last year, he visited the mental health hospital, did a talk and I think played too. I'm not much of a fan but so much respect to him for this!!\n\nhttps://www.theroyal.ca/news/award-winning-country-singer-and-mental-health-advocate-jelly-roll-visits-royal",
                                    "score": 21,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Cochise22",
                            "body": "As a non-religious person, I absolutely fuck with this type of religious person. This is what Christianity should be about instead of…well whatever the fuck it is the GOP is doing on any given day. ",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "ProfessionalMottsman",
                            "body": "What does taking faith very seriously mean? Does that mean you can be a piece of shit because gods behind you? Am I considered a bad person because I take my lack of faith very seriously ?",
                            "score": -9,
                            "replies": [
                                {
                                    "author": "KnowledgeGod",
                                    "body": "Uhh, no need to victimize yourself, they stated what some celebrity is about lol.. all that means is the dude tries to live his life according to his religious views(like the actual way vs the sometimes phony Christian BS)..",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "tryflin09",
                    "body": "I’ve worked with him and can confirm that Jelly Roll is an incredible human being. He has a very interesting story and I suggest listening to his episode of the Smartless podcast. Everything he writes about is what he lived. I wish nothing but the most success for the guy.",
                    "score": 93,
                    "replies": []
                },
                {
                    "author": "VanGoghPro",
                    "body": "He put on a free concert for our local jail in Ky. On the way to the jail his bus passed a car on the side of the road with a flat tire. He stopped and his team bought the guy a new set of tires. They’re genuinely good people.",
                    "score": 32,
                    "replies": []
                },
                {
                    "author": "Marsuello",
                    "body": "Have a friend who recently got to work with him cuz his company was interviewing him. Said jelly roll was incredibly kind to every single person, personally went to every single employee shook their hand and thanked them, and just overall was one of the nicest people my friend has ever met, he said. So while his music isn’t for everyone, he definitely is genuine in his kindness",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "Alexplz",
                    "body": "Nicest fat tattooed fuck to ever pick up a mic, now for sure I'll listen to his music",
                    "score": 31,
                    "replies": [
                        {
                            "author": "dualsplit",
                            "body": "He said if he loses any more weight people will mistake him for Post Malone. I cackled.",
                            "score": 43,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "pimpfriedrice",
                    "body": "Every interaction that I’ve read about him is similar to this one. He seems like a genuinely good person.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Asplashofwater",
                    "body": "Had a coworker who was a fan in 2016, she met him and he was super friendly.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "ButterMyBiscuits96",
                    "body": "I cant get over the fact that his daughters teeth are rotten. Like some of the worst I've actually seen. They were poor sure but they've had enough money for long enough that she shouldn't look how she does. I also almost never see him and his daughter together in the massive amount of tiktoks his wife post.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "al_capone420",
                    "body": "You can be a good genuine person while also being overly famous for mediocre at best music.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "DiligentProfession25",
                            "body": "Idk man Pop Another Pill is a banger. Anytime that comes on it activates 15yo me like a sleeper agent.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "biglyorbigleague",
            "body": "Kid Rock wasn’t ever really much of a country star. He didn’t get all that much play on country stations or chart on the country charts. His success was in nu metal and then mainstream rock. Kid Rock’s association with country music is mainly through the solo career of his DJ, Uncle Kracker. Jelly Roll has way more legit country fans.\n\nEdit: Kid Rock did have one major top-20 country airplay hit. Compared to Jelly Roll’s career so far that’s not much. I’d still class Kid as a famous rock act with a country song rather than a rapper who got big in country music.",
            "score": 161,
            "replies": [
                {
                    "author": "TaterTotJim",
                    "body": "The Kid Rock x Sheryl Crow song got so much play and put him in more of a national spotlight. \n\n\nHe was/is a big enough country star and has been for more than half of his career. \n\n\nI say that as someone who was a “fan” when I was in my teens during his numetal era.",
                    "score": 64,
                    "replies": [
                        {
                            "author": "Sbeast86",
                            "body": "Kid rock had maybe 8-10 years of fame as a hard rock/nu metal artist. And has been doing southern rock/country for the last 15.",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "TaterTotJim",
                                    "body": "You forgot to mention his start as a bridge from Vanilla Ice to a proto-Eminem of sorts. Hit tracks like “grits sandwiches for breakfast” and “yodeling in the valley” were really something.",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "DamagedEctoplasm",
                                            "body": "Even had an Eminem feature on his first album",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Earptastic",
                                    "body": "Yeah but he had some legit good albums when he started.  Everything after Cocky is trash.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Sbeast86",
                                            "body": "Cocky was awful.  I actually liked rock n roll jesus though",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Earptastic",
                                                    "body": "I guess we disagree on that.  Devil without a cause is the best one by far though.",
                                                    "score": 7,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "gunillagarsongoldbrg",
                            "body": "I hate/love you for reminding me about this song and the many times I’ll listen to it this week",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "TaterTotJim",
                                    "body": "It was popular for a reason. Can you separate the art from the artist? I do sometimes. \n\n\n“All Summer Long” was an anthem here in Michigan and I still like it, along with “Picture” cuz it’s an earworm.\n\n\nKid Rock and Pam Anderson lived in my town when I was a kid so I may be a little biased. She treated me nicely a few times.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "gunillagarsongoldbrg",
                                            "body": "I think I can for KR because I’m not super aware with what he’s up to these days. Love Pam though!",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Zanydrop",
                    "body": "I've listened to country radio stations my whole life and the only Kid Rock song that ever got play on them was that Sheryl Crow duet. Nothing else ever got country play.",
                    "score": 46,
                    "replies": [
                        {
                            "author": "QLC459",
                            "body": "All summer long is one of the most popular summer country anthems of all time lmao",
                            "score": 53,
                            "replies": [
                                {
                                    "author": "PobBrobert",
                                    "body": "Yeah, I worked at a radio group when that song came out and it was in the highest rotation order along with Taylor Swift’s You Belong With Me. That was a rough summer",
                                    "score": 21,
                                    "replies": [
                                        {
                                            "author": "QLC459",
                                            "body": "It's always wild to me when people try to pretend KR isn't a legit artist just because he's a crappy person.\n\nThe guy has a perennial summer classic that most artists would kill for along with a solid discopgraphy of fun rap/hip hop/hick hop.\n\nIs he some transcendent artist? No. Is he a good person? Also no.\n\nDid he have a handful of solid songs throughout the years though? Undeniably.",
                                            "score": 15,
                                            "replies": [
                                                {
                                                    "author": "PobBrobert",
                                                    "body": "Kid Rock and Uncle Kracker both released some of the most enduring hits of the 2000’s. I don’t know much about Uncle Kracker, and it’s obvious Kid Rock is a piece of shit, but they knew how to put out a hit",
                                                    "score": 12,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Zanydrop",
                                                    "body": "Yeah I can make fun of KR now but when American Badass came out my buddy downloaded the song off dial up internet, burnt it to a CD and we listened to it on repeat like 6 times in my Oldsmobile 88 when I was 17. Solid memories.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "Fine-Image-3913",
                                                            "body": "Embarrassing lol",
                                                            "score": -2,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "biglyorbigleague",
                                                    "body": "I’m not saying he isn’t a legit artist, I’m just saying he’s much less of a country artist than he is associated with other genres.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Asplashofwater",
                                                    "body": "The dude reliably plays 20,000+ cap arenas and amphitheaters. He fuckin sucks, but where his demographic is, he sells, same as any big artist.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "philouza_stein",
                                    "body": "And the beat was made for ICP 😂",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Burn_The_Earth_Leave",
                                            "body": "That beat was made by Detroit Legend Mike E. Clark. Also Kid Rock was on ICP's first CD. Where I'm pretty sure he said the N-word. And I'm very sure he says it with a hard r nowadays",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Roarestored",
                                    "body": "That's on rock radio",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "criticalmonsterparty",
                            "body": "I heard that All Summer Long song on country radio, but at that point, there was hardly any distinction between pop country and other pop music.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "thecheat420",
                    "body": "I was today years old when I learned Uncle Kracker was Kid Rock's DJ and not just another white dude.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Oo0o8o0oO",
                    "body": "Yeah he was reppint Detroit the whole time right? Not exactly out on the farm.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "fentown",
                            "body": "I know people that used to see him \"perform\" in basements of \"The Clem\" (Mount Clemens, about 20 minutes outside of Detroit) so he wouldn't have to go to Detroit. He was a poser long before even his first album.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MysteryBagIdeals",
                    "body": "> Kid Rock wasn’t ever really much of a country star.\n\nhe clearly wants to be though. he never went full country like Post Malone but he wants that audience",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Risethewake",
            "body": "Bawitdaba, da-bang, da-bang, diggy-diggy-diggy\nSaid the boogie, said up drop the boogie\nBawitdaba, da-bang, da-bang, diggy-diggy-diggy\nSaid the boogie, said up jump the boogie\n\n\nI don’t fuck with kid rock, but that song slaps.",
            "score": 53,
            "replies": [
                {
                    "author": "Embarrassed-Back1894",
                    "body": "Yeah I hate kid rock, but there are little jams like that from back in the day that I can’t help but dig 😂",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "username161013",
                    "body": "Nah the original he ripped of is far superior, as are all the many covers of it. Skip to 4:20...\n\n\nhttps://youtu.be/mcCK99wHrk0?feature=shared",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "StevelandCleamer",
                    "body": "...what?\n\nThat's influence, not a cover or rip-off.\n\nThat's like saying all music with scat is a ripoff of Scatman Crothers, which he didn't invent either.\n\nNobody looking for Rapper's Delight will be satisfied by Bawitdaba, and vice versa.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "bobbyfischermagoo",
            "body": "I like the idea of Jelly Roll more than the music. Inspiring story and seems like a genuinely good person but the music is just not that good.",
            "score": 29,
            "replies": []
        },
        {
            "author": "Annual_Plant5172",
            "body": "I tried listening to his album while driving, and I could see my wife getting visibly agitated because it was so awful.",
            "score": 97,
            "replies": [
                {
                    "author": "FlopsMcDoogle",
                    "body": "That's better than noticing she was visibly enjoying it",
                    "score": 83,
                    "replies": [
                        {
                            "author": "Annual_Plant5172",
                            "body": "That would have been a big red flag, even though we already have pretty different tastes in music anyway 😂",
                            "score": 16,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "InvestmentFun3981",
            "body": "I guess they have some stuff in common, but they really have different vibes, a lot of Jelly Rolls stuff is on the more dour side, Kid Rock's music was often about fun",
            "score": 9,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 7,
            "replies": [
                {
                    "author": "Taograd359",
                    "body": "He also struggles with sleeping with Lauren Boebert while avoiding contracting an STD",
                    "score": 36,
                    "replies": [
                        {
                            "author": "pslickhead",
                            "body": "Imagine being engaged and then splitting up over crazy pants [Lauren Boebert](https://dims.apnews.com/dims4/default/934cc95/2147483647/strip/true/crop/4633x2606+0+241/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4d%2F59%2F222c6377c70dcf59738e17e49040%2Fe7eb396df732415ca27ffe3a6ecb4338). Also, what STD's doesn't he already have?",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "RandyRandallman6",
                                    "body": "What? Can a man not want a BJ at a local production of beetlejuice? I thought this was America.",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "Necessary_Lynx_6144",
                                    "body": "Lol wait what? Is this true?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "pslickhead",
                                            "body": "Yeah. He was engaged to [Audrey Berry](https://www.google.com/search?sca_esv=2f9c8c540533396c&rlz=1C1GCEB_enUS1147US1148&sxsrf=AHTn8zrOjcJBlRpoQR9JYoR1HS7FIgLjNQ:1742238757884&q=Audrey+Berry&udm=2&fbs=ABzOT_CWdhQLP1FcmU5B0fn3xuWpA-dk4wpBWOGsoR7DG5zJBnsX62dbVmWR6QCQ5QEtPRrN1KFHti9EP_dqC742rxzHOflpCk-fK7JoCi_SGMG4BiZbuYGQWUWTsxHjLaRbwQg4EDuAnUFcau-U5rAQWAYxZDYtpmJrrrwHhWduMyMcElm-zoHZb221tqH5YmDSoJm5F58lQ4hNfNaoxSk-ZHuojEaDzw&sa=X&ved=2ahUKEwj2-5uS6ZGMAxV0jokEHQm8MjgQtKgLegQIGhAB&biw=1920&bih=911&dpr=1&safe=active&ssui=on)  for 7 years.",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "Taograd359",
                                            "body": "Idk if it’s been confirmed that they’re dating, but they have been seen together.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "KrenshawOfficial",
                                    "body": "Tbf, Boebert is regarded, but that doesn't stop her from being easily top 5 hottest congresspeople of all time",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Philboyd_Studge",
                    "body": "How he struggles to hide his actual hairline",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "PlaneWolf2893",
            "body": "Not really. Kid rock was about partying . There was no letting up with that.\n\nJelly roll sound like the soundtrack to intervention success follow up videos.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Pxlfreaky",
            "body": "What’s more exhausting, a new vegan or an old drunk?",
            "score": 24,
            "replies": [
                {
                    "author": "Impossible_Angle752",
                    "body": "Someone who does crossfit?",
                    "score": 15,
                    "replies": []
                }
            ]
        },
        {
            "author": "RadioSlayer",
            "body": "I don't respect his stage name, because Jelly Roll was a jazz musician from back when",
            "score": 57,
            "replies": [
                {
                    "author": "TornadoApe",
                    "body": "Should have come up with something original. He's a big guy and makes bops right? Why not something unique like The Big Bopper",
                    "score": 32,
                    "replies": [
                        {
                            "author": "jdimarco1",
                            "body": "What a curious name, the day someone uses that name, is the day the music dies.",
                            "score": 10,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "VinnyBalls",
            "body": "Teddy Swims is far superior.",
            "score": 12,
            "replies": []
        },
        {
            "author": "BetLeft",
            "body": "https://i.redd.it/u0fe5xvu5bpe1.gif",
            "score": 14,
            "replies": []
        },
        {
            "author": "betterplanwithchan",
            "body": "I don’t know much about Jellard Rolland",
            "score": 5,
            "replies": []
        },
        {
            "author": "eltedioso",
            "body": "Jelly Roll seems like a genuine dude who can actually sing his ass off. Just 'cause he made some bad rap in the past doesn't mean he's like Kid Rock. Now, is Jelly Roll's country/soul stuff any good? Results might vary. I think it's a little pandering, personally. And the \"struggle\"/recovery-type material is super heavy-handed.\n\nBut the dude can sing for sure.",
            "score": 88,
            "replies": [
                {
                    "author": "newmanification",
                    "body": "I will admit that my exposure to Jelly Roll is limited, but what I have seen were various live performances where he struggled to stay on pitch.",
                    "score": 47,
                    "replies": [
                        {
                            "author": "pslickhead",
                            "body": "Noooo... you have to love his voice because of his message of faith and hope while in recovery. /s",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DannyBoi1Derz",
                    "body": "I mean he can carry a tune but I wouldn't call him a very good singer.",
                    "score": 58,
                    "replies": [
                        {
                            "author": "KennyBlankenship_69",
                            "body": "He’s a great karaoke singer, can do a solid cover on tv with the teleprompter but his own songs are absolute hot garbage",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "Gopokes34",
                                    "body": "He reminds of a band at bar where the singer would impress you",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "dasnoob",
                            "body": "He can not carry a tune. I've had to listen to him live and he can't stay on pitch to save his life.",
                            "score": 12,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "dasnoob",
                    "body": "He uhhhh... can not sing very well. Find a live performance (the Ozzy HoF induction is a good example). His actuall vocals are fucking terrible. His voice is severely damaged and he can't even carry a tune.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "G-Unit11111",
                    "body": "I did like his performance at Fire Aid, that was cool. He did a pretty good cover of Hollywood Nights.\n\nHis music does get a bit repetitive that's for sure.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "jmkrri",
            "body": "Way fatter",
            "score": 9,
            "replies": [
                {
                    "author": "Crystal_Pesci",
                    "body": "Kid Continent",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "JohnTheMod",
            "body": "He’s a truck stop bathroom wall that gained sentience and found the Lord.  That’s the only way I can describe him.",
            "score": 20,
            "replies": []
        },
        {
            "author": "McGrawHell",
            "body": "Nah, kid rock was fun before he became a political figure. JR is a depressing mess.",
            "score": 77,
            "replies": [
                {
                    "author": "moal09",
                    "body": "There were a few very wholesome stories about Kid Rock doing extremely nice things for fans, trying to keep his ticket prices affordable, fighting scalpers, generally being a nice guy, etc.\n\nShame he's such a massive douchebag politically.",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "El-Viking",
                    "body": "Grits Sandwiches For Breakfast was a pretty decent hip-hop album.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "bones_boy",
                    "body": "I like this answer.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Salzberger",
                    "body": "This is refreshing to see. Usually when Kid Rock is mentioned he just gets completely trashed, quite possibly by younger people.\n\nThe dude was putting out red hot bangers in the 90s. No they weren't Bohemian Rhapsody, but that's the 90s.\n\nYes he's a lame political blow hard now, but dismissing his impact because of that isn't accurate.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "zzyzx2",
                            "body": "This is why I still defend Limb Bizkit...are they the greatest? No. Easy no. I mean our man Fred is personally responsible for Aaron Lewis but they (Stain) falls into the same category as Bobby (fun fact if you ever hang out with Kid Rock he demands you call him Bobby...don't ask me why I know that I'm ashamed to know that), Stain was red hot in the 00s but now Aaron is scum.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Asplashofwater",
                                    "body": "And shockingly enough Fred is very pro lgbtq+.",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "dwilkes827",
                                    "body": "Limp Bizkit has had a shocking turn around in popularity the last couple of years lol",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Earptastic",
                            "body": "Devil Without a Cause is a damn great album.  He sucks now but it feels wrong to deny that greatness.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "tdizell",
                    "body": "I think they both fit well in the CRAP genre “Country RAP.”",
                    "score": 6,
                    "replies": [
                        {
                            "author": "ArcticFlava",
                            "body": "Hick-hop",
                            "score": 14,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "FlopsMcDoogle",
                    "body": "Yeah I'd much rather listen to any Kid Rock song than Jelly Roll",
                    "score": -3,
                    "replies": []
                },
                {
                    "author": "endl0s",
                    "body": "Yea. He sucks now because he's just only doing political over the top shit and it's annoying AF but Devil Without A Cause was an awesome album when it came out.",
                    "score": -6,
                    "replies": []
                },
                {
                    "author": "ThisGuyRightHereSaid",
                    "body": "Grits for breakfast!",
                    "score": -4,
                    "replies": []
                }
            ]
        },
        {
            "author": "satans_right_nut",
            "body": "Kid Boulder.",
            "score": 3,
            "replies": [
                {
                    "author": "karmalove15",
                    "body": "Underrated comment",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TomatilloKnown6781",
            "body": "Actually Hardy is this generations Kid Rock",
            "score": 5,
            "replies": []
        },
        {
            "author": "Cirok28",
            "body": "He's not even good, just being shoved in our faces.",
            "score": 3,
            "replies": []
        },
        {
            "author": "peachyfuzzle",
            "body": "Well, they both got their start from Insane Clown Posse...",
            "score": 18,
            "replies": [
                {
                    "author": "The_Wombles",
                    "body": "I saw jelly roll at the gathering years ago. When I saw that he was at the cmt awards I laughed my ass off. What a crazy industry",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "954kevin",
            "body": "Having heard both speak, It feels like an insult to Jelly Roll to make this comparison. ;)",
            "score": 11,
            "replies": []
        },
        {
            "author": "dasnoob",
            "body": "All I know is his music is absolutely terrible. His vocals suck. The lyrics are incredibly basic. He hits all of the 'pop' stuff especially in pop country though. I and my entire family of five are ready for him to go away.",
            "score": 5,
            "replies": []
        },
        {
            "author": "laxgolf",
            "body": "People should listen to Jelly Roll's interview on Smartless.  Outstanding.",
            "score": 3,
            "replies": [
                {
                    "author": "UponTheTangledShore",
                    "body": "Jelly Roll isn't my style, but I found respect for him when he testified before Congress about the fentanyl crisis.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RedDragon2570",
            "body": "More like Uncle Kracker",
            "score": 3,
            "replies": []
        },
        {
            "author": "antibeingkilled",
            "body": "Jelly roll just left lil wyte in the dust huh? This Down Here was a banger",
            "score": 3,
            "replies": [
                {
                    "author": "suddenimpulse01",
                    "body": "Right, I remember that album they did together like 10 years ago. Never would have thought he'd blow up like that",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "TomAtowood",
            "body": "His music is just as insufferable as kid dorks.",
            "score": 3,
            "replies": []
        },
        {
            "author": "hartemis",
            "body": "I don't know but Post Malone has his own Oreo flavor.",
            "score": 3,
            "replies": []
        },
        {
            "author": "aj_ramone",
            "body": "No, he's forklift certified Adele.",
            "score": 25,
            "replies": [
                {
                    "author": "Morti_Macabre",
                    "body": "This is somehow the most accurate description of him I’ve ever read",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "askmeaboutmymethlab",
            "body": "We have Jelly Rock and Kid Roll at home.",
            "score": 5,
            "replies": []
        },
        {
            "author": "disaster_moose",
            "body": "What's the difference between country and country rap? Is it the drum beat? They both have that talk/ rap style of vocals but with some \"country\" twang.",
            "score": 7,
            "replies": [
                {
                    "author": "ShoedJoeJackson",
                    "body": "He actually has a pretty good voice when he’s singing, but no substance",
                    "score": -8,
                    "replies": []
                }
            ]
        },
        {
            "author": "brendamn",
            "body": "Let a fat guy with face tattoos have his moment",
            "score": 10,
            "replies": [
                {
                    "author": "spidermonkey45",
                    "body": "We've already got Post Malone and Teddy Swims, there's really no need for three of them",
                    "score": 16,
                    "replies": [
                        {
                            "author": "brendamn",
                            "body": "Those gentlemen are no longer fat artist tyvm",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SparkyPantsMcGee",
            "body": "Kid Rock was more fun back in the day. Jelly Roll is just fucking depressing.",
            "score": 2,
            "replies": []
        },
        {
            "author": "SandyAmbler",
            "body": "I don’t get the appeal",
            "score": 2,
            "replies": []
        },
        {
            "author": "bozon92",
            "body": "So I thought everyone was saying Jelly Roll was a good dude. Is that not the case? Being a country singer in this day and age is generally not a good indicator of your moral character",
            "score": 2,
            "replies": [
                {
                    "author": "Na0ku",
                    "body": "He kinda is… he had a rough past and made it out and found success in what he likes doing which apparently these days is enough of a reason to hate someone. He seems very engaged with his community, advocates for a lot of good things and genuinely tries to get in better shape while motivating others to do the same.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "kmatyler",
            "body": "No that’s post Malone",
            "score": 2,
            "replies": []
        },
        {
            "author": "incognegro1976",
            "body": "Thought this was about Lemon Jelly and I was very confused for a second there.",
            "score": 2,
            "replies": [
                {
                    "author": "Wind5",
                    "body": "🦆\n\nAll the ducks, are swimming in the water...",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "allanon1105",
            "body": "Both are obnoxious and the majority of their fans are some of the worst people you’ll ever have the misfortune to meet.",
            "score": 2,
            "replies": []
        },
        {
            "author": "DatMoeFugger",
            "body": "I actually paid to see him once. For a guy who preaches sobriety he's doing shots on stage and asking the crowd to throw him Xanax bars. I'm sure this will be downvoted to hell and back but he's pandering for a paycheck.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Aromatic-Air3917",
            "body": "Do you how many grifters there are in country and in rap?\n\n  \nIf you are going to call him out, you better being calling the whole industry out.\n\n  \nWhen I was young country and rap used to be music of rebellion. Now it's the soundtrack of bootlickers",
            "score": 2,
            "replies": [
                {
                    "author": "ShoedJoeJackson",
                    "body": "Fair enough. Mostly commercial shit",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "boognishklaus",
            "body": "Jelly roll fucking sucks but he seems like a cooler guy than kid Rock",
            "score": 2,
            "replies": []
        },
        {
            "author": "Melodicplanet65",
            "body": "I’m so fuckin sick  of him and his story. \nIt was a good PR move for about a week.",
            "score": 2,
            "replies": []
        },
        {
            "author": "TK8698",
            "body": "It seems he's a one hit wonder that the music industry wants to try to turn into a star.",
            "score": 5,
            "replies": [
                {
                    "author": "Dukes_Up",
                    "body": "A one hit wonder with at least 10 hits.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Freshandcleanclean",
                    "body": "It all feels incredibly forced",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Zanydrop",
            "body": "Wow, didn't know so many people here hated Jelly Roll. I'm surprised. I know everyone here hates country but he isn't a bro Country guy singing about cut off jeans and trucks. His songs are mostly heart felt songs about addiction and depression. I saw him last week and he was great. Played a mix of Country, Rap, Rock. He talked about how Willy, Waylon, Merle, Toby, Dolly,  were his biggest country influences.",
            "score": 4,
            "replies": [
                {
                    "author": "SoggeyBoxes",
                    "body": "I second this, I just saw him the other night and it was a fucking awesome show. Good band, great props and effects and the crowd loved him and he them. 100% would go again!",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "atrickofthemind",
                    "body": "Can’t ever underestimate the power of a Reddit thread to bring people out of the woodwork to hate on somebody",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "atrickofthemind",
                    "body": "Can’t ever underestimate the power of a Reddit thread to bring people out of the woodwork to hate on somebody",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Deftallica",
            "body": "My mom and brother love the guy. My mom lost her partner of about 20 years back in November and shares one of his songs frequently. “I’m Not Ok”, I think. \n\nI tried listening to a couple of tracks and the guy can sing, but it’s not my kind of music. \n\nKid Rock really isn’t either, but he had some fun songs back in his early days.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Responsible-Area-102",
            "body": "Jason DeFord has a curious career trajectory. After grinding away in the Rap circuit for decades, Jelly Roll didn’t manage to get anywhere. Once Kid Rock had pretty much cornered the market on Hick-Hop & hip hopper Nelly collaborated with country musician Tim McGraw, The Industry decided it was time for a new (sub)genre. By the time the likes of Post Malone & Elle King were all the rage, making the popularization of tattoos mainstream, Rock, Folk, & Country were nearly indistinguishable. Nathaniel Rateliff & Chris Stapleton took over Pop; Zach Williams dominated the Gospel charts, following a Johnny Cash-esque prison concert. \n\n\nThe story goes, Jelly Roll got his nickname from his mother because he liked to eat donuts after church. But this seems unlikely as most regions don't call a pastry a \"roll\" unless it's a dinner roll. (Incidentally, a jelly roll pan is a long, wide flat baking sheet with sides. It’s used for baking a shallow sponge cake. Jelly or custard is spread onto it, which holds the cake together as it’s rolled into a tight swirl. Nothing close to a hand-held pastry.) The Midwest-- especially MN, WI, IA-- take flack for referring to multiple pastries as donuts (e.g. eclairs) but the only one to occasionally get called a roll is a Bismarck, which MO considers a “jelly donut.” The term certainly isn't common in Jelly Roll's birth state of TN. \n\n\nIt's worth noting Jelly Roll Morton was a popular turn-of-the-century Creole musician who essentially invented Jazz. Ferdinand LaMothe started out playing piano in a brothel, much to the dismay of his church-going grandmother, so he adopted African-American slang for female genitalia to avoid disgracing his family name. \"Jelly Roll” Morton posthumously received 2 Grammys + a Tony + was inducted into both the Rock & Roll & Louisiana Music Halls of Fame, earned for his innovation as a musician, composer, & arranger who influenced Jazz, Ragtime, Blues, & Dixieland. BTW, a popular band in DE is suing singer Jelly Roll over use of the name. \n\n\nEarly footage of the seeming country boy Jelly Roll shows he was a “Wigger,” wearing a durag while hanging out with pals at an vacant basketball court in an urban neighborhood. Since Jelly doesn’t play any instruments, singing was his only option when it became clear he wasn’t going to make it big as a rapper. Nearly every appearance– from social media posts to award acceptance speeches– he sheds tears, “I just can’t believe I’m here! I can’t believe this is happening!” Why?? Fame was his sole ambition. Jelly may not be an industry plant in the literal sense but he was certainly catapulted to stardom by switching genres, i.e. right place right time. \n\n\nHis fame was largely aided by his wife Alyssa, a former sex worker. “Bunny XO” saw Jelly perform in Vegas; post-divorce, she pursued him & offered a place to stay. Any service industry requires charisma, or at least a knack for schmoozing, but the sex industry in particular breeds/ fosters then hones certain manipulative skills. Bunny set her sights on an overweight, broke, homeless addict with mediocre talent then gave him a home, notoriety by proxy, & helped him get full custody of his kids. Now she has a podcast, which manages to get popular musicians as guests. She & Jelly’s relationship is its own schtick: a gender-reverse Cinderella story that incorporates effective tropes, e.g. redemption arc, unfairly judged underdogs.\n\n\nAs Stand-up Comedy eclipsed traditional celebrity, YouTube channels replaced talk shows. Suddenly, movie stars & musicians were clamoring to ingratiate themselves on podcasts. Years prior, actor & shock comedian Tom Green broadcast interviews from his house, which he streamed via the burgeoning World Wide Web. Soon, comic Brian Reban convinced actor/ reality TV contest host Joe Rogan to start his own podcast. Simultaneously, Joe (then an aspiring comic), gradually took over The Comedy Store as the illness of its owner Mitzi Shore (actor Pauley Shore’s mother) progressed. Through a series of strategic maneuvers, Rogan rose to prominence as “The Godfather” of Comedy; his “Death Squad” became the gatekeepers. Joey “Coco” Diaz still brags about demanding sexual favors for open mic slots, relishing a letter sent to him by Chelsea Handler upon the success of her talk show.\n\n\nHis merry band of degenerates included Tony Hinchcliffe, who worked at The Store while writing jokes for “Roastmaster” Jeff Ross. Brian Redban produced Hinchcliffe’s “Kill Tony” podcast after getting fired by Rogan. Host Tony aimes to train & give exposure to aspiring comics by providing a platform. They have 1 minute to perform a set. Afterwards, Tony conducts a Howard Stern-inspired interview, “roasting” them by mocking low-hanging fruit with puns & alliterated superlatives. Unfortunately, Hinchcliffe has neither comedic instinct (other than playground-style insults) nor business acumen but consistency coupled with pandering to The Godfather paid off: Joe bought Tony a house & eventually his club The Mothership hosted Kill Tony. Hollow free speech rhetoric set up their Conservative political schtick as an unprecedented decline in TV networks’, movie studios’ & streaming platforms’ ratings made their respective YouTube projects look like gold. Consequently, Joe’s deal with Spotify inspired Tony to make one with Netflix.\n\n\nTrue to form, Jelly Roll glazed retired fighter-turned failed comic Brendan Shaub on the podcast he cohosted with a comic/ actor. Jelly waxed poetic about the creative process he watched unfold even tho Schaub is most famous for what was (arguably) the lowest-rated standup comedy special. Ever. Jelly made the rounds on Rogansphere podcasts, including episodes of Kill Tony, even performing at Hinchcliffe & friends’ arena show. The circlejerk of glazing led to hiring his comedian pals for a private birthday party, which included a roast. The few published pix show more forced exaggerated laughter from Jelly than from Tony Hinchcliffe, who’s known for his effusive hyperbolic praise of aspiring comics he thinks he’s mentoring to stardom (not including those already well-known for whom he’s tried to claim credit).\n\n\nKid Rock got his nickname from rap battles. Bob Ritchie’s family may have been well-off (his father owned multiple car dealerships) but neither money nor clout will make you a wordsmith. Determined to make it despite being a scrawny White boy, everyone was shocked by his talent, saying, \"This kid rocks!\" Kid Rock is a self-taught musician, capable of grabbing a random guitar & improving by composing lyrics on the fly while playing by ear. He claims he can play every instrument in his band, which has allowed him to oversee the production on most of his albums. Regardless, Kid Rock actually advised up-&-comer Marshall Matthews to enunciate. Eminem was undoubtedly skilled lyrics-wise but he needed to stop mumbling, otherwise no one would be able to understand his intricate & clever rhyme schemes. Similarly, Eminem had to prove himself by participating in rap battles. Unlike Kid Rock, he grew up poor & saw fame as a way out of poverty. However, they both made their way based on merit, not needing a gimmick.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ChronicBlueCat",
            "body": "I think of him as a “junkie Tayler Swift”, every song I’ve heard is about rehab, addiction, 12 step meetings etc.",
            "score": 10,
            "replies": []
        },
        {
            "author": "tinyj96",
            "body": "Jelly Roll Person: 👍\n\nJelly Roll Music: 👎\n\nNot for me. A bit bland and samey. But I see why people love him and I have nothing but respect for him and his story. Get that bread.",
            "score": 5,
            "replies": [
                {
                    "author": "thepoetsupstate",
                    "body": "I listened to his interview on Jay Shetty’s podcast and became a big fan of him as a person. I intentionally tried to avoid listening to his music though cause I knew I’d hate it. Unfortunately I heard one of his songs the other day and it was worse than I thought.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "SwordfishOk504",
                    "body": "You should look into the stories about why Jelly Roll Morton got his name.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "mistershifter",
            "body": "Typical culture vulture business. Couldn't make it as a rapper, so he jumped to country to cash in.",
            "score": 7,
            "replies": [
                {
                    "author": "ehtywer96",
                    "body": "Are people not allowed to be into different genres of music?",
                    "score": 36,
                    "replies": [
                        {
                            "author": "5centraise",
                            "body": "It's really no different than any job.   Your boss at the locksmith shop isn't giving you enough hours to survive?  Then go work for a different locksmith who will give you the hours you need.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "Not_a_housing_issue",
                                    "body": "That's a great take. Most musicians are truly blue collar so that makes a ton of sense.",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "hatecandie",
                                    "body": "Plus the dudes forty. I’m not a fan but good on him for finally making something for himself.",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "BeeQueenbee60",
                                    "body": "Tell that to Beyoncé.",
                                    "score": 0,
                                    "replies": []
                                },
                                {
                                    "author": "uncanny_mac",
                                    "body": "I think also people don't know how new musicains are found, you need a backing of someone with major pull to put you on TV and radio and now the internet.  It's not some \"industry plant\" mechanisam, it's the system working as intended.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "pslickhead",
                            "body": "Sure but these are two of the lowest talent, most cynical, low creativity, sub-genres available to choose from (trailer park rap and bro-country). We aren't exactly  talking about Paul Simon making an album of African music. We aren't talking about *Sneakin' Sally Through the Alley.*\n\nEdit to clarify what I thought was obvious.",
                            "score": -14,
                            "replies": [
                                {
                                    "author": "LtAldoDurden",
                                    "body": "This take is so hard to read and take seriously. There are incredibly talented rappers out there that push creative limits all the time. Being innovative isn't exclusive to the music *you* enjoy listening to. There are rock and pop acts out there who don't even break the bar of talent let alone being the pinnacle of creativity in music. \n\nThat said, agreed on country music. lmao.",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "pslickhead",
                                            "body": "I'm talking about the low bar of modern wallet chain, pick up truck, bro country, and white trailer park rap , not hip-hop and actual country music. Jelly roll is no Kendrick Lamar and you should not classify his music the same.\n\nAlso I can name off countless talented, serious, country musicians. Jelly roll isn't making that kind of music either. What he is [making is a cynical cash grab](https://www.youtube.com/watch?v=HzDCcj6v3EA) aimed at a certain audience and there is no creativity required. It is  like re-warmed leftovers of last weeks frozen tv dinners.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "holysmokesitsyou",
                                    "body": "Preach.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Zanydrop",
                                    "body": "I'm no way shape or form would I call Jelly Roll bro Country. If you don't like him, that's fine, but don't just make things up",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "pslickhead",
                                            "body": "I didn't make it up. How many CMA awards does the guy have? Like 10? He sure as shit ain't George Jones. He's catering to the bro country demo. It is not the Jason Isbell/Sturgill Simpson crowd. There is no overlap in that Venn Diagram. Most likely you and I have different definitions of bro country.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Zanydrop",
                                                    "body": "The stereotype of Bro country is upbeat song about trucks, girls in bikini tops and cutoff jeans and tailgates. Florida Georgia Line were one of the first to cement in that sound. Most Bro Country sounds similar to their hit \"Cruise\". \n\nJelly Roll is mostly slow and depressing songs. How can you think that's bro Country? What is your definition of bro Country. \n\nI like Sturgill Simpson and I like Jelly Roll. We do exist. I'll guarantee there were some Sturgill fans in the 15000 people at the concert last week.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "pslickhead",
                                                            "body": "My definition of bro country is: contrived generic pop music mixed with bad ripped off southern rock hooks, and  recorded with a twang and maybe a fiddle or steel guitar. And that's to some extent every Jelly Roll song I've heard that he wasn't \"rapping\" in. Jelly Roll just leans more towards the power ballad side of shitty Southern rock (which is also fairly common in bro-country) but its the same formula nonetheless. I will admit Jelly Roll often comes across with more of a Christian Rock vibe than the just straight  southern rock hooks in most bro-country, but that certainly isn't an improvement in my estimation.\n\nI live in a town of musicians, nearly everyone here is in the industry. I don't know any actual musicians who feel the same way about Sturgill and Jelly. While I do appreciate his success,  I just think the music is pandering and unoriginal (but admittedly I feel that way about most popular music).",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "Zanydrop",
                                                                    "body": "You are sipping on some high grade hateraide",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "pslickhead",
                                                                            "body": "I love music. I probably attend 20-30 concerts a year. I have around 24,000 artists in my home collection, but not a single track by Jelly Roll, or Struggle Jennings, or Yellawolf, or MGK. I'm glad Mr. Roll found his niche though. Some people just can't ever get enough of feeling sorry for themselves and he's there to oblige.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Zanydrop",
                                                                                    "body": "Do you also hate old school blues?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "pslickhead",
                                                                                            "body": "I've paid good money to see acts like B.B. King, Keb Mo, Taj Mahal, R.L. Burnside, Buddy Guy, Junior Kimbrough, North Mississippi Allstars, etc. And I've seen dozens of shows on Beale. You couldn't pay me to walk across the road to listen to Jelly Roll's sappy junk. My Blues collection spans from the 1920s to now. I can listen to Leadbelly all day every day. What are you calling old school? 1920s?",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Zanydrop",
                                                                                                    "body": "  Jelly Roll and old blues bands both play loads of sad songs. \n\nYou denigrate Jelly Roll for pandering to people that want to listen to sad music but seem to love old blues bands that play loads of sad songs. It seems to me you don't like recent mainstream Country or anybody associated with it and just make up reasons not to like them.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "pslickhead",
                                                                                                            "body": "I love sad songs. I'm simply unimpressed by unoriginal contrived pandering schmaltz. There are tons of recent country acts I go see. I just saw Sturgill Simpson and Orville Peck last Summer. Orville can slay with a sad cowboy ballad, but he's no ***one trick pony***.\n\nYeah, it seems  the more mainstream music is, the more it sucks in general but there are plenty of exceptions to that. I mean, for every Ace of Base there is a Prince. For every Eagles there is a CCR.",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "criticalmonsterparty",
                            "body": "Selling out is the word you're looking for. Jelly Roll, Taylor Swfit, and Beyonce are in the club.",
                            "score": -3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "mywifesknight",
            "body": "Kid Rock was Jelly Roll before Jelly Roll was cool.",
            "score": 4,
            "replies": []
        },
        {
            "author": "napstablooky089",
            "body": "The difference between Jelly Roll and Kid Rock is that people like Jelly Roll",
            "score": 4,
            "replies": []
        },
        {
            "author": "sagerideout",
            "body": "never gonna hate on someone for doing music they’re passionate about, even if it means changing genres. that being said, there’s a difference between just loving music and pursuing fame and money through music. I agree with your assessment.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TryingTris",
            "body": "Ha I read this and thought you were comparing Jelly Roll Morton in the 1920s with Kid Rock in the 2020s and was hella confused for a bit.",
            "score": 3,
            "replies": [
                {
                    "author": "mcnutty96",
                    "body": "Me too!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "solidprospect",
            "body": "I liked jellyrolls 10 minute freestyle, his old school days. Now I barely listen to him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Robinkc1",
            "body": "I dislike Kid Rock as a human being and don’t really have any animosity towards Jelly Roll. His music is awful though.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Radio_Ethiopia",
            "body": "He the hillbilly Adele",
            "score": 1,
            "replies": []
        },
        {
            "author": "Steve_Dankerson",
            "body": "Hahaha",
            "score": 1,
            "replies": []
        },
        {
            "author": "imwinmylane",
            "body": "Best thing i ever heard was...jelly roll is just Adele for dudes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheGreatGouki",
            "body": "Yes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "criticalmonsterparty",
            "body": "I saw Jello Roll perform in front of under 30 juggalos in Georgia. I am happy for his success, but he's a long way from the person he used to claim he was.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Delta632",
            "body": "That video of him eating boogers made me lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Capt-Crap1corn",
            "body": "He can sing and rap well. Kid Rock is just mid.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Friggin_Grease",
            "body": "Not at all, Kid Rock had some but metal bangers.",
            "score": 1,
            "replies": []
        },
        {
            "author": "3_Libras_",
            "body": "He's a booger eater. Google it. You'll gag.",
            "score": 1,
            "replies": []
        },
        {
            "author": "purpdrank2",
            "body": "I mean they’ve followed a somewhat similar path musically. Started in rap then moved to a rock/country sound. The biggest difference to me is it doesn’t seem like Jelly Roll is trend hopping like Kid Rock has done. Kid Rock left rap to chase nu metal because it was popular and would get him more money and once that died out he tried chasing country because he thought it would make him more money. Kid Rock also seems to be a talentless hack that relies on the music of others to make his stuff listenable, I mean one of his biggest songs is just his shitty lyrics over Sad But True’s music. He did the same thing with Alice In Chains and Warren Zevon. Jelly Roll may not be the most talented artist, but at least his music comes from an honest place even if it is the same thing over and over again.",
            "score": 1,
            "replies": [
                {
                    "author": "OMTH",
                    "body": "Add Sugar Hill Gang's Rapper's Delight to the list as well.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Gonzostewie",
            "body": "I read somewhere on Reddit that Jelly Roll is Post Malone for the forklift certified people.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Interesting-City118",
            "body": "No, jelly roll at least seems like a genuine guy, even if his music is pandering.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TelepathicFrog",
            "body": "\"Grifted to country\" is such a stupid way to put it. He made music than people liked and paid for. How is that a grift?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Switchgamer1970",
            "body": "I am a big fan of his.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dr_Parkinglot",
            "body": "Jelly Roll is 2020s Uncle Kracker",
            "score": 1,
            "replies": []
        },
        {
            "author": "CombatGoose",
            "body": "Someone I know is selling two tickets to his show here for $910.\n\nThat shits wild. I don’t know what band I’d pay nearly $500 a ticket to see…maybe someone like daft punk.",
            "score": 1,
            "replies": []
        },
        {
            "author": "westward_man",
            "body": "What do you mean by \"grifted to country.\" What's the grift, exactly?",
            "score": 1,
            "replies": []
        },
        {
            "author": "beadyeyes123456",
            "body": "I think the guy is more real and relatable than Bob Richie is.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Steadydippn",
            "body": "I liked his raps more.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Violent_professional",
            "body": "Nah, MGK is the 2020s kid rock.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Inner-Complaint-8957",
            "body": "I feel whatever criticism I spew here is good to look non-validating of other people’s struggle…. soooooo… super voice man… super voice…",
            "score": 1,
            "replies": []
        },
        {
            "author": "PasstheJugg",
            "body": "Not even close buddy",
            "score": 1,
            "replies": []
        },
        {
            "author": "jaredthegeek",
            "body": "He is Adele for the country set.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Next-Car-7265",
            "body": "Not a fan of Jelly Belly Roll",
            "score": 1,
            "replies": []
        },
        {
            "author": "DoinDonuts",
            "body": "Jelly Roll is country for people who prefer rock",
            "score": 1,
            "replies": []
        },
        {
            "author": "yeksnyls",
            "body": "Fat Florida George Line",
            "score": 1,
            "replies": []
        },
        {
            "author": "brintoul",
            "body": "Eh, I gave him a listen.  Didn’t do it for me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CarlosDanger3000",
            "body": "jelly roll is fuckin corn ball",
            "score": 1,
            "replies": []
        },
        {
            "author": "kelsobjammin",
            "body": "Drake started out here\n\n![gif](giphy|MQq6vRv0T0xjO)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hot-Issue7922",
            "body": "I used to be a fan till I heard his songs a few times and got into the lyrics, I like the tone and rhythm but most of his \"country\" is the same recipe on repeat, once you've heard one you get the jest of the rest without listening to the same song on repeat",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jlx_27",
            "body": "Yeah he is.",
            "score": 1,
            "replies": []
        },
        {
            "author": "skot2k6",
            "body": "Ive never been a country guy except garth brooks and while i do love rap I only listen to certain rappers but man i hate the country rap stuff that's big nowadays. I know people like my dad and all his racist old hillbilly friends who hated rap, thought it was the worst kid of music, or just country fans in general hated rap, but now this good awful country rap came out and their all acting like THIS is what good rap sounds like, its disgusting- although just like in any genre there is some decent songs out there. It just shows the true colors of these people",
            "score": 1,
            "replies": []
        },
        {
            "author": "StatementOk8940",
            "body": "Hey show some respect.  He’s relatable to a lot of people in the South/Midwest because he’s fat, dumb and loves God and shit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JAFO2WCT",
            "body": "If Kid Rock sucked when he came out.  Kid rock now yeah they both suck balls.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LuminalAstec",
            "body": "I've only ever heard positive things about him, and the songs I know are all his collaborations, which are fun.\n\nSeems like a good dude.",
            "score": 1,
            "replies": []
        },
        {
            "author": "red_beered",
            "body": "Yes, but sanitized",
            "score": 1,
            "replies": []
        },
        {
            "author": "ASoulUnAtEase",
            "body": "I heard he did great this weekend in Regina and Saskatoon, Saskatchewan, Canada. 500 bucks a ticket. He seems like a nice dude, so good for him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BoulevardTrash",
            "body": "Jelly Roll is Adele for fork lift operators.",
            "score": 1,
            "replies": []
        },
        {
            "author": "boostermoongazer",
            "body": "He gives hope to those who NEED hope.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dwt77",
            "body": "He seems like an ok person, honestly. I just find the music to be a little formulaic to cater to pop country fans that want a little thump with their twang. It is just pop country hip hop basically. Hick hop. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "CrunchMcMannis",
            "body": "Pretty sure Jelly Roll-Teddy Swims-Rag N Bone Man are the same guy, no?",
            "score": 1,
            "replies": []
        },
        {
            "author": "PM_ME_YOUR_COBBLER",
            "body": "I feel like you could catch gonorrhea from a Kid Rock handshake even. Not so much Jelly Roll.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FranksGun",
            "body": "Meh. Say what you want about kid Rock but Devil without a Cause was a badass album. I can’t listen to jelly roll’s overly serious and preachy fucking music, but I’m sure a lot of people relate to it",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bitter-Novel-4966",
            "body": "Industry plant for right wing dooshes",
            "score": 1,
            "replies": []
        },
        {
            "author": "epfourteen",
            "body": "Does Reddit like anything ?",
            "score": 1,
            "replies": []
        },
        {
            "author": "MixingCKC",
            "body": "Former drug dealer, so no",
            "score": 1,
            "replies": []
        },
        {
            "author": "KILL-LUSTIG",
            "body": "in 2025 people are utterly stupid and have terrible taste so the popularity of jelly roll is not that surprising",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rydizzle234",
            "body": "C’mon the guy is such a joke. Watch the documentary about him on Hulu. He doesn’t write his own songs and can’t even play basic chords on guitar. I’m aware that it’s not unheard of for a pop/country star to be famous only for their voice… but when you’re not even writing your own lyrics what are you really doing lol? Especially when it’s all supposed to be “from the heart” like he tries to portray. Silly",
            "score": 1,
            "replies": []
        },
        {
            "author": "Otherwise-Toe-9022",
            "body": "Jelly roll is fat, kid rock is a piece of shit..  not the same",
            "score": 1,
            "replies": []
        },
        {
            "author": "RADIOS-ROAD",
            "body": "I have respect for him as a person. He seems nice but I can't stand his music..he's super pop and accessible for...middle aged women and guys I guess.",
            "score": 1,
            "replies": []
        },
        {
            "author": "yawners87",
            "body": "I’ve only met one person who said Jelly Roll was their favorite artist, and that person is almost the most drama-seeking, narcissistic fuckhead with a victim complex I’ve ever met.\n\nAnytime he comes on the radio, I switch the station.",
            "score": 1,
            "replies": []
        },
        {
            "author": "slobschaub126",
            "body": "His 15 mins are almost up. That fat, tatted, lost soul on the path to rightousness is getting played out. Need actual talent behind the marketing to make it last. Good for him capitalizing on it all while the iron was hot.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hefty_Stress6299",
            "body": "Is he not country rap? Or is it not cool still to claim that? Sounds like rap influences to me. But hey! Get ya bag jelly lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dangerous_Prize_4545",
            "body": "I feel like Kid Rock was, and is, more authentic.\n\n\nNot to say Jelly Roll isn't singing his truth, but he just seems to go and do whatever is popular. Like JR is going to tell you what he thinks you want to hear. KR is going to tell you what he thinks.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThornburysFinest",
            "body": "Yes",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mojo_Jensen",
            "body": "Seems like a nice guy but I’ll be damned if his music isn’t absolute ass. I’m sorry, it’s just an opinion, but… COUNTRY ROADS? JUST COVER THE SONG. Don’t pretend it’s a NEW one. Makes me want to stab my ears with a no 2 pencil. Also that guy that just did ‘Rebel Rebel?’ What the fuck, country? Your genre used to have songwriters. Like, some of the best. What happened!?",
            "score": 1,
            "replies": []
        },
        {
            "author": "YesNotKnow123",
            "body": "Yes! Never thought it this way but makes so much sense.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jstohler",
            "body": "He was on Smartless and detailed how every artist should outsmart their label, so he’ll always get credit from me for that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WickedFox1o1",
            "body": "Ugh he showed up at the last 2 Rock Fests near me and he was awful both times. I don't even know why he was there nothing about his set was Rock, it was mostly just annoying especially his awful version of Lose Yourself he tried to do.",
            "score": 1,
            "replies": []
        },
        {
            "author": "notmypretzeldent",
            "body": "Yeah, they just recycle shit in pop culture... listen  to punk rock",
            "score": 1,
            "replies": []
        },
        {
            "author": "sparkybc",
            "body": "His music is boring as F",
            "score": 1,
            "replies": []
        },
        {
            "author": "PocketNicks",
            "body": "Oh, he's actually a musician? He was on an episode of Tulsa King and I had no clue who he was. He said he was a janitor in the show, but he was playing himself.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Drumming_Dreaming",
            "body": "My girlfriend’s mom loves Jelly Roll. My mom loves Jelly Roll. That says it all.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AVBforPrez",
            "body": "Jelly Roll is like modern Kid Rock, except that he never actually had an iconic song that people partied to.\n\nAt least Kid Rock understood that he was surface level when he was on the radio in the 90s.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CaptainOhMyCaptain1",
            "body": "Jelly Roll is kind of like Adele for those with forklift certification.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KazViolin",
            "body": "Everytime I see \"Jelly Roll\" I think of Jelly Roll Morton, the jazz pianist and get so confused.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rabidsalvation",
            "body": "Therapeutic Music Vols 1-4 are certified bangers!\n\nAin't it funny how the nights are so long...",
            "score": 1,
            "replies": []
        },
        {
            "author": "severityonline",
            "body": "I went to school to learn how the music industry works. When i graduated I realized I hate the way the music industry works.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sad_Tie3706",
            "body": "Dont care for either",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mellow_j",
            "body": "He's a cool dude. You gotta know Antioch to know where he's coming from and why he did what he did. You're on the outside looking in bit glad he made it out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rudymalmquist",
            "body": "What’s a ‘trail park rapper’?",
            "score": 1,
            "replies": []
        },
        {
            "author": "grumpywarner",
            "body": "I can't stand him. He sounds so generic and boring.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CandySniffer666",
            "body": "I'm not American, so I think I'm just innately unable to understand what Jelly Roll even is. All I know is that he's hideously ugly and somehow has a babe wife with incredible fake titties. Everything I've heard of his music makes me think his fans are 99% those grown women who post \"so sick of all the drama\" everywhere on their social media and the dudes who simp for them and then become alcoholics due to the trauma these women leave them with after they dump them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GeezerRocker",
            "body": "Yep…..he is a channel changer. Whenever I see his rotund face on the tube, next station. This dude ain’t country…..period. I put him there with T. Swift….not much talent, just heavily marketed to a fault. If anyone wants to hear about rough beginnings for country artists that DO have talent, check out Patsy Cline, Carl Perkins, Roy Orbison ( OK, not actually country )for starters. J-roll is just a flash in the pan…..many more upcoming artists that are better than him that deserve a break for the big time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GeezerRocker",
            "body": "Yep…..he is a channel changer. Whenever I see his rotund face on the tube, next station. This dude ain’t country…..period. I put him there with T. Swift….not much talent, just heavily marketed to a fault. If anyone wants to hear about rough beginnings for country artists that DO have talent, check out Patsy Cline, Carl Perkins, Roy Orbison ( OK, not actually country )for starters. J-roll is just a flash in the pan…..many more upcoming artists that are better than him that deserve a break for the big time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Feodar_protar",
            "body": "He seems like a good dude I just can’t get over how simple his lyrics are. The lyrics to i am not okay are like the I’m 14 and this is deep subreddit in a song.",
            "score": 1,
            "replies": []
        },
        {
            "author": "presidentchasteen",
            "body": "jelly roll has more aura but worse music",
            "score": 1,
            "replies": []
        },
        {
            "author": "Silver_BackYWG",
            "body": "Worse",
            "score": 1,
            "replies": []
        },
        {
            "author": "dim10dimes",
            "body": "I'd say he's more devious than kid rock.  Yes kid rock has been quite the POS lately showing how trashy he is and some people love it and some people hate it.  \n\nHowever kid rock didn't have social media his entire career.  There was no \"look at me doing good things\" caught on camera like there is with jelly roll.   I think the personal and extra spotlighting makes it easier for someone like jelly roll to get away with fucking up.\n\nNever meet your heroes kids.  By the end of the day they're human and so are you.  Every single one of us holds something dark.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FuckingColdInCanada",
            "body": "The people who go to Jelly Roll shows would indicate that he is indeed new Kid Rock.",
            "score": 1,
            "replies": []
        },
        {
            "author": "davasaur",
            "body": "Jelly Roll is a self-made success.  Kid Rock is poser.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MeeekSauce",
            "body": "Country music is easy to do, and easy to do well. Are we really shocked that a bunch of okay-at-best musicians turn to country and become stars. It’s straight up lowest common denominator stuff. It’s like a bad sitcom, or republicans, two things I imagine country music fans like in droves, too.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheStonedBro",
            "body": "[this banger came out 15 years ago](https://youtu.be/LMKsY4wzoxY?si=11tRCpGRDP-F6a3O)",
            "score": 1,
            "replies": []
        },
        {
            "author": "430Richard",
            "body": "Kinda like how Beyoncé has grifted to “country” in her declining years.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Computermaster",
            "body": "Does Jelly Roll have a song about being a pedophile?",
            "score": 1,
            "replies": []
        },
        {
            "author": "inca_t",
            "body": "His wife is insufferable and he himself has gotten a huge ego over his success. I didn't mind him at first but I roll my eyes every time I come across a clip of him saying he \"came from nothing\" now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rzKong",
            "body": "Jelly Roll is a good human being, kid rock seems like a piece of shit.\n\nNot a huge fan of either of there music but I’ve read tons of stories of how good a dude he is and even met a photographer that worked with him at a festival multiple times where I live. Said he’s the best/musician celebrity he’s dealt with.",
            "score": 1,
            "replies": []
        },
        {
            "author": "yungoldmane",
            "body": "Embarrassingly enough I perused Facebook match for a time. During that time, it seemed like almost every woman whose profile I looked at touted their love for Jelly Roll or had one or more of his songs on the music section of their profile. Idk what he’s famous for but the fact that seemed to happen out of nowhere lets me know he’s got the machine solidly behind him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cordiecat8",
            "body": "His SNL 50 performance of Johnny Cash covers was abysmal.",
            "score": 1,
            "replies": []
        },
        {
            "author": "EchoPhi",
            "body": "Rebranding is not a grift. I personally think he (Jelly Roll) sucks. \n\nYelawolf and Jelly Roll are not the same person. Does no one do their homework any more? Sheesh.",
            "score": 1,
            "replies": [
                {
                    "author": "ShoedJoeJackson",
                    "body": "He was apart of Yelawolf’s Slumerican thing for a few years and was touring with him. They have the same tattoo, redemption vibes. Sheesh.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "EchoPhi",
                            "body": "The way you worded that made it sound like he was yw. I see what you're going for now.\n\nSmelly Hole still sucks.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "GordonsAlive5833",
            "body": "What the fuck is Jelly Roll?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sparky265",
            "body": "I heard a comedian say Jelly Roll is Taylor Swift music for guys that drive forklifts.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JessiMessi1980",
            "body": "I’m not a fan 🫣",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tex_Arizona",
            "body": "Jelly Roll? 2020s? I think you mean the 1920s... He was a legendary musician for his era though.\n\nhttps://youtu.be/Rnu8RFyx70k?si=-TYuB1UA8Xr_wc94",
            "score": 1,
            "replies": []
        },
        {
            "author": "Vic_Gatsby",
            "body": "Most white entertainers who start out in a predominantly black genre wind up crossing over to a more white genre. Vanilla Ice, Pink, Post Malone, Kid Rock, etc even Miley Cyrus was hanging with rappers and getting rap features. They're called culture vultures.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PoorlyTimedKanye",
            "body": "He's someone I respect for being a Christian that actually walks his faith. Giving to less fortunate, plays for prisoners and donates food, shelter shows, etc etc.\n\nI could not give less of a fuck about his music, and EVERY song is about getting over addiction. If you can't have a single conversation without referencing God it gets boring.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dukes_Up",
            "body": "He never was a trailer park rapper. He was all about drug dealing and that was very real. Also he didn’t “try” to be a rapper, he was very successful. Put out many albums, toured the world, and built an organic fan base. No reason to hate on him just because you are ignorant to his career.",
            "score": -1,
            "replies": [
                {
                    "author": "criticalmonsterparty",
                    "body": "\"He never was a trailer park rapper.\"\n\nHis time among the juggalos says otherwise.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Dukes_Up",
                            "body": "He performed at their festival. Ice Cube performed there too lol, I guess he’s just a trailer park rapper too. Way to box people in.",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "criticalmonsterparty",
                                    "body": "I wasn't thinking of the Gathering. I saw Jelly Roll long before then, performing for juggalos in towns so small everyone was related. He was doing Juggalo fan events just to get his reps in as a performer. Caught him 2-3 times doing his thing with a bunch of other people who had no where near his success. Can't say I thought much of him then, just another act on the card. Dude is a million years away from that time in his life, but I assure you, the audiences he was playing to back then were of the meth and trailer park lifestyle variety. A guy I met at one of those shows he was at died like 2 months later of a meth overdose. RIP Charlie, I hope you're at peace.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AintASaintLouis",
                    "body": "Lots of other reasons to hate on him though",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok-Boysenberry-3361",
            "body": "No.",
            "score": 1,
            "replies": []
        },
        {
            "author": "hsh1976",
            "body": "I think I read here that Jellyroll was Carrie Underwood for divorced dads",
            "score": 1,
            "replies": []
        },
        {
            "author": "FalseAdagio2",
            "body": "FWIW i went to a jelly roll concert having no idea who he was. It was so genuine, and he was so talented, it’s among the best concerts ive ever been to. If it’s a “grift to country” it’s a hell of a grift",
            "score": 1,
            "replies": []
        },
        {
            "author": "flowersnifferrr",
            "body": "Jelly Roll is a faux authentic panderer, like everybody else in Nashville. He and whoever else is the soon forgotten country mega star of the now are another disposable piece of boardroom calculations. He's exactly like Kid Rock, so is Post Malone and seemingly MGK now with that stupid Lonely Road song.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -9,
            "replies": [
                {
                    "author": "notprocrastinatingok",
                    "body": "lol when I first heard of Jelly Roll and I saw what he looked like my first thought was \"wow he's Temu Post Malone\"",
                    "score": 4,
                    "replies": [
                        {
                            "author": "ShoedJoeJackson",
                            "body": "Shiiit Post Malone might be a better comp especially with the tats",
                            "score": -7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "gotoline10",
            "body": "Homeboy needs a stylist, his train wreck appearance and the jesus shit keep him off my spotify.",
            "score": 0,
            "replies": []
        },
        {
            "author": "watadoo",
            "body": "And who’s that country kind of guy with the tattoos all over his hands, his face, forehead with gold teeth and everything. I was at Safeway and saw a poster board for him shilling for Oreo cookies it was ridiculous.",
            "score": 0,
            "replies": [
                {
                    "author": "ShoedJoeJackson",
                    "body": "That’s jelly roll lol",
                    "score": 1,
                    "replies": [
                        {
                            "author": "watadoo",
                            "body": "No, not Jelly Roll. I looked it up on Google images. its that guy, Post Malone.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "nachodorito",
            "body": "Jelly Roll is lowest common denominator music for people who don't know shit about music other than whatever audible diarrhea is on the radio. Complete and total trash",
            "score": -2,
            "replies": []
        },
        {
            "author": "Justfukinggoogleit",
            "body": "Dude is a sellout... rather plug fire relief for california than lift a finger to help people from his own backyard... that was the end of it for me.",
            "score": -3,
            "replies": []
        },
        {
            "author": "DIRTYANDSTINKING",
            "body": "Yes. They all fucking are.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Pantone802",
            "body": "Yes. ",
            "score": 0,
            "replies": []
        },
        {
            "author": "superslab",
            "body": "Yes, but musically even worse somehow. It could get better. Kid could too. Nah, just kidding.",
            "score": 0,
            "replies": []
        },
        {
            "author": "sumgailive",
            "body": "Kid Rock is living off some actual bangers he wrote 20 years ago. Grifting right wing dumbasses \n\nJelly roll is riding some kind of make a wish fame off some of the most dog shit basic bitch lyrics that I’ve ever wasted 5 min listening to.\n\nSo I think\nMuch different just my opinion",
            "score": 0,
            "replies": []
        },
        {
            "author": "catheterhero",
            "body": "Bubba Sparks",
            "score": 0,
            "replies": []
        },
        {
            "author": "4ringwraithRS",
            "body": "Now that you mention it……..yeah",
            "score": 0,
            "replies": []
        },
        {
            "author": "waxwayne",
            "body": "No, Kid Rock had more range.",
            "score": 0,
            "replies": []
        },
        {
            "author": "far-fignoogin",
            "body": "His sound evolved and it eventually found an audience when the time was right. The fact that you consider his success to be a failure is astounding.",
            "score": 0,
            "replies": []
        },
        {
            "author": "n0nn3rz",
            "body": "You're delusional kid.. he's a banging rapper and rapped in the underground and happened to record a ballad during covid and it popped off.. he did grow up poor ASF.. incarcerated ASF.. he's the nicest person you will ever meet .. I miss his 20 dollar concerts and chilling before the show.. how come no one is coming after Beyonce or post Malone? Kid Rock is a has been bigot.. jellyroll has a place in the underground forever. 🤔",
            "score": 0,
            "replies": []
        },
        {
            "author": "BenTramer",
            "body": "I feel like eating a jelly donut.",
            "score": -2,
            "replies": []
        },
        {
            "author": "ParcelPosted",
            "body": "Yes.",
            "score": -2,
            "replies": [
                {
                    "author": "Zanydrop",
                    "body": "I don't see the comparison, one wrote Rock songs with a drop of country. Another started with hip hop rap country hybrid and has moved to country with a bit of Rock with super depressing lyrics.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "IM_HIGH_CAPTAIN",
            "body": "He had a good story at first then he bought into the right wing grift and that was the end of anything for me.",
            "score": -1,
            "replies": []
        },
        {
            "author": "kryppla",
            "body": "Only difference is that jelly roll can actually sing",
            "score": -1,
            "replies": []
        },
        {
            "author": "Ok-Metal-4719",
            "body": "Na. Kid Rock is fun and puts on a great show.",
            "score": -5,
            "replies": []
        }
    ]
}