{
    "title": "Alice Cooper wants Iron Maiden to be inducted into Rock & Roll Hall Of Fame: \"They have their own army out there\"",
    "author": "heavysk",
    "subreddit": "Music",
    "rank": 12,
    "score": 2222,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 153,
    "url": "https://www.nme.com/news/music/alice-cooper-wants-iron-maiden-to-be-inducted-into-rock-roll-hall-of-fame-they-have-their-own-army-out-there-3846918",
    "id": "1jdk9ap",
    "selftext": "",
    "comments": [
        {
            "author": "VampireHunterAlex",
            "body": "Any rock band that’s still selling out arena tours nearly 50 years in and hasn’t been inducted is proof all you need how out of touch the Hall of Fame is.",
            "score": 739,
            "replies": [
                {
                    "author": "officerliger",
                    "body": "Not just arenas either, Maiden is a *stadium* act in some parts of the world, not to mention headlining festivals with 100,000+ attendees\n\nMetallica might be the only metal band that's been more financially successful at the box office. Black Sabbath is a bigger name but their actual touring was few and far between while Maiden never seems to go off the road.",
                    "score": 183,
                    "replies": [
                        {
                            "author": "blarges",
                            "body": "They’re a stadium act up here in Canada! I’ve been to the last three, and they were as good as the ones I saw in the 1980s!",
                            "score": 44,
                            "replies": [
                                {
                                    "author": "monsterosity",
                                    "body": "They are the only band I will drive 8 hours to see",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "meshan",
                                            "body": "I'm flying to Finland in June to see IM with a buddy",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "ClubMeSoftly",
                                                    "body": "I'm flying to Europe to see five shows, finishing with Helsinki. \n\nI tell ya, it was a challenge getting tickets, but I wasn't worried for a second.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "meshan",
                                                            "body": "Tickets paid, flights paid. Just hotel to book for me and the buddy. \n\nOutdoors in June, in Helsinki, this will be pretty good. \nSeen IM a few times at the O2 in London.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "ZombieJesus1987",
                                    "body": "I saw them in 2019 and in 2008, both shows were amazing, the 2019 one might have been the best concert I had ever been to.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "blarges",
                                            "body": "2019, The Legacy of the Beast was truly epic! One of the best shows I’ve seen in 40+ years! Bruce was at his best, the band were amazing as usual, and the stage show was epic! I’d watch Maiden on a small stage with nothing but a sheet at the back proclaiming their name and have a blast, but the effort they’re putting in after 50 years is monumental!",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "falloutisacoolseries",
                            "body": "Sabbath were also limited in their touring from the criminal records of Ozzy and Tony, it's why golden era Sabbath never toured Japan.",
                            "score": 13,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "notprocrastinatingok",
                    "body": "Not only that, their last studio album was amazing! These guys are in their 60s and still got it\n\nOh and it charted #3 in the US behind only Drake and Kanye. So Maiden is still extremely relevant",
                    "score": 87,
                    "replies": [
                        {
                            "author": "Caranesus",
                            "body": "Maiden still putting out bangers and charting that high says everything.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "ZombieJesus1987",
                            "body": "Their last several records have been amazing.\n\nHonestly the only album since their reunion that kind of fell flat with me was Dance of Death, and even then that album still has a few of my favourite Iron Maiden songs (Dance of Death, New Frontier, Paschendale, Face in the Sand and Journeyman)",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "deathbymoshpit",
                                    "body": "I love that the metric for a 'not so great' album s only 5 songs you like\n\nPersonally my least fave was Final Frontier.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ZombieJesus1987",
                                            "body": "It has the highest of highs and the lowest of lows. The songs I didn't like, I *really* didn't like. Wildest Dreams, Rainmaker and No More Lies are three of my least favourite Maiden songs and that's what the album starts out with. Album really doesn't pick up until track 5, Dance of Death.\n\nFinal Frontier I originally didn't care for, that intro threw me off bigtime.\n\nBut now it's turned into one of my favourite post-reunion albums",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Br1t1shNerd",
                            "body": "I wouldn't quite go that far. I thought it was pretty sub standard tbh. You don't need three ten minute songs each with a two minute acoustic bass intro",
                            "score": -8,
                            "replies": [
                                {
                                    "author": "redbananass",
                                    "body": "Yeah it was fine. It was no X Factor, but it wasn’t Number of the Beast or Dance of Death either. But probably closer to X Factor.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "Br1t1shNerd",
                                            "body": "Yeah I agree with that. I saw a video with their producer a few years ago and he was like \"yeah I just let them do their thing\" and I remember also seeing motorheads producer being like \"I tell them to do it again better\"",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "ZombieJesus1987",
                                                    "body": "I think that was for A Matter of Life and Death. I remember that album came with a \"Making of\" dvd, and for that album it was more stripped down and raw. A lot of Bruce's vocals were done in one take, because that's what the producer was looking for. I remember seeing a clip of Bruce wanting to do another take for a song because he knew he could do it better, and the producer refusing.\n\nThat album ended up being one of my favourite Iron Maiden albums.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Br1t1shNerd",
                                                            "body": "Ah I think MOLOD is mid",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "ZombieJesus1987",
                                                                    "body": "To each their own. Everyone worships Killers but I think that one was mid.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Br1t1shNerd",
                                                                            "body": "Ah fairs. I think killers is pretty good. Powerslave is my favourite, which is yours?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "ZombieJesus1987",
                                                                                    "body": "My top 5 are Powerslave, Piece of Mind, Seventh Son, Brave New World and AMOLAD. Any one of those are my favourite depending on my mood that day.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Br1t1shNerd",
                                                                                            "body": "Good picks.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Cadenca",
                                            "body": "Disagree! Album was damn good",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "ZombieJesus1987",
                                            "body": "Here's a hot take coming.\n\nI think X Factor is a better album than Fear of the Dark and No Prayer for the Dying.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "redbananass",
                                                    "body": "If Bruce had been singing, maybe. But I just don’t care for Blazes voice in Iron Maiden. \n\nBruce’s live versions of songs like Sign of the Cross are pretty badass.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "ZombieJesus1987",
                                                            "body": "Yeah that's fair enough! I'm happy I got to see Bruce sing Sign of the Cross and The Clansman live when I saw them in 2019.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "NorthStarZero",
                    "body": "I have a friend who attends pretty much every concert. \n\nRed Shovel Guy.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "The_River_Is_Still",
                    "body": "While I agree, it's still just cool to see a band/artist you love get in imo",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "MrFishownertwo",
                    "body": "number of the beast alone should get you in lol",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 180,
            "replies": [
                {
                    "author": "lxgrf",
                    "body": "Because the Rock and Roll Hall of Fame is a joke. And this really just underlines it, a *Rock and Roll* Hall of Fame that has been open for 42 years and never inducted Iron Maiden is not a Rock and Roll Hall of Fame that's worth being inducted into.",
                    "score": 429,
                    "replies": [
                        {
                            "author": "HowieFeltersnitz",
                            "body": "Same as the Hockey Hall of Fame. The selection process for inductees is very political and sometimes it comes down to personal relationships with the organizers moreso than the contributions of any of the individuals.",
                            "score": 47,
                            "replies": [
                                {
                                    "author": "austerblitz",
                                    "body": "Smh iron maiden isn't in either one.",
                                    "score": 37,
                                    "replies": []
                                },
                                {
                                    "author": "falloutisacoolseries",
                                    "body": "Alexander Mogilny has entered the chat",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "randeylahey",
                                            "body": "Utter bull shit he's in not in there",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Samtoast",
                            "body": "Maybe they've (the rock and roll hall of fame people) never heard the Rock in Rio album.  /s",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "IAmNotScottBakula",
                    "body": "They have always had issues with metal bands. Even Black Sabbath was indicted more than a decade after they became eligible.",
                    "score": 62,
                    "replies": []
                },
                {
                    "author": "Nobodygrotesque",
                    "body": "Literally my first thought when I read the headline.",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "SouthTippBass",
                    "body": "I think you're supposed to pay to be inducted. So Iron Maiden told them to fuck off. Its not important to them.",
                    "score": 28,
                    "replies": [
                        {
                            "author": "idkalan",
                            "body": "They don't have to pay for in that sense, but they do have to be well liked by the industry executives and previous inductees.\n\n\nThe RnRHoF has stated that they voting comes down to a select committee of previous inductees and executives  that each have 1 vote, and the fan vote counts as 1 vote. \n\n\nSo Iron Maiden has been favored by the fans but not by previous inductees and execs.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "ZombieJesus1987",
                                    "body": "Yeah, Iron Maiden became as huge as they are because of the fans, and not from airplay. If radio stations ever play Iron Maiden songs, it's either Number of the Beast, Run To The Hills, The Trooper or Can I Play With Madness.\n\nAt least the radio stations in my area anyways",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "FolsomPrisonHues",
                    "body": "Fuckin' Ozzy is on life support getting wheeled out in front of crowds and has his spot in the HoF. Knobs, the lot of 'em",
                    "score": 20,
                    "replies": [
                        {
                            "author": "XeLLoTAth777",
                            "body": "Delightfully UK of you to say :)",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "deadpoolfool400",
                    "body": "Because they don’t want to be",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "FeetballFan",
                    "body": "Because you have to pay to be inducted.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "terrell_owens",
            "body": "They aren’t? What a clown show",
            "score": 161,
            "replies": [
                {
                    "author": "TheyCallMeMrMaybe",
                    "body": "It took Judas Priest over 50 years to get in, and they didn't include Richie Faulkner (KK Downing's replacement) despite being on (now) 3 incredible Priest albums or Tim Owens for being there when Rob left. But because they weren't part of \"the classics,\" the institution denied him.\n\nThen what about Dave Mustaine? He was in Metallica during their formative years and has songwriting credits on their first 2 albums because they used some of his riffs. Why was he snubbed? Oh, because he didn't actually record on them so it was a technicality? Oh, and Metallica got inducted a full 13 years before Judas Priest. \n\nThe Rock and Roll Hall of Fame is a huge joke.",
                    "score": 82,
                    "replies": [
                        {
                            "author": "Dorf_",
                            "body": "Now that you mention it Mustaine should be in for Megadeth alone. Influential as anyone and still playing big venues the world over",
                            "score": 41,
                            "replies": [
                                {
                                    "author": "TheyCallMeMrMaybe",
                                    "body": "Imagine the stage required for Megadeth's induction 💀💀💀. David Ellefson, Chris Poland, Jeff Young, Chuck Behler, Marty Friedman, Jimmy DeGrasso, Al Pitrelli, the Drover brothers, Chris Broderick, Chris Adler, Kiko Loureiro. Not even including the *current* lineup of James LoMenzo, Teemu Mantysaari, and Dirk Verbeuren \n\nMost of which are alumni Dave doesn't even want to bother with. (Especially Dave Ellefson, Jeff Young, and Chris Poland).",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "hoyton",
                                            "body": "I got one of Kiko's guitar picks when they came through here! It's amazing how many amazing musicians Megadeth has had over the years.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ssort",
                            "body": "Now dont get me wrong, I love Judas Priest, but them being in before Maiden is insane. Maiden beats them in almost every aspect I can think of, album sales, top 10 hits, highest charting hits, number of albums, touring success, radio airplay, just everything, and it's not even close.\n\nReally when it comes to classic rock, I can only see like Black Sabbath, Led Zeppelin, Beetles, The Rolling Stones, Pink Floyd, Journey, ACDC and maybe like 3 or 4 others AT BEST that deserves to go in before Iron Maiden and a few of them are debatable on if they should actually go in before them (last two i mentioned), but no more than that as they have been just as long as most of them, and have kept a steady following all along and are still charting today.\n\nThe hall is not worth the name, if it's this stupid.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "TheyCallMeMrMaybe",
                                    "body": "Maiden vs. Priest tribalism aside (I love them both), my point's proven by the fact Metallica got in the HOF way before either of them. And Metallica's music peaked in the 80s and the band's music hasn't been at the same level of heavy since the Black album (some will argue even before that). Priest is still making amazing music. Maiden is still making amazing music. Hell, *Megadeth*, despite Dave's voice getting worse with age, is still putting out fantastic heavy metal music. Dystopia & TSTDATD are up there with their classics as some of their best.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ssort",
                                            "body": "Well Metallica was a way bigger band than both, as much as I love Maiden, I can easily admit Metallica was  known more and charted more, so I can accept them getting in, even if they started almost a decade later as they did peak way higher than Maiden did, while with Judas Priest that is clearly NOT the case.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Excellent_Theory1602",
            "body": "If I was Steve Harris, i'd refuse",
            "score": 44,
            "replies": [
                {
                    "author": "caimanreid",
                    "body": "Bruce had said as much, at least.",
                    "score": 25,
                    "replies": []
                }
            ]
        },
        {
            "author": "pronorwegian1",
            "body": "The Rock and Roll Hall of Fame is a joke. They’ll induct the Beastie Boys, Public Enemy, NWA and Tupac, but ignore Iron Maiden and Judas Priest? This is not an organization to be taken seriously since they clearly have no idea what constitutes rock and roll and it’s subgenres.",
            "score": 73,
            "replies": [
                {
                    "author": "prosfromdover",
                    "body": "What about Dolly Parton, though?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "AlexanderTox",
                            "body": "Fantastic country artist.",
                            "score": 11,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Puzza90",
            "body": "They really need to rename it, the fact that artists like Eminem and Dolly Parton are in there (no hate to either just not rock artists) but Maiden and Motorhead aren't is ridiculous. Rename it the music hall of fame or something",
            "score": 27,
            "replies": [
                {
                    "author": "BankLikeFrankWt",
                    "body": "It’s a music hall of fame. Rock and roll is a catch all term they use to categorize all music derived from the blues. Which is pretty much every time of popular music.",
                    "score": -26,
                    "replies": [
                        {
                            "author": "Annual_Strategy_6206",
                            "body": "Ehh...I mean, it's in the title.",
                            "score": 15,
                            "replies": []
                        },
                        {
                            "author": "BaconCheeseBurger",
                            "body": "Miles Davis Kind of Blue and Marshall Mathers LP, so similar I sometimes get them confused!",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "BankLikeFrankWt",
                                    "body": "It’s ok if you’ve never studied or made music. It doesn’t really matter what you or those other 8 people think. People much smarter than you or I, people that study it, observe, and preserve it say it is. I’ll take their word over some yahoos on Reddit.\n\nAlso, Miles Davis isn’t blues. When trying to be a smart ass, don’t forget the “smart” part.",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "author": "DCCFanTX",
                                            "body": "You’re saying that no Miles Davis songs are blues?  Miles Davis himself would disagree with you.  Jazz, like many other musical genres, originated with the blues and modified blues forms are still part of the jazz canon.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "BaconCheeseBurger",
                                            "body": "It was just a joke man. Listen to some music and relax a bit would ya? Rock n Roll HoF sucks ass, stop trying to defend it. Dolly Parton got in before Iron Maiden? Please defend that to me, I really need a good chuckle.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "soniko_",
            "body": "I have a gripe with the rock and roll hall of fame.\n\nSince the Prince issue, they’re inexistent to me.",
            "score": 18,
            "replies": [
                {
                    "author": "impy695",
                    "body": "What was the prince issue? All Google brings up is his insane performance.\n\nUnrelated but that performance of While My Guitar Gently Weeps is forever tied with House of Leaves for me because I was obsessed with it while reading that book.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Turakamu",
                            "body": "He kept trying to get the venue to change the toilet paper they use. Sounds innocent but he kept showing up outside the homes of custodial staff with the brand he preferred. Two of the 47 venue workers filed a restraining order against him and they eventually banned him from all live evemts.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "impy695",
                                    "body": "Lol, wtf. That went from hilarious and very Prince to dark way too fast",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Hopwater",
                    "body": "Because he threw his guitar to his tech?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "OizAfreeELF",
            "body": "Fuck the rock n roll hall of fame. Missy Elliot is in there and Thin Lizzy isn’t. That’s all you need to know about how legit it isn’t",
            "score": 43,
            "replies": [
                {
                    "author": "FrostyPost8473",
                    "body": "Hate to be that guy but Thin Lizzy wouldn't be there anyways they only have two songs that are commercial hits being jailbreak and the boys are back in town and even then they ain't super hits",
                    "score": -9,
                    "replies": [
                        {
                            "author": "OizAfreeELF",
                            "body": "They fuckin rock. What other requirements are there?",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "FrostyPost8473",
                                    "body": "Put it this way if you put thin Lizzy against Led Zeppelin who would get inducted that year \nNow put Thin Lizzy against Black Sabbath who is being inducted that year? You see where I'm going with this",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "OizAfreeELF",
                                            "body": "Okay if you put Thin Lizzy against Missy Elliot who do you think would get in?",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "ZombieJesus1987",
                                            "body": "We aren't comparing Thin Lizzy to Zeppelin or Sabbath.\n\nWe are comparing Thin Lizzy to fucking Missy Elliott.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "benji___",
                    "body": "I’m probably a generation younger than you, so I know Thin Lizzy have their hits *The Boys are Back in Town,* is worth including them alone, but I just don’t think they had the number of hits and *commercial* staying power to be considered. \n\nIn regard to Missy, my girlfriend just now said “Maybe it’s just anyone who slays, I guess.”",
                    "score": -8,
                    "replies": [
                        {
                            "author": "OizAfreeELF",
                            "body": "Fuck your girlfriend’s incorrect opinion.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "CelticSith",
            "body": "Up the irons!  🤘",
            "score": 11,
            "replies": []
        },
        {
            "author": "SenorIngles",
            "body": "If you listen to rock music I bet that at some point you’ve owned at least one Iron Maiden t shirt. Like even if you exclude the music, their cultural impact and style influence on metal is worth being in the hall of fame alone",
            "score": 40,
            "replies": [
                {
                    "author": "XeLLoTAth777",
                    "body": "Yup, got an iron maiden tank top and I'm not even a mega fan.\n\n\nAsked my room roommate if he owns any iron maiden stuff (he's not into music at all ) and sure enough he's got a shirt AND a cap.\n\n\n\n\nYou're onto something here",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "tomwhoiscontrary",
                    "body": "Don't think i own a t-shirt, but i have a pack of [the stamps](https://shop.royalmail.com/special-stamp-issues/iron-maiden). Anyone who gets post from me gets some metal on it!\n\nIncidentally, the Royal Mail is quite a bit more exclusive than the Rock and Roll Hall of Fame (even apart from being restricted to British groups) - the only bands to have been put on stamps are the Beatles, Pink Floyd, Queen, the Rolling Stones, and Iron Maiden. Someone over there has good taste!",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Figgoss",
                            "body": "AC/DC now",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "I_am_a_Malayali",
                    "body": "I’m a rock & metal fan. I own only one t shirt and that’s an Iron Maiden one !",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "SupervillainMustache",
                    "body": "I remember seeing Miley Cyrus wearing an Iron Maiden shirt. Granted it could be one of those things where people where it without listening to the band.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Danmoz81",
                            "body": "Rock Miley is the best Miley, check out her cover of Zombie or her performance of Rebel Yell with Billy Idol",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Zylnor",
            "body": "I’ll admit I don’t really listen to Iron Maiden. But the fact that they haven’t already been in it is alarming. Someone who is as big as they are (and as people have stated still selling out concerts) just tells me the Hall of Fame is a joke.",
            "score": 9,
            "replies": []
        },
        {
            "author": "UmbertoEcoTheDolphin",
            "body": "All I know is that Iron Maiden's going to get you! And you! And you! And all of you!",
            "score": 3,
            "replies": [
                {
                    "author": "ClubMeSoftly",
                    "body": "And all you mad motherfuckers on the floor!  \n\nIron Maiden's gonna get *aaaaalllllllllll* of you!",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "scopeless",
            "body": "The fan vote contains a lot of overlooked artists for what it’s worth. \n\nPhish is currently leading.",
            "score": 3,
            "replies": [
                {
                    "author": "allothernamestaken",
                    "body": "Talk about a band with its own army, still putting out new music and selling out arenas over 40 years in ⭕",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "idiotzrul",
            "body": "If Iron Maiden should be in, then so should BLUE OYSTER CULT!!",
            "score": 7,
            "replies": [
                {
                    "author": "Not_Tom_Petty",
                    "body": "MOTÖRHEAD",
                    "score": 8,
                    "replies": [
                        {
                            "author": "XeLLoTAth777",
                            "body": "MOTÖRHEAD ISNT?\n\n\nwhat a fucking joke.....",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "idiotzrul",
                                    "body": "Agreed",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "XeLLoTAth777",
                                            "body": "I'm old enough to have known this was a dcsm but didn't.\n\n\nFuck the RRHOF",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Comfortably_Numbbbbb",
            "body": "Three Dog Night had like every single hit for a long stretch in the early 70s. No one deserves it more than them.",
            "score": 10,
            "replies": []
        },
        {
            "author": "KMan345123",
            "body": "I like the Hall of Fame more as a museum than an actual hall of fame",
            "score": 3,
            "replies": [
                {
                    "author": "Annual_Strategy_6206",
                    "body": "Hear hear! I sat next to Ringo's Ludwig drum set! Hendrix' upside down white Strat that was accompanied by a video loop of Woodstock Star Spangled Banner!\nEdit: Also check out the Musical Instrument Museum (MIM) in Arizona. Really good, and international. Not just rock at all, but cool rock exhibits for sure. Huge Conn Sousaphone with every inch covered in engraving from a World's Fair etc. Alice Cooper had a big role in funding and advocating for it.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Chocolat-Pralin",
            "body": "RRHOF it’s just a stupid institution directed by stupid people. It’s a lot of great great musicians who are not in and will never be in. Don’t ask them why? \nThe list of musicians and bands who deserve to be inducted is too long for say any name.",
            "score": 2,
            "replies": []
        },
        {
            "author": "reaper527",
            "body": "they should be, but ultimately everyone knows that the rock and roll hall of fame is a joke and nobody respects them.\n\nat this point, being honored by hard rock cafe is more of an honor than the rock and roll hall of fame.",
            "score": 2,
            "replies": []
        },
        {
            "author": "RevolutionaryLie5743",
            "body": "The Sex Pistols (well John Lydon) put it best, it’s a fucking piss stain…",
            "score": 2,
            "replies": []
        },
        {
            "author": "Waste-Aardvark-3757",
            "body": "Who cares that place is a joke",
            "score": 2,
            "replies": []
        },
        {
            "author": "StayPuffedMarsh",
            "body": "https://i.redd.it/a7woyzzgxcpe1.gif",
            "score": 2,
            "replies": []
        },
        {
            "author": "frix86",
            "body": "Blah blah blah, blah blah. Blah blah blah blah blah. Blah blah blah blah blah blah blah. Blah blah blah. Blah blah blah blah!",
            "score": 4,
            "replies": []
        },
        {
            "author": "TheSanityInspector",
            "body": "The Rock And Roll Hall Of Fame inducts acts the same way you eat a bunch of grapes: Start by picking the best, end by picking everything.",
            "score": 2,
            "replies": [
                {
                    "author": "reaper527",
                    "body": "> Start by picking the best,\n\ndid they even do that?",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Umbertoini",
            "body": "Isn't Alice Cooper a hardcore Christian?",
            "score": 1,
            "replies": [
                {
                    "author": "Not_Tom_Petty",
                    "body": "I don’t know about “Hardcore” but he doesn’t deny",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Umbertoini",
                            "body": "So he quit doing stuff like \"I Love the Dead\" and \"Dead Babies,\" I take it",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Not_Tom_Petty",
                                    "body": "Haha. Forgot about those",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Loquis",
                    "body": "Not sure what that has got to do with it, but Nicko McBrain is also a christian",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ZombieJesus1987",
                            "body": "Tony Iommi is as well. Which is funny because of the whole satanic panic surrounding the band.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "NJ247",
            "body": "I don't really keep with who is inducted, but I would have thought they were a given.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gravity_flip",
            "body": "TIL the Rock and roll Hall of Fame is a joke",
            "score": 1,
            "replies": []
        },
        {
            "author": "InvestmentFun3981",
            "body": "The HoF always overlooks metal acts.",
            "score": 1,
            "replies": [
                {
                    "author": "redbananass",
                    "body": "But doesn’t over look rap and country.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "InvestmentFun3981",
                            "body": "These days",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "BaldInkedandBearded",
            "body": "Saw Alice open for Maiden on the Maiden England tour. When the topic of most memorable opening acts I've seen comes up, Alice is the only one who nearly upstaged the headliner.",
            "score": 1,
            "replies": [
                {
                    "author": "ZombieJesus1987",
                    "body": "Oh yeah, that would have been newly sober Alice Cooper too!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Few_Wash_7298",
            "body": "The smashing Pumpkins, The Pixies, STP the list goes on and on. \n\nThe Hall is severely out of touch.",
            "score": 1,
            "replies": []
        },
        {
            "author": "3Gilligans",
            "body": "They keep out bands on purpose to keep up controversy and people talking about it",
            "score": 1,
            "replies": []
        },
        {
            "author": "d0ggzilla",
            "body": "Madonna was inducted in 2008.\n\nMadonna.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sacklayblue",
            "body": "The fact they're not already in there is one of many examples of how the rock and roll hall of fame is invalid.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Porcupinesrule",
            "body": "OK",
            "score": 1,
            "replies": []
        },
        {
            "author": "pokeyporcupine",
            "body": "Iron Maiden isn't in the RRHOF?",
            "score": 1,
            "replies": []
        },
        {
            "author": "ChocolateAndCognac",
            "body": "Blasphemous that Mariah Carey would get inducted, but not Iron Maiden.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SupervillainMustache",
            "body": "I assumed they were already in.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hard-_",
            "body": "Isn't it obvious that the Hall of Fame hasn't inducted many huge bands so they can keep making big events that call lots of attention?",
            "score": 1,
            "replies": []
        },
        {
            "author": "notobaloney",
            "body": "Did Bad Company get their turn yet?",
            "score": 1,
            "replies": []
        },
        {
            "author": "jpg06051992",
            "body": "I’ve seen Maiden 5 times, last time a few years back when they released their newest album. \n\nIt was packed, PACKED, every time, their live performance abilities alone should get them in the RnRHOF 🤘",
            "score": 1,
            "replies": [
                {
                    "author": "ZombieJesus1987",
                    "body": "They're still selling out soccer stadiums all over the world.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheShamShield",
            "body": "It absurd they weren’t indicted a while ago. Seventh Son of a Seventh Som is one of the greatest metal albums full stop, and they have a several other great albums too",
            "score": 1,
            "replies": []
        },
        {
            "author": "CosmicOwl47",
            "body": "If Iron Maiden isn’t in there, then who even is? \n\nI’ve never been to it, but it certainly doesn’t seem like they have any rhyme or reason of who’s inducted, so why would anyone care to go?",
            "score": 1,
            "replies": []
        },
        {
            "author": "ReverendEntity",
            "body": "I thought they were already inducted!  What a disappointment.",
            "score": 1,
            "replies": []
        },
        {
            "author": "miggyuk",
            "body": "Don't think Maiden care about Hall of Fame anyway. Sure Bruce said something along the lines of FUCK EM. 🤔👎😁",
            "score": 1,
            "replies": []
        },
        {
            "author": "Joshualevitard",
            "body": "Are you telling me Maiden aren´t in the RnR Hall of Fame?\n\nwhat, too obvious?",
            "score": 1,
            "replies": []
        },
        {
            "author": "ZombieJesus1987",
            "body": "I doubt Iron Maiden will get inducted while Bruce Dickinson is still alive.\n\nHe shits on the HoF any chance he gets, and he has stated numerous times that if Maiden ever gets inducted, he's not going.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jitterbug726",
            "body": "Started listening to them as a teenager in the 90s and still love their shit",
            "score": 1,
            "replies": []
        },
        {
            "author": "castilhoslb",
            "body": "Any One actually gives a shit about these ? Feels like the Oscars bullshit",
            "score": 1,
            "replies": []
        },
        {
            "author": "powerage76",
            "body": "Why do people pretend that Rock & Roll Hall of Fame was ever relevant?",
            "score": 1,
            "replies": []
        },
        {
            "author": "OntarioScotian",
            "body": "Big enough to sell out stadiums, big enough  that they tour in their own 747 with their front man flying the aircraft. PUT THEM IN THE HALL!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mundane_Ease_8841",
            "body": "Maidens, better than all of them. Except Rush?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kylerj96",
            "body": "Iron  Maiden are in the Hall Of Fame? \n\nMore like Hall Of Lame",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tonedef22",
            "body": "They’re not in??? Holy shit…how!?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Martipar",
            "body": "We are not Kiss!\n\n  \nAnyway I am glad that Iron Maiden aren't in it, I won't say it will make them sell outs because that would suggest they haven't got Maiden branding on a lot of products - which they have - but the R&R Hall of Fame is definitely a club for bands that are, in general, less about the music and more about the money and branding.   \nThey aren't sell outs in the sense that they will do anything for cash and brand anything and everything but they do have commercial interests that the band associate with.   \n  \nTake Trooper Beer, it's not rebranded Budweiser or other existing beer, it is it's own thing and it sells on it's own merit, it is a nice drink. I tried it becasue it had Maiden branding on but I drink it because it's nice. It's clearly been judged to be good before they branded it. \n\nI've seen Maiden 4 times over 18 years, not once have they felt like they were phoning it in, other bands do this but i have seen polaenty of bands, such as Marilyn Manson, putting in little to no effort, stumbling over their lyrics and generally not being 100%.\n\nIf Iron Maiden get inducted i won't be sad however the fact they aren't in it is a better sign for the band than being in it. They don't need the R&R Hall of Fame, they are more about the music than such \"honours\" .\n\nDoes that make sense? probably not but that's what you're getting.",
            "score": 1,
            "replies": [
                {
                    "author": "Annual_Strategy_6206",
                    "body": "I had this take about Bob Dylan getting a Nobel Prize. It was some discussion about how great he was or wasn't (because of his gravelly voice when he got older). Someone brought up the point that he won the Nobel. My take is that the Nobel is irrelevant, he's great with or without it. The Nobel is mainstream culture, and Bob was always counterculture.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ZombieJesus1987",
                    "body": "I saw Maiden on the Flight 666 tour in 2008 and again in 2019. Both shows they gave it their all, and I'd wager the second one was even better. Both shows I got to see songs that I never expected I would see performed live, like Rime of the Ancient Mariner, For the Greater Good of God, Sign of the Cross and The Clansman",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Not_Tom_Petty",
            "body": "No! End of story.",
            "score": -1,
            "replies": []
        }
    ]
}