{
    "title": "I’m feeling some soft kind of anprim where we keep medicine and sidewalks and stuff but we also recognize that being in nature and practicing Stone Age skills is good for the human being. I want vaccines AND to live in a mud hut village with all my friends.",
    "author": "FriendshipBorn929",
    "subreddit": "Anarchism",
    "rank": 248,
    "score": 34,
    "upvote_ratio": 0.87,
    "num_comments (reported by reddit)": 17,
    "url": "https://www.reddit.com/r/Anarchism/comments/1ilqal1/im_feeling_some_soft_kind_of_anprim_where_we_keep/",
    "id": "1ilqal1",
    "selftext": "There’s a middle ground i think ",
    "comments": [
        {
            "author": "cripple2493",
            "body": "I wonder if a lot of anprim is just really disliking consumerism.\n\nLike, I dislike consumerism and it'd be cool to live somewhere with good access to nature. I'm also disabled though, and need medication and don't really want to be syntheising or compounding that myself. For one, I don't have the skillset and for two, there are people who want to do that stuff. Similarly, I use a power assisted wheelchair which requires technology and infrastructure to even be made.\n\nThere's for sure a need for space that understands that consumerism sucks, overconsumption isn't cool and we don't need a bunch of plastic crap but also understanding that technologies (including medicine, phones, computers and even The Internet) aren't inherently bad. Rather, they are badly used by the current socioeconomic context in which we find ourselves.",
            "score": 22,
            "replies": []
        },
        {
            "author": "None",
            "body": "The kids call this degrowth solarpunk",
            "score": 12,
            "replies": [
                {
                    "author": "Das_Mime",
                    "body": "Andrewism has a number of good essays and Youtube videos on the subject\n\nhttps://theanarchistlibrary.org/library/andrewism-commons-libraries-degrowth",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Choice-Birthday-2235",
            "body": "Sometimes I think something similar. I think all people should be able to find happiness and fulfillment in the simple things of life. I'm not saying it's bad to get a treat for yourself or buying something you really like, I mean that capitalist and neoliberal societies often portray consumption as this essential thing you need to do in order to be happy in life. I must admit there are obvious things you need to buy in order to survive, but, what I'm pointing is that capitalism and neoliberalism often create false needs in us, leading to overcomsuption and consumism. In real life conversations, I've found really difficult to explain to people that they don't really need the last iPhone, that they don't need to buy all the trendy clothing, that they don't need to buy the most expensive food. There's nothing wrong with wanting these little luxuries, it's wrong when it becomes a need, which can lead people to, as a said before, overconsumption and consumism",
            "score": 12,
            "replies": []
        },
        {
            "author": "UpstairsRegion",
            "body": "I always felt like there would be spaces for both, or al least spectrums. Like we need cities and technological infrastructure for things like modern medicine, but under anarchism those could coexist with more primitive communities too, and anything running the gamut between them.",
            "score": 6,
            "replies": []
        },
        {
            "author": "like2000p",
            "body": "This is where solarpunk and dialectical naturalism's \"third nature\" come into the discussion.",
            "score": 7,
            "replies": [
                {
                    "author": "Only_Cow_6954",
                    "body": "r/solarpunk",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "TuxedoTechno",
            "body": "All I ever wanted was a quiet life reading books, making art and music and living close to nature. The whole struggle has been with the demands of modernization and economics. Land is capital. Nature itself is capital. The bar to entry for that lifestyle is so high that only the wealthy could live like that. Which is ironic, because none of them would. The rest of us would be on the hook for making that land productive or lose it. That process would destroy the simplicity, destroy the quiet, and destroy nature.",
            "score": 2,
            "replies": []
        },
        {
            "author": "PMmePowerRangerMemes",
            "body": "I agree. I want to access my animal side and also retain many of the gifts of my humanity",
            "score": 2,
            "replies": []
        },
        {
            "author": "azenpunk",
            "body": "You can do that.  As long as you don't need to make everyone else do it,  that's fine.",
            "score": 1,
            "replies": [
                {
                    "author": "WildAutonomy",
                    "body": "That's anarchism, yes. Same with syndicalists",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AffectionateTiger436",
            "body": "Sure but I want heat electric and internet. I think your goal and mine can happen at the same time if not in the same dwelling.",
            "score": 1,
            "replies": []
        },
        {
            "author": "onward_skies",
            "body": "Are sidewalks really worth all the labor, material extraction, maintenance? When you could walk barefoot on the Earth? \n\n\nWild animals do not require industrial medicines as their domesticated siblings do\n\n\npeople existed long before \"Civilization\" arrived. escape if you can",
            "score": 1,
            "replies": []
        },
        {
            "author": "Singhintraining",
            "body": "Sounds like you want to live in an environment where everyone has some level of knowledge and skill in things like gardening, carpentry, metal work, plumbing, etc.\n\nEdit: the most radical thing you can do is learn like woodworking, the electrician’s trade, etc.",
            "score": 1,
            "replies": []
        },
        {
            "author": "yarrpirates",
            "body": "Ever read the novel Walkaway? It explores this idea extensively, and it inspired me to learn about anarchic living  properly.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WildAutonomy",
            "body": "So post-civ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bulky_Mix_2265",
            "body": "That desire for the primitive is from the sterilizing effect of technology on socialization and the complacency it brings. Life is supposed to include struggle, the ability to suffer to improve a situation, without struggle there is only stress. \n\nWe have increased the stressors and eliminated the ability for individuals to struggle.",
            "score": 1,
            "replies": []
        }
    ]
}