{
    "title": "Conversation Feedback",
    "author": "MachinaExEthica",
    "subreddit": "Anarchism",
    "rank": 225,
    "score": 67,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 34,
    "url": "https://www.reddit.com/r/Anarchism/comments/1imjxtb/conversation_feedback/",
    "id": "1imjxtb",
    "selftext": "I had a conversation with a friend the other day that went something like this:\n\nFriend: \"So if you're an anarchist, then you should like what trump and musk are doing right now.\"\n\nMe: \"Well, no.\"\n\nFriend: \"But if they are trying to break down all of these various government programs and remove regulations and restrictions, isn't this in line with your worldview as an anarchist?\"\n\nMe: \"No, and let me explain. First, not every anarchist would agree with me, but I would hope most would. Second, Trump and Musk are not tearing down the government completely, they are tearing down the things standing in the way of their ability to amass more power and more money. Third, Anarchy is not a top-down process. Without the bottom up approach where communities are built upon mutual trust and mutual aid, the swift removal of parts of the US government can only lead to greater chaos. With the bottom up approach, communities learn to work together in mutually beneficial ways, cooperating for the benefit of all and removing their reliance on corporations and governments. Governments would dissolve because there is no need for them, corporations would dissolve because they would be replaced by individuals cooperating for the benefit of all. Anarchism, despite popular belief, is not synonymous with chaos, and what Trump and Musk are doing is simply causing chaos for the sake of a fascist power grab.\"\n\nThis is a watered down and simplified version of the exchange, but I'm curious if you all agree, or what your thoughts are on the current actions being taken to reduce many aspects of the American government by Trump and his team.",
    "comments": [
        {
            "author": "Meowlecule",
            "body": "Anarchists reject all oppressive hierarchies. This includes the oppressive hierarchies necessarily created by capitalism.",
            "score": 33,
            "replies": [
                {
                    "author": "MacondoSpy",
                    "body": "This. Trump and Musk are not “tearing down the system” to allow for the develop of a decentralized federation or network of independent communities. They’re just reshaping it in a way that benefits them and their oligarch friends.",
                    "score": 14,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "I agree with you, and I think what you said about Trump and Musk is exactly on point. I don't think anyone who considers themselves an Anarchist would approve of what the MAGA cult is doing, as it's essentially just a coup.",
            "score": 19,
            "replies": [
                {
                    "author": "MachinaExEthica",
                    "body": "Yeah, though the conversation got me thinking that there might be people out there who view all of this as somehow improving the prospects for a future anarchist state of existence for the US. I definitely don’t see it that way but was curious if anyone within the anarchist community had any alternative views of everything going on right now.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "artnarc",
                            "body": "I am on the other side of this, musk and oligarchs aside and maybe he should be no where near the government, probably likely, I don't have am issue with someone gathering wealth if morally they seem ammendable to the rest of us and our enrichment, but I understand this becomes a slippery floor, if the balance of wealth for one man or woman outweighs the majority.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "artnarc",
                                    "body": "Respond as you will I will just read the responses, thanks for reading the question much love and victory to the individual",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "dzerimar",
                    "body": "Right! When I said I wanted to tear down the state I didn't mean like this 🫠",
                    "score": 7,
                    "replies": [
                        {
                            "author": "None",
                            "body": "LMAO!",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "StoopSign",
                    "body": "I think you're failing to account for the accelerationists among us. I have deeply mixed feelings about the situation. I see some of the moves as legit and others fascistic and abhorrent",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "Anarchism is order without power. \n\n\nTrump and Musk, as well as almost all the \"minarchists\", \"ancaps\", and \"right-wing libertarians\", are power without order.",
            "score": 12,
            "replies": []
        },
        {
            "author": "The-Greythean-Void",
            "body": "I think your friend knows on some small level that what's really happening in the US is a consolidation of oligarchy, but doesn't know how to really say it because they've been lead to assume that all anarchy means is when there's no state. And yes, anarchism is against the state, but it's also against capitalism, white supremacy, patriarchy, imperialism, colonialism, and any other oppressive power structures that are rooted in the principle of hierarchy, wherein people are ranked one over another in terms of status and authority. Anarchists seek to counter this through the decentralization of power in order to create horizontality.\n\nPoint out the irony in how chaotic the current hierarchical order is. By being made to think that the most viable way to live is to take part in a giant rat race, we forget what it means to be human.",
            "score": 9,
            "replies": []
        },
        {
            "author": "PM-me-in-100-years",
            "body": "I generally like the idea that the arc of history bends towards justice, and incrementally improving everyone's lives is the best path forward. \n\n\nSome anarchists (and plenty of authoritarian leftists) like accelerationism though, or see mass death as inevitable or even expedient. \n\n\nThat said, most anarchists are weak on geopolitical analysis. It's definitely a good thing for US empire to falter and weaken, even though it means that poor people in the US will have it worse. Poor people around the world have a lot to gain. Leftist gains in Latin America while the US was preoccupied with the second Gulf war are one example, including building enough power to outright reject to FTAA (After seeing what NAFTA did to Mexico).\n\n\nTrump is trying to weaken the US on behalf of Russia, and there's essentially zero anarchists supporting Putin, but US anarchists primary international focus should be on countering much of US foreign policy, and secondarily supporting international resistance movements (in recent years some Russian anarchists even defected and joined the Ukrainian military).\n\n\nThen closer to the original topic there's the embarrassment of right wing insurrectionists. Prior to Jan 6th it was a lot more fun for anarchist insurrectionists to imagine overthrowing the US government. The far right beat them to the punch a bit though, and now it's a lot clumsier to propose something similar, even as a distant fantasy. \n\n\nOverall there's just so much work to do though, so it's easy to choose from work that overlaps more with progressive and liberal goals than with right wing ones. \n\n\nFor example in the past year one crew I'm part of was considering starting a campaign to abolish ivy league schools (naturally motivated in past by Palestine organizing). We ended up deciding against it, mainly because higher education is already under right wing attack from so many angles.\n\n\nAt this point we're mostly just picking and choosing among the predictable crowd of folks that's motivated to do things by the Trump coup, and focusing on building preparedness and resilience for what's to come. The more flash in the pan folks are scrambling to build ICE watch networks. \n\n\nSomewhat refreshingly but also worryingly there's a much smaller surge of liberals trying to do anything, so it's easier to network with other radicals in that context. When actual fascism occurs, no surprise that the actual anti-fascists are the most active.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Ancient-Practice-431",
            "body": "I agree and appreciate your post",
            "score": 3,
            "replies": []
        },
        {
            "author": "Anarcho_Humanist",
            "body": "I would basically agree with you, although I am not really familiar with what Trump and Musk are doing.\n\nI hope they accidentally tick the wrong box and cut funding to the NSA and CIA.",
            "score": 4,
            "replies": [
                {
                    "author": "StoopSign",
                    "body": "They kinda did. They went after USAID and NED which have both been used as CIA fronts.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "StoopSign",
            "body": "Hmm...I have extremely mixed feelings related to being a non-socialist on the anarchist left but also don't see populism as a dirty word. Bernie was a good populist.\n\n--------\n\nMusk is a fuckin Nazi Afrikaner asshole and Trump is loose cannon. So it looks like I don't like them and I don't.  However loose cannon Trump often accidentally tells the truth about the corrupt DC apparatus and oftentimes saying the quiet part out loud about his own agenda. Meanwhile Biden was all mealy mouth lies.\n\n---------\n\nAlso USAID and NED are deeply corrupt institutions that enforce US empire overseas under the guise of foreign aid and promoting Democracy. Also Musk wants to audit the pentagon again as the pentagon miserably fails all audits. Then there's the JFK and MLK files that might be released. Also I was a Tulsi Gabbard supporter in 2020 and interviewed her at a campaign event. Trump also doesn't start foreign wars as much as recent dems but did just hand over Gaza to Israel on a silver platter like a real asshole.",
            "score": 2,
            "replies": [
                {
                    "author": "MachinaExEthica",
                    "body": "I’m actually with you on more of this than it may seem from my post. The question my friend posed is not a completely asinine one. What you mentioned are pretty good examples of potential upsides to the like of shit that is the US at the moment. I feel like USAID while it has been used as a cover for all sorts of terrible activities, it also does a lot of good in the world, so I have mixed feelings on that one. I also feel like the good I think it does is why musk and Trump want to stop it, and the bad things it does might be the only reason they’d keep it around. But that’s a perfect example of them doing something that could be seen as good from an anarchist perspective but has the effect of further centralizing their power over everything, an inherently bad outcome.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "StoopSign",
                            "body": "Yep definitely good points on USAID. However the National Endowment for Democracy is truly evil and in their crosshairs.\n\nhttps://en.wikipedia.org/wiki/National_Endowment_for_Democracy\n\nThey often have partnered up with School Of the Americas for coups in Latin America. There's been like dozen of them in the past 25yrs.\n\nhttps://en.wikipedia.org/wiki/Western_Hemisphere_Institute_for_Security_Cooperation",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "MachinaExEthica",
                                    "body": "This I agree completely with. All of the “nation building” and coups and assassinations and wars manufactured for the sake of “democracy” is unreal. I wish there was an update to Herman and Chomsky’s Manufacturing consent to go over the last 40 years of terrible things the US has done in the name of freedom and democracy.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "StoopSign",
                                            "body": "The 2004 book, Confessions Of An Economic Hitman by John Perkins is probably the closest thing to that hypothetical update.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "MachinaExEthica",
                                    "body": "And the NED in particular has basically just taken over what the CIA was doing previously in intergovernmental meddling. Not a great organization to keep around.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "StoopSign",
                                            "body": "Here's Elons tweet crowdsourcing accusations of the crimes of the NED\n\nhttps://x.com/elonmusk/status/1886089653188481504\n\nTop reply is from Max Blumenthal, one of my favorite journalists and someone who's reports I often used when doing my own journalism about the 2019 Venezuelan coup attempt.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "PlastIconoclastic",
            "body": "Well said.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Head_Bad6766",
            "body": "Very well stated. I have been expecting to hear people make that point.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hi u/Independent-Slip568 - Your comment has been automatically removed for containing either a slur or another term that violates the [AOP](https://www.reddit.com/r/Anarchism/wiki/aop). These include gendered slurs (including those referring to genitalia) ***as well as ableist insults which denigrate intelligence, neurodivergence, etc.***\n    \nIf you are confused as to what you've said that may have triggered this response, please see [this article](https://www.autistichoya.com/2014/02/violence-linguistic-ableism.html) and the associated [glossary of ableist phrases](https://www.autistichoya.com/p/ableist-words-and-terms-to-avoid.html) **BEFORE** contacting the moderators.\n\nNo further action has been taken at this time. You're not banned, etc. Your comment will be reviewed by the moderators and handled accordingly. If it was removed by mistake, please reach out to the moderators to have the comment reinstated.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Anarchism) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "artnarc",
            "body": "I would like to enter a question and it would require an allowance from the mods to allow it to stand because I have asked it before and it was immediately removed, maybe yalls answers would change my thoughts, because I have been an anarchist since I first encountered the idea over 30 years ago and I have always in the US favored a conservative government l, and I will just ask the question, read the responses and not offer any rebuttal unless asked for it, I don't watch the news I'm not up on current events and as an anarchist I don't care about any of that, but as this is an anarchist blank group I started reading posts and it seems to me a more black and red flag kind of group, which is fine, I believe anarchy is one of the end goals for us progressively in whichever form it takes and being a believer on chartalism I think it is very much achievable, so if you would like to hear the question, message me or maybe the mods will let me post it, however not letting post it isn't very anarchistic as far as I know...",
            "score": 1,
            "replies": [
                {
                    "author": "MachinaExEthica",
                    "body": "I’m okay with you posting your question here.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "artnarc",
                            "body": "They deleted it but if you dm me I will answer it I will let this stand they deleted another post because in lieu of man as in mankind I said man or woman so they deleted it as a slur which maybe they thought I was being derogatory or sarcastic I understand now",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hi u/artnarc - Your comment has been automatically removed for containing either a slur or another term that violates the [AOP](https://www.reddit.com/r/Anarchism/wiki/aop). These include gendered slurs (including those referring to genitalia) ***as well as ableist insults which denigrate intelligence, neurodivergence, etc.***\n    \nIf you are confused as to what you've said that may have triggered this response, please see [this article](https://www.autistichoya.com/2014/02/violence-linguistic-ableism.html) and the associated [glossary of ableist phrases](https://www.autistichoya.com/p/ableist-words-and-terms-to-avoid.html) **BEFORE** contacting the moderators.\n\nNo further action has been taken at this time. You're not banned, etc. Your comment will be reviewed by the moderators and handled accordingly. If it was removed by mistake, please reach out to the moderators to have the comment reinstated.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Anarchism) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "artnarc",
            "body": "My question was deleted",
            "score": 1,
            "replies": []
        },
        {
            "author": "artnarc",
            "body": "Before this post I didn't know what NED was",
            "score": 1,
            "replies": []
        },
        {
            "author": "katieleehaw",
            "body": "Right I think it's important to be able to clearly verbalize what we oppose about this -- it's not the fact that they are breaking an existing system.\n\nIt's the fact that they wish to replace it with an even worse system.",
            "score": 1,
            "replies": []
        }
    ]
}