{
    "title": "Moral Dilemmas of Fashion",
    "author": "1ayne_",
    "subreddit": "Anarchism",
    "rank": 71,
    "score": 30,
    "upvote_ratio": 0.87,
    "num_comments (reported by reddit)": 27,
    "url": "https://www.reddit.com/r/Anarchism/comments/1iyru3q/moral_dilemmas_of_fashion/",
    "id": "1iyru3q",
    "selftext": "Since I was 16 I have had a love for the art of fashion causing me to over consume it and purchase high value pieces. As I read more about anarchism and its principles I cannot help but feel wrong for purchasing clothing to simply “express myself” when others can use that money for so much more. I am curious if anyone has had similar feelings and what they did with those feelings?\n\nty for reading",
    "comments": [
        {
            "author": "MDesnivic",
            "body": "I really wouldn't beat yourself up too bad about it. There's very little a single person can do to unfuck a horrible world around them. The \"there is no ethical consumption under capitalism\" indeed rings true, but as a refusal to participate or invest in a system or systems that destroy and exploit humanity and the Earth, it's reasonable to boycott certain brands and products (I don't eat meat or fast food, for instance). The conundrum emerges as to what the severity is of the company that produces the clothing. It's overpriced and made with heavily exploited labor, often in the underdeveloped world. This is the case with most commodities.\n\nI am also big into clothing: I am highly selective with what I wear, get things tailored/altered, often wear neckties (with sweaters when it's cold) and even clean my shoes and boots with relative frequency. I take clothing seriously. Clothing is how one communicates. Thus I am usually the odd one out in anarchist spaces (book fairs, etc.) although usually then I am just usually wearing some casual button-up shirt, plaid or plain.\n\nThe thing is though, I just buy basically everything second-hand. Lots of modern flashy upscale fashion is blah to me.",
            "score": 28,
            "replies": []
        },
        {
            "author": "Nora_Walkuerie",
            "body": "As far as I understand it, typically high fashion clothing is the only way you're getting garments that are high enough quality to be repairable, and ethically manufactured. If you're able to swing it, buying high quality clothes once instead of cheap, sweatshop produced clothes a bunch of times, is the way to go imho, as long as you actually use them for their whole lifespan and attempt to repair them",
            "score": 11,
            "replies": []
        },
        {
            "author": "comix_corp",
            "body": "Anarchism doesn't mean taking a vow of poverty, like some kind of Catholic sect or something. If you're a working class person that wants to spend their money on clothes, that's up to you, and it realistically has no impact on capitalism either way.",
            "score": 20,
            "replies": [
                {
                    "author": "Academic-Bench-2452",
                    "body": "Honestly I think middle class -especially in large numbers- vote with their money. And most of the time your money goes to yucky rotten people who make the world a worst place for all of us! Im not gonna give money to villais so they can continue ruining my life! I know if its only me it doesnt work, but global boycotts do work!!",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "dingdop",
            "body": "Just incorporate anarchism into your fashion. Tons of people in the punk scene do this. DIY that shit homie (or steal it)\n\nEdit: in Minecraft",
            "score": 16,
            "replies": [
                {
                    "author": "OwlEducational4712",
                    "body": "Yeah skinny jeans on sale at HMV and buying patches from creepy A-political douchebag with a profit motive whos only redeeming quality is likely only an awareness of obscure hype bands.\n\nYeah, really sticking it to the man.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "dingdop",
                            "body": "Hmmm. You dislike society yet you participate in it. Yes. I am very smart.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "OwlEducational4712",
                                    "body": "Nah just a knowledge that punks are hypocrites.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "dingdop",
                                            "body": "You are projecting way too much personal experience in op’s question and your reply to my comment. In theory, at least, it is possible to do what I said, which was an answer to op’s question. Don’t go projecting all over other peoples creative endeavors just because you had a bad experience in the scene.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "aifeloadawildmoss",
            "body": "Buy second hand, upcycle, get scissor happy! Take fashion and make it your own. It helps to break your mind if following the current trends, that is a trap designed to keep you feeding the throwaway economy. \n\nAlso buy things in thrift stores that you LOVE and wear them a lot. \n\nAlso if you want more clothes then be militant with yourself, set a limit on how many jumpers you will have so if you want to buy a new one, you have to part with an old one and feed it back into the thrift economy. Makes you appreciate the clothes you have a lot more. \n\nIf something gets torn, fix it but make it cool by doing \nr/visiblemending \n\nAnd when they get too worn to wear you can make Zokin from them which are cleaning cloths made from old rags using Sashiko stitching which makes them super strong and also beautiful!",
            "score": 6,
            "replies": []
        },
        {
            "author": "TCCogidubnus",
            "body": "It's an interesting parallel that you're having this dilemma at the exact same time that I am starting to consider how to use fashion choices to express myself for the first time in my life (in my 30s). Part of my doing that has been a result of the wider personal growth and self-exploration I've been doing as part of deepening my understanding of left wing and socially progressive politics and philosophies. Asking myself who I am, what my identity means to me and how do I want to express it, is helping me build the confidence to actually do things and not just obsess over figuring out the perfect answers before acting.\n\nYou are responsible for the evils of the system. You aren't responsible for saving anyone. What you do have is an opportunity to help make the situation a little bit better, but to do that you need to be bringing your whole and authentic self. That means knowing what you need to feel like you, to be expressing yourself properly, and to take care of yourself. It also means knowing what things aren't key for you, and not letting external influences push you into spending money or energy on them anyway. As long as you're maintaining that balance, my opinion is you're doing better than most and all that can be expected of you.\n\nThe situation sucks. We can make it better. We don't have to self-flagellate to do so, and in fact beng miserable will make it harder.",
            "score": 6,
            "replies": []
        },
        {
            "author": "AmarissaBhaneboar",
            "body": "It's ok, and can also be an important part of human mental health, to express yourself through clothing. There's nothing inherently wrong with it. Especially if you're buying high quality pieces, secondhand pieces, making your clothing, or  buying from small retailers who are sustainable and ethically conscious. There's also nothing wrong with having bought a lot of fast fashion and then realizing how bad it really is and changing your ways (I'm definitely in this camp.) \n\nSome things you could do if you enjoy clothing and fashion is make sure to buy secondhand first, making or buying local and as sustainable as you can second, finding a further away sustainable retailer, and then maybe just not buying something if you can't find it in one of those places or make it yourself. \n\nYou could also do things like start clothing swaps in your area. I've done this and it's a lot of fun. \n\nYou could learn to sew if you haven't already and offer to mend people's items. I also do this and it's a lot of fun! You can also learn to upcycling pieces of clothing that people no longer want or are unwearable for whatever reason. \n\nThere's a lot you can do in the realm of clothing and fashion that can help the world, actually! I love self expression and I love helping people express themselves in authentic to them, sustainable, ethical ways. :)",
            "score": 3,
            "replies": []
        },
        {
            "author": "1ayne_",
            "body": "I very much appreciate all the messages you have all put your time into and the insight they have provided me. \n\nTruly, after reading all of your comments, I plan to implement the most ethical form of consumption I can fathom into my love of fashion.\n\nI will be taking extreme care of the clothes I already have, be that through mending or general uptake. I also would be putting effort into reaching out into my local fashion scene and giving back clothes into the thrift economy.\n\nThe prime course of action I feel would make me more comfortable would be to do more research on the designers themselves before spending money on their work.\n\nAgain, I am extremely appreciative for the many well thought comments. This is my first post in this community and already feel welcome.\n\nty baes :P",
            "score": 3,
            "replies": []
        },
        {
            "author": "Goat_people",
            "body": "Maybe you can use your passion to focus on acquiring skills instead of purchasing more clothes? I think fashion definitely has a place in all community! And I feel like finding ethical ways to pursue the things we love to do is a constant struggle for everyone living under capitalism. I love growing food, but farming is another level of problematic, and it can't just be solved by better land practices. Trying to feel good about the work that I do and also trying to envision more ethical ways to do it. We're all doing it together.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Fickle-Ad8351",
            "body": "There's no point in making yourself feel guilty for something you did in the past especially for something you weren't aware of. \n\nBut now that you are questioning, just look for ways to do better. Shop at a thrift store. Learn to sew. Find companies that produce their clothes ethically. I've bought a few items from a company that plants trees with every clothing purchase. Buy items from the gray market if you have access.\n\nIt's ok to want to express yourself. Passion for fashion is legitimate. Being an anarchist doesn't require that you sacrifice things you love. But desiring to live ethically will help you to become more creative.\n\nI also want to mention that it isn't your job to save the world. It's ok to indulge yourself. You can make room in your budget for charity/anarchy related activities *and* buying clothes that you love.\n\nTBH, conventional people are very shallow. They only believe what beautiful or well dressed people say. There's strategy in making yourself fashionable so that can help the cause.",
            "score": 2,
            "replies": []
        },
        {
            "author": "triangle-over-square",
            "body": "Your actions are your true values",
            "score": 2,
            "replies": [
                {
                    "author": "exp_studentID",
                    "body": "THIS! It saddens me that many people are missing the point here !",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Untoastedloaf",
            "body": "Something I personally try to do is buy second hand and then alter it if I wanna. I find it increases the feeling of self reflection because it’s something I had a part in making. I hope to one day be able to sew most of my clothes, but for now that’s where I’m at :)",
            "score": 2,
            "replies": []
        },
        {
            "author": "abandonsminty",
            "body": "Upcycle clothes/other textiles people wouldn't want into something you do or buy your clothes from your friends who can do that for you, the quality, fit and character of cottage industry clothing simply cannot be matched by mass manufacturing, and you are putting your money into your community rather than the stock portfolio of some billionaire",
            "score": 1,
            "replies": []
        },
        {
            "author": "VesaliusesSphincter",
            "body": "Renewable fashion is where it's at",
            "score": 1,
            "replies": []
        },
        {
            "author": "Big_WolverWeener",
            "body": "I love fashion too. I personally wear my Geobaskets with my DIY pieces, with my thrift/dumpster finds. I feel a big part of what anarchy is to me personally is the freedom to do whatever you want, the voice to tell about it, and the self governance to do it all with respect and integrity. \nI would rather save up funds to buy from the artist and support the vision than give my sweat and tears to some shit mega megacorp.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hi u/allthatbackfat - Your comment has been automatically removed for containing either a slur or another term that violates the [AOP](https://www.reddit.com/r/Anarchism/wiki/aop). These include gendered slurs (including those referring to genitalia) ***as well as ableist insults which denigrate intelligence, neurodivergence, etc.***\n    \nIf you are confused as to what you've said that may have triggered this response, please see [this article](https://www.autistichoya.com/2014/02/violence-linguistic-ableism.html) and the associated [glossary of ableist phrases](https://www.autistichoya.com/p/ableist-words-and-terms-to-avoid.html) **BEFORE** contacting the moderators.\n\nNo further action has been taken at this time. You're not banned, etc. Your comment will be reviewed by the moderators and handled accordingly. If it was removed by mistake, please reach out to the moderators to have the comment reinstated.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Anarchism) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MachinaExEthica",
            "body": "Recently I’ve gotten into screen printing to make my own clothes. I picked up an old sewing machine and have been learning how to alter clothes too. I like my jeans fairly tight, I like little bits of ornamental stitching that if noticed make the clothing seem unique, I rarely wear a shirt or a jacket without a message on it. Expressing yourself through your clothing can be fun and engaging. I made the comment to a friend when he asked about my shirts, “When we wear clothing we are a walking billboard for something, it can be a brand, a store, a specific message, whatever. I choose to be a walking billboard for the ideas I most want spread throughout the world.”",
            "score": 1,
            "replies": []
        },
        {
            "author": "Oshidori",
            "body": "I used to be a designer myself, so thankfully I can make my own clothes, but it is time consuming. I tend to look for small businesses that have ethical practices and production standards. Get a lot of stuff from small designers on Etsy in europe, or buy from friends who are also makers. \n\nSometimes I wonder if I should try to host free sewing classes for anarchists and revolutionaries, it really is an important skill. My grandfather was a socialist in my family's native country, as well as the village tailor. And it was because of his position being the tailor that he was able to rally the people of the aldea against the Catholic Church and throw out several priests who were raping the indigenous girls and stealing money from the people (as the church does lol). My family was excommunicated for it and have been atheist ever since, with me grandfather proudly displaying his letter of excommunication from the Vatican on the family room wall! He was even elected as the councilman twice because of this. But, this was in the 1930s. Being a tailor was more of a thing than it is now lol\n\nETA: this search engine helps\nhttps://www.ethicalconsumer.org/about-us/our-ethical-ratings",
            "score": 1,
            "replies": []
        },
        {
            "author": "Academic-Bench-2452",
            "body": "Fashion doesnt need to stop!! I thrift a ton, trade clothes with people (going to an event like that tomorrow, yaaay!!!) and Im trying to learn how to make clothes myself >>>:3 Lotsa options! Good luck!! <333 \n(Honestly I think its even more self expressive and special if you wear clothes that nobody can find in popular sites or shops muhehehe)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Remote-Remote-3848",
            "body": "I Express myself by buying the cheapest clothes i can find then telling people that ask me that i bought it supercheap...\n\nBut maybe the manufacturer use childlabour and so on...\n\nMaybe the best thing would be to saw your clothes yourself and so on. \n\n\nBtw: Sneakers is the most consumerist  Capitalist bullshit there is.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Substantial-Lynx6145",
            "body": "There is a sort of pragmatism that you have to endow when it comes to clothing, as neither the climate (cold weather exists) or social constructs (it's \"not okay\" to be naked) allow for refusal to buy clothing. If you buy clothing on utility purposes (this will keep me from freezing to death), that's fine. Buying a new swimsuit for the beach that you're going to wear once, that's bad.",
            "score": 0,
            "replies": []
        }
    ]
}