{
    "title": "Any thoughts about ICOR?",
    "author": "Fun_Lawyer_7439",
    "subreddit": "communism",
    "rank": 478,
    "score": 12,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.reddit.com/r/communism/comments/1doub71/any_thoughts_about_icor/",
    "id": "1doub71",
    "selftext": "Some explanation about goals and means, position in marxist internationals? Anything?! My organization belong to them and don't really know what to think about it.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "theaceofshadows",
            "body": "It's a social fascist international platform comprised predominantly of right opportunist and other social fascist \"ML\" and \"MLM thought\" groups. It promotes the positions of outright Hoxhaist degenerates like Germany's MLPD which has held the position of upholding \"two state solution\" in Palestine. For example,\n\n> The fact that no western European State has been able to ensure the defence of the elementary rights of the Jewish people, and to safeguard it against the violence of the fascist executioners, explains the aspirations of the Jews to establish their own state. (…)\n\n> It is essential to bear in mind the indisputable fact that the population of Palestine consists of two peoples, the Arabs and the Jews. Both have historical roots in Palestine. Palestine has become the homeland of both these peoples, each of which plays an important part in the economy and the cultural life of the country.\n\n[No ICOR constituent has condemned this](http://mlpd.minuskel.de:8098/icor/2014/palestine-conflict-the-mlpd-is-rooted-in-the-tradition-of-the-socialist-countries) and in fact, it was published on ICOR's old website with no critical comments.\n\nICOR's right opportunists like CPI-ML Red Star hold the position that they do not even know the path of revolution, that they will discover the correct strategy as they go! What kind of a Marxist \"vanguard of the people\" claims to do revolution without knowing how? On top of that, they give space to cults like the Socialist Unity Centre of India which have little to do with even Marxism-Leninism in practice.\n\nICOR continues the politics of its constituents, most of whom have purposely either kept their lines vague to appeal to populism or have stuck to Hoxhaist trends to seem ideologically sharp. An international forum that does not promote ideological unity and struggle between its constituents on incorrect line is no international centre for revolution.",
            "score": 5,
            "replies": [
                {
                    "author": "GeistTransformation1",
                    "body": "The worst thing that the ICOR has actively involved themselves in was their effort to recruit volunteer fighters for the social-fascist Rojava which is a proxy of American imperialism for the division of Syria.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Fun_Lawyer_7439",
                            "body": "They are not only volunteers for city rebuild efforts? Kinda gets ur point but still, Kurds have right to self determination and it's most progressive power in the region, more progressive and revolutionary than democratic socialist. About socio-fasc, after Trumps breaks up with rojava they  no more proxy for USA or you have another thing in mind?",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "GeistTransformation1",
                                    "body": ">after Trumps breaks up with rojava they no more proxy for USA \n\nUS troops are still hosted in Rojava; in fact they were subject to an attack nearly a year ago https://www.rudaw.net/english/middleeast/syria/251020231\n\n\n>Kurds have right to self determination and it's most progressive power in the region\n\nThe Kurdish question is independent to whether the YPG-SDF can be considered to be progressive organisations which they aren't. Albanians in Kosovo have a right to self determination but that didn't stop the pseudo-nationalist UÇK from becoming fascist contras when they sold out the Kosovar liberation movement to American imperialism.\n\nAlso, Kurds aren't even a majority the regions that are controlled by Rojava",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "Fun_Lawyer_7439",
                                            "body": "Well, didn't know that US troops still there, my bad. After reading I agree with you but I really need recommendations about some good internationale.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Fun_Lawyer_7439",
                    "body": "Actually I've been on their meeting in Berlin during LL demo and hear nothing about two state solution, that part of MLPD who I talked to, side more with one state solution. Part of their party fought with police when they stop Palestinian block within the LL Demo. Anyway, what do you propose for marxist organization then?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "HappyHandel",
            "body": "Very lousy crypto-revisionist organization, have never taken it seriously. The constituent parties are a different story and should be more fairly accessed but you also can't ignore their participation.",
            "score": 4,
            "replies": []
        }
    ]
}