{
    "title": "Comprehensive history books",
    "author": "thebigapple_",
    "subreddit": "communism",
    "rank": 446,
    "score": 27,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 14,
    "url": "https://www.reddit.com/r/communism/comments/1dzchmq/comprehensive_history_books/",
    "id": "1dzchmq",
    "selftext": "I want to read a few history books that give me a broad overview of our world history. Something like *The People’s History of the United States* (I’m not sure if it’s 100% objective and unbiased, but you get what I mean). Let me know if you have any recommendations!\n\nThank you to the previous post for the reminder! :D",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "jimo_com_limao",
            "body": "One is difficult but to understand the relations among Europe, Africa and Latin America I would recommend How Europe underdeveloped Africa, The Open Veins of Latin America and The Wretched of the Earth.",
            "score": 19,
            "replies": [
                {
                    "author": "thebigapple_",
                    "body": "Adding these to my reading list. Thank you!",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Drevil335",
            "body": "\"Unbiased\" doesn't exist as an ontological category: every work of history is imbued with class ideology -- the best and most accurate history, with the ideology of the revolutionary proletariat. I've never actually read Zinn, and his work may have some merits, but it's not proletarian in character; I'd recommend J Sakai's *Settlers* instead for the history of the Amerikan settler-colony.\n\nIn terms of other topics, I'm currently ploughing through Perry Anderson's *Lineages of the Absolutist State*; while (unfortunately) not really covering the rise of capitalism, it does a very good job of documenting the transformations of European feudalism in the critical centuries of the continent's rise to global hegemony.\n\nWhile not strictly history (for the most part), I would also recommend *Divided World Divided Class* as a rundown on the actual nature of modern global political economy, and especially the imperial core labor aristocratic class.",
            "score": 16,
            "replies": [
                {
                    "author": "Autrevml1936",
                    "body": "It's still worth reading Bourgeois historians, Scientists, etc to see what new Materialist analysis/evidence they have and see the latest in Bourgeois Mechanism and Idealism.\n\n\nWe should thoroughly critique them, take the Materialist elements and discard the Mechanism and Idealism. Marx, Engels, and Lenin did, others of their Time did so why shouldn't we?\n\n\nThough of course never take Bourgeois science at face value:\n\n\n> Throughout the civilised world the teachings of Marx evoke the utmost hostility and hatred of all bourgeois science (both official and liberal), which regards Marxism as a kind of “pernicious sect”. And no other attitude is to be expected, for there can be no “impartial” social science in a society based on class struggle. In one way or another, all official and liberal science defends wage-slavery, whereas Marxism has declared relentless war on that slavery. To expect science to be impartial in a wage-slave society is as foolishly naïve as to expect impartiality from manufacturers on the question of whether workers’ wages ought not to be increased by decreasing the profits of capital.\n- Lenin, 3 sources and 3 components of Marxism \n\n\n> Science has become subject to the dictates of the capitalist monopolies in their scramble for Profits and drive to war.\n- Cornforth, Dialectical Materialism and Science",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Drevil335",
                            "body": "Of course, I don't deny that; in fact, reading bourgeois history is unavoidable for most topics, and a lot of it is more than sufficient to get a good empirical (if not nescessarily interpretative) grasp of a historical topic. This is doubly true for those covering events prior to capitalist modernity. Even with this in mind, though, I don't see why one would want to read bourgeois history when there are good communist alternatives available; obviously you can always read between the idealist lines, but this ought to be a matter of necessity and not choice.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "thebigapple_",
                    "body": "You’re right. You worded it a lot better, I just didn’t want to accidentally buy a book that had \ncapitalist rhetoric. Thank you for the recommendations!",
                    "score": 2,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "Flamez_007",
                                    "body": "Why does Settlers and DWDC serve capitalism under the guise of left phraseology?",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "urbaseddad",
                                            "body": "Because it \"divides the working class\" (acknowledges real existing divisions and stratifications which racists try to ignore away)",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Autrevml1936",
                                    "body": "How is it \"ultra left?\"\n\n\nI keep hearing about this \"Ultra leftism\" and I haven't been able to able to get a *Materialist* definition of it.\n\n\nDengists call Anti-rev MLs and MLMs \"Ultra left\"\n\n\nRightists decry \"Gonzaloism\" as \"Ultra Left\"\n\n\nEtc. I've mainly seen it used as a Label against Theory/Theorists/analysis's that someone disagrees with(which I've seen have been differing in Materialist quality(some Dialectical, and some have been Mechanical))\n\n\nThat said I have not Read Settlers yet and will not comment on it without investigation.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "Eric Hobsbawm's four Age books - very good overviews, and he provides many references for deeper readings for particular subjects.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Potential_Cycle_8223",
            "body": "Open Veins of Latin America does a pretty sweeping run through the history of Latin America.",
            "score": 7,
            "replies": []
        }
    ]
}