{
    "title": "Take on gadafi?",
    "author": "notiek",
    "subreddit": "communism",
    "rank": 401,
    "score": 30,
    "upvote_ratio": 0.86,
    "num_comments (reported by reddit)": 10,
    "url": "https://www.reddit.com/r/communism/comments/1el8s86/take_on_gadafi/",
    "id": "1el8s86",
    "selftext": "I read probably in a tweet that he was doing miracles in Libya, and eventually tried to make an African union of countries with their currency backed by gold which was why he was eventually killed. What’s you take on the subject? I tried doing some research but everything I found was quite biased, any suggestions on where to learn more about him other than the terrible dictator rhetoric found everywhere?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "jory_prize",
            "body": "I see a lot of parallels between Maduro and Gaddafi, and you might also say the same for Hussein and Putin.\n\n\n\nUltimately, all these bourgeois nationalist movements are doomed, not because of the merits of this or that leader, but by the contradictory and obsolete nature of the nation state itself. Not only must they defend ‘their’ resources from imperialism, but also they must defend their privileged position from ‘their’ workers who must bear the ever increasing economic demands of the west. Regardless of how wealthy Libya (or Venezuela) are, they cannot compete with the massed economic and military forces of western imperialism. It’s just harsh mathematics. Gaddafi and Maduro both know this and were compelled to strike a balance between accommodating the west and social reforms. They are hostile to both the west and their working classes. Meaning their working classed are deliberately disarmed and isolated from the international proletariat, who are also deliberately disarmed by their local nationalist pseudo left parties and union bureaucracies. Unable to resist the west, instead the the burden falls on their working classes in the form of falling living standards, state repression, etc.\n\n\n\nThere is no way forward for these national reformist movements, not in the current epoch, were all problems are global problems. By extension, it falls to the international working class to do away with capitalism.\n\n\n\nThere are two articles I’ll share; \n\nCogan (https://www.wsws.org/en/articles/2011/05/gadd-m02.html) on the assassination of Gaddafi; Lobo’s (https://www.wsws.org/en/articles/2024/07/30/ejfc-j30.html) a great article about Maduro after the recent election.",
            "score": 18,
            "replies": [
                {
                    "author": "Bedrejul",
                    "body": "Countries doing socialism is the best we got. They are real powers. Without them capitalist imperial hegemony will never break. \n\n\"The international working class\" is not working very well at the moment, if at all, to do away with capitalism. It is not a real power at all. Creating more socialist countries is the way to establish a strong international working class with actual power. \n\nIMO next goal for the International working class, should be to establish a world order where nations are free to build socialism and communism, in their countries. This is in reach *only* because sovereign countries like China and Russia, and the idea of a multi polar order.\n\nInternationalism is not opposite to nations, but in fact based on nations. International socialism needs socialist countries.",
                    "score": 18,
                    "replies": [
                        {
                            "author": "PretentiousnPretty",
                            "body": "Multipolarism is nonsense, socialism will not come about because of \"sovereign countries\" but because of the vanguard party (leading the proletariat) in a revolutionary situation. \n\nChina and Russia have not helped any nations build \"socialism and communism\" (the two are not the same), but rather China continued business-as-usual with the Duterte government whilst the fascists gunned down the CPP-NPA revolutionaries who are actually building the grounds for socialism.\n\nWherever capitalism exists, you will not be free to build socialism on a national ground, but you will be endlessly targeted and subverted by foreign imperialists and reactionaries trying to regain power. The entire history of the USSR and China shows that.\n\nAlso, none of the countries mentioned above are socialist.",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "kannadegurechaff",
                                    "body": ">Multipolarism is nonsense\n\nwe really need to discuss this more, as people tend to gloss over this topic. Although it has dimmed a bit, too many leftists still claim that BRICS will bring salvation to the world, as if being against U.S. imperialism automatically makes you a socialist.",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Own_Courage_1082",
            "body": "His policies were greatly influenced and shaped around Hitlers National Socialist Germany not communism.",
            "score": 0,
            "replies": []
        }
    ]
}