{
    "title": "Decolonial Marxism",
    "author": "Obvious-Physics9071",
    "subreddit": "communism",
    "rank": 247,
    "score": 19,
    "upvote_ratio": 0.69,
    "num_comments (reported by reddit)": 40,
    "url": "https://www.reddit.com/r/communism/comments/1gmxcn7/decolonial_marxism/",
    "id": "1gmxcn7",
    "selftext": "I've seen decolonial marxism/communism mentioned in a discussion thread a few months ago but I'd be interested to see more thoughts on this trend.\n\nI'll provide some of the quotes from Rick Tabenunaka and associated people (https://twitter.com/PostScarcityPod) which might be a good basis of discussion:\n\n>The salvageable aspect of Marxism is its analysis of what was at the time an emerging industrial economy in the euro-colonial world. However, Marx/Engels' social theories were based on european episteme of thought: race science and the racist \"discipline\" of anthropology. Lenin added an analysis of imperialism, but even his analysis is tainted by colonialist euro episteme(Hobson's framework for analysis of imperialism). European theorists lack the consciousness necessary to deal with the primary contradiction, european colonialism. Hence, Fanon.\n\n...\n\n>USSR collapsed under the contradictions of Russian colonialism that Korenizatsiia didn't resolve. There will be no \"proletarian state power\" for settlers on turtle island, only Native and Black nations\n\n...\n\n>No white \"communist\" theorist who has ever existed outweighs non-european revolutionary thinkers such as Fanon, Ho Chi Minh, or Lwazi Lushaba. White/europeans lack the sensibilities, cultural proclivities, and general consciousness to dispel their chauvinist colonizer delusions.\n\n...\n\n>Marxism =/= all forms of communism. Marxism is communism imbued with european episteme, the \"civilizing\" mission, race science, the historically racist \"discipline\" of anthropology, notions of \"progress/modernity.\"\n\nIn addition to these another point I have seen raised by proponents of decolonial marxism is the claim that the theories of European marxists are entirely (or at least mostly) superfluous outside of Europe since non-europeans \"already know how to do collectivist governance\" in the vein of the Inca and other pre-colonial polities.\n\nBroadly it raises many points I am in agreement with regarding settler colonialism and the national question in the US, but also undermines/attacks aspects of Marxism from an angle which I feel is not totally correct but simultaneously one I am unable to provide a satisfying critique of.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "cyberwitchtechnobtch",
            "body": "I've said a lot things already on the matter but at this point, does it really matter? I would be more willing to critique its premises further if it bore any fundamentally new practice but it reaches the same conclusions of banal liberalism that all other current revisionists forms do, it just does so with more provocative (though ultimately reactionary) rhetoric. These people are just grifters.\n\nIf you want to read more about the consequences of such line of thinking Ajith covers it in [Of Concepts and Methods](https://foreignlanguages.press/wp-content/uploads/2021/11/N09-Of-Concepts-_-Methods-2nd-Printing.pdf) in relation to Hindutva fascism and postcolonialism in India.\n\n\n\nEdit: Or just read through this thread:\n\n[https://www.reddit.com/r/communism101/comments/1g85dfv/decolonization\\_of\\_america/](https://www.reddit.com/r/communism101/comments/1g85dfv/decolonization_of_america/)\n\n There's a more mature form of this discussion that happened there.",
            "score": 25,
            "replies": []
        },
        {
            "author": "DashtheRed",
            "body": ">>No white \"communist\" theorist who has ever existed outweighs non-european revolutionary thinkers such as Fanon, Ho Chi Minh, or Lwazi Lushaba. White/europeans lack the sensibilities, cultural proclivities, and general consciousness to dispel their chauvinist colonizer delusions.\n\nThis paragraph really seems strange to me, because I dont think they actually have familiarity with Ho Chi Minh's life.  After being exiled by French Colonialism in Indochina, he spent years in Amerika and became enamored with the idea of 'one man, one vote,' before making a failed appeal to Woodrow Wilson (who mistook him for a servant), and ended up dejected on the streets of France before meeting French communists, who were the very people representing the liberation politics Ho was advocating to Wilson, **became a founding member of the French Communist Party,** and eventually joined the Third Comintern where he regularly caucused with Lenin and Stalin, brushing up on studies at the University of Toilers, before returning to Asia (requiring Chinese communists to rescue him from Chiang Kai-Shek on at least two occasions) and only then returning to Vietnam to lead it's liberation.  Why is Ho Chi Minh being exalted but Mao is 'tainted by whiteness?'  And that's without even getting into the presumed Schrodinger's Whiteness for Lenin and Stalin, who are simultaneously white and non-white until the argument is made against them.",
            "score": 29,
            "replies": [
                {
                    "author": "Obvious-Physics9071",
                    "body": "Another thing which stood out to me about that paragraph was their choice of Ho Chi Minh in the first place.\n\nObviously Ho Chi Minh holds much weight as a revolutionary, but as a theorist he is not particularly of note, even when compared to the writings of leaders like Enver Hoxha or Kim Il-Sung. Reading over this again the fact they state Ho Chi Minh (presuming Schrodinger's Whiteness) outweighs Marx, Lenin, Stalin, etc as a theorist  should have indicated to me that there isn't actually much substance behind what they are saying.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "yotreeman",
                    "body": "You’re honestly on point af rn, but hear me out: Ho Chi Minh is basically a Neapolitan communist. “Is he white?” Well, it depends on where ya scoop.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "This is the typical ''Marxism is eurocentric'' drivel, expressed in thirld-worldist terms where theorists from outside Europe are ascribed as having an instinctive intellectual-superiority over those from Europe.\n\nAlso\n\n>Marxism =/= all forms of communism. Marxism is communism imbued with european episteme, the \"civilizing\" mission, race science, the historically racist \"discipline\" of anthropology, notions of \"progress/modernity.\"\n\n\nThis is complete nonsense.\n\nDon't bother with provocative tweets, they always lack substance.",
            "score": 52,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": -2,
                    "replies": [
                        {
                            "author": "None",
                            "body": "> Marx would be the first to say that\n\nI sincerely doubt it.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "psittachus",
            "body": "Beyond what other commenters have said, this person and Rick, the other podcaster you mentioned frequently come up on my social media and mostly engage in a symbiotic relationship with social media accounts associated with some of the more explicitly racist revisionist communist parties by attacking and responding to each other.\n\nIf you look at their posts you can easily notice how they frame the white working class' failure to engage in proletarian revolution as a moral failure that is due to their racism and lack of \"collectivist consciousness\" rather than a result of it being in their class interests to oppose such a thing. This framing is useful since the majority of these podcasters' audience (who give them views and sometimes money), from the comments I have seen on their posts, are white people with a very superficial understanding of Marxism who would have been attracted to revisionist parties had they not encountered these podcasts and followed them as a higher form of \"allyship.\" It really isn't difficult to understand that the majority of people on earth who are not white do not have some sort of \"collectivist consciousness\" and this line of thinking primarily appeals to those who have not spent a lot of time thinking seriously about colonialism or post-colonial thought and will gravitate who anyone who will tell them \"you're not racist if you listen to my podcast and donate to my patreon.\"\n\nWhile one can discount these two podcasters as tiny and irrelevant social media influencers, I think their broader ideology is worth talking about and I am happy to see it discussed on this site. Many of the younger people who split from the retired and racist leadership of the Communist Party of Canada reproduced a worldview similar to this one. As much as their posts make racists upset, that doesn't mean they provide any sort of revolutionary analysis and are rather a step away from Marxism into liberalism.",
            "score": 15,
            "replies": [
                {
                    "author": "None",
                    "body": "Exactly. Even if not always stated explicitly, this sort of framework has a tendency to construe the reactionary politics of the settler and labor aristocrat population in an intensely idealist manner. Despite often sounding quite radical, obscuring the material origin of settler reaction is profoundly unhelpful. I do still agree that it’s worth discussing though, and to be fair the decolonial crowd does often call out genuine settler chauvinism in contexts where that critique may be insufficiently made by the broader left in the imperial core.",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "MauriceBishopsGhost",
            "body": "This is not \"Decolonial Marxism\" in the way that most bourgeois academics use the term. There was a collection of Walter Rodney speeches and essays put out called \"Decolonial Marxism\". In one of the speeches titled [\"Marxism and African Liberation\"](https://www.marxists.org/subject/africa/rodney-walter/works/marxismandafrica.htm) Rodney says:\n\n>So it was possible for these individuals to make what. I consider to be a genuine attempt to break with the dominance of bourgeois thought and yet find, in the final analysis, that they had merely embraced another manifestation of that which they themselves had suggested that they were confronting at the outset.\n\n>There are a number of examples, some more apt than others. Some of the examples actually, are Africans who I think were blatantly dishonest from the beginning. I do think that most of the ideologues of African socialism claiming to find a third path are actually just cheap tricksters, who are tricksters who are attempting to hoodwink the majority of the population. I don't think they're out to develop socialism. I don't think they're out to develop anything that addresses itself to the interest of the African people. But, nevertheless, it is part of the necessity of our times that our people no longer are willing to accept anything that is not put to them in the guise of socialism.\n\n>And therefore I shan't in fact go on to African socialism.\n\nTo give one example is Léopold Senghor making the argument that the supposed existence of a pre-colonial african communitarianism in what then became Senegal better prepares Senegalese society for \"African Socialism\". But \"African Socialism\" just ends up being continued underdevelopment and colonial ties with the French. \n\nSenghor was president for 20 years and I think provides a good example of what \"African Socialism\" or \"Decolonial Marxism\" can do for Africans.\n\nThere is an irony that Rick Tabenunaka and some of the other people that they promote (like Gerald Horne) are all CPUSA members. A dying right revisionist party that spends its time tailing the right wing of the settler labor movement and Democratic party. \n\nI think Tabenunaka and the carousel of college professors and tweeters that they bring on their podcast lack the sensibilities, cultural proclivities, and general consciousness to dispel chauvinist colonizer delusions.",
            "score": 12,
            "replies": []
        },
        {
            "author": "fencerman",
            "body": "One core point made by Marx/Engels would be that they should NOT be considered the \"be-all, end-all\" of socialist thought. They are the originators of a huge number of important insights, but it's completely ignoring what they actually said to act like they were some kind of divine revelation to which nothing can be added. \n\nThe whole point of rejecting \"Metaphysical Idealism\" and embracing \"historical materialist dialectic\" is that nobody can totally overcome the context of the time and place they live in - but rather, each stage of history will add more context and insight into the human condition that can be integrated into a socialist system. There are no prophets that stand outside of history and drop \"revelations\" for humanity, there are only people living in a particular time limited by what they know and what's going on right then and there. \n\nWhole lotta people need to read some theory. https://www.marxists.org/archive/marx/works/1880/soc-utop/ch02.htm\n\nSo - yes, colonialist critiques should be listened to, at the same time they should not be automatically treated as \"true\" without solid grounding. History is an ongoing, unfolding process that we both interpret and create at the same time.",
            "score": 2,
            "replies": [
                {
                    "author": "smokeuptheweed9",
                    "body": "This sounds self evident to liberal common sense but I have never actually seen it substantiated. What is a concrete example that you can point to? The most common examples, such as Marx's writings on India in the New-York Daily Tribune and on the \"Jewish Question\" or Engels writings in the *Origin of the Family* or *Anti-Duhring* on the natural world are either based on simple misunderstandings of context and Marx's satirical style, liberal ideology hiding itself in American politics of offense (as OP's examples from twitter show), or selective, dishonest misreadings.\n\nThe actual foundation of Marxism is that the capitalist mode of production determines the totality of social phenomena and their particular expression. There is no necessary reason Marx would be wrong or limited given we still live under the capitalist mode of production. In fact, there is every reason to think the opposite, since capitalism is stronger than ever meaning our worldview is necessarily warped by it. For someone who lives by begging on twitter to believe they have a better understanding of reality than someone who was at the forefront of decades of the proletarian movement because they were born later is laughable, let alone someone who merely posts short passages from bourgeois academic works in the most provocative manner rather than the greatest thinkers of human society who conducted the most rigorous research project ever conducted for *Capital.*",
                    "score": 29,
                    "replies": []
                }
            ]
        },
        {
            "author": "ppepperwood",
            "body": "Anyone who thinks of any revolution within the Americas that does not involve land back and indigenous sovereignty is engaging in genocide erasure in my eyes. You can’t say you care about the oppressed if decolonization does not involve the Americas to you. \n\nMarx and Engels are European; that is a fact. As such they don’t understand the specific type of communism that would be required within the Americas. If you don’t look to indigenous and black theorists and understand that they are the vanguard then I don’t respect your idea of Marxism. Would you respect an “Israeli” communist who didn’t believe in Palestinian sovereignty? Many would say no, but won’t extrapolate that understanding to the Americas which is wrong. If you as a settler don’t want to give land back and want political power then go to Europe; that’s the only place where Europeans should have political power.\n\nAs Gerald Horne put it, race is class and settler-colonialism helped birth capitalism. It’s not only about the economy and any Marxism that isn’t decolonial is not revolutionary. I agree that Marxism doesn’t represent all communism. Many communists make an idol out of all these theorists and act like Marx invented things like collectivism when indigenous people did.\n\nRead “Eurocentrism and the Communist Movement” by Robert Biel.",
            "score": -8,
            "replies": [
                {
                    "author": "Chaingunfighter",
                    "body": "> If you as a settler don’t want to give land back and want political power then go to Europe; that’s the only place where Europeans should have political power.\n\nI've seen this point a few times (not just in the context of PSP that OP linked to but in the many discussions about decolonization on this subreddit) and I'm curious about it, because it's hard not to read it as a soft concession to settlers - why would or should settlers be allowed to leave, rather than be held accountable by the people who have liberated the land they occupied? Why would they be allowed to live somewhere that they could hold political power in the first place? This is noteworthy, I feel, because this line about political power is explicitly separate to reparations and European disarmament which are also mentioned frequently.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "ppepperwood",
                            "body": "Oh reparations and European disarmament are absolutely necessary! I didn’t go into deep detail in the comment but yes accountability is a necessity; I for one am not indigenous or black and so I think indigenous and black scholars have written more about how this will actually manifest within the Americas and can speak to it better than I can.  I’m Algerian and Palestinian so I understand the settler colonialism but I don’t want to speak for those who are not settlers in the Americas about what should happen in the Americas specifically. \n\nThe only thing that I will obviously speak to is that they don’t go back to Europe without paying for their crimes like you said. I was just speaking to the issue that many settler Marxists have where they consider a proletariat and think justice is political power for settlers within the Americas; I could have phrased it better but I meant that Europeans should not have political power anywhere outside of Europe.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "cyberwitchtechnobtch",
                                    "body": ">I for one am not indigenous or black and so I think indigenous and black scholars have written more about how this will actually manifest and can speak to it better than I can.\n\nFor all the rhetorical bluster about hating \"crakkkers\" or \"settlers\" all this ideology seems to attract is either petty-bourgeois radical academics or self-hating non-black/indigenous people. Do you not see how it's disrespectful for you to treat these peoples as somehow possessing some inherit knowledge of revolution for you to just mindlessly enact? They are just as competent (not more, nor less) as you and you have the obligation of conversing with them as equals.",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "ppepperwood",
                                            "body": "I’m not self-hating; I am indigenous somewhere (Palestine) but I am not indigenous here. It’s not disrespectful to recognize that indigenous people have been resisting far longer than you or I and therefore can teach us about how to resist. \n\nWould you say that Israeli settlers who claim to support a free Palestine know how Palestinians should resist just as well as the Palestinians do? No. Settlers will never be as competent in resistance as indigenous people and Black people; they know better because they’ve lived as the exploited class, not because they’ve just been graced with more knowledge than you or I which is how you are framing my argument. Acknowledging someone’s knowledge (knowledge that they’ve gained through experience) will never be disrespectful and to even suggest that makes you not someone I find worthy of engaging with further (though putting settlers in quotes was already a giveaway).",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "cyberwitchtechnobtch",
                                                    "body": ">Would you say that Israeli settlers who claim to support a free Palestine know how Palestinians should resist just as well as the Palestinians do?\n\nYes. They exist in the form of spies for the resistance within i$rael. Does every i$raeli who claims this do that? Clearly not and given how miserable their Left is, the vast majority are bound within the limits of their class instincts. This [comment ](https://www.reddit.com/r/communism101/comments/1g85dfv/comment/luxfgnp/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)explains it better than I can:\n\n>I am arguing the opposite: the will of Palestinians is perfectly comprehensible and can be critiqued in the terms of universal Marxist logic. We do not need to support \"the people,\" instead we can understand that Islamic transnationalism and secular nationalism present two competing visions of the world which, in certain instances, are both compelling.\n\nThe thread that's from is a more productive version of this one. I got too eager here and gave some rote/sloppy answers.",
                                                    "score": 16,
                                                    "replies": [
                                                        {
                                                            "author": "ppepperwood",
                                                            "body": "Ok thank you; I will check out that post. I appreciated your view point. I just have an issue with people claiming I am self-hating.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Sea_Till9977",
                                                    "body": "The truth that 'israeli' settlers are diametrically opposed to the freedom of Palestine is Marxism, simple as that. This does not require some brand of 'decolonial Marxism' which already exists in colonised nations, especially granted to such movements by some dude making a podcast in the imperial core. Now please ask Rick to explain to the PFLP and DFLP why Marxism is not decolonial or whatever.\n\nWhat's frustrating is you doubting the user you are replying to (edit: I typed this before the rest of that conversation was posted) because you refuse to acknowledge their argument. 1: This subreddit does not deny the existence of Amerikkka as a settler nation, and does not even recognise the existence of a 'white proletariat' (them putting settler in quotes isn't because they don't believe in settler-colonialism). You say the settlers can never be as 'competent' at resistance, but the user you replied to, and this sub at large, will assert that the settlers literally will not resist against the system that they benefit from (With the exception being class traitors of course). It is dialectical materialism. It is Marxism.\n\n2: For heavens sake, the user you replied to literally posted here with a good analysis of pro-Palestine organising in Amerikkka, especially criticising the complete shunning of Palestinian armed resistance and the disgusting opportunism of imperial core \"leftist' and \"communist parties\".\n\nWhile you are correct that any radical thought will arise from colonised nations, it is not because of these Orientalist \"consciousness\" assigned by some podcast from the West. It is because of dialectical materialism.\n\nI am not interested in this Orientalist idea that non-Europeans have this \"cultural proclivity\" and \"general consciousness\" to be more revolutionary. Wtaf does that even mean beyond blatant Orientalism. Especially in the age of 'decolonial' fascism like Hindutva this rhetoric isn't new or radical, it's in fact dated and ignorant. This is why it is puzzling to me, that you recommend this podcast while saying you do not subscribe to such third-world fetishising ideas of \"consciousness\". I am willing to hear you out but definitely not this podcast or whatever.\n\nAgain, Charu Majumdar, Ibrahim Kaypakkya, Fred Hampton, Fanon, Mao, Gonzalo, etc didnt dedicate their lives in implementing Marxism only for some dude online to say marxism is 'eurocentric' or whatever bullshit. There is a reason that this type of thought never comes from colonised nations themselves, it only comes from settlers, white people in Europe or petty bourgeois people of colour, especially those that live in imperialist nations.",
                                                    "score": 12,
                                                    "replies": [
                                                        {
                                                            "author": "ppepperwood",
                                                            "body": "Ok; the person replied to me with another thread and I will read that when I have more time. \n\nTo be honest, I think I had a difficult time engaging with an argument that began with telling me I am self-hating so that may have resulted in bias. I just have one question (and I am asking this in good faith), I can respect the idea that Marxism isn’t itself Eurocentric, but I find the refusal among some Marxists (mostly the ones I know irl as this space is much more open to this type of thought) to fundamentally grapple with the fact that they are settlers to be a symptom of Eurocentricity (I think the book I recommended is still worth reading even through that lens). Would you disagree there?\n\nI can understand why it is incorrect to say that Marxism is itself Eurocentric just because some Marxists can be though; I’d need to think on this more when I have more energy.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "smokeuptheweed9",
                                                                    "body": "The problem is that Twitter is garbage and if you learn to think in 280 characters the only possible way to communicate is liberal common sense phrased in the most provocative manner (so you have a pregiven common understanding but a form of novelty to differentiate your community). For example\n\n>It’s not disrespectful to recognize that indigenous people have been resisting far longer than you or I and therefore can teach us about how to resist.\n\nThis sounds radical but is actually not. It has nothing to do with \"disrespect\" but your basic ontological claim that \"resisting\" gives one a closer approximation to the truth and that they have something to teach \"us.\" For Marxism the revolutionary consciousness of the proletariat is a property of their concrete position in the capitalist mode of production which has specific, historically contingent laws of motion. It has nothing to do with \"oppression\" or \"resistance,\" under other modes of production classes act in different ways despite the common nature of class society as oppressive. In the place of a theory of politics rooted in science you are left with a politics of moral righteousness that derives from American neocolonial forms of control (where representative compradors who share a common experience of oppression can speak on its behalf rather than fighting for national liberation as an objectively necessary, progressive stage in human history). It is no coincidence that it comes from bourgeois academia (where it is called \"postcolonial theory\" or more specifically \"standpoint theory\") because that is one of the leading institutions for cultivating such a comprador class.\n\nThere is a history of Marxist politics which conflates the proletariat for the white industrial working class. But that is not Marxism, it is revisionism. We do not need \"decolonial Marxism\" because we are Marxists and they are not. Why are you running away from a fight over the truth? In your actual analysis you are committed to objective truth but in an incomplete manner\n\n>Would you say that Israeli settlers who claim to support a free Palestine know how Palestinians should resist just as well as the Palestinians do? No. Settlers will never be as competent in resistance as indigenous people and Black people; they know better because they’ve lived as the exploited class, not because they’ve just been graced with more knowledge than you or I which is how you are framing my argument. Acknowledging someone’s knowledge (knowledge that they’ve gained through experience) will never be disrespectful and to even suggest that makes you not someone I find worthy of engaging with further (though putting settlers in quotes was already a giveaway).\n\nSettler-colonialism is not an \"experience.\" It is a mode of production which structurally determines the class consciousness of those within it as exploiters or exploited. Consciousness is determined by ownership of land, labor, and surplus value, without that empirical basis you are forced to conflate many historical experiences into a vague concept of \"settlerism\" and often end up diluting your own politics (such as calling Han Chinese \"settlers\" in Western China or even Xhosa people throughout tribal lands of South Africa). Since you're a progressive person rather than a grifter, that Israeli settler-colonialism is the priority is common sense. That's not good enough, as your own objections to the presence of Israeli settler-colonialists in the politics of Palestinian national liberation because of \"competence\" is clearly much weaker than an objection based on their existence as a member of an exploiter class in their objective actions, not their subjective self-identity as an \"ally\" or whatever. More abstractly, because of the twitter way of thinking, you're using terms that are not defined and fall apart under scrutiny (even \"European\" is unclear given the OP tweeter makes an argument straight from the CIA that the entire socialist bloc was Russian oppression/colonialism, presumably covering not just Eastern Europe but Central Asia).\n\nIf you're Algerian you are quite familiar with the limits of decolonization and the dangers of ahistorical cultural essentialism given there was a civil war over these ideas. You are far more familiar with it than a bunch of academics. We are not saying you're self-hating but you seem to lack confidence. Gerald Horne is a grifter for the CPUSA. Why do you care what he thinks? These people on twitter we're discussing are failed academics who think social media is an alternative path either back into the system or making a living directly through donations and ads for sharing their intellectual labor. You don't owe them career help and we're engaging with you and not them because for them \"engagement\" is itself the goal. On the other hand, as someone in academia with vicarious connections to many of the famous \"post-colonial\" thinkers, they look down on you and their vulgar followers on twitter (and their own grad students for that matter). They are literary scholars, trained for research in the old colonial way, and I guarantee you they don't know who \"decolonizing buffalo\" is and they don't care. At best the generation after them who are forgettable (like Robert Biel) want to use social media to feel better about living in the shadow of people like Derrida or Foucault (who, whatever you think of them, are household names and important, original thinkers). Both sides are playing you for a fool.",
                                                                    "score": 12,
                                                                    "replies": [
                                                                        {
                                                                            "author": "ppepperwood",
                                                                            "body": "Ok; I honestly appreciate this perspective. I didn’t run; I more so just realized I am tired and this is not going to be my best thinking. I replied to their comment thanking them when they guided me to your comment on another thread. \n\nCan you expand more on what you said about Gerald Horne or link me somewhere? I am completely unfamiliar with that. His books on settler-colonialism were incredibly enlightening to me; if I’m not meant to care what he thinks where would you recommend I guide people who want to adequately grapple with the settler-colonialist history of Amerika? I haven’t found someone to do so as comprehensively but I’m open to recommendations.",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "smokeuptheweed9",
                                                                                    "body": "https://readsettlers.org/index.html\n\n>Can you expand more on what you said about Gerald Horne or link me somewhere? I am completely unfamiliar with that. His books on settler-colonialism were incredibly enlightening to me\n\nIt's just a worse version of *Settlers* without any theory of settler-colonialism and anything interesting to say about contemporary politics, unless you think the struggle over the New York Times 1619 project is revolutionary. Also his scholarship is untrustworthy in a way that's not obvious to a layman reader so I would never suggest his work even if the overall point is obvious enough so you don't embarrass yourself and repeat some \"fact\" you got from the book.\n\nBut I'm not really in the business of pitting scholars against each other like academia is wrestling. The onus is on you to explain what you found \"enlightening.\"\n\n>I didn’t run; I more so just realized I am tired and this is not going to be my best thinking\n\nI'm not saying you're running from this discussion. I'm saying that running into the institutions of academia is a fundamental problem of \"decolonial theory\" because without a theory of class or praxis, who else can synthesize the lessons of \"lived experience?\" This is a theory of the comprador bourgeoisie in the neo-colonial setting (as Fanon pointed out long ago) and it's bizarre when people pose as speakers for the most oppressed by reference to some obscure academic who makes six figures and use incomprehensible, hyper-specialized terminology (and opposing \"Europeans\" to wealthy senior professors in the U.S.). \n\nYou may be familiar with that Judith Butler quote that won a prize for bad writing\n\n>The move from a structuralist account in which capital is understood to structure social relations in relatively homologous ways to a view of hegemony in which power relations are subject to repetition, convergence, and rearticulation brought the question of temporality into the thinking of structure, and marked a shift from a form of Althusserian theory that takes structural totalities as theoretical objects to one in which the insights into the contingent possibility of structure inaugurate a renewed conception of hegemony as bound up with the contingent sites and strategies of the rearticulation of power\n\nI actually know what this says but I also understand that Marxism is not synonymous with class consciousness (it's also just saying something obvious and not that substantive). For people to root their own legitimacy in a direct connection to the consciousness of the most oppressed while using incomprehensible jargon to do so is absurd on its face, which is probably why most of the time spent on twitter is everyone angrily \"calling out\" everyone else who would dare to question the positionality of someone to speak for the oppressed (since spending all your time posting on twitter is itself a sign of immense privilege).\n\nAlso, surprise, when one of their own was accused to sexual assault, all these academics closed ranks including Butler. I assume the graduate student who made the accusation is now unemployable. These people are not your allies, they are using you for their own careers.",
                                                                                    "score": 17,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "ppepperwood",
                                                                                            "body": "This makes a lot of sense; thank you for the discourse. I’ll check out settlers.",
                                                                                            "score": 2,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Sea_Till9977",
                                                                    "body": "Right, I did not necessarily take their mention of the term self-hatred to be directed specifically at you but I can't speak for them or you.\n\nWhat actually reveals the faux-decolonial nature of \"marxism is eurocentric and bad\" is the class nature of where this thought stems from, which I already mentioned as petite-bourgeois people in imperialist nations (or the same in colonised nations).\n\nWith regards to your point about settler Marxists, I will give you context before explaining my position. I am Indian, and do not have any experience with Amerikkkan politics in real life. Although I do have experience with revisionist 'communist' organisations in the UK. Point is, I do not have a personal experience of such settler ideas (the Amerikkkan type at least, I have unfortunately plenty of experience with zionist settlers but most of them are fascists and don't even pretend to be woke or whatever)\n\nAnyway, I think the term Eurocentric itself is used flippantly, either as a 'gotcha' or by people who don't actually know what it means. I say that because many settler and white (I don't like using that term because there are plenty of POC marxists in the imperialist nations who do the same) 'Marxists' that do not critique their own class position acknowledge the third world, are supposedly against Eurocentrism, claim to fight for colonised nations etc.\n\nTo work on the premise that settler Marxists fail to grapple with settlerism because of Eurocentrism, assumes the idea that if they just cared more about third world nations and widened their view, they would stop being ignorant settlers (That's how I see it at least, correct me if my logic is wrong here) and would become enlightened. Such ideas have only led to to leftists in the imperial core rejecting Marxism under the guise of some woke idea of Eurocentrism, which in reality is just a spit in the face of the people-powered Marxist-Leninist-Maoist movements in the third world.\n\nEdit: beyond all this, I personally get pissed off when someone like Marx who dedicated his whole damn life living in exile, with little money, polemicising against colonialism, and producing one of themost important works of all time, gets called 'eurocentric' by petty bourgeois activists living in way more comfort than he did. And I will reiterate what the other user said, we cannot project our conceptions of 'white' back into time, when the very construction of whiteness (at the time) involved the exclusion of jews, slavs, etc.",
                                                                    "score": 11,
                                                                    "replies": [
                                                                        {
                                                                            "author": "ppepperwood",
                                                                            "body": "I wouldn’t say that’s the premise (but I am just speaking from my personal experience here); even if they widened their view, many of these people I refer to as settler Marxists do not acknowledge their class position because many want to believe that they are the oppressed class when in reality if we thought about the global population, lower middle-class Amerikans (those are the ones I’m most around) would be considered rich on a global scale. \n\nTo many of these people, engaging in real Marxism would be against their self-interest and so they co-opt it (from my experience these people don’t do away with Marxism generally if you call their view eurocentric, but I’ve gotten into many arguments where they try to convince me that settlers should hold political power within a Marxist party). \n\nI think what you’ve said about Marx himself is completely valid. Maybe I’m guilty of considering Marxism itself Eurocentric just because I’ve met so many self-proclaimed Marxists who refuse to fully engage with the idea of a decolonized Amerika; when I bring it up they act as though the age of the settler colony justifies its continued existence somehow (this goes back to what kwame ture talks about as the idea of  a “successful” settler-colony in his lecture on pan-africanism). \n\nDo you have any readings you recommend that expand on this idea that Marxism is itself not Eurocentric? It’s something I can extrapolate from seeing how it was used in non-European movements but I’d love to read more on this specifically.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "urbaseddad",
                                                                                    "body": "> Do you have any readings you recommend that expand on this idea that Marxism is itself not Eurocentric?\n\nYes, Marx's and Engels' works themselves. A rudimentary understanding of Marxism makes it clear Marxism has a universal logic and objective truth and leaves in shambles any claim of Eurocentrism, as well as all the postmodern subjectivism and metaphysical idealism bordering on Orientalism (as several others have pointed out) you've been engaging in in this thread.",
                                                                                    "score": 7,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "cyberwitchtechnobtch",
                    "body": ">As such they don’t understand the specific type of Marxism that would be required within the Americas.\n\nMarxism is simply Marxism, a universal theory applied to concrete circumstances, there is no \"specific type.\" This exact logic is what Dengists already believe and it's no coincidence \"Decolonial\" Marxists arrive at the same conclusions of Dengism (Socialism modified by some inherit \"Chinese characteristics\"). All you're doing is revising Marxism to rid it of some mystical sin of \"Europeaness\" that is somehow inherit to it, and substituting that gap with a righteous, \"Indigeneaity\" of whatever form (mostly academic). Even the defense of the latter is just kinda disrespectful as the many indigenous societies of Turtle Island were more complex than just some vague romanticized (and ultimately orientalist) \"collectivism\" and took on varying forms of social organization.\n\n>If you as a settler don’t want to give land back and want political power then go to Europe; that’s the only place where Europeans should have political power.\n\nCertainly we live in the world of a global labor arbitrage but all Decolonial Marxism does is take reality as is and projects those observations back in time. The Europe of Marx's time was not the Europe we see today and by most measures, Marx as a Jew would not have been immediately characterized as \"German\" let alone European. Same for Lenin in Russia, and then most obviously Mao in China. Gonzalo in Peru. Joma in the Philippines. Charu Majumdar in India. etc. etc. While each having to address the particulars of their societies, none of them felt the need to treat Marxism like some dirty rag that was cleaner than all the others around. They understood its explanatory power. You might say Decolonial Marxism agrees with this but it is arguing for something fundamentally different and non-Marxist.\n\n>Anyone who thinks of any revolution within the Americas that does not involve land back and indigenous sovereignty is engaging in genocide erasure in my eyes. You can’t say you care about the oppressed if decolonization does not involve the Americas to you.\n\nEverything you said about revolution in Amerika is technically true but nothing within Decolonial Marxism provides any feasible path towards that and as much as it tries to remain rigorous, all it can do is pick through the garbage pile of academia for any modern \"theoretical\" insights.",
                    "score": 18,
                    "replies": [
                        {
                            "author": "ppepperwood",
                            "body": "I think we agree on many points but you disagree with the terminology of decolonial Marxism because of how some people use it. That’s fair; I usually prefer to explain the specific views rather than using terms for which many people may have slightly different workable definitions because of what they’ve previously been exposed to. \n\nOn the whole I just believe in a Marxism that includes land back and structure my politics around decolonization first and foremost because I find that many settler marxists do not. There are also people within other leftist disciplines that try to fight the centering of settlers. For example, though I am not an anarchist, I found it really helpful to read Klee Benally’s book on indigenous anarchy in defense of the sacred to understand settler anarchism. \n\nReading through many indigenous and black theorists makes me inclined to disagree that there aren’t “decolonial marxists” who provide a feasible path towards revolution. Maybe they don’t use that terminology but indigenous people have been resisting for 500 years; if people looked to them to actually lead and left their colonial chauvinism at the door they could be mobilized. The truth is many of them won’t because they do not want to use their colonial privilege.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -6,
            "replies": [
                {
                    "author": "None",
                    "body": "This isn’t even an attempt at a good faith critique of the decolonial milieu in question. There is certainly room for critique, but to refer to it as merely chauvinist or race essentialist betrays a pretty fundamental misunderstanding of the material reality of labor aristocracy and settlerism.\n\nEdit: to be clear, I do want to reiterate that I think there are real critiques to be made. A lot that is written here (albeit written by a settler) still holds up imo: http://moufawad-paul.blogspot.com/2013/12/from-anticolonial-to-decolonial.html\n\nI just don’t see how dismissal out of hand is at all helpful",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -2,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 7,
                    "replies": []
                }
            ]
        }
    ]
}