{
    "title": "Bi-Weekly Discussion Thread - (November 10)",
    "author": "AutoModerator",
    "subreddit": "communism",
    "rank": 246,
    "score": 16,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 59,
    "url": "https://www.reddit.com/r/communism/comments/1gnnnjo/biweekly_discussion_thread_november_10/",
    "id": "1gnnnjo",
    "selftext": "We made this because Reddit's algorithm prioritises headlines and current events and doesn't allow for deeper, extended discussion - depending on how it goes for the first four or five times it'll be dropped or continued.\n\nSuggestions for things you might want to comment here (this is a work in progress and we'll change this over time):\n\n* Articles and quotes you want to see discussed\n* 'Slow' events - long-term trends, org updates, things that didn't happen recently\n* 'Fluff' posts that we usually discourage elsewhere - e.g \"How are you feeling today?\"\n* Discussions continued from other posts once the original post gets buried\n* Questions that are too advanced, complicated or obscure for r/communism101\n\nMods will sometimes sticky things they think are particularly important.\n\nNormal subreddit rules apply!\n\n[ Previous Bi-Weekly Discussion Threads may be found here https://old.reddit.com/r/communism/search?sort=new&restrict_sr=on&q=flair%3AWDT ]",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "StrawBicycleThief",
            "body": "[In memory of older Third Worldists](https://robashlar.substack.com/p/in-memory-of-older-third-worldists)\n\n> Recently that ‘Fine, Fine Hate Amerikkka Beat’ has been going around Twitter. It’s interesting to see this classic meme reintroduced to a completely new audience that knows nothing about its history. The music video has aged incredibly well, both aesthetically and politically. Its creator Shubel Morgan was a brilliant satirist and deeply committed member of the movement. He belonged to a tiny Maoist-Third Worldist group called Leading Light Communist Organization (LLCO), founded by Prairie Fire, which originally emerged as a splinter of Maoist Internationalist Movement (MIM), founded by Henry Park. These two organizations (or more accurately, sects) were the only representatives of Third Worldism in the Anglophone Left during the 1990s and 2000s. Shubel was perhaps the most media-savvy member of either group, but both were quite clever when it came to media, especially the then-new internet. Over the years, across scattered writings and unwritten conversations, a good idea of these stories have emerged. I am writing this sketch in honor of these people and their organizations. For better and worse, they played a major role in crafting modern far-left internet culture.",
            "score": 21,
            "replies": []
        },
        {
            "author": "Reasonable-Donkey200",
            "body": "I posted a couple times in the past about Covid and am hoping it can be revisited as a topic of discussion as we enter its fifth year. I know it is not good to tail Twitter discourse and I apologize for the extent to which I have done that, but I have noticed a conspicuous shortage of communist thinking about it and I do think this needs to be corrected.\n\nI claim, as a matter of scientific fact, that Covid continues to pose a major public health risk, now primarily in the form of major long-term post-infection health effects (long Covid) appearing in a significant and likely growing minority of the population, while at the same time currently circulating at a low-enough level that society is able to function \"normally\", individuals taking zero precautions may be able to go months or years between infections, and the continuing harm can be kept out of mainstream consciousness. I am hoping that this is not controversial - I consider disputing this to be like disputing the grave threat of climate change because it's cold outside.\n\nThe only activism around addressing this is being conducted by \"Covid conscious\" communities, which are largely (but not exclusively) first-world, petit-bourgeois, and liberal or anarchist. As with climate change, I do not believe their petit-bourgeois character makes them wrong about the matter, though it limits their political effectiveness. Their influence can be seen in the visible presence of masks at pro-Palestine protests, to which US local governments have responded with mask bans. They have also caused disputes with people in the DSA-like and PSL-like milieus - the Covid conscious people say that orgs that do not promote masking are not concerned about disability or about helping or recruiting vulnerable people, and the response is to dismiss Covid concerns as either distractions from or obstacles to \"organizing the working class\" or as the delusions of hypochondriacs. These kinds of dismissals do not seem very Marxist to me.\n\nA key point to mention is that the normalization of Covid - the premature declaration of victory, plus the dismantlement of public health so that governments will never again have to respond to Covid or any other future epidemic - was carried out under Biden. Before Biden, liberals proudly wore masks as part of being progressive and anti-Trump; after Biden, liberals abandoned their masks and happily forgot about Covid, even adopting the same anti-mask and Covid-denial stances they previously ridiculed. That more Covid deaths have now occurred under Biden than under Trump is not acknowledged. Like other parts of liberalism, the post-Biden minimization of Covid is now hegemonic, and my fear is that leftists have absorbed this hegemony completely uncritically.\n\nWe can acknowledge that solving Covid requires dismantling capitalism, not donating masks to the needy or lobbying the government to reverse course. However, this doesn't explain the rejection of Covid as an issue within organizing itself. Perhaps the conclusion is that the overall situation is so dire and urgent that organizers cannot prioritize hard stances on Covid despite the real danger, and that would-be revolutionaries must accept the risk of Covid death or disability just as they must accept other risks as an inevitable part of struggle. But I don't think anyone is actually making this argument and committing to its implications. I mostly just see people dismissing the risk and using liberal common senses as justification, or just repeating the Biden position outright. And this sub has cautioned against falling for \"urgency\" over pursuing principled scientific inquiry.\n\nThere are many more dimensions to this but I will stop myself here.",
            "score": 21,
            "replies": []
        },
        {
            "author": "TheReimMinister",
            "body": "Many months ago I mentioned that I was engaging in a deeper study about migration, economy, and class structure in order to present something useful about the topic as I had treated it too abstractly and fragmentarily in the past. Unfortunately due to circumstances that deeper study never did not progress very far. However I wouldn't mind talking a little bit about it here.\n\nIn a nutshell, the product is relatively banal: \n\na) human migration is differentiated from animal migration by its social aspect. Of course the evolutionary leap from animals to humans was part and parcel with the rapid adoption of the strategy of social organization and cooperative labour - social organization to protect females and young from male sexual jealousy being the evolutionary leap, and conscious social organization and production following it and flourishing as a strategy due to its strength. Therefore migration is social, first and foremost. It isn't simply a bunch of atomized individuals moving across natural landscapes.\n\nb) migration mediates the ability of social actors to reproduce their own existence, which becomes embedded in historical class society. With the inception of class society (private property), migration becomes a negotiation of class status - still social, but we acknowledge that the social has been cleaved according to ones relation to production. Another hoop to jump through logically and historically. \n\nc) migration is then routed through the mode of production, which increases in complexity, and is coloured by its root logic. This is as simple as nomadic groups moving to follow a food source, and becomes as complex as labourers migrating across capitalist-imperialist borders for a better wage. In the latter case, where the law of value rules, it is a case of exchange between nation states.\n\nd) given the anarchy produced by the cleavage of societies into classes, and the resultant emergence of the state as a mediator of class contradictions, it stands to reason that the state mediates the class contradictions emergent through migration (seeing as we know migration is a negotiation of class status). Therefore migration is controlled according to the interests of the ruling class (or the ruling alliance of classes, no matter how temporary) and their desire to reproduce their own existence as such. The logic of the ruling class (state) is, of course, the logic of the mode of production which permitted and preserves their class rule.\n\ne) it stands to reason that i)migration is hopelessly entangled in ii) society, iii)class, iv)production, and v) superstructure. Therefore if one of these 5 things are altered in some way, the others are altered in turn.\n\nAs you can see, this is basically a reproduction of various works of Marx and Engels but with the word \"migration\" thrown in lol! Not so difficult to figure out, no? Well the goal is not to rediscover the scientific tools that Marxism already handed down, but to apply them to concrete situations. So the above can be tested and compared against the complete concrete history of a given geographical area, which is where I made it about 15% of the way.\n\nFor example, we know that Russia was on its way to feudalism (like Western Europe) but had its progression interrupted by the fragmentation of Kievan Rus and subsequent yoke placed on it by the Mongolian hordes. From then on we can study migration to see how it is intertwined with the development of the Russian state. Kliuchevsky, one of the more well-known historians of the late Tsarist Russia, actually said “(wee see that) the principal fundamental factor in Russian history has been migration or colonisation, and that all other factors have been more or less inseparably connected herewith”. How so?\n\nWell, once the Russian state began to be consolidated again around the late 15th century - having reoriented itself from Kiev towards the NorthEast - it began its march towards feudalism once again. The landowners of Russia, in political alliance with the feudal nobility (and counting themselves amongst them), had an issue that would only get larger as the Tsardom continued to expand (and became an Empire): the flight of peasants to the borderlands of the large and expanding Russian territories. Therefore, beginning with Ivan III in 1497 and continuing over the years and Tsars, the rights of peasants to free movement became increasingly restricted until outright enserfment occurred - and still after that, mobility of the peasants was cracked down upon further (including with laws to recover fugitive peasants after an increasing number of years). This didn't stop peasant flight to black earth borders (and to the developing towns), but it did make it a lot more difficult. And it is worth noting that these superstructural restrictions on movement applied almost strictly to the peasant class, so solidifying their class status (and the class status of the landowners and nobility) and solidifying the natural economy of the countryside by supplying it with sufficient labour (at the expense of the manufacturing economy of the towns and their classes). Meanwhile those peasants who did escape renegotiated their class status: they not only could snag some land of their own in the outer regions (or under better terms from landowners on the outskirts - for instance, no serfdom in Siberia at this point), they could become labourers in the feudal towns. Where they could escape and stay gone, they developed their own consciousness (see: Cossacks) and defended their peasant freedom against servile feudalization. Therefore, a differentiation among the peasantry that was intimately tied to migration.\n\nThe Russian Empire was greatly interested in expanding Eastward and southward, and to do so they put the Cossacks at the front (their own version of Settler shock troops). And as the less-populated areas eastward (into Siberia) and southward (into Ukraine and south Russia/Caucausus) had better potential for peasants to work the land and improve status, so flight continued and differentiation among the peasantry increased (some even became merchants and industralists). Free colonisation of land dominated, and official programs of colonisation did not occur until later on. Sometimes this presented opportunity for Russian peasants who had fled and could now negotiate better terms with the imperial ambitions of the Russian state, other times the State invited in settlers from other countries (like the Germans and the Mennonites) to be the landowning middle peasantry and the Russian peasants worked under them. But it wasn't until late 19th and early 20th century that offical colonisation programs that implicated Russian peasants really developed. \n\nAs an aside, it is interesting to note that many historians of Russia compare its colonisation and its settlers to the settlers of the USA. For example, Donald Treadgold brings up the \"steam valve\" theory of Frederick Jackson Turner and wonders if a similar identity-thru-settlement emerged among the Russian settlers of SIberia as had among Americans. Other historians like Bartlett compare some of the Russian settlers to the \"free, gunwielding\" American settlers. Such historians cheer the flight of the peasants and the colonisation programs of Russia post-reform, and fume at the Soviet programs.\n\nAnyhow, over the years of growing class contradiction, the liberalism of the nascent bourgeoisie of the feudal towns grew. They wanted emancipation of the serfs, implicitly the unleashing of labour to the developing industrial towns and cities. And when the emancipation of the serfs did happen, migration out of the \"old\" feudal areas exploded - lots to the Siberian areas that had been cleared by conquest (and smallpox), but yes, also lots to the more urban centres and to the steppes of SW Russia and central asia. Such migration likely reached its zenith after Stolypin brought in land reforms and sponsored further migration in 1905 - from here on the percentage of private property among landholdings went up further.\n\nLenin studied closely the migration of peasants in the post-reform (post-1861) period in his *Development of Capitalism in Russia*. He saw that agriculture was developing toward capitalism but was weighed down by the strong feudal relations, and saw that capitalist agriculture was spreading at the areas of new colonisation while being fettered in the areas of old settlement. Therefore while capitalism in industry did develop in old and new areas of settlement, it was obscured in new areas by the availability of land to settle and work. He said: \"the solution of the contradiction inherent in, and produced by capitalism is temporarily postponed because of the fact that capitalism can easily develop in breadth\". He studied migration patterns and saw that migrants from the areas where wages were lowest (central, old areas) were attracted to the southern/eastern border regions and metropolitan areas where wages were higher, and that this caused wages to increase in the areas from whence they departed. \"Such is the movement of the emancipated!\". This is why he argued against the Narodniks and saw the removal of barriers to migration as key.\n\nIn a nutshell, the restriction of mobility (along class lines) was strongly tied to the construction and maintenance of the feudal mode of production and its class relations whereas migration - at first illegal and later official - was tied to class mobility and the growth of capitalism. So, how did the Soviets handle this post-revolution?\n\nGiven that I am out of space, all I can say here for now is that mobility remained tied to class lines, but was repurposed to build socialism: mobility was tied to work! If the old parasitic stratas wanted the papers to move around, they needed employment books to show that they were now productive workers. Later on, mobility was tied to the needs of the collective economy. But with no space, this is a topic for another day.",
            "score": 22,
            "replies": [
                {
                    "author": "TheReimMinister",
                    "body": "I feel like I should add on a little bit here so the story isn't too disjointed and since I have some time.\n\nBasically, the Soviets implemented various legislation post-revolution that aimed to restrict the mobility of the former parasitic classes (as I noted at the end of my comment above). To do so, they took superstructural heritage of the overthrown imperial Russian state and reoriented it to the needs of socialist construction. First came the \"Temporary Work Certificate for the Bourgeoisie\" near the end of 1918, which, as I said above, was required for the former parasitic classes (think landowners, merchants, nobility, officers) to move about the country or obtain ration cards. Employment books were introduced for all workers over the next few years, but normal workers understandably had a lot more mobility.  According to my notes, Article 5 of the RFSR civil code gave all citizens the right of unrestricted travel across the whole country, and mobility of the classes ultimately peaked during the years of the New Economic Program, for understandable reasons tied to the goals for production; however I will note here that non-workers did not have equal political or civil rights in this regard.\n\nCome collectivization, more superstructural mechanisms were put in place to ensure that labour mobility was closely tied to the economic plans of the country. Firstly, as the NEP ended the right to freely change jobs or residence was restricted, and a new passport was implemented to better control migration from rural to urban settings - given that collectivization of agriculture was a large part of these economic plans, relevant legislation and controls were enacted. Labour migration could occur but was part of the economic planning, whereas passports (for mobility within and without) were distributed to those engaged in socially useful labour (this included collective farm workers, if they had permission to leave). By 1932, the Central Executive Committee released a new resolution seeking to better register the populations of towns and worker's settlements. The goal was to clear people not involved in production, work in institutions/schools, or otherwise engaged in socially useful labour (see: purging of kulaks, criminals, anticommunists) (with the exception of invalids and pensioners of course) in order to ease the pressure on towns and make space for actual workers. Further, the goal was to expose parasitic class enemies - the passport and propiska (residence permit) were intimately linked to the right to work. \n\nThe above paragraphs are not hard to understand. In order to have rights, you need to work, in a socially useful way, if you are able to (this included rural populations if on state farm or in machine-tractor stations). So there were many parasitic people who, not meeting these terms, were expelled from cities/former properties and sent to labour camps. Many fled on their own, of course - many leaving the country. Implementation was not seamless nor perfect, of course, but it did the job well and there were appeal processes in place (the Party listened to and sought to correct mistakes, including repressing the workarounds). Constant implementation, assessment, and adjustment to implement better was the policy.\n\nGradually this passport system was expanded to more and more settlements (it started in the most populous and important places) and it peaked in about 1953. Basically, you had different regions that you could get access to, depending on your passport which, again, was tied to your work (Border zones, closed towns, 1st-2nd category regions, simple passport areas, and finally rural areas where no passports were needed to travel around). Your passport and propiska, tied to work (and thus area of residence), were tied to the services you could get, and everyone was guaranteed a certain space of housing as per health standards. And your propiska prospects could improve if you were an honest worker - this included the formerly repressed populations.\n\nI don't have as many notes on the post-Stalin era, but I do know that reform occurred through the mid to late 50s and afterward. There was some rehabilitation of formerly repressed people from 1955, and starting from the 1960s, following Kosigyn's reforms and the need for a more mobile population, temporary propiska were issued to address labour shortage in different industries - mostly seasonal work in larger population centres. There were further lessening of restrictions as the years went on, and rural to urban migration increased. Krushchev, seeking a \"homogenous society\", wanted a passport system that did not differentiate - subsequently there were attempts to universalize the passport in 1967, 1969, and 1973. Finally, in 1973, a new constitution declaring equal rights for all citizens was passed (after attempting such a constitution since about 1962). Then further passport reform in 1974 which eased restrictions and did not list \"social status\", and more constitutional adjustments in 1977 which were driven by the economic and social \"modernization\" post-Stalin. In 1981, it was declared that differentiation between the city and country were gone. Internal migration increased further at this time.\n\nIt's worth noting that internal migration within the USSR includes not only the Russian portion, but the Central Asian Republics and Ukraine as well. With less and less restriction on mobility, workers from these areas could temporarily migrate to the Russian land to work. After the USSR was brought down, in 1993 freedom of movement was brought back by decree. Subsequently the Russian Federation has done much to streamline the process by which migrant workers from the former Soviet republics can temporarily locate in Russia to work. But I won't get into that as much - given the recency, there is a lot of literature on the topic if you are interested.\n\nNow this is a rather surface-level summary of the history (in these 2 comments) that does not get too deep into the concrete, and since I don't know Russian there were many documents that I could not read and so I can't claim near 100% accuracy, but even at this level of understanding the ties between migration, society, class, production, and superstructure can be seen. It is clearest in the Soviet example, given that they were conscious of the connection and wielded superstructural mechanisms to control mobility for planned socialist production and for class repression. However, I think it is still quite clear in the examples of pre-and-post revolutionary Russia that migration is intimately tied to class and goals of economic production, albeit moreso implicit in policy and statistics. Whereas Lenin and the Soviets were clear about where and when (and for who) labour mobility made sense for the planned economy, influential capitalists and landowners in pre-revolutionary Russia were scared that full mobility of the peasantry would create a scarcity of wage-labourers and land renters. It goes to show that there is plenty of \"planning\" in capitalist modes of production as well - one only need to take a look at the oft-discussed immigration targets in Canada for example (and to see the political jockeying around such targets in order to secure enough class collaboration to maintain rule) to see that.\n\nMany similar studies could be made of China, which similarly had a household registration system in the Feudal era that was repurposed for socialist construction and, subsequently, capitalist restoriation and foreign capital. Even if we are to look at imperialist nations today and study their migration policies and patterns, we can see how mobility remains tied to economic production and class differentiation.\n\nSome of the books I read and took notes on for this include:\n\nPerry Anderson:\n-\t*Passages from Antiquity to Feudalism* and *Lineages of the Abolutist State*\n\nVladimir Lenin\n-\t*The Development of Capitalism in Russia* and *The Agrarian Programme*\n\nUSSR Academy of Sciences\n-\t*Political Economy Textbook*\n\nRoger P. Bartlett\n-\t*A History of Russia* and *Human Capital: Settlement of Foreigners 1762-1804*\n\nAlbert Baiburin\n-\t*The Soviet Passport* (note that I scanned many pages from this book but I lost the scans, so all that I have are my notes. He's a bit whiny so it's not a huge loss and I think I extracted anything useful from it anyhow)\n\nLaws of the Soviet Union\n-\t*1936 Constitution* and various other documents\n\nBernard Pares\n-\t*A History of Russia*\n\nDonald W. Treadgold\n-\t*The Great Siberian Migration*\n\nVladimir Klyuchevsky\n-\t*History of Russia* (5 volumes)\n\n\nYes, there are a lot of liberals in that list but we are sharp enough to take what is useful from them.",
                    "score": 18,
                    "replies": []
                }
            ]
        },
        {
            "author": "smokeuptheweed9",
            "body": "https://www.channelnewsasia.com/asia/sri-lanka-president-make-u-turn-imf-president-anura-kumara-dissanayake-bailout-4762046\n\nNot a surprise to anyone paying attention but that's the point. After Sri Lanka served its purpose in the great game to Dengists, we're the last people for whom Sri Lanka still exists. Other than Sri Lankans themselves of course, who are a minor inconvenience to \"geopolitics.\"",
            "score": 21,
            "replies": []
        },
        {
            "author": "None",
            "body": "I was at my local zoo today when I saw a Zoologist in the aviary speaking to a Macaw and taking notes. We chatted and he told me that he was trying to understand how animals form interspecies communication without any physical reward mechanism, as he had heard from the zoo workers that the macaw was formerly friends with a macaw of a different species. He brought up the flaws of previous experiments studying interspecies communication through apes using reward mechanisms (which I would assume includes, but is not limited to the only example I know of, the Nim Chimpsky study which was then used as evidence to support the Chomskian view that humans have a unique biological capacity to learn complex language from a young age) and how animals might actually be able to comprehend human languages and emotions, and we could be able to understand how animals perceive other species.\n\nAs anyone can tell from that paragraph, I have absolutely no familiarity with either animal studies or linguistics so I'm not entirely sure of how to ask: How can animals understand humans? In the anecdote above the animal was in an enclosed exhibit which I am unsure of whether or not it was born in, and every day humans come in to ogle at the birds. The bird is fed daily by workers (which I am unsure of whether or not it knows, as bowls are simply strewn about the enclosure and washed and refilled with seed daily rather than zookeepers giving food directly to the birds) and cared for by way of checkups or perhaps preening. Does the macaw understand to some degree that humans represent, or at least humans believe that they represent some kind of authority figure over the bird, and therefore any communication the bird makes with a human it will understand as an appeal to the authority which it will take as some sort of reward mechanism in its own right? How might this study differ if it were on, say, a macaw who lives in the amazon rainforest and has merely observed humans in a nearby village?\n\nI plan to study animal linguistics in college so I'm at least hoping any discussion here will direct me to some interesting sources on the subject. I've lately been trying to understand Marxist critique of Chomskian linguistics better so I have just begun this text.\n\nEdit: I believe that my questions are mired in anarchist terminology because I consider animals to live in primitive-communist society and only able to consider a human captor in a kratocratic (at least I think that's a word) sense. I think basing all of my questions on that assumption could be limiting my viewpoint, but could that assumption still be correct to some extent?",
            "score": 13,
            "replies": [
                {
                    "author": "meltingintoair",
                    "body": ">Does the macaw understand to some degree that humans represent, or at least humans believe that they represent some kind of authority figure over the bird, and therefore any communication the bird makes with a human it will understand as an appeal to the authority which it will take as some sort of reward mechanism in its own right? How might this study differ if it were on, say, a macaw who lives in the amazon rainforest and has merely observed humans in a nearby village?\n\nI think you have to be careful with conflating human and animal consciousness and reading human social forms back into animal behaviors. Humans differentiate themselves from animals through [labor activity and producing their means of subsistence](https://www.marxists.org/archive/marx/works/1845/german-ideology/ch01a.htm):\n\n>Men can be distinguished from animals by consciousness, by religion or anything else you like. They themselves begin to distinguish themselves from animals as soon as they begin to produce their means of subsistence, a step which is conditioned by their physical organization. By producing their means of subsistence men are indirectly producing their actual material life.\n\nAnd human labor involves an [\"ideal plane\" of representations](https://www.marxists.org/archive/ilyenkov/works/essays/essay8.htm):\n\n>The ideal also appears as the product and form of human labour, of the purposive transformation of natural material and social relations effected by social man. The ideal is present only where there is an individual performing his activity in forms given to him by the preceding development of humanity. Man is distinguished from beasts by the existence of an ideal plane of activity. ‘But what ... distinguishes the most incompetent architect and the best of bees, is that the architect has built a cell in his head before he constructs it in wax. The labour process ends in the creation of something which, when the process began, already existed in the worker’s imagination, already existed in an ideal form.’ \n\nHumans separate themselves from the external world by the reflection the world into our consciousness as a subjective image of it, and systems of representations are expressed through language. Language is a cultural artifact which is socio-historically determined and assimilated, mediating human activity. Animals differ in that they don't represent the external world on an ideal plane, but rather they \"merge\" with it. \n\n>We must once more note that if the head is understood naturalistically, i.e. as a material organ of the separate individual’s body, then there is no difference in principle, it transpires, between the architect and the bee. The wax cell that the bee builds also exists beforehand in the form of the pattern of the insect’s activity programmed in its nerve centres. In that sense the product of the bee’s activity is also given ‘ideally’ before its real performance. But the insect’s forms of activity are innate in it, inherited together with the structural, anatomical organisation of its body. The form of activity that we can denote as the ideal existence of the product is never differentiated from the body of the animal in any other way than as some real product. The fundamental distinction between man’s activity and the activity of an animal is this, that no one form of this activity, no one faculty, is inherited together with the anatomical organisation of the body. All forms of activity (active faculties) are passed on only in the form of objects created by man for man. The individual mastery of a humanly determined form of activity, i.e. the ideal image of its object and product, are therefore transformed in a special process that does not coincide with the objective moulding of nature (shaping of nature in objects). The form itself of man’s activity is therefore transformed into a special object, into the object of special activity.\n\nAnimals therefore aren't \"social\" in the same sense as humans, lacking these mediating cultural artifacts. Without these social forms, it's not accurate to say that the birds in your example have an understanding of \"authority\" as figures, institutions or concepts because those would belong to human social formations. \"Authority\" is ideological, ideal and embedded in human practices within cultural institutions which interpellate a human subject to recognize and reproduce it. The birds wouldn't have a concept of \"authority\" mediating their activity with humans, and I wouldn't think that birds in the rainforest would spontaneously reproduce the behavior of the birds in the zoo, only if humans conditioned the same behavior through feeding them in both places. \n\n>Vygotsky suggested that while the behavior of non-human animals was explainable in terms of stimulus and response conditioning, human activity was mediated by social forms. While ripples on the water could direct a heron to dive for fish, humans could treat the ripples as a sign instead of automatically reacting, modifying their own response to it, for instance by adding a colorful float to their fishing line. The modus classicus for Vygotsky and Tomasello here is learning to point. While an infant’s extended reaching gesture might at first be met with the response that her mother gives her what she is reaching towards, over time it can become a mutually recognized sign which the infant has learned to appropriate to express her intentions. The mutual recognition involved in acting with others allows us to develop concepts with which to grasp the world. Tomasello has extended this hypothesis by noting that chimps raised in captivity can also be taught to point, though this pointing remains at the level of indicating what they want. Human infants meanwhile learn to point for a range of purposes such as expressing interest or directing someone to something they might want.\n\nFrom [this article](https://cosmonautmag.com/2021/11/a-marxist-psychology-of-language-and-representation/#easy-footnote-4-5313) which also summarizes the basics of Marxist theory of language. The birds outside of captivity would lack a cultural sign to direct them towards humans for feeding the same way natural phenomenon (like the \"ripples in the water\" from the above example) would drive them to feed on their own. Through human's conditioning their behavior they could learn a basic understanding of the feeding process. However that would be different than a young human who would eventually learn to grasp the sign itself and use it to indicate a wider range of meanings. \n\nI haven't read much about Chomsky at all but his theory about locating language as the product of a pre-social material organ instead of it existing socially sounds like vulgar materialism, and would be incompatible with a Marxist theory of language.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "None",
                            "body": "Thank you, this is exactly what I needed. So, if I understood right, because social relations require an ideal plane of representations to function, and animals are governed by seeking commodities\\*  through actions controlled via innate stimulus-response mechanisms, animals are incapable of understanding representations or modifying their responses to suit an immediate situation, and therefore could not understand a human as an authority figure as that would require ideology?\n\n\\*Or, if that term could only be connected to social relations, I could say \"having specific needs met\" instead?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "meltingintoair",
                                    "body": "Ya your edit is more correct. Commodities are a product of human labor. They are made up of a material use-value and an ideal value-form. But material use-values, as Marx says in the first chapter of *Capital* and reiterates later in *Critique of the Gotha Program*, can be furnished by Nature and not solely by labor. Using the example above: the wax made from a bee is a use-value made through a natural process, but doesn't contain any human labor or social relations to furnish so it is not a commodity; the same wax harvested by humans, and either worked on further into another form before exchange or just exchanged as is, is a commodity and is stamped with the ideal (contains value). Animals don't seek commodities because they aren't engaged in commodity production, and wax production for them is to fill an [\"organic need\"](https://www.marxists.org/archive/ilyenkov/works/articles/psychology.htm) which isn't yet stamped with the ideal as human production and consumption is.\n\nPotapov gave a talk expanding on this Ilyekov-Vygotsky Marxist view in his Cosmonaut article, which you might find helpful. Talks some more about animal-human communication and \"niche construction\": https://youtu.be/rFYHYNo5Wag?si=zpE8YN2Ci_Q-ezxn\n\nI haven't studied much beyond the basic texts of Ilyenkov and Vygotsky and how they differentiate between human and animal consciousness, so I don't really have much to say regarding how animals actually communicate or how their psyche's function. Potapov mentions Tomasello, and he might be a good place to start seeing he's written on primate communication and cognition.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[https://www.marxists.org/subject/psychology/works/jones/biology.htm](https://www.marxists.org/subject/psychology/works/jones/biology.htm)\n\nEdit: to clarify I know nothing about this author nor do I have any opinion on the text yet, it was just the first thing that came up when I looked up criticism of Chomskian linguistics.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "MauriceBishopsGhost",
                    "body": "I don't really understand your edit. Don't animals live in a capitalist society?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "MauriceBishopsGhost",
                                    "body": "I mean it literally. You are talking about animals in a zoo right? As an example the Macaws at the Philadelphia Zoo are in a zoo in Philadelphia in the U.S. in Capitalist society.\n\nUnless I am taking this too literally. I think that most usually social relations in Marxism refers to relations between human persons though as a mode of production capitalism also determines how humans relate to the natural world.\n\nAlso in a literal sense what do you mean by anarchist terminology and what do you mean by kratocratic?",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": ">I mean it literally. You are talking about animals in a zoo right? As an example the Macaws at the Philadelphia Zoo are in a zoo in Philadelphia in the U.S. in Capitalist society.\n\nOh I get it, I meant Macaws in the wild would be living in a primitive society. I don't think those relations are possible to fully replicate in a zoo.\n\n>Also in a literal sense what do you mean by anarchist terminology and what do you mean by kratocratic?\n\nI kept using \"Authority figure\" to talk about a human having full control over an animal's autonomy, but I think my use of the word was too akin to saying \"totalitarian,\" as if macaws don't have authority figures and live complete independently of one another in the wild, which isn't the case. I have no idea how macaws live and interact with each other in their habitat, but assuming their survival is dependent on collective effort, then even in the wild I'm sure some consolidation of authority has to take place.\n\n>Everywhere combined action, the complication of processes dependent upon each other, displaces independent action by individuals. But whoever mentions combined action speaks of organisation; now, is it possible to have organisation without authority?\n\nAs for \"kratocratic\" I understand the word as \"ruling through physical strength alone\", as in how a human can overpower many animals and assuming the Macaw's wings were clipped at the zoo, it might understand that a human can do harm to it if their actions don't appeal to one, like how an abused animal might not try to do anything it knows will enable abuse from its owner (I've considered zoo captivity to have a similar effect on an animal's psyche)\n\nI hope I'm being coherent. It's late where I am.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "MauriceBishopsGhost",
                                                    "body": "I do think I understand.\n\nto my knowledge \"Primitive Communism\" like capitalism, feudalism is a mode of production. Both the productive forces and the relations of production. Productive forces being the labor, materials, means of production and things being produced. Relations of production being the familial, political, class relations by which production and reproduction happens. \n\nIn that sense, Primitive Communism refers to a way that groups of human beings produce things to survive and describes ways that they relate to each other and to the natural world in order to do so. Though primitive communism would lack both class divisions and capital accumulation you would see other characteristics of a mode of production.\n\nThat isn't to say that non-human animals don't relate to each other in a particular way, that their life isn't dependent upon a particular kind of relationship between each other. Though I don't believe that non-human animals really have class society, society or authority in the way that you are describing. \n\nI am really reticent to use some of these terms to refer to animals because (at least where I am) it can play into a sort of petit-bourgeois morality regarding animal rights. To give one example: the description of factory farming as slavery.\n\nI know there were some soviet debates on linguistics. For instance Stalin had this article \"Marxism and the Problems of Linguistics\" which was in response to some questions related to a few other articles. That might be a good starting place. \n\nhttps://www.marxists.org/reference/archive/stalin/works/1950/jun/20.htm\n\nIt also has reference to the second chapter of the German Ideology which might also be worth your time. \n\nThere are others who might be better equipped to answer your question regarding the scientific method. You should check back through the last few biweekly discussion threads as folks have been discussing this recently.",
                                                    "score": 7,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Ruff_Ruffman",
                                                    "body": "> but assuming their *survival is dependent on collective effort*, then even in the wild I'm sure some consolidation of authority has to take place.\n\nAssuming macaws have a drive to survive and aren't suicidal, why would they need authority for them to act in a way that ensures their survival?",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "I quoted *On Authority* as my explanation for why I thought that, but I shouldn't have been so quick to apply logic for human organization onto animals. If I were to justify my claim better I'd need more knowledge on how Macaws interact in the wild.",
                                                            "score": 4,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Far_Permission_8659",
            "body": "This is continued from the previous thread but I thought it would be fruitful to put further discussion here to incentivize external input.\n\nhttps://www.reddit.com/r/communism/s/thckOz1qRC\n\n/u/red_star_erika /u/cyberwitchtechnobtch\n\nAlthough I’m also reticent of dominating the space with Amerikan electoral news given its general lack of clarity for the national question. I’ll defer to the mods if this is veering too much into chauvinism.",
            "score": 11,
            "replies": [
                {
                    "author": "red_star_erika",
                    "body": "[in response to your [most recent reply in that thread](https://old.reddit.com/r/communism/comments/1gcyh43/biweekly_discussion_thread_october_27/lwheys4/)]\n\nwhen I said \"I agree not all Latine are Chicane\", I was moreso coming from a place of questioning the usefulness of the categories of Latine/Hispanic for lacking clarity on the national question. like I wouldn't call a white Cuban Chicane. I don't think I agree that documentation status can be used to say who is \"Chicane\" and who is \"Latine\". my instinct is that it is a matter of class within the nation rather than determinant of nationality itself and pushing it would separate the vulnerable proletariat from potential allies of other classes. and many people are generations removed from this question at all. I feel a lot of this discussion overthinks the simple explanation that oppressed nation petty bourgeoisie, labor aristocrats, and even the lumpen can often benefit from the oppressor nation (which I see as different from \"false consciousness\"). while all of the above can be potential allies, that is never a guarantee. like it isn't seen as abnormal that a lot of New Afrikans voted for a pig-politician who built her career off the injustice system. \n\nI've mostly offered skepticism but I would like more clarity on who constitutes the Chicane nation so I think the discussion is good even though I am wary of the terms it is occurring on. like you, I don't live near Aztlán (not that one has to be to be knowledgeable on the matter, involved in the Chicane struggle, or Chicane themselves) so I value any input. I still need to read the book from the MIM(Prisons) study group.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "FinikeroRojo",
                            "body": "Hard question to answer been looking for the answer for about 10 years and I'm not satisfied with anything I've read. Still going through the struggle for aztlan but it has repeated some of the stuff I'm skeptical of. Like the idea of the indigenous cultural identity of the nation being Aztec or even uto-aztecan which is something I reject. There's also seems to be a sort of difference between documented and undocumented people unsure as y'all mentioned if this is a class difference or a national difference. and there's also the question of whether other \"Latino\" groups belong to the nation or not. I've been struggling with these questions even when I was a liberal and there is deep disagreement within el movimiento about this shit which has led to some of the orgs splintering like Mecha in 2019-2020",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "red_star_erika",
                                    "body": "the Communist Party of Aztlán rejects the notion that the struggle for Aztlán is necessarily tied to Aztec identity:  https://www.prisoncensorship.info/article/on-indigenismo-and-the-land-question-in-aztlan (use Tor)\n\nI also recall an MIM-affiliated source arguing that being Chicane isn't exclusive to those from Mexico but I can't seem to find it right now. [the book I mentioned](https://leftwingbooks.net/en-us/products/chican-power-and-the-struggle-for-aztlan), which serves as the political line for CPA(MLM), probably elaborates on this question better.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "FinikeroRojo",
                                            "body": "Yeah that's the book I'm reading too and what I was referring to. They wrote that article but yet in the book they write:\n\n \" The Aztecs are believed to be the first to stably occupy this region,\rAztlan was the historic homeland of the Aztec people, who would then become Mexicans and later Chicanes. It was from Aztlan that the Aztecs\rmigrated south to build the Aztec capital Tenochtitlan. Although the\rprecise geographic location of historic Aztlan has not been located, most\rscholars and historians agree that Aztlan is in what today is called the\rSouthwest United States,” territories that the United States stole from\rMexico: California, Arizona, Utah, Nevada, New Mexico, Texas and parts\rOf Wyoming, Colorado and Oklahoma. Evidence of Aztec culture is still\rbring found today in states as far out as Kansas and Oklahoma\"\n\nBar for bar the Mexica movement line on Aztlan. not only is it not true that the Aztecs were the first to stably occupy the region at all, most scholars do not agree that Aztlan was in the south west at all. Mexican scholars in particular dismiss this from my experience.\n\nI don't like the obsession with Aztlan and Aztec culture it is alienating to most of the nation.\n\nEdit: I don't think we should even call the Chicano nation Aztlan nor have the name in the communist party most people don't know wtf we're talking about yo and most of them know that they have no Aztec ancestors (most people know where they are from and it's not Mexico city)",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "FinikeroRojo",
                                                    "body": "Actually the Mexica movement seems to have changed it's line on Aztlan somewhat so that's no longer true but it used to be I think! Lol\n\nhttps://mexicamovement.org/about-mm/our-philosophy/",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "cyberwitchtechnobtch",
                                            "body": "The book is a decent introduction but is more a summary of different aspects of the Chicane national question. When I first read it, I was left with a feeling of wanting since being from the \"southwest\" it didn't illicit any immediate understand of what to do politically. Granted I don't think that's the book's fault and given the circumstances it was created under, it's a strong basis to work from but I think it lacks theoretical richness.\n\nWhat was most lacking is any elaboration of the indigenous tribes and their development. I understand the book is about the Chicane nation *specifically* but the purported territory the nation spans also coincides with that of the aforementioned tribes. Granted, when pressed on the question, I think (or at least hope) the CPA would align with internationalism by aiming to unite with the Native proletariat, but currently there's still a lot to be desired.\n\nAs for the distinction between Latine and Chicane, the example you provided on New Afrikans is a good reminder of the limits of thinking purely national and racial terms and the possible confusion of not distinguishing them.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Autrevml1936",
            "body": "Is it that the Labor Aristocracy works on the C=M=C Circuit similar to the Proletariat but a little different?\n\n\nIn my thoughts the LA exchanges their Commodity Labor Power for some Money(C=M) but this money is more value than the Value of Labor Power so it is really C=M' or C=M+**s** s being the Super Profits from Imperialism. But then with this **s** they can afford to buy either More Commodities than the Value of Labor Power (M'=C') and/or enter into the M=C=M' Circuit(whether it takes the form of the stock market or buying a house, etc, doesn't exactly matter here).\n\n\nSo it would be:\n\n\nProletariat: C=M=C\n\n\nLA: C=M' or C=M+**s**  --> M'=C' &/or M=C + M(the **s**)=C=M'\n\n\nThough would it be M=C' regardless of the **s** due to cheap Commodities?",
            "score": 11,
            "replies": []
        },
        {
            "author": "CharuMajumdarsGhost",
            "body": "Has the international call for people's war in india website/blog been taken down permanently? I haven't been able to open it for a couple of weeks. They are also not replying over email. \n\nhttps://icspwindia.wordpress.com/",
            "score": 12,
            "replies": [
                {
                    "author": "CharuMajumdarsGhost",
                    "body": "I received a reply from them. \n\nhttps://maoistroad.blogspot.com/2024/11/icspwi-press-release.html?m=1 \n\nThey directed me here.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "DaalKulak",
                    "body": "While it is down(hopefully temporarily), you can use waybackmachine to access their materials:\n\n[https://web.archive.org/web/20241003011403/https://icspwindia.wordpress.com/](https://web.archive.org/web/20241003011403/https://icspwindia.wordpress.com/)",
                    "score": 7,
                    "replies": [
                        {
                            "author": "CharuMajumdarsGhost",
                            "body": "Thank you for this.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "Is there a simple material understanding for 'nostalgia'? What exactly is nostalgia I suppose would be a better question. I have a hard time understanding its development, especially because so much of pop-leftist 'theory' incorporates it almost as an aesthetic tool. Admittedly, I'm referencing someone like Mark Fisher who has seemingly dominated my specific class basis (petty-bourgeoise, American) in the last decade+.",
            "score": 8,
            "replies": [
                {
                    "author": "sonkeybong",
                    "body": "I'll just add on to this that the popularity of musicians like Hozier, Noah Kahane, Laufey, etc is definitely related, with the former two being related to the \"cottagecore\" aesthetic trend, a nostalgia for an imagined time where white settlers had all of the benefits of modern imperialism but instead of competing for alienating office jobs, they just churned butter with their \"community\" or whatever. Kind of like what u/Firm-Price8594 is getting at.\n\n\nAs an example, here's what creates this aesthetic in the song \"Cherry Wine\" by Hozier. At the level of instrumentation, It's one guy with his guitar, which leaves lots of open space. The part is Travis picked, so that the chords are implied by the relationship between the melody and the bass note, and the melody is doubled by the guitar. The chords in question are all diatonic, so there isn't ever a strong sense of directionionality. The only real \"pull\" that occurs in verse is the IV back to the I, and even then the IV is an implied maj7 by the (almost entirely pentatonic) melody, weakening the pull even more. The same is true of the chorus, where there is just a ii-V that leads back to the verse, but it's done using diads to dilute this directionality. All of this, together, creates an organic, earthy, tranquil, and sparse sound that is the perfect commodity for the consumption of a specific petite-bourgeois demographic. \n\n\nThere's also the lyrics to look at, and Hozier's use of metaphor here is reminiscent of a certain style of writing but I don't know enough to pinpoint it. For example, \n\n\n> Her eyes and words are so icy / Oh but she burns / Like rum on the fire\n\n\nI would imagine very few of us first-worlders still heat our homes with a wood fire, and there is no indication of hozier going camping in the song, but if you're attracted to the aforementioned \"cottagecore\" trend then it makes perfect sense. Additionally, \n\n\n> Calls of guilty thrown at me /All while she stains / The sheets of some other\n\n\nPerhaps I'm reading tea leaves but for whatever reason it is of significance to me that these sheets are handmade, they do not say \"made in Bangladesh\" on the tag. Again, it's part of the petite-bourgeois fetishization of \"handmade,\" \"artisanal,\" and \"guilt-free\" consumption without thinking about how it is that we have the time to make \"handmade\" things.\n\n\nThe latter (Laufey) is kind of the embodiment of that one hilariously shitty Taylor Swift lyric from \"I hate it here\"\n\n\n> \"My friends used to play a game where we would pick a decade, we wished we could live in instead of this / I'd say the 1830s but without all the racists and getting married off for the highest bid\"\n\n\nOnly instead of the 1830s it's the 1940s/50s because she basically just recreates white people jazz from that era but without improvisation. I think everyone here knows of the reactionary character of white people who reminisce about the time when you could buy a house with a wraparound porch for $17, half a peanut butter jelly sandwich, and a firm handshake and Laufey's audience is that. I could probably say something about her lame appropriation of Bossa Nova but this comment is long enough already. \n\n\nAnyway, I'm not totally satisfied with what I've said here but whenever discussions of music happens, it's almost always in terms of broad strokes about entire genres. Even when specific songs are discussed, the lyrics are usually the only part discussed, and music is more than just lyrics.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "MassClassSuicide",
                            "body": "I enjoyed this discussion. But I would encourage you and u/cyberwitchtechnobtch to remember this Marx quote:\n\n>Technology discloses man’s mode of dealing with Nature, the process of production by which he sustains his life, and thereby also lays bare the mode of formation of his social relations, and of the mental conceptions that flow from them. Every history of religion, even, that fails to take account of this material basis, is uncritical. **It is, in reality, much easier to discover by analysis the earthly core of the misty creations of religion, than, conversely, it is, to develop from the actual relations of life the corresponding celestialised forms of those relations.** The latter method is the only materialistic, and therefore the only scientific one.\n\nThe worst writings of critical theorists start at the level of the superstructure and move backwards to justify it with reference to something material. But this a flat ahistorical method. Actual critical materialism on the other hand moves from the material and shows why and how the social relations arise from them. It's is much harder to do the later and a cheap trick to do the former. \n\nFor example, after your technical discussion of the Hozier song, you conclude:\n\n> All of this, together, creates an organic, earthy, tranquil, and sparse sound that is the perfect commodity for the consumption of a specific petite-bourgeois demographi.\n\nHow is it that the conclusion follows from the premise? What is a perfect commodity, are there imperfect commodities? To point out that the music is a commodity doesn't help us. And of course, the artist Hozier is petit bourgeois, by definition. I understand your meaning to be that this specific song-commodity appears to have been made with a certain class demographic in mind. But again, this doesn't tell us much about the material process to arrive at this aesthetic. Nearly all leisure time commodities are geared towards the same consumer class, which are quite varied in aesthetic, as Jameson remarks:\n\n>If the ideas of a ruling class were once the dominant (or hegemonic) ideology of bourgeois society, the advanced capitalist countries today are now a field of stylistic and discursive heterogeneity without a norm.\n\nWhich is a byproduct of commodification and the market entering more and more areas of production. This is the singular fact needed to understand and organize most of Jameson's observations in his essay. The fact that capitalism works everywhere by the same logic, is how we can build upon Capital to understand our post-modern world, rather than needing a new post-Capital. \n\nMeanwhile, however, the heterogeneity of aesthetics produced by the market is likewise paired by the absolute homogeneity of the commodities produced within that market sector. The variety in the selection of aesthetics pales in comparison to the homogeneity of output required by mechanical reproduction of use-values. For music, for all the artists and genres available to select on Spotify, within each song, the commodity itself is identical and exactly reproducible. The experience of consumption is equal between all, which is what makes the building of a community around the aesthetic possible. Contrast this with early classical music, produced outside of the market. This music resists commodification, and tho it has been retroactively commodified into sheet music, orchestral reproductions - eventually recorded into Spotify albums - there is still a distance between the original composition and the commodified forms, which are all interpretations or renditions. In our 'post-modern' age however, this is not possible, and all musical production fully within the bounds of the market, receiving its imprint. Either as a complete embrace of it, in which case the commodity is identical with the production and there is no difference, or even as a conscious rejection of it (see artists like Henry Cow), in which case the consumption of the unreproducible experience becomes the commodity, or the spontaneous improvised production is eventually pressed into a record. \n\nWhich returns us to the particular aesthetics that are commodified:\n\n>For with the collapse of the high-modernist ideology of style ... the producers of culture have nowhere to turn but to the past: the imitation of dead styles, speech through all the masks and voices stored up in the imaginary museum of a now global culture.\n\nThe reason the museum of 'global culture' is imaginary, is because culture is not global but national. The nation is the superstructure reflection of the internal market, and thus national culture must reflect only the prevailing relations of production of the nation itself. It's useful to draw a distinction between culture and custom, in that culture is living, breathing and always changing, while custom is previous culture no longer in lock step with the nation. Intellectuals such as Hozier may attempt to create national culture but, as market imperatives are the final determination of all production, there is no guarantee that they are successful. In most cases they are not, but, though they may be conflicted internally, the market demands they produce. The quickest way to then produce with some semblance of giving voice to the nation is through appeals to custom. Cowboy Carter was exactly this, as was Renaissance. \n\nWe must grapple with the question of why music at all, as opposed to any other medium. The US is clearly the reference point, where the 'sole American music' was from the black slaves (see this chapter in the [souls of black folk](https://www.gutenberg.org/files/408/408-h/408-h.htm#chap14) and this on in the [gift of black folk](https://www.gutenberg.org/cache/epub/66398/pg66398-images.html#CHAPTER_VII)). Music was the medium available to the slaves who were prevented from learning to read or write. The national culture they created was indicative of their physical capture and bondage, speaking of freedom from slavery in heaven. \n\n>In these songs, I have said, the slave spoke to the world. Such a message is\nnaturally veiled and half articulate. Words and music have lost each other and new and cant phrases of a dimly understood theology have displaced the older sentiment. Once in a while we catch a strange word of an unknown tongue, as the “Mighty Myo,” which figures as a river of death; more often slight words or mere doggerel are joined to music of singular sweetness. Purely secular songs are few in number, partly because many of them were turned into hymns by a change of words, partly because the frolics were seldom heard by the stranger, and the music less often caught. Of nearly all the songs, however, the music is distinctly sorrowful.\n\nBeing kept in bondage, forced to labor for another nation parasitically, leads the slave to rebel and reject all work, even rejecting their physical body. This is not unlike how Hegel describes the unhappy consciousness of the slave:\n\n> the Unhappy Consciousness (1) the Alienated Soul which is the consciousness of self as a divided nature, a doubled and merely contradictory being. ... the simple unalterable, as essential, the other, the manifold and changeable as the unessential ... Consciousness of life, of its existence and action, is merely pain and sorrow over this existence and activity; for therein consciousness finds only consciousness of its opposite as its essence — and of its own nothingness.\n\nThe slave songs, then, express these social relations. But keep in mind, these passive slave songs hit the american market and were commodified in 1867, just as this previous culture passed into custom. Post and during reconstruction, instead, the aggressive blues expressed the new culture of the black nation as a freed proletariat. Which brings us back to Hozier, whose father was an irish blues and jazz musican. How is that Jazz and blues came to applied to the irish context? I found a study that looks into this and will come back with thoughts once I read it.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "cyberwitchtechnobtch",
                                    "body": "Essential reminder with that Marx quote, thank you. Good starting place for reviewing/critiquing what I wrote previously in this thread.",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "cyberwitchtechnobtch",
                            "body": "I appreciate the employment of harmonic analysis with an explicit attempt to uncover the political motivations behind the chord choices.\n\n>The chords in question are all diatonic, so there isn't ever a strong sense of directionionality. The only real \"pull\" that occurs in verse is the IV back to the I, and even then the IV is an implied maj7 by the (almost entirely pentatonic) melody, weakening the pull even more. The same is true of the chorus, where there is just a ii-V that leads back to the verse, but it's done using diads to dilute this directionality.\n\nThis is true of a lot of pop music but takes on a specific characteristic when factoring all the other affects in, arriving at a particular postmodern fantasy of a \"folksy\" life on a farm sitting alone with your guitar reminiscing about a vague (though subtly violent as the lyrics allude to), rural romance in a small town. What's interesting is the theme is something common if not cliche to the Blues, with the chord structure following a somewhat standard 12 bar form. What's missing is the tension from the any dominant chord colors - as you said, everything is gently diatonic. So gone is the burning passions found within the clashing tritones found in the blues and instead we see the \"approachable\" version. Quite damningly, it is the blues for white people (and the song is part of a long lineage of similar appropriations) and to a broad, multinational Amerikan consumer base.\n\n>Perhaps I'm reading tea leaves but for whatever reason it is of significance to me that these sheets are handmade, they do not say \"made in Bangladesh\" on the tag. Again, it's part of the petite-bourgeois fetishization of \"handmade,\" \"artisanal,\" and \"guilt-free\" consumption without thinking about how it is that we have the time to make \"handmade\" things.\n\nI think you did read a little bit too far into the tea leaves since instead the lyrics in that part motion to what I was saying earlier, the lamenting about a \"folksy\" romance. What makes this particularly postmodern though is the combination of rural, hometown fantasy with the violence of the \"urban\" (a violent and messy relationship between two people) presented in a form palatable for the abstract consumer (mostly Euro-Amerikans, as, if you've seen the music video, the main characters are white). Put plainly, the hometown is the fetish for the urban/suburban consumer to project their anxieties onto, since lamenting about the alienation of the suburbs is already the domain of another genre, pop-punk/midwest emo and the like. And really it would either be just boring or somewhat existentially horrifying to see one's miserable life put out in front of them without the romance of an imagined, small-town Amerika (though that too makes its appearance in its own genres - liminal spaces, indie-horror games, etc.).\n\nMoving on to Laufey,\n\n>I think everyone here knows of the reactionary character of white people who reminisce about the time when you could buy a house with a wraparound porch for $17, half a peanut butter jelly sandwich, and a firm handshake and Laufey's audience is that.\n\nIs it really that? From what I can tell Laufey has a more diverse fanbase than what you're describing, though the fantasy still remains somewhat the same, though more abstract. Which begs the question of the role of a multinational (within the u.$. I mean) consumer aristocracy in Amerika and their relation to settler-colonialism.\\* I'm relying a bit on these artist's music videos to support some of the analysis but one of the music videos for \"From the Start\" is shot to mimic the aesthetics of a Wes Anderson film which is somewhat telling regarding what corner of the market Laufey is targeting (or which she herself feels drawn to). Since film isn't my area of expertise, that's all I can really say. As for the aforementioned multinational (though perhaps multicultural is another word one could use but I'm going to try and avoid it for now) consumer aristocracy, the two songs you picked are actually pretty good complements. Both are flattened to the horizon of the market under late capitalism so they each have a generally multinational audience but Hozier is recreating a specifically Euro-Amerikan fantasy of small-town amerika while Laufey ventures into the multicultural realm of urban amerika. But each is diluted so much, that is they are scrubbed rather cleanly of their New-Afrikan origins (\"From the Start\" just barely has an ornamentation in the solo melody that is clearly from be-bop), that really \"anyone\" can enjoy them on their way to the office or while shopping at Whole Foods.\n\n\\*I'm realizing now, as this comment is getting longer I introduced a pretty big question, a multinational consumer aristocracy, without really getting to details of what that means. I'm using it as a stand in for the labor aristocracy and petit-bourgeois (the consumer aristocracy) of the different oppressed nations in the u.$. I haven't seen anyone else here use the word \"multinational\" in conjunction with consumer aristocracy (at least not from what I can remember) so that is a term I've just come up with a shorthand. Consumer aristocracy may already even imply multiple nationalities but at this point I'm getting neurotic about it.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "sonkeybong",
                                    "body": ">I think you did read a little bit too far into the tea leaves since instead the lyrics in that part motion to what I was saying earlier, the lamenting about a \"folksy\" romance.\n\nYeah, I thought so, but for whatever reason the imagery conjured up by that line has always stood out to me for that reason.\n\n>Is it really that? From what I can tell Laufey has a more diverse fanbase than what you're describing, though the fantasy still remains somewhat the same, though more abstract. \n\nYou're probably right. In this case I am only describing what I've observed as someone who lives in a fairly small town, so that specific fantasy is just very prevalent. \n\nAll this being said, I feel like it's too easy to just look at music that I would expect to hear at a Wal-Mart. Eventually, I plan to face the music (pun intended) and analyze something that I consider to be actually good. I also want to try and analyze more instrumental music just because I haven't seen hardly any analyses of it. One comment that stood out to me was from a conversation you were having with u/[Far\\_Permission\\_8659](https://www.reddit.com/user/Far_Permission_8659/) where they said \n\n>the entire DIY scene existed to enforce a limbo where music served petty bourgeois artists without succumbing to “big business”. Nobody ever seemed to discuss who made the CDs or computers themselves, nor how the fantasy of DIY basically existed off the back of a global proletariat that made all the materials for one to “do it themselves”. The general communist movement at the time, from some I experienced but much of the older scene I read about, was mostly to tail this and try to co-opt it for revolutionary ends. I think we can look back now and see the reactionary sentiments that had already predominated the scene. After all, MAGA is a kind of “do it yourself” for Amerikan industrialization.\n\nThere's a band that I saw live a few years back called Marbin. They're a jazz fusion band that explicitly brands themselves as \"DIY,\" and if I were to have to come up with a single adjective that describes their sound I would have to agree. See for example, \"African Shabtay,\" \"Alabama Sock Party,\" \"Dirty Horse pt 2,\" etc. However, not unlike the American \"MAGA\" movement's DIY for industrialization which exists on the back of the global proletariat, Marbin is not \"doing it themselves\" either. Their entire sonic identity is a pastiche of styles that were created by the labor of nonwhite people. There's more I want to say and I will edit this later but I have work now.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "nearlyoctober",
                                            "body": "I don't have time to respond but I recently was mulling over similar questions and read this article: https://www.marxists.org/subject/china/peking-review/1974/PR1974-09d.htm\n\n> To claim that one melody could be used to express these two diametrically opposed feelings would be sheer charlatanry.\n\nWhich also reminded me of that Zizek clip on Beethoven: https://www.youtube.com/watch?v=XM9erS90gTE\n\nIf we're allowed to flatten vaporwave nostalgia and Laufey nostalgia and Taylor Swift nostalgia together (we could differentiate, but...), I'm tempted to say in 2024 that every melody is being used to express the same feeling.",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "oomphasa",
                                                    "body": "Hey I know you said you’ve been busy, but when you have time would you be willing to elaborate a bit more on your thoughts on the quote from the Peking Review article vs Zizek’s words on Beethoven?\n\n I’ve been re-reading the article over the past few days and have revisited the video, but I still feel like I’m missing something. My reading on Marxist critique of art/music has been mostly limited to threads on this sub.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Prickly_Cucumbers",
                                    "body": ">the hometown is the fetish for the urban/suburban consumer to project their anxieties onto\n\ni apologize if i am recapitulating entirely your point, even more so if this was an intentional reference, but i have been working through Jameson’s *Postmodernism* and it captures a similar angle on the wistful anachronism of the “small town” trope in the film *Body Heat* (1981), a remake of *Double Indemnity* (1944):\n\n>the setting has been strategically framed, with great ingenuity, to eschew most of the signals that normally convey the contemporaneity of the United States in its multinational era: the small-town setting allows the camera to elude the high-rise landscape of the 1970s and 1980s\n\n…\n\n>the object world of the present day—artifacts and appliances, whose styling would at once serve to date the image—is elaborately edited out. Everything in the film, therefore, conspires to blur its official contemporaneity and make it possible for the viewer to receive the narrative as though it were set in some eternal thirties, beyond real historical time. This approach to the present by way of the art language of the simulacrum, or of the pastiche of the stereotypical past, endows present reality and the openness of present history with the spell and distance of a glossy mirage.\n\nas a characteristic symptom of Jameson’s conception of postmodernity is a “crisis in historicity”, i do think that it is a good read for this question.\n\ni think the phenomenon of nostalgia can be also be seen in a different form in trying to find a sort of post-modern grasp at “authenticity” in the third world (or the simulacra of its past as imagined by the first world).\n\nfor instance, i used to really enjoy the 1997 son cubano album “Buena Vista Social Club” (named after one of the few integrated music halls from before the revolution). despite winning a Grammy award in 1998 and being one of the best-selling “world music” albums of all-time, it had like no impact in Cuba itself, since it was all stuff they had heard for the previous 50 years (just now with amerikan production).\n\ni haven’t seen it, but i guess there is a whole documentary dedicated to lionizing the amerikan guitarist who “discovered” the group as some “unearthed treasure” of the past hitherto ignored by Cuban society. the whole project is a mythic idealization of a pre-revolutionary past that *really* appreciated Afro-Cubano music, while altogether ignoring 50 years of cultural development in Cuba. much has already been spoken of the the album and documentary along these lines, but it seems relevant here as a particularly egregious example of this nostalgia with immediately apparent politics attached.\n\nas an aside but i found some humor in u/sonkeybong’s offhand comment on Laufey’s lame appropriation of bossa nova (i don’t disagree). speaking from cursory readings of bourgeois sources on the topic, but i was under the impression that bossa nova is already seen as a richer, whiter version of samba, with infusions of jazz made possible at a time when Brazil was further opened up to imperialist companies.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "Perhaps I should just buck up and read *Postmodernism* so I can contribute to my own questions. I’ve really appreciated reading and thinking about everyone’s thoughts. I similarly found humor in /u/cyberwitchtechnobtch’s comment relating Wes Anderson’s aesthetic to a Laufey video. I know nothing really about popular music or music in general and I hadn’t heard of Laufey before but that connection to Wes Anderson really was the perfect linkage for me to get the picture.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "cyberwitchtechnobtch",
                                                    "body": "Perhaps what might be even funnier is that I was being pretty literal. This is the music video I was talking about:\n\n[https://www.youtube.com/watch?v=lSD\\_L-xic9o](https://www.youtube.com/watch?v=lSD_L-xic9o)\n\nI scrolled her page a bit more and found this disorienting version of that same music video:\n\n[https://www.youtube.com/watch?v=HbnB4OGvRUA](https://www.youtube.com/watch?v=HbnB4OGvRUA)\n\nWes Anderson and muzak meets the modern form of nightcore dilluted through the time constraints of TikTok along with the aesthetics of its dances resulting in a suffocating clash of fantasy and reality. Laufey probably had some fun shooting the alternate take for the TikTok audience but still, I'd imagine any artist would feel the market crashing down on them as soon as their manager tells them they have to shoot an alternate take where they do silly dances that will get sped up in their otherwise \"serious\" music video shoot. Regardless, it's probably one of the more intense displays of our \"cultural logic of late capitalism\" that's out there. I'm sure there are plenty more and arising in growing numbers. I truly wonder what pre/early postmodern artists like the Dadaists or Warhol would think of art today, or at least the meagre attempts at it under the weight of the Algorithm. I would like to think they would embrace it as means to reveal the essence of the thing itself. At least that's what I find myself drawn to do with my own music.\n\nRegarding *Postmodernism*, I found it most useful to at least just read the essay version:\n\n[https://newleftreview.org/issues/i146/articles/fredric-jameson-postmodernism-or-the-cultural-logic-of-late-capitalism](https://newleftreview.org/issues/i146/articles/fredric-jameson-postmodernism-or-the-cultural-logic-of-late-capitalism)\n\n And then follow it up with Sam King's thesis on imperialism:\n\n[https://vuir.vu.edu.au/37770/1/KING%2C%20Samuel%20-%20thesis\\_nosignature.pdf](https://vuir.vu.edu.au/37770/1/KING%2C%20Samuel%20-%20thesis_nosignature.pdf)\n\nI harp on about reading these two frequently but I still stand by that they are an essential pair to read together/subsequently.",
                                                    "score": 10,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "You argue here that \"cottage core\" artists exist because petit bourgeois Americans want to escape the alienation of the white collar office job and have an escape towards a small town imagined past based on self reliance in living conditions from the rest of the world.\n\nWhy does \"cottage core\" need to exist when country music already does? It could maybe be argued that \"cottage core\" is for urban/suburban listeners while country is for rural listeners, but this can't be true. America is a highly urbanized country now, and only roughly 1% of America's population works in agriculture. According to the US census, ~10% of people in America live in \"rural\" areas (defined as towns with populations of < 5 thousand people). So I don't think this can be it because I don't think \"rural\" exists anymore in America.\n\nMy best guess as to why \"cottage core\" must exist is because country music is too much of a reminder of settler colonialism? There are plenty of country songs I've listened to where all the lyrics are about are trucks, beers, bonfires, fishing, etc, and I guess these alone don't remind you of settler colonialism, but if you combine this with the instruments involved (especially the fiddle and banjo for example) remind us of America's past and therefore it's settled colonial history? Not to mention as well that country music is sung in Southern accents as opposed to the nationwide \"general\" American accent, which may make the listener uncomfortable because Southern accents generally have negative connotations from outsiders who associate it with racism and the dark history of the South (as if the North's wasn't but that's another discussion). Singing in the general nationwide American accent maybe let's you forget this? \n\nAlso interesting to note that the University of Georgia released a study showing how Southern accents are in decline from older generations to now. This I suspect is because of globalization and the increasing intermixing of Northerners and Southerners in southern cities as they have boomed since the 1970s, but also because of the negative stigmas associated with the old South in favor of a new South, which has moved on from its more explicit/directly racist past in favor of neo liberal multiculturalism instead.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "Just to get some kind of conversation going: there's definitely something to be said about it being some kind of fetishization of ignorance among petty-bourgeois settlers who now realize they have conflicting class interests. The idea of completely abandoning one's personal responsibilities and reverting back to a more \"innocent\" time when they didn't understand that their lives are kept up by imperialism gives ignorance a more enviable and \"carefree\" quality. In reality this is all built on fantasy, children are not in fact \"carefree\" and quickly are capable of understanding colonialism, homelessness, pollution etc., however their lives enable them to not have to consider themselves as eventual cogs in the capitalist reproduction machine that enables those things which *is* enviable to petty-bourgeois lifestyle western adults, who always wish they could consider their lives separate from such (which ironically becomes an area of pride in later years as retired individuals enjoy knowing that the system which now spares them from work in old age was in part up kept by them).",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "As a local unaffiliated observer, the rising cases of rape and sexual abuse in Anakbayan and other NDMOs is alarming. Abusers even use advanced technology, such as deepfakes, to create pornography of unsuspecting and underaged victims.\n\n I know organizing is a necessity, but this is making me feel wary about organizing in youth mass orgs. I'll think about it for some time.\n\nIs this borne out of their incorrect politics? The prevalence and over-importance of petite-bourgeoisie in youth and student-centered mass organizations?\n\n Some trace the decline of one such organization(League of Filipino Students) to the tuition hikes in SUCs and the implementation of STFAP/STS in the University of the Philippines changing the predominant class of the mass base of the organization.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Drevil335",
            "body": "A few days ago, US imperialism issued an arrest warrant for prominent Indian comprador bourgeois (and major Modi associate) Gautam Adani. Since I'm not very well acquainted with the internal contradictions of the Indian bourgeois state or the character of its relations with US imperialism (beyond the obvious, that it's a neo-colony of it), I'm not really sure what the significance of this is. Is it a US attempt to keep up the pressure on the Indian bourgeoisie in the face of the accelerating inter-imperialist contradictions with China? I would definitely appreciate the thoughts of those who know more about this subject, especially Indian comrades.",
            "score": 9,
            "replies": [
                {
                    "author": "CharuMajumdarsGhost",
                    "body": ">I'm not really sure what the significance of this is. Is it a US attempt to keep up the pressure on the Indian bourgeoisie in the face of the accelerating inter-imperialist contradictions with China?\n\nThis does seem to be the case. They have even issued warrants for the national security advisor (one of the most powerful bureaucrats of the country). \n\nhttps://www.livemint.com/news/us-court-summons-india-khalistani-separatist-gurpatwant-singh-pannun-sues-murder-plot-nikhil-gupta-assassination-11726725464777.html\n\nRUPE had analysed this previously - the entire row over human rights and the india-canada breakdown. It seems to be a carrot and the stick approach where the compradors are constantly reminded of their place. \n\nhttps://rupeindia.wordpress.com/2024/01/17/indias-new-era-and-western-imperialism-in-2023/",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Autrevml1936",
            "body": "Continue from this but also just sharing in case anyone else wants to read the text.\nhttps://old.reddit.com/r/communism/comments/1gcyh43/biweekly_discussion_thread_october_27/lu4jm9f/\n\n\nu/DistilledWorldSpirit\n\n\nI'm not sure this Will answer your question, and I haven't read it yet so don't know the quality of it, but I found a book recently about Physics and Dialectics from 1979 by M. E. Omelyanovsky Titled \"Dialectics in Modern Physics\" so it might be worth a Read.\n\n\nhttps://archive.org/details/omelyanovsky-dialectics-in-modern-physics-progress",
            "score": 6,
            "replies": []
        },
        {
            "author": "CharuMajumdarsGhost",
            "body": "u/Autrevml1936 do you happen to know any marxist works on gm crops? Asking as i have seen you have good command over biology and the associated fields. \n\nI tried searching the subreddit but all i got was some post from 6 years ago that had half-serious comments:\n\nhttps://www.reddit.com/r/communism/s/QIARa4iOxy\n\nI had posted about it (from an old account) hoping for discussion and critique of my own understanding given its growing role/concern in indian agriculture:\n\nhttps://www.reddit.com/r/communism/s/brHJ5fzpOG\n\n(It will be the comment in two parts)\n\nAre GMOs' not researched enough? I do not trust bourgeois science at all given there is a very transparent industry-academia connection here in india. The new mustard gm crop was produced at delhi university but will probably be sold off to some foreign entity. \n\nThere has also been resistance from Kenya where they have allowed gmos:\n\nhttps://www.downtoearth.org.in/africa/kenyas-high-court-dismisses-anti-gmo-cases-clearing-way-for-cultivation-import\n\nHoping you can shed some light on the topic.",
            "score": 7,
            "replies": [
                {
                    "author": "Autrevml1936",
                    "body": "> do you happen to know any marxist works on gm crops?\n\n\ni have not come across any Marxist works that attempt to analyze GMOs, Also if one adopts a Transhistorical understanding of GMOs then it could be argued that Michurinist's had been developing them for quite awhile and Even ancient Humyns in The Agricultural Revolution. But the Terminology and Organisms were first produced in the 1980s which is what you and i are referring to.\n\n\nMaybe Lewontin has something is his \"Dialectical Biologist\" but I am yet to read it in full and have Only read the \"Lysenkoism\" Chapter. i do believe he touched on it Briefly in his \"Biology as Ideology\" but as a point in his larger analysis of ideology in Science.\n\n\n> Are GMOs' not researched enough?\n\n\ni don't think it is that they are \"Not Researched enough\" but that how GMOs are Produced can hardly be called \"Science\" as what happens is ey Take Sequences of DNA and Graft them on to the DNA of another Organism and see what happens, then if ey like the result ey might reproduce the new Organism or repeat the Process. Ey don't have a general model/logic to know what to Graft, ey just roll the dice and hope ey strike \"Gold\", \"Chance Reigns Supreme\". If ey say ey do have a \"Science\" and display their \"Gold Findings\" to you all ey are doing is showing you the minority of \"Successes\" out of the number of Failure's.\n\n\nAnd i put \"Gold\" And \"Successes\" in quotes because the majority of These \"Successes\" are actually pretty useless. But of course GMOs aren't outside of Capitalist Society, so after these 'Scientists' have produced eir GMOs ey heavily inbreed the crops and conduct \"Gene\" Patenting, with this ey have made Crops unable to be produced in the Fields and Farmers are Legally not permitted to reproduce them(though now as I type this out i think there could be some favoring of settler farmers in the U$ Legal system but I haven't done any investigation) so ey have to keep buying these non-reproducible seeds from Agriculture Monopolies(the one that comes to mind to me is of course Monsanto but there are certainly others) which keeps all of agriculture under Agrobuisness Monopoly control.\n\n\nThen of course because all these GMOs are inbred has harmful effects such as entire GMO Crop Fields being at risk of being completely destroyed by diseases and insects and other stuff, having harmful effects on the environment, and they are pretty Terrible at adapting to changes in climate.\n\n\n> Asking as i have seen you have good command over biology and the associated fields.\n\n\nWhile i do have some knowledge on biology i am still clueless about a lot of it. The only area i have any degree of confidence on talking about is well Genetics and Michurinism as that is what i have investigated More. Though i still need to investigate biology and the other Sciences eventually i have dropped it somewhat for Studying the Fundamentals of Marxism as I am Still pretty weak in my understanding of Marxism(and i don't think i have internalized the majority of what i have Read from the 5, likely due to me being a Petite Bourgeois Settler.).\n\n\nHopefully this makes sense, i am writing this past midnight for me so i am a bit tired at the point of writing this.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "CharuMajumdarsGhost",
                            "body": "Apologies for the delayed response. Was busy irl. And thank you for a detailed post. I have read through this multiple times. I just have a follow up question: i had never thought of gmo production as not being a science, i just took it for being one on face value. But do you think with CRISPR cas 9 and other genome editing technologies, it can move towards being a science? I am curious because the bourgeois media is all over this stuff as if it fell right out of Heaven.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Autrevml1936",
                                    "body": "While the Contradiction between Old ideas and New Discoveries is one to keep in mind with science(and one of them I think you are asking about) i don't think this contradiction is the Basis of development of Science.\n\n\nTo hopefully illustrate what i mean take a look at Psychology/psychiatry, Psychology has already had it's Old ideas come into contradiction with New Discoveries realized in the \"DSM\", there have been created 5(though there are draft's before and in-between) DSM with today's one being the DSM-5. Have These Changes/Alterations in psychology developed it to a Greater Stage that is useful for the Proletariat? Or has psychology continued with it's Bourgeois Foundation? It has continued with it's Bourgeois Foundation.\n\n\nBut there is a different contradiction within science that is the foundation of Society that being between the Productive Forces and Social Relations. (One example of) The Productive Forces in science can be easily seen revolutionized if one simply looks at the history of the U$' NASA from the 50s to Today. But the Social Relations of Scientists are highly Bourgeois in that the Vast Majority of people Conducting Science in laboratories and uni's and other facilities are Not Proletarians but the Petty Bourgeoisie and Labor Aristocracy. Hence Class Struggle rarely occurs within science in current Bourgeois Science.\n\n\nTo use another example, for the majority of the 20th century Bourgeois Science was Promoting Eugenics and Social Darwinism yet never did the New Discoveries, such as DNA, halt Eugenics. What caused Bourgeois Science to drop Eugenics in Form was the end of WW2 and the wave of Anti colonial national liberation movements that arose around the world.\n\n\nBourgeois Science had to respond to a phenomenon to this external change and dropped Eugenics and Birthed \"Post Colonialism\" to respond to the changes of National Liberation and from Colonialism to Neo-Colonialism.\n\n\nFor Bourgeois science to develop and actually change it requires an initial external Change so I think for Science to change it requires a Dictatorship of the Proletariat to 1. Establish a Basis for Class Struggle internally 2. There must be a Cultural Revolution within Science.\n\n\nThese are just my thoughts as I'm typing right now though I do think I see some points of critique of my ideas Such as treating Science as an institution rather than a process(though I think that in Monopoly Capitalism it is realized(Manifested?) as an institution). An likely other points I'm not noticing.\n\n\n> But do you think with CRISPR cas 9 and other genome editing technologies, it can move towards being a science?\n\n\nHopefully I was clear previously but to Sum up, I do think these are interesting Discoveries and Technologies(and will assist in studying the internal Contradictions of Organisms and the Cell) but they will not establish it on a scientific basis but continue the production of Bourgeois Science. Only Science grounded in Practice led and Promoted by a DotP can do so which requires Socialist Revolution.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "CharuMajumdarsGhost",
                                            "body": "Again, thank you for such a detailed response. I do get it now. I have also realised that i am actually lacking knowledge in what science is and how it actually works. I should go back to the classics first. \n\nI will just piggyback off your examples because i have observed the same things irl. \n\n>DSM with today's one being the DSM-5. Have These Changes/Alterations in psychology developed it to a Greater Stage that is useful for the Proletariat? Or has psychology continued with it's Bourgeois Foundation? It has continued with it's Bourgeois Foundation.\n\nI have noticed this in the psychoanalysis/\"modern psychology\" contradiction. While psychoanalysis was itself bourgeois in its foundations, modern psychology, which depends heavily on psychiatry for medication support, has pretty much abandoned whatever was useful in psychoanalysis - some examples can be the defeatist attitude of CBT (and the fact that meta-analyses show that it rarely works in the long term), the overdependence on neuropsychology which almost makes the field completely biological, the straitjacketing of conditions in DSM, and so on. At least, psychoanalysis was still trying to contradict itself (especially with freud's death drive and lacan's 'objet a' both which however ultimately went circular and could not escape their idealist basis). Psychology does not even try - all it wishes to do is make the worker sober enought to work (i am referring to the petty-bourgeois worker, given the fact that working class/peasantry cannot even dream to afford to therapy). \n\n>Bourgeois Science had to respond to a phenomenon to this external change and dropped Eugenics and Birthed \"Post Colonialism\" to respond to the changes of National Liberation and from Colonialism to Neo-Colonialism\n\nI wrote about a similar phenomenon in my postgrad thesis as well. Only i was talking of what is now cultural studies - a breakaway from critical theory which is itself a distorted, revisionist version of marxism. I think it is interesting how much postcolonialism and subaltern studies has a hold in academia, for the entire field of subaltern studies itself was a reaction to and a method to control the radical ideas emerging from Naxalbari. It was only given that both postcolonialism and subaltern studies would abandon whatever facade of marxism they had and would towards postmodernism as soon as the global tide changed. \n\nThese things need to be more carefully studies. But i do get it now, only class struggle could make science progress. Thank you so much for your effort at explaining.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "Sea_Till9977",
                                                    "body": "I often read about and discuss about psychology. I often bring up that psychology has a myriad for diagnoses that individualises mental illnesses among bourgeois and petty bourgeois patients, but can psychology ever answer the Indian landless peasant's decision to commit suicide? It definitely cannot with the current framework that it employs.\n\nI have also learned about Borderline Personality Disorder (BPD), which has its roots in feudal era patriarchy which classified women as 'hysterical' and what not (horrifyingly, there is literally a diagnosis called Histrionic Personality Disorder). This is clear when seeing that women are overwhelmingly diagnosed with BPD, with many being victims of abuse or sexual assault. \n\nBesides society stigmatising women with BPD, it is often the psychiatrists and psychologists themselves who strip any agency away from the patient diagnosed with BPD. A woman's justified reaction to patriarchy is classified as some sort of disorder. The most public example of this was in the Amber Heard trial, where she was diagnosed with BPD by some quack psychologist (even by bourgeois standards that is) employed by Johnny Depp. If you see the kind of discourse that surrounded this BPD diagnosis, you will see the genuinely upsetting and anger inducing misogynistic language used by people who weaponise BPD.\n\nu/Autrevml1936 I would like to hear your thoughts as well on such diagnoses that are receiving critique even within psychology, and how backward it truly is.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "Autrevml1936",
                                                            "body": "> I would like to hear your thoughts as well on such diagnoses that are receiving critique even within psychology, and how backward it truly is.\n\n\nAll I know is some of the general history of Psychology and some info I've gathered from this sub but I don't want to Speak too much about it or i would likely be speaking nonsense. I still need to Read up on Soviet and Chinese Psychology as well as MIMs work. Though currently my priority is Capital and Marx.",
                                                            "score": 5,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Autrevml1936",
                                                    "body": "I'm kinda just typing this for myself at the moment and not really related to what you said as I think we're in agreement just typing my thoughts.\n\n\nWhile i find the position of Science being Subject to The mode of production, and hence is founded on Bourgeois ideas under capitalism, and must have Class Struggle and go through a Cultural Revolution a much better position than the Revisionists who decry Lysenko for \"imposing Dialectical Materialism into Science\"(who regress into a position of Science being \"Impartial\" just \"Imperialists are the ones distorting science\"(rather than Class being the foundation)) or Bourgeois Scientists who give Lysenko some credit for his Discoveries but do not go all the Way and say he was \"wrong about XYZ and persecuted scientists\" (these are the main tendencies I've seen happen though there are certainly seen these positions are not exclusive but do share some ideas).\n\n\nThe Position of \"Cultural Revolution must happen in Science\" is a bit un-interesting as what does it tell us? How do we apply this in practice when the conditions for it are ripe? Should we just take the Universalities of the Cultural Revolution and Apply them to the conditions of our Revolution and the Particular Conditions of Science?\n\n\nThis is a question I have that is similar to a recent question about the [Transition from Collective Farms to Public Ownership](https://www.reddit.com/r/communism101/comments/1gwv3m2/how_should_socialism_transition_to_public/). Only I'm asking about science, How do we encourage Principled Class Struggle in Science? What are our tasks for Cultural Revolution in Science?\n\n\nThese are important questions that I am currently not prepared to answer but they are important one's to deal with so we can combat Capitalist restoration. My current thoughts are that this question can only be answered by:\n\n\n1. A General analysis of Marxist Theory of Science as the theory from my investigation(though maybe in some one off document by CPI(Maoist) or another Maoist Party that I haven't Read it's better) is Pretty lacking Since Lenin though Mao is a bit better but doesn't really delve deep into critique of Reactionary Ideas in Science(except for short historical analysis/mention in on Contradiction iirc). The better material is by Maurice Cornforth though I do think he has his own Problems as his latter work abandoned Michurinism for minimal substance in Bourgeois biology and for his earlier work that is Good I this it still has its own Problems because it focuses entirely on Mechanical Materialism and Dialectical Materialism when while Mechanical Materialism is one philosophy of Bourgeois Science it is not the only one(Maos On Contradiction mentioned Vulgar Evolutionism for another example).\n\n\n2. A Study of how Class Struggle was Practiced in Science the USSR and PRC. As much is I enjoy studying Michurinism both historically and theoretically it is not the only Science that was Practiced in the USSR but is important in the historical context of the immense Struggle between Michurinism and Mendel-Morganism as well as Agriculture being an important concern of the Soviet State, was Class Struggle immense due to the conditions of the Peasants and University professors? China is important as well though I know less of the struggle in Science there as it information is murky(I do know of Mao's \"hundred flowers bloom\" campaign but know nothing about it's effects in science).\n\n\n3. Finally new Practice, the practice of building another Socialist Society and carrying out Revolution throughout society will help develop our position on Science.\n\n\nI do actually have a few resources on Science if you want to read them. They are Two works by Maurice Cornforth not sure if you have read them before.\n\n\n**Dialectical Materialism and Science**(56 pages) by Maurice Cornforth https://redstarpublishers.org/Cornforth.pdf\n\n\n**Materialism and the Dialectical Method**(122 pages, this is more about Diamat but does discuss science) by Maurice Cornforth https://www.bannedthought.net/MLM-Theory/Diamat/OldDiamatWorks/Cornforth-MaterialismAndDialecticalMethod-1953.pdf",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "CharuMajumdarsGhost",
                                                            "body": ">I do actually have a few resources on Science if you want to read them. They are Two works by Maurice Cornforth not sure if you have read them before.\n\nThank you. I will give these books a read once i get time.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "hanger-na-pula",
                    "body": "There have been some articles that I have skimmed from a MASIPAG, an NGO loosely allied with National Democratic Mass Organizations such as the Kilusang Magbubukid ng Pilipinas(Peasant Movement of the Philippines). They have recently won a ruling against the planting of Golden Rice and Bt eggplant months ago.\n\n  \nThough I do not know if it is of much help to you, as I am only providing you links without analysis like you have done in your previous thread.\n\n[https://masipag.org/downloads/](https://masipag.org/downloads/)\n\n[https://masipag.org/category/features/](https://masipag.org/category/features/)\n\n[https://xcancel.com/MASIPAGFarmers/status/1643004493066567680](https://xcancel.com/MASIPAGFarmers/status/1643004493066567680)\n\n[https://xcancel.com/MASIPAGFarmers/status/1784770667961110739](https://xcancel.com/MASIPAGFarmers/status/1784770667961110739)",
                    "score": 1,
                    "replies": [
                        {
                            "author": "CharuMajumdarsGhost",
                            "body": "Thank you. I have gone through these. Unrelated, but what is this xcancel website? Is it just another form of twitter or something?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "hanger-na-pula",
                                    "body": "It's still twitter, viewed from another website. a tool for searching posts and sending links online, as twitter doesn't let people use their website properly now if you do not have an account.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "rbohl",
            "body": "Anyone have a link to those clips of Feds grabbing people off the street in unmarked vans during the BLM protests? I haven’t been able to find them online",
            "score": 4,
            "replies": []
        }
    ]
}