{
    "title": "How come Armed Revolution, Regime change or Coup d'état Happen(Iraq, Libya, Afghanistan and Russia)",
    "author": "This_Blacksmith834",
    "subreddit": "communism",
    "rank": 237,
    "score": 17,
    "upvote_ratio": 0.87,
    "num_comments (reported by reddit)": 11,
    "url": "https://www.reddit.com/r/communism/comments/1gqm3i6/how_come_armed_revolution_regime_change_or_coup/",
    "id": "1gqm3i6",
    "selftext": "I will be very thankful of you guys if you can help me clear my doubts about how come Revolutionary organisation or rebels manage to throw out fully functional(corrupt) governments \n\n1- How these groups create a internal Bureaucracy to manage the organisation how they find smart and qualified people how people agree on doing a dangerous job for a organisation that can't even pay them\n\n2- How these groups with their few mercenaries manage to throw out fully functional powerful armies.\n\n3- why don't people of the respective country retaliate to the revolutionary organisation and how come people that worked for the previous government (the bureaucracy,the police and military and local politicians) agree to work with these rebel groups.\n\n4- How they stop Powergrabs inside the respective organisations.\n\n(English in not my native language so sorry for my grammatical mistakes and my questions arised after reading about the regime change in Iraq,libya, vietnam and the rise of lenin)",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Otelo_",
            "body": "There are fundamental differences between a popular revolution and a coup d'etát. Even between coups, there are still great differences between fascist or reactionary coups and progressive ones (Nasser, Gaddafi, Alvarado, Otelo*). Still, I will try to give generic answers.\n\n\n1- smart and competent people exist everywhere. A lot of people who seem incompetent due to them not trying too hard at their job (what's the point of working your ass off to enrich your boss?) would actually put a lot of effort towards a revolution. This also touches your second point: people don't do revolutions for the money, and they are definitely aware that their lives are at risk in doing a revolution. They do it when it's in their class interest (which, for the proletariat, is always under capitalism).\n\n\n2- that rarely happens (in revolutions the people's army at some point has to have a similar size to the reactionary army), and when in happens, in the case of Cuba or when there is a coup, it's because the official army was no longer functional.\n\n\n3- either because they will be repressed if the coup is a reactionary one or, if the coup/revolution is a progressive one, because the coup is in their interest and so they actually do support the revolution**. People work for both governments either because they already were working for the previous one as an obligation (and so now they work for the new one more happily), or because they just want to save themselves.\n\n\n4- by punishing them (in the case of middle officials) or through mechanisms which assure control of the masses over the leaderships.\n\n\n*It is not consensual wether this governments (in the case of the first three) were really that much progressive or how progressive they were, I'm just trying to stress that there are coups who are not outright fascist. There are also differences between the three of them.\n\n\n** there can be reactionary coups which gather \"mass\" support in countries where there is a large labor aristocracy/petit-bourgeoisie.",
            "score": 4,
            "replies": [
                {
                    "author": "This_Blacksmith834",
                    "body": "Thank you sir for taking your time to answer my queries \n\ncan you suggest me some books or resources where I can learn about these things that will be very helpful.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Otelo_",
                            "body": "To be honest I don't know any work which explicitly talks about coups, perhabs Engels comments on Blanquism would be the best option (?). In general terms of revolution I would say On Protactred War by Mao Zedong.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Antique-Statement-53",
                                    "body": "Coup d'etat: A Practical Handbook by Edward Luttwak. Its not written by a leftist but as fsr as I know its still the best book written on the actual method behind coups",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "This_Blacksmith834",
                                            "body": "thanks for the recommendation",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "AHDarling",
                                            "body": "[https://mirror.explodie.org/108765924-Luttwak-1969-Coup-d-Etat.pdf](https://mirror.explodie.org/108765924-Luttwak-1969-Coup-d-Etat.pdf)",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "This_Blacksmith834",
                                    "body": "Not explicitly on coups but communism, socialism and politics for a newbie",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Otelo_",
                                            "body": "The subs sidebar as a link to a marxism-leninism study plan:\n\n\nhttps://www.reddit.com/r/communism/wiki/basicstudyplan",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}