{
    "title": "Most of Marx’s critique of capitalism is based on the assumption that gold is the money commodity. How does Marx’s critique change if the money commodity is petroleum instead of gold?",
    "author": "RainbowSovietPagan",
    "subreddit": "communism",
    "rank": 181,
    "score": 0,
    "upvote_ratio": 0.41,
    "num_comments (reported by reddit)": 11,
    "url": "https://www.reddit.com/r/communism/comments/1hcxfny/most_of_marxs_critique_of_capitalism_is_based_on/",
    "id": "1hcxfny",
    "selftext": "Also, to what degree can a systematic analysis of a gold-based economy be used to analyze a petroleum-based economy?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "smokeuptheweed9",
            "body": "The money commodity isn't petroleum so that's a strange hypothetical. If you're wondering about the seeming non-relation between the volume of gold and the money supply, that's just an inflationary episode on a world scale which has detached money as a measure of value from money as a means of exchange. The fundamental value of money being measured in gold hasn't changed, it has merely diverged through a massively inflated dollar.\n\nThis system cannot last forever. The reason it's lasted this long is because it consists of multiple phases. First was simply printing money, like any other inflationary fiat currency, in order to discipline and restructure the American labor aristocracy to deal with the profitability crisis of the 1970s. But rather than a crash, this continued because a massively overinflated dollar balanced out a massively undervalued Yuan as one means of superexploitation of Chinese labor for a new \"services\" based consumer aristocracy. Finally, after 2008 the Yuan also started to inflate, both because of the rising cost of Chinese labor and its own industrial shift. The world has probably run out of spatial fixes, which the first US government would have surely loved to do with Continentals rather than crash its inflated circulation to match underlying value and risk revolution.",
            "score": 20,
            "replies": [
                {
                    "author": "RainbowSovietPagan",
                    "body": ">The money commodity isn't petroleum so that's a strange hypothetical.\n\nWhat do you call the petrodollar, then?",
                    "score": -4,
                    "replies": [
                        {
                            "author": "smokeuptheweed9",
                            "body": "I call it a term the media made up which vaguely corresponds to the relationship between the 1970s crisis and the OPEC oil strike. Though its resolution was part of restructuring the world market, this was only a manifestation of the fundamental profitability crisis and one of many equally important historical events. It gained life in the early 2000s because of a left-liberal conspiracy theory that the US was selling \"blood for oil\" in Iraq and has faded into obscurity since then when it was obvious that the domestic shale oil revolution in no way reversed the economic decline of the US Empire or that the US's failure in Iraq challenges the supremacy of the dollar for world trade.",
                            "score": 19,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "wetland_warrior",
            "body": "It doesn’t change at all",
            "score": 9,
            "replies": []
        },
        {
            "author": "PretentiousnPretty",
            "body": "1. Why do you think we're heading into a petroleum-based economy? \n\n2. Marx's critique is not based off the gold commodity as money, he just gives figures in gold to illustrate. \n\nHis critique is based off the scientific analysis of value, of which labour is the only commodity that can create more value than it costs. \n\nThe substance of the money commodity is not that relevant other than that it is uniform and divisable.\n\nPeople (and governments) mistake the substance of the money commodity for having inherent value ahistorically, which resulted in monetary valuation crises that he illustrates in Vol 1 of Capital.",
            "score": 9,
            "replies": [
                {
                    "author": "RainbowSovietPagan",
                    "body": ">Why do you think we're heading into a petroleum-based economy?\n\nI don't think we're heading into one, I think we're already there, and have been for several decades. I thought the fact that the U.S. economy is currently based on the petrodollar was common knowledge.",
                    "score": -4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Hopeful_Vervain",
            "body": "Capitalism is a labour-based economy, Marx's analysis is still valid and does not change based on the current money commodity... but also I'm not sure if I consider petroleum a money commodity in the first place, money is not currently seen as tied to any tangible thing in the same way as it was in Marx's days with gold, it's a fiat money system. Marx's analysis of credit and finances is helpful to understand the role of fiat money tho, and it remains grounded in labour and exploitation.\n\nBasically, value is not an inherent property of things and it's not actually tied to any commodity, it's defined by social relationships. Under capitalism, it's rooted in the socially necessary labour time, which fluctuates based on production cycles or technological and environmental changes. Labour itself is commodified, and its value is shaped by class antagonism. The ability to attribute an exchange-value to commodities depends on the underlying organisation of labour.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Last_Tarrasque",
            "body": "Marx doesn't call gold a money commodity, he just uses it as a value bench mark for ease of prepose. Nothing would have change about his fundamental analysis if he used Oil, Camels, Tomatoes, 30 KG chunks of limestone or any other socially necessary commodity.",
            "score": -1,
            "replies": [
                {
                    "author": "RainbowSovietPagan",
                    "body": "> Marx doesn’t call gold a money commodity\n\nCapital, Volume 1, chapter 3, first sentence.",
                    "score": 6,
                    "replies": []
                }
            ]
        }
    ]
}