{
    "title": "Tech and Revolution ",
    "author": "Brk05",
    "subreddit": "communism",
    "rank": 122,
    "score": 16,
    "upvote_ratio": 0.78,
    "num_comments (reported by reddit)": 11,
    "url": "https://www.reddit.com/r/communism/comments/1hxsgh2/tech_and_revolution/",
    "id": "1hxsgh2",
    "selftext": "1)Are there any hacktivist groups who has revolutionary left ideals(not anarchist, a lot of \"popular\" groups act anarch). i mean the first thing in mind is Anonymus but recently they act like pro-dem in their official accounts, i don't know much about them but maybe they have a problem with their \"administration\" even though i don't have an idea about their form of organization.\n\n2)If any of you are in computer science(developer, cybersecurity, academy etc.) or interested in CS as a hobby, how do you implement these ideological values? \nI for one am transhumanist and i believe even though tech became a dopamin p*rn in capitalist society it could become a very important step in evolution in a socialist/communist society(especially internet and the peoples habit to connection that came with it).\n\n\n3)As you can understand i am kinda obssesed with the CS/Tech and Revolution synthesis, so i would love it if you know any author who wrote about transhumanism and anti-capitalist revolutions and such. (even though i am not an anarchist, anarcho-transhumanist books/researchs would be useful too)\n\n\n",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "TiredPanda69",
            "body": "I'm kind of in the same boat.\n\nThere are surprisingly many comrades in open source circles. But I can't tell you if there is a hub.\n\nThere are some chans out there that are \"lefty\" oriented, but as far as I know they are not super active.\n\nAs a way to get involved:\n\nJoin a revolutionary communist party and help build the people's systems. Build for continuation and methods of implementation and manuals.",
            "score": 9,
            "replies": [
                {
                    "author": "Brk05",
                    "body": "i will research different communist parties in my country in spare time then i will join. I want to thinker with revolutionaries \"cyber\" ways of doing things. i am sure there are much much knowledgeable socialists in different organizations that would look positive to this.\n\nit would be good addition to conventional pyschical activities.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Ok-Royal8059",
                            "body": "I have studied coding and a good friend of mine works in cyber security. Anonymous slogan, \"just for the lolz\" describes how serious and organized the group is. \n\n\nA danish teenager successfully exposed and took down every last beastiality brothel in his country. He was inspired by and associated with anon if I remember correctly. \n\n\nThe Cuban revolution might not have been successful without Cienfuegos. He was a capitalist but played a key role in taking down Batista. \n\n\nThere is no cheat code. When you start working for the revolution there will be counter-revolutionaries trying to take you down. Whether you go about it IRL or over the internet. \n\n\nWestern programmers tend to lean towards fascism and right wing extremism. \n\n\nLinus Torvalds dad was one of the most influential communists in Finland in the late 60's but nowadays both father and son has betrayed us.\n\n\nRevolution OS is another name for Linux. \n\n\nProgrammers have insane working conditions, and combined with their powerful knowledge, they have a bit of a tendency to sell out quickly. ",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Brk05",
                                    "body": "agreed, i love linux/gnu and open source philosophy(not in my main machine yet but i use it in my laptop, \"i use arch btw\") idea of community support and free softwares etc. but i don't know about his current politics even though i know his dads communist past\n\nThere was something with russian maintainers in kernel development i suppose but i didn't read it",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "AcidCommunist_AC",
            "body": "Check r/socialisttech and r/cryptoleftists.\n\n\nImo the best project is [decidim](https://decidim.org/). It's going to allow for participatory democratic organizing on an unprecedented scale. It will be for socialism [what the printing press was for the bourgeois nation-state](https://en.wikipedia.org/wiki/Print_capitalism?wprov=sfla1).",
            "score": -3,
            "replies": [
                {
                    "author": "Brk05",
                    "body": "interesting i'll look into these",
                    "score": 1,
                    "replies": [
                        {
                            "author": "urbaseddad",
                            "body": "Do yourself a favour OP and don't. I mean seriously? Blockchain leftist? Ffs ",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "Brk05",
                                    "body": "i have no idea what they are or if they are rational, i'll look into these in a spare time",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}