{
    "title": "Gerald Horne",
    "author": "Inter-est",
    "subreddit": "communism",
    "rank": 66,
    "score": 39,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 14,
    "url": "https://www.reddit.com/r/communism/comments/1ig9rzk/gerald_horne/",
    "id": "1ig9rzk",
    "selftext": "I came across Gerald Horne’s works on counter-revolutions. I can’t believe he isn’t discussed more in the 3rd world. I literally came across his work accidentally. Is he well know among Marxists in US? \n\nWould love to hear thoughts on his analysis of counter-revolution of 1776.  And more generally his method of reading counter-revolution. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Akilos01",
            "body": "If I’m being honest I think his work is great and incredibly useful for the development of a materialist analysis of American history especially considering the degree to which that has been shrouded in myth and propaganda.\n\nHe isnt widely held in high regards in American Marxist and communist circles because frankly, most Americans and communists do not actually in meaningful ways, respect the black radical tradition.",
            "score": 32,
            "replies": [
                {
                    "author": "T4zi114",
                    "body": "Can't speak for broad movement but my DSA chapter is incredibly white, not surprising, and everyone I know loves Gerald Horne and his work.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "MauriceBishopsGhost",
                            "body": "It is unsurprising that social fascists such as white DSA members like the work of CPUSA revisionist academic grifters such as Gerald Horne. \n\nThere is a whole clicque of academics such as Gerald Horne, Cherisse Burden-Stelly from the CPUSA who produce work that is not particularly interesting.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "oomphasa",
                    "body": "So upholding some shitty revisionist academic is “respecting the black radical tradition” to you? \n\nDo you feel the same way when people rightfully point out the bourgeois politics of Angela Davis? Your comment is liberal shit.\n\nEDIT- Also, what would be your response to a black Marxist who refuses to hold Horne in “high regard”? Would that person be lacking “respect” for the “black radical tradition”? Insane to me that this comment is so highly upvoted.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MauriceBishopsGhost",
            "body": "What do you find to be compelling about Horne's work?",
            "score": 14,
            "replies": [
                {
                    "author": "Inter-est",
                    "body": "Thank you for asking. I have read only 1 book and have not read works contesting his thesis as yet. These are the issues/ questions that the book raises that I found useful to think about. \n1. The deregulation of slavery, slave trade and its relation to England’s transition out of monarchy and setting up of Bourgeois institutions. \nIt’s not novel but I find every explication of this period useful to understand class and uneven development in the colony. \n2. Inter-imperialist conflict as an opportunity for revolutionary politics. \n3. The formation of National Bourgeois in the colony on culturalist terms (what he calls ‘Whiteness’ and clarifies not as a biological but a reactionary identitarian category) as a counter-revolution that emerges against the revolutionary potential of slave uprisings. \nThis I am trying to see if there is any theoretical extrapolation that can be made about emergence of National Bourgeoisie in other colonies as well. \nEg. the anti-caste revolutionary uprisings in India which emerge before the formation of the National Bourgeois. \n\nJust thinking through these questions… not sure yet what to make of it. Figuring out. Comments and contestations are welcome.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "MauriceBishopsGhost",
                            "body": "To my understanding \"race\" is a pseudo-scientific category in most of the ways it is usually talked about, even when cast in \"identitarian\" or \"cultural\", or \"social\" terms as opposed to biological ones. \n\nI have read a number of Horne's articles and he uses the term \"reactionary identitarian category\" and If I am honest I am not sure what that means. I've usually seen identitarian refer to the \"Christian Identity\" movement and \"newer\" forms of white nationalism. If you or anyone else has insight on this let me know.\n\nWhy does Horne use this term / category rather than that of the nation instead? \n\nI haven't really read any of Horne's longer works because he is a awful revisionist academic CPUSA grifter. Though the Black National Question is a really important one for the history of the CPUSA, is this something he speaks about in the book? \n\nWhat is the revolutionary politics he speaks about, can politics be both revolutionary and side with the british monarchy?",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Inter-est",
                                    "body": "Re. Reactionary Identitarian Category… I understood it to mean an ideological discourse that allowed migrants from Spain, France, England etc. Speaking different languages and engaged at different levels in the economy to come together as a class. His argument, as I understand it, is that slavery was a structuring element for the success of American economy and nation formation (so that it could compete with British production rather than be taxed by them) and hence produced necessary ideological ciphers which can be observed as the emergence of ‘whiteness’ that brought together disparate actors. Admittedly, elements among them did not have an antagonistic relation to slave liberation but came to capitulate to the dominant ideology anyway. \n\nWhy does he use it instead of the national… well, he does, kind of. When not explicit then very obviously implied. I suppose at the time of writing the relation to nation has changed significantly so it maybe to relate to his audience or something that he takes recourse to a neo-logism? Not sure. I don’t know the conditions of the emergence of his work. \n\nYes, Black National Question is very much there. Which is also why I got little excited. I don’t know much about CPUSA. I’ll look it up. People seem to be pretty pissed with them so I suppose there’s some good debates and history to read up on. \n\nTo the last question… I’m really not sure that’s the point being made. It is obviously not a ‘position’ to uphold British Monarchy in principle but the sociological description of the type of strategic manurers that were effectuated by the monarchy that inadvertently created conditions for political organisation against planters… I think.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "tmrtrt",
            "body": "He's fairly well known in the US amongst Marxists. His analysis is really good and deserves more attention, imo. The \"pro America, socpats\" were talking shit on him a few years ago, which is a good sign you should read his work",
            "score": 8,
            "replies": []
        },
        {
            "author": "HappyHandel",
            "body": "He's a cut-rate J. Sakai and a CPUSA shill.",
            "score": 5,
            "replies": []
        },
        {
            "author": "tinymightybaddie",
            "body": "His historical work is extremely shoddy and flys in the face of the Marxist tradition being mainly idealist in his assertions.  His essentialism in particular rubs against the actual black Marxist tradition from WEB Dubois to the Fields sisters today",
            "score": 1,
            "replies": [
                {
                    "author": "Crafty_Money_8136",
                    "body": "What essentialism is present in his work? Just wondering as I haven’t read him",
                    "score": 8,
                    "replies": []
                }
            ]
        }
    ]
}