{
    "title": "Dismantling of USAID",
    "author": "leftofmarx",
    "subreddit": "communism",
    "rank": 60,
    "score": 333,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 68,
    "url": "https://www.reddit.com/r/communism/comments/1ih9rex/dismantling_of_usaid/",
    "id": "1ih9rex",
    "selftext": "I have been mulling this over a lot for the past two days now.\n\nUSAID was basically created to contain and destroy communist movements across the world. It has been an arm of CIA interference for most of its existence.\n\nThe heavy irony of someone like Elon Musk calling it a \"far leftist Marxist organization\" while posting stories about its disruptive activities in Cuba has not been lost on me. But... this is kind of serious. USAID being dismantled is a GOOD thing, and something a Marxist-Leninist party would also dismantle. It's literally a Cold War tool of containment. Can working class people who somehow believe it's \"Marxist\" ever be convinced that it is actually anti-communist and dismantling it serves the interests of socialist movements, especially in the developing world? Liberals are going to want to immediately prop it back up when they have their next cycle in power. That's actually very disturbing to me.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Autrevml1936",
            "body": "> USAID being dismantled is a GOOD thing, and something a Marxist-Leninist party would also dismantle.\n\n\nI wouldn't characterize this as a \"Good\" thing as this is not being dismantled by the Proletariat but by the Bourgeoisie for what other projects Capital requires and the dismantling of this one particular state structure does not dismantle Imperialism, and only restructuring of the bourgeois State.\n\n\nOf course this isn't to say it's a \"Bad\" thing but this is not revolutionary as far as I can tell. Though maybe other's here can explain if I'm wrong on this or not.",
            "score": 272,
            "replies": [
                {
                    "author": "ilyich_commies",
                    "body": "Yeah Marco Rubio is currently running USAID in the interim. They are probably going to keep doing all the bad shit USAID does while eliminating the little bit of good stuff it does",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "leftofmarx",
                    "body": "Bourgeois revolution dismantling old relations is fairly well supported by Marx. Not as a \"yay we love the bourgeoisie\" but more of a...\n\n>...wherever it has got the upper hand, has put an end to all feudal, patriarchal, idyllic relations... The weapons with which the bourgeoisie felled feudalism to the ground are now turned against the bourgeoisie itself.\n\nTheir dismantling of this Cold War program is short sighted for them and useful for us. The critical thing that we must be ready to oppose is the liberal democrats trying to reimpose it when they inevitably have their next power cycle.",
                    "score": 52,
                    "replies": [
                        {
                            "author": "Autrevml1936",
                            "body": "> Bourgeois revolution dismantling old relations is fairly well supported by Marx.\n\n\nBut the conditions are absolutely different, in Bourgeois revolution the bourgeoisie is destroying the Old Feudal Social Relations with new Bourgeois Relations and forcing the Peasantry to become part of the New Proletariat in order to survive(which is a very violent process).\n\n\nBut Most Bourgeois Revolutions have been Completed though with some still incomplete due to Imperialism.\n\n\nThis is not Bourgeois Revolution destroying Old Feudal productive Relations but the destroying of 1 Bourgeois structure that May be replaced for another structure or the purpose given to a different State structure.\n\n\nSo I fail to see a comparison here.\n\n\n> The critical thing that we must be ready to oppose is the liberal democrats trying to reimpose it when they inevitably have their next power cycle.\n\n\nHow do \"we\" do this when there is hardly any Proletarian Party to lead *The* **People** within this Settler Colony to victory? This seems a bit like \"putting the cart before the horse\" looking ahead without looking at the Objective Now.",
                            "score": 70,
                            "replies": [
                                {
                                    "author": "leftofmarx",
                                    "body": "Fair enough, thank you for your thoughts.",
                                    "score": 15,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "agirlhasnoname17",
                            "body": "Excellent point.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "goldenhourlivin",
                    "body": "Just gotta wait and see what takes its place. But as you said, being dismantled by the bourgeoise doesn’t exactly bode well. Idk these people in power have shown a pretty obvious trend towards incompetence. Hopefully nothing worse comes of it and at least the free world (much of the world outside of the west) can freely practice communist-adjacent governing.",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "Godwhyyyyyyyyyyyyyyy",
            "body": "Yes USAID should go - but they’re just getting it ready for a more refined form under the state department that the trumpists control. Look at this libs of TikTok tweet:\n\n>Pure fire from new acting director of USAID Marco Rubio:\n\n>MARCO RUBIO: “Every dollar we spend will be aligned with the national interest of the United States. USAID has a history of ignoring that and deciding that they’re a global charity. These are not donor dollars, these are taxpayer dollars. We owe the American people assurances that every dollar we are spending abroad is being spent on something that furthers our national interest.”\n\nhttps://x.com/caitoz/status/1886529083527569853?s=46",
            "score": 56,
            "replies": [
                {
                    "author": "leftofmarx",
                    "body": "Well, fuck.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "Nocturnal_Doom",
                            "body": "Yup. It was pure rebranding.",
                            "score": 9,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Inter-est",
            "body": "My Syrian friend says “Trump gives the truth about US interest that we’ve known a long time. Now that the gloves are off, more obvious and blatant measures of domination will be upheld and legitimised. No need for any underhand measures. Unlikely it will make a difference to our condition.” \n\nBut about the last line… it can give opportunity for dismantling semi-colonial formations that was funded by USAID but there is no organized politics in the third world rn. And very difficult for socialist forces to emerge while it is still under global markets that maintain its social character under largely unorganized, precarious work with semi-feudal characteristics. \n\nOn the other hand, the same funds even if invested back into ‘US interest’ it is unlikely it will be used to the benefit of workers there or even liberal welfare measures, let alone put restrictions on capital and global financial markets.\n\nSpecifically, in my country, no USAID just means more open repression and violence rather than bread and circus by the reactionary government as they try to hold onto power.",
            "score": 26,
            "replies": [
                {
                    "author": "leftofmarx",
                    "body": "Hm I hadn’t considered this angle",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "percyjeandavenger",
                    "body": "Elon is just trying to make all the money go to him. His businesses get defense funding from the government. Also I don't have a confirmation but I think I saw somewhere that USAID was looking into Starlink because they did something to help Putin or something? Idk. Anyway you are totally correct. That money isn't going back to the American people. It is going back to Elon.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Agcpm616",
            "body": "They are just gonna replace it with something else",
            "score": 12,
            "replies": [
                {
                    "author": "mttyart",
                    "body": "Yup, I think their not even going to bother with covering up their actions anymore, like dude Trump is out here doing old school imperial talking points about Greenland and Panama",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Shackflacc",
            "body": "A stopped clock is right twice a day honestly",
            "score": 17,
            "replies": [
                {
                    "author": "Careless_Owl_8877",
                    "body": "nah",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "revolutionaryroadie",
            "body": "I agree, and watching the democrats press conference outside usaid hq today was disturbing. They even said some of the quiet parts outloud and had the liberal protesters cheering but it would be the end of the world if it was the red team talking.",
            "score": 3,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 4,
            "replies": [
                {
                    "author": "urbaseddad",
                    "body": "And who are those people?",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "0fficialjesus",
            "body": "They’re just going to replace their publicly funded soft power arm with a private soft power arm through DOD contracts with like palantir and private intelligence companies",
            "score": 4,
            "replies": []
        },
        {
            "author": "ihop7",
            "body": "They are most likely going to replace it with something else, but that hasn’t stopped me from celebrating its downfall as a symbolic institution that elicits justifiable hatred globally",
            "score": 3,
            "replies": []
        },
        {
            "author": "kazooiebanjo",
            "body": "I presume this is why they’re starting with USAID, but you’re kidding yourself if you think it stops here. If anything it just makes the project of stopping it for real that much harder because none of the bad stuff is going away, just moving to the state department. The good stuff—even if it’s done for ultimately nefarious reasons—is the only stuff going away.",
            "score": 5,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 3,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": -5,
                    "replies": []
                }
            ]
        },
        {
            "author": "newgoliath",
            "body": "There's a lot of anarchy and competition among the bourgeoisie.",
            "score": 2,
            "replies": [
                {
                    "author": "TiredPanda69",
                    "body": "This is all it is. Just a reset. I mean, they're saying it out loud: \"cutting the fat\", like a CEO. \n\nUSAID will stay, with less programs, and/or all their activities will be under a new branch. Either way a few fingers will probably be lifted off of a nation somewhere. \n\nUnless they see more repression as a substitute for less programs. Which might not be the case since this administration seems a little less focused on external threats as much.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "magnetichonda",
            "body": "It's true, foreign aid also creates a culture of dependency. The Ghanaian writer Ama Ata Aidoo correctly points out that Aid is never help out of the goodness of a nation's heart, they are always scraps and not the best the nation would give itself. Aid has also become expected in many countries where politicians account for it as policy and as part of budgets. Nations should never so depend on something which 1) isn't that great quality wise and 2) can be taken away by the giver and leave the reciever in a difficult spot.",
            "score": 2,
            "replies": [
                {
                    "author": "leftofmarx",
                    "body": "Absolutely. Aid is often given as a small pittance in return for the mass exploitation of land, resources, and people. Western nations use aid for economic dumping to flood markets with grain, for example, that puts the local farmers out of business and creates that dependency you mentioned.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "agirlhasnoname17",
            "body": "It seems impossible to convince people of anything. The whole “the Dem Party can do no wrong” attitude and voter-blaming are maddening to me. \n\nBut yes, this is all extremely upsetting. And trying to convey some of these things to most people feels increasingly like explaining gravity to a chicken.",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 3,
            "replies": [
                {
                    "author": "HappyHandel",
                    "body": "Skill issue.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "neosisonite12",
                    "body": "What an embarrassing comment.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "ElliotNess",
                    "body": "What does USAID provide that you and your countrymen can't organize amongst and for yourselves?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "AltruisticTreat8675",
                                    "body": "Do you seriously think Cambodia is doing better with USAID aid money and various NGO organizations that colonized it? Rhetorical question.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "DashtheRed",
                                                    "body": "No one is saying life in Cambodia isn't difficult, but the people you are lashing out at here didn't have anything to do with ending USAID and have no power to sustain or restore it either.  The empire is cutting you off, entirely of it's own volition and economic necessity, which is the question you should be reckoning with -- what is actually possible if the upper limit of your politics is to beg the very empire which destroyed and ruined your country to toss you crumbs from their table as your primary lifeline for survival?  Just subsist and keep your head down?  Again, the empire it cutting your lifeline entirely of their own accord -- they are closing that door on you and for you and didn't think enough of you or the Cambodians to even consult you first.  Do you think if you beg them really hard they might restore it? And if so, for how long, and to what end?  Amerika is now counting the crumbs and even the welfare for it's own settler populace is getting slashed, and these people cheer the notion of abandoning Cambodia and other parts of the world to die if it might save a few more crumbs for themselves; despite already being the richest humans on the planet.  Less for you is more for them and belts are tightening.  The empire is the one telling you how to live your lives (now without USAID), not the communists who are longing to help you escape this horrible trap.",
                                                    "score": 16,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "AltruisticTreat8675",
                                                    "body": "> You DO NOT live here\n\nAww that's cute. But I figure it out that you're a VaushV poster so kindly fuck off, comprador.",
                                                    "score": 12,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[removed]",
                                                            "score": -5,
                                                            "replies": [
                                                                {
                                                                    "author": "Careless_Owl_8877",
                                                                    "body": "good luck scum sucking off imperialists for the rest of your life",
                                                                    "score": 7,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "leftofmarx",
                    "body": "Do you not think China would step in, for example?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Phoxtu-Marshmallow",
                    "body": "So, revolution is more important then your \"garlic bread\"",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": []
        },
        {
            "author": "Peter_Rod",
            "body": "Maybe Republicans are better for the working class then democrats after all.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Order-Classic",
            "body": "I think what the Republicans want is to create a direct interference policy where they will do everything openly instead of doing it through proxies like USAID. They don't care about optics or plausible deniability. This will expose their true colours. Not sure it will pay off though.",
            "score": 1,
            "replies": []
        },
        {
            "author": "deadful_great",
            "body": "“Never interrupt your enemy when he is making a mistake.”  \n― Napoleon Bonaparte",
            "score": 1,
            "replies": []
        },
        {
            "author": "skaterpunk97",
            "body": "I think what's frustrating about every action is the fact that yes we should be looking to reform and dismantle some of these systems! But it feels like both the Democrats and Republicans are missing the point! USAID did some good, yes but ultimately why were they doing that good? I'm still educating myself fully on this topic but from my understanding the good programs were to boost up our position as a world superpower and to me, essitenly translates to boosting an imperialistic ideal for the United states. The other side of it is yes we were using it to do bad things but in the end it is all accomplishing the same task! \nI think what's baffling me the most are those celebrating the funding cuts but not even questions where that money is now going to go? Because it's not like the trump admin is going to relocate these funds to boost social programs",
            "score": 1,
            "replies": []
        },
        {
            "author": "yat282",
            "body": "I still don't want it to be done this way, it can only lead to something worse.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nyrossius",
            "body": "The disturbing part is the unelected billionaire with his 6 pack of 20 year olds having unfettered access to everyone's personal information. \n\nAgain,  nothing based here. This is not an act that will in any way help a revolution for the people.",
            "score": 1,
            "replies": []
        }
    ]
}