{
    "title": "Where can I buy Communist Literature?",
    "author": "NoBack5110",
    "subreddit": "communism",
    "rank": 54,
    "score": 58,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 26,
    "url": "https://www.reddit.com/r/communism/comments/1il3nj5/where_can_i_buy_communist_literature/",
    "id": "1il3nj5",
    "selftext": "More specifically I’m currently looking for Quotations from Chairman Mao Tse-Tung. I can only find it on big capitalist sites such as Amazon.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-marxists** - This subreddit isn't here to convert naysayers to marxism. Try r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** -  Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** -  https://old.reddit.com/r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "ElliotNess",
            "body": "It's hosted freely on many sites if you want to read it.\n\nhttps://www.marxists.org/reference/archive/mao/works/red-book/index.htm",
            "score": 37,
            "replies": []
        },
        {
            "author": "AlyTheKat",
            "body": "Foreign Language Press is my go to https://foreignlanguages.press",
            "score": 27,
            "replies": [
                {
                    "author": "googloog",
                    "body": "Was going to say this! Love their work they are a specifically Maoist publishing house, you can download the PDFs for free. they also have audiobooks in the form of a podcast on Spotify.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "fromthemasses",
                            "body": "For other audiobooks not done by FLP, Socialism For All on YouTube has many of high quality .",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "socialdisamenity",
            "body": ">I can only find it on big capitalist sites such as Amazon.\n\n\"We will hang the capitalists with the rope that they sell us. And if we were to hang the last capitalist, another would appear to sell us the rope.\"",
            "score": 16,
            "replies": []
        },
        {
            "author": "ZacKonig",
            "body": "I think if you don't have a well organised communist party that sells or distributes literature it's really not that bad to get the books from capitalist sites. You know that quote attributed to Lenin (capitalists will sell us the rope which we will hang them with).\nAnyways there are a couple of small publishers in the US from which you can get books from, I don't remember their names right now but you can look for them.",
            "score": 20,
            "replies": []
        },
        {
            "author": "rrrrrig",
            "body": "Haymarket, Iskara, anarchist library, marxists dot org. If you google the book, marxists.org is like the second result lol",
            "score": 9,
            "replies": []
        },
        {
            "author": "magnetichonda",
            "body": "https://www.mlreadinghub.org/books \nTheres tons of good cheap theory books here from all around the world",
            "score": 9,
            "replies": []
        },
        {
            "author": "svesba",
            "body": "Marxist Internet Archive has a ton of literature on Mao Zedong. If you want, you can head straight to the Chinese section and use the immersive translation to turn the Chinese into English.\n\nMIA-Mao Zedong:https://www.marxists.org/reference/archive/mao/index.htm\n\n中马库-毛泽东：https://www.marxists.org/chinese/maozedong/index.htm\n\nImmersive Translate extension form Chrome :https://chromewebstore.google.com/detail/%E6%B2%89%E6%B5%B8%E5%BC%8F%E7%BF%BB%E8%AF%91-%E7%BD%91%E9%A1%B5%E7%BF%BB%E8%AF%91%E6%8F%92%E4%BB%B6-pdf%E7%BF%BB%E8%AF%91-%E5%85%8D%E8%B4%B9/bpoadfkcbjbfhfodiogcnhhhpibjhbnh",
            "score": 3,
            "replies": []
        },
        {
            "author": "comradecoffee_",
            "body": "Abebooks is a good place to get books used.",
            "score": 2,
            "replies": []
        },
        {
            "author": "No-Cardiologist-1936",
            "body": "Why haven't you decided to check the library?",
            "score": 2,
            "replies": [
                {
                    "author": "NoBack5110",
                    "body": "I have but unfortunately I live in the south",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "red_raccoon01",
            "body": "Abebooks & thriftbooks. Lulu is also a decent site, though the print quality is a bit lower since it's \"self published\", many parties use it to sell their own literature and classics. Otherwise most works can be found for free online.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ARedBlueNoser",
            "body": "This is where I got mine \nhttps://www.chinabooks.com/products/9780835123884?_pos=22&_sid=ee8784b75&_ss=r",
            "score": 1,
            "replies": []
        },
        {
            "author": "childhoodanchovies",
            "body": "I got a lot of mine from Thriftbooks. Abe books is great, but it's owned by Amazon, unfortunately. Bah",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Management_6387",
            "body": "Not recommend buying any leftist books online",
            "score": 1,
            "replies": []
        },
        {
            "author": "en_el_hoyo_la_tengo",
            "body": "go to a book store or download free PDFs on Google, I downloaded Maos red book on there. [Here](https://www.marxists.org/ebooks/mao/Quotations_from_Chairman_Mao_Tse-tung.pdf)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Environmental-Emu243",
            "body": "Should be available on Temu or Wish, surely?",
            "score": -1,
            "replies": [
                {
                    "author": "ABearInTheWoodss",
                    "body": "your solution to somebody wanting to avoid using \"one of the big capitalist retailers\" like amazon is to instead recommend *temu*? Did you read the post?",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}