{
    "title": "Is Chomsky Radically anti-Marxist?",
    "author": "whyhide_thecandle",
    "subreddit": "communism",
    "rank": 48,
    "score": 45,
    "upvote_ratio": 0.81,
    "num_comments (reported by reddit)": 28,
    "url": "https://www.reddit.com/r/communism/comments/1imynzo/is_chomsky_radically_antimarxist/",
    "id": "1imynzo",
    "selftext": "I've seen plenty of videos now of Chomsky slating the October revolution, the Bolsheviks, and Lenin. \n\nHe calls the Bolsheviks radically anti-Marxist, seemingly to put Marxists off them. \n\nHe calls the Bolshevik ruling party \"totalitarian\", \"dictatorial\", and \"anti-socialist\". And he is very well versed on the details of the revolution and the policies that followed, each of which he attributes to one of these evils. \n\nBut he never explains where these tendencies/qualities come from in terms of the material interests of the Bolsheviks; how the conditions of society produced Bolshevism, the October revolution, and how class struggle is involved in this, and so on. \n\nBear in mind that he also says that they were \"not communists at all\". So then he is more or less saying that the Bolshevik policies were not even an attempt to build communism (misguided or otherwise). But he doesn't say what their true aims were, let alone explain them dialectically. \n\nAnd the whole thing therefore is pure mysticism, no matter how many dates and events he memorises. And this is an extremely anti-Marxist way of analysing history. I think that you can, as a Marxist, aknowledge this fact while still maintaining scepticism about Bolshevism and the October Rev.  \n\nPeter Hitches (a hardline conservative anti Marxist) says (I'm quoting from memory here) \"Lenin was a German agent hired to turn Russia into a prison state.\" \n\nIn a way, that is much more Marxist than Chomsky because at least it explains things in terms of material interests. Hence I say that chomsky is not just anti-Marxist, but radically so. \n\nNow Chomsky doesn't claim to be Marxist himself I don't think, but if he appears as at least an ally of Marx infront of Marxists to abominate the October revolution, and then is woefully un Marxist in his analysis of the Bolshevik revolution and rule, I think there's a certain hypocracy in that. \n\nWhat do you think?\n\n\n\n",
    "comments": [
        {
            "author": "BommieCastard",
            "body": "The opinions and ideas of someone with more than a few links to Jeffrey Epstein should not count for much",
            "score": 12,
            "replies": [
                {
                    "author": "smokeuptheweed9",
                    "body": "Yeah his response to this was pretty gross. I stopped caring about what he has to say a long time ago but yeah, it's not normal to get financial help out from pedophile recruiters for the CIA. I would say I'm shocked anyone still even think about him after that but r/chomsky has long been another generic DNC recruitment sub\n\nhttps://www.reddit.com/r/chomsky/comments/1ipg351/you_can_immediately_tell_who_in_this_sub_doesnt/",
                    "score": 13,
                    "replies": []
                }
            ]
        },
        {
            "author": "smokeuptheweed9",
            "body": "I'm not sure I would call Chomsky radically anything. His ideas are pretty puerile and belong to a different generation. For good or ill, Marxism-Leninism has reconstituted itself and has a complete program of ideas and worldview that is easily picked up and transmitted. This includes revisionism but the anti-communism of the 1990s is a thing of the past. Like maybe in 1993 pointing out that the two state solution was international law was mind blowing, I wouldn't know. But it's not now and we have the internet. We don't need this guy to present information to us and we can no longer overlook his flaws. \n\nLook, Parenti has his problems but I only react negatively to recommendations of his work because they are used lazily for revisionist purposes. But I will still engage with him. Is there anything to engage in Chomsky? I may be the last person who still remembers *Manufacturing Consent* and I even posted once explaining that the message is fundamentally misunderstood and the model misused by liberals. Parenti at least is understood and properly applied to today's revisionism.\n\nOP I agree that those videos are persistent enough to respond to. Your response is not great but neither are the videos. You don't have to guess or find material interest. Lenin was quite capable of explaining his own reasoning which you can read for free online. Chomsky himself says his criticism is not new, in fact it was happening while Lenin and Trotskyist and Stalin and others were alive and responding back.",
            "score": 55,
            "replies": [
                {
                    "author": "IncompetentFoliage",
                    "body": "I would have expected a more critical response. This person is quoting a fascist conspiracy theory from memory because this person is a fascist conspiracy theorist.\n\n\nhttps://www.reddit.com/r/communism/comments/1ihb4w7/comment/mc7s8d8/\n\n\nThat the OP has seen \"plenty of videos\" of Chomsky says a lot about how the OP came to \"Marxism\" in the first place:\n\n\n>Then I started reading more and more from Marxist Leninists on Twitter, and saw that their analyses were way superiour to anyone else.\n\n\nAlso, not long ago you seemed to roughly equate Herman & Chomsky and Parenti's work on mass media. Why the distinction now?\n\n\nhttps://www.reddit.com/r/communism101/comments/14cuot1/comment/jopp4b8/",
                    "score": 41,
                    "replies": []
                },
                {
                    "author": "anzababa",
                    "body": "could you elaborate on Manufacturing Consent please? Or link your post about it? I literally just finished it last night",
                    "score": 3,
                    "replies": [
                        {
                            "author": "smokeuptheweed9",
                            "body": "There's not much to say. The basic point is that if you only read the title you would assume the book is about how the masses are brainwashed through the manufacturing of consent since that's common sense these days. That's not at all what the book is about. It is about the manufacturing of elite consensus and the way media discourse and the limits of political debate are determined without coercive force. The book is clear this is not for the majority and doesn't work at all outside of the elite context, since the fundamental case study is the massive divergence between popular opinion on the Vietnam war and elite \"acceptable\" opinion.\n\nSince elite media isn't really important anymore and most left liberals on reddit are looking for a political theory that explains why they are so much better and smarter than everyone else who voted for \"chad\" as prom king, the book has been forgotten. Plus Chomsky keeps embarrassing himself since 2016. What did you get out of it?",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "anzababa",
                                    "body": "ahh i see. yeah definitely. yeah the book made clear some examples where popular opinion diverged from what the media was portraying. i wasn’t too knowledgeable on the discourse (or lack thereof) surrounding the book before reading it and know very little of chomsky’s antics. i think michael parenti said chomsky was a staunch anti communist leftist and my biggest takeaway from this book was that it didn’t really strike me as anti communist and infact gave plenty of examples where anti-communist propaganda was spread",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "smokeuptheweed9",
                                            "body": "The good parts of the book are Herman who is also an anti-communist but more of a consistent anti-imperialist in the American tradition. Chomsky on his own thinks he is too clever so that when you support bombing Vietnam you're crazy but when he supports bombing Syria only he sees why it's correct.",
                                            "score": 15,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "vomit_blues",
                    "body": "> For good or ill, Marxism-Leninism has reconstituted itself and has a complete program of ideas and worldview that is easily picked up and transmitted.\n\nIn what sense? I wasn’t alive during the period of anti-communism in the 90s so I don’t know what the different between then and now is, but is there practice backing up this reconstitution?\n\nThe way I’ve seen it, Marxism-Leninism is basically an empty signifier legitimating social fascist and anti-communist tendencies today by tying them to a grand narrative around the forward march of the historical Chinese nation. This isn’t unprecedented given Khrushchev and Gorbachev both destroyed Marxism-Leninism explicitly under the banner of a return to Leninism.\n\nSo while it’s true that Marxism-Leninism has been saved from the bin of history as a historically antiquated term, I don’t see that as reconstitution. I assume you’d agree with me on the revisionist ML thing, so is there a different reconstitution happening outside of the provincial struggle I’m describing, or would even this be considered a struggle within communism?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "smokeuptheweed9",
                            "body": "That's what I mean. Take this thread for example \n\nhttps://www.reddit.com/r/Socialism_101/comments/1in195w/when_will_all_power_to_the_soviets_happen_in_china/\n\nThe OP actually already has an answer in mind\n\n>Isn't the \"capitalist stage\" that China follows aligned with original Marxist theory? If Karl Marx and Engels envisioned socialism to form in already developed nations such as England, wouldn't that directly match China's philosophy of developing their means of production using capitalism and then transitioning to actual socialism?\n\nWhere did this come from? Who knows. The most common answer is\n\n>I’ve heard the target for this is 2050\n\nWhere did they hear this? Who knows?\n\nI think 5 years ago OP would be trolling to point out the lack of \"democracy\" in China. 10 years ago the concept of socialism in China would be unimaginable, making even a troll useless since there would be no one to fall for it. \n\nWhere do these ideas come from? How do they become common sense? How do they form prepackaged ideas that anyone can pick up without reading anything or knowing anything? \n\nThe Chomsky videos OP is referencing come from the equivalent common sense of the 1990s. That is unimaginable today, like criticizing art as \"decadent.\" Anarchists and obscure tendencies of post -Marxism linger on because people's life spans are longer than the life span of ideology but they are epistemologically dead. That thread shows what any new person encountering left liberalism will come to believe.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "vomit_blues",
                                    "body": "I’m unclear on what it means to reconstitute ML then. Should we seriously consider insipid revisionism like this anything resembling ML? My impression was that it’s Menshevism calling itself ML to tie itself into China. I understand you say for good or for ill, but how could that ever be good?\n\n> Where do these ideas come from? How do they become common sense? How do they form prepackaged ideas that anyone can pick up without reading anything or knowing anything?\n\nYeah those are good questions. I really do think it’s immanent to China. My response to this is really underdeveloped, though. Something is tying into a petit-bourgeois, or labor aristocratic instinct to see China as a country in which the haute bourgeoisie are kept in control and a nascent semi-bourgeois labor aristocracy is free to attach itself to capital accumulation, giving disenchanted western kids a nationalism they can actually be proud of.\n\nAs for how this is disseminated as common sense, no clue. By that I mean it’s difficult to attach the ideology of judicial and civil society to this new wave without the most obscure abstraction over people being made petit-bourgeois in their ideals or something.",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "bashfultrapezoid",
                    "body": "can you elaborate on parenti’s problems?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "smokeuptheweed9",
                            "body": "Have you read him? I do not encourage \"debunking\" things before you read them (except anti-communist work but that's fundamentally different because no one decides to pick Timothy Snyder's work for a relaxing day at the beach, by threatening to read it you're already participating in a meta discourse about \"rational debate\" between ideologies and really just want someone to pay attention to you. So it's not about the book at all and you're not really going to read it anyway). Please read him, I'm not afraid he'll convince you. If you've read it the flaws are pretty obvious, they're just blown off as \"nobody's perfect.\" I just watched a youtube video of his explaining the real causes of the second world war and he did everything except actually answer the question. It's fine if you want to blow your mind the first time you hear that the US and Britain actually wanted Germany to invade the USSR or that Vichy France was actually kind of popular (and I'm not making fun, when I was 18 that blew my mind) but if you want to know why Germany and the US eventually did go to war you will need a theory of imperialism rooted in monopoly capitalism (rather than territorial or political aggression) and a theory of Soviet anti-revisionism which allowed them to divide and conquer the fascist powers of the world in one period and fall apart in another. Parenti has neither which is why there's never a followup megathread for those who want to understand better. You've been deprogrammed, now do onto others what has been done onto you.",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "bashfultrapezoid",
                                    "body": "i read ‘blackshirts and reds’ a couple years ago and have had ‘inventing reality’ on my queue for quite some time. i think i saw you say vijay prashad and domenico losurdo were also wack: low-key reading your comment history has been making me rethink a decent chunk of my goodreads queue aha\n\nalso can you elaborate on “for good or for ill marxism-leninism has reconstituted itself?” i thought ML was mainstream marxism, but i also saw another comment of yours where you said something like “ML isn’t real”",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "DashtheRed",
                                            "body": ">i thought ML was mainstream marxism\n\nThis would be true if you were speaking from 1952, but you are not in 1952.  What happened since then?  Trace the trajectory of Marxism-Leninism through history and explain where it connects to the \"Marxism-Leninism\" of today.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "bashfultrapezoid",
                                                    "body": "so you're saying that whatever ML is practiced today by certain communist countries is not true ML?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "DashtheRed",
                                                            "body": "That's a small part of it, but that all follows from actually learning the lesson, which is what is more important, and that's the part you need to engage with.  First, you need to have decent understanding of Marxism-Leninism until 1950 -- if you learned this history from podcasts or youtube then you need to start over from zero, and this time read Lenin and Stalin instead.  But the most important decades here are the 50s through the 70s, and you should take the time to be thorough here, since this is the breaking point for Marxism-Leninism, and you must examine what happened here and why (because shortcuts and willful ignorance are the pitfalls that will send you back to liberalism).  This was called *The Great Debate,* and at one point, for several decades (and beyond) was considered the single most important discussion (and ultimately conflict) within all of Marxism, and the nature of the debate was over the very question: *what is Marxism-Leninism?*  If you've ever wondered why basically all countries have (at least) two parties calling themselves Marxist-Leninist, it will become clear why this happened and what was going on.  This is the real history of communism and it is the antivenom to the poison of modern internet \"Marxism-Leninism\" (so-called), which you will also come to understand far more clearly.  When you understand the history and outcome of the Great Debate, you will understand the actual fate of Marxism-Leninism, and will be immunized against the internet \"Marxism-Leninism\" that preys upon ignorant would-be communists who feel that the lessons of history are not really worth learning.\n\nedit: changed the phrasing and made it less cryptic",
                                                            "score": 8,
                                                            "replies": [
                                                                {
                                                                    "author": "bashfultrapezoid",
                                                                    "body": "thanks for the breakdown, i'll keep it in mind moving forward",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "DashtheRed",
                            "body": "He was always an anti-Stalin pro-revisionist Brezhnevite, and became Gorbachev's most ardent defender and stood by him more and more strongly as his reforms got worse and worse, basically right until the end (and even after).  Basically he was always fundamentally wrong where it mattered most, in essence -- a point few Parenti readers dare admit.  Which doesn't mean he's without redeeming qualities.  If you were a communist in the 80s or even (to a lesser extent) the 90s and 2000s, then Parenti was still a very progressive figure who defended historical socialism (though also revisionism as one and the same, and he did so entirely on liberalism's terms and using their logic and rules -- actual rigorous Marxism is mostly absent from his method), and at least served some useful function by bravely providing a convincing and mostly accurate historical narrative in the West for the often condemned, marginalized, demonized, and belittled major communist movements of history (defending, for example, the USSR where even people like Chomsky wouldn't dare break with hegemonic liberalism).  This was at least useful because it gave communists a voice and perspective (if not perfectly accurate) where they were often silenced or had capitalist sock-puppets speaking for them.  However, that progressive function is mostly dead at this point, and instead the long retired Parenti is now propped up by a second wave of Brezhnevite revisionists (now defending Chinese revisionism using all the same logic and arguments that were used to defend the revisionist Brezhnevite USSR) and all of his liberal-narrative-of-communism has become the easily acceptable and digestible history of communism (and revisionism, blended together) for revisionists to feed off of, without ever having to confront the real history of communism in a revolutionary way.  All the logic of Brezhnevism is revived and \"Actually Existing Socialism\" lives again, and all of Parenti's incorrect arguments defending the Brezhnev and Gorbachev era USSR are suddenly correct again when applied to Xi Jinping's China.  But now, there's plenty of voices for historical socialism (especially in the age of the internet where you can get statements from political parties right as they are written), and instead they are marginalized to make way for the second coming of revisionism, with the lifeless shell of Michael Parenti hoisted upon a cross at the vanguard.  The worst part is that he was, and remains always wrong, in the last instance, but in the 80s to the 2000s he was a marginal academic figure that almost no one cared about and even his influence on the \"left\" was next to nothing, and he was good because he cut against the grain of acceptable \"leftism\" and challenged them to go further -- but now in the present, even fully knowing how incorrect he was about everything, he is suddenly elevated to great importance as the true voice of \"\"\"communism.\"\"\"  He's now the mainstream \"left\" -- he is now Noam Chomsky, and like Chomsky, he must now be overcome.\n\nedit: fixed grammar and added last line",
                            "score": 10,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Impressive-Mouse-532",
                    "body": "I'm still confused as to what \"revisionism\" means.\n\nIt seems the word has a colloquial meaning and then an esoteric meaning ( esoteric for Marxists ).\n\nWhat actually counts as revisionist? Bc IIRC revisionism is referring to the bastardization of Stalin's work right?",
                    "score": -3,
                    "replies": [
                        {
                            "author": "smokeuptheweed9",
                            "body": "What is the colloquial meaning? It's not a commonly used word. If you mean revisionists themselves use it incorrectly, that phenomenon is actually built into the definition itself. \n\nRevisionism refers to being incorrect. Since Marxism is correct and encompasses the totality of knowledge, revisionism is anything that is not that. If that doesn't explain it that is because you do not understand what is at stake.",
                            "score": 14,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "vpatriot",
            "body": "Check out this article: [https://www.greanvillepost.com/2020/06/03/the-mainstream-and-the-margins-noam-chomsky-vs-michael-parenti/](https://www.greanvillepost.com/2020/06/03/the-mainstream-and-the-margins-noam-chomsky-vs-michael-parenti/)",
            "score": 5,
            "replies": [
                {
                    "author": "syd_fishes",
                    "body": "\"Noam Chomsky is, according to Stephen Gowans, “an endless source of slurs against Leninism, which he equates with ‘counterrevolution,’ a heterodox view of what revolution is.” Gowans further argues that “Chomsky has enormous respect for those who have failed at revolution, and enormous contempt for those who have succeeded.” While it is true that Chomsky has provided a very good defense of the People’s Republic of China, it is also true that he has spent a great deal of his career blasting the USSR.\"\n\nJesus",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "liewchi_wu888",
            "body": "Chomsky is a fixture of the American left who serve the useful purpose of limiting the scope of radicalism to what I would call his \"anarcho-liberalism\", i.e. he may talk a radical game and even talk about a radical far future, but in the end, what really separates his short and medium term politics from, say, you average due paying social democratic DSA member? It is the sort of \"right in essence left in form\" nonsense which inadvertently allows the bourgeois to control the form the left in America by limiting it's horizon.\n\n\nAs to whatwver Peter Hitches (Hitchens?) says about Lenin being a German agent, that's just Russian Nationalist canard. ",
            "score": 17,
            "replies": []
        },
        {
            "author": "spicy-chilly",
            "body": "I think Chomsky blatantly spews anti-sovietism. Know that interview where he tells the reporter that he wouldn't be sitting there in his position if he didn't believe what he believed? Neither would Chomsky...",
            "score": 4,
            "replies": []
        },
        {
            "author": "xrtx7",
            "body": "Chomsky represents that faction of Western Marxism where they oppose anything and everything from actually existing socialist projects. Domenico Losurdo’s book Western Marxism def criticizes this while grounding it in the objective conditions of the west.",
            "score": 1,
            "replies": []
        }
    ]
}