{
    "title": "How the Cold War slowed down Soviet economic growth",
    "author": "None",
    "subreddit": "communism",
    "rank": 31,
    "score": 34,
    "upvote_ratio": 0.78,
    "num_comments (reported by reddit)": 25,
    "url": "https://www.reddit.com/r/communism/comments/1isavwn/how_the_cold_war_slowed_down_soviet_economic/",
    "id": "1isavwn",
    "selftext": "I recommend reading this article by Stephen Gowans, it's called 'Do Publicly Owned Planned Economies Work?'\n\nhttps://gowans.blog/2012/12/21/do-publicly-owned-planned-economies-work/\n\nThe author speaks about the Soviet economy, its many successes, and also seeks to explain why its rapid econonomic growth slowed down from the mid-1970s on, leading to Gorbachov's free market reforms that killed it.\n\nHe has a solid, known, but certainly non-mainstream thesis (by which I mean its a known thesis that makes a lot of sense but is rejected by most scholars) on why the Soviet economy slowed down. He explains it well, and defends it well in the comments section (which I highly recommend reading as well). It can essentially be summed up as:\n\n1: Planned economy worked very well in comparison to capitalism. Its growth record is a prime example.\n\n2: The economic slowdown (or the 'period of stagnation' as it is often called) was not the consequence of some inherent flaw in socialism or the centralized planned economy, but the consequence of the cold war (particularly the arms race between the two superpowers, which was already bad in and on itself, but got much worse under the Reagan administration, that began an actual campaign to cripple the Soviet economy and induce a crisis in it). The cold war hurt Soviet economic growth in various ways he details in the article.\n\n3: This economic slowdown was what led to Gorbachov's reforms. But as we know he screwed up by re-introducing capitalism in the economy, which led to the crisis and eventual collapse of the economy.\n\nBesides listing and explaining the many successes of the Soviet economy and therefore debunking many myths, the relevant-to-this-post part of the article is the one explaining how the cold war and the arms race slowed down economic development in various ways, which it does very well.\n\nI like this theory a lot because, contrary to almost all other theses, it puts the blame for economic slowdown on exogenous factors as the original cause for all (or most) evils (internal economic problems) of the USSR.\n\nMost analists, economists, historians, etc. focus on finding what went wrong internally, ignoring the possibility that whatever went wrong internally had its root in an outside cause: the cold war.\n\nA prime example:\n\nMany point out to the lack of innovation, technological backwardness and slack labor discipline under socialism as one of the factors that caused the economic slowdown of the 70s. I think they are very right on this, but all that can be traced back to the cold war: the Soviet Union, justifiably obsessed with defense (they had been invaded thrice since the bolsheviks came to power), and now more than ever because of the US threat, spent an enormous amount of financial, natural and human resources (money, producer goods, the best and most researchers, engineers, scientists, etc.) in the military-industrial complex to achieve and then maintain military parity with the west and deter agression, logically depriving/starving the civilian-consumer sector of all these precious resources.\n\nThe result?\n\nIt produced innovative, high quality and technologically advanced products in both the weapons and space industries (which by itself already debunks the myth that a planned economy 'can't produce quality goods' and 'kills innovation') at the cost of producing a low quantity and low quality of goods for the population by still using obsolete equipment and techniques.\n\nSo yes, the Soviet civilian economy was lagging behind the west in regards of quality, quantity, variety, etc. due to, among other things, the use of obsolete equipment, and this obviously slowed down the economy, but all this happened because of the military pressures of the cold war, not some inherent flaw in socialism or even Soviet socialism (socialism as practiced in the USSR).\n\nHere's an extraction of the article:\n\n'By the 1980s, the USSR was showing the strains of the Cold War. Its economy was growing, but at slower pace than it had in the past. Military competition with its ideological competitor, the United States, had slowed growth in multiple ways. First, R&D resources were being monopolized by the military, starving the civilian economy of the best scientists, engineers, and machine tools. Second, military spending had increased to meet the Reagan administration’s abandonment of detente in favour of a renewed arms race that was explicitly targeted at crippling the Soviet economy. To deter US aggression, the Soviets spent a punishingly large percentage of GDP on the military while the Americans, with a larger economy, spent more in absolute terms but at a lower and more manageable share of national income. Third, to protect itself from the dangers of relying on foreign imports of important raw materials that could be cut off to bring the country to its knees, the Soviet Union chose to extract raw materials from its own vast territory. While making the USSR self-sufficient, internal sourcing ensnared the country in a Ricardian trap. The costs of producing raw materials increased, as new and more difficult-to-reach sources needed to be tapped as the older, easy-to-reach ones were exhausted. Fourth, in order to better defend the country, the Soviets sought allies in Eastern Europe and the Third World. However, because the USSR was richer than the countries and movements it allied with, it became the anchor and banker to other socialist countries, liberation movements... As the number of its allies increased, and Washington manoeuvred to arm, finance, and support anti-communist insurgencies in an attempt to put added strain on the Soviet treasury, the costs to Moscow of supporting its allies mounted. These factors—corollaries of the need to provide for the Soviet Union’s defence—combined to push costs to the point where they seriously impeded Soviet economic growth'",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n*** \n\nModerating takes time. You can help us out by reporting any comments or submissions that don't follow these rules:\n\n1. **No non-Marxists** - This subreddit isn't here to convert naysayers to Marxism. Try /r/DebateCommunism for that. If you are a member of the police, armed forces, or any other part of the repressive state apparatus of capitalist nations, you will be banned.\n\n2. **No oppressive language** - Speech that is patriarchal, white supremacist, cissupremacist, homophobic, ableist, or otherwise oppressive is banned. TERF is not a slur.\n\n3. **No low quality or off-topic posts** - Posts that are low-effort or otherwise irrelevant will be removed. This includes linking to posts on other subreddits. This is not a place to engage in meta-drama or discuss random reactionaries on reddit or anywhere else. This includes memes and circlejerking. This includes most images, such as random books or memorabilia you found. We ask that amerikan posters refrain from posting about US bourgeois politics. The rest of the world really doesn’t care that much.\n\n4. **No basic questions about Marxism** - Posts asking entry-level questions will be removed. Questions like “What is Maoism?” or “Why do Stalinists believe what they do?” will be removed, as they are not the focus on this forum. We ask that posters please submit these questions to /r/communism101.\n\n5. **No sectarianism** - Marxists of all tendencies are welcome here. Refrain from sectarianism, defined here as unprincipled criticism. Posts trash-talking a certain tendency or Marxist figure will be removed. Circlejerking, throwing insults around, and other pettiness is unacceptable. If criticisms must be made, make them in a principled manner, applying Marxist analysis. The goal of this subreddit is the accretion of theory and knowledge and the promotion of quality discussion and criticism.\n\n6. **No trolling** - Report trolls and do not engage with them. We've mistakenly banned users due to this. If you wish to argue with fascists, you can may readily find them in every other subreddit on this website.\n\n7. **No chauvinism or settler apologism** - Non-negotiable: https://readsettlers.org/\n\n8. **No tone-policing** - /r/communism101/comments/12sblev/an_amendment_to_the_rules_of_rcommunism101/\n\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/communism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Otelo_",
            "body": "It is positive seeing someone defend a planned economy  against vulgar \"free market=efficiency\" myths. However, the faults of the Soviet Union can not be put on external factors: it is quite obvious that any socialist state that comes into existence will be subject to attacks from reactionary countries, in particular from imperialist ones.\nEvery revolutionary already anticipates that. Would you expect the US not to oppose the Soviet Union?\n\nThe end of the Soviet Union had to do with capitalist restoration and the revisionists that took power after Stalin's death in 1953. Revisionist reforms started long before Gorbachev: Krushchev and Brezhnev had already opened the way for what Gorbachev would end up doing. Unfortunately, I have not yet studied the history of the Soviet Union properly, so I am not yet able to tell you more about revisionism in the URSS. However, I believe that resources about the question are easy to find through a quick search (there are various documents from China until 1976 and from Albania criticizing Soviet revisionism). I just want to stress the point that the causes for the end of the Soviet Union were internal.",
            "score": 23,
            "replies": [
                {
                    "author": "None",
                    "body": "Well I disagree with you. All (almost all) internal problems (even the revisionist ideas that find their way to power) were caused by external problems (mainly economic and military pressures from the Cold War) that made reforms impossible to avoid.",
                    "score": -19,
                    "replies": [
                        {
                            "author": "memelord_1312",
                            "body": "That is an anti-dialectical point of view you have. Internal contradictions are always primary, while yes influenced by external factors, the internal factor is ALWAYS the main point.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "Otelo_",
                            "body": "By that logic, since external problems are inevitable (socialism and communism will always be opposed by reaccionaries), then these \"reforms impossible to avoid\" are also inevitable. With a logic like this, the construction of socialism too becomes impossible - so what is the purpose of even trying if revisionism is inevitable as you make it seem?\n\nBesides, you say that these reforms were impossible to avoid; and yet you also say that these reforms (although, according to you, a consequence of the Cold War) led to the fall of the Soviet Union. If these reforms necessarily lead to failure, how were they unavoidable? Perhaps something else (hint: continuing to organize society on socialist terms) would have worked out. Don't you think there is a contradiction in what you are saying?",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "The reforms that killed the Soviet economy were capitalistic reforms. They were bound to fail. Other type of reforms should have been tried. The economic crisis of the USSR caused by Perestroika was entirely avoidable.\n\nAs you point out, any successful socialist country will be met with resistance by the capitalist world. So it will be extremely difficult to make a revolution work. But not impossible.\n\nHad the Soviet leadership reacted differently to the pressures of the Cold War, history would have been completely different (as in, much more positive for socialism).",
                                    "score": -11,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Communist-Mage",
                            "body": "This is wrong:\n\n“As opposed to the metaphysical world outlook, the world outlook of materialist dialectics holds that in order to understand the development of a thing we should study it internally and in its relations with other things; in other words, **the development of things should be seen as their internal and necessary self-movement**, while each thing in its movement is interrelated with and interacts on the things around it. **The fundamental cause of the development of a thing is not external but internal; it lies in the contradictoriness within the thing.** There is internal contradiction in every single thing, hence its motion and development. Contradictoriness within a thing is the fundamental cause of its development, while its interrelations and interactions with other things are secondary causes. Thus materialist dialectics effectively combats the theory of external causes, or of an external motive force, advanced by metaphysical mechanical materialism and vulgar evolutionism. It is evident that purely external causes can only give rise to mechanical motion, that is, to changes in scale or quantity, but cannot explain why things differ qualitatively in thousands of ways and why one thing changes into another. As a matter of fact, even mechanical motion under external force occurs through the internal contradictoriness of things.\n\n…\n\nDoes materialist dialectics exclude external causes? Not at all. It holds that external causes are the condition of change and internal causes are the basis of change, and that external causes become operative through internal causes. In a suitable temperature an egg changes into a chicken, but no temperature can change a stone into a chicken, because each has a different basis.”\n\nhttps://www.marxists.org/reference/archive/mao/selected-works/volume-1/mswv1_17.htm",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "'In a suitable temperature an egg changes into a chicken'\n\nExactly. The external force makes possible the internal change.\n\nThe external force is the cold war. It made the Soviet leadership commit suicide with ill-conceived reforms.\n\nBut honestly, while I appreciate the answer, you are being way too theoretical. I didn't make the post to have a profound debate in philosophy/dialectics, but simply to show an occurence in history.",
                                    "score": -22,
                                    "replies": [
                                        {
                                            "author": "OMGJJ",
                                            "body": "> I didn't make the post to have a profound debate in philosophy/dialectics, but simply to show an occurence in history\n\nWhat do you think history is? And in what ways does it differ from 'philosophy'?",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "Completely off topic. If you are not going to debate what caused the Soviet economic slowdown, or you don't comment that you disagree or agree with the article's thesis for X reasons, then don't comment at all.",
                                                    "score": -12,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "urbaseddad",
                                            "body": "What a lame cop-out.",
                                            "score": 11,
                                            "replies": []
                                        },
                                        {
                                            "author": "Communist-Mage",
                                            "body": "No, not “exactly”. Frankly, if you are going to post here you are responsible for actually reading and responding to the substance of the comments rather than the stunning display of willful ignorance you’ve shown with this. I urge you to re-read that passage and resist the compulsion to rip a piece of it out of context to make it conform to your own (wrong) understanding. In fact it means the exact opposite of what you are trying to claim, because it is only the internal properties of the egg that make it possible to hatch under certain external conditions - hence the stone undergoing no change in the same conditions. \n\nTo spell it out for you, it is only the internal contradictions of the CPSU (revisionism) that made capitalist restoration possible, and it is that capitalist restoration which made the complete capitulation to US imperialism possible. The primacy of internal causes is universal. \n\nThe logical result of your line is (as you yourself implicitly admit) the impossibility of revolution and of socialism.",
                                            "score": 21,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "Well, I respect (though not share at all) your opinion.\n\nProbably you didn't even read the article. Or the relevant (to the post) part of it: 'Why did growth slow?'",
                                                    "score": -7,
                                                    "replies": [
                                                        {
                                                            "author": "Communist-Mage",
                                                            "body": "It’s not an opinion, this a question of scientific truth. So what is incorrect?",
                                                            "score": 11,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "The only way you are correct is: the innate (internal) Soviet leadership fear/distrust to western militarisation and aggression allowed external conditions (the cold war) to lead them towards suicide (with revisionism coming into power).",
                                                                    "score": -2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Communist-Mage",
                                                                            "body": "I see you are completely incapable of responding with any substance whatsoever. You can’t just reframe your position to make it appear to conform with dialectical materialism, I am not an idiot. It’s also factually confused, since revisionism manifested prior to the “Cold War”. \n\nAs to your question “why did growth slow” - you asked a question about this exact topic very recently and were given an answer by u/DashtheRed that you ignored:\n\nhttps://www.reddit.com/r/communism/s/g7POckQ0qA",
                                                                            "score": 11,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "DashtheRed",
                                                                                    "body": "What's funny is that the user keeps insisting that they are offering the actual Marxist explanation and yet everything they have said is pretty much devoid of *class.*  In fact, for them it essentially takes place in the realm of \"geopolitics.\"  And it's the explanation offering nothing -- in fact, in invokes dozens more vital questions; none of which this user wants to investigate: *the Khrushchev Thaw, the Secret Speech, the State of the Whole People, the anti-Party Group, Zhukov's forced retirement, the Kosygin Reforms, the Tielieketi clashes, the Valery Sablin Incident, \"Neo-Stalinism,\"* and more... I absolutely want to hear this user's explanations for all these things (which will just be them copying and pasting whatever wikipedia says), because they don't actually have any and their explanation for Soviet history just has no connection to any of these things and these are all unrelated 'events of history' drawn from a deck at random at certain clock moments, like Hearts of Iron 4 or something, rather than being the continuous motion of the same series of events playing out and being fought over.  Meanwhile \"anti-revisionism\" understands and explains all of these things, and offers a consistent evaluation, explaining who was who, and what was actually happening here on Marxist terms.  \n\nAlso I've met Stephen Gowans, he's nice and his article was good if limited, but his hope for radical political change in klanada is the old, revisionist, Brezhnevite Communist Party of Canada, which should tell you already to which dead end where his politics will ultimately lead you.",
                                                                                    "score": 17,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "None",
                                                                                    "body": "The usual practice is to attribute the Soviet Union’s demise to failure to adhere to a favored political practice. A**nti-revisionists attribute the demise to Khrushchev’s revisionism; democratic socialists to the absence of Western-style parliamentary democracy; market socialists to the paucity of markets; planning advocates to the introduction of markets; capitalists to prohibitions against private productive property; and anarchists to hierarchy. Most explanations, then, reflect ulterior motives—making the case that one’s political point of view is proved by the Soviet Union’s demise.** If only the Soviet Union had a multi-party electoral democracy, was decentralized at the point of production, adopted markets, crushed the informal market as Stalin would have, was more supportive of revolutionary movements, allowed more private ownership, etc.\n\nOf course, it could be that the country’s political system and the practices of it leadership were not the ultimate causes of the collapse, and that the ceaseless efforts of the United States to ruin the country eventually produced circumstances which the leadership blundered in reacting to. It’s not so strange that the exponents of political axe-grinding-style explanations adopt a disease model of the Soviet Union’s death (it collapsed under the weight of internal system failures) rather than viewing the death as a murder or suicide. These too are possibilities, **but are usually immediately ruled out of consideration for their uselessness in advancing political agendas.**",
                                                                                    "score": -7,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "not-lagrange",
                                                                                            "body": "It's not a matter of 'if only', but about truth. It has already been shown to you that your and Gowans' approach to history is unscientific. Instead of taking the standpoint of the proletariat in considering the problem of building Socialism in one country (in which the necessary measures to protect the Socialist State against external capitalist aggression is just one aspect among many), you are thinking like a transcendental being observing the events, turning the agents of history into passive entities whose decisions are fully determined by capitalist violence - something external to them. The necessary conclusion is that, since only capitalism has agency, it is eternal; that revolution is an ultimately doomed endeavor. \n\nTherefore, your standpoint is not only completely useless, because when laid out bare it cannot be more than a vulgar description of the appearance of events from the standpoint of an american petty-bourgeois, being incapable of grasping the cause of the events themselves (something only a dialectical materialist approach can do), but it is also very reactionary.\n\nE: it's obvious those are Gowans' words and not yours, at least put them in quotation marks",
                                                                                            "score": 13,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "None",
                                                                                                    "body": "Anything internal you can think of that slowed down the Soviet economy, every 'systemic failure/inherent flaw' can be traced back to the cold war in particular or the tensions between east and west even before WW2.\n\nTo claim that the stresses of the cold war did not retard the economy is absurd and ahistorical.\n\nThe Soviet economy worked well. Certainly better than capitalism. Why, then, did growth slow down? Well besides some natural developments (there was no longer cheap labor coming from the countryside to work in the factories, so the model of 'extensive growth' could no longer be maintained) it is obvious that the economic strains put on by the cold war played a decisive role.\n\nRevolution will always be met with violence. What did you expect? Hugs? That doesn’t mean socialist endeavor is a lost cause at all. I don't know how did you reach that weird conclusion. That the west managed to kill the USSR doesn’t mean every revolution will always fail no matter what. Like, what? Seriously where did you get that idea. Look at North Korea, or Cuba, or China. Despite imperialist pressure, they continue to survive.",
                                                                                                    "score": -8,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Autrevml1936",
                                                                                                            "body": "> Anything internal you can think of that slowed down the Soviet economy, every 'systemic failure/inherent flaw' can be traced back to the cold war in particular or the tensions between east and west even before WW2.\n\n\nThis is the same logic that Idealists use to defend religion \"anything internal to the universe that caused [insert phenomenon] can be traced back to God\" or Spirit or Consciousness etc etc. I guess, in the last instance, it was the battle between God and Satan that caused the Soviet Economy to slow down...\n\n\n> The Soviet economy worked well. Certainly better than capitalism. Why, then, did growth slow down?\n\n\nBecause it was no longer Socialist but Capitalist.\n\n\n> Well besides some natural developments (there was no longer cheap labor coming from the countryside to work in the factories, so the model of 'extensive growth' could no longer be maintained)\n\n\nWhy does a Socialist economy need Cheap Labor? Do you not see the contradiction here? In Socialism the dictum \"from each according to ability, to each according to work\" is implemented and Labor power is no longer a Commodity. To point to cheap labor as a problem means that labor Power must have been a commodity and Capitalism restored.\n\n\n> That the west managed to kill the USSR doesn’t mean every revolution will always fail no matter what.\n\n\nThe West didn't kill the USSR, the USSR died from the inside due to the Bourgeoisie winning the Class Struggle.\n\n\nIs the eventual death of an organism from the outside? Or is it from the internal organs failing, the Brain, heart, lungs, etc?\n\n\n> Look at North Korea, or Cuba, or China. Despite imperialist pressure, they continue to survive.\n\n\nAnd by your idealist postulate of external Contradictions being primary they should all have \"Collapsed\" already.",
                                                                                                            "score": 12,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "Autrevml1936",
                                                                            "body": "It is obvious to any Materialist that you are an idealist. Fear/distrust did not lead to Revisionism but the actual bourgeoisie that existed within the Party and that capitalism and class society in general have not been Abolished yet.",
                                                                            "score": 16,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "New-Glove4093",
                                            "body": "You can't \"simply\" describe historical developments, which are the result of contradiction, without dialectics. What exactly do you think dialectics is if not the science of the general laws of motion of all things?",
                                            "score": 10,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}