{
    "title": "Trump says U.S. wants to take over Gaza Strip",
    "author": "Dxmndxnie1",
    "subreddit": "socialism",
    "rank": 479,
    "score": 449,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 71,
    "url": "https://www.reuters.com/world/trump-netanyahu-set-pivotal-talks-middle-east-agenda-2025-02-04/",
    "id": "1ihxmy6",
    "selftext": "",
    "comments": [
        {
            "author": "grumpusbumpus",
            "body": "No.  We don't.",
            "score": 186,
            "replies": [
                {
                    "author": "Ugly-as-a-suitcase",
                    "body": "when he takes it, whatever administration we can somehow pull together better declare it for palestine and give them the same sanctioned protection as israel moving forward. truly the only thing left the US could do after failing them at this point",
                    "score": 29,
                    "replies": [
                        {
                            "author": "rleftistmodsarelibs",
                            "body": "Why would Trump do something good for the general public?",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Ugly-as-a-suitcase",
                                    "body": "whatever administration we can pull together is not the current administration. we need to unite and put in a new administration",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Calculon2347",
            "body": "The British Mandate worked out so well that it's a great idea to have an American Mandate \\[/s\\]",
            "score": 68,
            "replies": []
        },
        {
            "author": "Grouchy-Extent9002",
            "body": "What the fu ck",
            "score": 63,
            "replies": [
                {
                    "author": "human-aftera11",
                    "body": "His son-in-law talked about building hotels on the Mediterranean if that conversation had anything to do with it. Heard that on the radio today.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Deathtrip",
            "body": "Oppression breeds resistance.",
            "score": 64,
            "replies": [
                {
                    "author": "Hateitwhenbdbdsj",
                    "body": "This is what perpetuates violence and leads to more 9/11’s and 10/7’s…",
                    "score": 35,
                    "replies": [
                        {
                            "author": "meglandici",
                            "body": "It does and it really sucks for us.  But how did 9/11 and 10/7 workout for Natenyahu?  Splendidly(for both)!  And bush and gang and 9/11?  Also wonderfully!  But Natenyahu came out the clear winner on both accounts…",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Hateitwhenbdbdsj",
                                    "body": "Yeah the U.S. is really gonna fuck up palestine (even more) for Israel just like with Iraq huh",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "lefeb106",
            "body": "We are actually so screwed",
            "score": 35,
            "replies": []
        },
        {
            "author": "alt-leftist",
            "body": "I wonder who they sold it to already",
            "score": 14,
            "replies": []
        },
        {
            "author": "TheKen3000",
            "body": "He wants the Suez or to build a different canal…",
            "score": 10,
            "replies": []
        },
        {
            "author": "silverfang789",
            "body": "Please let's not and say we didn't.",
            "score": 8,
            "replies": []
        },
        {
            "author": "the_sad_socialist",
            "body": "So he basically said the quiet part out loud, where the Democrats had to play the game of two-faced racist civility politics.",
            "score": 21,
            "replies": []
        },
        {
            "author": "SDcowboy82",
            "body": "The only bipartisan issue in DC",
            "score": 14,
            "replies": []
        },
        {
            "author": "Zombie_Flowers",
            "body": "Even if that was the case, Israel wouldn't move aside for the U.S. They're well aware of the resources in that area",
            "score": 28,
            "replies": [
                {
                    "author": "starfire5105",
                    "body": "But what is Israel going to do when the US is the one giving them all their toys?",
                    "score": 32,
                    "replies": [
                        {
                            "author": "Zombie_Flowers",
                            "body": "I think we've seen through this ongoing genocide that Israel has significant relationships beyond the U.S. as well as tools at their disposal to resist being pushed around. All of their technology advances, for example. I can't imagine they'd spend all this time, lives lost, and investment in the region to give it to the U.S. I'm sure it'll be more of a partnership, and this is Trump talking out his ass per usual.",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "ProudMazdakite",
                                    "body": "\"I'm sure it'll be more of a partnership, and this is Trump talking out his ass per usual.\" I pray that he is.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "starfire5105",
                                    "body": "Fair enough, I guess I've just heard more about Biden sending over care packages than anyone else and assumed they wouldn't dare talk back to America bc of how much \"aid\" they get",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Zombie_Flowers",
                                            "body": "I feel that. It seems like they've been emboldened because of no significant pushback during the genocide from even the UN, so they feel like that can do whatever they want on the world stage. U.S. support is helpful, but not necessary is my personal analysis.",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "HaydenPSchmidt",
                    "body": "Netanyahu was actually gleaming at the idea. I suspect this will be the start of a staging for a war with Iran, something Bibi’s been foaming at the mouth for",
                    "score": 15,
                    "replies": [
                        {
                            "author": "Zombie_Flowers",
                            "body": "Yea.\nFolks have learned if they stroke Trumps ego it puts them in better position for their personal agendas.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Agitated_Structure63",
            "body": "With this Trump announced the definitive end of the liberal international order installed after the Second World War, and officially inaugurated without hesitation that only the strongest will rule. Any illusion falls away, and only the brutal image of the United States remains as a bully available only to its most unconditional allies in its neo-fascist crusade, with Zionism as its ideal partner.\n\nHis arrogance prevents him from drawing rational conclusions from his failures in Iraq and Afghanistan, or from the American and Israeli interventions in Lebanon. Let us hope that when this is over, there will be possibilities to promote a different world.",
            "score": 12,
            "replies": []
        },
        {
            "author": "StalinPaidtheClouds",
            "body": "I can't decide if that's a step up or down from Israeli occupation...",
            "score": 20,
            "replies": []
        },
        {
            "author": "Pollia",
            "body": "Not surprising given, what was it his son? Literally said they wanted to do that before the election even happened.\n\nThat Harris picture of \"He literally said he'd do that\" is getting a lot of use from me in my friends groups.",
            "score": 15,
            "replies": []
        },
        {
            "author": "Desperate_Hunter7947",
            "body": "Listen to the Radio War Nerd episode about the Gaza Resistance and ask yourself if the US armed forces - which haven’t “won” a war in decades - will be able to achieve what Israel just failed to do",
            "score": 10,
            "replies": [
                {
                    "author": "ProudMazdakite",
                    "body": "They might succeed if they simply wipe out Gaza's population. They killed, like, 200,000 people. That's a tenth of Gaza's population.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Meitser",
            "body": "Yknow, when referring to neocolonialism I always thought of the former colonial powers to exploit the resources of the global south for monetary gain. Not literally annexing (!!!!!!!!!!) a part of another country",
            "score": 5,
            "replies": []
        },
        {
            "author": "destructionisto",
            "body": "No we don’t, not at all. Free Palestine!",
            "score": 11,
            "replies": []
        },
        {
            "author": "Baxapaf",
            "body": "The Hague is too empty of \"Western\" war criminals.",
            "score": 8,
            "replies": [
                {
                    "author": "DennisTheKoala",
                    "body": "Hell is too empty of western war criminals",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dazzling-Screen-2479",
            "body": "They won't be able to.",
            "score": 3,
            "replies": []
        },
        {
            "author": "NihilisticPollyanna",
            "body": "He's horny for that \"beautiful beachside front\" and all the opportunities for real estate development. \n\nYou could see the dollar signs rotate in his eyes when he talked about it.",
            "score": 4,
            "replies": []
        },
        {
            "author": "littletinyfella",
            "body": "god libs are gonna be so insufferable about this \n\n“I wonder how the pro palestine non voters feel now” is flooding every single politics subreddit",
            "score": 46,
            "replies": [
                {
                    "author": "silentmere",
                    "body": "Sorry if I’m mistaken (I don’t live in the US), but from what I’ve seen most Pro-Palestine supporters didn’t vote for Trump tho? Most went to third party and Harris, so I actually don’t get why they’re saying this.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "littletinyfella",
                            "body": "I think its largely because they refuse to acknowledge their poor electoral performance and its convenient to blame “those damn socialist commies” every time. \n\nAnd some of them just believe that voting for a third party candidate is the same as voting for trump.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Randal_the_Bard",
                                    "body": "\"The only way to persevere democracy is to... vote for this one and only approved candidate whose interests are directly opposed to your own.\"\n\n\nPsychopathic logic. If this is what we're preserving, it isn't worth saving. ",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "littletinyfella",
                                            "body": "Especially when “we’re not the other guy” has been the only electoral strategy for the last 3 elections now",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "bradicality",
                    "body": "I always wonder if those people see all the top comments coping and saying the same thing and think “yeah I’m gonna go ahead and post my own version of this little beauty”",
                    "score": 14,
                    "replies": [
                        {
                            "author": "Rodot",
                            "body": "And you know if you asked any of them of *their* opinion on Israel, well, you'll know they weren't no protester",
                            "score": 14,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "grundsau",
                    "body": "It's ridiculous that you can have a politician back a genocide and the people who liberals get upset with are those who refuse to back said genocide. Like you have Redditors talking about how only the \"privileged\" didn't vote for Harris. It's disgusting. The idea that Democrats could just not support genocide doesn't even cross their mind. It leaves us with a ghoulish game where the Democratic leadership expects us to accept continuously worse positions, supposedly to protect the most vulnerable among us. Of course, as the positions veer towards reaction more strongly, those same vulnerable groups are cut off from protection one by one anyway.\n\nI try to find solace in the fact that this will only hasten the demise of the Democratic Party. Well, I hope it does at least.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "socialism-ModTeam",
                                    "body": "Hello u/Skipper12!\n\nThank you for posting in r/socialism, but unfortunately your comment was removed for the following reason(s):\n\n>**Reactionaries:** r/Socialism is a subreddit for socialists to discuss socialism. This means that any user promoting right-wing politics or using reactionary rhetoric is subject to a ban. This includes but is not limited to fascists, conservatives, anarcho-capitalists, monarchists, and anyone else pushing anti-socialist political positions. This is not a debate sub, it's a community. Users looking to argue are encouraged to visit one of the debate-focused subreddits in our sidebar.\n\n>This includes but is not limited to:\n\n>- Fascists and/or fascist apologia\n\n>- Right and/or quasi far-right wingers (ex. conservatives, ancaps...)\n\n>- Brocialism\n\n>- Accelerationism\n\n>- Anti-socialist rhetoric\n\nFeel free to send us a modmail with a link to your removed submission if you have any further questions or concerns.\n\n>**Liberalism:** Includes the most common and mild occurrences of liberalism, that is: socio-liberals, progressives, social democrats and its subsequent ideological basis. Also includes those who are new to socialist thought but nevertheless reproduce liberal ideas.\n\n>This includes, but is not limited to:\n\n>- General liberalism\n\n>- Supporting Neoliberal Institutions\n\n>- Anti-Worker/Union rhetoric\n\n>- Landlords or Landlord apologia\n\nFeel free to send us a modmail with a link to your removed submission if you have any further questions or concerns.\n\n\n\n- r/socialism's mod team.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MysticKeiko24_Alt",
                    "body": "Well? Genuinely, why is Gaza being completely leveled with its population forcefully removed for tacky American casinos the same as at least a ceasefire and weapons embargo?",
                    "score": 0,
                    "replies": [
                        {
                            "author": "littletinyfella",
                            "body": "You think it JUST got completely leveled with its population forcefully removed?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "MysticKeiko24_Alt",
                                    "body": "Never said that",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "Seemingly both parties aren't the same afterall.",
            "score": 5,
            "replies": [
                {
                    "author": "RiboflavinDumpTruck",
                    "body": "Both suck, one is infinitely worse",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Randal_the_Bard",
                    "body": "One is the sword, the other the shield, same fuckin policy though; marching toward the same outcomes ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MysticKeiko24_Alt",
            "body": "What’s the non-voting excuse now? Congrats, you refused to vote and didn’t enable the genocidal politicians of the Democratic Party. Instead of a potential ceasefire and weapons embargo against Israel, we have this. Voting is NOT reflective of your political beliefs it’s a TOOL, in the pursuit of perfect you’ve abandoned “decent” for horrible.",
            "score": 2,
            "replies": [
                {
                    "author": "Dxmndxnie1",
                    "body": "Imagine being a liberal who doesn’t care about Palestinian liberation or ending the genocide in the Gaza Strip but than sees the current situation happening and immediately goes around online going those Arabs and Palestinians in Michigan should of just stfu and voted for the democrats who are just as Zionist and Jewish supremacist as Trump. That’s a sick individual who’s no leftist!",
                    "score": 2,
                    "replies": [
                        {
                            "author": "MysticKeiko24_Alt",
                            "body": "Imagine thinking that you care about ending the genocide when you indirectly contributed to it. You’ve addressed none of my points and continue the “bOtH sIdEs” rhetoric, which helps us get nowhere considering that one side AT LEAST would have negotiated a ceasefire and a potential weapons embargo. This isn’t an advertisement for the democrats, it’s just logic, one side is worse than the other. So I’ll ask again, what is the excuse this time?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Dxmndxnie1",
                                    "body": "Free Palestine and fuck Jewish supremacy. There’s your both sides!",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "MysticKeiko24_Alt",
                                            "body": "Do you think I disagree?",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "thedude213",
            "body": "Why is he so desperate to steal foreign land?",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -8,
            "replies": [
                {
                    "author": "grundsau",
                    "body": "Democrats will say \"you have to support genocide to win an election\" and then not win an election",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "DaemonNic",
                    "body": "Buddy Kamala lost harder than the Dems have lost in actual decades. She didn't even have the popular vote. Find a better cope.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Irrespond",
                    "body": "Socialists don't owe imperialist politicians a goddamn thing.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "Dxmndxnie1",
                    "body": "Get outta here with that shiii",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "socialism-ModTeam",
                    "body": "Thank you for posting in r/socialism, but unfortunately your submission was removed for the following reason(s):\n\n>**Liberalism:** Includes the most common and mild occurrences of liberalism, that is: socio-liberals, progressives, social democrats and its subsequent ideological basis. Also includes those who are new to socialist thought but nevertheless reproduce liberal ideas.\n\n>This includes, but is not limited to:\n\n>- General liberalism\n\n>- Supporting Neoliberal Institutions\n\n>- Anti-Worker/Union rhetoric\n\n>- Landlords or Landlord apologia\n\nFeel free to send us a modmail with a link to your removed submission if you have any further questions or concerns.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ProudMazdakite",
            "body": "Do you think trump will actually be able to do this politically? (Also, by Ahura Mazda, even seeing ~~netanyahu~~'s face disgusts me!)",
            "score": 1,
            "replies": []
        }
    ]
}