{
    "title": "RCA: We Need to Fight Trump AND the Liberals",
    "author": "CulturalMarxist123",
    "subreddit": "socialism",
    "rank": 367,
    "score": 43,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 10,
    "url": "https://www.youtube.com/watch?v=0TojKJ070Tc",
    "id": "1inff9r",
    "selftext": "",
    "comments": [
        {
            "author": "Harbinger101010",
            "body": "RIGHT!  But first we have a huge load of work to do to succeed.  We have to begin with coalition-building and education.",
            "score": 10,
            "replies": [
                {
                    "author": "InspectorRound8920",
                    "body": "Right. We can't have little niche issues. It's the system that has to change. Do that, and the niche things will get sorted out.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "nonamey_namerson",
                            "body": "Could you give some examples of \"niche issues\"?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "InspectorRound8920",
                                    "body": "Healthcare. Public education. Public housing.",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "Harbinger101010",
                                    "body": "I think what he's saying is that addressing individual issues to \"fix\" them does nothing to change the underlying cause, which is capitalism.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "libra_lad",
            "body": "I thought the RCA line was that he was a bonapartist? Are they recognizing he's fascist?",
            "score": 1,
            "replies": []
        },
        {
            "author": "ChinaAppreciator",
            "body": "trot detected opinion rejected",
            "score": 1,
            "replies": [
                {
                    "author": "Impressive_Love_875",
                    "body": "The RCA/RCI is a Trot organization. They have toned down their Trotskyist rhetoric and most references to him on their website but as far as I know they are still a Trotskyist organization.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "LK4D4",
                            "body": "What about them being Trotskyists would prevent someone to organize with them?\nAre there real deal breakers apart from international revolution? Is it considered utopic?\nI mean in my country (and many others) there is almost no choice with whom to organize.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Impressive_Love_875",
                                    "body": "Was responding to someone's comment saying \"Trot alert\" or something to that effect. Although I take issue with many of Trotsky's ideas I do not have any issues working with Trotskyists.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}