{
    "title": "Why can’t leftists/socialist and even people who do peaceful protests, come together and actually start doing civil rights movement era/Black Panther party behavior?",
    "author": "Leading-Professor-43",
    "subreddit": "socialism",
    "rank": 277,
    "score": 373,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 87,
    "url": "https://www.reddit.com/r/socialism/comments/1ir1r5k/why_cant_leftistssocialist_and_even_people_who_do/",
    "id": "1ir1r5k",
    "selftext": "My apologies if this question bothered you sounds loaded and a bit redundant I am very curious of everyone’s opinion\n\nIt’s just something that’s been on my mind for a bit \n\nWhen I look at posts over the pond and to other places like Mexico and Canada, I constantly see things like \n\n“You Americans need to band together and stop your government” \n\nAnd it’s like, not only will they levy such immense violence (especially against trans people and POCs) and brutality on to us. Which it’s like a deterrent in and of itself, which is already terrifying enough. \n\nIt feels like we are locked into just peaceful protesting until something happens? \n\nWhich then the government (by government i mostly mean SCOTUS, Donald trump and his goons) proceeds to ignore all of that and keeps doing the horrible shit anyway.\n\nIs there anything that we can do? It just feels like a constant roll down a hill and we can sometimes get up and slide down on our feet, but then we trip and it’s right back down to tumbling like a log. ",
    "comments": [
        {
            "author": "EpicThunderCat",
            "body": "We can! I have been trying to network with DSA, 50501, general strike, local unions ect.. to all pick a day and we all go out together. I understand there may be different values between organizations but there is power in numbers. We need 3.5% of the population to enact change.\n\nContact your local movements and try to get leadership connected and talking. It's up to the people to do this stuff. Nobody will save us.\nHere are some resources I have compiled. We just need to get them networking and organizing together!\n\nPro worker groups to join: \n\nhttps://www.dsausa.org/ \n\nhttps://socialistra.org/ \n\nhttps://pslweb.org/ \n\nhttps://socialism.com/ \n\nhttps://www.iww.org/  \n\nhttps://www.ilo.org/ \n\nMore: \n\nhttps://www.fiftyfifty.one/ \n\nGeneral Strike\nhttps://generalstrikeus.com/ \n\nhttps://discord.gg/liberty1765\n(Supportive community for public)\n\nhttps://discord.gg/socialworkers\n(Supportive community for social services workers) \n\nhttps://legiscan.com/ \n(To track bills in your local state) \n\nhttps://5calls.org/\n(How to call legislators)\n\nState specific resources: \n\nhttps://www.indivisibleor.org/",
            "score": 192,
            "replies": [
                {
                    "author": "Leading-Professor-43",
                    "body": "Genuinely thank you for this, trying not to fall into the doomer pipeline",
                    "score": 52,
                    "replies": [
                        {
                            "author": "EpicThunderCat",
                            "body": "I am debating making a post in here, but idk if the mods would be okay with it. I know people are feeling lost.",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "BaronTazov",
                                    "body": "Just post it out to various left wing subs and see what sticks- I think anyone to the left of Hitler should be pitching in at this point.",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "EpicThunderCat",
                                            "body": "100% I agree",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "atoolred",
                                    "body": "You should! That’s a great idea. Maybe message the mod team and see if they’ve got additions/feedback and will co-sign it for visibility",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "gracielamarie",
                            "body": "I recently joined a socialist group and its the best thing I ever did. Not only do I feel optimistic again, but we actually get shit done. Yes it’s on the local level, but it legitimately makes a difference in people’s lives.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Holiday_Objective_96",
                    "body": "Mentor me. Ive been trying to link up the few orgs that I know and idk, I don't have a good strategy... I'm just popping up on people's post saying 'join up with www.generalstrikeus.com join up with www.indivisible.org ' and idk I feel like a spambot",
                    "score": 8,
                    "replies": [
                        {
                            "author": "EpicThunderCat",
                            "body": "I have been going into their discords and signal channels and connecting with people in my area and then asking who I can talk to in order to network ect... it's not too bad!",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Holiday_Objective_96",
                                    "body": "💪 I need to do more- really incorporate these meetings into my personal schedule.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ThePoppaJ",
                    "body": "Hi, please let Green Party US know about this, so many of us over there would love to collaborate on putting forth a united front against the bipartisan evil (plus many of our members are also in those groups & run under our ballot line.)",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "CautionaryFable",
                    "body": "Is there *any* progress in getting them talking? That's been a major thing that I've been concerned about.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "EpicThunderCat",
                            "body": "Yes! It's been going well!",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Gryehound",
                    "body": "You need 3.5% to start a revolution. Enacting change w/o a revolution takes many millions more as well as the support and funding to get around over a century of laws and the bottomless ocean of $ that has set up this facade of democracy.\n\nOh, and you need pretty deep reservoir of money and support to make the revolution happen as well.\n\nPositive thinking isn't going to stop this and we're never going to be allowed to vote our way out. Half the country doesn't even understand that deporting 10s of millions of people isn't possible, and worse, they don't care. They've already chosen to sacrifice their own futures and those of their children to rationalize their mindless hatred.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "mmochan88",
                            "body": "Where does the 3.5% figure originate from? Also, do you not need an absolute breaking point/crisis, usually a war that involves losing working men from your own population?\n\nThe U.S. is (unfortunately, some might say) well insulated from such an event due to its geographical location. The last land-based conflict in the territory was the Civil War, the last mass enlisting of troops was 2003, that became very unpopular, so now they use drones and private contractors.\n\nIt seems like it would take something truly awful to prompt the type of crisis that revolutions spring from.\n\nEdit: sorry if that comes across as despairing, it's meant in the genuinely inquisitive, open exploratory sense. As a foreign observer I am delighted to know there is organising going on in the U.S. and hope you'll live to see the fruits of your labour.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Chuck_Walla",
                                    "body": "I don't know if the 3.5% rule came from [Harvard](https://www.hks.harvard.edu/centers/carr/publications/35-rule-how-small-minority-can-change-world), but they explain it succinctly: \n\n>Nonviolent protests are twice as likely to succeed as armed conflicts – and those engaging a threshold of 3.5% of the population have never failed to bring about change.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Gryehound",
                                    "body": "A book written a few years ago that was based on a study of 100 revolutions, both failed and successful, around the world. Obviously (I hope), both the study and the book are much more complex and detailed, but that is the origin of the 3.5% figure.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "fremenator",
            "body": "We are???   There are about 4 mobilizations a week that I hear of in my circles.   If you go join an organization you will learn about tons of opportunities",
            "score": 34,
            "replies": [
                {
                    "author": "Leading-Professor-43",
                    "body": "I believe you, I have seen it, however I’m mostly repeating what I’m seeing from other online spaces. \n\nLike the influx of Canadians saying “We’re not doing enough as people” against the US government",
                    "score": 10,
                    "replies": [
                        {
                            "author": "fremenator",
                            "body": "Yeah I guess my point is just that we got to encourage people to get offline and in the streets",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "Leading-Professor-43",
                                    "body": "100% you are correct on that",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ItsBadPigeon",
            "body": "A lot of people are still waiting for the democrats to save them. Thing is, if they were going to save us, they would've done it already.",
            "score": 32,
            "replies": [
                {
                    "author": "atoolred",
                    "body": "I see people in some of these subs doing such mental gymnastics to avoid going outside and getting organized. If the democrats didn’t respond kindly to Occupy Wall Street with largely the same geriatric leadership, the addition of a minority progressive wing is not going to change much for them",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheErrorist",
            "body": "People like MLK wouldn't even make it on TV today. It was big news coverage back in the day for civil protests, but now 4 or 5 companies own all media and they will never allow that level of civil disobedience to gain traction publicly.",
            "score": 27,
            "replies": [
                {
                    "author": "Leading-Professor-43",
                    "body": "Very very true, I’ve yet to see any updates about Luigi yet, not on my socials and it’s been hard finding updates. I feel as though if we let this slip under the rug and they either execute him and try to move past it, that might say a lot about a lot of Americans",
                    "score": 9,
                    "replies": [
                        {
                            "author": "atoolred",
                            "body": "Luigi actually [made a public statement for the first time](https://www.rollingstone.com/culture/culture-news/luigi-mangione-website-statement-united-healthcare-ceo-1235268920/) on Valentine’s Day. He’s got a website now, managed by his legal team so we can keep up with his court dates there. He’s got two like next week. \n\nr/freeluigi also tends to post up to date news; I was avoiding subscribing bc it felt a little cringe of me to do but honestly I’d rather hear about it from a centralized location than have to check like 3 sites and hope one of 10 subreddits posts about it AND Reddit allows it to be at the top of my feed \n\nAlso it sounds like people have been sending him a lot of books and he’s a bit backlogged. Really wonder what he’s been reading. Doubt they’d let him have a copy of *State And Revolution* but I really contemplated sending it to him LOL\n\nEdit: Luigi’s website, [“Luigi Mangione Info”](https://www.luigimangioneinfo.com)",
                            "score": 16,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Gryehound",
                    "body": "\"It was big news coverage back in the day\"\n\nBig Headlines as \"The Most Hated Man in America\". Even now, just look at what they've done to his legacy (as whitewashed as you can get). Almost no one under 50 knows anything about him or the movement, and think he gave a speech once about a dream he had.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "trichomeking94",
                    "body": "this plus with social media it’s even worse, which is where the vast majority of people get their news and information from.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Vicky_Roses",
            "body": "We do not share the same culture with the people who were behind the civil rights movement in as far as the black community actually had places to congregate in such as churches and communities of likeminded people that they lived around.\n\nConsider that the socialist movement is more broad than the African American community. It has people of all kinds of backgrounds, and because socialist governments have been so thoroughly unexplored past the Soviets and whatever offspring here and there that survived American capitalist intervention that aren’t even communist in the traditional sense anymore, we have no unified vision of the future to get behind. When fascists do fascist things, they can all get behind the idea of hating trans people and undocumented immigrants, and it’s in the name of capitalism, which we’ve been familiar with since the invention of this country. Meanwhile, on the left, we have any variety of leftist ideologies that we ideally would want, but they can be very different if you have people ranging from DemSoc to a generic socialist, Marxist-Leninist, anarchists (of which you have different kinds of anarchism), etc. \n\nOutside of a lack of a unified vision, we do not know each other even in this Reddit community beyond the walls of this screen with text posted by anonymous users. Social media has thoroughly decimated the idea of ever needing to meet face to face anymore, and we have substituted physical third spaces with Facebook and Twitter. We can’t congregate in a church or something like black people did, for example. Hell, we can’t even hang out with each other after we get off of work.\n\nFinally, this is something I feel that hasn’t been pointed out here yet, but I believe that the lack of a communist antagonistic superpower like the Soviet Union was for the states is severely handicapping any form of progress made. When the Soviet Union, which had an ideological predisposition for a globalized socialist society, collapsed, the US no longer had any adversaries to keep its worst tendencies in check. For example, part of the reason why black people managed to succeed in gaining more equality was because the Soviet Union was smart enough to point at and propagandize the plight of black people in America and go “How the hell can you people call yourself the land of freedom and opportunity if you were founded on the bondage of people of color and the continual discrimination and subjugation of them today?”, which forced the United States to go “Fuck, they’re ruining our image on the global stage. Nobody will buy into capitalism if they think about what we keep doing to black people” and play ball by signing the Civil Rights Act.\n\nI’m afraid we no longer have an adversary like this who could bring out our better qualities. I wish China were this, but I don’t get the impression they care all that much whether anyone else is a communist or not, and their version of it is already poisoned enough that they can barely even call themselves socialist anymore. Unless China were to step up with some grander design to uplift the working class, which I don’t believe is happening anytime soon, then we have no peer in this world. We have absolute authority to act without impunity to the point where the CIA doesn’t even bother assassinating random leaders and figures anymore since there is no point.\n\nThere’s a lot going against us, and we’re fucked. At the very least, I wish we could rally behind one idea and push for it. Personally, I’m not a communist, but if the majority of the proletariat agreed “We need communism” and we had the guy for it, I’d gladly throw support behind them for the sake of moving past whatever the fuck this technocratic fascist bullshit we have now. I’m also not a DemSoc, but fuck it, I’d be for them too. I’d gladly take what I’d consider “mere averageness” over this any day. I literally do not care how we get there, but I desperately want out of the current situation.  I don’t think the rest of the leftist community shares this same sentiment though.",
            "score": 11,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": ">[Socialist Society] as it emerges from capitalist society; which is thus in every respect, economically, morally, and intellectually, still stamped with the birthmarks of the old society from whose womb it emerges.\n\nKarl Marx. Critique of the Gotha Programme, Section I. 1875.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/socialism) if you have any questions or concerns.*",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "CautionaryFable",
            "body": "Part of the problem is a fundamental disagreement of what \"coming together\" means and who's allowed into the party (lots of \"it's a class war, but I also won't work with people who identify as x\" energy), along with the US being designed to isolate, so a lot of people aren't even sure how to do that because they don't even know what community is. Couple that with the fact that the \"civil rights movement era\" and Black Panther party had a face, a personality, to rally behind, not just an idea, and the modern era doesn't.\n\nBasically, there's no one answer. Just a lot of problems that no one has solved as of yet.",
            "score": 28,
            "replies": [
                {
                    "author": "Leading-Professor-43",
                    "body": "Hmm I understand, A lot of division and separation keeps us from coming together?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ChessDriver45",
            "body": "I think we can, but the recrimination needs to stop. There can’t be talk of shoving each other against a wall. We have to have solidarity. We can’t tell social democrats or vets to kick rocks.",
            "score": 44,
            "replies": []
        },
        {
            "author": "HotTacoNinja",
            "body": "As a Canadian who expresses opinions similar to the ones you are hearing,\n\nI just find it very rich that I have had conversations with even lefty Americans who will defend the Second Amendment as a defense against a \"tyrannical government\" which ignores rule of law and separation of powers. From where I am sitting, that is exactly what is happening but as soon as I mention the second amendment now, the response is \"well the republicans have all of the guns\". Last time I checked, a Republican voting ID wasn't required in a gun purchase.\n\nIt seems like many are happy to praise the actions of Luigi and what it means symbolically about an individual standing up against rich billionaires and corporate greed but when it comes to taking more action US citizens are happy to sit on their hands and wait for someone else to figure it out. \n\nYour government and president is attempting to destroy foreign allies through economic force, in an attempt to annex us and destroy our sovereignty. I know I can't ask Americans to stand up for a foreign nation, but at least stand up for your own.",
            "score": 8,
            "replies": [
                {
                    "author": "Leading-Professor-43",
                    "body": "Ah I never considered that, thank you for your input, it just seemed all Canadians were just going to throw all Americans under the bus. There’s a lot of people who are definitely afraid of the US government (fair) but We just can’t keep sitting on our hands.\n\nI feel as though armed protests to need to happen (they are happening in a lot of places) more and I definitely see the plight of Canadians because he’s 100% serious and it’s getting scary",
                    "score": 4,
                    "replies": [
                        {
                            "author": "HotTacoNinja",
                            "body": "Definitely not all Americans. Most of us are truly upset with the Trump, Elon, Maga, Republican fascists that even the US Liberals seem to be mad at. The issue is that to me, inaction speaks louder than words. I'm seeing daily posts by well-meaning US Citizens on Canadian subs saying they are \"sorry\" for what is happening and for Canadians to \"keep fighting\" but I am personally seeing very little fight come from US left-leaning circles. \n\nThe Occupy Movement after the 07/08 financial crisis was a pretty large reaction to serious economic problems and perceived inaction by the government. I am not seeing nearly that level of reaction from people now. Nobody is attempting to occupy spaces, shut down the economy to make a point, organizing a massive general strike. It feels like very little direct action. I just hope I see more, because it looks like Americans are trying to \"thoughts and prayers\" their way out of it.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Leading-Professor-43",
                                    "body": "Not surprised at all that a lot of them are very complicit and stagnant. I mean it’s even taught to us in school, when I was in school I was told about how “peaceful” MLK and how radical and violent, hateful Malcom X was and if we just be peaceful, get out there and vote, things will all go back to normal",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "infrontofmyslad",
                    "body": "*when it comes to taking more action US citizens are happy to sit on their hands and wait for someone else to figure it out.*\n\nDidn't you guys just have some big fascist truck caravan thing? Weren't your police violently suppressing indigenous land rights movements for most of the 2010s? Were Canadians upset about those things?",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "DigitalHuk",
            "body": "For centuries the capitalist class has been working to divide the working class. We are recipients of the most intense, prolonged, well researched and funded Intentional campaign of internal division sowing perhaps in modern history. Citizens of this nation are taught to workshop individualism, demonize communism and hate any sense of responsibility to others or society. It's not surprising we cannot organize collaborative effort to pursue what's obviously in our shared interests. Contemporary modern life here is intentionally atomizing, dislocating and crushing to deal with. This leaves most workers desperately trying to survive and focused on themselves and their immediate family with great suspicion for anything that would actually help them understand their lives such and what to do about it (communism).",
            "score": 5,
            "replies": [
                {
                    "author": "Drunkpool200",
                    "body": "This is extremely true. Hell the reason that we don’t have high speed railway and our interstates are terrible is so that it is harder for us all to get to one place at the same time",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Drunkpool200",
                    "body": "This is extremely true. Hell the reason that we don’t have high speed railway and our interstates are terrible is so that it is harder for us all to get to one place at the same time",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Whereismyadmin",
            "body": "People are waiting for leaders, leaders who are willing to risk everything they have, their lifes. Leaders that are proper, besides they are scared people are scared that if they were to rise up against the classwar and loose they were loose their everything as well. People are waiting for another Lenin, Che, ho chi etc",
            "score": 22,
            "replies": [
                {
                    "author": "Leading-Professor-43",
                    "body": "It is so unfortunate because neo nazis and right wingers can come together on the singular and intense hatred of minorities, no matter the difference in their specific views\n\nOn the flip side we have people fighting over if transfem and transmasc lesbians are valid (which they are) but it gets so tiring to see infighting constantly",
                    "score": 14,
                    "replies": [
                        {
                            "author": "Whereismyadmin",
                            "body": "tbh one of the most problematic things in protests are something you have just pointed out, we as people cannot priotortize what is most important to fight for. For example people in america calling themselves socialists fights for gender idea yet they should be fighthing for an socialist state. I myself believe every gender is real but I would not fight it unless the capitalistic goverment have fallen. because there are more important things than other problems.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "CautionaryFable",
                                    "body": "I'd argue part of the problem is framing it as a \"more important\" problem. Like, being allowed to exist as yourself is an important problem to the people it affects. It's the foundation of their entire being. Their entire life.\n\nNot sure what a better framing would be, but I'd at least say \"prerequisite\" would be less inflammatory.",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Whereismyadmin",
                    "body": "peaceful protests will never achive anything, any peaceful protest is legal because governments know that they are not capable to achieve anything with it. + I belive there are new problems in the books we have, as the time progress Lenins and Marxs theorys tend to rust just like everything I believe we need a new theory that is able to adapt the new world under the dialetic materialsim idea, under communism but new / adapted",
                    "score": 14,
                    "replies": [
                        {
                            "author": "atoolred",
                            "body": "Lenin certainly did not have to face an advanced militarized police force and surveillance state during the Russian revolution. \n\nThe US government was built in a way to stave off popular uprising as a response to Shay’s Rebellion, so we need theorists who are very knowledgeable on this\n\nHopefully this is nonspecific enough to not land me on a list before I’ve gotten anywhere as an organizer",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Gryehound",
                                    "body": "Those all too few, like yourself, that have actually spent some effort to learn are why I'm here and why I, occasionally, hold out some hope for a future.\n\nThank you",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "atoolred",
                                            "body": "You’re welcome! It makes me feel good for my effort to be recognized, even if I don’t feel that I am doing much yet. I really enjoy learning about history. Being able to connect the dots and piece together how exactly we got to this point, what mistakes were made in the past, and what was done well that we aren’t doing anymore, are all very important and fascinating. \n\nThere are comrades much more well read than myself, and there’s always much more to read and learn. It’s quite motivating for me\n\nBut yeah, understanding how we got here will help us better learn how to move forward. The elites realize this which is why in the US they make sure to teach us that socialism/communism are *soooo evil* from very early on. Navigating that propaganda can be tricky at first",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "token_internet_girl",
                    "body": "You can't have a modern day Lenin or Che, as soon as someone gets close the liberals will drag every tiny fault through the mud and mock them in the media 24/7. People will call them cringe and edgy and laugh at them.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "lol_shavoso",
                            "body": "Look what happened to Greta, she was portrayed positively when she was \"inoffensive\" to the system. The moment she started questioning capitalism you never heard the media talking about her ever again.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "Drunkpool200",
                            "body": "We should make Bill Burr the modern day Mao 🤣",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Holiday_Objective_96",
                    "body": "I'm putting out the bat signal for Angela Davis.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Leading-Professor-43",
                            "body": "One of my favorite black political activists",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ThalesBakunin",
            "body": "If we can't agree on how to come together we should just figure out how to agree on tearing it apart",
            "score": 11,
            "replies": []
        },
        {
            "author": "InevitableFluid6910",
            "body": "NYC protest tomorrow [https://www.mobilize.us/indivisiblenationbk/event/755921/](https://www.mobilize.us/indivisiblenationbk/event/755921/)",
            "score": 5,
            "replies": []
        },
        {
            "author": "Gryehound",
            "body": "You do know what the ruling class did to the Black Panthers, right?",
            "score": 5,
            "replies": []
        },
        {
            "author": "MightyBigMinus",
            "body": "because we all live in suburbs where the churches and lodges and union halls disappeared a generation or two ago.  there is literally nowhere to physically come together.  there are no town squares.  we have been atomized into individual watching television and looking at our phones.",
            "score": 10,
            "replies": [
                {
                    "author": "Dazzling-Screen-2479",
                    "body": "I've never lived in a manufactured suburb in my life. Small towns with plenty of public space and history as old as near by cities... yes. Coldesacs built in 1986, where the nearest public space is the walmart.. no. I understand a lot of people live in spaces like this but all? Most of americas proletariat live in urban/crowded suburban areas not middle America.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "ThalesBakunin",
                    "body": "We don't need physical space",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Leading-Professor-43",
                            "body": "I do kinda get what they mean, everyone wants like, I guess you could call “Backseat collectivity” where they don’t have to get their hands dirty and don’t have to be at the protests or doing food drives and what not\n\nThey can just put a hashtag or flag in their name and call it a day",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Gryehound",
                            "body": "Yes, we really do. You and I might come to believe that we are good friends, make great plans, and share goals, but since you live in GA and I'm in Australia, how are we going to get anything done? Then of course there's the near certainty that at least one of us works for the FBI, CIA, etc.\n\nThe world is real and for anything real to get done requires real people getting together in our real world.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "broselovestar",
            "body": "Whenever you have questions like this, remember that humans are beautiful and smart and resourceful. It is almost always the case that such a movement already exists and needs your support. Reach out at local level, try to get to know whatever form of organizing that is being done in your district/city/regions.\n\nAny big movement isn't created by one person or one group of people. They are the result of many years of consistent grassroot organizing, catalysed by certain high profile events. So don't go looking for THE big movement to join. Help build it",
            "score": 3,
            "replies": [
                {
                    "author": "Leading-Professor-43",
                    "body": "Very very well said, I myself have been trying to do food drives and even feeding the homeless when I can and have the ability to, just anything to help whenever and wherever I can",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "entrophy_maker",
            "body": "The Soviets said one thing that led to their success was to put the reformers and the revolutionaries into the same party. There are many Marxist parties that welcome both. Just saying.",
            "score": 3,
            "replies": []
        },
        {
            "author": "fxkatt",
            "body": "Well the 1960s-70s occurred prior to computers. Now everyone is divided and living on targeted fragments. There's no more agreed upon values outside our subjective selves which are fed & manipulated  by Facebook, Google and similar entities--and their social engineering.  We lived back then according to unifying idea, historic knowledge, whole visions, not single issue, which take us all in a million different directions. You could easily disagree in part while still supporting the goals--without anybody ripping you for a few criticisms or for having a different take.",
            "score": 6,
            "replies": []
        },
        {
            "author": "TBpeebs",
            "body": "One word: internet",
            "score": 2,
            "replies": []
        },
        {
            "author": "Harbinger101010",
            "body": "The working class is looking for leadership.  Leadership would organize coalitions to take action as you suggest.    But people are not going to randomly, individually, attempt to address society's needs.  People intuitively know leadership is needed.",
            "score": 2,
            "replies": []
        },
        {
            "author": "book-nerd-2020",
            "body": "Somebody do the Monty Python People's front of judea sketch... \n\nBut seriously - it is about time we had a true global revolution of the workers, united, to unleash the chains around our necks foisted upon us by neoliberal capitalism.",
            "score": 2,
            "replies": []
        },
        {
            "author": "The_Jousting_Duck",
            "body": "Anyone with the organization to actually oppose the government is terrified of invoking the ire of the government and being smothered by riot police and intelligence agencies. They need to be the ones on the defensive to actually organize something like that. Which leaves the government free to divide and conquer.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Soft_Jackfruit_3240",
            "body": "Funny you mention the civil rights era, there 2 prominent figures at the time, Dr. Martin Luther king Jr, and Malcom X. One was a pacifist, the other not so much. Can you tell me which one was murdered by the Feds ?",
            "score": 2,
            "replies": [
                {
                    "author": "Leading-Professor-43",
                    "body": "Well 2 things, both were indeed murdered by feds, it is a misconception that MLK was a pacifist. Yes he believed in non violence but ultimately believed that you do need violence to get some things done, eventually he even started to share a lot of Malcom X’s views later in life",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Soft_Jackfruit_3240",
                            "body": "I was under the impression that Malcom X was murder by the guys from brothers of islam cult.\nI think violence as a tool for resistance is sometimes justified, must the state hold the monopoly on violence even when the state abuses it ? To quote 2pac \"....I'm getting hotter cause the world is getting colder\"",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Material-Pool1561",
            "body": "I will keep saying this until it gets through people’s heads. If he’s following Hitler’s playbook, we also know how that playbook ended.👀 Do you understand what I’m saying?👀 And when the powers that be break the social contract, we, the people, are no longer beholden to the standard of conduct within it. Are you getting it?👀 We all know there’s only one way to stop an authoritarian dictator. That’s a big part of the tension. We’re not in the 1920s, ‘30s, ‘40s, or ‘50s anymore. We know what it takes. We just need to be on the same page to do it. And Black, POC, LGBTQ+, and other marginalized groups can’t always be the ones to throw the first stone. Caucasian people talk big game yet do NOTHING to spark revolution without being personally affected. We’re past protests. The issue is the loudest people crying about a “civil war” we’re never actually going to be the ones to do it. It was always going to be anarchy. And until their way of life is disturbed so much they can’t ignore it or blame someone else, they’ll do nothing. THAT has always been Caucasian Americans’ problem. And why this country is in the state it’s in.",
            "score": 2,
            "replies": []
        },
        {
            "author": "StarStabbedMoon",
            "body": "Unity will happen when there is a vanguard worthy of it. You need something to unify around first.\n\n\"I began revolution with 82 men. If I had to do it again, I do it with 10 or 15 and absolute faith. It does not matter how small you are if you have faith and plan of action.\"\n-Fidel Castro",
            "score": 1,
            "replies": []
        },
        {
            "author": "0xUltraBased",
            "body": "Why do these groups need to come together to make this happen? All it takes is one and the others will follow the success. Be the first.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Candy_Says1964",
            "body": "(Reposting with the edits suggested by the auto-mods)\n\nI’ve been pleased that there’s been serious portrayals of the Black Panthers and other activists from the 60’s available recently, but having lived through that era as a kid, studied and having had the opportunity to meet and work with some of them there was something eating me about these portrayals and I finally figured it out: although there’s Che posters and stuff in the background, every one of them completely ignores the global Revolutionary movements that were happening that the activists were emulating. They jump from the Civil Rights movement to the late 60’s and leave out the global context which makes it seem like they were simply responding to American problems. They leave out the part where hundreds of US activists were illegally traveling to Cuba to meet with Castro and to Hanoi to meet Ho Chi Minh’ and that the discipline that the Panthers, Weathermen, and others were attempting to emulate in their collectives were inspired by. By eliminating that part of the stories and scrubbing and sanitizing our history they have robbed us of our ability to organize and feel solidarity with other oppressed people and movements.\n\nAmericans have always largely stood by when other Americans are being attacked by Americans. We’ve always been divisible by nonsense like racism and religion, and we’ve never gotten over having had a king after the Revolutionary War and have harbored this weird obsession with the “lifestyles of the rich and famous” ever since. Disney has built its empire on “princess envy.” We’ll pick the factory owners over the workers and unions, the cops over the oppressed, and turn our backs on whoever the immigrants du jour happen to be, even if they’re Native Americans. We’ve been collectively numbed by being buried under mountains of meaningless and worthless consumer BS that we’ve bought on credit and have settled for “feeling rich” instead of demanding what we’re worth and standing up for our collective wellbeing.\n\nUnfortunately, I think people in America are going to have to be really hurting before they take to the streets, organize, and even revolt, and risk being hurt, but by then we’ll probably have already been divided to the point of futility. The scrubbing of our recent history of the global revolutionary movements as the FBI, CIA and others were destroying the Panthers and democratically elected governments throughout Central and South America has deprived us of a sense of unity with other oppressed people around the world and destroyed our ability to effectively organize… because we don't know how, or when we do, they usually stop us by pumping cash, cocaine, and sex into any burgeoning movement and commodifying its message, personalities, art, etc. Third parties get funded and conned into running presidential candidates rather than building movements.\n\nI believe that we can still effectively boycott, organize, and build an effective movement against these fascists because they're greedy and incompetent, but Americans have been under the spell of the greatest propaganda coup in history where we believe that we’re the center of the universe, the defenders of democracy and whatever, while most of the rest of the world knows us as a sponsor of global right wing terrorism, fueled by elaborate weapons for drugs schemes. It’s going to take a lot of shock and shaking to wake people up I’m afraid, especially when so many of us have been conned by the Democrats for so long into just voting for them because they’re not Republicans, and otherwise associating movements with personalities.",
            "score": 1,
            "replies": []
        },
        {
            "author": "raicopk",
            "body": ">Is there anything that we can do?\n\nRecognizing that there is intelligent life outside the United Settler States would be a good start. From here, you can learn about other experiences which will, at the same time, inform your own reality.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CHiZZoPs1",
            "body": "I feel like the left has been split into little identity politics niches, all with their own pet issue, rather than emphasizing the solidarity of like a Fred Hampton. There's a reason Hampton and Malcom X were assassinated. They were on to something that truly threatened the establishment.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ghostradamus",
            "body": "Because it's been co-opted. The BLM movement has everyone telling white people that they have no right to speak or act in solidarity with the goals",
            "score": 0,
            "replies": []
        },
        {
            "author": "warren_stupidity",
            "body": "Most of the 'movement era behavior' of the 60's (and early 70's) were peaceful protests. We can and should be doing that as much as possible, even if it seems pointless for various reasons (ignored by media, no immediate effect, etc.) and it is a way for people to get together, organize, form communities of shared values.",
            "score": 0,
            "replies": []
        }
    ]
}