{
    "title": "Autonomy plan of Morocco for western sahara",
    "author": "GreenEmployee9756",
    "subreddit": "socialism",
    "rank": 292,
    "score": 1,
    "upvote_ratio": 0.6,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.reddit.com/r/socialism/comments/1ir5nod/autonomy_plan_of_morocco_for_western_sahara/",
    "id": "1ir5nod",
    "selftext": "I am moroccan and always wondered why socialist supported the western sahara and what was your view on the autonomy plan proposed by Morocco?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This is a space for socialists to discuss current events in our world from anti-capitalist perspective(s), and a certain knowledge of socialism is expected from participants. **This is not a space for non-socialists.** Please be mindful [of our rules](https://reddit.com/r/socialism/about/rules) before participating, which include:\n\n- **No Bigotry**, including racism, sexism, homophobia, transphobia, ableism...\n\n- **No Reactionaries**, including all kind of right-wingers.\n\n- **No Liberalism**, including social democracy, lesser evilism...\n\n- **No Sectarianism**. There is plenty of room for discussion, but not for baseless attacks.\n\nPlease help us keep the subreddit helpful by reporting content that break r/Socialism's rules.\n\n______________________\n\n&#128172; Wish to chat elsewhere? Join us in discord: https://discord.gg/QPJPzNhuRE\n    \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/socialism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "DefiantPhotograph808",
            "body": "The occupation of Western Sahara has caused hundreds of thousands of Saharawi to become refugees in Algeria and Mauritania. Saharawis are disenfranchised, stripped of their right to self determination and maraganilised by settlers from Morocco, and their movements are strictly controlled by occupation authorities; there is no pan-Arab integration but the subjugation of a nation. It's not a dissimilar situation to Palestine",
            "score": 6,
            "replies": []
        },
        {
            "author": "NiceDot4794",
            "body": "I’d recommend this article https://jacobin.com/2023/11/kissinger-in-western-sahara\n\nMoroccan control over West Sahara was something secured by the notorious war criminal Henry Kissinger and comes at the expense of their self determination. Further Morocco has long been an ally of US imperialism and currently is one of the only Arab countries that recognizes Israel (in exchange for Israel’s support for their claim of Western Sahara). \n\nSocialists generally champion self determination, internationalism and anti colonialism. Which is why most socialists support not just Western Sahara, Irish republicanism, Indigenous movements in North and South America, Palestinian resistance/anti Zionism etc.\n\nSince you are Moroccan have you heard of Mehdi Ben Barka? Hes probably the most famous Moroccan socialist internationally. He was a great example of a principled socialist and internationalist, and he got in trouble with the government for refusing to side with his government when they went to war with Algeria in the 60s.",
            "score": 2,
            "replies": [
                {
                    "author": "GreenEmployee9756",
                    "body": "Yeah I know a little about him . what do you think about the autonomy plan proposed by the moroccan government?",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}