{
    "title": "International Studies Degree - this is Ukraine summed up, sorry in an advance.",
    "author": "OfPawnsNpaladins",
    "subreddit": "socialism",
    "rank": 90,
    "score": 1,
    "upvote_ratio": 0.51,
    "num_comments (reported by reddit)": 9,
    "url": "https://www.reddit.com/r/socialism/comments/1j0rhn1/international_studies_degree_this_is_ukraine/",
    "id": "1j0rhn1",
    "selftext": "I expect flack for this, because in my experience... There's a lot of \"Internet experts\" and \"Socialists\" on here... Additionally, it seems like not very many people here know anything about International Studies.\n\n I'm not really sure I want to open up this can of worms with you people. I'm going to try to do it simplified, and bite sized.\n\nBut here it goes-\n\n\n***Ukraine***\n\nThe ***United States created this conflict***. It was intentional. That doesn't mean that Putin isn't responsible for Russian war crimes, he is. That doesn't mean there aren't elements in Russia that want to take over Ukraine, there are. However the United States created this situation, and they did it with a reason.\n\nRemember ***NATO*** was created as a counter to the USSR, and that is true, but it also was built to function as kind of the American foreign legion. A military alliance, that is almost entirely controlled (via administration or supply) by the United States, is essentially a foreign legion. After the true end of the ***Cold War***; the ***collapse*** of the ***USSR***....\n\n***Nato expanded***\n\nWhy? After all, the threat was no longer there... So why? Because it wasn't just about the USSR, it was an ***expansion of American military dominance***. \n\nWhy didn't the United States try to wrap its economy around the Russian economy? This would have stabilized the Russian economy. But an ***enemy*** is easier to ***justify*** a highly ***militarized global presence***, and still useful at keeping the rest of the neoliberal empire in check. It also helps create a ***divided playing field***. Thus ***Russia*** and ***China*** sometimes have differing goals and approaches, because of course they do.\n\nSo consequently, Russia is in economic instability and societal disarray back in the ***90s*** and America is expanding its military alliance borders closer and closer... So you have inside a rise of economic instability gave way to massive poverty, destruction of social programs, organized crime, violence. And on the outside the old enemy continues show its fangs. \n\n*** Rise of the Strongman*** - Putin\n\n***Putin keeps order*** . Like a large vicious herd protection dog, he is bad, but he's better than the wolf. Russian mafia fears him, oligarchs fear him, political opposition well... Well they die. When things get bad, people elect strongmen, or would be Strong men.\n\nAmerica actually did something similar, ***Trump***. The rise of the ***US populist movement***, Trump didn't create the movement, he rode that wave. It doesn't just stem from homophobia and bigotry. It stems from incredible economic instability. And in typical fashion, there are scapegoats (minorities). That's how the American caste system works.\n\nBut remember, Trump isn't the root of all evil. That doesn't mean he's not bad, he's just not ALL EVIL, but is evil.\n\n So this ***gives the establishment an opportunity*** ; the ***Biden*** administration.***Keep out Sanders***, he might be a pseudo socialist, but it's more than the wealthy are willing to give up. But ***also check off some boxes*** in foreign policy.  Such as ***Strengthen NATO***, grow and strengthen ***Israel***. Any harm done, that's ***Biden's fault*** he's ***an old man*** . The Democrats can claim to be different later- \"Besides, what about Trump?!? Not as bad as Trump\". \n\n***Ukraine*** is brought into ***NATO*** , or is going to be. Trump is right (occasionally happens) that that has long been a No-No. ***Ukraine joining is taboo*** . The guard dog (Putin) ***must to react***, that's his job. ***Also Ukraine wouldn't be a bad prize***, and a ***warm water port would be better*** . So reaction must happen, and there are prizes to be won too. \n\n***Do I think*** that the US also thought that it could weaken the Russian economy more than it did? Yes I do. However the Global South didn't buy it. They didn't like it, but they saw America's hand in it also. Just another proxy war. But it frightened Europe, and they're all more than committed to NATO. So it was still a win for the US's foreign policy. \n\n\n***Trump comes back*** , more aggressive than ever. After all, Biden continued on a lot of policies like mass deportation, Biden actually deported more people. So Trump has to be rough and tough, tougher than ever. Besides, nothing to lose now. And lots of opportunity. \n\n ***Trump understands Putin*** , they're both would be ***strongmen***, and they both work from the ***realist perspective*** (the technical term not that thing in-between optimist and pessimist). So Trump doesn't play neoliberalism in ***foreign policy*** as much as he likes to play realism.  So ***neoliberal empire*** , is less important than ***true empire*** to him. You've heard about Canada, Greenland, Panama, US's new portion of Palestine. Don't be surprised if you hear about New Zealand before too long or Haiti. Some of that will come into fruition, some will not. Also they really don't have to be States.\n\n***Ukraine*** ***will negotiate*** peace, it ***will accept*** peace. It would have always played out that way, but probably behind closed doors in neoliberalism. And everybody would have felt good, except Ukraine. Oh there would have been slightly different breaks of things, and Russia probably wouldn't have been quite as happy. But remember, The ***US needs an enemy*** to justify its militarism. \n\n***Trump has an enemy***, some internal and some external. China on the outside, leftist and Democratic establishment both of the inside. Either way, *** Ukraine will comply***.\n\n***There's other stuff to do now***\n\n",
    "comments": [
        {
            "author": "CoupDeGrassi",
            "body": "You're not saying anything new here, which, as others have pointed out, makes your preface unnecessary.",
            "score": 11,
            "replies": []
        },
        {
            "author": "LeftyInTraining",
            "body": "Just as an honest critique, you could have left the first two paragraphs out. Patronizing your audience is a great way for them not to read any further. It doesn't help that your analysis is something socialists, both degreed and laymen, have been saying for a while, which makes your opening patronizing seem unwarranted.",
            "score": 42,
            "replies": []
        },
        {
            "author": "Elegant_Primary_6274",
            "body": "I'm confused by this because Ukraine didn't officially push for NATO membership until the annexation of Crimea in 2014. Afer this Yatsenyuk then pushed for NATO membership, the US didn't really push for it. Before Yatsenyuk the country didn't really hold it as a priority and kept flip flopping between being neutral and creating a MAP. Bush and Obama were neither here nor there. \n\nSo surely it was Russia annexing Crimea and creating an expansion threat to Ukraine that prompted them to want to join NATO? That's got nothing to do with a potential strategic planing on the USA behalf? It's more to do with Russia wanting Ukraine and Ukraine wanting to be more westernised? Like, the catalyst for all of this is Russia's aggression",
            "score": 6,
            "replies": []
        },
        {
            "author": "Davtorious",
            "body": "This has all been said here many times, more concisely, without the \"you people\" or all the italics. We know it was provoked by the US. It's called geopolitics in your context, \"international studies\" is what the major is sometimes called, which kinda belies your sophomoric takes.\n\nHaiti is the only one of those that you mentioned that has a nonzero chance of becoming part of the empire. Greenland, Canada, Palestine, New Zealand absolutely no chance. Panama could fall more under US influence but not to the degree that anyone would consider it part of the empire.\n\nEdit: unclear if you're saying Ukraine joining NATO was the goal or if you think that's still going to happen. It won't happen.",
            "score": 9,
            "replies": [
                {
                    "author": "ctlattube",
                    "body": "Always amusing to see International Relations graduates “doing geopolitics” by regurgitating common talking points as hot takes and deep academic analysis.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "OfPawnsNpaladins",
                            "body": "Haha no ... I'm telling you what... It's like an electrician describing a circuit... I don't need another's opinion",
                            "score": -9,
                            "replies": [
                                {
                                    "author": "GrapefruitNo5918",
                                    "body": "An electrician has a skill. You have read the same stuff all the rest of us have, but you have a piece of paper that's making you act like a prick",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "PFGuildMaster",
            "body": "First off, the way you italicize and bold words in the post is extremely distracting.\n\nSecond, yes NATO is an extension of US hegemony and a tool to keep the global order in check however you are making some egregious errors in your post.\n\nPutin is hardly a big mean dog or whatever the analogy you used was. The only difference between Russia and the US is that the US is stronger and can force its will on more countries at the moment (not for lack of trying by Putin) and that the US (half the time at least) at least pays lip service to things like LGBTQ+ rights while Russia doesn't.\n\nYour prediction about getting flak for this is likely right. It isn't because we're magically all fake socialists though, it's because your opinion on this is half-baked.",
            "score": 13,
            "replies": [
                {
                    "author": "OfPawnsNpaladins",
                    "body": "No, it's pretty commonly viewed as the norm in international study circles... Those people just don't make it to TV",
                    "score": 0,
                    "replies": []
                }
            ]
        }
    ]
}