{
    "title": "I wonder... What build can go with this look?",
    "author": "Utylos",
    "subreddit": "BG3Builds",
    "rank": 17,
    "score": 111,
    "upvote_ratio": 0.9,
    "num_comments (reported by reddit)": 92,
    "url": "https://i.redd.it/m0zme1dc3cpe1.png",
    "id": "1jdr205",
    "selftext": "Feel like there is something that could go hard with this look, but I'm so stuck.\n\nIt probably doesn't need to be the best build, any ideas is welcome.",
    "comments": [
        {
            "author": "The_Trevbone",
            "body": "Looks like an eldritch knight to me",
            "score": 102,
            "replies": [
                {
                    "author": "Utylos",
                    "body": "Oh, that could work!\nMaybe an eldritch knight combined with abjuration perhaps",
                    "score": 21,
                    "replies": [
                        {
                            "author": "DernieZanders",
                            "body": "The first thing I thought of was a Mystic Knight from Dragon's Dogma, which fits that combo perfectly.",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "dances_with_gnomes",
                            "body": "I've played Eldritch Knight 6 + Abjuration Wizard 6. Adding in a force conduit halberd and I'm feeling pretty cozy amidst all the bloodshed.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "JaylynnDay7",
                    "body": "Literally as soon as I saw this I thought EK",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "EndoQuestion1000",
            "body": "Dexterity-based paladin. ",
            "score": 23,
            "replies": [
                {
                    "author": "Utylos",
                    "body": "How about the oath?\n\nI feel like it could be Oathbreaker or Vengeance...",
                    "score": 9,
                    "replies": [
                        {
                            "author": "EndoQuestion1000",
                            "body": "To me the pretty swirly patterns on the armour are giving Ancients. I can definitely see Vengeance too though with the dark lipstick and down-to-business visor. She looks like she has shiny silver celestial magic on her side (maybe she has a connection to selune?), but also she could f you up with no remorse. ",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "DeltaMaple",
                            "body": "Definitely an oathbraker vibe!\n\nIf you are into mods some of them make it a starter class, alternatively you coul just do the classic \"oathbreaker speedrun\"\n\nHonestly vengeance would be good too. I like the spell selection better so i'd probably go with that.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sapowski_Casts_Quen",
            "body": "Be-HOLD, DARKCHILD- woops, wrong game",
            "score": 17,
            "replies": [
                {
                    "author": "cel3r1ty",
                    "body": "ok but how would you actually build magik",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Sapowski_Casts_Quen",
                            "body": "I dunno, but I want to do it now",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "cel3r1ty",
                                    "body": "first thing that comes to mind for a high mobility gish is 6 vengeance paladin/6 storm sorcerer, the ol' reliable",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Pm_pussypicspls__",
                            "body": "Definately 7/5 oathbreaker pally/storm sorc\n\nSpell slots are used for smites and misty step. For\nThe dash you can use that one illithid power. Shadow blade for her weapon (patch 8 spell or patch 7 ring from act 2) if you really wanna use a greatsword, go for baldurans giantslayer.\n\nHelmet of arcane acuity and band of mystic scoundrel can help you swinging and controlling.\nShield spell, hold person are lore accurate. (Haste too but might make the game a bit too easy, up to you)\n\nFor Darkchylde, only thing i can come up with is Slayer form",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Utylos",
                    "body": "Huh... now that is something I could work on.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Sapowski_Casts_Quen",
                            "body": "Haha not sure how, but it could be fun",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Utylos",
                                    "body": "Yeah, it could probably work as a blade warlock and perhaps multiclass it with fighter or paladin.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Sapowski_Casts_Quen",
                                            "body": "Would Warlock let you phase around? I forget if they get misty step\n\nAlso, sorcerer feels very x-men to me",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Utylos",
                                                    "body": "They definitely get misty step as an option.\n\nThough with how warlock slots are limited during combat, I might go with disintegrating night walkers and the amulet of misty step instead.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "3DKlutz",
            "body": "Vengeance Paladin 5/Assassin 3/Swords Bard 4\n\nUse the Phalar Aluve/Larethian's Wrath/The Dancing Breeze+Savage Attacker/GWM\n\nBe a Paladin Assassin with automatic Smite Crits and sneak attack damage.",
            "score": 12,
            "replies": [
                {
                    "author": "Utylos",
                    "body": "By loviatar's bosom, that sounds freaking deadly!\n\nAnd fitting!\n\nSay, what if I switched swords bard for champion fighter? Could that work too?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Abzkaban",
                            "body": "\"By loviatar's bosom\" is the best phrase I have come across today!",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "3DKlutz",
                            "body": "I don't see why not! You'll always have advantage so you'd get extra benefit from the champion.\n\nThe downside is that you'd only get to smite a handful of times. Bard gives you some flourishes, adds quite a few spell slots for Smiting, and gives access to invisibility so you get more guaranteed surprise rounds.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Utylos",
                                    "body": "Invisibility sounds pretty tempting to have for an assassin.\n\nI think I'll stick to yours and experiment.\n\nNice idea for a build right there, man.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "3DKlutz",
                                            "body": "Another benefit of this build is it gives you face of the party AND sleight of hand expertise, freeing up your other three party members to do anything you want.\n\nI came up with this because I wanted to make a build based around two handed finesse weapons since they don't exist in the traditional tabletop. It's going well in honour mode, and it's a ton of fun. 😁",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SnooDoodles4787",
                            "body": "Champion is pretty much fighter without subclass, the 1 crit range is bait. Also vengeance 5 you are missing out on paladins best feature by 1 level. I understand this is some flavour build but its worth pointing out these things atleast as its pretty much just self-sabotaging",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "3DKlutz",
                                    "body": "Yeah I wouldn't go champion, and you're right I didn't go into this build trying to find an optimal power build exactly. The goal was to find a fun build to base around the two handed finesse weapons.\n\nThat being said you make a good point. By missing paladin 6, you are gaining around 8DPR with a feat and losing a massive saving throw boost for the party.\n\nI think for this build I would have more fun with the extra damage, especially since you'll be sneaking off on your own away from the party in an attempt to get a surprise melee attack\n\nEdit: Savage Attacker is actually a lot more than 8DPR. \n\nWith the free crit, that means you're rerolling the damage dice of\n\n2d10+6d8+6d6 on the first hit (with a second level spell slot. You can use a third with this build which would add 2d8)\n\n1d10+2d8+3d6 on the second hit (You get sneak attack back after the surprise round)\n\n1d10+2d8 on the third hit.\n\nThat's rerolling damage dice on 23 dice, even with only smiting with 1st and 2nd level spell slots",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "EndoQuestion1000",
                    "body": "The Paladin 2 / Assassin 4 / SB 6 variation would give you more spell slots (ESL 6 vs ESL 7) and also Flourishes that refresh on Short Rest rather than long. \n\n\nI can see the virtue of your 5/3/4 if you want to play as a Paladin early game and don't want to respec though. ",
                    "score": 2,
                    "replies": [
                        {
                            "author": "3DKlutz",
                            "body": "Yes, I'm trying both variations out, because I thought of that as well. You're probably right that the 2/4/6 will end up being better for the end game.\n\nThe 5/3/4 will perhaps be a better option for sustained fights due to having more access to gaining advantage from Vengeance abilities and Hunter's Mark, but the 2/4/6 will certainly have more burst damage in round one.\n\nI'm going to try both and see which feels the best.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "EndoQuestion1000",
                                    "body": "Ah excellent ",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "humanmanhumanguyman",
            "body": "Ancients Paladin or BM Fighter, with greatswords",
            "score": 8,
            "replies": [
                {
                    "author": "BlueAndYellowTowels",
                    "body": "No way Ancients Paladin. Ancients Paladin is a nature oriented Paladin. IMO they wouldn’t be wearing armor of full metal, literally ripped out of the ground. Especially with a reverence for nature.\n\nEdit: downvote all you want. That armor doesn’t say “reverence for nature” to me. Source: Kahga, Halsin, Jeheira… for example.",
                    "score": -26,
                    "replies": [
                        {
                            "author": "Daetok_Lochannis",
                            "body": "The  Scale Mail of the Ancients is literally steel scale.",
                            "score": 19,
                            "replies": []
                        },
                        {
                            "author": "Budeadly",
                            "body": "Honestly in reading the ancients paladins tenets on their 5E description their ideals are more based on love and life itself than it is nature. More a bard vibe than Druid. Like you’d probably be more likely to find an ancients paladin in a tavern lifting everyone’s spirits with song and laughter than you’d find them in nature praying (though they wouldn’t be against that either)",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Reasonable_Quit_9432",
                                    "body": "\"sometimes called green knights or Fey knights\"\n\n\"Old as the race of elves and rituals of the druids\"\n\n\"They adorn their armor and clothing with images of growing things-leaves, antlers, and flowers\"\n\nThey get ensnaring strike and speak with animals, moonbeam, plant growth. These are all druid/ranger spells.\n\nOne of their channel divinities is called \"nature's wrath\"\n\nYou no longer age at 15th level (a feature traditionally associated with druids)\n\n\"At 20th level, you can assume the form of an ancient force of nature, taking on an appearance you choose. For example, your skin might turn green or take on a bark-like texture, your hair might become leafy or moss-like, or you might sprout antlers or a lion-like mane.\"\n\nIt is pretty clearly meant to be the nature paladin subclass. That said, they are still allowed to wear metal and while they typically would adorn it with nature imagery, it could theoretically be plain metal. But I don't see any reason why this armor would be ancients paladin over other paladin subclasses (or heavy armor wielders in general).",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Budeadly",
                                            "body": "You’re definitely not wrong, it’s kinda both things. The idea is that the ideals of the tenets are as old as Druidism so they manifest as nature flavored abilities. But the tenets themselves are about being “good” above law and everything else. Personally I just think the class identity is in some kinda weird limbo between two ideas",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "BlueAndYellowTowels",
                                    "body": "For me, this is a no-brainer and everyone downvoting is wrong.\n\nThe emblem of the subclass itself has crawling roots, want to guess the two other classes with plants? Druid and Nature Cleric. Level 3, Nature’s Wrath spell.  Level 5 Speak with Animals and Ensnaring Strike. Level 9… Plant Growth. \n\nI respectfully disagree.",
                                    "score": -3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "SapphicRaccoonWitch",
                            "body": "They're not druids",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "BlueAndYellowTowels",
                                    "body": "I don’t recall saying an Oath of the Ancients Paladin is a Druid.",
                                    "score": -8,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "scrappyHDD",
            "body": "could you list the armor pieces please?",
            "score": 4,
            "replies": [
                {
                    "author": "Utylos",
                    "body": "Sure, here is the list.\n\nAdjustable steel helm\n\nArmour of agility \n\nCloak of displacement \n\nLegacy of the masters \n\nBoots of persistence",
                    "score": 11,
                    "replies": [
                        {
                            "author": "cassavacakes",
                            "body": "what dye did you use?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Utylos",
                                    "body": "Harlequin black and white",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Yomigami",
                    "body": "The armor looks like the Armor of Agility and the gloves look like Legacy of the Masters. I would assume the boots are the Boots of Persistence but I could be mistaken. I don’t recall the name of the helm, unfortunately.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "OneUsernameReddit",
            "body": "Sneak archer… oh wait wrong game",
            "score": 7,
            "replies": [
                {
                    "author": "The_Yukki",
                    "body": "Or its it? *vsauce theme plays*",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "AutomaticGreeter",
            "body": "Hexblade, or Oath of the Vengeance paladin that goes oathbreaking at some point in the game, with a little bit of Shadow Magic sorcerer mixed in? Her look gives off a bit of a shadowy feeling.",
            "score": 3,
            "replies": []
        },
        {
            "author": "underground_complex",
            "body": "Darkness abusing devil sight bladelock with a champ fighter dip for heavy armor and crit fishing",
            "score": 3,
            "replies": []
        },
        {
            "author": "SapphicRaccoonWitch",
            "body": "Any melee fighter or paladin. Could also be a cleric, or a ranger knight perhaps.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Miigwetch",
            "body": "Paladin 😤",
            "score": 2,
            "replies": []
        },
        {
            "author": "crash1bp",
            "body": "That is 100% a Cleric/Paladin. \n\nDriven by her oath and he deity. Why do you need to see when you’re guided by faith?",
            "score": 2,
            "replies": [
                {
                    "author": "Utylos",
                    "body": "That's interesting! Could this work where I pick paladin for some buffs and smites and then get cleric to use its spells and benefits from their domains?\n\nI would assume that I would dump the charisma and bump up the strength/dex and wisdom?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "crash1bp",
                            "body": "You don’t need any CHA as a Paladin unless you’re going like 6+ levels in. Really what this MC would need is DEX or STR (depending on the weapon(s), WIS, and CON. If you use the Gloves of Dexterity, then dump DEX and go STR. \n\nCleric is a full caster, so the more levels in Cleric give you:\n1) More spell slots for either spells or smites\n2) More spells overall\n\nYou only need to levels in Paladin to get the best smites (divine), and if you’re going for a radiating orb build, a 10 Light Cleric/2 Paladin will absolutely shred. Plus, 10 levels of Cleric gets you that sweet mace.\n\nEdit: Also, if you do this, definitely go Paladin first 2 levels, then Cleric the rest of the way. You’ll get smites early on, plus all of the proficiencies you want for armour and weapons. And by going Cleric as the last class you add, you’ll be able to use WIS as your spell casting stat for items.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "binneysaurass",
            "body": "Hear me out..\n\n2 Paladin for heavy armor proficiency and smites. \n7 GOO Warlock Pact of the Blade and \n3 Bard, swords.",
            "score": 2,
            "replies": [
                {
                    "author": "crash1bp",
                    "body": "Why the 7 is GOO?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "binneysaurass",
                            "body": "Great Old One (GOO)  for Mortal reminder... level 4 warlock spell slots that refresh on a short rest.\nSmites can only be used with level 4 slots and below.\n\nThen, with Bard to level 3, you get Song of Rest at level 2, which gives you an extra short rest and flourishes at level 3.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "crash1bp",
                                    "body": "Might as well just go 10 Sword Bard/2 Paladin then, no?\n\nYou’ll get more smites, more higher level spell slots (if you want them for casting), a 2nd feat, and your Bardic Inspiration charges will reset on short rests. Also, Magical Secrets. \n\nJust my opinion, but I’d rather do that than go 7 in GOO.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "binneysaurass",
                                            "body": "I like the Pact of the Blade to minimize my attribute distribution.\n\nI don't like strength elixirs.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "crash1bp",
                                                    "body": "True, I don’t either lol I’m in the middle of a DEX playthrough for my Bardadin right now, only at level 5. But I’m liking Phalar Aluve. First time using it, it’s pretty useful right now.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "binneysaurass",
                                                            "body": "Phalar Aluve can last the whole game. \n\nFor a weapon found in Act 1, that's pretty good.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "NachoDimension1",
            "body": "This look is amazing. Would love to see how you went about making it!",
            "score": 2,
            "replies": []
        },
        {
            "author": "howardantony",
            "body": "Looks like a Grey Warden from Dragon Age. Fighter + Rogue dual wielder for me.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Max_Gix",
            "body": "The White Hawk, Griffith. Paladin for sure.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Certain_Yam9914",
            "body": "With a look like that I would do battlemaster fighter 6/sword bard 6. Or, if you are in honor mode, Fighter 8 and sword bard 4.\n\nFor fighting styles: Armored (From fighter) and Dueling (Sword Bard)\n\nSpells: mostly utility based or self buffs. If you do bard lv5+ then pick glyph of warding for sure. \n\nStats: defenitely Dex for main, maybe 12 points of strength and at least 14 charisma. \n\nFeats: any really as long as you keep a focus on dueling. So ability improvement, savage attacker, the one that gives more battlemaster maneouvers, etc. \n\nFor abilities, I would go with tracking stuff (survival, investigation, nature) and/or Intimidation, Insight, Athletics and Persuasion. Character seems like the silent only speak when necessary and only what needs to be said type of character based on looks alone, of course, with RP you could easily do an extremely shy person that uses the armor to get confidence when talking to people xD\n\nAlternatively, you could do a fraud like character. If you ever saw the anime Eminence in Shadow, there is a secondary character there that uses gold armor and is full of himself, thing is, while it is true that character is undefeated...he only fought people weaker than him. Guy was quite charismatic and convincing in that ge knew what he was dping tho. Take this into the game and restrict yourself to only fight people of lower level than you and when you can't, have your character make mistakes in combat or run in panic trying to escape xD",
            "score": 2,
            "replies": []
        },
        {
            "author": "BlueAndYellowTowels",
            "body": "Eldritch Knight or Battlemaster.\n\nThat’s it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jecloer14",
            "body": "Ashen one",
            "score": 1,
            "replies": []
        },
        {
            "author": "Constant_Original_81",
            "body": "Duelist battle master fighter",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ahego48",
            "body": "Eldritch Knight, War Cleric of Seluna or Oath of the Crown paladin once it's released.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AsiaLounges",
            "body": "Bardlock ?",
            "score": 1,
            "replies": []
        },
        {
            "author": "claireDayspring",
            "body": "5 levels in ranger (hunter), the rest in war cleric? the outfit screams tyr/helm cleric to me idk",
            "score": 1,
            "replies": []
        },
        {
            "author": "Epsilocion",
            "body": "Looks like someone who would use a longsword with no shield.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cassavacakes",
            "body": "hear me out. use a greataxe and be a barbarian. I'm assuming you're using transmog mod? you can transmog weapons too. just reload your game so the animations get transmogged too.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Reasonable_Quit_9432",
            "body": "It's a shiny and polished piece of armor. I would picture a veteran soldier in more dirty, dented armor. So if this were a heavy armor fighter, it would be one who mostly trained in safe environments rather than the fevered pitch of battle. Maybe the heiress to a noble family.\n\nBut I also would picture a paladin as a \"knight in shining armor\". One whose holy oath and radiant aura keeps their equipment shining as brightly as their soul.\n\nAn eldritch knight or wizard/fighter multiclass could keep their armor clean and polished with prestidigitation.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ArtoriusRex86",
            "body": "Looks like a Hellknight Signifier... which is from another universe, so I'm going to go with like... Tempest Cleric.\n\n[https://cdnb.artstation.com/p/assets/images/images/023/097/903/large/maichol-quinto-hellknight-signifer-def.jpg?1578073936](https://cdnb.artstation.com/p/assets/images/images/023/097/903/large/maichol-quinto-hellknight-signifer-def.jpg?1578073936)",
            "score": 1,
            "replies": []
        },
        {
            "author": "MichaelWolfgang55",
            "body": "8 Oathbreaker / 4 POTB Goolock\n\nUse the weapon Dancing Breeze and go GWM\n\n\n\nWay less than ideal but feels fitting. If you want to be more meta and aren’t playing honor, go 7 ob / 5 fiendlock amd use unseen menace and abuse strength pots.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MossyPyrite",
            "body": "Looks like fantasy Robocop to me, so maybe Oath of the Crown if you’re on the play test?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Blazebeard23",
            "body": "She reminds me of Eldrith the Betrayer, final boss of Baldur's Gate Dark Alliance for Ps2",
            "score": 1,
            "replies": []
        },
        {
            "author": "elaria112",
            "body": "War cleric maybe?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Feisty_Steak_8398",
            "body": "Paladin sworn to Shar (can't pick that unfortunately but role play it?) Oath of vengeance.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Real_Rush_4538",
            "body": "DEX Fighter for sure. The Duelist's Prerogative works extremely well with the Sentinel feat and Extra Extra Attack.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lazywhiteboyy",
            "body": "Silver dragon sorcadin",
            "score": 1,
            "replies": []
        },
        {
            "author": "_LettuceClub_",
            "body": "What are these armour pieces called?",
            "score": 1,
            "replies": []
        },
        {
            "author": "pinkaces39",
            "body": "That's a straight up druid right there",
            "score": 1,
            "replies": []
        },
        {
            "author": "coryvogelgesang",
            "body": "If you have patch 8 my first thought was the Paladin Oath of the Crown.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zerabbiitt",
            "body": "Wizard or rogue would be my guess",
            "score": 1,
            "replies": []
        },
        {
            "author": "StupendousMalice",
            "body": "Gonna need scratch with some kind of special harness to lead you into battle.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LexaproAddict",
            "body": "Idk about the helmet but the rest of the armour would go well on a Paladin of Selune",
            "score": 1,
            "replies": []
        },
        {
            "author": "avasapolli",
            "body": "I mean with the rapier it does scream smite swords bard",
            "score": 1,
            "replies": []
        },
        {
            "author": "theawesomescott",
            "body": "I feel this character would unsheathe their sword(s) in a very slow, deliberate manner without saying a single word, but smirking just enough you know that you're in for a bad time",
            "score": 1,
            "replies": []
        },
        {
            "author": "Which_Lawfulness5441",
            "body": "Paladin, honestly. Or a fighter. Cleric maybe",
            "score": 1,
            "replies": []
        },
        {
            "author": "sentient_cumstain",
            "body": "Im going to build a swords bard and im going to use pretty much that exact gear (minus the helm)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Seu_Valdo",
            "body": "Dominatrix",
            "score": 1,
            "replies": []
        }
    ]
}