{
    "title": "4/4/4 Rogue Sorlock",
    "author": "BlackCoatedMan",
    "subreddit": "BG3Builds",
    "rank": 19,
    "score": 8,
    "upvote_ratio": 0.6,
    "num_comments (reported by reddit)": 42,
    "url": "https://www.reddit.com/gallery/1je3ayg",
    "id": "1je3ayg",
    "selftext": "This is what my one and only Completed Run of BG3 ended up with.\n\nUnfortunately, that was Honor mode, so I can't reload and have fun. Should probably have thought of that before spending 145 hours doing everything I could.\n\nSo now I'm doing a custom run. Which is basically honor mode with multiple saves. So I can have fun with all the end game bosses. Ansur, Raphael, Cazador, and The Netherbrain.\n\nBut I want to be stronger. So I want some feedback on what I reached.\n\nLEVELS AND FEATS\n\nLevel 4 Draconic Sorcerer;\nTook the Alert feat. Nothing much of note here. This is only here for sorcery points, quicken spell and Con Save proficiency.\n\nLevel 4 Thief Rogue;\nTook the +2 Charisma. I'm wasting Sneak attack, but the extra bonus action, is cracked. Even better than the Action Surge of Fighter.\n\nLevel 4 Great Old One Warlock.\nTook Spell Sniper. Mortal Reminder, Eldritch Blast, Agonizing Blast, Repelling Blast.\n\n\nEQUIPMENT\n\nBirthright - I feel like I made a mistake here. While this with the robe is very fashionable, you can reach 24 Charisma with 16 on Character Creation, +4 from ASI, +1 from Aunti Ethel, +3 from Mirror of Loss. Which leaves a spot for Helm of Grit for a 3rd bonus action. Just stock up on Potions of Angelic Slumber. Though I'm not sure if playing with 50% health is Viable.\n\nCloak of Displacement - With 18 AC, it almost feels like this is Mandatory. One of my few defensive items. \n\nPotent Robe - Something tells me this is BiS.\n\nCraterflesh Gloves - With a crit on 16-20 and advantage, I feel this is also BiS.\n\nHelldusk boots - I believe prone immunity is King. Prone makes ME lose a turn and drop concentration. Though my enemies feel like they just get up and do their turn anyway. But if there are better boots, please explain them to me.\n\nAmulet of Greater Health - Needed for the ring I use. Otherwise its impossible to concentrate on any spell. And it allows me to dump Con on Respec.\n\nRisky Ring - I believe this is BiS unless there is another way to consistently get advantage. If there is another equipment, please tell me.\n\nRing of Protection - I had 3 other party members, otherwise the callous glow ring would be here, instead of on MM Gale. Other than the Glow ring, any other good rings for this build?\n\nBloodthirst - for some reason you get 2 of this. This is for the crit. Could be replaced with Knife of the Undermountain King. Same crit effect, but looks cooler.\n\nRhapshody - The +3 to hit and damage puts it above spellsparkler imo. And I don't need the Feat to dual wield non-light weapons.\n\nThe Deadshot - Another Crit Reduction.\n\nElixir of Viciousness - I believe this is the best elixir due to bloodthirst not working with Illithid powers. Heroism conflicts the bless you get from the 5000gp statue. With a +14 to hit, Elixir of Battlemages Power seems to be diminishing returns. \n\n\nSPELLS: CONCENTRATION\n\nHex - my experience is that it feels like a waste. I keep having to transfer it in with my bonus actions. It never lasts more than a turn. Either the enemy is too weak and dies in one turn anyway, or is immune/resistant to necrotic damage. \n\nHaste - Replicated by a potion that can be thrown by a summon. Devestating if lost concentration, like with Netherbrain's Mindbroken. There's also the buggy Mind Sanctuary. Also with my current level split, I don't get 3rd level spell slots.\n\nDarkness - I'm stuck in one area. Would have to replace my repelling blast invocation, or use the ring that makes you immune to blind.\n\nBlur - I could get a different Cloak if I chose this to concentrate on.\n\n------------\n\nDo you have any thoughts to improving this build? Change in class levels taken? Subclasses? Feats? Equipment? Spells? Help would be greatly appreciated!\n",
    "comments": [
        {
            "author": "Daetok_Lochannis",
            "body": "I'm a little confused, what are the extra bonus actions for with this build? I see what you did but I'm not altogether sure why you did it.",
            "score": 11,
            "replies": [
                {
                    "author": "VoteNextTime",
                    "body": "For quickened eldritch blast, I’d assume",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Daetok_Lochannis",
                            "body": "But even if they used all of their spell slots for sorcery points they'd only be able to do that four times per battle and they'd have to long rest after every single encounter. Seems like a really big investment for the payoff.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "VoteNextTime",
                                    "body": "I agree with you there, peep my other comment on this post",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "Supply-Slut",
                                    "body": "If you need the feats you do this.\n\nBut it would be better to go 2/6/4 (lock/sorc/thief), or even 3/5/4. You only need 2 levels of lock for eldritch blast.\n\nBut with 4/4/4 you can still use your warlock spells to add sorcery points.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "BlackCoatedMan",
                                            "body": "The problem with  2/6/4 is that it locks me out of a feat. To unlock my head slot for something other than birthright i need 2 ASIs. \n\nStarting with 16 Cha. +4 from ASI. +1 from Auntie Ethel. +3 from mirror of loss. That leads to 24 Cha.\n\nThe Last feat is for spell sniper. What do I get out of 2 more sorc levels that's worth a crit threshold and tome pact?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "VoteNextTime",
                                                    "body": "You get your level 6 subclass feature, level 3 sorcerer spells (which are amazing), more spell slots and more importantly, sorcery points. Spell sniper is great for a blaster caster but not a deal breaker. Angelic reprieve pots are a good workaround but if you have two bonus actions, you’ll want to weaponize both for EB which costs a lot of sorcery points and you’re likely to run out very quickly, meaning you’ll have to blow a bonus actions just to convert spell slots into more sorcery points. It’s all about action economy!",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "BlackCoatedMan",
                                                            "body": "Level 6 for Draconic Sorc is... Not good as an Eldritch Blaster. The level 1, 13+dex AC is nice. The level 6 Elemental Affinity is useless. Are the other two subclasses' level 6 better for EB? \n\nFor Level 3 Sorc spells. I see counterspell and Haste. Any damage spell for me would just be outclassed by EB, especially with 3 castings a turn. Counterspell is nice. With a full caster Squad, Cazador just got bullied, same with Raphael. With Psionic Dominace, their turns were just countered. Haste is duplicated by a potion which i usually drop from my inventory and have a summon throw to me. (Thanks Gale) Or the Illithid power of Mind Sanctuary \n\nAngelic pots cost me next to nothing in Act 3. Circus lady restocks 1. I prepped 30 before the morphic pool. Every fight I went in with 33 sorcery points. More than enough for the 3 turns Emperor took to get to the crown and dominate it. And the 1 turn to kill the brain in the portal.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "VoteNextTime",
                                                                    "body": "Ahhh see I was assuming you were using angelic reprieve pots to restore spell slots / sorc points, if you’re doing the exploit then resource expenditure doesn’t matter at all and won’t impact your action economy, worth it to go for spell sniper at that point.\n\nAs for the other points, counterspell is extremely useful but on a full caster squad you’ll have plenty of counterspellers anyway. Haste is good because you can twin it, speed pots only last for 3 rounds but usually that’s all you need in HM. The draconic sorcery level 6 feature is nice if you ever want to do anything other than EB for damage but I guess that’s not your vision.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "BlackCoatedMan",
                                                                            "body": "I had it on lightning Wyll. Wet vuln to cold and lightning is the most OP thing a DM has ever given a playerbase, imo.",
                                                                            "score": 0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "TheMeerkatLobbyist",
                                                    "body": "I dont want to sound condescending but you are aware that this build is totally fine without maxing out your main stat, right? Its probably more optimized if you play the recommended 2/6/4 split?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "BlackCoatedMan",
                                                            "body": "I mean, tell me how its more optimized. That's why I made the post. I've replied in others comments why I don't see the level 6 of the draco sorcerer worth it. The element doesn't help with eb. The spell slots don't help either with potion of angelic reprieve.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Wooden-Bat-6031",
                                    "body": "You can cheese this by doing sleepy potions from Lann Tarv or equipping the shield that gives a level 1 slot, converting it to a sorc point, then unequip and re-equip the shield",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "OrganicWebsAreValid",
                                    "body": "Angelic reprieves",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Tomliwag",
                                    "body": "That's what Potion of angelic reprieve is for.\nStarting from act 2 you can start to collect them from Lann Tarv in Moonrise. Every level up and longrest will replenish his wares.",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "CartographerKey4618",
                                            "body": "In Act 3, you no longer need to long rest if you beeline it to the House of Hope and just keep using the demon bathtub after every encounter.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Tomliwag",
                                                    "body": "And you agree to travel there EVERY time you run out of spell slots ? This is a new kind of dogshit strategy , congrats.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "CartographerKey4618",
                                                            "body": "I mean, if you're already cheesing, why not?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Tomliwag",
                                                                    "body": "Cheesing with WHAT ? Items that been added by devs ? You can use those potions 2 times per Long rest if thats so painfull to you + warlock can replenish his spellslots with short rest. What else considered cheesing ? maybe walking ? or , whait , using short rest ? I dont know wtf is in your head , but i suggest you to stop using heavy drugs.",
                                                                    "score": -4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "VoteNextTime",
                                                                            "body": "Lol first of all calm down, this is not a life-or-death discussion my guy. Second, the devs put the restoration tub in the game too, so by your own definition that’s not cheesing, right?",
                                                                            "score": 5,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Tomliwag",
                                                                                    "body": "Im ok with either. I will use what i can. The guy sad that its cheesing not me. So i suggest you to calm dawn that guy, not me. Relax.",
                                                                                    "score": -4,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "CartographerKey4618",
                                                                            "body": "What the fuck, dude? Why are you mad? I was literally just adding something else you could do in addition to the potions. I didn't realize I was insulting your honor or whatever.",
                                                                            "score": 4,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Tomliwag",
                                                                                    "body": "No , dude. You sad that \"there is no need... that/this...\" just go 2miles every time you ran out of slots, when you can just, idunno press long rest and boom 5 sec after you are good to go. You method is like 2-5 minutes every time you need that replenishment. Mad ? Why are you triggering at СAPS? Do YOU take it PERSONALLY every time someone wants to highlight a particular word , my friend. Сhill.",
                                                                                    "score": -1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "CartographerKey4618",
                                                                                            "body": "If you don't have potions of angelic reprieve and also don't want to use up too many buff potions like potions of viciousness or whatever, you can use the method to do that. You can also use it in addition to long resting to get all of your level 6 buffs and summons up without having to use any of your potions of angelic reprieve or a spell slot. For the cost of 5 minutes of walking, you can have your level 6 aid, all your summons, and heroes feast without needing to use camp casters or whatever. It's also completely resource-free, unlike a proper long rest. There are plenty of ways to do all of these things. I'm just sharing another thing you can do.",
                                                                                            "score": 2,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "BlackCoatedMan",
                                            "body": "Correct.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "BlackCoatedMan",
                            "body": "Correct",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BlackCoatedMan",
                    "body": "Quickened Eldritch Blast. Starting from Act 2, Potion of Angelic Reprieve is real easy to get and stockpile.\n\nIn my honor mode run, I stayed at  full Warlock until I could do so.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "VoteNextTime",
            "body": "If the idea here is to maximize eldritch blasts via quickened spell + extra bonus actions, a couple points:\n\n\n- You’re right that going for hag’s hair + mirror of loss + patriar’s memory is the way to go for 24 CHA and that helmet of grit is the ideal pick.\n\n- I assume you went 4/4/4 for 3 feats, but doing so delays your sorcerer spell slot progression which is kind of necessary for converting into sorcery points to continually use quickened spell. I’d go 6 sorc / 4 thief / 2 lock at least.\n\n\nEDIT: Forgot to mention, elixir of viciousness is kind of a wasted elixir slot. Bloodlust will get you way more bang for your buck as you should be killing at least one enemy per round. There’s also an argument to be made for spellmight over craterflesh but that’s a bit more up in the air.",
            "score": 9,
            "replies": [
                {
                    "author": "OrganicWebsAreValid",
                    "body": "You don’t need level 3 spells or adding charisma to elemental spells if you’re only going to eldritch blast tbh with angelic reprieve potions you can have more than enough sorcery points",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "BlackCoatedMan",
                    "body": "Problem is that bloodlust doesn't always proc due to illithid powers. i had the whole brain unlocked, but mostly used luck of the far realms, Psionic overload and cull the weak.\n\nAs for spell slot progression, I went full warlock until I figured out how vendors restocked and saw The potions of angelic reprieve at moonrise. After that? Who cares about just having level 1 and 2 spell slots? Just pop the potions and you'll be good to go thanks to there being no cap to sorc points.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "B_Provisional",
                            "body": "When running Bloodlust Elixir builds I like to just add the Cull the Weak toggle on to my main hotbar. Turn it off at the beginning of your turn, kill something to proc Bloodlust, turn it back on to do more damage with the rest of your turn. This is admittedly adding a lot more clicking to deal with but overall pumps out lots of damage.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "BlackCoatedMan",
                                    "body": "Oh, that's something I never thought of. Nice!",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheMeerkatLobbyist",
            "body": "I would much rather run spineshudder and stormy clamor on basically any blaster.",
            "score": 18,
            "replies": [
                {
                    "author": "BlackCoatedMan",
                    "body": "I had 4 casters.\n\nGale had the stormy clamor boots with his MM build.\n\nI had spineshudder on my durge for the longest time. But 23 con was too good an offer, and the con save advantage. Especially with the risky ring on.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "PrincesaFuracao",
            "body": "Hey, one of the only runs I actually finished the game was with a sorlock using this exact same build as well!\n\n\nGod, it was so much fun!\n\n\nEDIT: I think I actually found a way to insert 3 levels of fighter champion in there as well iirc lol",
            "score": 1,
            "replies": [
                {
                    "author": "BlackCoatedMan",
                    "body": "While Action surge is fine, its once per combat only. Unless you plan on short resting very often, you won't see it in most fights.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "PrincesaFuracao",
                            "body": "Actually, action surge was BIS, I picked champion for the reduced crit threshold",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "BlackCoatedMan",
                                    "body": "Ah, I couldn't add another class without losing multiple feats. 2 ASIs are needed to get to 24 Cha without the birthright helmet. And spell sniper is also another crit threshold.\n\nHow would you have added champion fighter to my build without taking away more than it gave?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "PrincesaFuracao",
                                            "body": "Ah, I see. I think you're very well optimized, actually. I'd have to study all the possibilities of this build again in order to make a comment that would contribute to it (I have a tendency of doing this before playing...). You're fine, keep it up!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Prince_Marf",
            "body": "Hear me out: 3/3/2/4 Thief, EK or Champ Fighter, Warlock, Sorcerer.\n\nFighter gets you action surge, which means you can do an additional eldritch blast cast in a single turn. Champ would lower your crit threshold by one, but EK increases your ESL to level 5 which gives you two 3rd level spell slots. This allows you to make better use of both spell slot necklaces, and you can reclass hirelings/unused party members into wild magic barbarians to get 6 sorcery points from each of them per long rest. So the additional ESL gets you 6 more sorc points from the spell slots, an additional 2 sorc points from the necklaces, and 3 more per party member reclassed into a wild magic barbarian. All of that on top of allowing 5 eldritch blast casts in one turn once per short rest. I think that's worth sacrificing two feats.\n\nAnd it justifies the Birthright because you need the 2 extra rizz. So by my calculations you should be able to do 195-330 damage in a single turn before crits. And it only costs 6 sorc points, haste, and an action surge.",
            "score": 1,
            "replies": [
                {
                    "author": "BlackCoatedMan",
                    "body": "Sorc points in this game are uncapped for some reason. With Potions of angelic slumber and vendor farms, that is not an issue. You get all the sorc points you need in a fight with level 1 and 2 spell slots. No camp casters needed.\n\nIf I replace birthright with helm of grit, i could have 1 more quickened eldritch blast per turn. Better than action surge, which is only 1 per short rest. And with 4/4/4 in levels, I have 3 feats. One of which is spell sniper. Which will have the crit threshold reduction same as Champion fighter.\n\nI don't think the fighter inclusion is worth it.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Lord_Lanre",
                            "body": "https://www.reddit.com/r/BG3Builds/s/zmIvKFQyKx\n\nJust play the 4/4/4 stabby EB build by u/awspear. It's badass and works great. No spell slots are needed.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}