{
    "title": "What's the strongest cleric you can think of?",
    "author": "VintageButter",
    "subreddit": "BG3Builds",
    "rank": 6,
    "score": 22,
    "upvote_ratio": 0.86,
    "num_comments (reported by reddit)": 44,
    "url": "https://www.reddit.com/r/BG3Builds/comments/1je9scl/whats_the_strongest_cleric_you_can_think_of/",
    "id": "1je9scl",
    "selftext": "What's the strongest cleric build you can create in this current patch, in terms of DPR, assuming:\n\n* Broken interactions are allowed\n* Unlimited rests/consumables\n* Tactician and below - so DRS is allowed!\n\nSome candidates I can think of:\n\n1. 11 tempest cleric / 1 storm sorc - tempestuous flight + DW\n2. 6 light cleric / 6 OH monk - spirit guardians fun + TB empowered punches\n3. 12 light cleric - ol' reliable with radorb gear and maybe fire acuity for the upcasted scorching ray\n\nFeel free to suggest alternatives that were missed out :)\n\nEdit: As others rightfully pointed so, its not much of a cleric if its just a dip or two… revised the candidates! And thanks for pointing it out :)",
    "comments": [
        {
            "author": "Rude_Ice_4520",
            "body": ">assuming: Broken interactions are allowed Unlimited rests/consumables Tactician and below -\n\nLight cleric 12. Pyroquickness hat. \n\nStep 1: cast Mind Sanctuary. \nStep 2: cast fireball\nStep 3: cast fireball\nStep 4: cast fireball\nStep 5: cast fireball\n\nRepeat ad nauseum.",
            "score": 26,
            "replies": [
                {
                    "author": "Awkward-Percentage98",
                    "body": "How do you turn a bonus action from the hat into that many fireballs? A broken interaction?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Rude_Ice_4520",
                            "body": "Every time you cast fireball, you get an extra bonus action.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Awkward-Percentage98",
                                    "body": "That part makes sense, But how do you use the bonus action to cast another fireball? Isn't it an action? Or am I totally misunderstanding the concept",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "PostModernFascist",
                                            "body": "Step 1: cast Mind Sanctuary.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Awkward-Percentage98",
                                    "body": "Nevermind I got it, mind sanctuary. Awesome",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "DrLion",
            "body": "I really liked my Light Cleric 11 / Wizard 1 for lvl6 spells both arcane and divine. Huge arsenal of spells, really versatile.",
            "score": 25,
            "replies": [
                {
                    "author": "VoteNextTime",
                    "body": "This but with 1 storm sorc instead of 1 wizard. You lose scribing but get con saving throw proficiency and tempestuous flight which both synergize perfectly with a light cleric rad orb / reverb build using spirit guardians.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "dCLCp",
                            "body": "Are level 6 cleric spells worth not doing storm sorc 1 wiz 1 light cleric 10?",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "VoteNextTime",
                                    "body": "Depends, hero’s feast and planar ally are both amazing but with wiz 1 you can scribe any spell you can find a scroll for, even level 6 spells since your total caster level will allow for it. I personally feel like scribing isn’t necessary for this kind of build but others may feel differently",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "captainrussia21",
                                            "body": "Instead of scribing - you can just “scrollcast”. That way you don’t have to worry about dipping into Wiz at all. Wisdom will be your casting stat if you do it right (stay pure Cleric or go Druid as a Multi) And scrolls arentechnically unlimited (and honestly for the most powerful ones - you won’t nees more than like 10 of each kind for the entire game)",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "OrganicWebsAreValid",
                    "body": "This but tempest to get chain lighting and lighting bolt",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "DoctorBoomeranger",
                    "body": "And in case you have no more potions of speed, you can learn haste for concentration!! One my fave support cleric builds",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "grousedrum",
            "body": "IMO, leaving 1-2 level cleric dips aside:\n\n* Control/all-around: 6 light 6 fire sorcerer\n* Damage: 6 tempest 6 electric sorc\n* Support: 11 life 1 sorc\n* Battlefield control: 10 nature 2 wizard or 10 knowledge 2 sorc\n* Martial/control: 3 hunter 9 war, 5 gloom 7 trickery, or 6 OH 6 light",
            "score": 8,
            "replies": [
                {
                    "author": "LostAccount2099",
                    "body": "I'll die on the Hunter 3 / War Cleric 9 hill!",
                    "score": 5,
                    "replies": [
                        {
                            "author": "BoreholeDiver",
                            "body": "How does this work?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "LostAccount2099",
                                    "body": "The idea is a very versatile character: an almost full spellcaster (10th level spellcaster, 5th level Cleric spells) with both Horde Breaker and so many War Priest charges that will make up for no Extra Attack.\n\n- You can play support with Guidance, Enhanced Leap, Longstrider, Water, Bless, Warding Bond, Crusaders Mantle\n- You can play debuffer/CC with RevOrb Spirit Guardians followed by Blindness or Glyph of Warding: Sleep\n- You can play at the frontline via Spirit Guardians + Horde Breaker/War Priest charges to emulate Extra Attack, plus additional damage via Divine Strine and Arcane Synergy\n- You can play full spellcaster (Hold Person, Hold Monster, Glyph, Insect Plague, Flame Stroke, Glyph as either damage/CC or even Bane if you're saving spell slots) by accumulating  Acuity \n\nAnd the best is to play all of the same time, alternating roles per combat or turn.\n\nThe progression and ideas are heavily inspired from [Sorrow Hunter](https://www.reddit.com/r/BG3Builds/s/JoN9P2LKRl) (use Bonus Action to stack enemies with Sorrowful Lash, then strike both with Horde Breaker), but as Hunter 3 / War Cleric 1 you use Luminous Armour, Boots of Stormy Clamour and cast Divine Favour to also play RevOrb without Spirit Guardians. Arcane Synergy Ring later will be triggered by Sorrowful Lash. Esnaring Strike your stun gun.\n\nBy Act 2 you can move to Spirit Guardians, Callous Glow helm of Acuity and Rat Bat, which has an insane interaction with Horde Breaker and condition spreader ([here](https://www.reddit.com/r/BG3Builds/s/mSfQtK2t2P) ). If there are 3 enemies in the Horde Breaker area, Rat Bat will damage and get RadOrb in all of them, which also will stack 6 Acuity from a single attack.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "grousedrum",
                            "body": "It's so good!  Among other things, it's one of the better setups for getting both Acuity and Synergy on the same character, and is also one of the handful of control martials that gets Hold Monster.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SnooDoodles4787",
            "body": "Is it really a cleric if its 1 or 2 levels?",
            "score": 5,
            "replies": [
                {
                    "author": "AerieSpare7118",
                    "body": "If I thought it really was, I’d consider 1 Death Cleric/3 Shadow Sorcerer/3 Thief Rogue/2 Fighter/3 X for the bursting sinew spam",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "LostAccount2099",
                    "body": "No.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Talik1978",
            "body": "Let's see...\n\n17 base strength.\n+2 ASI\n+1 Ethel boon\n+2 Oblodra potion\n+2 Mirror of loss\n+3 Merregon mask.\n\nSo a cleric with all of those would have a 27 strength. That's about the strongest I can think of.",
            "score": 5,
            "replies": []
        },
        {
            "author": "BattleCrier",
            "body": "ppl are really sleeping on Shillelagh Nature Cleric.\n\nOn lv.4 you can get 20 Wisdom, dealing 1d8+5 +1d4 damage with a fcking torch..\n\nYou get easy 19AC with heavy armor, going 17 Wis, 16 Con base..\n\nAnd you get crazy 15DC Hold Person..\n\nLate game multiclassing..? Hunter Ranger 11 / WarCleric 1 with: \n\n- Punch Drunk Bastard\n- Blackhole and Cull the weak Illithid powers, \n- RadOrb build, Callous ring, the usual stuff.. \n\nPull in entire room worth of enemies and unleash the wrath of the whirlwind.",
            "score": 4,
            "replies": [
                {
                    "author": "captainrussia21",
                    "body": "Cleric9/Druid3\n\nPick your flavor of Cleric and Druid. If you want more offense - go War/Tempest or Life/Light for all around and support. You get Heavy Armor and Shillelagh, which means you can dump all your stats and max out WIS + CON (use Dex gloves for ranged attacks). You don’t even have to Shapeshift - but when you do, its just icing on the cake. (Oh and cat form is super useful for sneaking into places if you’re into that form of RP).\n\nPatch 8 Druid of the stars (even a 3 lvl dip) would make this insanely strong for ranged suppord with pure bow DMG (DEX gloves) or Luminous Arrows or Guiding Bolt spam.\n\nBecause of maxed WIS - you can scroll cast and item cast really well as well.\n\nMaxed CON is well… maxed CON. Pick up Warcaster and your Concentrations are stronger than ever due to Advantage on SS. Switch to Starry Form: Dragon and your concentrations are now unbreakable!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "mrcoffeeforever",
            "body": "‘Strongest’ is such a twisted term and open to interpretation….especially when paired with ‘tactician and below’. \n\nI only play honor mode but my vote for ‘strongest’ would either be an 11/1 Tempest Cleric Wiz split for massive lightening damage, a 2/10 Fighter/Cleric for radiant orb debuffing, or a 11/1 Life Cleric/Wiz focused on maximum buffing.",
            "score": 3,
            "replies": [
                {
                    "author": "ClusterMakeLove",
                    "body": "Would you built the wizard ones for intelligence or wisdom?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "mrcoffeeforever",
                            "body": "I'd do a count for how many Wiz spells I want and whether enemies get a save.  Example - the Life Cleric/Wiz, I'd probably want Haste, Shield, and Conjure Elemental.  As such, I need only 12-14  Int.  \n\nThe Tempest Cleric/Wiz is similar but order matters.  If I'm going to rely on Marko for Chain Lightening then I would take Wiz first, then Cleric so that it's Spell DC is based on Wisdom if I wanted to min/max.  TBH though, with the prevalence of spell DC gear I'm not a huge fan of using all my feats for ASIs and would rather pick up Alert and the Dual Weapon feat to double stick it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SpiritAppropriate236",
            "body": "12 Radorb Life cleric is the best party support ever. I personally prefer 11 light cleric / 1 storm sorcerer though for rad orb and reverberation abuse. It's a more offensive Spirit Guardians lawnmower. I agree with the others I wouldn't consider the first 4 options as cleric builds",
            "score": 2,
            "replies": []
        },
        {
            "author": "lampstaple",
            "body": "If you’re looking for dpr then it’s tempest cleric with no contest, isn’t it? At least 2 sorc, at least 6 tempest cleric. \n\nIf you have a teammate to setup wet for you then all the better. Amulet that gives you +1 channel div + quicken call lightning + speed pot means 3 maximized call lightnings on lightning vulnerable targets. You can also swap one of those out for a crit witch bolt if it’s just one target.\n\nEven without a teammate to set up wet up for you it’s insane; you’re losing one maximized call lightning but it’s not like there’s much in the game that isn’t going to die to this. Wet/vulnerability  is a ridiculously unbalanced mechanic",
            "score": 2,
            "replies": []
        },
        {
            "author": "Responsible_Bus_4691",
            "body": "My favorite cleric is 1 storm sorcerer 11 tempest cleric with luminous armor, gloves of belligerent, boots of striding and phalar aluvue. Shadowhearts activates spirit guardians and shriek and just walk around. Not much damage but every enemy becomes weaker.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Talik1978",
            "body": "Let's see...\n\n17 base strength.\n+2 ASI\n+1 Ethel boon\n+2 Oblodra potion\n+2 Mirror of loss\n+3 Merregon mask.\n\nSo a cleric with all of those would have a 27 strength. That's about the strongest I can think of.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Talik1978",
            "body": "Let's see...\n\n17 base strength.\n+2 ASI\n+1 Ethel boon\n+2 Oblodra potion\n+2 Mirror of loss\n+3 Merregon mask.\n\nSo a cleric with all of those would have a 27 strength. That's about the strongest I can think of.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MajesticFerret36",
            "body": "Tempest, easily.\n\nWet + upcasted Witch's Bolt + Luck of rhe Far Realms/Destructive Wrath and Wet + Twin Spell Chain Lightning + Destructive Wrath is literally peak mage nuking.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sufficient_Catch_198",
            "body": "I love Tempest Clerics with Hamarhaft and the hat of storm scion power. Only wish they had more crowd control spells, but reverberation is busted too lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "thanerak",
            "body": "Tempest cleric 5 fire dragon sorcerer 6 wizard 1 \n\nPrecast haste \n\n2 Maximized lvl 5 scorching rays 1 quickened  lvl 6 chain lightning maximized with cleric.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SnooSongs2744",
            "body": "Either tempest or light, combined with the radiant armor, a radiant weapon, boots of stormy clamour, and I think it's the wondrous gloves... various equipment that gives the cleric high damage attacks. There are also a couple of rings in act 2 that bolster their radiant attack. I don't get the multiclassing with sorc since they have different primary ability scores.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ashjkaell",
            "body": "Haha interesting question \\^.\\^\n\nIf you REALLY want to go crazy, I think leveraging Death Ward is certainly a theoretical DPR optimum; (Death ward activating not only revives you but also restores all your actions if you have a party member sharing initiative.)\n\nThis is theorycrafted and explained in details in this great post:  \n[https://www.reddit.com/r/BG3Builds/comments/1b5fi7f/spell\\_economics\\_ftk\\_a\\_yugio\\_i\\_mean/](https://www.reddit.com/r/BG3Builds/comments/1b5fi7f/spell_economics_ftk_a_yugio_i_mean/)\n\nAnother fun interaction is with Divine Intervention; If you have death ward active and use the radiant damage nova divine intervention and something causes you to die simultaneously... you keep your divine intervention... I actually stumbled upon this when testing if death ward could keep Hope alive against Raphael's weird radiant retort in honor mode. (Haven't tested against the sharrans but maybe it works too!)\n\nAs another little remark (since people have already explored the more sane ideas in great detail :), you COULD consider that Contagion is effectively an \"instant kill\". It is absolutely hilarious to cast contagion (which does NOT need concentration and lasts through your rests) on the act3 bosses. Just use a high DC character (or break objects with arcane acuity helmet) and greater invisibility if you want and enjoy instantly killing bosses ;)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ozymandius666",
            "body": "Tempest Cleric 11/ Wizard 1 focussed on intelligence\n\nThis gives you the combo of wet + destructive wrath + chain lightning\n\nChain Lightning deals 10d8 lightning damage, sp 20d8 on wet targets, and 20\\*8 = 160 with the channel divinity. Against 4 targets, that means you deal 640 damage with each casting. \n\nYou still have all the normal cleric stuff, including heroes feast, spirit guardians etc, but you also gain the shield spell, misty step, all the wizard offensive spells, and conjure elemental for the water myrmidon to spread wet",
            "score": 1,
            "replies": [
                {
                    "author": "Ozymandius666",
                    "body": "And of course you can still do all the reverb/ radiant orb stuff any other cleric can do, and just as well",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MagicalCacti",
            "body": "Clerics aren’t designed for dpr more that they are designed for crowd control which 12 light cleric is best at. \n\nIf you are going for dpr tempest storm sorcerer with wetting opponents than channel divinity for max damage doubled is probably best.",
            "score": 1,
            "replies": []
        },
        {
            "author": "regular_joe67",
            "body": "17 at character creation, Ethel’s hair, an ASI, Araj’s potion and the mirror for a 24 strength cleric",
            "score": 1,
            "replies": []
        },
        {
            "author": "Panda-Dono",
            "body": "Depends on what you consider a cleric.\nWizard 2, Sorc 4, Tempest Cleric 6 is a monster, that rests after every encounter, but does ABSURD amount of damage. \nUses int as main Stat tho. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "skinkinatree",
            "body": "I love 12 war cleric, helm of arcane acuity two hand crossbows use a bonus action to off hand a bow attack which does two attacks because of divine strike, meaning you get plus 4 arcane acuity for a single bonus action, so you can use your action to cast anything at full chance. Also war clerics are the only class that have access to command/hold person/hold monster.",
            "score": 1,
            "replies": []
        },
        {
            "author": "aszma",
            "body": "11 EK 1 WC archer is probably the strongest DPR in the game when using slayer arrows and bhaalist armor.  You can do 9-10 slayer arrows on turn one, combine that with titan string, poisons, strange conduit ring, draconic weapon enchantment.  Ive one turned almost every boss in the game from act 1- act 3 solo on honor mode with this build.  \n\n3 martial attacks + action surge for three more + 1 attack from martial exertion gloves + haste + warcleric charge, then one more if your using bloodlust",
            "score": 1,
            "replies": []
        }
    ]
}