{
    "title": "I need help, getting annoyed. Act 3.",
    "author": "FearlessLeader17",
    "subreddit": "BG3Builds",
    "rank": 5,
    "score": 30,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 46,
    "url": "https://www.reddit.com/r/BG3Builds/comments/1jebdvk/i_need_help_getting_annoyed_act_3/",
    "id": "1jebdvk",
    "selftext": "So in act 3 there's the little ninja guys who do the  shroud and I cannot hit them. It's bad in the bank vault where's there's so many on multiple levels. I tried AoE spells, I tried scroll of see invisibility, hell I even tried making a light shine on my character and they will come up hit me twice for half my health+ and then go invisible and move pretty far away where it's a complete guess where there at. I been taking my party in different areas trying to keep the guard alive but damn this is impossible.\n\nI run a Bardadin, a berserk thrower, a cleric, and for this I'm running a druid but I normally run a sorclock. I'm at my wits end because the Bardadin and berserker cannot see them at all. And the cleric it's a random guess. ",
    "comments": [
        {
            "author": "ParanoidUmbrella",
            "body": "First of all, don't worry about keeping all of them alive - the Dwarf banker is the only one that matters even remotely. Secondly, wide ranging AoE effects work quite well (Faerie Fire might work, but I also recommend Flaming surfaces). If you're on pc, you can right click their icons with your ranged weapon equipped and click on Main Hand Attack (Ranged) to attack them with a Bow or Crossbow.\n\n\n\n\n\n\n\n\n\n\n\n\n\nEven without invisibility hindering you though, it can be a tough fight.",
            "score": 16,
            "replies": [
                {
                    "author": "Complex-Ad-9317",
                    "body": "Letting the dwarf banker die nets you a free key, and you can still grab the gold he would give you.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "VoteNextTime",
            "body": "If you have volo’s eye then that character should be able to spot them when they get close. Use spirit guardians on your cleric and have all your party members stay near them. Faerie fire is the ideal spell for this encounter and the one in the park, prevents them from going invisible again if they fail their dex save (granted their dex saves are quite high but there’s always arcane acuity stacking to help with that)",
            "score": 29,
            "replies": [
                {
                    "author": "SnooSongs2744",
                    "body": "They often get the save against any see invisibility skill, it's annoying.",
                    "score": 19,
                    "replies": [
                        {
                            "author": "Spaceman-Spiff",
                            "body": "I honestly can’t think of a time when Volos eye worked for me.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "SnooSongs2744",
                                    "body": "It works great for invisible objects like the switches and signs around the magic tower. Just not great for invisible people. But the Bhaalists are in buggy territory. Even using a cheater scroll called \"true see invisibility\" they sometimes didn't show up.",
                                    "score": 11,
                                    "replies": []
                                },
                                {
                                    "author": "reverne",
                                    "body": "It's based off your general Spell DC, so the natural tendency of most players to put it on melee characters with middling or dumped casting stats ends up being unintentional self-sabotage.",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "handydandycandy",
                                    "body": "Have you gone through Lorroakan’s vaults in Act 3? That location is full of invisible chests",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Spaceman-Spiff",
                                            "body": "I have. I guess I didn’t realize they were invisible.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "sgluxurycondo",
            "body": "There are many ways to deal with them both the proper way and the not so legit way.\n\nI like to use the not so correct way. I ping their portrait to find out where exactly they are and uses mage hand to throw water bottle at them.\n\n\nI like bringing an ice sorcerer for the fight coz I can freeze them. \n\n\nThe more correct way without pinging their location I feel best is either use ice storm coz it has a huge area then throw a water bottle to freeze them. Throwing either grease or water bottle has too small of an area to find them effectively.",
            "score": 9,
            "replies": []
        },
        {
            "author": "TheMightySweetRoll",
            "body": "There's a way to know where invisible ennemies are. When you use the star tool under the minimap, it will ping the place you selected with it. You can use it on ennemies (or allies) icons on the top screen. If you do this repeatedly on an invisible ennemy, it will end up showing its location, then you can AoE is face. The shortcut for this is Alt + Right Mouse Button. \n\nhttps://preview.redd.it/o8dy79dtnhpe1.png?width=353&format=png&auto=webp&s=fb376efe61fbdb5ecac6996bf972fe335c3eedd9",
            "score": 13,
            "replies": [
                {
                    "author": "taker25-2",
                    "body": "unfortantly, this isn't an option for console players.",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "millrro",
            "body": "Can also upcast create water. If they are in the AoE it causes an auto break of stealth, then you just nuke them with double damage.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Kman1986",
            "body": "Go to the Potion Maker and purchase her Elixir of See Invisibility. Keep a few on hand for places like Lorroakan's tower, they're gonna change your life.",
            "score": 3,
            "replies": []
        },
        {
            "author": "RaiderNationBG3",
            "body": "Do you have explosives? Do you have Titanbow, Many Arrows? How about Globe of Invulnerability?",
            "score": 5,
            "replies": []
        },
        {
            "author": "KatoGodPrime",
            "body": "If you are having trouble finding where they are, hold shift and see where the line of pathing goes around the invis person (if you absolutely want to cheese it)",
            "score": 5,
            "replies": []
        },
        {
            "author": "ClassicSherbert152",
            "body": "I used cheese. Using the movement speed \"line\" thing you can trace out the environment and often there will be a section that \"splits\". This is where they're sitting, as you can't move onto the cloaked assassins. \n\nAlchemists fire bottles were also really useful because I had never used them otherwise and they were a free AOE. I had like 10 \n\nJust want to note that because of their turn structure, they actually don't often move that far when they go invisible because they usually attack first. AOE throwables are pretty solid because they can cover decent ground",
            "score": 4,
            "replies": [
                {
                    "author": "FearlessLeader17",
                    "body": "Yeah I never used them either lol I'll def try this, thanks !",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "esmith22015",
            "body": "Arrows of many targets can help here - shoot one of the enemies who isn't invisible and if there is an invisible one close enough the arrow will ricochet and hit them too and knock them out of invis.",
            "score": 5,
            "replies": [
                {
                    "author": "handydandycandy",
                    "body": "I just discovered yesterday that these many target arrows will hit >! Bhaal temple members !< under sanctuary! It seems broken but I hope they don’t fix in the next patch lol Easiest way I fought one of the Act 3 bosses >! by breaking Orin’s 12 invulnerable stack and hitting the minions at the same time !<",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "LostAccount2099",
            "body": "Your Druid can cast Fairie Fire. That's it.\n\nYour Paladin can strike them with Branding Smite before you recast FF to another area.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Ancient_Rhubarb_3783",
            "body": "faerie fire, shatter, and smoke powder arrows are the GOAT for this fight",
            "score": 3,
            "replies": []
        },
        {
            "author": "RaspberryDifficult45",
            "body": "Yeah they’re little bitches. Worst part of the game for me. \n\nBut faerie fire and AoE, including Shart the blender, did it eventually.",
            "score": 3,
            "replies": [
                {
                    "author": "FearlessLeader17",
                    "body": "Yeah I'm new to CRPGs so I'm already at a disadvantage lol they really fuck with me. Got some pretty good advice so hopefully when I try I'll be able to come up with a good strategy. Thanks :)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "smrtgmp716",
            "body": "Create water works wonders against invisibility.  Once their invisibility is broken, you can use summons to draw AoOs to break sanctuary.  The druid can do both.",
            "score": 3,
            "replies": [
                {
                    "author": "FearlessLeader17",
                    "body": "Ooh awesome I didn't know this. Guess I just wasn't thinking big picture lol I was trying like fireball and hoping it hits.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Candid_Umpire6418",
            "body": "Spirit guardians, longstrider, Dash, Mobile Feat.\n\nThen run where you saw them last",
            "score": 3,
            "replies": [
                {
                    "author": "FearlessLeader17",
                    "body": "Awesome ty will def try this ! I tried Spirit but didn't try the extra movement lol.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SnooSongs2744",
            "body": "Give cleric long strider and turn on spirit guardians and have them walk along the side corridors to reveal hidden enemies. AOE damage can be very effective if you know where they are. They always go to the stations so you can go a round or two then go back and kill them. \n\nLightning bolt is the best, I often down two with one high level shot. \n\nMagic missile is good for burning through that \"unstoppable\" buff.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Aeliasson",
            "body": "Get that shield that grants Advantage on Perception rolls and put it on your highest wisdom character, with proficiency in Perception.",
            "score": 2,
            "replies": [
                {
                    "author": "FearlessLeader17",
                    "body": "Oh with high perception you can see them without spells?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Aeliasson",
                            "body": "I think it might not actually do anything in BG3.  \nWas gonna say you need See Invisibility as camp buff, but that ones uses the caster's Spell DC, not your preception.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Warchild_13",
            "body": "Create Water will make enemies visible with no save",
            "score": 2,
            "replies": []
        },
        {
            "author": "handydandycandy",
            "body": "I use create water: it seems to break invisibility and also applies wet condition, which makes them vulnerable to ice and lightning damage. Ideal for me as a storm sorcerer who electrifies water under me. Most magic users have this spell available. Be aware that it will decrease fire vulnerability if that’s your main damage type.",
            "score": 2,
            "replies": [
                {
                    "author": "FearlessLeader17",
                    "body": "Okay and yeah I don't do much fire except fireball when there's a bunch of enemies grouped. Never tried create water seems to be the most common response, will def try ty!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "grumpus_ryche",
            "body": "Cleric with spirit guardians and high movement should sniff them out real quick. Smokepowder arrows cover a lot of ground, too.",
            "score": 2,
            "replies": [
                {
                    "author": "FearlessLeader17",
                    "body": "I tried the spirit guardians but I didn't try with extra movement, will def try this ty ! I feel this is the only thing I need to figure out lol.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "grumpus_ryche",
                            "body": "If you've got illithid fly, just take a line that covers the most area with SG. Also, if your cleric has Lathander mace and Boots of Stormy Clamour, you might get a lucky reverb proc. Phalar Aluve might come in handy as sonar, too. Another thing that can sniff out the invis is the idol of silvanus, but your only indicator really is the text saying that the effect is on/off. I also tend to toss a bunch of grenades and molotovs around. They ain't charging me for damages, so fuck it.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "FearlessLeader17",
                                    "body": "Yeah I'm doing a good playthrough and honestly I just hated the partial change so I declined the upgrade, was really the only big change I reloaded a save. Made my character look evil AF lol.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "MeaningAltruistic753",
            "body": "Cleric Guardian spirit go brrrr. Beyblade them all. Then use scroll of see invisibility or potion. Or use sleet storm.",
            "score": 2,
            "replies": []
        },
        {
            "author": "baristedd",
            "body": "Afaik those guys can’t move while they’re invisible, at least on balanced difficulty",
            "score": 1,
            "replies": []
        },
        {
            "author": "iKrivetko",
            "body": "You can find out where they are thanks to pathing avoiding them, and you can use melee slashing flourish or something like cleave to hit, or just throw/shoot roughly into the middle of that spot. Clerics have create water which exposes invisible creatures.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Remus71",
            "body": "Upcast Fairie Fire.",
            "score": 0,
            "replies": [
                {
                    "author": "Jane-The-Ace",
                    "body": "Fairie fire cant be upcasted?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Remus71",
                            "body": "Can it not 😅\n\nLearn something new everyday.\n\nCast it at lvl 1 then, will still work, or water (which you definitely can upcast!",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "handydandycandy",
                                    "body": "Yeah I just douse them all, I’m a simple sorcerer 😅",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}