{
    "title": "Character Help",
    "author": "Neat-Ad4330",
    "subreddit": "BG3Builds",
    "rank": 14,
    "score": 5,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/BG3Builds/comments/1jeeccs/character_help/",
    "id": "1jeeccs",
    "selftext": "My first game I played with someone so it felt like I was not getting the full experience so I have asked if I may play one alone and my friend said yes! Due to this I’m looking for help making a character. I really loved the abilities of the high elf but was not that big on the lack of unnatural skin colors. I loved the spells and stuff of life cleric but don’t know if it is okay for a first player. Can you let me know? If yes would a drow or teifling life cleric work with the stats below? Also which is better? \n\nStrength: 8\nDexterity: 14\nConstitution: 16\nIntelligence: 8\nWisdom: 16\nCharisma: 12\n\nAnd how does one choose a fitting background? \n\nNote: I prefer attacking at distance ",
    "comments": [
        {
            "author": "Captain_ET",
            "body": "You can expand skin colors during character creation to pick any color.\n\nAny race is honestly fine. Just pick what you like. For example, I really like the movement and proficiencies from wood elf. Overall the differences between races arent super huge.\n\nYour stat spread looks good.\n\nLife clerkc is fine, but if you want to focus on atracking with spells from a distance, then light cleric may be more fun for you since you get more damage spells like fireball.\n\nBackground is best as flavor so however you imagine your character.",
            "score": 3,
            "replies": []
        },
        {
            "author": "grousedrum",
            "body": "Those are totally good stats for a life cleric, yes!  It's a great class to heal/buff/support your other party members while also having access to a nice range of cleric control spells and a few damage options.\n\nBackground can be whatever your character RP calls for.  But also, if you want a certain skill proficiency that your class doesn't provide access to, background can be a good way to get it.  For example, Intimidation from Soldier, Persuasion from Guild Artisan or Noble, or Performance from Entertainer can all help with your dialogue rolls as a party face.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Minute-Expression-83",
            "body": "Life cleric is a good class. It’s better the harder difficulty you are playing though. As this is for beginner friendly I would recommend light cleric more but life isn’t bad it’s just you won’t be doing as much damage as your other companions which if it isn’t a dealbreaker for you is fun as you will be the main support. Race in this game doesn’t matter much but as a general note drow is quite good as you get darkness and hand crossbow proficiency giving you a bonus action attack. If you play this class your turn bellow level 5 will look like this. Cast a heal spell or a sacred flame with your action, bonus action heal spell or hand crossbow attack. Level 5 and above (generally) turn 1 cast spirit guardians and then heal or hand crossbow attack with bonus action, then go back to the pre level 5 stuff for each turn after.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BattleCrier",
            "body": "Lolth Sworn Drow Cleric with Noble background gives a solid amount of extra dialog options, most are on the rather evilish spectrum.. but great if being semi evil doesnt rub your wrong way.\n\nStats look great, no need to go for something else. \n\nAs a drow you get proficiency with hand xbows.. which will give you the ranged attacks.. and there are gloves which sets your dexterity to 18, so you can respec and to base stats something like 8/8/16/12/16/14",
            "score": 1,
            "replies": []
        },
        {
            "author": "ParanoidUmbrella",
            "body": "If you like attacking from a distance, you might be better off with a Ranger. As for the background, it's whatever might fit best. Rangers or Clerics make good Acolytes, a Bard or Wizard might make a good Sage, whilst Barbarian and Fighter make for good Soldiers. The Paladin and Warlock make for good Folk Heroes and Rogues and Druids can make for good Criminals or Urchins. Race is also a factor. Human or Tiefling? Urchin, Criminal, Guild Artisan, Soldier, etc. Dwarf or Gnome? Guild Artisan, Soldier, Acolyte, Sage, etc. Think about the life your character might have lived, and pick accordingly (although some will just pick based on proficiencies and call it a day).",
            "score": 1,
            "replies": []
        }
    ]
}