{
    "title": "Summit wipes Crew after they ignore Warning",
    "author": "Secksi323",
    "subreddit": "LivestreamFail",
    "rank": 2,
    "score": 660,
    "upvote_ratio": 0.89,
    "num_comments (reported by reddit)": 34,
    "url": "https://clips.twitch.tv/SmokyClearFungusCorgiDerp-oGs0elVFLDIJ7IId",
    "id": "1jdtu42",
    "selftext": "",
    "comments": [
        {
            "author": "LSFSecondaryMirror",
            "body": "**CLIP MIRROR: \n [Summit wipes Crew after they ignore Warning](https://arazu.io/t3_1jdtu42/)** \n --- \n\n[Join the LSF Discord!](https://discord.gg/cxrGPbdywY)\n\n^(*This is an automated comment*)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Disastrous_Self_6053",
            "body": "I love watching these clips. He looks like he's having so much fun.\n\nI HATE watching Summit play SoT though, he will tuck for 6 hours on 5 different ships with minimal interactions and its brutal to watch (for me).",
            "score": 291,
            "replies": [
                {
                    "author": "Shpongolese",
                    "body": "this is what made me laugh when he was playing the Isle and people complained about him healing in bushes for 20 minutes. Like bros have you not been around for SoT streams?? Lmao",
                    "score": 142,
                    "replies": []
                },
                {
                    "author": "smallbluetext",
                    "body": "That's why the youtube vids for tucks are much better but still, the odd time I do tune in live for a tuck and I see it all unfold live can be rewarding. Usually gaming on the side until he is ready to reveal himself.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "YewEhVeeInbound",
                            "body": "Bro, the 4 hour tucks where they stack loot, and have open mics are absolute cinema. The payoff is worth the wait sometimes, that's why I put him on in the background when he streams SOT.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "No_Advantage1902",
                    "body": "Thats why Jaron is the man. ",
                    "score": 30,
                    "replies": [
                        {
                            "author": "YewEhVeeInbound",
                            "body": "I noticed today that on Summit's YT channel he actually has Jaron as his \"Second channel\" which was pretty cool.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "LPSlashh",
                                    "body": "ya summit hired him awhile ago, i believe he pays him ",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SeedFoundation",
                    "body": "Yeah I don't think I can watch that either. I saw him play it the first time around and it looked like he was just bullying a bunch of casual console players. Like actual dad gamers playing with their kids with the reaction time of a potato.",
                    "score": 22,
                    "replies": [
                        {
                            "author": "themadhatt0r",
                            "body": "in SoT you either find the super good and sweaty crews who clean the floor with you or said gamer dads either solo or playing with other dads/kids, gotta take what you can",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "solartech0",
                                    "body": "I feel like this has got to give those casual gamers such a good story, though.\n\n\"Remember when we got that rare NPC who spawned on our ship, told us to turn around, and blew us up for ignoring him? How'd they code that up!\"",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "DM-Mormon-Underwear",
                            "body": "As a gamer dad you should expect this sort of thing in a pvp game. If you want casual fun time with little kids play something coop pve.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "zipline3496",
                            "body": "It’s crazy that gamers today see doing PvP in a game marketed as an open world PvP free for all as bullying.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Powerful_Artist",
                            "body": "I mean its not bullying anymore than if he played a FPS and won the game he was in, is it?\n\nI dont understand why everyone is so soft when it comes to SoT. Its a PVP video game, there are winners and losers, that doesnt mean winning makes you a 'bully'.\n\nOften times you will fight players who are brand new or experienced in any game, thats how it works usually. If someone beats a new player in COD, are they a bully? or if I beat a new player in Street Fighter, does that make me a bully?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "keithstonee",
                    "body": "The tuck is the best part",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Powerful_Artist",
                    "body": "To be fair, a streamer playing SOT just doing endless PVE grinding is probably even more boring.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Shebalied",
            "body": "I miss the old SoT days. Shit was so good for a few months.",
            "score": 9,
            "replies": []
        },
        {
            "author": "sterz88",
            "body": "summit links in my forsen sub",
            "score": 33,
            "replies": []
        },
        {
            "author": "mwsno",
            "body": "Sumsum's laugh is so good. Always a good time when he's having fun.",
            "score": 63,
            "replies": [
                {
                    "author": "reddituser748397",
                    "body": "Thats a creepily affectionate nickname",
                    "score": -52,
                    "replies": [
                        {
                            "author": "irishboy9191",
                            "body": "It's a common nickname for Summit. Back in his Counter Strike days he'd get called Sumsum all the time.",
                            "score": 39,
                            "replies": []
                        },
                        {
                            "author": "OranguTangerine69",
                            "body": "my favorite nickname for him is Scummit1g",
                            "score": -2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "lambomrclago",
            "body": "And 100x people on this sub will see Adin Ross riding Andrew Tate when gold like this is still out there.",
            "score": 29,
            "replies": [
                {
                    "author": "PeaceAlien",
                    "body": "This is #2 that is #1 you can see both wow (I didn't watch that one)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RustGrit",
            "body": "Am I one of the few that loves when he plays SoT?",
            "score": 14,
            "replies": [
                {
                    "author": "keithstonee",
                    "body": "It's the best.  People just have too much brain rot to enjoy it.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Pancakemanz",
            "body": "Summit haters muse seethe when his clips get posted",
            "score": 2,
            "replies": []
        },
        {
            "author": "Hitlers_toaster",
            "body": "https://www.youtube.com/watch?v=VhBJSdSDgno&t=347s\n\nThis is one of the best ones I cant find the main one anymore where one of their crew mates join in with the weiners on the map and just trolls one of them and he gets annoyed.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Djfresh72",
            "body": " I can't even understand what the people on the ship said that made him start laughing...Is there anybody with headphones that can translate what they said to make him laugh",
            "score": 2,
            "replies": []
        },
        {
            "author": "CactusDildoEnjoyer",
            "body": "ScamOG.",
            "score": -28,
            "replies": [
                {
                    "author": "papaglitchy",
                    "body": "gotta respect the long memory but out of all the streamers i’d rather have summit as a friend who wouldn’t throw me under a bus rather than literally anybody who appears on LSF usually nowadays",
                    "score": 24,
                    "replies": [
                        {
                            "author": "GiffelBaby",
                            "body": "Yeah, Summit is ride or die. Gotta at least respect that.",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "OranguTangerine69",
                            "body": "summit didn't throw him under the bus cause he did it with him...",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}