{
    "title": "Israeli PM takes up Trump's offer to decimate and defeat Hamas if they do not release ALL hostages on Saturday",
    "author": "dailymail",
    "subreddit": "Conservative",
    "rank": 56,
    "score": 796,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 129,
    "url": "https://www.dailymail.co.uk/news/article-14385931/Hell-unleashed-Israel-Trump-decimate-Hamas-hostages.html",
    "id": "1in4xdu",
    "selftext": "",
    "comments": [
        {
            "author": "swanspank",
            "body": "They are going to use it for bad PR against the US and Israel. But they are going to use bad PR against the US and just keep drawing it out anyway so what is the down side?",
            "score": 155,
            "replies": [
                {
                    "author": "sowellpatrol",
                    "body": "Hamas puts their children in harms way just to use their bodies as PR",
                    "score": 27,
                    "replies": [
                        {
                            "author": "swanspank",
                            "body": "The amazing thing is the support Hamas still gets from the Palestinians and by proxy whacko Americans.  Every time anyone accuses Israel of genocide they are encouraging Hamas and promoting the tactics.",
                            "score": 17,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DyngusDan",
                    "body": "They literally occupy the basements of hospitals so the Israelis can’t attack.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "bw2082",
            "body": "They're about to FAFO.\n\n  \nAgain.",
            "score": 136,
            "replies": []
        },
        {
            "author": "Ok-Science3599",
            "body": "All Hamas had to do is not fuck around.\n\nWell...they did. And the finding out is bottomless.",
            "score": 265,
            "replies": [
                {
                    "author": "itsyagirlblondie",
                    "body": "It’s wild to me how much the free Palestine crowd was demanding a ceasefire that never happened under Biden because it was somehow “impossible” yet within less than a month of Trumps presidency they’ve negotiated a deal.",
                    "score": 70,
                    "replies": [
                        {
                            "author": "funny_flamethrower",
                            "body": "I mean the deal is likely dead and the free Palestine crowd will go back to hating Trump and America. \n\nLet's face it, there is no doing a deal with the Hamas gang. No one has successfully kept the peace with them for a significant length of time.",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "DyngusDan",
                                    "body": "They’ve since moved on to midday workweek protests of…something?",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Frankenberg91",
            "body": "Fuck Hamas for starting this shit. Fuck Russia and fuck Hamas, why can’t we just have freakin lasting peace for once on this planet.",
            "score": 178,
            "replies": [
                {
                    "author": "treslilbirds",
                    "body": "Humans gonna human unfortunately.",
                    "score": 58,
                    "replies": []
                },
                {
                    "author": "RareRandomRedditor",
                    "body": "Trump should convince Putin to stop the war in Ukraine and attack Gaza instead. Then Putin can tell his population via propaganda that are still fighting in Ukraine and hence did not \"lose\" the war, the real Ukraine has peace, the US does not need to further intervene, and Hamas and Russians have something to do and won't bother Israel or other nations. Everybody wins.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Kern_system",
                    "body": "In all the history of the humanity, we've been at war more than at peace.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "777_heavy",
            "body": "Progress",
            "score": 48,
            "replies": []
        },
        {
            "author": "cathbadh",
            "body": "\"You mean you want to take over and spend your money bombing out enemies for us and then deal with the diplomatic outcry afterward?  Why yes, yes I'd love that!\" - Israeli PM",
            "score": 36,
            "replies": []
        },
        {
            "author": "Jack-The-Happy-Skull",
            "body": "Oh well… FAFO… hope the tarrorist gets smoked.",
            "score": 13,
            "replies": []
        },
        {
            "author": "Royal_IDunno",
            "body": "Bet there’s going to be more of those pro Hamas goons rioting in my country again and ofc our weak soy police won’t do nothing about ‘em as usual.",
            "score": 14,
            "replies": []
        },
        {
            "author": "I_Keep_Trying",
            "body": "Why should the USA get involved in this conflict?  Hamas does not want peace, they would love it if we got involved.  Trump did not campaign on this issue.",
            "score": 53,
            "replies": [
                {
                    "author": "jak2125",
                    "body": "We’re not. He’s giving Israel the go-ahead to level the place.",
                    "score": 46,
                    "replies": []
                },
                {
                    "author": "day25",
                    "body": "They do want peace this is what they always do. They attack Israel then call for peace so they can rearm and do it all again. There is no lasting peace in the region because Israel is the only country not allowed to win a war.\n\nTrump did campaign on this btw. His policy has always been peace through strength and that's exactly what this is. The Israel haters are just mad because they use this conflict to attack Israel and don't want them to be the winners of the war. They'd rather go back to the routine temporary \"peace\" so the next attack can be mounted.",
                    "score": 67,
                    "replies": []
                },
                {
                    "author": "JerseyKeebs",
                    "body": "What, he absolutely did. Just read his remarks on the 1 year anniversary of the Oct 7 attack, he was very clear about support for Israel, and against the violence of Hamas. He wanted a quick and definitive end to the war, wanted the hostages returned, and last term, peace in the Middle East through his Abraham Accords was one of his biggest achievements.",
                    "score": 34,
                    "replies": [
                        {
                            "author": "I_Keep_Trying",
                            "body": "Did it include US taking over Gaza?",
                            "score": -7,
                            "replies": [
                                {
                                    "author": "lousycesspool",
                                    "body": "Tell me about the armies that conquered lands but did not occupy them? I'm having a hard time thinking of any...",
                                    "score": 22,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "dom650",
                    "body": "If they're still holding American citizens as hostages I would say that gets/keeps us involved",
                    "score": 73,
                    "replies": [
                        {
                            "author": "cajunduck",
                            "body": "this 100%",
                            "score": 15,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SlightWerewolf4428",
            "body": "Greatest president of my lifetime.\n\nThe terror supporters on reddit will be wailing.",
            "score": 13,
            "replies": []
        },
        {
            "author": "Kaireis",
            "body": "I hope Israel is ready. I thought the cease fire was to give themselves a break to regroup.\n\nThis will likely be the last chance they have to do a major operation for a decade. Hopefully they can degrade Hama's enough that a more peaceful group takes power in Gaza.",
            "score": 13,
            "replies": [
                {
                    "author": "Ok-Science3599",
                    "body": "Israel won't stop now. They won't stop until the area is completely pacified if terms are not met.\n\nThey want ALL hostages released.",
                    "score": 40,
                    "replies": [
                        {
                            "author": "Kaireis",
                            "body": "This will be their last chance for about another decade. I hope they succeed, while limiting collateral damage.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "lousycesspool",
                                    "body": "no such thing as collateral damage - read where the released hostages were held - there are no innocent non-combatants in Gaza",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Kaireis",
                                            "body": "Dude, I get what you are saying, but there's always collateral.\n\nMost of those people are doing what they do, because they know if they don't comply, they're the next victim.\n\nThis happens under Hamas, ISIS, the CCP, KWP (Korean's Workers' Party), and under countless warlords all over.\n\nThis is NOT me being pro-Hamas or even \"pro-Palestine.\" I think those Palestinians can have a better life under Israel, once they get rid of Hamas (and the PLA!).\n\nWill they choose wisely? I don't think they will, but maybe if Hamas is gone a few might.",
                                            "score": 15,
                                            "replies": [
                                                {
                                                    "author": "lousycesspool",
                                                    "body": "> and under countless warlords all over\n\ndifference (used to be anyway) Americans looked past themselves and fought to build a better country and community through self sacrifice for the greater good \n\nAmerican Revolution didn't happen because it was easy",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "219MSP",
            "body": "Been saying this since day 1, this ends no other way then Hamas being wiped off the face of earth.  Do what we need to do and do it quick. A quick war is a merciful war.",
            "score": 5,
            "replies": []
        },
        {
            "author": "itsjehmun",
            "body": "Got yikes flying in from many angles right now.",
            "score": 8,
            "replies": []
        },
        {
            "author": "elcid1s5",
            "body": "I’ve assumed from the beginning that most of those hostages definitely aren’t still alive. Hamas probably doesn’t even know which collapsed building is lying on top of the bodies.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Meowmeowmeeoww1",
            "body": "I thought we were coming to a solution\n\nI look away from the Middle East for 2 damn days…",
            "score": 1,
            "replies": []
        }
    ]
}