{
    "title": "Now Dems Believe The Election Was Rigged And Possibly Elon Rigged It",
    "author": "-Erase",
    "subreddit": "Conservative",
    "rank": 8,
    "score": 206,
    "upvote_ratio": 0.86,
    "num_comments (reported by reddit)": 69,
    "url": "https://www.reddit.com/r/Conservative/comments/1intk9p/now_dems_believe_the_election_was_rigged_and/",
    "id": "1intk9p",
    "selftext": "Well we’ve come full circle, it seems claims of election denial and rigging is a extremely popular coping mechanism for all political orientations 🤣 It never ceases to amaze me the new conspiracy theories that Reddit has come up with everyday regarding Trump. Now the election rigging claims are getting out of control. People saying things like “oh I know I’m not allowed to say anything, but now I have to speak up”. Elon tampered with the voting machines! They overwhelmed swing states with ads! Gerrymandering! Are they just cribbing from Republicans claims in 2020!?!?",
    "comments": [
        {
            "author": "aethiestinafoxhole",
            "body": "I wonder if they still think showing ID is racist?",
            "score": 101,
            "replies": [
                {
                    "author": "-Erase",
                    "body": "Oh absolutely do you know in California, it’s illegal to ask to see ID in order to vote? Sounds made up, but it’s actually law they recently passed.",
                    "score": 47,
                    "replies": [
                        {
                            "author": "Slainlion",
                            "body": "that used car salesman of a govenor needs to go!",
                            "score": 26,
                            "replies": [
                                {
                                    "author": "muxman",
                                    "body": "That is such a horrible insult. \n\n*To used car salesmen*",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "Slainlion",
                                            "body": "lol true sorry",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Triumph-TBird",
            "body": "And they must be rigging CBS polls showing 54% favorable ratings for the President.",
            "score": 21,
            "replies": [
                {
                    "author": "-Erase",
                    "body": "God republicans couldn’t rig a poll if they tried, and if they are trying, they suck at it 🤣 Also, I live in a swing state so all of the people I know get pulled all the time and the vast majority of the Republicans won’t talk to them on the phone, admit to being a Republican or say positive things about Trump. That’s because they are terrified of being labeled as Republican on some public list and being mistreated like with FEMA",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "jasommer14",
            "body": "Every election is rigged by someone. My current mind set.",
            "score": 9,
            "replies": []
        },
        {
            "author": "hey_ringworm",
            "body": "They started with this within a week after the election. There’s even a subreddit for it- r/somethingiswrong2024\n\nAnd yes, after 4 years of hearing the Dems screech about “election denialism” and “insurrections” it is absolutely fucking hilarious that they are now the ones denying elections and acting insurrection-y.",
            "score": 42,
            "replies": [
                {
                    "author": "_Eggs_",
                    "body": "Don't they know this was DEBUNKED and that this was the MOST SECURE ELECTION IN HISTORY just like 2020? Anyone suggesting otherwise is spreading disinformation, misinformation, dismisinformation, and extreme conspiracy theories.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Whole-Essay640",
            "body": "Dems also believe Americans don’t want Fraud and Waste stopped and prosecuted as appropriate.",
            "score": 7,
            "replies": [
                {
                    "author": "____IIIII___ll__I",
                    "body": "They also believe that a man can be a woman.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Flare4roach",
            "body": "The Left is absolutely pathetic. I really thought they might do some self reflection after losing heartily in November. That lasted about 3 days and then the denial and anger stage set in. They have doubled down on name calling, resistance and conspiracies about the election. \n\nFuck em’ and feed em’ fish heads. I’ve had enough. The time for reaching across the aisle in solidarity has come and gone as far as I’m concerned.",
            "score": 6,
            "replies": []
        },
        {
            "author": "DyngusDan",
            "body": "Can we stop concerning ourselves with what whacked out shit they care about this microsecond? They’re clearly off the reservation and this will literally be a daily thing at this point.",
            "score": 4,
            "replies": [
                {
                    "author": "-Erase",
                    "body": "I mean, I’m trying to, but I always peruse through “all” aka the popular main page, so I’m bombarded with these things. Not to mention many of my friends are liberal and they don’t stop talking about the stuff.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "DyngusDan",
                            "body": "Someone had a good tip awhile back (I don’t remember the details) on how to turn off the Reddit suggested subs that show up in your feed. \n\nIt’s salty leftie tears everywhere and when I comment on some stupidity in the Indiana subreddit I get post history stalked and called out for not living there. \n\nBlame Reddit, woke dumdums.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Boogaloogaloogalooo",
            "body": "Elections are rigged. Ive believed that for as long as ive been politically active. \n\nWhen trump won in '16 it was blatantly rigged for hillary, but they didnt acount for the massive trump grass roots movement. When he lost in '20 it was rigged as well thanks to c19 and the massive mail in voting fraud, they were able to do mass 3am vote dumps that were 90+% biden to steal trumps victory. I watched that election live and went to bed with trump habing won, only to awake and see those ballot dumps that took more votes for biden than there were available votes left. I believe they also stacked it in 24 against trump, but without that massive chunk of eaisly manipulated main in ballots, and a strong dose of believing their own propaganda, they again couldnt out cheat the turnout of the grass roots trump base.\n\nThere was always election fraud, and there will always be going forth untill we crack down on the commonly used routes like main in and electronic ballots. As well as interference and harvesting from election officials.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bramblefish",
            "body": "They think this because this is their method, and they can’t understand the alternative",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 0,
            "replies": []
        },
        {
            "author": "MMANHB",
            "body": "Life is rigged, we are all just a X’s and 0’s - “left of R”",
            "score": 1,
            "replies": []
        },
        {
            "author": "ramanw150",
            "body": "No you don't say",
            "score": 1,
            "replies": []
        }
    ]
}