{
    "title": "This Place Is Becoming Unbearable",
    "author": "Mehnard",
    "subreddit": "Conservative",
    "rank": 12,
    "score": 113,
    "upvote_ratio": 0.85,
    "num_comments (reported by reddit)": 64,
    "url": "https://www.reddit.com/r/Conservative/comments/1inuj6q/this_place_is_becoming_unbearable/",
    "id": "1inuj6q",
    "selftext": "The amount of absolute bullshit coming from the left is making this place unbearable.  Everyone was crying for a change.  And now it's, \"That's not the change we wanted!\".",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Tired of reporting this thread?  [Debate us on discord instead.](https://discord.com/invite/conservative)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Conservative) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "BossJackson222",
            "body": "If it wasn't for some of my hobby subs I like to check out and buy/sell from, I wouldn't be on this platform at all.",
            "score": 19,
            "replies": [
                {
                    "author": "CloudExtremist",
                    "body": "It's a good place to get latest news, but not good enough to engage as they ban you for not following their way of thinking.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "gratefulguitar57",
                    "body": "Same for me.  But even they get brigaded by political bullshit.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok-Willow-4232",
            "body": "Just tune it out. Start blocking users and muting subreddits who decide they wanna act like petulant children having tantrums. The grown ups are in charge and they’re not worthy of our attention.",
            "score": 50,
            "replies": [
                {
                    "author": "njckel",
                    "body": "I started blocking people since before the election, and apparently the max number of people you can block is 1000 lol. Now I gotta unblock someone everytime I wanna block someone else.",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "bw2082",
            "body": "The Canada subs are all deranged. Every post is about fuck the USA lol.  And they even hate the Dems that are supporting them too lol",
            "score": 42,
            "replies": []
        },
        {
            "author": "Device_whisperer",
            "body": "There’s nothing quite as satisfying as forcing them to defend the indefensible.",
            "score": 4,
            "replies": []
        },
        {
            "author": "eeeinator",
            "body": "they are telling people to delete their bank accounts from auto pay for students loans because Elon was there, completely nutty people",
            "score": 7,
            "replies": []
        },
        {
            "author": "GentryMillMadMan",
            "body": "I think it is funny af! I drink it all in. The hypocrisy, lies, and rage is an amazing. These leftist tears rain like confetti on the superbowl.",
            "score": 6,
            "replies": []
        },
        {
            "author": "SDN_stilldoesnothing",
            "body": "I like my dog, cigars and around 5 reddit subs.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Regular-Biscotti4629",
            "body": "Just have fun with it and show them positive vibes",
            "score": 1,
            "replies": []
        },
        {
            "author": "____IIIII___ll__I",
            "body": "Just point and laugh at them. It makes them cry harder.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gratefulguitar57",
            "body": "I had a female friend tell me that Trump was working on a plan to take away women's right to vote.  These people are not mentally stable?",
            "score": 1,
            "replies": []
        }
    ]
}