{
    "title": "Why should men always be the ones to text first?",
    "author": "Psychological_Ad2587",
    "subreddit": "dating_advice",
    "rank": 8,
    "score": 35,
    "upvote_ratio": 0.74,
    "num_comments (reported by reddit)": 132,
    "url": "https://www.reddit.com/r/dating_advice/comments/1jed9th/why_should_men_always_be_the_ones_to_text_first/",
    "id": "1jed9th",
    "selftext": "Why should men always be the ones to text first? In a world that champions equality, the idea that men must initiate every conversation feels outdated. If two people are interested in each other, why should the burden of starting a conversation fall solely on one side? A relationship—whether it’s friendship, dating, or something deeper—should be built on mutual effort. When only men are expected to make the first move, it creates an imbalance where their interest is constantly tested, while the other person can remain passive. A simple text from both sides shows equal enthusiasm and removes the pressure of one-sided effort. So, isn’t it time we move past this old-fashioned rule and embrace communication as a two-way street?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Welcome to /r/dating_advice!\n\nPlease keep the [rules](https://www.reddit.com/r/dating_advice/about/rules/) of /r/dating_advice in mind while participating here. Try your best to be kind.\n\nReport any rule-breaking behavior to the moderators using the report button. If it's urgent, [send us a message.](https://www.reddit.com/message/compose?to=%2Fr%2Fdating_advice) We rely on user reports to find rule-breaking behavior quickly.\n\nThanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dating_advice) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Top-Crab-1020",
            "body": "IMO generally speaking - men decide whether or not they want to marry someone or take a woman seriously/make her his girlfriend. So naturally it is up to the man to pursue not women. We have to be picked.\n\nGenerally speaking - I see that women pursue/chase men they end up getting used for sex. If a man wants to take you serious he will pursue. If a woman has to chase/text first you are more interested than he is and he will end up using or treating you bad.",
            "score": 1,
            "replies": [
                {
                    "author": "I_Dont_Know_jfc",
                    "body": "This is exactly it ^^ \n\nSometimes men feel used for attention or a free meal. Women often feel used for sex or attention. It happens in different ways but both often feel used.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Top-Crab-1020",
                            "body": "Right. Most men will also never reject a woman who goes after them. They will keep her around for something (validation, sex, attention, etc.) until they find a girl that they actually like. Then they will have no problem texting that girl first. \n\nThis all generally speaking ofc there’s always an expectation",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Your_Nipples",
                                    "body": "Well, it's good to hear what I always suspected: those rules were made for absolute doormats and sick manipulative people.\n\nI rejected a lot of women because I'm too lazy when I have absolutely no intellectual interest.\n\nAnd I'm in a relationship right now because my date definitely wouldn't let me go lmao (but her mind is so brilliant).\n\nNo games were involved, no \"who's gonna do this and that first\", no \"you're a man/woman therefore, do the programming\".\n\nI wonder if people are sticking to the script because deep down, they never found anyone worthy enough to break their own stupid rules.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Top-Crab-1020",
                                            "body": "Or the opposite we didn’t follow the rules and got played. So now we stick to the script",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Your_Nipples",
                                                    "body": "And do you think it is working? (genuine question, not some gotcha attempt).",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Tough-Abies1275",
            "body": "Truth is if they like you they’ll text first sometimes and even get annoyed if you’re not responding fast enough. She just don’t like you if you’re always pursuing her.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JuncusRushes",
            "body": "Maybe look for more independent women? I've texted 1st plenty of times 🙂",
            "score": 1,
            "replies": [
                {
                    "author": "Unlikely_Review_5729",
                    "body": "I also text first if I am interested. No point in waiting around for something I want when I can get it myself.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Psychological_Ad2587",
                            "body": "But some girls wait until he text or she never txt him first",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "white_disc_4_holes",
                                    "body": "I generally move on to the next woman in that case. I'm not looking for old fashioned traditional relationship anyway",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "OkIssue5589",
                                    "body": "Yo this lady told you she texts first if she's interested and your response to that is \"but some girls...\" Bruh!!",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "budgiesmuggler",
                                    "body": "They ain't interested then.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Psychological_Ad2587",
                    "body": "I have noticed every girl need first text from u even she interested on you. Why should she not text him first",
                    "score": 1,
                    "replies": [
                        {
                            "author": "JuncusRushes",
                            "body": "Age range?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Psychological_Ad2587",
                                    "body": "20 - 28",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "JuncusRushes",
                                            "body": "Write something like: \"Bonus points if, on top of being pretty, you're bold enough to send the 1st message\"",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "GraveRoller",
            "body": "Because men want the interaction more than women",
            "score": 1,
            "replies": [
                {
                    "author": "nightowl2023",
                    "body": "Winner. Winner.\n\nThis is what men won't admit. You can be a woman in a gym who simply wants to be healthy, look sexy, and feel good.\n\nThen you have 14+ men eyeballing you like a piece of meat every time you go. Constantly get cat called, told how good you look, and hit on. And constantly have guys asking you out and eventually stop caring because you don't have to be desperate.\n\nMeanwhile most men will be the corner visualizing undressing you before even saying hi",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "norwegiandoggo",
                    "body": "This is the truth. Men are on average more desperate for sex and connection than women. You see this everywhere - including dating apps. \n\nWomen also have fewer eggs than men have sperm. So their \"lower supply\" means they have more value on the dating market. It's a supply and demand problem.\n\nAt least, that's the theory coming from some evolutionary psychologists and biologists. Many animals also behave the same as us. With the male having to make the first move and impress the ladies. Paradise birds are a good example. The sex with the fewest \"eggs\" gets to be the selector.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "HidingInTrees2245",
                            "body": "Well, that and the fact it takes us nine months to turn a single egg into offspring.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "norwegiandoggo",
                                    "body": "And a risky child birth and breastfeeding the little one for a year or more. Creating Human babies really demand a LOT of the mom compared to many other animals. It makes perfect sense why women are picky",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Connect-Medicine-875",
                            "body": "You can say \"This is the truth,\" all you want, but there's a huge amount of men out there that don't like to monkey dance for attention. Me included. We can talk about eggs, but we could also talk about the safety and security men provide for survival. Can't have one without the other, and yet, society did a good job placing women on a breeding pedestal when they can't even inseminate without men.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "mason1239",
                                    "body": "It is all society, 2/10 females thinking they’re 10’s because even they have multiple options. If dudes stopped being “simps” things would get better.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "RhymeGoesFlyinnnn",
                            "body": "does that mean women are inelastic in demand too?  \nthe price mechanism is sooo unfair, has to be market failure",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "GraveRoller",
                                    "body": "It’s only a market failure to the men that aren’t getting what they want",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "RhymeGoesFlyinnnn",
                                            "body": "I was just jokingly adding in to the person im replying's use of \"economic\" terms. nothing serious from me here xd",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "norwegiandoggo",
                                    "body": "Correct. Inelastic demand to some extent. \n\nAfter sex, the price mechanism shifts in the male's favor.  Now she's at a disadvantage if he doesn't want to help with the baby. So now she needs him more than he needs her. \n\nSo all in all it probably evens out.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "mason1239",
                            "body": "Lol what? Girls love sex and connection, some might even say more than men. It’s a proven fact. They just want who they want though",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "norwegiandoggo",
                                    "body": "I'm interested to hear why you think so. \n\nIm open to changing my mind, but currently, I think Men want it more. Shown by the fact that they rape at much higher numbers (to get sex), and pay for prostitutes way more often than women (willing to part money). And are willing to risk rejection by hitting on women. Some men literally risk jail time just for sex.\n\nWomen rarely rape, pay for a gigolo, or make the first move. Clearly, they don't want it as much as men. If they did want it more - they would make the first move just as often as men, or more. But they don't. They usually just wait. They might say they want it more - but I don't see it in their behavior. Actions speaks louder than words.\n\nIf you look at dating apps - its like 70% men. If women wanted it just as much as men - the distribution on dating apps would be 50/50. But its not. Because women don't want it as badly so many don't go out and dont go on dating apps. They're okay just living their life and having fun with the girls. \"If it happens it happens\".",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "mason1239",
                                            "body": "They don’t pay or grape because they have so many options they don’t need to. They choose the best option/one that attracts them the most out of the guys who want them and ghost/lead on/reject/friendzone the rest. Even a “2/10” girl can get a guy easy. \nMost still love sex and connection as much as guys if not more but like I said only with who they want",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "norwegiandoggo",
                                                    "body": "Right. That's my point. It's much easier for women to get a guy. And why do you think that is?\n\nBecause men are more desperate for this stuff than women. \n\nYou're just highlighting the result of that. The result of men's higher desire for sex and romantic connection - means it's easier for women to get it. That's the consequence of the imbalance in desire.\n\nIf women wanted it more than men - men would be the picky ones. There would be 70% women on dating apps, and women would generally make the first move. But this is not what we see",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "mason1239",
                                                            "body": "Yeah i agree with what you’re saying the point I was trying to make is that most girls secretly love sex and being intimate just because it’s easier for them to get it doesn’t mean they don’t strongly desire it but only with who the choose.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "OkKaleidoscope9580",
            "body": "Because social stigma has it that if a girl initiates she has no self respect and no value apparently. I was told this by my own mother.",
            "score": 1,
            "replies": [
                {
                    "author": "1bukitbatokstreet25",
                    "body": "A guy I went to college with gave me the same piece of advice. Terrible thing for your mother to say but tbh, a lot of people think this way.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "OkKaleidoscope9580",
                            "body": "I lowkey am tired of it tbh and one reason why I don't tell my mom anymore about me texting guys because all I know is that she is going to say I have no self respect when lately it's just been me tryna nuture a FRIENDSHIP or go from classmates to FRIENDS. But NOOOO apparently if a girl texts a guy, whether she's interested or not, she has no self-respect. She said the same thing when I was with my (then) bf at the time (we're broken up now) but yeah. I do understand there is a line that needs to be drawn like blowing people's phones up and all but just sending a nice good morning/ afternoon text? Also the other side of social stigma is that if a guy texts a girl often it's considered harassment or is seen as annoying and that's probably why guys do not initiate anymore because of these things. This society is so messed up tbh.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Jay100012",
                                    "body": "This society is so messed up it's it basically in hundreds of figure 8s all linked together.  All the rules/norms and every other piece of BS that ppl covey is an attempt to stay in control of situations and other humans.  I tell female friends good morning all the time 1st simply bc I'm awake before they are.  You don't HAVE to be interested in someone of the opposite gender to send them a greeting text.  It's simply being POLITE and CHEERFUL to start the day.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "OkKaleidoscope9580",
                                            "body": "FOR REAL. AND you don't have to like someone of the opposite gender to have their number and just talk to them on a regular basis.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Jay100012",
                                                    "body": "1000% correct.  People stick to these\"rules\" bc they're weak minded unfortunately.  Can't think for themselves.  Unfortunately all of this has gone on for SO LONG(decades/centuries) bc it's EASIER.  Unfortunately it's also destroying society, dating, and life in general.  Another BS one is men and women CANT JUST be friends.  There HAS to be the possibility of sex.  The MAJORITY of these rules are made by average people.  People that need to feel superior and show imagined wisdom and knowledge.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "OkKaleidoscope9580",
                                                            "body": "That OR they messed up during their prime and now are trying to \"protect\" You from it but what they REALLY are doing is PROJECTING their regret on you by saying \"value yourself.\" Or \"let the guys do all the work\" like WHAT??? Honestly my response has been \"these days a guy won't text a woman unless they had sex and it was good and he wants more of it\" which is the sad reality these days",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Jay100012",
                                                                    "body": "That's another stereotype.  My X wife and I were together almost 10 years.  We did get intimate the 1st date/night.  That didn't make me think ANY less of her.  Just that we actually connected.  Or the whole\"value\" yourself.  And ALOT of women are taking that the wrong way.  That it means how much money the guy has to have for you to sleep with him🤦‍♂️🤦‍♂️",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "OkKaleidoscope9580",
                                                                            "body": "Ugh fr. My mom told me to basically never always be readily available for a guy or like not text him back as soon as I get a message from him (this is with my crushes basically). Like I guess I kinda get where she's coming from but like, this ain't the 80s. We're in frickin 2025 after quarantine and an era where society has frickin degraded guys and like goes every little thing they do.m 🤦‍♀️",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Jay100012",
                                                                                    "body": "That's the whole stereotype with messaging.  I saw a video with 6 different women.  Each one was the opposite of the other.  One liked frequent relies, one hated it.  One thought if a guy can message you too quickly he has nothing better to do.  If he takes too long he's talking to too many others.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "OkKaleidoscope9580",
                                                                                            "body": "UGHHHHHH I HATE THOSE STEREOTYPES. For me I just rest on the fact that they're busy and that's it (I'm a college student here and ya know, college work can be a burden and time consuming and stressful so that's what I been tryna to rest on)",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Jay100012",
                                                                                                    "body": "Haha.  It's actually funny you mention that.  A young lady actually just posted in the last week about her bf getting upset one day bc she was ACTUALLY BUSY focusing in her school work instead of prioritizing him.  He wanted to spend time with her and wanted to know how long it would take her to accomplish SEVERAL HOURS of homework.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "OkKaleidoscope9580",
                                                                                                            "body": "Wonder how old he is. He sounds very immature and sounds like he doesn't have a life of his own. If he wants her to prioritize him then MAYBE he should HELP ya know????",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Jay100012",
                                                                                                                    "body": "They were both young.  Less than 25.  And if they want equality and true partnership, yes.  I was in this type of situation.  My X decided she wanted to get licensed as an esthetician(skin care).  Took 9 months.  In that time I supported her in absolutely EVERY way that I could short of going to class for her.  Financial, moral, studying emotional, chauffeur etc.  Because I wanted her to succeed and I learned about skincare in the process.  When I decided to return to college again, she couldn't have cared less☹️  Bc business management and the skills involved were BORING to her.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "OkKaleidoscope9580",
                                                                                                                            "body": "Damn. After all you did for her she decided she didn't have to do anything for you out of the kindness you showed her. Awful",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "Jay100012",
                                                                                                                                    "body": "And thats another problem with ALOT of women in today's society/dating/marriage world.  Its ALL take take take with ABSOLUTELY 0 reciprocation.  Bc women feel they are WORTH the man's expense and they're ENTITLED to EVERYTHING while contributing NOTHING.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "OkKaleidoscope9580",
                                                                                                                                            "body": "Lots of them are like that tbh. In my next relationship I am planning on reciprocating the efforts from my partner.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "Jay100012",
                                                                                                                                                    "body": "Yes 1000000% exactly.  Every so called woman that says she KNOWS what men want, is only thinking about sex and how she will use it as a bargaining tool in every relationship she has to get what SHE wants.  A REAL MAN wants 2 things. A TRUE PARTNER and to work WITH her(not for her) to create a peaceful(happy) life together.",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": []
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "1stthing1st",
                            "body": "I’ve never turned down a woman, because she approached first. If I did turn her down, I was never going to approach her anyway",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Top-Crab-1020",
                    "body": "A lot of men will never reject a woman. A lot men will also use a woman that they don’t even like for sex or use you until something better comes along. \n\nMen aren’t used to getting attention so they will hang on to it",
                    "score": 1,
                    "replies": [
                        {
                            "author": "OkKaleidoscope9580",
                            "body": "That's true as well",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "fitvampfire",
                    "body": "That is exactly what is being dumped into our heads. That we would be acting desperate, clingy, too eager, and not show that we are high-quality. And some men make that seem to be the case. There’s a middle-ground. I think whoever asks for the number, should text first. Just following etiquette rules.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Connect-Medicine-875",
                            "body": "In what realm is showing interest in someone a bad thing? How does that make you 'low-quality'? My mom would not agree with yours.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "HidingInTrees2245",
                            "body": "Yep, a bunch of men believe that too. It’s not just women.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "OkKaleidoscope9580",
                            "body": "I agree!!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Papasmurf10111",
                    "body": "Depends. If you want a traditional lifestyle a lot of girls who are looking for that are going to have this ideology. Traditional means traditional in all way and that includes believing a man should be the pursuer.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "dufus69",
                    "body": "That may be but men like confident women and it pays anyone to go after what they want.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "confused-girl-44",
                    "body": "My mom told me similar things, she actually advised me not to show a guy I'm excited to see him.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "OkKaleidoscope9580",
                            "body": "Oh? Do you mind if I dm you? I am curious now and I would like to have insight from someone else with a similar situation!",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "confused-girl-44",
                                    "body": "Sure, you can dm me",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "OkKaleidoscope9580",
                                            "body": "Just sent you one!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ExcitableSarcasm",
                    "body": "Yup. Totally understand as a man. That's so messed up, and is why the seemingly contradictory message of female empowerment is underscored by mostly traditional coded behaviour. It's a chimera fuck mess of so many generations of propaganda (from all sides, not just traditional crap like this) that's caused this mess.\n\nI think we can all be a little bit more empathetic and kind.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "OkKaleidoscope9580",
                            "body": "For real!!! We're not in the same era our parents were in... so it's time to change things up a bit and that means to be understanding and see things from both sides!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "travelinglist",
                    "body": "Utter bullshit. \n\nMost men appreciate a woman who initiates a conversation. \n\nWhat you are probably talking about is women who are open to have sex on first encounters. Them, guys don't necessarily see s long term relationship with.\n\nBig difference.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "fuertisima12",
            "body": "I want a proactive man. I have no problem texting first but want to see if he's brave enough and interested enough to go first. It's a way of filtering out when you hop on theapp and there's a lot of interest, ionly respond to the men that message me first,  eliminates a lot pf reactive personalities.",
            "score": 1,
            "replies": [
                {
                    "author": "mason1239",
                    "body": "You say this but you don’t actually go after the people that show you so much interest.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "fuertisima12",
                            "body": "Do you know me?  Yeah, of course i still have to be somewhat attracted to them.  But a thoughtful proactive comment can boost a 5 up to a 7 or 8.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "mason1239",
                                    "body": "Whatever",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Unlikely_Review_5729",
            "body": "I didn't realize this was a rule.",
            "score": 1,
            "replies": [
                {
                    "author": "SadderOlderWiser",
                    "body": "Me neither. I text first with many people because I just text when I have something to say.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Psychological_Ad2587",
                            "body": "If u r interested with some boy. But because u r a girl will u text him first or not..",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "SadderOlderWiser",
                                    "body": "Yes. I text first, and this is very shocking, but I will double-text too when I haven’t heard from someone about something and want to check in.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "PlaxicoCN",
            "body": "It will never change OP.",
            "score": 1,
            "replies": [
                {
                    "author": "Psychological_Ad2587",
                    "body": "But why",
                    "score": 1,
                    "replies": [
                        {
                            "author": "nightowl2023",
                            "body": "Because men are naturally competitive under normal biological parameters and women tend to not be. Some someone make moves.\n\nBut most just acknowledge why take the risk when most men will?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "LordyJesusChrist",
                            "body": "Tbh, I only usually text first in the beginning phases. After a few dates once girls are interested, they are always the ones reaching out and all I have to do is assume they’re reaching out because they want to see me and plan the date. Girls who don’t reach out after a few dates… are usually just not that interested so I keep it moving to high interest women only",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "BraveProgram",
                            "body": "Most guys are fkn too horny and end up acting like simps. Too many men give free attention/resources to women, so women will always \"get picked\" just by standing around looking pretty.\n\nIn this case, this is actually a guy issue, not a woman one. If you want women to be easier/put in more effort, tell other dudes to stop being fkn simps. \n\nIf dudes collectively pulled attention from women for even a year, women would die of attention starvation and would eventually concede and even out as far as hitting on guys goes.\n\nSimply put, women dont have to do anything because men will eventually give her attention. This doesnt mean some women dont hit on men. Plenty of dudes get blatantly hit on. But it's 1 out of ever 100 people, with the other 99 being guys.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "No_Anteater8156",
            "body": "Conventionally, women are choosers, men are chasers. \nIt’s just the way it is. If you don’t text her first, someone else will, game is game",
            "score": 1,
            "replies": []
        },
        {
            "author": "iceybetty",
            "body": "I will instantly like you a bit more when you are the one who reaches out first",
            "score": 1,
            "replies": []
        },
        {
            "author": "whydoyou_caresomuch",
            "body": "Maybe stop surrounding yourself with people who think like this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JeffreyPetersen",
            "body": "Don't you think you're putting a little too much weight behind being first to text? You say relationships must be built on mutual effort, but if the woman texts first, then she's putting in more effort, right? So now it's not even again. There's no way to make a single interaction perfectly balanced.\n\nHow much effort is really involved in sending a 20 second text? You put enough effort into this post to send first texts to 10 different women you're interested in.",
            "score": 1,
            "replies": [
                {
                    "author": "Elena_Designs",
                    "body": "More mature than so many of the other comments here. Who cares who texts first? It’s really not important. If neither man or woman can be bothered to do something as small as text somebody and not keep score about dumb things like that, they have no business dating at all! What do they think it’s like in person? Both people have to give, and both receive. I’m a woman, and I’ve definitely texted first and sent the first message before. It absolutely does not matter.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Connect-Medicine-875",
                    "body": "Its not individual effort, it's collective effort. The point of the post is about the collective of women making it a point to not message first, not one person...",
                    "score": 1,
                    "replies": [
                        {
                            "author": "JeffreyPetersen",
                            "body": "But you're not dating a collective of women. You can't try to balance what some imagined collective does with your personal relationship. \n\nThe bottom line is that if you like a person, you should text them, and if people aren't texting you, maybe you just haven't made a good enough impression on someone that they want to text you.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "confused-girl-44",
            "body": "I'm afraid that if I text first a couple of times, the guy I'm texting with will think I'm needy. I've been told that men pull away if a girl shows interest.\n Is it really true? Do you think it's clingy if a girl randomly texts you, let's say once a week? Will it change how you feel about her?",
            "score": 1,
            "replies": [
                {
                    "author": "NeKofi",
                    "body": "Not at all! If I had an ongoing thing with you, once a week would reassure me to some degree.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "gttingbettrevrday",
            "body": "I've gotten the first text many times. Especially when I meet them on the apps.",
            "score": 1,
            "replies": []
        },
        {
            "author": "The_Brilliant_Idiot",
            "body": "Supply and demand",
            "score": 1,
            "replies": []
        },
        {
            "author": "AyaTakaya007",
            "body": "This ain't a rule if you're both on the same level of 'wanting' a relationship with eachother",
            "score": 1,
            "replies": []
        },
        {
            "author": "Weekly-Tomorrow8423",
            "body": "I agree with what you have said but the reality is if women start texting first lot of men still consider it as desperate or too much interested and they pull away as they have been conditioned that a high value women need to be chased.So your humility and initiative can backfire sometimes",
            "score": 1,
            "replies": []
        },
        {
            "author": "mason1239",
            "body": "If they’re into you she will text you first sometimes, call you randomly sometimes ask to hangout sometimes I’m not saying if she doesn’t she isn’t into you but the interest level is definitely lower if you always have to",
            "score": 1,
            "replies": []
        },
        {
            "author": "Slim_Shitty_805",
            "body": "It's a double standard dude and it's been that way since the existence of our species. Deal with it. In some cases we get the short end of the stick and in others women do. That's life. It's not going to change in our lifetime. You only have a few precious seconds on this earth so don't waste energy on this as it's not something you can change.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tea_Time9665",
            "body": "They shouldn’t.  If u don’t wanna then don’t.",
            "score": 1,
            "replies": []
        },
        {
            "author": "muarryk33",
            "body": "Find a lady that’s into you and they’ll text you when they need or want you too.",
            "score": 1,
            "replies": []
        },
        {
            "author": "antisocialoctopus",
            "body": "They aren’t, always. \n\nWhy does it happen that way? Bc people are taught that and self perpetuate it. \n\nExample: you don’t like that you have to text first, but you do it anyway, keeping the cycle going, bc if you don’t, some other guy will",
            "score": 1,
            "replies": []
        },
        {
            "author": "___Catwoman___",
            "body": "To each their own. You can't force a shy girl to push herself to text first. And you can't force a brave guy to wait, if he's interested he'll text. This is life; you keep dating people until you find one who compliments your personality i.e. a guy who likes to feel wanted paired with a girl who likes to take initiative, or vice versa. Find your match. \n\nAlso, if all girls texted first, maybe some guys are put off by the girl pursuing.... So really you can't put 1 gender inside 1 bucket. If you want her to text you first, and she doesn't, move on. The next girl could be your type.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MindlessTree7268",
            "body": "People have actually given me this advice. They've told me that I should never ever text the guy first, if he wants to text me he will. Because men are natural hunters and pursuers, and if they're interested, they will make sure to pursue you no matter what. \n\nBut now, I actually think this is kind of bad advice. Because there are so many men who are shy or have confidence issues, and just because they're not initiating conversations doesn't mean they're not interested. I have a very extroverted friend who pursued her husband. He actually had a big crush on her early on, but because he was so shy, he was afraid of getting shot down and didn't pursue her. Once they actually were in a relationship, it was more mutual, but she was basically the one chasing him at the beginning. And now they both say they're glad she did because if she had left it all up to him like people advise women to do, they never would have gotten together.\n\nHonestly, I think whatever gender you are, if you want to text the person, just text them. If they're the right person for you, they're not going to be turned off by you texting them when you feel like texting them.",
            "score": 1,
            "replies": [
                {
                    "author": "Top-Crab-1020",
                    "body": "The rule still applies because most men tend to not be as shy as women. Yes there’s expectations but majority of men will eventually approach if they are genuinely interested. The majority of men are okay with making the first move. \n\nOn the flip side most men will not reject a woman who approaches them. Which is not a good thing for the girl because how can you even tell if he genuinely likes you or not.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Kitchen-Fee-1469",
            "body": "Are you talking about when they’re in a relationship? Or when it’s just 2 people getting to know each other?\n\nIn relationship, it usually goes both ways. There’s not as much pretense anymore (or any at all).\n\nInitially…. some women do (even conventionally attractive ones). But it’s rare. To put it simply, it’s because they don’t have to, and because it’s been the norm.\n\nWomen all around the world apply for jobs or colleges or talk to strangers. They face rejections too for those jobs (probably more than men do). It’s because they NEED the jobs. \n\nLet’s be honest here. If you were a conventionally attractive man and this whole thing was swapped, would you pluck up your courage and express your interest at the risk of rejection when multiple good looking women ask for your numbers everyday on the streets and hundreds of bombshells are on Tinder sending you thirsty messages everyday?\n\nMen and women aren’t that different. Many issues “should” be fixed and we should strive to be better but the root cause is often very biological. Men - violence, SA, war and etc. We should fix it sure. But if women were the ones in power (authority and physically stronger), they’d do the same too.",
            "score": 1,
            "replies": []
        },
        {
            "author": "tugboat7178",
            "body": "Equality or not - human mating strategies will always follow the path we’ve adapted to over millennia. \n\nWomen are the advertisers, men are the “sales pitch” givers. Women display they are sexually interested, and then men compete to win sexual opportunity. It is then her option to accept or not. \n\nTherefore, it is men who must make that first move, and then her decision or not to accept and move forward. Most of the animal kingdom works similarly but not all. \n\nNo amount of 21st century attempts at equality will trump our biological/sexual evolution.\n\nEdit: yes, I know there are exceptions to the rule.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sunshroom_Fairy",
            "body": "Damn, straight people are wild.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Awkward_Ad_8525",
            "body": "Because if a man isn’t the chaser he’s a weak man and no woman wants a weak man.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BelmontIncident",
            "body": "I'm confused about \"old fashioned rule\" because I'm under 40, personally older than cell phones let alone texting, and women do text me first.",
            "score": 1,
            "replies": []
        },
        {
            "author": "YourMajesty90",
            "body": "If she doesn’t initiate she doesn’t like you. Trust me. When a woman likes you, you’ll know.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FakeBeigeNails",
            "body": "Omg I can’t believe “equality” is being watered down to who *texts* first. This entire world is so mentally fucked.\n\nJust date someone who texts first, too. Or tell the woman you’d like her to text first, too. \n\nMy ex bf had to tell me that he likes good morning texts and bc I woke up before him, it’d be nice to have one when he wakes up. So I did. So pick: Speak up or find another girl who will do it without you having to ask. There. Solved your problem.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sick-dying-girl",
            "body": "if you don’t want to, then don’t. but someone else probably will. and that’s okay.",
            "score": 1,
            "replies": []
        },
        {
            "author": "These_Hair_193",
            "body": "I've texted first many times as well.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FeralTribble",
            "body": "Because women don’t have to. Women don’t have to do anything first in this dating environment. They don’t even have to put in equal effort and they know it.\n\nIt sucks that dating has come to this",
            "score": 1,
            "replies": []
        },
        {
            "author": "themagicklizard",
            "body": "So that the women don’t have to do anything",
            "score": 1,
            "replies": []
        },
        {
            "author": "BillNecessary896",
            "body": "If you truly like someone… You should just go for it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ExcitableSarcasm",
            "body": "Look. The world champions equality, but not in all fields. Dating is one of those fields. So what? The world lied to you what are you going to do about it? The choices are:\n\n1. Try to change the world\n2. Install a dumb-ass field and just go along with it, and practice so that it doesn't bother you\n3. Moan about it and be bitter\n\nI'm not kicking you while you're down. I used to so overly focus on #1, that it just killed my own dating life. Sorry bro, that's the choice for most men. The top % of men? Don't have to try. But statistically, neither you or I are in that top %. From the tone of my answer, you can probably tell which I choose now. In a world where dating is increasingly broken because we've (men and women) been exposed to constant socio-economic propaganda, if you don't seize your fate by the throat and roll with the punches, you're likely going to get swept up in the zeitgeist and end up lonely and (rightfully) angry. \n\nYou can't expect the world to fix it for you. Great if this fixes itself! But if not, you're fucked. What you can change for certain is you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AssignmentNo7757",
            "body": "Women are weird and gross about this shit. They delude themselves into thinking a man should do all manly things, but still demand equality. Chasing your partner is a man thing, so they don't do it. Simple as.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LinesLies",
            "body": "You don’t have to message her first, but someone will. So unless she is super into you, she’ll talk to the guy who messaged her first.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OkIssue5589",
            "body": "I don't know about these expectations or whatever. I'm not on dating apps but guys do ask me for my number IRL. If I give you my number and you just text \"hey this is X; here's my number\" and then go quiet;  I'm going to delete you. Why ask me for my number if you expect me to be the one to start the conversation? You approached me not the other way around.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BeneficialDog22",
            "body": "In my very limited experience, ladies want to be wanted, or they're trying to be safe when judging what kind of person you are. Or they like you, but not \\*that\\* much. ofc my experience is different than someone else's.",
            "score": 1,
            "replies": []
        },
        {
            "author": "budgiesmuggler",
            "body": "I can't help myself, if I like someone, I am finding excuses to text them. Sometimes even to my own detriment where I come across as too keen and the guy I'm interested in gets the ick from me not playing it cool. \n\nAlmost every woman I know chases guys they really like - but all of them also have multiple dudes they're lukewarm on, vying for their attention, who they give dry responses to because they \"don't want to be mean\", even though I think leading people on is meaner than just being honest and saying they're not interested.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pale_Lavishness1057",
            "body": "If he doesn't text first then he's not interested. He needs to should show it. When women do it it's usually not well recieved and seen as low value.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lifeisabeach007",
            "body": "It's equality until it's a disadvantage",
            "score": 1,
            "replies": []
        },
        {
            "author": "1stthing1st",
            "body": "Apparently, women are becoming more open to make the first move now. Since less guys are doing it these days.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Moonlight_Mirage",
            "body": "I actually most likely over 90% of the time send a message to a man that I find attractive 😉 most of the messages I get a from men are ones I'm not into anyway so I'm the one who mostly sends the first message ✌",
            "score": 1,
            "replies": []
        },
        {
            "author": "iawj1996",
            "body": "I don't know what kind of women you've dealt with but when a woman is truly into you, she'll take initiative texting first most of the time. Trick is to not be too open and predictable. Let them come to you. Women are like cats, if you let them be, they'll eventually come to you on their own, but if you chase them, they lose interest and flee. Us men however are like dogs, always wanting and accepting attention and cuddles. You need to treat women like cats. Let them come to you, and when give quality attention and conversation when they do come, and don't entertain them for too long so to keep them on their toes. I don't care what some people say, but women, good hearted or bad does this subconsciously. Women follow their feelings, and when they're uncertain about you, when you give off an uncertain, unpredictable and mysterious vibe, they automatically gain more interest and respect. But when you're always initiating, always loving(not saying to be unloving but u should hold back on affection and attention) always predictable, they always end up losinh interest subconsciously, whether you're dating them, in a relationship with them or even married to them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Prestigious-Solid822",
            "body": "Because cosmopolitan magazine told us not to be too easy 😂😂",
            "score": 1,
            "replies": []
        },
        {
            "author": "Vlad_The_Great_2",
            "body": "A woman that actually likes you ‘might’ text first, but it won’t be every time. The problem is there are 20 guys behind you willing to talk to her if you mess up or ‘bore’ her. She knows that and puts in minimal effort in communication and keeping you happy. Or she doesn’t know this, and this has always been how she communicated with men. A lot of woman are conditioned to think a boyfriend is a personal butler rather than a person that enjoys her company.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mojoburquano",
            "body": "Women have to carry around a vagina 24/7 and risk all of the discrimination, potential for sexual violence, and lower pay for the same work that is attached to womanhood. Men can text first, open doors, and pay for dates right up until we fix all of THAT. \n\nHaving said this, I’ve texted quite a few men first. Often I’m the only one who can initiate contact because I didn’t give my phone number when we met. \n\nMen kill women. I know that most men don’t. I’m sure that the vast majority of men who go to the trouble of reading this have no desire to be violent against any woman. But understanding that the women you come into contact with have no idea if you’re a safe person to be around. If you initiating conversations and buying dinner is all it takes to lure them out of the safety of their homes, take that as a compliment. You’re probably pretty cute.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KnicksTape1980",
            "body": "Because they like to make the rules that only benefits them. You can't have it both ways. If you want equality, women should take the initiative also.",
            "score": 1,
            "replies": [
                {
                    "author": "Disastrous_Arugula_2",
                    "body": "women didn't make the rule patriarchy did...we were told as girls that we shouldn't call first or make the first move because then we could be called \"fast\" or \"cheap\" it was literally a rule in my family that we couldn't call a boy first, I have 16 girl cousins and they all also had the same rule. Again we didn't make them we just followed them and probably some women passed it on to their girls as well",
                    "score": 1,
                    "replies": [
                        {
                            "author": "KnicksTape1980",
                            "body": "It doesn't matter who made the rules. It's 2025 now. The bottom line is if women want equality, take the initiative. It can't be a one-way street.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Disastrous_Arugula_2",
                                    "body": "you are the one who brought up rules...so apparently it does matter? Patriarchy is systemic you can't just say, \"forget everything everyone has said for hundreds of years\" and everything is now equitable, it takes time and I think if you look at how gen alpha is doing they are breaking a lot of those systemic rules, it just takes time",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}