{
    "title": "How can i start a fwb with a friend?",
    "author": "SharinganUchiha",
    "subreddit": "dating_advice",
    "rank": 19,
    "score": 5,
    "upvote_ratio": 0.58,
    "num_comments (reported by reddit)": 34,
    "url": "https://www.reddit.com/r/dating_advice/comments/1jejrxy/how_can_i_start_a_fwb_with_a_friend/",
    "id": "1jejrxy",
    "selftext": "I(19M) have been friends with this girl(18F) for a long time now, and wanna try a fwb situation with her. How do you go about letting her know or telling her without it being weird or creepy?\n\nEdit: Bit of context, we lost contact for a long time due to my phone number getting changed and moving away, however we spotted eachother in public and reconnected. Theres no romantic connection but we’re both horny and very curious",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Welcome to /r/dating_advice!\n\nPlease keep the [rules](https://www.reddit.com/r/dating_advice/about/rules/) of /r/dating_advice in mind while participating here. Try your best to be kind.\n\nReport any rule-breaking behavior to the moderators using the report button. If it's urgent, [send us a message.](https://www.reddit.com/message/compose?to=%2Fr%2Fdating_advice) We rely on user reports to find rule-breaking behavior quickly.\n\nThanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dating_advice) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "levelcontainer",
            "body": "This sounds like a train crash waiting to happen",
            "score": 1,
            "replies": [
                {
                    "author": "OldAssDreamer",
                    "body": "Michael Jackson eating popcorn meme",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Apprehensive_War6661",
            "body": "If she doesn’t seem interested in having sex with you, she prob doesn’t want to",
            "score": 1,
            "replies": []
        },
        {
            "author": "Proud_Way7663",
            "body": "Is there any romantic connection between you two at all? This isn’t something you just start with a friend.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HerSpirit94",
            "body": "To be honest this sounds like a mess. You can't just decide to be friends with benefits with someone unless they agree to it first. And it will most definitely make things weird. I don't recommend.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Retracnic",
            "body": "I think you may be taking the \"friend\" part of FWB a bit too literally.  FWB usually begin as an attempt to date, but despite there being sexual chemistry, there's not a strong enough romantic connection to move on to full relationship.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jjvicious6124",
            "body": "Good luck have fun and don’t die.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wonderful-Reality223",
            "body": "How do you know that there’s no romantic connection & that she’s also horny and curious? \n\nLike others have suggested, she has to bring it up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Anteater8156",
            "body": "This transition only works if the woman initiates it. You make a move and you lose a friend",
            "score": 1,
            "replies": []
        },
        {
            "author": "GIRTHquake5000",
            "body": "I'd be insulted if my long time\" friend \" made it known he only lusted after my body, but wouldn't date me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Unusual-Shopping1099",
            "body": "Do you have some kind of insight as to if this friend has a sexual but not romantic attraction to you?\n\nDo you value her friendship?\n\nIf the answer to the first question is no, and the answer to the second question is yes, I would advise against trying.",
            "score": 1,
            "replies": []
        },
        {
            "author": "van-kreiger",
            "body": "That's gonna be entirely up to her. If she wants that, she will let you know somehow.\n\nI 10000% guarantee that if you are friends, and you approach her with a sexual ulterior motive and she doesn't feel the same, that is going to end your friendship straight up.\n\nI also feel that you are missing some vital information in your post. Are you flirty? Is there sexual tension? Has she expressed any hints or suggestions that you should be fwb, or even be sexual with each other?\n\nTrust me, as much as the Andrew Tates of the world don't want to admit it, women have the power when it comes to sex whether you like it or not. Approach this situation with caution.",
            "score": 1,
            "replies": []
        },
        {
            "author": "solarpropietor",
            "body": "“Ayo gurl, let me put my penis in that damn holes???”\n\n\nDo it in front of her dad while you’re at it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ZTH16",
            "body": "Tell her you don't like or respect her enough to date her but you just want to use her body as a cock sleeve.\n\nOh, wait...you wanted to know how to ask her, not to know what you're actually doing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mithraic76",
            "body": "Dude whaaat?  You are likely about to lose a friend, but the conversation should be clear and no manipulation or bullshit:  ‘I want to be friends with benefits, is that something you’re interested in?’ If she says anything other than a firm yes - go no further.  This isn’t a negotiation.  And you’ve likely lost a friend.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SheGotGrip",
            "body": "Not how FwB comes about. Sounds like trouble. Move on... you don't know anything about her life now, and you're not even friends. Who knows what either of you would be getting into.",
            "score": 1,
            "replies": []
        },
        {
            "author": "InstanceLoose4243",
            "body": "This is nit a good decision at your age. Get your shit together and worry about women later.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mason1239",
            "body": "Build attraction instead of relationship start being more cocky/playful",
            "score": 1,
            "replies": []
        },
        {
            "author": "bananaramaworld",
            "body": "I’d be pretty put off if one of my platonic friends tried to say he wanted to fuck me but not date me… idk seems weird. Not very nice I guess.",
            "score": 1,
            "replies": []
        },
        {
            "author": "letgosardi",
            "body": "Don't do something that can ruin the friendship and trust me it will, my childhood best friend tried that w me and ruined everything",
            "score": 1,
            "replies": []
        },
        {
            "author": "Anemone978",
            "body": "If you aren't romantically into her why is it you want to fuck her? I can never understand what men think.. like is sex that important?",
            "score": 1,
            "replies": []
        },
        {
            "author": "alwaysdistracted99",
            "body": "If it’s long time friend chances are it’s to late for fwb",
            "score": 1,
            "replies": []
        },
        {
            "author": "Infamous_Turnover_48",
            "body": "Honestly just ask them about it, but be clear that if they reject you that you won’t get upset and butt get out in your feelings. No feelings, just sex.",
            "score": 1,
            "replies": []
        },
        {
            "author": "duck7duck7goose",
            "body": "When you’re fwb, you can’t actually be friends. You don’t text, hang out, phone calls, etc. you only text to set up sex, have sex, then don’t talk again until you wanna have sex again. You will ruin the friendship if you try to be fwb. Someone always ends up getting feelings and gets hurt.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rcoffey100",
            "body": "I think she’ll start it if she wants to",
            "score": 1,
            "replies": []
        },
        {
            "author": "beautiful2029",
            "body": "just beat your meat..... FWB culture is wild and not worth it. what happened to intentional dating. just beat your meat",
            "score": 1,
            "replies": []
        },
        {
            "author": "sex_drugs_polka",
            "body": "Tell her she looks hot",
            "score": 1,
            "replies": []
        },
        {
            "author": "healermoonchild",
            "body": "You don’t just ask something like that.  Invite her to your place to watch a movie and see if she’s DTF. If she declines then there’s your answer",
            "score": 1,
            "replies": []
        },
        {
            "author": "Global-Wing-311",
            "body": "She would have probably already asked if that's what she wanted.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Savings_Ferret_7211",
            "body": "Lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Niftee",
            "body": "Lots of good advice here, but the one that stands out is you have to be cool losing a friend over it.\n\nYou can be blunt or direct without being creepy. Hey, I find you really attractive and was wondering if those feelings are mutual? \n\nIf she responds omg no, or ew no, no way or even just a nah I’m good. Just back off and be like oh my bad I misread the situation, I thought there was something but there isn’t and that’s cool. Then change the subject to something obviously a context change. Like how about that weather huh? And laugh it off and prepare to be ghosted.\n\nCreepy comes from reading too much into a situation, and acting weird and over the top or disrespectful of boundaries. Not for having regular human hormones and feelings and asking if those are shared.\n\nYou become a creep when you make her feel weird or uncomfortable about saying no. I’ve had more casual flings off of jokes and casual banter than actual dates of we’re being honest.\n\nOn the other side of that I’ve ended up ghosted for suggesting it. \n\nI’m also still friends with many of the people I had fwb situations with. So creepy is how you approach the situation, how you handle rejection or acceptance. It’s not just innately creepy to let someone know in a respectful way you find them attractive.\n\nGood: Hey this thing has been on my mind a bit, I think you’re really attractive and was wondering if the feeling is mutual?\n\nHer: No I’m sorry I’m not interested.\n\nYou: oh ok cool, I misread the situation hopefully I didn’t make you feel uncomfortable. How about that weather eh??\n\nBad: You’re so hot I want to bring you back to my place and bang your brains out, the things I would do to you.\n\nHer: ew fucking gross what?\n\nTreat females like humans (because they are) and you’ll have a lot more luck.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HandDownManDown11",
            "body": "Ask a friend to ask her",
            "score": 1,
            "replies": []
        },
        {
            "author": "BRZRKRGUTS",
            "body": "Brah unless she initiates that is a gamble, you have to actually have the foundation down. Then she has to be crushing in a sense before you can even pull a move like this. If you just go for the homerun you will be denied simply because it will take her by suprise. You have to have her thinking about you a lot to pull this power move.",
            "score": 1,
            "replies": []
        }
    ]
}