{
    "title": "21F and never had a boyfriend",
    "author": "Effective-Error6616",
    "subreddit": "dating_advice",
    "rank": 14,
    "score": 6,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 59,
    "url": "https://www.reddit.com/r/dating_advice/comments/1jelsvu/21f_and_never_had_a_boyfriend/",
    "id": "1jelsvu",
    "selftext": "Yes you read that correctly- I am a 21 year old female who has never had a boyfriend before; let alone hold a guy’s hand. I go to the gym and lift weights (very big gymrat), know five languages, study a respectable field, and have great friends. So what’s the problem? Am I supposed to be making a move on a man? (I believe in being chased after, not being the chaser- old fashioned I know but that’s the way I am). Or are men just scared? I am tired of hearing the “it’ll happen when you least expect it” because at this rate, it will never happen. I’m starting to get insecure because I think guys think I am ugly. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Welcome to /r/dating_advice!\n\nPlease keep the [rules](https://www.reddit.com/r/dating_advice/about/rules/) of /r/dating_advice in mind while participating here. Try your best to be kind.\n\nReport any rule-breaking behavior to the moderators using the report button. If it's urgent, [send us a message.](https://www.reddit.com/message/compose?to=%2Fr%2Fdating_advice) We rely on user reports to find rule-breaking behavior quickly.\n\nThanks!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/dating_advice) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "JohnRyder69",
            "body": "Guys don't approach anymore \n\nhttps://datepsychology.com/risk-aversion-and-dating/",
            "score": 1,
            "replies": [
                {
                    "author": "Effective-Error6616",
                    "body": "Wow these are some crazy stats! Thanks for the read.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "JohnRyder69",
                            "body": "No problem. I keep this study on hand specifically for these types of posts.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "No_Mercy_4_Potatoes",
                            "body": "And a learning opportunity. If you like a guy, just go and talk to them.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Asleep-Room-2873",
            "body": "I hate to hear the same “when you least expect it” thing. I think you are just a paranoid. You have a lot of years ahead of you. Someone will appear and see you and chase after you. Mark my words, it will happen soon. Just give it time.",
            "score": 1,
            "replies": [
                {
                    "author": "Effective-Error6616",
                    "body": "Thank you :)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheKingOfFlames",
            "body": "Men are usually treated like shit and blasted on TikTok for even approaching to start a conversation so we stopped doing that to protect our peace. Men are also oblivious to hints, and even when we notice them, we are scared of misinterpreting them. If you want a guy to approach you, you have to make it obvious that you want HIM to approach specifically. Or just start the conversation first and introduce yourself. Men are very receptive to new conversations unless we’re deep in a task or have headphones on.",
            "score": 1,
            "replies": [
                {
                    "author": "Effective-Error6616",
                    "body": "I think I said this to someone else, but I apologize on behalf of the shitty females😭 but I will try to put myself out there a bit",
                    "score": 1,
                    "replies": [
                        {
                            "author": "TheKingOfFlames",
                            "body": "Luckily my first gf was a good one and my standards have been set high because of her. If you’re not like the crappy girls, then consider yourself lucky. Men will appreciate you like they found gold if you’re not toxic like a lot of girls are. And good luck with the guys! Most dudes are happy to be approached, and the bar has been set so low that small gestures of appreciation are considered rare and highly valuable. You got this :)",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "NotUsedUsernameYet",
            "body": "There is nothing wrong with not having boyfriend at this age, you are still very young.\n\nAre you in college? Where do you expect guy to reach out to you? I assume you are not on apps?",
            "score": 1,
            "replies": [
                {
                    "author": "Effective-Error6616",
                    "body": "I am in college! Not sure where I expect a guy to reach out to me. Hopefully the guys in my class don’t reach out - they’re all nerdy!\nI am not on the apps. I want to try to find a boyfriend in person. I’m also scared - dating apps can be dangerous!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "NotUsedUsernameYet",
                            "body": "Wait, you do not want any guys in class to reach out to you. You are not on apps. How exactly do you expect a guy to materialise in your life? Just knock on your door randomly?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Effective-Error6616",
                                    "body": "I do go to the gym, so either there, or when I’m out and about with my friends- either studying (I’m usually studying at a cafe of some kind) or at a restaurant/bar.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "NotUsedUsernameYet",
                                            "body": "Men are told to never approach women in gym. It’s one of biggest no-no after a workplace.\n\nMany (not all) men don’t approach women who are spending time in a group of friends. Many (not all) women asked us to stop doing so, plus nobody wants to be judged by a group of women.\n\nWhat other options to we have left?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Effective-Error6616",
                                                    "body": "I didnt know these were “no-nos” lol- especially the gym one. Do you have any advice on how I can meet someone in person?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "NotUsedUsernameYet",
                                                            "body": "At your age, it’s probably college - either class or some other activities there. Sorry, I am too old for college and studied abroad so I can’t give you specific examples.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Effective-Error6616",
                                                                    "body": "Thanks for the advice!",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Mljornir",
                                                            "body": "Go to a Cafe or any place where you can do an activity (besides the gym), odds are that at least one dude will approach you based on what you've said about you.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Effective-Error6616",
                                                                    "body": "Would it be better if I went by myself to make myself seem approachable?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Mljornir",
                                                                            "body": "Maybe, but I feel that if you were to go to an activity in a small friend group (you and two other friends) one dude might approach you. Or you can try the solo approach (coming from a young dude, that might work also). But I would advice you to do the activity :).",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Effective-Error6616",
                                                                                    "body": "Thanks for your help!",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Mljornir",
                                                                                            "body": "Always glad to help",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "purpleamory",
                            "body": "I met my college GF at a volunteer group/event.  \n\nI wasn't going specifically to meet women, just for the charitable aspects and general social nature of it.  But in retrospect, it was kind of a perfect environment for dating.  There were about 40 of us, about half men, half women.   There were various social activities the group did (beyond getting to know each other naturally as we did volunteer work), including a dance.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Effective-Error6616",
                                    "body": "That’s amazing! I love it!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "HihiHahaHoHoo",
            "body": "I tried and they (females) always ghost or disrespect my time, money or effort. So now I really don’t wanna date or approach a woman.\n\nYou might be a nice lovely lady but all those toxic ones are changing out mindset when they wanna play stupid games",
            "score": 1,
            "replies": [
                {
                    "author": "Effective-Error6616",
                    "body": "Oh gosh - on behalf of the females, I am very sorry you had to deal with them. That behavior is toxic af! Where do you find the women to talk to?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "HihiHahaHoHoo",
                            "body": "Mostly hinge and one in university who was using me as a free uber. \nNo worries you don’t have to be sorry",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "henniehiggins84",
            "body": "I didn’t have my first kiss until age 25 and even that I regretted. He’d just eaten French onion chips. Keep your standards high. There is no rush to experience things that might ultimately prove meaningless.",
            "score": 1,
            "replies": [
                {
                    "author": "LossBig9506",
                    "body": "not the French onion breath😭😭 You’re a survivor girl.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "henniehiggins84",
                            "body": "I am, thank you. 😂 Again why I stress the build up and the results are not always equitable.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Effective-Error6616",
                            "body": "I read this and thought the same thing😭 you are a survivor",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "intrepid_skeptic",
            "body": "That’s actually fine. So serious. I didn’t have a girlfriend until after I graduated. The college environment really makes it feel like you have to have someone. It makes you feel like you’re failing at a social thing. The reality is it just doesn’t need to be that way. I know it really feels like it sucks, and I’m sorry you’re going through that. \n\nI think the idea of having a girlfriend in college just sounded nice because it felt like a social requirement.",
            "score": 1,
            "replies": [
                {
                    "author": "Effective-Error6616",
                    "body": "I think this is a great perspective- thank you!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Embarrassed-Tune9038",
            "body": "It is amazing to me, that a woman can be quiet the go getter in school and the workplace but when it comes to romance and finding a guy she balks at being assertive and her idea of romance is her being as passive as the grass.",
            "score": 1,
            "replies": [
                {
                    "author": "Effective-Error6616",
                    "body": "I can’t tell if this is an insult🤣",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fancy-Cry23",
            "body": "May I suggest that the men might be intimidated by your potentially strong and large traps?",
            "score": 1,
            "replies": [
                {
                    "author": "Effective-Error6616",
                    "body": "this made me LOL",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ZookeepergamePure429",
            "body": "There is nothing wrong with you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OkIssue5589",
            "body": "I got my first BF at 25. Don't rush it. It will happen.",
            "score": 1,
            "replies": [
                {
                    "author": "Effective-Error6616",
                    "body": "Thank you for the encouragement :)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Vast_Cricket",
            "body": "Try online dating since you are not so approachable being shy;",
            "score": 1,
            "replies": [
                {
                    "author": "Effective-Error6616",
                    "body": "I thought about that, but people have bad experiences (catfishing, guys only wanting hookups, etc)",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Ok-Opportunity7631",
                            "body": "As someone who met her bf on a dating app (Hinge) it was a good experience for me! You just have to know what you are looking for and it can be pretty good :) Also don't keep up too many conversations with guys at once easy to burnout that way. But I understand apps aren't for everyone.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "TAacountpeople",
            "body": "Don't have much time for a long answer, but you are ONLY 21!",
            "score": 1,
            "replies": [
                {
                    "author": "Effective-Error6616",
                    "body": "I know!! Somehow still feel behind on the dating train though",
                    "score": 1,
                    "replies": [
                        {
                            "author": "TAacountpeople",
                            "body": "I am almost 27M and don't have much dating experience. I don't approach women often for the fear of being rejected",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Effective-Error6616",
                                    "body": "I’m sorry you have that fear :( I hope you know that as a woman, if you came up and talked to me I think it would be super dope!",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "TAacountpeople",
                                            "body": "Thank you! Working on that.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "LossBig9506",
            "body": "Coming from a 22F who has also never had a boyfriend, you are not the problem. I’m convinced that hookup culture and social media has made it more difficult to find men who have good intentions. I’ve tried putting myself out there on dating apps but find myself disappointed every time a guy asks me on a date and then proceeds to not plan it. Like what was the point in asking in the first place? I know a lot of people who are around our age and haven’t had a boyfriend/girlfriend. Don’t feel bad because you haven’t been in a relationship. Having standards weeds out a majority of men but I promise you the right guy will come along. There is a lot to enjoy being young and single. I hope this helps:)",
            "score": 1,
            "replies": [
                {
                    "author": "Effective-Error6616",
                    "body": "You’re so sweet and encouraging! Thanks so much :)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "mailman978",
            "body": "Maybe you're not picking up on when a guy is flirting with you",
            "score": 1,
            "replies": [
                {
                    "author": "Effective-Error6616",
                    "body": "Actually this is probably true (yikes!) any signs? I mostly think guys are just trying to be my friend",
                    "score": 1,
                    "replies": [
                        {
                            "author": "mailman978",
                            "body": "I mean any guy you meet who singles you out to talk to you and ask you to hangout sometime is probably flirting",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Effective-Error6616",
                                    "body": "Gotcha. Sometimes I think guys who do that just want to be my friend😭",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "HughBass",
            "body": "You are still young. Being 21 and never had a boyfriend isn't a bad thing or something that's out of the norm. Honestly I think its better for you to make the first move since you have the control of who you date and who you don't. You can be selective. Now if you are looking for a guy to hit on you in the gym, it may or may not happen. But because of social media, it is unlikely that they will make the first move. And usually if they do, it's probably not a guy you want to be dating. There's one girl at my gym that I'm sure likes me but I am not going to make the first move even if the signs are there. She's gonna need to talk to me because I don't wanna be seen as a gym creep.",
            "score": 1,
            "replies": [
                {
                    "author": "Effective-Error6616",
                    "body": "I just learned today that apparently talking to girls at the gym is a no-no. So this is good to know.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "HughBass",
                            "body": "I think its a good thing you haven't had a boyfriend at your age. It sounds like you focused on your career or hobbies first. You should do the asking. It may be scary at first but it's all in your head. Your mind may self sabotage your relationships. You can be selective about who you date and who you don't. If it doesn't work out, more fish in the sea.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Upstairscomment4809",
            "body": "Rip your DMs",
            "score": 1,
            "replies": []
        }
    ]
}