{
    "title": "Forum Libre - 2025-03-18",
    "author": "AutoModerator",
    "subreddit": "france",
    "rank": 0,
    "score": 15,
    "upvote_ratio": 0.9,
    "num_comments (reported by reddit)": 172,
    "url": "https://www.reddit.com/r/france/comments/1jdwk0v/forum_libre_20250318/",
    "id": "1jdwk0v",
    "selftext": "Partagez ici tout ce que vous voulez, sauf la politique.\n\nCe sujet est généré automatiquement vers 5 h - [Archives](https://www.reddit.com/r/france/search?q=Forum+Libre++author%3A%22automoderator%22&restrict_sr=on&sort=new&t=all).",
    "comments": [
        {
            "author": "Rouge-pavot",
            "body": "En pleines \"négociations\" salariales avec ma boîte...je dis bien \"négociations\" parce qu'ils ne proposent pas, ils disent \"tenez un CDD, non pas un CDI\" (après mon stage) \"en fait on a changé d'avis, on change plus votre contrat même si techniquement y'a un changement de poste en interne\". Bien sûr je refuse.\n\nIls imposent leurs critères donc je vais imposer les miens.\n\nC'est dur psychologiquement de devoir se battre pour sa valeur normale en tant qu'employé. Non, pas de contrat qui reste tel quel. Ils veulent que je prenne en main leur projet d'innovation ? Je veux nouveau contrat et augmentation considérable parce que je suis 5k en-dessous de la valeur du marché pour le poste qu'ils me donnent (et encore, je vise pas le haut de la fourchette salariale).\n\nCa aide pas le syndrome de l'imposteur ni ma peur d'être trop ambitieuse. En + je suis la plus jeune de la boîte et l'une des seules femmes.\n\nAaaaaaaaaah ça va aller\n\nEdit: clarté :)",
            "score": 14,
            "replies": [
                {
                    "author": "tsukihi3",
                    "body": "> En + je suis la plus jeune de la boîte et l'une des seules femmes.\n\nTu pars avec un *handicap* et je ne dis pas ça pour discriminer, c'est une triste réalité pour les femmes ET les jeunes d'être sous-payés, mais il ne faut surtout pas que ça t'empêche d'exprimer ce que toi tu cherches.\n\nLes premières années de ta carrière sont les plus importantes pour ta carrière et tes revenus, alors tu fais bien de défendre ce que tu vaux. Sinon, les gens vont continuer à marcher sur toi en se disant qu'ils peuvent avoir quelqu'un de compétent (j'ose imaginer que quelqu'un qui poste sur le FL est compétent 😎) pour pas cher, et c'est tout à ton désavantage.\n\nAllez, bats-toi tu vas y arriver !",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Rouge-pavot",
                            "body": "Merci pour ton message :) J'ai conscience de ce handicap, c'est pour ça que je veux avoir le courage de me battre...et que je poste sur le FL hahaha. Je suis entourée de bcp de femmes qui ne sont JAMAIS allées aussi loin dans leur carrière...j'ai besoin qu'on me rassure un peu :)\n\non croise les doigts !",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "tsukihi3",
                                    "body": ">  Je suis entourée de bcp de femmes qui ne sont JAMAIS allées aussi loin dans leur carrière...\n\nalors tu pourras être d'autant plus fière d'être une pionnière, vois plutôt les choses comme ça :) n'hésite pas à demander conseil !",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Rouge-pavot",
                                            "body": "Merci ! Ha c'est dur mais on verra :) savoir que ma demande n'est pas déraisonnée ça aide (même si ça représente 15% d'augmentation et que c'est bcp)",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "tsukihi3",
                                                    "body": "> (même si ça représente 15% d'augmentation et que c'est bcp)\n\nsi tu as commencé 15% plus bas, 15% d'augmentation c'est toujours moins que ce que tu devrais toucher (selon le marché), et si tu as commencé 10% plus bas, 15% d'augmentation c'est moins de 5% d'une vraie augmentation\n\nen interne c'est souvent tendu par contre 10+%, il faut être agressif et avoir les balles pour se défendre !",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Darkoss117",
                    "body": "Courage !",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Rouge-pavot",
                            "body": "Merci ;-; j'ai besoin que les gens + expérimentés du FL m'expliquent si ça va....c'est mon premier CDI, ça fait deux ans et demi que je suis dans cette boîte...toute jeune !!",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Darkoss117",
                                    "body": "2,5 ans en CDD ?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Rouge-pavot",
                                            "body": "Non en CDI\\^\\^ le CDD c'était au début car j'ai fait mon stage de 6 mois dans cette boîte. Désolé c'était pas clair du tout ! En fait c'est pas la première fois qu'ils imposent le minimum et qu'il faut refuser\n\nEdit: pour éviter confusions, j'ai retiré ces parties du commentaire !",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Darkoss117",
                                                    "body": "Et tu as fait ton entretien individuel ? Entretien professionnel ? Ton salaire a été revalorisé ? Sinon , de mon point de vue, tes contre propositions ne sont pas lunaires. D'expérience je demande toujours plus car ils vont négocier à la baisse avec des contre arguments plus ou moins valables et j'aime pas faire durer cette période.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Rouge-pavot",
                                                            "body": "Justement, je n'ai eu aucun entretien professionnel pour ce changement de poste, et en ne changeant pas mon contrat, ils se permettent de faire comme si de rien n'était. J'ai demandé un point demain pour appuyer sur mes demandes. La bonne nouvelle c'est que mon chef me soutient...",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Darkoss117",
                                    "body": "2,5 ans en CDD ?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Steap",
                    "body": "[Emilie Dequenne](https://fr.wikipedia.org/wiki/%C3%89milie_Dequenne) vient de mourir, on peut donc repenser au [guide de survie en entreprise](https://www.youtube.com/watch?v=MxWhK2RJmQ0) de Stupeflip :\n\n> Pense à [Rosetta](https://fr.wikipedia.org/wiki/Rosetta_(film\\)), pense à [Ressources humaines](https://fr.wikipedia.org/wiki/Ressources_humaines_(film\\))\n> \n> Chaque fois que tu t'f'ras ken par c'putain d'système",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Rouge-pavot",
                            "body": "Merci !\n\nEdit: ohlalala comme ça fait du bien d'écouter Stupeflip !! ça m'avait manqué",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "tsukihi3",
            "body": "J'avais payé en ligne par carte pour une formation que je vais suivre, et je m'étais aperçu que j'avais pas de reçu électronique, alors j'en ai demandé un à l'organisme pour la compta... et ils m'ont envoyé la photo du reçu rédigé à la main et m'ont dit qu'ils vont envoyer ce reçu par la poste.\n\nLe numérique c'est vraiment pas encore ça ici.",
            "score": 12,
            "replies": [
                {
                    "author": "bebepoulpe",
                    "body": "Au moins ils maîtrisent les outils digitaux",
                    "score": 8,
                    "replies": [
                        {
                            "author": "tsukihi3",
                            "body": "> digitaux\n\ngitaux",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "bebepoulpe",
                                    "body": "Pardon, je voulais dire les outils dichuicon",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "tsukihi3",
                                            "body": "^^^*transpire*",
                                            "score": 9,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "kadreg",
            "body": "Le mardi cuisine s'est fait invisibilisé ce matin. Vous pouvez retrouver en cliquant ici. Enfin sur ce lien : https://www.reddit.com/r/france/comments/1jdyd0x/mardi_cuisine_20250318/",
            "score": 11,
            "replies": []
        },
        {
            "author": "trustnojune",
            "body": "Hier soir en passant à la pharmacie : \"ah ben votre mutuelle indique que votre contrat est résilié, vous êtes sûre que vous n'avez pas changé de travail ?\". Euh, non non.\n\nQuiiiiii va se farcir le service client de sa mutuelle + un mail au comptable de sa boîte pour savoir d'où vient ce bordel, c'est bibi.\n\n(Et au passage le médoc coûtait super cher)",
            "score": 8,
            "replies": [
                {
                    "author": "Illettre",
                    "body": "Parfois il faut penser à mettre à jour sa carte vitale",
                    "score": 1,
                    "replies": [
                        {
                            "author": "trustnojune",
                            "body": "C’est pas le cas pour le coup, ça vient vraiment de la mutuelle",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Tryrshaugh",
            "body": "J'ai commencé à tester ChatGPT depuis fin 2023 et j'ai notamment fait énormément de tests autour de sujets où je considère être expert. Les nouveaux modèles commencent à m'impressionner. Ils font toujours des erreurs grossières mais de moins en moins fréquentes et surtout ils arrivent à citer directement les bons articles de loi qui sont pertinents sur les sujets où je les teste.",
            "score": 8,
            "replies": [
                {
                    "author": "throaway2s1fsfsf4",
                    "body": "Impressionnant oui. Ne serait-ce en effet pour s'informer sur un sujet de manière extensive et à la rigueur confirmer avec un expert que la majorité des infos sont correctes (ce qui pour des sujets plutôt simples sera souvent le cas).",
                    "score": 1,
                    "replies": [
                        {
                            "author": "EvolvedEukaryote",
                            "body": "Ou peut-être qu’il a été entrainé un peu plus sur des papiers officiels et un peu moins sur Reddit.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "nessawilliam",
            "body": "Ça fait presque 8 ans que je suis dans ma boîte et j’ai  développé une aversion pour les chouquettes. L’odeur, la vue. Ça m’insupporte. 😭",
            "score": 8,
            "replies": [
                {
                    "author": "Avril_Eleven",
                    "body": "J'ai jamais compris l'intérêt du truc. Tu bouffes de l'air.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "nessawilliam",
                            "body": "Et les petites perles de sucre qui font mal aux chicots… 🥹\n\nLe pire, je pense c’est le collègue qui fait le tour des bureaux avec les chouquettes que personne n’a voulu manger. Des chouquettes rassis et raides comme la justice. 😭",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "bobbyLapointe",
                            "body": "Je préfère la version locale de la chose, fourrée à la crème pâtissière : la Dune Blanche.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "LeSel",
                            "body": "Idem ça vaut rien ces trucs ",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "kadreg",
                    "body": "moi j'aime bien. L'autre jour, j'ai amené des cookie de cyril lignac pour les collègues, ils étaient contents",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "PetitB0t",
                    "body": "C'est fastidieux les chouquettes  ? \\^\\^",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CamusAquarius",
            "body": "Non pas aujourd'hui. Pas envie.",
            "score": 7,
            "replies": [
                {
                    "author": "_JCVD_",
                    "body": "Mince c'étais la journée bien être au travail, on a le droit de flaggeler les manager toxiques, chier sur le bureau de la RH, et on est même sympas avec les collègues du même rang que nous.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "CamusAquarius",
                            "body": "Je ne suis pas toxique, mais c'est moi le manager.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "OursGentil",
                                    "body": "> Je ne suis pas toxique,\n\nExactement ce que dirait un manager toxique.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "CamusAquarius",
                                            "body": "Maieuuuuhhhhĥh!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "_JCVD_",
                                    "body": "Oups la boulette.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "AwesomeDewey",
            "body": "Le lundi Relations et Sexualité d'hier était désespérément vide. J'en déduis que soit c'est calme plat dans les chaumières, soit les gens conservent leurs munitions pour le grand ménage de printemps, soit on a le feu en ce moment, banane toute la journée et tout.\n\nPerso, j'ai une tempête familiale qui se tasse et la semaine passée a été plutôt calme. La météo prévoit un pic de phéromones dehors pour les semaines à venir, soyez prudents.",
            "score": 5,
            "replies": [
                {
                    "author": "baguette_lardon",
                    "body": "Les gens qui ont une sexualité active ne sont pas sur Reddit voyons.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "AwesomeDewey",
                            "body": "Ah je te promets quand on vient de faire du sexe correct, on a qu'une envie c'est de l'écrire dans le FL",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "baguette_lardon",
                                    "body": "Ça c'est sur, si jamais mes inscriptions sur les applis de rencontres donnent quelque chose, vous en serez les premiers notifiés",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "OursGentil",
                    "body": "J'étais retombé sur des FL pré-covid qui étaient à +1000 commentaires et où ça racontait ses histoires tinder en boucle. C'tait le bon temps.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Naabi",
                            "body": "La fin des applications tierces sur reddit avec les tarifs délirants d'utilisation de leur API en Juin 2023 ont vraiment mis un coup à ma participation, je peux imaginer que ça a pas aidé non plus pour d'autres personnes",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "AwesomeDewey",
                                    "body": "Oui, ça plus la transition de l'app reddit mobile vers un mix tiktok/insta a aussi largement repoussé les amateurs de prose qui pullulaient antan",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "UristMcUselessNoble",
                            "body": ">J'étais retombé sur des FL pré-covid qui étaient à +1000 commentaires et où ça racontait ses histoires tinder en boucle. \n\nT'en avais certains qui aimaient bien mythonner mais bon, ça faisait partie du jeu.\n\n>C'tait le bon temps.\n\nC'est sur que le FL n'est plus ce que c'était.... Après j'ai pas les stats', mais j'ai l'impression que c'est globalement r/france qui baisse en volume tout court, que ce soit en nombre de commentaire ou sujets postés.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "AwesomeDewey",
                                    "body": "Faut aussi avoir en tête que Tinder fonctionnait pas trop mal à l'époque pour les gens moyens, ce qui ne parait plus tellement être le cas aujourd'hui",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "OursGentil",
                                    "body": "J'sais pas. Mon interprétation perso c'est que pendant le Covid, une grosse partie de la population qui s'entendaient bien entre eux ont migré sur des serveurs Discord persos et qu'ils ont commencé de fait à moins poster ici.\n\nRajoute à ça la morosité ambiante qui a commencé à s'installer pendant et après les confinements, et voilà.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "AwesomeDewey",
                                            "body": "J'ai plus la présence d'esprit de tout replacer ça sur une frise des temps mais y'a eu tout un tas de drama aussi qui n'a pas arrangé les choses. Des histoires d'aggressions sexuelles par çi, des gros délires de modération (du genre qu'on entend avec les deux oreilles en même temps) par là, une immigration massive du 18-25, du brigading politique à foison...",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Bansona4",
                                                    "body": "> une immigration massive du 18-25, du brigading politique à foison...\n\nIls sont sur le front maintenant !",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "AwesomeDewey",
                            "body": "Je me fais pas trop de soucis, le FL a toujours été plus vide en hiver-été qu'au printemps-automne.\n\nMais c'est vrai que ça semble difficile en 2025 d'enchaîner les meetups IRL sauvages comme à la grande époque.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "AlexisFR",
                                    "body": "le FL en 2025 a genre 5 à 10% des commentaires que avant 2020-2018, c'est incomparable.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "AwesomeDewey",
                                            "body": "[lien pertinent](https://www.reddit.com/r/france/comments/1annuuw/j%C3%A9tais_l%C3%A0_il_y_a_3000_ans/)",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "tsukihi3",
                    "body": "> Le lundi Relations et Sexualité d'hier était désespérément vide.\n\nr/france baise pas ouais\n\n^^^c'était ^^^ça ^^^ou ^^^j'allais ^^^dire ^^^\"désespérément ^^^vide, ^^^vide ^^^comme ^^^mes...\"",
                    "score": 5,
                    "replies": [
                        {
                            "author": "UristMcUselessNoble",
                            "body": "On reste des redditeurs, et même aller à l'escalade ne règle pas le problème si tu es socialement inapte!",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "_JCVD_",
                                    "body": "Merci de rappeler ce douloureux fait. On peut être beau, cultivé, plein de répartie derrière un clavier, et totalement nul en vie réel.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "tsukihi3",
                                            "body": "on est tous des Henri sur r/france",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "_JCVD_",
                                                    "body": "J'ai pas la ref :/",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "tsukihi3",
                                                            "body": "pourtant il voudrait bien réussir la vie",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "_JCVD_",
                                                                    "body": "Être aimerrrrrrrrrrr\n\nBon c'est déjà le cas j'ai des parents géniaux (pourtant vu que j'ai raté la ref ils devraient peut être revoir leur jugeent)",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "AwesomeDewey",
                                            "body": "On peut aussi être totalement nul tout le temps et baiser, je connais un paquet de gens comme ça\n\n^(la réussite se mesure pas en kilométres etc)\n\n^^(c'est) ^^(la) ^^qualité ^^qui ^^compte\n\n^^^le ^^^coordonier ^^^est ^^^le ^^^plus ^^^mal ^^^chaussé ^^^mais ^^^le ^^^maçon ^^^est ^^^le ^^^plus ^^^mal ^^^bâti",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "_JCVD_",
                                                    "body": "Y'a un cheat code ?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "AwesomeDewey",
                                                            "body": "toujours le même: rire",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "_JCVD_",
                                                                    "body": "hahahahaha",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "AwesomeDewey",
                                                                            "body": "*début de demi molle* \n\ntoi tu vas t'arrêter tout de suite avant que ça dégénère",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "_JCVD_",
                                                                                    "body": "Mouhahahahahaha\n\nOk j'arrete",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Ididitthestupidway",
                    "body": "Je vais probablement envoyer un message Facebook du genre \"hey salut, on s'est rencontré à tel évènement, ça te dirait de prendre un café ?\" mais sans beaucoup d'espoir",
                    "score": 4,
                    "replies": [
                        {
                            "author": "AwesomeDewey",
                            "body": "this is the way",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "throaway2s1fsfsf4",
                    "body": "Dead bedroom ici sinon je participerais plus.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "AwesomeDewey",
                            "body": "oh nooooon\n\ntu veux en parler? sachant que parler peut se limiter à dire \"ça fait chier\"",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "throaway2s1fsfsf4",
                                    "body": "J'ai retourné le sujet dans tous les sens, mais pour résumé on est pas compatible sexuellement avec ma copine et elle n'a plus aucune attirance pour moi. Je reste avec elle malgré ça car c'est ma première copine et j'avoue j'ai pas envie de me retrouver seul. On restera pas ensemble éternellement cela dit, mais je suis pas pressé que la relation se termine. Voilà sinon oui ça fait chier, mais en vrai j'ai jamais eu une vie sexuelle épanouie donc je sais pas trop ce que je rate et le reste de ma vie est cool donc c'est pas si désespérant non plus.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "AwesomeDewey",
                                            "body": "Je suis trop désolé.\n\nA titre perso j'ai toujours eu du mal à me rendre compte de l'ampleur des dégâts d'une dead bedroom. Mais je suis pas une référence, en couple je donne beaucoup trop, beaucoup trop tôt et je casse dès qu'un truc commence à clocher parce que je suis très vite à bout de force.",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "MagiskSystem",
                                            "body": "Je suis passé d'une deadbedroom à une relation bien plus épanouissante. Ça change la vie. Quand on est dans ta situation, je peux t'assurer que l'herbe est plus verte ailleurs. Courage à toi.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Avril_Eleven",
                    "body": "Ben on est peut-être tous tellement heureux au lit qu'on n'a pas besoin d'en parler, voilà.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "AwesomeDewey",
                            "body": "T'as raison, mais tant qu'on a pas vérifié ce qui se passe dans la vie sexuelle d'absolument tout le monde, on ne saura jamais. Merci de présenter votre attestation officielle.\n\nje certifie que mon absence de commentaire sur le Lundi Relations et Sexualité d'hier est lié au motif suivant autorisé: pas en couple et pas pressé",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Avril_Eleven",
                                    "body": "J'avais mes règles, je dois aussi montrer un justificatif ou ça ira sur parole ?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "AwesomeDewey",
                                            "body": "ça ira pour cette fois je te la remplis vite fait.\n\nje certifie que gnagnagna de commentaire gnagnagna suivant: ragnagnas",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "PotaroMax",
            "body": "J'ai récemment acheté un spyhon à chantilly, je ne maîtrise pas encore cette diablerie.\nForcément hier j'étais tellement concentré sur la quantité de crème à mettre que j'en ai oublié le sucre...\nEt pour ne pas la gâcher j'ai tenté de l'utiliser quand même.\n\nLeçons apprises sur la chantilly non sucrée :\n\n- c'est pas terrible sur un dessert\n- ça défonce encore plus le bide que la version sucrée\n- c'est pas ouf pour accompagner des oeufs au plat",
            "score": 5,
            "replies": [
                {
                    "author": "Stoopidfucc",
                    "body": "au moins tu acquiers de l'expérience !",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Ididitthestupidway",
                    "body": "Si j'avais un truc comme ça j'essayerais plein de \"chantilly\" salées, genre au bleu/roquefort",
                    "score": 2,
                    "replies": [
                        {
                            "author": "PotaroMax",
                            "body": "Haha ça viendra ! Il y a de quoi faire tout un tas de recettes chelou (et potentiellement dégueu aussi).\nLe truc c'est que ça utilise une cartouche de gaz par tentative donc il faut éviter de se louper",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Ididitthestupidway",
                                    "body": "Ah, j'imagine que ça peut pas se recharger. D'ailleurs quelqu'un sait pourquoi on utilise du protoxyde d'azote pour ça ? Je suppose que n'importe quel gaz comprimé devrait marcher non ?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "PotaroMax",
                                            "body": "Non, c'est des cartouches à percuter. Par contre le syphon se conserve \"chargé\" pendant quelques jours au frigo, ça reste plus économique et écologique que les bombes de crême du supermarché.\n\nJe pensais que c'était seulement d'un point de vue hygiène et alimentaire mais apparement c'est aussi car ce gaz n'a pas de goût et a une meilleur solubilité dans le gras",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Endarys",
                                                    "body": "Sinon ça marche aussi de faire de la chantilly avec un batteur et de la crème entière, y'a pas besoin de cartouche comme ça haha",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "RedditTipiak",
            "body": "Qu'est-ce qui existe comme très bonne fiction ayant pour cadre la Révolution Française (avec ou sans la Terreur) ?",
            "score": 5,
            "replies": [
                {
                    "author": "_gragoon",
                    "body": "Les visiteurs 3 (non).",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "ill_are",
                    "body": "Danton ?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "BreadfruitAccording3",
                    "body": "Lady Oscar. \nhttps://fr.m.wikipedia.org/wiki/Lady_Oscar_(s%C3%A9rie_t%C3%A9l%C3%A9vis%C3%A9e_d%27animation)\n\nVieux dessin animé. ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "kadreg",
                    "body": "vaincre ou mourir : https://www.allocine.fr/film/fichefilm_gen_cfilm=302772.html",
                    "score": 0,
                    "replies": [
                        {
                            "author": "ill_are",
                            "body": "1,3/5 ça donne envie...",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "kita59",
            "body": "c'est bizarre quand je vais sur r/random j'ai le message \"Cette communauté a été bannie\" vous avez ça aussi ?",
            "score": 4,
            "replies": [
                {
                    "author": "IAmGwego",
                    "body": "Oui",
                    "score": 3,
                    "replies": [
                        {
                            "author": "CarcajouIS",
                            "body": "Ça me dit que r/random a été bannie il y a 2 ans pour absence de modération (lol)",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "kita59",
                                    "body": "encore un coup de modo qui font pas leurs boulots :(",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "LeSel",
            "body": "Je crois que je souffre d'un PTSD lié aux déjections félines. Il y a quelques jours je vois depuis ma fenêtre un chat faire ses besoins au fond de mon jardin. Immédiatement je sens l'odeur remplir la pièce comme s'il était à côté de moi (toutes les fenêtres étaient fermées et il était bien à 15m). C'est pas juste un souvenir de l'odeur c'est vraiment la sensation que ça pue dans la pièce. Bon. Ce matin, rebelote mais je n'ai même pas eu besoin de le voir. C'est ma femme qui l'a aperçu et me le dit, et là encore en un instant la pièce se remplit de cette forte odeur de caca de chat. Ça dure 1 bonne minute et puis ça disparaît mais c'est tellement réel comme sensation, c'est vraiment étonnant.",
            "score": 4,
            "replies": [
                {
                    "author": "lyremska",
                    "body": "Je ne vois qu'une solution, la désensibilisation : adopte pleins de chats et mets toutes leur litières dans le salon, dans ta chambre, partout où tu passes du temps, et ne les nettoie pas trop souvent. Au bout d'un moment tu te seras tellement habitué à l'odeur réelle que tu pourras plus en subir une imaginaire.\n\n^^*résultats* ^^*non* ^^*garantis*",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "_JCVD_",
                    "body": "Attention derrière toi, un chat qui fait caca!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "LeSel",
                            "body": "Hé bien tu rigoles mais j'étais sur le point d'éditer mon message afin d'ajouter que rien que de me relire ça reproduisait le phénomène. Dingue ça.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "StupLapinou",
                                    "body": "C'est trop marrant, ça veut dire qu'on peut t'envoyer des messages avec \"caca de chat qui pue\" juste pour t'emmerder \n\nJe vais parler de caca de chat tout les jour sur le FL",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "_JCVD_",
                                    "body": "Ouais c'est assez particulier comme phénomène.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Munzze",
            "body": "J'ai acheté des sangles de tirage pour la salle de sport. Il y a un côté un peu kinky à la mise en place hihihi",
            "score": 4,
            "replies": [
                {
                    "author": "SecretOfPerma",
                    "body": "On ne juge pas !",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ididitthestupidway",
            "body": "Quand je touche 10 centimes, mon patron gagne un euro,\n\nC'est pourquoi je fais caca, sur les heures de bureau.",
            "score": 9,
            "replies": [
                {
                    "author": "tsukihi3",
                    "body": "L'heure de ressortir la formule financière fécale (F.F.F.) ou Calcul convaincant du caca (C.C.C.) :\n\n* 1 caca = ~10 minutes\n* 5 caca / semaine = ~50 minutes\n* ~50 minutes x ~45 semaines ouvrées par an = ~2250 minutes\n* ~2250 minutes / 60 = ~37.5 heures\n\nUn caca par jour, c'est une semaine de travail sur une année. \n\nFaites valoir vos journées de CP (cacas payés) correctement, c'est _votre_ droit.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "fart-tatin",
                            "body": ">1 caca = \\~10 minutes\n\nAvec reddit en main, tu peux compter plus.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "tsukihi3",
                                    "body": "mon astuce c'est d'alterner soupe - kebab - salade à mes déjeuners pour faire 2 à 3 cacas par jour",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "RedditTipiak",
            "body": "Oui messire ?",
            "score": 3,
            "replies": [
                {
                    "author": "tsukihi3",
                    "body": "Ca y est, je suis mort.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "UrbanFantasy31",
                            "body": "Du travail, encore du travail...",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DoNDaPo",
                    "body": "Bieeeen",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "eliseetc",
            "body": "Arriver sur ce fil dans les premiers à cause de l'insomnie, c'est la loose ou le bonheur ?",
            "score": 3,
            "replies": [
                {
                    "author": "segfaultzerozero",
                    "body": "Les 2 camarade.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "hellshigh5",
                    "body": "Ca dépend si bosse derrière ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "segfaultzerozero",
            "body": "Salutations camarades du sous. \n\nJ'espère que vous allez bien. \n\nJ'ai dormi jusqu'à 3 heures du matin et ensuite impossible de dormir. \n\nPassez une bonne journée.",
            "score": 3,
            "replies": [
                {
                    "author": "tsukihi3",
                    "body": ">  jusqu'à 3 heures du matin et ensuite impossible de dormir.\n\nfallait venir dire bonjour j'étais debout moi",
                    "score": 1,
                    "replies": [
                        {
                            "author": "segfaultzerozero",
                            "body": "Navré camarade mais bonjour camarade Tsuki , comment va best papounet JP ?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "tsukihi3",
                                    "body": "Et bien le bonjour à toi aussi, camarade u/segfaultzerozero. \n\nJe procrastine _de ouf_, d'habitude je fais des trucs avant que le FL du jour sorte mais là j'ai presque rien foutu, c'est incroyable à quel point je glande.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "segfaultzerozero",
                                            "body": "Quoi ? Tu veux dire que tu n'as pas produit des yens ? Mais que vas-tu devenir ? Où est la piscine de billets de yens ? \n\n\nJ'invoque le camarade giga chad u/Verethra",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Verethra",
                                                    "body": "è&é",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "segfaultzerozero",
                                                            "body": "En route pour Tochigi afin de remettre T$uki sur le droit chemin",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "tsukihi3",
                                                    "body": "> Tu veux dire que tu n'as pas produit des yens ?\n\njamais, je facture en euro monsieur",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "segfaultzerozero",
                                                            "body": "Bravo Tsuki , tu représentes la NATION FRANÇAISE et maintenant va produire des euros et en go construire la piscine de billets de 500.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "tsukihi3",
                                                                    "body": "> tu représentes la NATION FRANÇAISE\n\nu/clement2suresnes me manque terriblement",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Verethra",
                                                                            "body": ";( petit ange PARTI trop TÔT",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "roulegalette",
            "body": "Bonjour le forum libre.\n\nJ'ai besoin de conseil en natation. Je me suis inscrit à une course en eau libre longue distance et je ne pense pas avoir bonne technique pour finir sous la barrière horaire.\nJ'ai assez d'endurance, je sais nager le crawl (en version apprise en primaire) pendant une heure sans m'arrêter, mais il faudrait que je sois plus rapide, au moins 2min20/2min30 au 100 m.\n\nVous avez des conseils pour s'améliorer ? (je ne sais pas si c'est possible en lisant un site ou en regardant des vidéos youtube)",
            "score": 3,
            "replies": [
                {
                    "author": "Cent_patates",
                    "body": "Hello,\n\nEst-ce que tu aurais la possibilité de prendre des cours? Parce que ce serait probablement le plus efficace, d'avoir quelqu'un qui te dise directement ce qui va pas et comment l'ameliorer.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "roulegalette",
                            "body": "Je peux mais je me demandais si c'était possible de faire sans.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Symor41",
                    "body": "Tu peux t'améliorer sans trop d'efforts simplement en te concentrant sur ton aérodynamisme. Bien tendre le bras en avant pour aller chercher le plus d'amplitude puis le replier vers soit pour pousser le plus fort sans se freiner. Plus ton corps est droit et étiré, mieux tu passeras \"à travers\" l'eau et tu gagneras en vitesse.\n\nTu peux aussi maîtriser tes respirations, moi je faisais tout les 3 mouvements de bras sur un 100m, certains font moins, voire pas de respirations sur les 25m.\n\nEt puis corriger les jambes. Inutile de les bouger juste pour faire de la mousse, un petit mouvement régulier permet de ne pas casser l'aérodynamisme et te freiner.\n\nTu peux aussi gratter du temps avec un bon plongeon, corps bien tendu, droit, la tête entre les bras et là tu gagnes de précieuses secondes.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Steap",
            "body": "J'ai des jeans défoncés, au-delà du raisonnablement réparable. Est-ce qu'il y a des gens qui récupèrent le tissu pour en faire un truc utile ?",
            "score": 3,
            "replies": [
                {
                    "author": "pete-standing-alone",
                    "body": "Dans ma ville il y a des kiosques en libre service où tu peux déposer tes fringues pour être recyclées. Bien lire les consignes pour savoir s'ils acceptent ou non ce que tu comptes déposer.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Steap",
                            "body": "T'as un nom ? Y a certaines bornes qui ont mauvaise réputation parce qu'apparemment c'est balancé à la tonne dans des pays pauvres, où ils finissent par crouler sous les vêtements de merde. J'avoue que je m'y connais pas plus que ça, je voudrais juste que ça soit réutilisé pour réparer d'autres jeans, ou recyclé en isolant, par exemple.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Symor41",
            "body": "J'ai mal au cou en ce moment à cause de mon oreiller au lit. Je ne sais pas quoi faire, il faut quelque chose d'épais ou fin ? Mou ou dur?\n\nPS: Je fais partie de ceux qui dorment sur le ventre",
            "score": 3,
            "replies": [
                {
                    "author": "tuituituituii",
                    "body": "Arrête de dormir sur le ventre",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "pete-standing-alone",
                    "body": "> épais ou fin ? Mou ou dur?\n\n( ͡° ͜ʖ ͡°)\n\nJe dors sur le ventre, le meilleur oreiller que j'ai trouvé c'est le IKEA extra plat \"PILSPINNARE\"",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "DoNDaPo",
                    "body": "Je te conseille d'aller en boutique de literie, ils y sont de très très bons conseils !",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "AwesomeDewey",
                    "body": "Essaie de retourner ton matelas (tête-pied et/ou changement de face) pour voir, si ça se trouve le reste de ton corps s'enfonce un peu trop dans le lit depuis quelques temps et ton cou en souffre. Le retourner de temps en temps permet de rééquilibrer un peu l'usure.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Symor41",
                            "body": "Je vais tester ça, mais j'ai un matelas a mémoire de forme assez souple, je n'arrive pas à dormir sur des matelas fermes",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "La_mer_noire",
                                    "body": "justement, il est possible que ton matelas ait trop prit ta forme et que tu sois dans un creux du coup. le retourner permet de répartir l'usure.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Darkoss117",
                    "body": "Si tu dors sur le ventre, je dirais un oreiller ultra plat, t'a pas envie d'avoir la tête haute.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Akajou01",
                    "body": "Ventre ou dos = oreillers plat. Tu as quoi actuellement ? Mousse ? Mémoire de forme ? Plume, duvet ?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Symor41",
                            "body": "C'est de la plume que j'ai actuellement",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Akajou01",
                                    "body": "Ça a tendance à être assez fermé. Faudrait voir duvet (mais c'est cher), ou bien mousse. Ou carrément rien. Je connais 2 personnes qui ne jure que par ça sur dos ou ventre... (perso je pourrais pas)",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "La_mer_noire",
                            "body": "dos je ne supporte pas les oreillers plats perso. il me faut de l'épaisseur et quand j'en ai pas assez je le plie en dormant.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Demondriver",
            "body": "J'ai reçu ma clef beta pour Ratatan y'a quelques heures. Je n'arrive plus à bosser depuis, la seule chose dont j'ai envie, c'est de me barrer du taf pour y jouer !!",
            "score": 3,
            "replies": [
                {
                    "author": "jkail-",
                    "body": "Ou est-ce qu'on s'inscrit ? Via un site officiel ? Steam ?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Demondriver",
                            "body": "C'est uniquement si tu avais participé au kickstarter l'an dernier, désolé :/",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "jkail-",
                                    "body": "C'est légitime ...",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "La_mer_noire",
            "body": "ygg n'est plus accessible juste en modifiant ses DNS? \n\nJe suis sur une box orange, j'ai formaté hier, et je vois que je n'ai plus acces a certains sites. J'ai donc modifié mon DNS sur le PC en 1.1.1.1 (mais a priori il ne fonctionne pas sur orange car la box utilise cette IP en interne) 8.8.8.8, 1.0.0.1, 9.9.9.9 \n\nquand je tape nslookup dans un cmd ça continue de me mettre livebox.home en sereur par défaut. j'avais jamais test nslookup, mais il me semble qu'à l'époque, modifier mon DNS dans les parametres de la carte réseau était suffisant, non?",
            "score": 2,
            "replies": [
                {
                    "author": "Stoopidfucc",
                    "body": "j'utilise pas mais je peux joindre ygg.re ? si c'est le bon site, sinon plus d'infos sur r/francepirate, sinon ça m'étonnerait pas que bolloré ou autre de la même éspèce puisse utiliser la justice pour faire plier les dns que tu as cité.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "La_mer_noire",
                            "body": "j'ai pu rejoindre avec un VPN ouais, mais avant mon formatage, je pouvais me connecter même sans VPN, à priori car j'avais changé mes DNS, mais là c'est sans succes. à moins que les blocages aient encore grimpé d'un niveau",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Stoopidfucc",
                                    "body": "aprés certains navigateurs outrepassent tes configs dns simples avec un DoH par défaut parfois, sinon une autre raison que je connais pas.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Steap",
                    "body": "    $ dig ygg.re @8.8.8.8 +short\n    172.67.178.119\n    104.21.64.76",
                    "score": 1,
                    "replies": [
                        {
                            "author": "La_mer_noire",
                            "body": "Grâce a un utilisateur de piraterie fr, on a trouvé : j'avais pas désactivé mon ipv6, du coup les dns moisis d'orange passaient par la. Tout est bon depuis que j'ai désactivé cette option",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Steap",
                                    "body": "Ouais mais c'est 2025, active IPv6 et utilise un DNS qui marche :D",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Shel006",
            "body": "Bonsoir est ce qu’on peut partager nos histoires ici svp?",
            "score": 2,
            "replies": [
                {
                    "author": "tsukihi3",
                    "body": "oui mais il est un peu tard à part les kékés comme moi qui traînent sur internet à cette heure, tu ferais peut-être mieux d'attendre le prochain FL qui arrive à 5h du mat",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Shel006",
                            "body": "Chez moi il est 18hpm😂wesh \nDésolé",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "bebepoulpe",
            "body": "Tiens aujourd'hui *Les pieds sur Terre* parle de l'OFPRA, ping /u/sowetonecklace \n\nhttps://www.radiofrance.fr/franceculture/podcasts/les-pieds-sur-terre/dans-la-tete-des-officieres-de-protection-de-l-ofpra-5993314",
            "score": 2,
            "replies": [
                {
                    "author": "SowetoNecklace",
                    "body": "La partie sur les vendeurs de faux récits, je suis content qu'on en parle engin. J'ai tellement l'impression qu'on fait dans l'angélisme en-dehors du secteur et qu'on s'imagine que personne ne ment...",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Steap",
                            "body": "As-tu vu *L'Histoire de Souleymane* ?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "SowetoNecklace",
                                    "body": "Non, et je refuse de le regarder... Non seulement je suis pas cinéphile, je veux pas penser au taf pendant mes loisirs.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "syndromeDeLING3",
                                            "body": "Depuis que tu fais ce taff tu n'as jamais regardé d'oeuvre culturelle relative à l'immigration ?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "SowetoNecklace",
                                                    "body": "Aucune fiction en tout cas. J'essaie de me souvenir, mais franchement je pense pas.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Bitter-Nothing6180",
            "body": "Bonjour à tous",
            "score": 2,
            "replies": []
        },
        {
            "author": "jacky986",
            "body": "Quelles sont les plus importantes communautés d'immigrés asiatiques en France ?  \n\n\nJuste par curiosité. Jusqu'à présent, les seules communautés dont j'ai entendu parler sont les Tamouls, les Chinois, les Laotiens, les Cambodgiens et les Vietnamiens.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Specialist-Place-573",
            "body": "Bon, trois comprimés aujourd'hui, pris à jeun après deux jours de pause.\n\nJ'ai fait plus en une heure que tout hier :/",
            "score": 1,
            "replies": [
                {
                    "author": "pete-standing-alone",
                    "body": "comprimés de quoi ?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Specialist-Place-573",
                            "body": "Méthylphénidate, le médoc pour le TDA/H. Je documente les premiers jours ici pour suivre le déroulé plus tard.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "pete-standing-alone",
                                    "body": "D'ac, attention a l'accoutumance",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Specialist-Place-573",
                                            "body": "C'est peu adictif, et les effets ne sont pas censés diminuer avec le temps.\n\nMais je connais bien les adictions, merci pour le message !",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}