{
    "title": "La Commune de Paris fête aujourd'hui ses 154 ans !",
    "author": "Wonderful-Excuse4922",
    "subreddit": "france",
    "rank": 10,
    "score": 769,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 81,
    "url": "https://i.redd.it/s3ygiobuxepe1.jpeg",
    "id": "1je0low",
    "selftext": "",
    "comments": [
        {
            "author": "ShrekGollum",
            "body": "[Ça me rappelle ça, que j’avais trouvé au fond d’un carton. Aucune idée si c’est vraiment authentique, et duquel de mes ancêtres cela vient (sans doute acheté plus tard). ](https://i.imgur.com/2YWhPBH.jpeg)\n\nBon pour le coup c’est le siège de Paris, non la commune.",
            "score": 23,
            "replies": [
                {
                    "author": "Whatev57",
                    "body": "La commune et le siège de Paris, c'est quand même singulièrement concomitant comme évènement... ça pourrait être les deux ?",
                    "score": 12,
                    "replies": [
                        {
                            "author": "keepthepace",
                            "body": "Dans ce cas, le [quartier de la Défense](https://fr.wikipedia.org/wiki/La_D%C3%A9fense_de_Paris_(groupe_sculpt%C3%A9\\)#/media/Fichier:La_D%C3%A9fense_de_Paris_@_Parvis_@_La_D%C3%A9fense_@_Paris_(34342635104\\).jpg) est nommé d'après la Commune :-)\n\nMais chaque fois que je sors ça, on m'explique (avec raison) que c'est pas la même chose: la défense de Paris a fait l'union nationale, et bien que la Commune soit en partie née d'un refus de la reddition, c'est pas exactement les mêmes groupes qui y ont participé. Mais oui, les deux événements sont clairement liés.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "-Mars-_",
                            "body": "Le rationnement date surtout du siège de Paris. Les cartes de rationnement datant de la Commune sont soit destinées aux plus pauvres, soit instituées provisoirement dans certains arrondissements de Paris pour parer à un manque de vivres passagers. Ce type de souvenirs fait le plus souvent uniquement référence au siège lui-même.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Robespietre",
            "body": "J'aimerai toujours le temps des cerises,\nc'est de ce temps-là que je garde encore,\nune plaie ouverte.",
            "score": 61,
            "replies": [
                {
                    "author": "eulerolagrange",
                    "body": "Et Dame Fortune, en m'étant offerte, ne pourra jamais fermer ma douleur.",
                    "score": 20,
                    "replies": [
                        {
                            "author": "Quiet-Duty-665",
                            "body": "J’aimerai toujours le temps des cerises\nEt le souvenir que je garde au cœur !",
                            "score": 14,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Athalis",
                    "body": "> J'aimerai toujours le temps des cerises\n\n\nResto très sympa de la butte aux cailles par ailleurs 😁",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Whatev57",
            "body": "J'ai découvert la chansons \" la semaine sanglante\" pendant la célébration des 150 ans de la Commune.\n\nentendre une foule, agitant des drapeaux rouges et noirs (ou juste rouges, ou juste noirs, mais y avait du drapeau), chantant en coeur\n\n>\"Oui Mais, ça branle dans le manche  \n>Les mauvais jours finiront  \n>Et gare à la revanche  \n>Quand tous les pauvres s'y mettront  \n>Quand tous les pauvres s'y mettront\"\n\nça avait fait quelque chose à mon p'tit coeur de libertaire.",
            "score": 38,
            "replies": [
                {
                    "author": "Gavus_canarchiste",
                    "body": "Parenthèse : la grammaire française t'offre la possibilité de dire \"des drapeaux rouges et noirs et rouge et noir\", \"rouges et noirs\" présentant deux couleurs séparées et \"rouge et noir\", invariable, les deux couleurs assemblées.  \n[Source](https://www.academie-francaise.fr/questions-de-langue#25_strong-em-couleur-accord-de-l-adjectif-et-du-nom-em-strong) : ces enfoiré·es de versaillais·es de l'Académie Française.  \nPardon, je voulais dire LA COMMUNE N'EST PAS MO-O-O-O-ORTEUH",
                    "score": 17,
                    "replies": [
                        {
                            "author": "keepthepace",
                            "body": "Y AVAIT DU DRAPAL ROUNOIR COMPRIS?",
                            "score": 9,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "_IBlameYourMother_",
            "body": "https://fr.wikipedia.org/wiki/Commune_de_Paris\n\n>La Commune est à la fois **le rejet d'une capitulation de la France face aux armées prussiennes menées par Otto Von Bismarck lors de la guerre franco-prussienne de 1870 et du siège de Paris**, et une manifestation de l'opposition entre un Paris républicain, favorable à la démocratie directe, et une Assemblée nationale à majorité acquise au régime représentatif.",
            "score": 26,
            "replies": [
                {
                    "author": "keepthepace",
                    "body": "> républicain, favorable à la démocratie directe\n\nEt ça, j'aimerais bien qu'on le rappelle. Laissez pas la droite monarchistes et facho-compatible nous ravir le mot de république. Le modèle républicain, qu'aujourd'hui on rend synonyme de répression des minorités et de justice de classe, est normalement tout l'inverse de ça. Historiquement ça a été une position de l'extrême gauche que de voir le peuple gérer lui même ses affaires et ça continue de l'être.\n\nLe propre du modèle républicain est de diviser le pouvoir et d'en éviter les concentrations. Avec la Ve on est très loin de l'idéal républicain qui a animé les révolutionnaires du 18 et 19e siècles.",
                    "score": 20,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sicksadworludo",
            "body": "J'upvote et tant pis si Reddit considère ça comme du contenu violent !\n\n^(Gépapeur.)",
            "score": 7,
            "replies": []
        },
        {
            "author": "Zzabur0",
            "body": "Quand la foule aujourd’hui muette,\n\nComme l’Océan grondera,\n\nQu’à mourir elle sera prête,\n\nLa Commune se lèvera.\n\nNous reviendrons foule sans nombre,\n\nNous viendrons par tous les chemins,\n\nSpectres vengeurs sortant de l’ombre,\n\nNous viendrons nous serrant les mains.\n\nLa mort portera la bannière ;\n\nLe drapeau noir crêpe de sang ;\n\nEt pourpre fleurira la terre,\n\nLibre sous le ciel flamboyant.\n\n\n(L. M. Chanson des prisons, mai 71.)",
            "score": 10,
            "replies": []
        },
        {
            "author": "BasedBlanqui",
            "body": "Première et dernière tentative en France d'une réelle démocratie. Certainement un des événements les plus importants de l'Histoire contemporaine du pays.\n\nÇa me rappelle qu'il faut que je regarde le film de 6h de Watkins sur la Commune.\n\n\nps : j'espère qu'on dynamitera un jour cette horreur insultante qu'est le sacré coeur de montmartre.",
            "score": 21,
            "replies": [
                {
                    "author": "hantaanokami",
                    "body": "Tiens, dans un autre post, quelqu'un demandait où on pourrait placer la statue de la liberté si les américains nous la rendaient. On pourrait virer le sacré cœur et y mettre la statue à la place, ça aurait de la gueule.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "GillesDArgent",
                            "body": "Non.\n\nOn est en France, monsieur, et en France, les trucs comme la statue de la liberté ça se met au milieu d'un rond point d'un village de 500 habitants.",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "uwu_01101000",
                                    "body": "\\[Tu ne vas pas en croire tes yeux\\](https://maps.app.goo.gl/r1SzMxyGwd4Rk9x96)",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "GillesDArgent",
                                            "body": "France baise ouais !",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "FrancoeurOff",
                    "body": "Le film de Watkins est un chef d'œuvre !",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "h2o52",
                    "body": "Pas vraiment : c'est une émeute post-défaite militaire assez classique. On peut la comparer à l'agitation post-défaite militaire de l'Allemagne de 1918, en beaucoup moins populaire.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "BasedBlanqui",
                            "body": "Très réducteur. La défaite n'a été que l'élément déclencheur. Misère de la classe laborieuse sous le Second Empire, tensions croissantes entre republicains pro-representativité et républicains pro-démocratie directe, organisation croissante des ouvriers, communalisme en vogue... Tout cela a joué.\nPas pour rien que les proto marxistes et les russes qui fomenteront 1917 par la suite ont suivi et étudié l'événement avec la plus grande attention...",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Natural_Ant7694",
                    "body": "L'abjection pure, ce post.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dreynard",
            "body": "J'ai jamais trop compris pourquoi ça avait tant imprimé dans les mémoires comparés à d'autres révolte (comme celles de 1848, qui avait un caractère socialiste par exemple): c'est très bref, ça foire partout sauf à Paris extrêmement vite, ça brise complètement les mouvements socialistes qui vont mettre pratiquement 20 ans à vraiment s'en remettre (avec au milieu des passages pas très glorieux, genre les blanquistes qui soutiennent Boulanger, notamment), ça sombre dans le factionalisme très vite et même le côté révolutionnaire est parfois un peu douteux(genre la demande de crédit à la Banque de France, c'était pas très révolutionnaire).\n\nAu final, ça a failli flinguer l'idée de République (avec les républicains qui ont du soutenir la répression de la Commune la larme à l’œil pour ne pas se faire marginaliser), ça n'a pas apporté d'acquis sociaux et ça a mis Paris à feu et à sang pour pas grand chose.",
            "score": 14,
            "replies": [
                {
                    "author": "realusername42",
                    "body": "C'est surtout un événement hyper important internationalement du fait que la Commune à inspiré la révolution russe.\n\nMais c'est sûr qu'à l'échelle de la France c'est au final assez mineur, la Commune n'a duré que deux mois au total...",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "Chance_Emu8892",
                    "body": ">comparés à d'autres révolte (comme celles de 1848, qui avait un caractère socialiste par exemple): c'est très bref\n\nC'est à dire \"très bref\" ? La révolution de 1848 elle-même n'a duré que quelques jours, la Commune plus de deux mois. Si tu inclus tous les événements d'avril ou juin on arrive certes sur le même ordre de grandeur, mais pas beaucoup plus. \n\nCe n'est pas pour nier l'importance de 1848 (qui n'est pas si oubliée que ça d'ailleurs, pour certains elle est plus importante que 1789) mais il ne faut pas sous-estimer non plus l'image de martyr de la Commune. La \"Semaine sanglante\" c'est quelque chose quand même, des dizaines de milliers de morts et des milliers de déportation, ça n'arrivait pas tous les jours même à l'époque, et c'est arrivé il n'y a pas si longtemps à l'échelle de l'histoire moderne de France, ça laisse de profondes cicatrices quand même (il nous faut quoi à toi ou moi, remonter trois fois l'arbre généalogique pour tomber dessus ? C'est quasiment à portée de main).\n\nEt le \"pourquoi\" c'est arrivé ici est très important : un gouvernement représentatif d'un côté, une commune auto-gérée par les parisiens de l'autre, le premier ne le supporte pas, et écrase son opposition dans le sang. Politiquement le \"gouvernement représentatif\" c'est toujours le mode de gouvernementalité sous lequel on vit, et il y a cette idée à gauche (pas totalement infondée) que l'organisation de l'état français moderne n'a jamais expié ses crimes contre sa propre population. \n\nAprès, il est vrai qu'il y a eu des tensions internes dans la Commune, comme énormément de révolutions dans l'histoire (y compris celle de 1848), et certes elle a eu moins d'impact législatif que d'autres événements mais elle laisse quand même un héritage majeure dans l'histoire politique : exemple concret que l'anarchisme et la démocratie directe sont tout à fait possible ou que les humains sont capables de réfléchir aux défis concrets que cela peut poser sur le moment (ce qui même aujourd'hui est quasiment tout le temps remis en doute par défaut, et au profit d'une représentativité qui a sorti les canons je rappelle, ce qui est hautement injuste), exemple avant l'heure de la séparation de l'église et de l'état, plus de conscription, nouvelle organisation du travail et du mode de production. \n\nLa Commune c'est la littérature socialiste (Marx, Proudhon, etc) qui a enfin réussi à devenir réalité et qui a été martyrisée par la bourgeoisie jalouse de garder son pouvoir. En terme de symbolique c'est très fort, et même si la Commune n'a jamais réussi à s'exporter en fait, elle s'est largement exportée symboliquement (le fait que la meilleure version du \"Temps des Cerises\" soit la version de Katō Tokiko est quand même fou quand on y pense rétrospectivement). Marx par exemple a vu de son vivant un gouvernement prolétaire prendre vie, et plus tard un des exégètes de Marx, un certain Vladimir Ilyich Ulyanov, s'en inspirera beaucoup. Il faut imaginer le vent d'optimisme de tous les lecteurs familiers de la littérature socialiste qui n'attendaient que ça, et qui ont vu leurs espoirs s'évanouir à cause d'un certain Adolphe.\n\nPar ailleurs la Commune n'a pas été si inutile en termes politiques, puisque la IIIe République a du prendre en compte une possibilité bien latente d'insurrection ouvrière tout au long de son existence. Il est donc tout à fait viable de considérer que les relativement rares concessions démocratiques faites pendant la IIIe sont liées de prés ou de loin à la seule cristallisation de démocratie directe prolétarienne d'une telle ampleur dans le pays (et ça fait encore plus mal de se dire que les ouvriers de maintenant se sont tournés vers l'extrême droite quand on se rappelle de l'héritage du 19e siècle).",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Dreynard",
                            "body": "> La révolution de 1848 elle-même n'a duré que quelques jours,\n\nL'élan de la Révolution de 1848 dure jusqu'aux journées de juin avec le gouvernement de Lamartine, ce qui est plus long, avec de vrais réalisations (suffrage universel, droit au travail...) et moins de violence que la Commune\n\n> La \"Semaine sanglante\" c'est quelque chose quand même, des dizaines de milliers de morts et des milliers de déportation, ça n'arrivait pas tous les jours même à l'époque, et c'est arrivé il n'y a pas si longtemps à l'échelle de l'histoire moderne de France, ça laisse de profondes cicatrices quand même\n\nConquête de l'Algérie, déportation de 1851, terreur blanche... Y a plein d'évènement au 19ème post Napoléon I similaire en France.\n\n> Et le \"pourquoi\" c'est arrivé ici est très important : un gouvernement représentatif d'un côté, une commune auto-gérée par les parisiens de l'autre, le premier ne le supporte pas, et écrase son opposition dans le sang\n\nC'est une vision très simpliste de la chose: il y a le siège des prusso-allemands, un paquet de parisiens qui désapprouvent de la Commune et fuient la ville, les communes dans le reste de la France qui foirent misérablement, l'escalade de la violence... La Commune meurt aussi dans l'indifférence du reste du pays (ce qui est un truc un peu sous-côté, je trouve- ça en dit long sur le conservatisme du pays ou au moins l'absence d'enthousiasme pour la Commune)\n\n> Par ailleurs la Commune n'a pas été si inutile en termes politiques, puisque la IIIe République a du prendre en compte une possibilité bien latente d'insurrection ouvrière tout au long de son existence\n\nCertes, mais la menace socialiste est bien antérieure à la Commune (cf 1848, encore). C'est une pensée qui habite beaucoup de l'action de Napoléon III avant, notamment. Du point de vue de l'héritage de la Commune dans les lois de la République, tu n'en vois pas vraiment jusqu'à la fin du 19ème et l'arrivée des socialistes. Peut être la levée des déportations, mais c'est pas un gain social ou politique très important (comparé aux retraites allemandes, aux journées de 8 heures, aux jours de repos, les limitations du travail des enfants...).",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Chance_Emu8892",
                                    "body": ">L'élan de la Révolution de 1848 dure jusqu'aux journées de juin avec le gouvernement de Lamartine, ce qui est plus long, avec de vrais réalisations (suffrage universel, droit au travail...) et moins de violence que la Commune\n\nOn parle de 4 mois contre 2, c'est pas beaucoup plus long non plus. Sur la violence c'est justement mon propos, la Commune a eu pour elle son aspect sacrificiel. \n\nDe plus le prémisse voulant que 1848 ait été oublié est déjà exagéré, elles (incluant les autres mouvements européens) ont eu une grande influence idéologique à gauche. Marx par exemple, quand il était journaliste, a couvert les événements en Italie, Grèce, Espagne, &c, et ça a eu une influence majeure sur sa pensée et donc sur la Commune. C'est aussi la source de plusieurs autres de ses ouvrages (dont \"Le 18 brumaire...\") qui était lu par certains communards. \n\n>Conquête de l'Algérie, déportation de 1851, terreur blanche... Y a plein d'évènement au 19ème post Napoléon I similaire en France.\n\nJe parle de répression de citoyens français en métropole, pas de guerre coloniale comme en Algérie et pas en nombre absolu de morts. Dans les répressions de ses propres citoyens par l’État, il y a peu d’événements de l'histoire moderne (et encore moins contemporaine) française qui puissent concourir avec la répression de la Commune (si tant est qu'on ose faire cette compétition macabre, mais tu as compris). On parle de 10k/15k morts quand même. \n\n>C'est une vision très simpliste de la chose: il y a le siège des prusso-allemands, un paquet de parisiens qui désapprouvent de la Commune et fuient la ville, les communes dans le reste de la France qui foirent misérablement, l'escalade de la violence...\n\n\"Des parisiens\" plutôt que \"les parisiens\" si tu préfères. \n\nLa Commune c'est la moitié de Paris de l'époque, ça reste complètement massif. De plus les classes populaires approuvaient en masse, il y avait bel et bien une rupture idéologique nette entre le prolétariat et la bourgeoisie. C'est peut être même à ce moment précis que la rupture entre les deux classes s'est le mieux cristallisée (un problème que ne manqueront pas de souligner les opposants à la gauche depuis lors, ben pour une fois on peut affirmer l'inverse). \n\n>Certes, mais la menace socialiste est bien antérieure à la Commune (cf 1848, encore). C'est une pensée qui habite beaucoup de l'action de Napoléon III avant, notamment. Du point de vue de l'héritage de la Commune dans les lois de la République, tu n'en vois pas vraiment jusqu'à la fin du 19ème et l'arrivée des socialistes.\n\nComme je l'ai dit il y a continuité idéologique entre 1848 et la Commune. Entre les deux la littérature socialiste a considérablement changé les esprits. Pendant ces 22 ans sont sortis et ont amplement circulé des ouvrages tels que le \"Capital\", \"Idée générale de la Révolution au dix-neuvième siècle\" de Proudhon, \"Catéchisme révolutionnaire\" de Bakounine, les écrits de Varlin, &c. \n\nSans compter les héritages issus de la Révolution de 89 (comme le drapeau rouge inspiré des Jacobins) ou les écrits de Rousseau (\"Contrat Social\" qui colle plus à une autogestion que la démocratie représentative). Sans compter tous les penseurs non-socialistes qui ont eu une fort impact idéologique sur la Commune, en particulier dans le contexte (guerre avec la Prusse) : en vrac Michelet, Blanqui, ou Tocqueville (dont \"La démocratie en Amérique\" a eu une influence majeure). \n\nEn bref avant la Commune, le corpus idéologique était extrêmement massif, autant voir plus qu'en 48, ce qui rend (à ce niveau du moins) la Commune tout à fait comparable en poids idéologique aux autres révolutions de ce siècle. \n\nQuant à l'héritage, comme je l'ai dit la IIIe s'est adaptée à l’événement. Beaucoup de nos acquis sociaux actuels ont un lien direct ou indirect avec ça. Cela a pris du temps mais ce n'étaient pas de nouveaux socialistes ayant totalement oublié 70-71 non plus, ils avaient tous en tête la Commune, et cela est resté pendant bien longtemps. Il est par exemple tout à fait possible de lier la loi sur la laïcité de 1905 à la Commune. Elle a surtout tellement marqué les socialistes en général qu'elle est devenue une sorte de mythe fondateur de la dictature du prolétariat. Le congrès anarchiste de Saint-Imier en est la conséquence directe pour l'anarchie, et par là la réorganisation des anarchistes, ainsi que la Deuxième Internationale quelques années plus tard. Aujourd'hui encore si les anarchistes sont généralement considérés, par l'opinion publique, comme des pestiférés utopistes, c'est certainement un héritage de la Commune (entendre \"la décrédibilisation intégrale de l'anarchisme par les classes dominants\"). \n\nPlus globalement, en dehors de la France, et hormis Lénine, la Commune était aussi bien connue de Mao Zedong lui-même, qui a souvent commenté l’événement. D'ailleurs en 1967 a existé la Commune de Shanghai sur le même modèle. En somme ce \"petit\" événement parisien dont tous les français se sont allègrement foutus a eu une influence sur virtuellement l'intégralité des socialistes/anarchistes/communistes depuis plus de 150 ans, et est directement liée à l'ethos de la deuxième puissance mondiale en 2025.\n\nSi ce palmarès te parait toujours insignifiant et d'une toute petite mesure, honnêtement j'admets ignorer tout à fait ce qui peut être plus important.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Dreynard",
                                            "body": "> De plus le prémisse voulant que 1848 ait été oublié est déjà exagéré, elles (incluant les autres mouvements européens) ont eu une grande influence idéologique à gauche. Marx par exemple, quand il était journaliste, a couvert les événements en Italie, Grèce, Espagne, &c, et ça a eu une influence majeure sur sa pensée et donc sur la Commune. C'est aussi la source de plusieurs autres de ses ouvrages (dont \"Le 18 brumaire...\") qui était lu par certains communards. \n\nAh, mais c'est pas mon point, mon point, c'est plutôt que 1870 va éclipser à un point (personnellement) déraisonnable 1848. De 1848, de l'expérience \"de gauche\" (un peu anticipé, mais tu vois où je veux en venir), dans la mémoire collective, il n'en reste quasiment rien aujourd'hui. Le référentiel, c'est 1870, 1917 en Russie, 1936... Même Gracchus aujourd'hui me paraît plus cité que le gouvernement de 1848, alors que 1848, c'est probablement le premier gouvernement proto-socialiste qui existe dans le monde moderne.\n\n> La Commune c'est la moitié de Paris de l'époque, ça reste complètement massif.\n\nAlors, là, j'ai une lecture complètement différente de la tienne: je trouve au contraire que la Commune illustre la perte d'importance relative de Paris. Toutes les révolutions, jusqu'au 4 septembre 1870, passait par Paris. La Commune, c'est une tentative de Révolution qui échoue un peu piteusement, où Paris, traditionnellement déjà un peu déphasé du reste de la France (par exemple, la vigueur et l'impact des sans culottes à Paris comparé au reste de la France initialement), se retrouve en décalage complet avec le reste du pays, et, pour la première fois, échoue complètement à imposer sa volonté au reste du pays: très peu de mouvements similaires qui échouent tous en moins de 3 jours et une apathie complète pour la répression des versaillais sur les révoltés.\n\n>  C'est peut être même à ce moment précis que la rupture entre les deux classes s'est le mieux cristallisée\n\nBen les manifestations de juin 1848 et leur répression, c'est assez similaire, je trouve: une lecture marxisante qui verrait la reprise en main de la République par la bourgeoisie face au prolétariat me paraît tout à fait pertinente (et c'est, il me semble, l'analyse qu'en fait Marx, d'ailleurs). Mais demande aux gens qui s'intéressent un peu à l'histoire de la gauche ce qu'ils en pensent et ils vont probablement te regarder d'un air vide. Même toi, qui me paraît plutôt intéressé et renseigné sur ces questions, ne l'a pas vraiment évoqué.\n\n> Il est par exemple tout à fait possible de lier la loi sur la laïcité de 1905 à la Commune.\n\nQuestion honnête: comment tu établis un lien fort entre les deux? Genre, l'anticléricalisme, c'était un truc que les républicains traînaient dans leur bagage idéologique depuis longtemps (Ferry et l'école publique par exemple, voir même les prémices avec le culte de l'être suprême) et Combes et son gouvernement me frappe pas spécialement pour leur proximité avec les idéaux communards, et Briand, lui, était trop jeune pour avoir connu la Commune (Jaurès aussi d'ailleurs, même s'il joue un plus petit rôle dans la loi de 1905 de mémoire). Qu'il y ait un lien ténu, oui, mais un lien fort, j'aimerais bien entendre tes arguments.\n\n> Aujourd'hui encore si les anarchistes sont généralement considérés, par l'opinion publique, comme des pestiférés utopistes, c'est certainement un héritage de la Commune (entendre \"la décrédibilisation intégrale de l'anarchisme par les classes dominants\"). \n\nJ'aurai plutôt dit que c'était le fait de \"la propagande par le fait\" qui avait été théorisé avant la Commune et, pour la France en particulier, les lois scélérates de 1890. J'aurais plutôt vu la Commune comme un chaînon important dans ce parcours, mais moins que les lois scélérates ou la pensée de Bakounine mais ta thèse sur ce point se défend.\n\n> Quant à l'héritage, comme je l'ai dit la IIIe s'est adaptée à l’événement.\n\nEt je reviens sur ce point du commentaire précédent\n\n>  la IIIe République a du prendre en compte une possibilité bien latente d'insurrection ouvrière tout au long de son existence.\n\nBen, les adaptations me semblent assez marginale sur la première partie de sa vie. La peur de l'insurrection a saisi tout les gouvernements sans exception et, en dehors des lois scélérates à la limite comme tu disais précédemment, j'ai du mal à voir grand chose dans le dispositif sécuritaire de l'époque que la Commune a forcé à changer. J'ajouterai que la République Française jusqu'au début du 20ème est extrêmement peu sociale, surtout comparé (assez ironiquement d'ailleurs) à l'Allemagne ou au Royaume uni. C'est un des reproches majeurs des contempteurs du statu quo de l'époque (en particulier des socialistes naissants) que l'immobilisme des gouvernements successifs sur ces questions, d'ailleurs. 1848, à l'inverse, a provoqué une réaction massive avec les restrictions du droit de vote (la loi sur les mobilités), l'abandon du droit au travail (qui fait un retour sous l'URSS d'ailleurs), les éloignements de chômeurs, la montée des conservateurs (qui aboutit à l'élection du Prince-Président et, in fine, à la crise de 1851) mais a aussi contribué à sanctuariser le droit de vote universel ou l'abolition de l'esclavage (même si dans les futures colonies, bon...). Peut être l'impact le plus durable de la Commune sur la Troisième, c'est l'implantation du républicanisme dans les campagnes et l'enracinement d'un conservatisme républicain (voir par exemple le revirement de Thiers sur la République que la Commune contribue puissamment à légitimer), avec en point d'orgue l'aboutissement de la stratégie de Gambetta sur la conquête des campagnes-mais c'est pas vraiment des choses que la gauche glorifie ou dont la Mémoire nationale se fait l'écho aujourd'hui. Je dirai que l'absorption des orléanistes dans la République a eu un leg bien plus puissant que la Commune sur la France en général.\n\nAprès, j'ai bien conscience que la Commune a été un évènement particulier, qui a capturé un imaginaire révolutionnaire et a été un catalyseur pour la réflexion de certain, comme tu le mentionnes -même si beaucoup de choses sur le socialisme ont déjà été écrites en amont- mais au prix d'une certaine oblitération d'autres évènements peut être plus impactant comme 1848. Je ne suis toujours pas convaincu que c'est pas un peu (beaucoup) surfait (du LARP un peu, comme disent nos amis anglois), que sa résonance sur le monde des idées ne dépasse pas de très loin la réalité de ce qu'elle fut, une révolte un peu idéaliste, très désorganisée et incohérente et, au final, ratée même si elle est une des sources d'évolutions bien ultérieurs.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "roguy_19",
                    "body": "Même sans ça je trouve que ça devient un doudou un peu ridicule de la gauche radicale. Franchement ça parle à qui de nos jours",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Dreynard",
                            "body": "Disons que je respecte la fascination pour l'idée révolutionnaire/révoltaire (?), même si c'est pas trop mon créneau, mais même là, y a eu d'autres mouvements français qui ont laissé des traces dans la Mémoire beaucoup plus mince que la Commune (genre 1848, au hasard, mais tu peux en prendre d'autres) sans que je me l'explique trop.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "beuhlakor",
                            "body": "A Paris ça parle encore un tout petit peu. Chaque année il y a quelques commémorations / manifestations à ce sujet. Ça ne réunit clairement pas les foules par contre.\n\nComme tu le dis, c'est devenu un doudou. Même si en vrai c'est un truc de losers la Commune.",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "roguy_19",
                                    "body": "Moi même j’aime bien mais politiquement c’est plus très intéressant imo",
                                    "score": -2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "StudentForeign161",
                            "body": "En effet, un exemple de démocratie directe et de contrôle de l'économie par les travailleurs, ça parle à qui à une époque où la démocratie libérale devient sénile, envoie encore les fachos au pouvoir et où une caste de milliardaires contrôlent nos sociétés ?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "roguy_19",
                                    "body": "Je connais cette théorie. Vraiment à part dans nos cercles de militants de gauche c’est hors sol de penser que ça a un intérêt politique imo.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "StudentForeign161",
                                            "body": "\"Y a pas d'alternative\". Thatcher a vraiment colonisé les cerveaux.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Jagarondi",
            "body": "Je peux upvoter sans me prendre un avertissement sur les contenus violents vous pensez...?",
            "score": 2,
            "replies": []
        },
        {
            "author": "ArthurSavy",
            "body": "Oui barbare je suis\n\nOui j'aime le canon ",
            "score": 3,
            "replies": [
                {
                    "author": "Whatev57",
                    "body": "Etonnament, c'est TRES efficace pour endormir les enfants quand on les tiens contre soi !    \nY a un truc de vibration qui les apaises à fond avec cette chanson.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Sicksadworludo",
                    "body": "La mitraille dans l’air,  \nAmis, amies, dansons !",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "AegoliusOfBurgundy",
            "body": "Quand nous chanterons, le Temps des Cerises...",
            "score": 3,
            "replies": []
        },
        {
            "author": "LeRaminagrobis",
            "body": "Gloire aux martyrs de la commune !\n\nEspérons qu'un jour leur idéal revienne.",
            "score": 1,
            "replies": [
                {
                    "author": "Natural_Ant7694",
                    "body": "T'inquiète, ton pote Poutine y travaille.",
                    "score": -9,
                    "replies": [
                        {
                            "author": "l-Electronaute",
                            "body": "Le rapport, très cher ?",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Natural_Ant7694",
                                    "body": "Tu n'en vois aucun? Lis par exemple La Pologne martyr de Michelet, écrit une petite décennie avant la Commune.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "l-Electronaute",
                                            "body": "Ce bon vieux Michelet, père du roman national, un historien extrêmement nationaliste à la limite du propagandisme. Mes confrères et consoeurs historiens lui doivent beaucoup mais ses thèses sont totalement à l'ouest niveau historicité. Je m'en passerai bien volontier.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Natural_Ant7694",
                                                    "body": "Dans ce livre, il reprend à juste titre ce que dit Mickiewicz.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "l-Electronaute",
                                                            "body": "Certes, mais où veut tu en venir ?",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "Natural_Ant7694",
                                                                    "body": "Je veux en venir au fait que la violence gratuite et le meurtre de masse sont au coeur de l'idéologie russe comme de celle de la Commune.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "l-Electronaute",
                                                                            "body": "Le meutre de masse serait au coeur de l'idéologie de la commune, plutôt qu'une conséquence de la révolte ? Aurait tu des exemples, il ne me viens à l'esprit, en exemple de meutres systèmétatique que ceux perpétrés lors de la purge menée par les versaillais, dont tu semble si fier de revendiquer la descendance.",
                                                                            "score": 5,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Natural_Ant7694",
                                                                                    "body": "Je les ai déjà cités. Le massacre gratuit des dominicains d'Arcueil, les assassinats d'otages.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "l-Electronaute",
                                                                                            "body": "Tu évoque deux épisodes de la semaine sanglante, contexte d'autant plus important. Ce sont des assassinats, gratuits, effectués en réponse et dans une ampleur fractionnaire face aux massacres commis par les Versaillais dans toute la ville : 14 fusillés a Arcueil, et une centaine d'otages estimé, les différentes estimations de communards massacrés orbitent autour des 10.000, sans compter les environs deux milles morts au combat.\n\nS'il faut designer une faction par sa barbarie, je ne me tournerai absolument pas vers la commune.",
                                                                                            "score": 3,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Natural_Ant7694",
                                                                                                    "body": "Tes chiffres sont fantaisistes et quand bien même seraient-ils exacts, ils ne justifient rien. On n'a pas d'exemple comparable durant l'Epuration, en particulier, ou dans le contexte de la Première Guerre mondiale.",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "l-Electronaute",
                                                                                                            "body": "Ces fameux chiffres fantaisistes sont émis par un historien reconnu, spécialiste de la question, le docteur Rougerie (La Commune de 1871, aux Presses universitaires de France, 2021).\n\nQuant à ce que tu considères comme une justification, mais que je voit plutôt comme une mise en contexte, elle met surtout en lumière que l'expression la plus vaste et intense de violence est distinctement le fait des Versaillais.\n\nJ'ai bien du mal a percevoir les frontières de tes fantasmes, mais si d'aventure tu a mieux a citer que des ouvrages archaïques vieux de deux-cents ans, je suis preneur.",
                                                                                                            "score": 2,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Natural_Ant7694",
                                                                                                                    "body": "Quelle est sa méthodologie? On ne trouve pas une telle surmortalité en mai 1871. 1863, ce n'est pas 200 ans. Et quand Michelet écrit à cette époque que la Russie est entièrement communiste, ça me fait voir d'un autre oeil le marxisme-léninisme.",
                                                                                                                    "score": 0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "l-Electronaute",
                                                                                                                            "body": "Une analyse comparative et critique des rapports de l'armée et de la police, des cimetières, des recensements de population, et par la prise en compte des fosses et autres inhumations sauvages.\n\nQu'à tu à répondre, si ce n'est louvoyer en cherchant une faille méthodologique dans un travail scientifique reconnu, un travail auquel tu n'a manifestement rien a opposer.\n\nBref, si tu tiens tant a botter en touche, je vais vite me lasser de tes élucubrations.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "Natural_Ant7694",
                                                                                                                                    "body": "Il n'y avait pas de recensement à Paris à l'époque. Et où se trouvent les traces écrites de ces fosses et inhumations sauvages? Si elles étaient sauvages, elles n'auraient pas dû laisser de traces. Quant à la surmortalité aperçue à travers les registres d'inhumations, non seulement elle est très loin de faire apparaître ce nombre délirant de victimes, mais elle peut être due aux massacres des communards eux-mêmes.   \nJ'irai voir quand même ce bouquin mais je n'en crois pas un mot.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "LeRaminagrobis",
                            "body": "Qu'est ce que tu racontes ? Poutine est un autocrate fasciste c'est quoi le rapport avec la Commune ????\n\nGenre Poutine = Russe = Soviétique = Communiste = Commune c'est ça le niveau ?",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Natural_Ant7694",
                                    "body": "Absolument, aussi bien au niveau des objectifs que des méthodes criminelles. L'assassinat des dominicains d'Arcueil ne passe pas.",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Thyriam",
            "body": "[https://www.youtube.com/watch?v=iHfM39Yt0GM](https://www.youtube.com/watch?v=iHfM39Yt0GM)\n\n  \nPour ceux qui veulent se mettre dans l'ambiance",
            "score": 1,
            "replies": []
        },
        {
            "author": "Plume_rr",
            "body": "ca va mal finir cette histoire !\n\nJoyeux jour du gâteau quand même",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cadnat",
            "body": "Épisode de Culture2000 sur le sujet pour ceux que ça intéressent \n\nhttps://open.spotify.com/episode/3SlKwZqusM6fumB6x3Ej6a?si=qFarBHvcSO6s0kORrBY_sg",
            "score": 1,
            "replies": []
        },
        {
            "author": "Natural_Ant7694",
            "body": "Bonjour,\n\n  \nCi-joint une photo de mon arrière-arrière grand oncle Olivier, qui était soldat dans le 110e du côté Versaillais bien sûr : [https://zupimages.net/up/25/12/im9i.jpg](https://zupimages.net/up/25/12/im9i.jpg)\n\n[https://zupimages.net/up/25/12/7p8e.jpg](https://zupimages.net/up/25/12/7p8e.jpg)",
            "score": 1,
            "replies": [
                {
                    "author": "SoleilNoir974",
                    "body": "petit air de Louis Boyard à droite",
                    "score": -1,
                    "replies": [
                        {
                            "author": "Natural_Ant7694",
                            "body": "Ah oui, tu trouves?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Afar-a-cote",
            "body": "Marrant de voir qu'à l'époque Paris votait déjà bien différemment du reste du pays !",
            "score": 1,
            "replies": [
                {
                    "author": "Natural_Ant7694",
                    "body": "Comment ça, \"votait\"?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ewenf",
            "body": "Salauds de va-t-en-guerre. Ils auraient dû signer la paix au lieu d'avoir tous ces morts.",
            "score": -6,
            "replies": [
                {
                    "author": "New_Carpenter5738",
                    "body": "C'est à croire que le prénom Adolphe est maudit à n'être porté que part des salauds. Triste.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "Natural_Ant7694",
                    "body": "Ils auraient surtout dû s'abstenir de massacrer entre autres les Dominicains d'Arcueil, de brûler les Tuileries, l'Hôtel-de-Ville et le tribunal.",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dontevenwannacomment",
            "body": "c'est une des colonnes de Nation dans l'arrière-plan?",
            "score": 0,
            "replies": [
                {
                    "author": "Zealousideal-Pool575",
                    "body": "J'aurais dit Vendôme",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -4,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "LesRazmodket",
                    "body": "Bonjour,\r\n\r\nCe contenu a été supprimé. Merci de t'exprimer sans chercher à troll. Le troll inclut, mais ne se limite pas à, la désinformation, le [concern trolling](https://www.urbandictionary.com/define.php?term=concern+troll), le [sealioning](https://fr.wikipedia.org/wiki/Sealioning).\r\n\r\n------------------\r\n\r\nThis content has been removed. Please express yourself without trolling others. Trolling includes but is not limited to disinformation, concern trolling or sealioning.\r\n\r\n\r\n\r\nLes règles de /r/france sont [disponibles ici](https://www.reddit.com/r/france/wiki/regles?utm_source=reddit&utm_medium=usertext&utm_name=france&utm_content=t1_em586i2). Pour contester cette action, ou pour toute question, merci d'envoyer un [message aux modérateurs](https://www.reddit.com/message/compose?to=%2Fr%2Ffrance).\r\n\r\nMerci de ta compréhension.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "BoeufCarottes",
            "body": "elle fête rien du tout elle a duré 72 jours",
            "score": -12,
            "replies": []
        },
        {
            "author": "Natural_Ant7694",
            "body": "Voici comment le Journal des débats rend compte à chaud de la fin de la Semaine sanglante dans son édition du 31/05/1871 : \"Oh! les barbares! Cette ville que l'ennemi avait respectée, qu'il n'avait pas osé brûler de peur d'attirer sur sa tête et sur son histoire la malédiction du monde, voilà donc ce que ces scélérats en ont fait! Il faut remonter aux grandes destructions des cités bibliques pour trouver un exemple d'une semblable désolation. Ils sont venus, les dévastateurs, de tous les points de l'horizon, portés sur les ailes de la tempête. Qu'on ne leur cherche ni nationalité ni drapeau; ils n'étaient d'aucun peuple; c'étaient des sauvages sans patrie, sans feu ni lieu, ni Dieu. C'étaient les cosmopolites du brigandage, du pillage et de l'assassinat qui étaient venus s'abattre sur Paris et en avaient pris possession comme des forbans s'emparent d'un navire,\n\nEt leur règne et leur mort ont été le règne et la mort des forbans. Comme on le lit dans les récits de naufrages, quand  ils se sont vus cernés et entourés d'un cercle de fer et de feu, quand ils ont vu arriver la justice et la vengeance marchant d'un pas sûr, régulier et implacable, ils ont voulu couronner leur carrière de crimes par une sanglante orgie ; ils ont massacré les prisonniers, mis le feu au navire, et sont descendus dans l'abîme en blasphémant.\"\n\nOn ne saurait mieux dire.",
            "score": 1,
            "replies": []
        }
    ]
}