{
    "title": "Un manuel de survie en cas de crise majeure va être distribué aux Français",
    "author": "Andvarey",
    "subreddit": "france",
    "rank": 12,
    "score": 370,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 184,
    "url": "https://www.lefigaro.fr/actualite-france/un-manuel-de-survie-en-cas-de-crise-majeure-va-etre-distribue-aux-francais-20250318",
    "id": "1je2dmm",
    "selftext": "",
    "comments": [
        {
            "author": "juanxmass",
            "body": "Pour savoir quoi faire en cas d'attaque nucléaire, il faut regarder le film anglais Threads (années 80)\n\nMa conclusion, se mettre à découvert le plus proche possible du point d'impact",
            "score": 234,
            "replies": [
                {
                    "author": "amojitoLT",
                    "body": "Faut pas s'embêter avec ça, tout le monde sait qu'il suffit de se planquer dans un frigo.",
                    "score": 42,
                    "replies": [
                        {
                            "author": "UFight",
                            "body": "J'ai le chapeau mais pas le fouet, ça ne fonctionnera pas 😶",
                            "score": 10,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "QuintessentialCat",
                    "body": "J'ai regardé \"La Bombe\" (je ne connais pas le titre en anglais) que mon père avait en VHS et nous a montrés quand on a eu l'âge. Il avait été complètement traumatisé par la guerre froide. Je me souviens avoir arrêté quand l'officier britannique met une balle dans la tête à des irradiés allongés sur le trottoir pour abréger leurs souffrances, faute de pouvoir les prendre en charge.\n\nVoilà voilà.",
                    "score": 75,
                    "replies": [
                        {
                            "author": "juanxmass",
                            "body": "Oh, je viens de trouver ce que je vais regarder le prochain coup où je me trouve trop joyeux !",
                            "score": 31,
                            "replies": []
                        },
                        {
                            "author": "De-Boudainville",
                            "body": "Moi j'ai regardé \"Un gars et son chien\" et ce que j'ai retenu c'est qu'en tant que meuf, j'suis dans la merde.",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "McCabbe",
                                    "body": "Sinon, tu peux aussi regarder l'excellent (et méconnu) *Malevil*, pour en conclure que, en tant que meuf, t'es dans la merde.",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "JackHinks",
                                            "body": "Et que la meilleure solution est d'habiter un château fort en Ardèche avec quelques copains jardiniers",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Mr_Out",
                            "body": "Tu parles de celui-ci ?\nhttps://fr.m.wikipedia.org/wiki/La_Bombe",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "QuintessentialCat",
                                    "body": "Oui c'est bien ça, The War Game en anglais. J'étais pas sûr mais en regardant Wikipedia c'est bien dans ce film :\n\n\"The worst-affected victims are left to die alone or shot by police as a form of [mercy killing](https://en.wikipedia.org/wiki/Mercy_killing).\"\n\nEt ce docufiction, c'est *juste* dans le Kent anglais, donc à l'échelle d'une poignée de villes. Il incite à imaginer qu'il se passe la même chose dans le monde entier.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "TakuanSoho",
                            "body": "Je conseille à chacun aussi \"Barefoot Gen\" aussi nommé \"Gen d'Hiroshima\", un long métrage d'animation relatant l'histoire d'un gamin japonais qui survit à au bombardement de 45.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AngieDavis",
                    "body": "\"Quand souffle le vent\" est pas mal non plus dans ce délire. J'ai toujours pas trouvé le courage de regarder Threads.\n\n\"Ne survie pas une attaque nucléaire\" c'est clairement la leçon que j'en tire en tout cas.",
                    "score": 29,
                    "replies": [
                        {
                            "author": "Ea50Marduk",
                            "body": "J'ai eu le courage (ou l'inconscience) de regarder *Threads* et je n'en suis pas ressorti indemne. Ce téléfilm (disponible entièrement sur YouTube) présente de façon réaliste et crue, sans filtre, les conséquences d'une attaque atomique mondiale et de l'hiver nucléaire qui s'en suit.\n\nGlaçant.",
                            "score": 31,
                            "replies": [
                                {
                                    "author": "Foxintoxx",
                                    "body": "Malheureusement , les théories et simulations concernant les hivers nucléaires produites au pic de la guerre froide étaient erronées tel que l’ont démontré les incendies des puits de pétroles au Kowait en 1991 : l’effet de « lofting »du rayonnement sur les cendres a été largement surestimé . Un effet local et immédiat est bel et bien présent , mais impossible qu’il persiste plusieurs années .\n\nLes seuls bombes capables de rendre une région réellement inhabitable pendant plusieurs années seraient des bombes au cobalt 60 qui peuvent , en fonction des quantité , rendre la zone affectée mortellement radioactive pendant une décennie ou deux . Mais officiellement , aucun pays ne développe ce type de bombe .",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "CouteauBleu",
                                            "body": "> Malheureusement \n\nAh bah non, l'inverse!",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Foxintoxx",
                                                    "body": "Bof , c’est cool quand même le mythe de pouvoir rendre une zone inhabitable sur des laps de temps bibliques . Malheureusement la physique n’est pas d’accord .",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Alazareth",
                                    "body": "> l'hiver nucléaire qui s'en suit.\n> \n> Glaçant.\n\nJustement...",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Ea50Marduk",
                                            "body": "Ce jeu de mots était totalement imprévu. Bien vu !😂",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Baud10",
                                    "body": "Il est disponible en français ?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Ea50Marduk",
                                            "body": "Non, que en anglais. :(",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Astyan06",
                                    "body": "J'ai une question con mais, est-ce que c'est gore ou c'est psychologiquement intense ? Ou les deux ?\nJe vois beaucoup de monde parler du film en ce moment, pas encore regardé.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Ea50Marduk",
                                            "body": "C’est plus psychologique. Durant la scène d’attaque, on voit les gens courir, on les entend hurler, on en voit deux personnes brûler vivantes, puis des corps carbonisés et des blessés sous le choc. S’ensuit les conséquences : la nourriture est confinée, les gens blessés ou malades sont opérés dans un hôpital délabré, les gens meurent de fin puis de froids, le pillage est de mise, les générations suivantes parlent un anglais approximatif dû à l’effondrement de la société. Le tout est filmé de manière froid, documentaliste, ce qui renforce l’immersion et le réalisme du film.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Jotun35",
                                                    "body": "Sinon t'as The Road avec les cannibales...",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "secretsantakitten",
                            "body": "Ce film est au meme niveau que le tombeau des lucioles pour moi. C’était définitivement du très très lourd.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Jotun35",
                                    "body": "Pour moi le tombeau des lucioles c'est juste le début qui est très dur. Après... Bah ça ne peut pas être pire en fait.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "irsute74",
                    "body": "Ça me semble vraiment être là meilleure solution. Comme j'habite Paris je suis assez content de savoir que si ça part vraiment en couille je devrais être vaporisé instantanément ce qui est de loin ce qui peut t'arriver de mieux dans cette situation je trouve.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Latin_Crepin",
                    "body": "Je vis à ~2 km d'une cible principale. Même si je suis dans ma cave, je suis vaporisé sans l'avoir perçu puisque la fusée est supersonique et l'onde d'énergie aussi à cette distance. C'est mieux qu'être à 30 km de là.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "UltraChilly",
                            "body": "Tout dépend de la bombe, y'a pas mal de bombes pour lesquelles \"à 30km de là\" c'est assez loin pour que tu sois safe...\n\nBon, c'est principalement nos bombes à nous... Mais quand même...",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "tanaephis77400",
                    "body": "Argh, tu me remets des souvenirs dégueulasses en tête. Threads est épouvantable. Sans doute l'un des trucs les plus réalistes que j'ai vus dans ce domaine.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "gerundio_m",
                    "body": "J'étais arrivé à la même conclusion.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Wokati",
            "body": "Il y avait déjà des pages web avec ces infos :\n\nhttps://www.info.gouv.fr/risques/se-preparer-a-une-situation-durgence\n\n(c'est aussi dispo sur beaucoup de sites de collectivités)\n\nDonc je suppose qu'ils vont juste distribuer une version papier.",
            "score": 96,
            "replies": [
                {
                    "author": "zambaros",
                    "body": "Se reposer sur twitter en cas d'urgence ce n'est plus la meilleure stratégie depuis que ça se nomme X...",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "Codex_Absurdum",
                    "body": "Largage de tracts?",
                    "score": 14,
                    "replies": [
                        {
                            "author": "floweb",
                            "body": "Vice City style!!!",
                            "score": 9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "drapeau_rouge",
                    "body": "J'y avais pensé aussi mais ce sera surement une version révisée car actuellement il n'y a pas d'instructions en cas de conflit armé, ce qui sera une nouveauté.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Heikot",
            "body": "C'est une bonne précaution mais ça va foutre encore plus les pétoches à ceux qui sont déjà stressés par le 20H.",
            "score": 259,
            "replies": [
                {
                    "author": "wurnthebitch",
                    "body": "Certes mais on peut pas s'empêcher d'informer parce que les gens ne gèrent pas l'info.",
                    "score": 115,
                    "replies": []
                },
                {
                    "author": "kreeperface",
                    "body": "Je sais pas. Les commentateurs sur le Figaro je pense que c'est le bon profil pour avoir peur de leur ombre tellement ils voient de l'insécurité partout. Et là pourtant ils sont tous à dire que c'est de la manipulation. \n\nEn fait je crois qu'ils sont tellement matrixés que dans leur tête le seul et unique danger possible c'est se faire agresser par des minorités.",
                    "score": 61,
                    "replies": [
                        {
                            "author": "SnowceanJay",
                            "body": "Ils sont surtout matrixés pour être toujours en opposition au gouvernement quelle que soit la pertinence des mesures.\n\nJe suis convaincu que pendant le COVID, ils se seraient jetés sur les vaccins si le gouv les avait interdits au lieu de les rendre obligatoires.",
                            "score": 50,
                            "replies": [
                                {
                                    "author": "realusername42",
                                    "body": "C'était le cas, quand Macron est allé au théâtre « c'est une maladie grave et on nous cache tout !!! », le confinement arrive une semaine après « c'est n'est qu'un rhume et on veut nous enfermer !!! »\n\nEt ça c'est pas une exagération, je l'ai entendu de la même personne à une semaine d'intervalle. Ça te questionne si tout tourne rond chez eux.",
                                    "score": 22,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "hyrogal",
                            "body": "Les Russes c'est pas une menace, ils sont blancs",
                            "score": 26,
                            "replies": [
                                {
                                    "author": "Quas4r",
                                    "body": "En plus ils sont chrétiens et ils aiment pas les pédés, ce sont donc des gentils.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "tanaephis77400",
                                            "body": "Et ils peuvent légalement taper leur femme. Que demander de plus ?",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "tanaephis77400",
                            "body": "Il y a en effet un nombre effarant de profils de ce type (et j'en ai rencontrés). Les transsexuels et les migrants menacent notre société d'effondrement, mais le réchauffement climatique n'existe pas et Poutine est gentil.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LapinTade",
                    "body": "Cnews avec sa propagandiste de RT va nous dire qu'on attise la peur et la violence et que l'on provoque la Russie qui se sent maintenant menacée.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "Natural_Ant7694",
                            "body": "C'est déjà le cas, apparemment Bilger a fait une saillie en ce sens.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Brave-Aside1699",
                    "body": "A un moment on peut pas niveler par le dessous indéfiniment, surtout quand on parle de sécu nationale",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Renard4",
                    "body": "Les gens votent à droite quand ils ont peur, ça a été démontré. Donc c'est une stratégie politique mûrement réfléchie.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Heikot",
                            "body": "Mouais, faut pas voir la grande méchante droite à la manœuvre partout non plus.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Renard4",
                                    "body": "Ce manuel ne fait pas suite à une intervention du saint-esprit il me semble, mais peut-être que je me trompe.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Heikot",
                                            "body": "Non mais dans ce cas là, vous pouvez voir la volonté de faire peur dans toutes les communications gouvernementales. \n\nEn Suède, ils ont un guide [Om kriget kommer](https://en.wikipedia.org/wiki/In_case_of_crisis_or_war), sur ce qu'il faut faire en cas de guerre, distribué en 2018, sous [Stefan Löfven](https://fr.wikipedia.org/wiki/Stefan_L%C3%B6fven), parti socialiste. Il devait viser à faire gagner la droite selon vous?",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "choo-t",
                    "body": ">  ça va foutre encore plus les pétoches à ceux qui sont déjà stressés par le 20H.\n\nC’est le but.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "Thor1noak",
                    "body": "C'est le but",
                    "score": -9,
                    "replies": [
                        {
                            "author": "Half-Light",
                            "body": "et tous les oiseaux sont des drones fabriqués par le gouvernement!",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Thor1noak",
                                    "body": "Les oiseaux n'existent pas.",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "cerdan09",
                                    "body": "r/BirdsArentReal",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "EyeLoop",
                    "body": "Tkt c'est prévu. Ils voteront \"mieux\".",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Zventibold",
            "body": "Pour rappel si vous cherchez \"dicrim\" et le nom de votre commune, y a des chances que vous trouviez un document qui liste les risques auxquels vous êtes exposés, et quoi faire en cas de problème. (spoiler : allumez la radio pour vous informer, saturez pas les lignes téléphoniques)   \n\nSinon il y a [Géorisques](https://www.georisques.gouv.fr/)   \n\n\nJ'ai l'impression que le doc dont parle l'article, c'est juste un DICRIM à l'échelle nationale. C'est pas une mauvaise idée, mais faut communiquer un minimum dessus pour pas que ça soit anxiogène...",
            "score": 93,
            "replies": [
                {
                    "author": "Nibb31",
                    "body": "Malheureusement, de moins en moins de gens possèdent une radio FM, alors que c'est un élément essentiel dans tous les plans de gestion de crise. Le fait de basculer à la radio numérique n'arrange pas les choses.\n\nPour info: Si vous entendez la sirène d'alerte civile, la consigne est d'écouter France Bleu pour avoir des infos. Chaque foyer devrait avoir au minimum une radio FM à piles.\n\nBeaucoup de progrès technologiques manquent cruellement de résilience. Un autre exemple, c'est la disparition des lignes téléphoniques terrestres. Autrefois les centrales téléphoniques étaient construites dans des bâtiments renforcés et le réseau disposait de sa propre alimentation 48V indépendante.",
                    "score": 41,
                    "replies": [
                        {
                            "author": "Irkam",
                            "body": "> Malheureusement, de moins en moins de gens possèdent une radio FM\n\nPlus con que ça, même quand on avait encore des jack sur la plupart des téléphones, la plupart n'avaient déjà plus de tuner FM, sans même parler de DAB+. Sur les téloches actuelles c'est pas non plus garanti qu'elles aient la FM. Les seuls trucs sur lesquels j'ai la FM chez moi (en même temps je l'écouter régulièrement) c'est l'intercom de mon casque moto, l'ampli home cinema, et une UV5R.",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "cerdan09",
                                    "body": "J’ai acheté une radio solaire + batterie à 10€ pas plus tard que la semaine dernière dans mon magasin de bricolage du village, et qui marche du feu de Dieu !\n\nJ’espère n’en avoir jamais besoin, mais à ce prix là j’allais pas me priver.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "Mayplesheep",
                                    "body": "Ca fait quand même trois radio pour un foyer",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Irkam",
                                            "body": "Et encore, plutôt deux et demie vu que je porte pas le casque moto à la maison et que ça compte comme l'autoradio si tu veux.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "IseultDarcy",
                            "body": "Oui enfin j'ai une fois eut une de ces situations: la sirène durant 2h30, répétant en boucle \"alerte confinement , ceci n'est pas un exercice\" et le reste du message était incompréhensible. Pour l'entendre (à moitié donc...), il fallait ... ouvrir la fenêtre et tendre bien l'oreille (j'étais au centre ville à 30m de la mairie..). Personne n'a vraiment réagit dans la rue, les gens se promenant... etc.\n\n J'ai écouté la radio, consulté le site de la ville, de la caserne locale, des divers sites d'informations locaux. RIEN. Ni ce jour-là, ni le lendemain, ni après.\n\nC'est un collègue qui connaissait quelqu'un qui m'a appris qu'une voiture suspecte, c'était introduite dans la centrale d'à côté.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "Apt-Q258",
                            "body": "France Bleu qui vient d’être renommé « Ici »… \nParce que…",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "magemax",
                            "body": "C'est vrai que c'était trop bien quand y avait une coupure de courant chez toi mais que le téléphone fonctionnait quand même.  J'avais l'impression d'être un hacker (alors que j'étais juste un gars de 7 ans qui avait un téléphone chez lui, et que je n'avais clairement jamais entendu le mot \"hacker\" vu que c'étaient les années 80)",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Bullshit_deluge",
                            "body": "Encore mieux que les piles : une radio à manivelle qui se recharge vite !",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "6594933",
                    "body": "Je ne vois rien en cas de guerre sur le DICRIM de Paris par exemple.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "Competitive_Army60",
                            "body": "Je pense qu'en cas de guerre nucléaire, les parisiens n'ont plus trop de soucis à se faire sur leur avenir.",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "Martoche",
                                    "body": "Et plus besoin de venir dans le Sud parce qu'il y fait chaud.",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "Nibb31",
                                    "body": "Brest, Toulon, Istres et St Dizier seront partis avant...",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Zeptocell",
                                    "body": "C'est ça, concrètement l'IDF entière va se faire MIRVer sa pute de mère et toutes les routes seront tellement encombrées que personne ne pourra s'échapper. C'est super triste mais à moins d'être dans le fin fond des Yvelines ou de la Seine-et-Marne, c'est 0% de chances de survie à une attaque nucléaire majeure.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "6594933",
                                    "body": "Non mais la veille un peu.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "More_Extent_3165",
                    "body": "Merci pour la précision qui rend le truc plus cohérent et moins anxiogène.",
                    "score": 20,
                    "replies": [
                        {
                            "author": "Zventibold",
                            "body": "Pas de souci ! C'est un problème récurent avec la prévention des risques, on ne voit que le côté contraignant (\"je peux pas construire ici parce qu'il y a eu une inondation y a 50 ans !\") ou anxiogène, mais pas le côté pratique (en étant préparé, on réduit grandement les dégâts le jour où quelque chose arrive).",
                            "score": 9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "RageLolo",
                    "body": "Bon bah je viens de découvrir des risques que je ne soupçonnais pas chez moi et à mon adresse... Merci pour ce lien !",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "_KiiTa_",
                    "body": "Je connaissais pas, je voulais découvrir et il n'y en a pas pour ma commune 🥲\n\n\nPar contre il semblerait qu'il existe le DDRM qui est l'équivalent pour le département au moins.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Zventibold",
                            "body": "C'est moins \"novice friendly\" comme document, mais ça fonctionne bien !",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Jefforion",
                    "body": "Merci de l'info. Même si être pas loin de site militaire et dont un nucléaire (pour dire, j'entends leur alarme de tests en plus de celle du premier mercredi du mois) était un petit indice :)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Folivao",
            "body": "Petit rappel que si vous passez les premiers secours civils (PSC, ancien PSC1) auprès de la Croix Rouge (je sais pas si les autres organismes le font) vous bénéficiez souvent d'un module de préparation aux catastrophes.\n\nC'est une soixantaine d'euros la journée (selon les unités locales) mais ça peut être offert en échange de quelques heures de bénévolats. Avec les journées nationales (la quête) qui arrivent (du samedi 17 mai au dimanche 25 mai), vous pouvez tout à fait contacter votre unité locale pour faire des créneaux de quêtes en échange d'une formation PSC gratuite.",
            "score": 20,
            "replies": []
        },
        {
            "author": "museum_lifestyle",
            "body": "Comment gerer une penurie de chocolatine dans les boulangeries.",
            "score": 8,
            "replies": [
                {
                    "author": "QuMaeve",
                    "body": "Il faudra se rabattre sur les pains au chocolat",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "maud_brijeulin",
            "body": "Pour les amateurs d'attaque nucléaire et de vintage:\n\nhttp://www.roc-heritage.co.uk/uploads/7/6/8/9/7689271/protectandsurvive.pdf",
            "score": 7,
            "replies": []
        },
        {
            "author": "peregrine-l",
            "body": "C’est nouveau, d’habitude on a le droit à un numéro vert.",
            "score": 16,
            "replies": [
                {
                    "author": "MadameConnard",
                    "body": "\"Il fait chaud\"",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "wartoofsay",
            "body": "tant que c'est pas un manuel valls",
            "score": 20,
            "replies": [
                {
                    "author": "QuMaeve",
                    "body": "Astuce n°1 : partir manger de la paëlla le temps que ça se tasse",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "LlamaLoupe",
            "body": "Cool. Rassurant. Ca rappelle les prospectus pendant la guerre froide où ils expliquaient comment survivre à une attaaquu nucléaire. (en se cachant sous une table, super efficace)",
            "score": 36,
            "replies": [
                {
                    "author": "papimougeot",
                    "body": "J'ai vu un documentaire historique, il faut se cacher dans un frigo.",
                    "score": 50,
                    "replies": [
                        {
                            "author": "Chaines08",
                            "body": "Ce documentaire historique c'est Indiana Jones 4 ou Fallout 4 ?",
                            "score": 29,
                            "replies": [
                                {
                                    "author": "papimougeot",
                                    "body": "Il portait un chapeau et un lasso dans mes souvenirs.",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "kadreg",
                                            "body": "ok, donc fallout 4 : https://www.reddit.com/r/Fallout/comments/11dh2b/indiana_jones_easter_egg_in_fallout_new_vegas/",
                                            "score": 11,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "xylophone21000",
                    "body": "On est d'accord que la table ne te protégera pas si tu es pile sur le lieu de l'explosion, désolé les brestois.\nMais même a 50 kilomètres les dégâts peuvent être importants sur les bâtiments.\nÇa serait dommage de survivre au souffle d'une bombe et mourir tué par un bout de placo qui te tombe sur la tête.",
                    "score": 39,
                    "replies": [
                        {
                            "author": "snouz",
                            "body": "Pas sur que j'ai envie d'être épargné en cas d'échange nuclaire. Pas sur que les pronostics de survie sont très bons après non plus de toute façon.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Nibb31",
                    "body": "En fonction de la distance par rapport à l'explosion, c'est absolument pas déconnant.\n\nLa plupart des gens ne réalisent pas qu'une bombe atomique n'est pas \"si\" puissante que ça. À partir de 10 km de l'épicentre tu as plus de chances d'être blessé ou tué par des éclats de verre ou des débris que par les effets thermiques ou de blast.\n\n[https://nuclearsecrecy.com/nukemap/](https://nuclearsecrecy.com/nukemap/)\n\n\n\n[https://nuclearsecrecy.com/nukemap/](https://nuclearsecrecy.com/nukemap/)",
                    "score": 19,
                    "replies": [
                        {
                            "author": "tanaephis77400",
                            "body": "J'aime bien le \"conseil\" donné au début de la série Fallout : \"Si tu vois un champignon atomique à l'horizon et qu'il est plus petit que ton pouce au bout de ton bras tendu, cours te mettre à l'abri. S'il est plus grand, assieds-toi pour attendre la fin\".",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "draxredd",
                    "body": "https://fr.wikipedia.org/wiki/Duck_and_cover",
                    "score": 7,
                    "replies": [
                        {
                            "author": "citronfurtif",
                            "body": "https://www.youtube.com/watch?v=IKqXu-5jw60\n\nBert The Turtle !",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Artyparis",
                    "body": "J'ai fait mon service, je sais survivre à une explosion nucleaire : suffit de s'allonger dans la direction du champignon.\nLe casque protège ainsi tout ton corps des radiations.\n\nAh, il ne faut pas regarder l'explosion sinon ça te brûle les yeux. Évident.\n\n\nVoilà. Facile hein ?!\n\nEt moi qui me faisais toute une montagne des bombinettes. Pfff /s",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Chance_Emu8892",
                            "body": "Tu m'a rappelé un flashback du Hiroshima de Hersey avec les mecs qui ont les yeux qui ont fondus dans leurs orbites et qui ne comprennent même pas pourquoi ils ont un \"problème\" de vue.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "FireNunchuks",
                    "body": "En soit c'est plus que la france a un retard de fou sur la prévention et formation à ces trucs. Les pays scandinaves par exemple essaye de garder tout le monde prêt. Ça veut dire quelques conserves de l'eau des bougies... C'est plus la situation des gens qui ont 2 jours de courses qui devrait être une anomalie.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "IntelArtiGen",
                            "body": "La France a des recommandations similaires à tous les pays en réalité, c'est juste que peu de gens le savent: https://www.info.gouv.fr/risques/se-preparer-a-une-situation-durgence \n\nLa base c'est d'avoir 2 semaines d'eau chez soi. Ca sert à TOUT: innondation, pandémie, maladie, guerre, invasion d'alien, ou de zombie (ou de zombie-alien) etc. etc.",
                            "score": 27,
                            "replies": [
                                {
                                    "author": "Kamalen",
                                    "body": "Selon le type d’alien, l’eau c’est une arme redoutable en plus",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "Folivao",
                                            "body": "Dans le doute j'ai toujours des pistolets à haut et une compilation de yodel à portée de main.",
                                            "score": 8,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "FireNunchuks",
                                    "body": "Oui totalement c est plus un probleme de diffusion que de rédaction",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Stoopidfucc",
                    "body": "aprés t'as l'histoire de gen d hiroshima qui survivrait comme ça, mais bon pas la même tech/puissance qu'aujourd'hui non plus. Et il faut être à la bonne distance forcément.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "LothorBrune",
                            "body": "Je sais plus à quel point les bombes actuelles sont plus puissantes que celles d'Hiroshima, mais c'est assez terrifiant.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Wild_Haggis_Hunter",
                                    "body": "Hiroshima : 13-18 kT de TNT  \nM83 (la tête nucléaire la plus puissante de l'arsenal US toujours en activité) : 1.200 kT  \nEC17, EC24, B41 (les plus puissantes conçues par les US du temps où utilisaient encore des bombardiers) : 25.000 kT\n\nAujourd'hui les ogives emportent plusieurs têtes nucléaires pour étaler la zone d'impact, entre 8 et 12 d'une puissance de 100 à 400 kT pièce.\n\nBon appétit.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BringbackMarchais",
                    "body": "L'excellent livre Nuclear War in the UK recueille tout un tas de brochures sur le sujet distribué pendant la guerre froide ! \n\nTrès intéressant de voir qu'ils adaptaient la couverture en fonction de la ville, Manchester and the bomb (avec le dessin de la ville et un champignon atomique), [Hull and the bomb](https://xenogothic.com/wp-content/uploads/2020/10/01-722x1024.jpg) c'est très direct et j'ai pas l'impression qu'il y ait eu un équivalent en France",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Nibb31",
                            "body": "Les Britanniques avaient aussi tout un réseau de défense civile avec des guetteurs, des bunkers, des moyens télécom, etc.  \n[https://www.youtube.com/watch?v=rjMbapSd89Qhttps://www.youtube.com/watch?v=rjMbapSd89Qhttps://www.youtube.com/watch?v=rjMbapSd89Q](https://www.youtube.com/watch?v=rjMbapSd89Qhttps://www.youtube.com/watch?v=rjMbapSd89Qhttps://www.youtube.com/watch?v=rjMbapSd89Q)\n\nEn France, on s'est dit que ça servait à rien parce que la bombe nous protégeait.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TailleventCH",
                    "body": "Et avec une vision pas du tout orientée des potentielles menaces...",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "keepthepace",
            "body": "En cas de crise majeure: acheter des pâtes et du PQ.\n\nLa consigne s'applique également en cas de distribution de manuel de survie à une population angoissée artificiellement par des médias populistes.",
            "score": 5,
            "replies": []
        },
        {
            "author": "afterrprojects",
            "body": "J'espère que ça va enfin nous expliquer comment boire un verre assis, debout ou couché selon les circonstances car je n'avais pas bien compris à l'époque.",
            "score": 11,
            "replies": [
                {
                    "author": "No_Value_4670",
                    "body": "Il me manque une réf, je pense ? Je sens que ça va être drôle.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "99pitchs",
                            "body": "[discours castex](https://youtu.be/GOqBbfw-NIM?si=j228KmVh5d9-yYc8)",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "BABARRvindieu",
            "body": "Penurie de pate et de PQ dans 3.. 2...1....",
            "score": 9,
            "replies": []
        },
        {
            "author": "Toutanus",
            "body": "Ce sera un prospectus rappelant tous les numéros verts.",
            "score": 6,
            "replies": []
        },
        {
            "author": "JRMiel",
            "body": "C'est marrant, ça fait plus de 6 mois qu'un même manuel à été distribué au Danemark.\n\nLe gouvernement a officiellement demandé à ses citoyens de se constituer une réserve d'eau, nourriture non périssable et premiers soins.\nRadio avec piles également.\n\nVu que cette idée se repend dans les pays européens, peut être que les gouvernements savent déjà que c'est trop tard et qu'on va avoir une vraie guerre d'ici peu. Mais pour éviter la panique, ils distillent les info clé au compte goutte",
            "score": 12,
            "replies": [
                {
                    "author": "Artyparis",
                    "body": "Toi tu pense que le gouvernement se retient pour éviter la panique.\n\nD'autres dans ce fil pensent qu'il en fait trop pour faire peur aux citoyens.\n\n\nXD",
                    "score": 22,
                    "replies": [
                        {
                            "author": "JRMiel",
                            "body": "Je sais pas vraiment...\n\nJuste étonnant que petit à petit les gouvernements européens s'alignent sur cette préparation.",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "ThomasKyoto",
                                    "body": "La Suède le fait depuis des années. Certains cantons suisses aussi. Au Japon, les exercices de préparation aux catastrophes (tremblements de terre, tsunamis) font partie du quotidien. Et c’est bien normal : prévoir, toujours, vaut mieux que paniquer au dernier moment.\n\nCe genre d’initiative n’a rien de complotiste, ni d’un signe que les gouvernements « savent quelque chose que nous ignorons ». Ce qu’un gouvernement doit savoir – et surtout, assumer – c’est qu’il faut anticiper. Et d’ailleurs, même sans guerre en Ukraine, ce genre de prévention devrait être une évidence.\n\nOn parle souvent de résilience en cas de crise, mais la résilience, ça se prépare. Ce n’est pas quand les rayons des supermarchés sont vides qu’il faut commencer à se poser des questions sur la gestion des stocks stratégiques. Ce n’est pas au moment d’une cyberattaque massive qu’il faut se dire : « Ah, peut-être que sécuriser les infrastructures critiques aurait été une bonne idée. »\n\nD’ailleurs, le Covid en a été un bon exemple : personne n’avait prévu des stocks suffisants de masques, de médicaments, de matériel de protection, et on a improvisé en catastrophe. Pourtant, une pandémie mondiale n’était pas un scénario de science-fiction : c’était un risque connu, identifié, documenté. Simplement, la prévention coûtait cher et ne rapportait rien politiquement à court terme.\n\nSi on élargit encore : une catastrophe naturelle, une crise énergétique, une pénurie alimentaire due à des sécheresses ou des conflits commerciaux, une défaillance des infrastructures numériques, un volcan islandais… Il existe des dizaines de scénarios qui, sans être de la paranoïa, justifient un minimum de préparation.\n\nDonc oui, voir les gouvernements européens aligner peu à peu leurs recommandations sur ce type de prévoyance, ce n’est pas un signe qu’une apocalypse se prépare en secret, c’est juste une prise de conscience tardive qu’ils auraient dû agir bien plus tôt.",
                                    "score": 23,
                                    "replies": [
                                        {
                                            "author": "Ea50Marduk",
                                            "body": "Totalement d'accord avec vous ! On a réellement tendance à oublier combien de risques pendent au-dessus de nos têtes.\n\n>Si on élargit encore : une catastrophe naturelle, une crise énergétique, une pénurie alimentaire due à des sécheresses ou des conflits commerciaux, une défaillance des infrastructures numériques, un volcan islandais… Il existe des dizaines de scénarios qui, sans être de la paranoïa, justifient un minimum de préparation.\n\nOu l'explosion d'une caldeira dans le Wyoming.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Redditexplorer67",
                                    "body": "Oui ils ont déjà la date de début du conflit. /s\nPartez pas en théories complotistes. Ils font de la prévention et c'est le moins qu'ils puissent faire.",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "CyrilFR",
                                            "body": "Dans 2 mois on est dans une tranchée à la frontière biélorusse, vous l'avez lu ici en premier",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "Folivao",
                                                    "body": "La gueule de la tranchée s'ils groupent les combattants par subreddit\n\n/r/NonCredibleDefense qui fera des blagues en se faisant embrocher par des mitrailleuses\n\nr/france qui passera son temps à s'engueuler pendant que 2/3 adjudants sortiront des blagues à base d'édriseur\n\n/r/CallOfDuty qui tentera des tricks 360 no scope HS",
                                                    "score": 10,
                                                    "replies": [
                                                        {
                                                            "author": "Palmul",
                                                            "body": "/r/EnculerLesVoitures qui refusent catégoriquement de monter dans le véhicule de transport si il est pas sur des rails",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Folivao",
                                                                    "body": "r/voitures qui refuse d'être assigné à un régiment du train",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Nibb31",
                                    "body": "C'est juste normal. En France, on est à la ramasse coté défense civile. Il n'y a qu'à voir à chaque inondation ou grève de raffinerie.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Gedebor-Houston",
                            "body": "On a vécu le COVID, ça ne m'étonnerait pas qu'il retentent de faire les deux \"en même temps\". Ça avait tellement bien marché...",
                            "score": -8,
                            "replies": [
                                {
                                    "author": "Artyparis",
                                    "body": "Je ne comprends pas ce que tu veux dire.\n\n\"Ils\" veulent faire les 2... comment ?\n\nQuel est l'objectif ?\n\nAccessoirement y a une vraie raison de s'inquiéter avec actuellement non ? Tu préfères qu'on ferme tous les yeux ?",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "chub79",
                    "body": "> Vu que cette idée se repend dans les pays européens, peut être que les gouvernements savent déjà que c'est trop tard et qu'on va avoir une vraie guerre d'ici peu. \n\nVu la gueule du climat, pas besoin de cacher grand chose. La catastrophe arrivera un jour.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "MrPapillon",
                    "body": "Je pense que c'est pour mieux légitimiser les nouveaux budgets militaires auprès du grand public.  \nLes gens s'en foutent de la géopolitique ou ont une image simplifiée, donc là ça sert de piqûre de rappel pour garder la population éveillée et qu'elle comprenne qu'avoir un budget c'est important. Dans une démocratie représentative, il faut un minimum avoir l'aval de sa population, sinon on perd son temps dans des débats pas constructifs.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "RollinMonkey",
                    "body": "Tu y habites et tu l'as reçu ? J'en ai jamais entendu parler alors que ça fait un peu plus de deux ans que j'y vis.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "JRMiel",
                            "body": "J'y habite pas mais ma famille l'a reçu et m'a montré le guide à Noël",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "choo-t",
                                    "body": "Ils en reçoivent depuis des années, ce n'est pas comparable à la situation française.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "EyeLoop",
            "body": "Les milices d'extrême droite survivalistes en train de jouir dans leur futal camo. \"J'avais raison 15 ans avant tout le monde!\"",
            "score": 5,
            "replies": []
        },
        {
            "author": "MadameConnard",
            "body": "Je sais pas pourquoi ca s'indigne, on a vu passer l'actualisé des suédois ya quelques semaines et pourtant c'était pas le premier qu'ils reçoivent.",
            "score": 5,
            "replies": []
        },
        {
            "author": "artizenwalker",
            "body": "Quand on ne sait plus quoi inventer pour contrôler le peuple.",
            "score": 2,
            "replies": []
        },
        {
            "author": "capucine68",
            "body": "C'est pas plus mal quand on voit comment certains se sont comportés pendant le covid, alors que la seule consigne était de rester chez soi",
            "score": 5,
            "replies": []
        },
        {
            "author": "RyuKensatsu",
            "body": "Les commentaires en mode \"oui la guerre mais quand même les arabes qui font n'importe quoi en France\", c'est fatiguant.",
            "score": 5,
            "replies": [
                {
                    "author": "fonxtal",
                    "body": "#🤮  Figaro",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "VeroTheCrochet",
            "body": "Ma mère, en pls déjà, va m'appeler dans 3 2 1 driiing",
            "score": 3,
            "replies": []
        },
        {
            "author": "Alacifee",
            "body": "La promo de la prochaine saison de Fallout, y a du budget🤡🫡",
            "score": 4,
            "replies": []
        },
        {
            "author": "carakangaran",
            "body": "objectivement, c'est le figaro qui essaie de faire flipper parce que c'est bien, des gens qui flippent et qui sauront se tourner vers les vrais sauveurs ? \n\nOu y'a quelque chose que le gouvernement veut vraiment faire ? \n\nJe sais pas, ça ressemble quand même à un peu à de la panique à moindre frais.",
            "score": 2,
            "replies": []
        },
        {
            "author": "kita59",
            "body": "a oui je connais, The anarchist cookbook",
            "score": 2,
            "replies": []
        },
        {
            "author": "HamsterNihiliste",
            "body": "Comme manuel de survie en cas de crise majeure en France, je préfère lire Résister de Salomé Saqué et Reconnaître le fascisme d'Umberto Eco, mais chacun ses lectures, on est en démocratie.",
            "score": 1,
            "replies": []
        },
        {
            "author": "VeigmaRr",
            "body": "Bon ok pourquoi pas... mais comme dirait un très grand philosophe \"*Une personne sûrement \\[peu comprendre et est intelligente\\]. Mais en foule on est con*, on panique comme une horde d'animaux\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nukeboml3",
            "body": "J’avait vu passé sur jlailu au début de la guerre en ukraine , un manuel du resistant distribué par la CIA aux ukrainiens . Il y avait tout dedans ! Les recettes du C4 , les méthodes pour piéger, d’autres choses . Mais je ne l’ai pas telechargé  . Ce serait utilise en cas de crise majeure\n\nEdit: [trouvé! ici](https://www.militarynewbie.com/wp-content/uploads/2013/11/TM-21-210-Improvised-Munitions-Handbook-1969-Department-of-the-Army.pdf)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jean-Porte",
            "body": "Mais à part ça on ne joue pas du tout sur les peurs",
            "score": -9,
            "replies": [
                {
                    "author": "NightSkyth",
                    "body": "Et après vous serez les premiers à râler que le gouvernement n'a pas su prévoir. Vous êtes fatigants",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "F-b",
                    "body": "Réaction tardive = \"Ils ont pas fait leur boulot !\"\n\nAction préventive = \"On joue sur les peurs !\"\n\nPile je gagne, face tu perds.",
                    "score": 32,
                    "replies": []
                },
                {
                    "author": "NOG11",
                    "body": "Avoir un minimum de stock et de résilience c'est la base du bon sens, et ca nous fait un peu defaut en france depuis quelques décennies.  Nos grands parents avaient pour la plupart des stock alimentaire de quelques semaines/ mois et ça s'est perdu avec la génération de nos parents qui au moindre besoin allaient faire leur course au bout de la rue. Les pays nordiques sont bien sensibilisés a ça, ils ont des consignes et sont incités a avoir quelques semaines ou mois de stock alimentaire.  Ce n'est pas jouer sur les peurs c'est simplement préparer sa population a un minimum de résilience et  ça évite qu'au moindre virus ou événement anormal des nués de pigeonneaux en panique se ruent  pour dévaliser des supermarchés et se foutre sur la gueule. et ca pour le coup c'est beaucoup plus anxiogène a mon sens.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "tanaephis77400",
                    "body": "Bah oui, c'est bien connu que les guerres et les catastrophes sont des trucs qui n'arrivent que dans les films, ça n'est jamais arrivé en vrai à aucun pays européen.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "DestroyedLolo",
            "body": "Règle №1 :\n- regarder H24 BFMTV \n\nRègle #2 :\n- mettre un portrait au dessus de la cheminée de notre sauveur a tous, Manu ...\n\nJ'espère juste que s'il y a un crise, ça ne sera pas la même cacophonie que pour le COVID.",
            "score": 0,
            "replies": []
        },
        {
            "author": "FutureFee5340",
            "body": "Lunaire les comm qui encense cette annonce, faut quand même pas être bien futé pour comprendre la manoeuvre politique là non? \n\nPourquoi tant de gens sont 1er degré ok avec cet article et pensent que c'est une bonne chose ?",
            "score": 0,
            "replies": []
        },
        {
            "author": "Fun-Criticism2017",
            "body": "Autant la russie est une menace pour l'ukraine et les pays proches, autant l'idée de combats sur le sol français est vraiment absurde.\n\nCe genre de communication est contre productif.",
            "score": -10,
            "replies": [
                {
                    "author": "tanaephis77400",
                    "body": "Personne n'a jamais prétendu que la Russie allait venir se battre sur le sol français, faut arrêter de taper sur des hommes de paille. Mais si le critère pour se préparer à une crise c'est \"tant qu'il n'y a pas un soldat russe dans mon jardin je ne fais rien\", on  va pas être préparés à grand chose.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "LordMafe420",
                    "body": "Personne ne parle de ça.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Fun-Criticism2017",
                            "body": "Je suis curieux de savoir de quoi tu penses qu'on parle, et pourquoi maintenant.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "LordMafe420",
                                    "body": "Dans l'article: \"détaille les pratiques à adopter en cas de crise, allant d’un accident industriel, un événement climatique grave et jusqu’au conflit armé\"\n\nPuis\n\n\"Cela ne vise «absolument pas» à préparer la population à la perspective d'une guerre, contrairement au cas suédois, assure le SGDSN.\"\n\nDonc on peut penser aux bons réflexes à adopter si on reçoit sur son téléphone une alerte en cas d'arrivée de missiles par exemple, ou + ponctuellement, aux personnes résidents au niveau des zones frontalières si jamais y'a un risque particulier.\n\nPersonne ne parle de combats sur le territoire national.\n\nDe toute manière, c'est pas un vulgaire papier qui va \"préparer\" les gens à des combats sur le sol FR.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Fun-Criticism2017",
                                            "body": "Recevoir des missiles ça compte complètement comme combat et c'eat aussi absurde.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "LordMafe420",
                                                    "body": "Ok et ça paraissait absurde aussi en février 2022 quand ça a pété en Ukraine\n\nC'est pas le \"bouclier\" antimissile FR qui va faire quoi que ce soit contre un RS-28 Sarmat avec 20 mirv conventionnelles.\n\nDonc autant que les gens soient au courant.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MadameConnard",
                    "body": "C'est pas comme si on avait des dirigeants voisins qui sucaient allègrement Poutine dont une ayant annoncé avoir hate de pouvoir travailler avec une certaine Le Pen.\n\nVu la géopolitique du moment je doute qu'en cas de guerre ils en aient quelque chose à foutre de trahir l'Europe.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Kit0cha",
                    "body": "C'est des réactions similaires en cas de tempête/inondation/incendie/accident industriel/arrêt électricité prolongé général : avoir des résèrves de nourriture non périssable qu'on fait tourner au fur et à mesure, avoir un récepteur radio à piles, faire des réserves d'eau des l'annonce de la crise, avoir un Sac d'évacuation dédié pour sortir rapidement",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Ted_Lavie",
                    "body": "Le problème c'est ptet pas les Russes. Moi les ricains m'inquiètent un peu plus dans les 4 ans à venir... Une invasion du Canada ou du Groenland ça peut vite dégénérer. Et puis t'es pas à l'abri que Musk décide que la Guyane c'est pas mal comme lieu finalement pour lancer ses fusées",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Hypergraphe",
            "body": "Oula ça cache quoi tout ça...",
            "score": -1,
            "replies": []
        },
        {
            "author": "JohnGabin",
            "body": "Je veux bien un semi-automatique, au cas où...",
            "score": -5,
            "replies": []
        },
        {
            "author": "airsem",
            "body": "On continue l’enfumage, la guerre est proche, les chars russes sont a nos portes … l’heure est grave, vite donnons les pleins pouvoirs à Macron.",
            "score": -5,
            "replies": []
        }
    ]
}