{
    "title": "Donald Trump défie le pouvoir judiciaire en expulsant vers le Salvador des Vénézuéliens soupçonnés d’appartenir à un gang",
    "author": "Folivao",
    "subreddit": "france",
    "rank": 18,
    "score": 58,
    "upvote_ratio": 0.9,
    "num_comments (reported by reddit)": 17,
    "url": "https://www.lemonde.fr/international/article/2025/03/18/donald-trump-defie-le-pouvoir-judiciaire-en-expulsant-des-membres-d-un-gang-venezuelien-vers-le-salvador_6582762_3210.html",
    "id": "1jeat6m",
    "selftext": "",
    "comments": [
        {
            "author": "_IBlameYourMother_",
            "body": "Quelques notes:\n\n- les personnes expulsées ne sont pas forcément \"soupçonnées\"; d'après le gouvernement américain, dans un certain nombre de cas ils n'ont aucune information sur ces personnes.\n- ces personnes ne sont pas simplement \"expulsées\"; elles sont destinées a des camps de travail au Salvador. Sans procès, sans recours, sans droits, sans paye, sans perspectives de libération, sans rien.",
            "score": 52,
            "replies": [
                {
                    "author": "Folivao",
                    "body": "Une déportation purement et simplement",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "SurefootTM",
                    "body": "Le goulag. Venant des mêmes qui essaient de faire croire que \"la gauche = communisme = staline = goulag\". Encore et toujours de la projection...",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "BoeufCarottes",
                    "body": "Et les usa payent 6 millions de dollars au Salvador pour qu'ils soient incarcérés une année",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "lulzcam7",
            "body": "C'est pas juste défier, il s’assoit littéralement sur le pouvoir judiciaire.\n\nEdit : On a sous les yeux la parfaite représentation de ce que sont capables des politiciens qui jugent l’État de droit comme étant quelque chose de facultatif. Le droit ne sert pas qu'à vous punir quand vous faites une bêtise, il vous protège aussi contre un État qui abuse de son autorité.",
            "score": 52,
            "replies": []
        },
        {
            "author": "Folivao",
            "body": "**La Maison Blanche a refusé, lundi, de répondre aux questions du juge James Boasberg, qui avait ordonné en vain, samedi, de suspendre l’envoi de 238 personnes vers un « centre de confinement des terroristes » au Salvador.**\n\n\n« Oups… trop tard. » Le président du Salvador, Nayib Bukele, a posté ce commentaire, dimanche 16 mars, avec un grand sourire, après qu’un juge fédéral américain, James Boasberg, a interdit l’expulsion des Etats-Unis de 238 personnes suspectées d’être membres de gangs vénézuéliens vers un « centre de confinement des terroristes » dans son pays. Trop tard, parce que les avions militaires américains étaient manifestement déjà en vol et que l’administration Trump a refusé de se plier à une injonction orale du juge exigeant que les appareils fassent demi-tour.\n\nUne audience a donc été convoquée, lundi 17 mars, en fin d’après midi, par le juge Boasberg, qui s’est interrogé : la Maison Blanche a-t-elle bravé ses ordres ? Dans un signe de défiance inédit, les représentants du ministère fédéral de la justice, sous l’autorité de Donald Trump, lui ont demandé – en vain – d’annuler la comparution, puis ont refusé de répondre à ses questions sur l’horaire des vols, leur destination ou le nombre de personnes expulsées, invoquant des « préoccupations de sécurité nationale ». Le magistrat – dont le ministère de la justice a parallèlement demandé le dessaisissement – a fixé une audience sur le fond au 21 mars. Sceptique, il a sommé l’administration Trump de lui apporter des réponses d’ici à mardi midi.\n\nL’affaire cristallise le combat méthodique mené par Donald Trump et son administration contre les juges fédéraux. Ces derniers représentent actuellement le seul contre-pouvoir opérationnel, les démocrates étant à terre après leur défaite de novembre 2024, les intellectuels et les artistes hors jeu, et les milieux économiques ayant prêté allégeance au président. En violant délibérément une décision de justice, l’administration Trump franchit une ligne rouge vers un système plus autoritaire dépendant du seul exécutif.\n\n\nTout s’est joué samedi : Washington invoque l’Alien Enemies Act – une loi de 1798 instaurée lors de la « quasi-guerre » contre la France révolutionnaire qui permet de détenir et d’expulser les immigrants originaires d’un pays belligérant – pour expulser tout citoyen vénézuélien âgé de 14 ans ou plus accusé d’être membre du gang Tren de Aragua. Depuis février, ce dernier est désigné comme une organisation terroriste étrangère par l’administration américaine.\n\n**« Je me fiche de ce que pensent les juges »**\n\nL’Alien Enemies Act n’a été utilisé qu’à trois reprises – contre les Anglais en 1812, par le président Woodrow Wilson, pendant la première guerre mondiale contre les Allemands et, pendant la seconde, par Franklin D. Roosevelt, notamment pour interner les Japonais et les Américains d’origine japonaise.\n\n\nL’administration américaine a choisi, moyennant 6 millions de dollars (5,5 millions d’euros) versés au Salvador, d’expulser les membres de Tren de Aragua dans les prisons de Nayib Bukele. Ce dernier a paralysé les gangs dans son pays en incarcérant 1,6 % de sa population, un record mondial. Le président salvadorien a diffusé sur son compte X une vidéo des Vénézuéliens expulsés, à leur arrivée, menottés, puis tondus avant d’être introduits sans ménagement par dizaines dans une prison.\n\n\nPressentant cette décision, cinq Vénézuéliens placés en centre de rétention avaient formulé, samedi après-midi, un recours en justice contre leur expulsion devant le juge fédéral de Washington, James Boasberg, estimant en particulier qu’ils étaient soupçonnés à tort d’être membres du gang. Le magistrat ordonnait alors la suspension de l’expulsion des plaignants.\n\nPendant les débats, selon le récit du Washington Post, les avocats ont expliqué que deux avions étaient déjà en vol. Vers 18 h 45, le juge exigeait que les appareils concernés fassent demi-tour. L’ordre était certes oral, mais il a force juridique complète. « Tout avion transportant ces personnes, qui est sur le point de décoller ou qui est en vol, doit être renvoyé aux Etats-Unis », ordonnait le magistrat à l’avocat de la Maison Blanche. Puis, à 19 h 26, il publiait sur le serveur public de la justice américaine son interdiction d’invoquer la loi sur les ennemis étrangers pour expulser tout membre suspecté du Tren de Aragua. Selon la chaîne CNN, à cette heure, les deux premiers avions étaient encore en vol – le premier est arrivé au Honduras, étape avant le Salvador, à 19 h 36, et le deuxième à 20 h 08. Enfin, et surtout, un troisième avion a décollé du Texas à 19 h 37 selon le tracker Flightradar, soit après la publication de la décision.\n\n\nL’enjeu est décisif pour savoir si l’administration Trump a violé volontairement une injonction de la justice, ce qui serait un précédent majeur, ou si elle a simplement touché la ligne rouge. « L’administration n’a pas “refusé de se conformer” à une décision de justice, a déclaré Karoline Leavitt, porte-parole de la Maison Blanche. Cette décision, dénuée de fondement légal, a été émise après l’expulsion des terroristes étrangers du territoire américain. Un juge unique dans une seule ville ne peut pas diriger les mouvements d’un avion transportant des terroristes étrangers expulsés physiquement du territoire américain. »\n\nTom Homan, le responsable de la frontière et des expulsions dans l’administration Trump, a estimé, lundi, sur la chaîne Fox News, que les deux vols d’expulsion vers le Salvador n’avaient pas besoin d’être interrompus car ils se trouvaient déjà au-dessus des eaux internationales lorsque l’ordre a été donné. Il a surtout confirmé que cette affaire était une nouvelle escalade dans la contestation du pouvoir judiciaire menée par Donald Trump : « Nous ne nous arrêterons pas. Je me fiche de ce que pensent les juges. Je me fiche de ce que pense la gauche. Nous avançons », a-t-il asséné, annonçant « un autre vol chaque jour ».\n\n**L’administration Trump peine à expulser les sans-papiers**\n\n« Nous allons entamer le processus de retour de millions et de millions d’étrangers criminels vers leurs lieux d’origine », avait déclaré Donald Trump lors de son investiture, le 20 janvier. En réalité, son administration a certes réussi à fermer la frontière – un mouvement commencé sous Joe Biden, à l’approche de l’élection présidentielle –, mais elle peine à expulser les sans-papiers.\n\nSelon une enquête publiée par la chaîne NBC fondée sur des calculs de Noticias Telemundo, en février, 128 avions transportant des personnes expulsées ont décollé, dont 19 vols militaires. Ce chiffre est inférieur aux 137 vols d’expulsion effectués un an plus tôt sous Joe Biden. Au total, selon NBC, 11 000 migrants ont été expulsés en février, premier mois de plein exercice de Donald Trump, contre 12 000 un an plus tôt. La moitié d’entre eux n’avaient pas de condamnation pénale ni ne faisaient l’objet de poursuites.\n\n\nLa situation de la base américaine de Guantanamo Bay, située dans le sud-est de l’île de Cuba, censée servir de base d’expulsion, est un exemple des difficultés rencontrées. Ce choix est coûteux, inadapté et fait l’objet de recours en justice, ce qui a conduit Washington à faire marche arrière brutalement. Un porte-parole militaire a déclaré à l’agence Associated Press, jeudi 13 mars, qu’aucun « étranger illégal » n’y était détenu après le transfert de 40 immigrants vers la Louisiane.\n\nAu cas des Vénézuéliens s’est ajouté celui d’une citoyenne libanaise sous visa, Rasha Alawieh, docteure en médecine de 34 ans, qui a été refoulée par la police des frontières à l’aéroport de Boston et renvoyée vers Paris en dépit d’un ordre d’un juge exigeant d’attendre une audience, prévue lundi, avant toute expulsion. Cet ordre a été émis vendredi soir, deux minutes avant que Rasha Alawieh soit escortée dans l’avion qui a quitté la porte d’embarquement une demi-heure plus tard.\n\n**Les républicains à l’unisson avec Trump**\n\nLes autorités fédérales ont entretemps fait savoir qu’elles lui reprochaient d’avoir assisté aux funérailles du leader du Hezbollah Hassan Nasrallah et d’avoir effacé de son smartphone des photos lui étant favorables. Le juge, estimant que son ordre avait été volontairement violé, a lui aussi convoqué une audience pour avoir des explications.\n\nLes républicains sont à l’unisson avec Donald Trump. « Chaque jour, un juge décide unilatéralement de la politique du pays. Cette fois, au profit des membres de gangs étrangers. Si la Cour suprême ou le Congrès ne règlent pas la situation, nous nous dirigeons vers une crise constitutionnelle », a estimé, sur X, Chuck Grassley, sénateur républicain de l’Iowa. « Les pires juges – ceux qui bafouent la loi de manière répétée – devraient au moins être soumis à un vote de destitution, que ce vote soit positif ou non », lui répond Elon Musk.\n\nLe président mène aussi ouvertement ce combat. Dimanche, Donald Trump a mis en doute la décision d’un juge fédéral californien ordonnant à l’administration de réembaucher des milliers de travailleurs en période d’essai qui ont été licenciés. « Je trouve cela absolument ridicule. C’est un juge qui se met à la place du président des Etats-Unis, qui a été élu avec près de 80 millions de voix », a accusé Donald Trump.\n\nLa bascule consterne même le New York Post, tabloïd de Rupert Murdoch, qui s’en prend dans un éditorial aux demandes de destitution du juge Boasberg par Elon Musk : « Désolé, Elon : même l’expulsion des membres de gangs illégaux doit respecter l’Etat de droit. »",
            "score": 18,
            "replies": [
                {
                    "author": "Rod_tout_court",
                    "body": "Il est sympa l'article: c'est l'État de droit qui est mis sous pression pendant tout l'article et à la fin on apprend que la séparation des pouvoirs est aussi sur la sellette",
                    "score": 8,
                    "replies": [
                        {
                            "author": "lulzcam7",
                            "body": "Le prochain politicien qui dit que l’État de droit n'est pas sacré mérite des baffes (et je suis gentil).",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "Rod_tout_court",
                                    "body": "Tant que c'est pas un ministre qui sort ça tout va bien. Depuis la moralisation de la vie publique on peut espérer que le président demandera immédiatement sa démission.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "transfemrobespierre",
            "body": "J'en profite pour rajouter ce nouvel article : [Etats-Unis : le président de la Cour suprême contredit Donald Trump après des attaques contre un juge](https://www.lemonde.fr/international/article/2025/03/18/etats-unis-le-president-de-la-cour-supreme-contredit-donald-trump-apres-des-attaques-contre-un-juge_6583328_3210.html)",
            "score": 3,
            "replies": []
        },
        {
            "author": "Hero-Firefighter-24",
            "body": "Espérons que les midterms en 2026 vont mettre assez de démocrates au Congrès pour impeacher Trump.",
            "score": 2,
            "replies": [
                {
                    "author": "Mickanos",
                    "body": "Encore faut-il croire que les élections de 2026 pourront se dérouler librement et de manière juste. On rappelle que Trump a déjà tenté un coup d'État à sa dernière défaite, et que son contrôle sur le gouvernement est déjà bien plus fort qu'à l'époque.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Hero-Firefighter-24",
                            "body": "Les états gèrent les élections dans ce pays, pas le gouvernement fédéral, donc pas de trucage ou d’annulation possible. La vraie question est de savoir si les américains vont se retourner suffisamment massivement contre lui pour qu’il y ait une vague bleue lors des élections mi-mandat et que dans le cas où ça arriverait ils auraient non seulement une majorité dans la chambre des représentants mais aussi 2/3 du sénat, les derniers étant nécessaires pour faire condamner un président aux USA lors d’une procédure d’impeachment. Faut savoir qu’après le 6 janvier, il manquait déjà une quantité énorme de voix pour faire condamner Trump (on peut d’ailleurs en vouloir un peu à Mitch McConnell qui aurait pu et du inciter les républicains à se retourner contre Trump en votant en faveur de le faire condamner).",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "jo726",
                                    "body": "> Les états gèrent les élections dans ce pays, pas le gouvernement fédéral, donc pas de trucage ou d’annulation possible\n\nDonc, dans les états démocrates, les élections pourraient rester justes.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "jroomey",
                                    "body": "Trump et Co. s'assoient tranquilou sur les lois, traditions, institutions et règles de la démocratie, de l'état de droit, liberté de la presse etc. depuis plus d'un mois sans aucun signe d'essoufflement (les juges mettent le holà une fois le fait accompli)... et tu penses que dans 18 mois, le regime Trumpien en position de quasi-pouvoir absolu, va permettre une defaite possible en garantissant des élections sans interférences, manipulations, et justes ? Et éventuellement céder les reines du pouvoir en cas de défaite ?? C'est trrrrès optimiste...\n\nLa passation de pouvoir de Trump à Biden en janvier 2021, après des mois à hurler aux élections truquées (et les 4 ans suivants à le répéter) ne s'est pas faite en douceur : Trump ne refera pas les mêmes erreurs.\n\n!RemindMe 20 months 'midterms'",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "RemindMeBot",
                                            "body": "I will be messaging you in 1 year on [**2026-11-19 00:11:18 UTC**](http://www.wolframalpha.com/input/?i=2026-11-19%2000:11:18%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/france/comments/1jeat6m/donald_trump_défie_le_pouvoir_judiciaire_en/mij8xjf/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Ffrance%2Fcomments%2F1jeat6m%2Fdonald_trump_d%C3%A9fie_le_pouvoir_judiciaire_en%2Fmij8xjf%2F%5D%0A%0ARemindMe%21%202026-11-19%2000%3A11%3A18%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201jeat6m)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "sacado",
                    "body": "Il faut aussi la majorité au sénat. Et que l'état de droit tienne encore debout dans deux ans. C'est pas gagné du tout.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}