{
    "title": "Pyrénées : le procès de la mort de l’ourse Caramelles débute ce mardi 18 mars en Ariège",
    "author": "Calamistrognon",
    "subreddit": "france",
    "rank": 19,
    "score": 50,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.sudouest.fr/environnement/ours-dans-les-pyrenees/pyrenees-le-proces-de-la-mort-de-l-ourse-caramelles-debute-ce-mardi-18-mars-en-ariege-23666377.php",
    "id": "1jeb9aj",
    "selftext": "",
    "comments": [
        {
            "author": "Calamistrognon",
            "body": "Récap' :\n\n> Le 20 novembre 2021, un chasseur qui participait à une battue dans la commune de Seix avait tué l’ourse Caramelles, qui l’avait gravement blessé, le traînant sur plusieurs mètres. Quinze autres chasseurs et lui feront face à 19 associations environnementales au tribunal de Foix […]\n\n> le chasseur ainsi que les 17 autres participants à cette battue aux sangliers se trouvaient dans une réserve de chasse et de faune sauvage, un endroit où tout acte de chasse est rigoureusement interdit. […]\n\n> Durant l’enquête, le principal accusé a eu l’occasion d’expliquer sa version des faits, qui a semblé crédible aux enquêteurs. Au cours de la battue, il s’est placé dans une zone boisée […] Quelques instants plus tard, surgissent deux oursons suivis de leur mère. […] Les oursons passent à une dizaine de mètres au-dessus du chasseur, sans lui prêter attention. Au contraire de leur mère, qui s’est retournée vers le septuagénaire. Et lui fonce dessus. […]\n\nC'est pas dit dans l'article, mais je l'ai lu dans [*Le Guardian*](https://www.theguardian.com/world/2025/mar/18/french-hunter-81-on-trial-for-killing-endangered-bear-that-attacked-him), la défense des chasseurs c'est de dire que les contours de la réserve sont mal indiqués :\n\n> The hunters also argued that the boundaries of the reserve were poorly marked. […] Photographs shown at the hearing showed barely visible signage – red Rs for reserve painted on trees against a white background.  \n“Your obligation as a hunter is to know where you are hunting,” retorted prosecutor Olivier Mouysset. […]\n\n(et pas de paywall chez moi)",
            "score": 17,
            "replies": [
                {
                    "author": "AzuNetia",
                    "body": ">C'est pas dit dans l'article, mais je l'ai lu dans [*Le Guardian*](https://www.theguardian.com/world/2025/mar/18/french-hunter-81-on-trial-for-killing-endangered-bear-that-attacked-him), la défense des chasseurs c'est de dire que les contours de la réserve sont mal indiqués :\n\nSauf qu'il n'était pas seul, 15autres chasseurs étaient là donc qu'un se trompe, ça peut passer mais pas 15...\n\nIl aurait tué l'ourse dans une zone où il avait le droit d'être, ça aurait été légitime, là je suis plutôt triste pour l'ourse et n'ai aucune empathie pour les chasseurs.",
                    "score": 16,
                    "replies": []
                }
            ]
        },
        {
            "author": "Xzimnut",
            "body": "Les chasseurs français sont les seuls au monde à ne pas avoir conscience de scier la branche sur laquelle ils sont assis. Au-delà de la question morale de la chasse (c’est pas mon délire personnellement), il y a beaucoup de travail en commun entre les chasseurs et les assos de protection de l’environnement dans d’autres pays, parce qu’ils comprennent que s’ils tirent sur tout ce qu’il bouge, il ne leur restera rien à chasser.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Useful_Advice_3175",
            "body": "Tiens, il va y avoir des manifs de chasseurs.",
            "score": 2,
            "replies": []
        }
    ]
}