{
    "title": "I love him so much already 😩❤️",
    "author": "itsRose8888",
    "subreddit": "aww",
    "rank": 421,
    "score": 669,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 35,
    "url": "https://i.redd.it/be5nvjrrgbme1.jpeg",
    "id": "1j1x40n",
    "selftext": "",
    "comments": [
        {
            "author": "RadicalFaces",
            "body": "Doesn't breeding merle coats often end up with litters are blind and deaf and often end up being put down?",
            "score": 50,
            "replies": [
                {
                    "author": "earthvisitor",
                    "body": "Yes.",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "merlinshairyballs",
                    "body": "Also fun fact: frenchies don’t naturally come in Merle. Wonder where the gene came from…?",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "Geschak",
                    "body": "People posting puppies from unethical breeding practices, nothing new here.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "MrsSadieMorgan",
                    "body": "Yeah... they're unethical to breed, which OP would have known if they'd done even a SECOND of research. Or they do know, but don't care because \"omg so cuteeeeee.\" Ugh.\n\nI don't want to rain on their parade, but with information literally at our fingertips these days, there's no excuse for ignorance like this.",
                    "score": 18,
                    "replies": []
                }
            ]
        },
        {
            "author": "SadLilBun",
            "body": "Comments pass the vibe check. Stop buying French bulldogs and encouraging bad breeding habits that are entirely of human origin. Breeding should make healthier dogs, not sicker ones.",
            "score": 31,
            "replies": []
        },
        {
            "author": "MrsSadieMorgan",
            "body": "I hope you love being broke too, because these dogs have a myriad of health problems. Get insurance now.",
            "score": 25,
            "replies": []
        },
        {
            "author": "earthvisitor",
            "body": "Sure wish folks would stop jerkin these lil dudes to artificially inseminate the females that are unable to have their puppies via natural birth only for them to develop health problems. \n\nHe’s cute though!",
            "score": 49,
            "replies": [
                {
                    "author": "Crown_Writes",
                    "body": "Whenever I see one I think they should not exist. I love them like all dogs but my family member has 2 and one would just stop breathing in its sleep and both had to get surgery to widen their airway just to keep living.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "wasabinski",
                    "body": "I don't know much about dogs, what do you mean?",
                    "score": -1,
                    "replies": [
                        {
                            "author": "Fierybuttz",
                            "body": "These dogs wouldn’t continue to exist without human intervention. The mothers can’t even give natural birth – they have to have a C-section. It’s completely unnatural but they continue to be very popular. \n\nThey’re cute, it would just be nice if there was more focus on fixing the breed if they’re going to continue being this popular. These dogs are pricey at birth, and continue being pricey throughout their lifetime with vet bills.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "wasabinski",
                                    "body": "But are you talking about the breed in general or the coat pattern? I know some people that have French Bulldogs but I haven't heard about particular health issues.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Fierybuttz",
                                            "body": "Not all dogs will be unhealthy but they have a much higher risk for health issues. I’m not too sure about the coat. I saw some other people commenting about that if you’re interested. \n\nMy coworker moved to US from overseas and had to leave his frenchie. The vet said it was far too risky to have the dog on such a long flight. I’m sure I asked if that even meant the dog in-cabin with him, but honestly I can’t recall. \n\nHere’s a link that explains more: https://www.petmd.com/dog/general-health/french-bulldog-health-issues",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "wasabinski",
                                                    "body": "Thank you! Always good to learn something new",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "SadLilBun",
                                            "body": "This is true of the entire breed, even the “healthier” ones.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "PickanickBasket",
            "body": "He's so cute! Just a heads up to anyone looking, these kinds of unusual patterns live short lives and have significant health issues. Just know what you're getting into! Hopefully he lives a long and healthy life. ♥️",
            "score": 20,
            "replies": [
                {
                    "author": "Little-Dingo-2607",
                    "body": "I'm pretty sure anybody who would buy this dog is uneducated,  if one would educate themselves on the topic they would probably make a wise decision",
                    "score": 22,
                    "replies": []
                }
            ]
        },
        {
            "author": "The4etheR",
            "body": "Ear-resistible",
            "score": -4,
            "replies": []
        },
        {
            "author": "Own_Cantaloupe9011",
            "body": "Name him boiled ham.",
            "score": -5,
            "replies": []
        },
        {
            "author": "Sleepy_cheetah",
            "body": "I love him & he looks just like cookies n cream icecream.",
            "score": -13,
            "replies": []
        },
        {
            "author": "Death_By_Stere0",
            "body": "Those ears are fantastic",
            "score": -5,
            "replies": []
        },
        {
            "author": "Little-Dingo-2607",
            "body": "I think if anybody pays close to 5,000 on anything, including a dog, that they love it or are probably not going to spend that type of money in the first place . Is the dog cute? Yeah, it's adorable!",
            "score": -6,
            "replies": [
                {
                    "author": "MrsSadieMorgan",
                    "body": "Huh? Try that again… your first sentence is nonsensical.\n\nBut spending (or not spending) a lot of money isn't about love, it's about wanting something and having the means to buy it. If they really loved dogs and cared about their welfare, however, they'd have done some research and chosen an ethical breed. Or even better, rescued a dog instead of funding a breeder. I think there's more love in that!\n\nAll of my pets have been rescues because I actually care about animal welfare. And if I did choose the breeder route, I'd at least go with an ethical one. Merle Frenchies cannot be bred ethically, period.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "GuardianCmdr",
            "body": "Who dropped paint on him? I suspect Bob Ross. Banksy? Kandinsky?\nHe's a cute little pooch.",
            "score": -6,
            "replies": []
        },
        {
            "author": "italiangel24",
            "body": "His coat pattern is gorgeous 😍",
            "score": -14,
            "replies": []
        },
        {
            "author": "hella_gainz394",
            "body": "big guy",
            "score": -6,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -6,
            "replies": []
        },
        {
            "author": "EsotericIntegrity",
            "body": "Ok… does he have a twin 🥰",
            "score": -13,
            "replies": []
        },
        {
            "author": "Various_Ad_3333",
            "body": "He has such a gorgeous coat pattern 🥺😻",
            "score": -12,
            "replies": [
                {
                    "author": "RadicalFaces",
                    "body": "That comes from egregious unethical and cruel breeding practices",
                    "score": 15,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok_Band_5237",
            "body": "Such a handsome guy!",
            "score": -8,
            "replies": []
        },
        {
            "author": "Direct_Candidate_454",
            "body": "I adore a speckled pup. 🐶🤎",
            "score": -9,
            "replies": []
        }
    ]
}