{
    "title": "Luna is a happy girl after being rescued from a shelter. Her personality is starting to show.",
    "author": "RedDead-Ed",
    "subreddit": "aww",
    "rank": 12,
    "score": 14440,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 116,
    "url": "https://v.redd.it/lsfukztf4sme1",
    "id": "1j3s8o6",
    "selftext": "",
    "comments": [
        {
            "author": "sh0tgunben",
            "body": "Luna is an adorable cat 😺",
            "score": 1,
            "replies": [
                {
                    "author": "RedDead-Ed",
                    "body": "Thank you! She’s an awesome cat!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "OaklandWarrior",
                            "body": "my dog named Luna is also a cat.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Sim_mono",
                    "body": "I bet Luna has a human soul residing inside her !",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "GentleReader01",
            "body": "She’s establishing that you’re part of the pack she’s responsible for, with the washing there. You’re in.",
            "score": 1,
            "replies": [
                {
                    "author": "Secret_Photograph364",
                    "body": "Cats are not pack animals",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Monkey_Priest",
                            "body": "Eh, it's getting pedantic but you are kind of right since most people think of packs as hunting groups. Cats are social though as they form colonies and the licking there is a social behavior",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Big-Ergodic_Energy",
                                    "body": "Clowder, right?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Monkey_Priest",
                                            "body": "NGL, I just learned a new word today.  Thanks!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Secret_Photograph364",
                                    "body": "Colony hierarchy is quite different from pack hierarchy in nature.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Dreamchime",
                                            "body": "Sure, but it's just a colloquialism. Nobody says \"part of the colony.\"",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "NoSlide7075",
                                                    "body": "A cat colony clowder colloquialism copying quick quarks?",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Secret_Photograph364",
                                                    "body": "Yea but nobody really refers to cats as having packs either",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Dreamchime",
                                                            "body": "Not feral ones, but when they're part of a household it's not uncommon.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Secret_Photograph364",
                                                                    "body": "I mean even big cats aren’t referred to this way, a lion has a pride not a pack. (Which usually only contains one male)",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Dreamchime",
                                                                            "body": "But this isn't about big cats in the wild. \"Pack\" simply serves as an endearing catchall for the specific setting of a human space where multiple species are living together.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Secret_Photograph364",
                                                                                    "body": "Yea one that is wrong\n\nAnd big cats have the same sort of hierarchy as house cats. The only real exceptions are very very small wild cats like the Pallas cat, which are solitary",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Monkey_Priest",
                                            "body": "Wouldn't that depend largely on the species for both pack and colony?  There are undoubtedly similarities from pack to pack or colony to colony, but they vary from species to species.  And then it can get pedantic.  A pack of wolves hunt differently from a pack of lions.  Sure, we can say lions don't form packs, they form prides, but we both know that's a pedantic distinction",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Secret_Photograph364",
                                                    "body": "But behaviour is the main differentiation between classifying something as a pack vs a colony (which is what a pride is)",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Monkey_Priest",
                                                            "body": "Where are you getting your information?  You MIGHT be able to make an argument for your statement about behavior, though I think that's a gross oversimplification of the distinction between pack and colony, but I have NEVER heard of lion prides being considered a \"colony\" and I can find no reference to back your claim",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Miami_Mice2087",
                                            "body": "pack hierarchy is a myth and both colonies and packs operate similarly. It's about protecting the babies and helping to feed the old people.\n\nSmall groups of nomadic or subsistance farming humans (like paleolithic people, or tribal people still living today) basically do the same. I just read a  really good and fun book about this type of society, called Nation. It's a non-discworld book by Pratchett, I hope you give it a look. :)",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Secret_Photograph364",
                                                    "body": "Pack hierarchy is absolutely not a myth. You are conflating there being an “alpha wolf” (which is indeed a myth) with pack hierarchy which generally is bound to familial units wherein seniority denotes status.\n\nThis is not how cats operate, either in a house or in the wild",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "RegorHK",
                            "body": "House cats are colony animals. Means solitary hunt and communal living including sharing of food, looking after offspring and geooming.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Secret_Photograph364",
                                    "body": "The structure of a colony is quite different to that of a pack, they are less familial groups and they do not recognise familial hierarchy in the way a pack animal (like a dog, wolf, or hyena) would. \n\nA pack animal is much more likely to try to save its pack mates from attack for instance whereas a colonial animal like say a penguin is getting Tf away from that shark and leaving the other penguins as shark bait.\n\nFun fact: hyena packs are matrilineal and matriarchal.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Miami_Mice2087",
                            "body": "They sorta are. They have family groups with a flat leadership structure. Inasmuch as every cat is his own master.\n\nThe males tend to be weird loners but the females raise the babies in colonies. Similar to gorillas.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Secret_Photograph364",
                                    "body": "They have colonies, not packs.\n\nThink of penguins, they have that sort of social structure in form.\n\nSocial animals, yes. Pack animals, no.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Beachlife98569",
            "body": "She loves you already",
            "score": 1,
            "replies": [
                {
                    "author": "RedDead-Ed",
                    "body": "Yes she does she’s a playful cat!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "HappyThifeHappyLife5",
                            "body": "Try not to play with her with your hands that way. I know it's fun but it can end up teaching her your hands are for biting and playing instead of for affection. Get a few fun toys for her, and for you! You'll have even more fun watching her play with appropriate toys. Those cat fishing poles are great. \n\nThanks for rescuing her, she's gorgeous!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "fuzzynavel34",
            "body": "How old is Luna? She’s a cutie pie!",
            "score": 1,
            "replies": [
                {
                    "author": "RedDead-Ed",
                    "body": "She will be 2 in July! Thank you!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "mister---e",
            "body": "Thanks for saving her, OP.\n\nMay Luna share a happy lifetime with OP 😻",
            "score": 1,
            "replies": []
        },
        {
            "author": "thembo-goblin",
            "body": "No bite, only lick! What a sweetheart!",
            "score": 1,
            "replies": [
                {
                    "author": "RedDead-Ed",
                    "body": "Thank you she likes to playfully bite at time haha!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Opaldick228",
            "body": "Man this is so awesome. Good shit 🤘",
            "score": 1,
            "replies": [
                {
                    "author": "RedDead-Ed",
                    "body": "Thank you!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Teddy_Doodle",
            "body": "What a beautiful girl! Thank you for rescuing her and giving her the loving home she deserves!",
            "score": 1,
            "replies": [
                {
                    "author": "RedDead-Ed",
                    "body": "Thank you! Every cat deserves a loving home!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "acatcalledniamh",
            "body": "A beauty",
            "score": 1,
            "replies": [
                {
                    "author": "RedDead-Ed",
                    "body": "Thank you!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "unsupported",
            "body": "*puuurrrrsonality",
            "score": 1,
            "replies": [
                {
                    "author": "RedDead-Ed",
                    "body": "Haha yes she has one!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok_Lion_5272",
            "body": "Awww 🥰 r/tuxedocats",
            "score": 1,
            "replies": [
                {
                    "author": "RedDead-Ed",
                    "body": "😊",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Valtremors",
                    "body": "Awwww r/catsnamedluna",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lobotomized_Dolphin",
            "body": "Aww, little Luna!  She trusts you so much, your hand is an object of play rather than a threat.  I know we're not supposed to let our cats play with our hands like that, but I do it as well.  It's so much fun, they love to hold our hands  down and mock bite at them.",
            "score": 1,
            "replies": [
                {
                    "author": "RedDead-Ed",
                    "body": "Yes it is she likes to play! She definitely had me nervous at first when she started her mock bite but she’s very playful with it.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "kukonimz",
            "body": "Sweet baby ❤️",
            "score": 1,
            "replies": [
                {
                    "author": "RedDead-Ed",
                    "body": "Thank you! She is",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "GoAwayLurkin",
            "body": "She is like a country Auntie.\n\n\"Come here, come here to me, you.\"\n\n\"Gimme sum SHUGGAH\"",
            "score": 1,
            "replies": [
                {
                    "author": "RedDead-Ed",
                    "body": "Haha I can see that!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Natural-Pack-238",
            "body": "She looks so familiar with my Oreo who ran into my house last December!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dana07620",
            "body": "What a sweet cat. She really trusts you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tricky-Trick1132",
            "body": "❤️❤️❤️",
            "score": 1,
            "replies": []
        },
        {
            "author": "spoiled__princess",
            "body": "I love her.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lentilsenthusiast",
            "body": "Pet me.. With your eyes!",
            "score": 1,
            "replies": []
        },
        {
            "author": "merv1618",
            "body": "Rub the belly you monster",
            "score": 1,
            "replies": []
        },
        {
            "author": "rvdms",
            "body": "What a sweet girl! I’m so happy she found you. 🥰",
            "score": 1,
            "replies": []
        },
        {
            "author": "haysu-christo",
            "body": "If I did this with my cat I’d have twelve bandaids on my hand.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JuanG_13",
            "body": "Luna is very cute and good on you for taking her in and hopefully now she'll live a good and happy life that all animals deserve. 🙏",
            "score": 1,
            "replies": []
        },
        {
            "author": "natalkalot",
            "body": "What a sweet floof! I love tuxedos,\n\nSo similar to our Vader, she  was an awesome kitty",
            "score": 1,
            "replies": []
        },
        {
            "author": "scaur",
            "body": "\"Mmm... [hand]\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "kaka_v42069",
            "body": "silly",
            "score": 1,
            "replies": []
        },
        {
            "author": "LoserweightChampion",
            "body": "That’s a damn good cat.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Der_Krasse_Jim",
            "body": "One of our bois turned from a tiny, angsty cat that didnt want too much cuddling (never bit or anything, just never really let his guard down) to a screaming madman that is always around you waiting for cuddles, treats or general attention. He started a couple months ago to sleep on my lap while on the computer. He can even give high fives and other tricks now, a true circus rat. Took about 2 years.",
            "score": 1,
            "replies": [
                {
                    "author": "One_Swordfish1327",
                    "body": "I'm glad you persevered with your cat! My rescue cat was attacking viciously when I first got him and a year later he is finally letting me pet him a little.\nIt's been a journey but if yours took two years that gives me hope. 🙂",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Bohya",
            "body": "Those are warning licks.",
            "score": 1,
            "replies": []
        },
        {
            "author": "fongfong1212jq",
            "body": "When Luna is in an environment she likes, her vigilance will drop and she will begin to release her nature.",
            "score": 1,
            "replies": []
        },
        {
            "author": "i_Addy",
            "body": "Here's another Luna.\n\nhttps://preview.redd.it/u21dkdrchume1.jpeg?width=3072&format=pjpg&auto=webp&s=581218df645763d2d8089422aad9ed15e61e8f51",
            "score": 1,
            "replies": [
                {
                    "author": "RedDead-Ed",
                    "body": "Sweet looking Luna!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "lynd4starry",
            "body": " Shes so cutee",
            "score": 1,
            "replies": [
                {
                    "author": "RedDead-Ed",
                    "body": "Thank you! She definitely is",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "b00g3rw0Lf",
            "body": "hi OP\n\nim glad you have a Luna too. heres my Luna. https://i.imgur.com/tYvQsv8.png",
            "score": 1,
            "replies": []
        },
        {
            "author": "plazagirl",
            "body": "I was waiting for the savage love bite.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Final_External_2969",
            "body": "She loves you so much.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dry_Chard_6569",
            "body": "She’s pretty and looks comfortable with you already!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Toshibaguts",
            "body": "Thank you for rescuing her! She’s so pretty:)",
            "score": 1,
            "replies": []
        },
        {
            "author": "mixedObeseTemp167",
            "body": "Holy heck, we have a cat twin🤣",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rob_Swanson",
            "body": "Aww ! a precious one .",
            "score": 1,
            "replies": []
        },
        {
            "author": "Express-Fox-4058",
            "body": "Isnt it weird.  \nMy mother in law has exactly the same cat (not just coloured, she has the same facial structure and look) that calls Luna for the last 10 years.  \nShe introduced herself to her future owners by riding a sheep as fresh kitten.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Alfalfa-4420",
            "body": "I AM READY TO PUT ON A SHOW",
            "score": 1,
            "replies": []
        },
        {
            "author": "Yugiteen99",
            "body": "I love it when a cat licks me. I love the feeling of their sandpaper tongue 👅🐱",
            "score": 1,
            "replies": []
        },
        {
            "author": "One_Swordfish1327",
            "body": "Gosh she is a sweet girl! Usually when they're a rescue from a shelter they're traumatized, may I ask how long you've had her? She's so relaxed and happy.\n A lovely video, thanks for posting it, it's the happiest thing I've seen today.🙂",
            "score": 1,
            "replies": []
        },
        {
            "author": "LaaDiDah",
            "body": "Wove her!!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "ProjectPickup",
            "body": "Im really glad that you guys saved her, thats a happy baby right there. Made my day!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mackelroy_aka_Stitch",
            "body": "A look into this cats throught process: \"play, combat, combat, catch, clean.\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Capable-Impress3296",
            "body": "Thank you for rescuing her and saving a life!",
            "score": 1,
            "replies": []
        },
        {
            "author": "OkOkra632",
            "body": "Luna feels relaxed because she gets love and care from you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Notquitechaosyet",
            "body": "Looks like My Luna Belle!",
            "score": 1,
            "replies": [
                {
                    "author": "RedDead-Ed",
                    "body": "Tuxedo cats all day!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Harlequin-sama",
            "body": "Very cute cat :D I wish you a lot of joy! I hope you have another buddy for her!",
            "score": 1,
            "replies": [
                {
                    "author": "RedDead-Ed",
                    "body": "Thank you we have chihuahuas she seems to enjoy them so far!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "5hoursofsleep",
            "body": "Paws are huge! Love the hug and lick so cute",
            "score": 1,
            "replies": [
                {
                    "author": "RedDead-Ed",
                    "body": "Thank you!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Miami_Mice2087",
            "body": "what a cutie! and she's being really really sweet by not bear trapping you when you reach over her face to pet her. She's a really good cat! A lot of cat HATE that and will send you to the hospital (I have scars).\n\nTry petting her from the other direction, not by reaching over her stomach and face. A lot of animals get headshy because of people or animals attacking them from the front. Try petting her cheeks and the top of her head.\n\nFor more interesting information about how to have a great relationship with your cat, try watching jackson galaxy on youtube or his show My Cat From Hell on animal planet. He's a cat behaviorist and i've learned SO MUCH from him.",
            "score": 1,
            "replies": [
                {
                    "author": "RedDead-Ed",
                    "body": "Thank you she definitely reminds me of a dog she probably learned that licking technique from my chihuahuas haha!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "notthenomma",
            "body": "Doll baby",
            "score": 1,
            "replies": []
        },
        {
            "author": "WatchNo4780",
            "body": "Aww..bless you OP...spoil her senseless!",
            "score": 1,
            "replies": []
        },
        {
            "author": "AccomplishedIgit",
            "body": "Don’t taunt her with your hand like that, it encourages them to bite and scratch. Human hands are for pets and love only!",
            "score": 1,
            "replies": []
        },
        {
            "author": "thetaqocat",
            "body": "My stray rescue does exactly this but he gnaws on you instead",
            "score": 1,
            "replies": []
        },
        {
            "author": "Vast_Minimum_4079",
            "body": "Love her ❤️❤️",
            "score": 1,
            "replies": []
        },
        {
            "author": "Moarancher",
            "body": "Luna is one of the most, if not, the most common pet name. Like holy shit can people even try to be creative?",
            "score": 1,
            "replies": []
        },
        {
            "author": "flamingmenudo",
            "body": "Tuxedo cats FTW!",
            "score": 1,
            "replies": []
        },
        {
            "author": "GlobalSquash4598",
            "body": "awww, such an adorable kitty",
            "score": 1,
            "replies": []
        },
        {
            "author": "Giantonail",
            "body": "glanced at first and mistook the hand for flipping off the tiny one",
            "score": 1,
            "replies": []
        },
        {
            "author": "AnamCeili",
            "body": "What a sweetheart! 😊",
            "score": 1,
            "replies": []
        },
        {
            "author": "Solid-Jaguar2067",
            "body": "Gorgeous",
            "score": 1,
            "replies": []
        },
        {
            "author": "sponsorapet",
            "body": "You are PAWSOME, Luna! We love to see a rescue girl living her best life at Sponsor a Pet. Keep on enjoying your happy life, Luna and show everyone how amazing rescue kitties are! ![img](emote|t5_2qh1o|13383)",
            "score": 1,
            "replies": []
        }
    ]
}