{
    "title": "Adopted this guy about a month ago. I've never had a cat before and didn't really know what to expect. This one is an absolute snuggle bug. Meet McRib.",
    "author": "awesomeredefined",
    "subreddit": "aww",
    "rank": 4,
    "score": 2372,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 32,
    "url": "https://i.imgur.com/a5dVFRd.jpeg",
    "id": "1j4abnf",
    "selftext": "",
    "comments": [
        {
            "author": "louser0w0",
            "body": "My fiancée wants to name our newest kitty McRib too 😭",
            "score": 1,
            "replies": [
                {
                    "author": "awesomeredefined",
                    "body": "It's such a fun name. Every time he leaves a room and comes back, I loudly declare \"the McRib is back!\" I joked for years that if I ever got a cat I would name it McRib just so I could do that. Then back in January I was seriously looking at adopting a cat and this guy happened to be newly available at a local humane society... I like to think it was fate.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "bassoonemilee",
                            "body": "I was going to ask why McRib, but hearing your “the McRib is back” I totally get it 🤣🤣",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "dllimport",
                            "body": "Wait the cat was already named mcrib?? It is definitely fate",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "awesomeredefined",
                                    "body": "Yep! He was found with a colony behind a McDonald's back in late December. They were all named for McDonald's food items lol",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Laney20",
                                            "body": "Omg, it was fate! He was meant to be yours! This is an amazing story.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Boetheus",
                                            "body": "Damn, now I want a cat named Big Mac",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "awesomeredefined",
                                                    "body": "That's his littermate's name, actually 😂\n\nThe humane society specifically said McRib is very friendly towards other cats... except for Big Mac. They're estimated to be about 2 years old, so they're not really sure why they stuck together so long if they don't like each other (probably a convenience/food source thing) but they did. \n\nI would've LOVED to take them both if they were friendly to each other. Alas.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "mattromo",
            "body": "Wait does he disappear and return at random intervals like his namesake?",
            "score": 1,
            "replies": [
                {
                    "author": "awesomeredefined",
                    "body": "At least within the confines of my apartment :) he does tend to enter a room, leave immediately, and then come back not 30 seconds later. He came with the name but it's an accurate one.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "anotherbbchapman",
            "body": "What a delightfully funny face. I love tuxedo cats",
            "score": 1,
            "replies": []
        },
        {
            "author": "LadySiren",
            "body": "What a cutie! Here's hoping you get all the snuggles.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Liu1845",
            "body": "And you started with a Tux? Wow! Welcome to being owned by a cat.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ForgottenHylian",
            "body": "Welcome to the club. We will never let you go. Or more accurately, you won't want to. \n\nFalling asleep as your cat is laying on you while purring is one of the most relaxing experiences. I can't count the times I've crashed out on the couch after one of mine settled into my lap.",
            "score": 1,
            "replies": [
                {
                    "author": "awesomeredefined",
                    "body": "It's amazing how much joy the little guy brings me. I've always considered myself a dog person, I had a Dalmatian/German Shepard mix growing up but he died in 2007 and I never had another pet until this funky guy. I'd still like another dog at some point, but I think this guy has made me a convert.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ForgottenHylian",
                            "body": "Por que no los dos? \n\nMy current dog found the first of my cats scrounging from a dumpster. The two are inseparable to this day. \n\nAs long as they are introduced slowly with you as a mediator, they often do great together.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "awesomeredefined",
                                    "body": "Oh don't get me wrong, I think McRib will end up with a canine sibling sooner or later (I'd love one within the next year or two) but I want to make sure he's 100% situated, and that I myself am 110% ready and committed before getting a dog.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ForgottenHylian",
                                            "body": "Then you, my friend, are an admirable care giver.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "alizeia",
            "body": "Lil skull face. Perfect for Halloween",
            "score": 1,
            "replies": []
        },
        {
            "author": "Amount_Sudden",
            "body": "Since he’s a male and you’re a first time cat owner, please learn about the importance of moisture in their food and the signs of a blocked bladder. Easy to avoid. Just don’t learn the hard way. ❤️❤️❤️❤️",
            "score": 1,
            "replies": [
                {
                    "author": "awesomeredefined",
                    "body": "Thanks for letting me know! I'll be sure to study up so I know what to keep an eye out for. They did mention he was suffering from some dehydration when they found him, so they gave us some urine health kibble to start with. I've mostly been giving him wet food and I did get him a water fountain (he doesn't use it SUPER often but he does take a sip a few times a day) to make sure he gets enough liquid.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Amount_Sudden",
                            "body": "Oh that’s great. Yeah wet food is the best, over dry food. I even add some water to my wet food since my cats don’t love drinking. Love that you have a fountain!! Congrats on your new cat!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Teddy_Doodle",
            "body": "He’s super cute! Snuggle bugs are the best!",
            "score": 1,
            "replies": [
                {
                    "author": "awesomeredefined",
                    "body": "They really are. It's so heartwarming waking up in bed and realizing he's snuggled up against me sleeping. It took him about a week to warm up to me, but I've woken up with him snuggled up against me nearly morning since. This McRib ain't going away, that's for sure.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Madwoman-of-Chaillot",
            "body": "omg McRib ![gif](emote|free_emotes_pack|heart_eyes)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mgroppi83",
            "body": "Thank you for your service.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dark_Arm",
            "body": "A unit for sure.",
            "score": 1,
            "replies": [
                {
                    "author": "awesomeredefined",
                    "body": "Yeah, the vet told me he's pretty large for a cat. They said he's a perfectly healthy weight for his size (he's about 11 lbs), he's just a big boi.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fun-Statistician2485",
            "body": "He seems to be enjoying indoor-life",
            "score": 1,
            "replies": []
        },
        {
            "author": "Choppergold",
            "body": "That nose marking is so great",
            "score": 1,
            "replies": []
        },
        {
            "author": "skinnyminnesota",
            "body": "OUTSTANDING name!",
            "score": 1,
            "replies": []
        },
        {
            "author": "scattywampus",
            "body": "Oh his NOSE!! Squeeeeeeeee!!",
            "score": 1,
            "replies": []
        }
    ]
}