{
    "title": "The NHL bans Pride Tape, setting off a backlash from players and fans",
    "author": "Maxcactus",
    "subreddit": "progressive",
    "rank": 383,
    "score": 115,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 11,
    "url": "https://www.npr.org/2023/10/12/1205476006/nhl-bans-pride-tape-backlash",
    "id": "177mnnb",
    "selftext": "",
    "comments": [
        {
            "author": "Classic_Dill",
            "body": "I played travel hockey almost my entire youth/early adulthood and no one cares about tape color, the NHL is so friggin ridiculous.",
            "score": 27,
            "replies": [
                {
                    "author": "scowling_deth",
                    "body": " Yeah, what are they scared of?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Classic_Dill",
                            "body": "They’re allowing political parties, and a bunch of midlife Karen, type moms to dictate which way a national sports league goes, it’s moronic! These idiots really think that you’re gonna put some rainbow tape on your hockey stick, and then the other kids around you are all going to catch gay for the weekend!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DracoSolon",
            "body": "So is the NHL basically admitting that they think a majority of their fans are bigots?",
            "score": 38,
            "replies": [
                {
                    "author": "Liberty_Chip_Cookies",
                    "body": "From what I’ve heard, it’s the league caving to the complaints of a handful of Russian Orthodox players.",
                    "score": 26,
                    "replies": [
                        {
                            "author": "None",
                            "body": "If those players aren't being forced to use the pride tape (and they shouldn't be), it shouldn't be an issue. One would think. Getting to decide what everyone else's sticks do or don't have on them is ridiculous. 🤷",
                            "score": 24,
                            "replies": [
                                {
                                    "author": "Thazber",
                                    "body": "Exactly this.",
                                    "score": 10,
                                    "replies": []
                                },
                                {
                                    "author": "Liberty_Chip_Cookies",
                                    "body": "Well this whole hubbub started with the rainbow-lettered jerseys that players wore for their warm-up skate on Pride nights that were then donated to charity or whatever.  Not the games, mind you, just the warm-ups. For the games they wore their regular jerseys. And it was entirely voluntary.  These same Russian Orthodox players weren’t being forced to participate in any way, but they still threw fits and refused to play in the games because of what they claimed were religious liberty grounds.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Lenonn",
            "body": "Keith Olbermann has been discussing this on his podcast.\n\n[Countdown with Keith Olbermann](https://podcasts.apple.com/us/podcast/countdown-with-keith-olbermann/id1633301179?i=1000603234226)",
            "score": 2,
            "replies": []
        },
        {
            "author": "scowling_deth",
            "body": " Thats as dumb as banning an actual rainbow. \n And it cant be done..",
            "score": 2,
            "replies": []
        },
        {
            "author": "scowling_deth",
            "body": "https://reddit.com/r/cringekeeper/s/lAnzUNVmxW\n\n This is a meme about rainbow power.<3",
            "score": 1,
            "replies": []
        }
    ]
}