{
    "title": "Charlamagne Tha God Stumped by Dissatisfied Democrats: ‘What Am I Supposed to Tell Them, Other Than Donald Trump Is a Fascist?’",
    "author": "LtPowers",
    "subreddit": "progressive",
    "rank": 290,
    "score": 278,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 55,
    "url": "https://www.thewrap.com/charlamagne-tha-god-donald-trump-is-a-fascist-video/",
    "id": "196nf7k",
    "selftext": "",
    "comments": [
        {
            "author": "reddit_1999",
            "body": "Hmm,  how about the Republicans wanting to cut our SS and Medicare for starters?",
            "score": 100,
            "replies": []
        },
        {
            "author": "ABobby077",
            "body": "Trump tried to impose and still calls for a \"Muslim ban\"",
            "score": 56,
            "replies": [
                {
                    "author": "MrVeazey",
                    "body": "I mean, that's part and parcel with fascism. It's not an insignificant thing he did and it hurt a lot of people but it's small potatoes compared to the kinds of horrors in Project 2025.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "spidaL1C4",
                    "body": "While democrats pretend to love Muslims at home, while bombing the fuck out of them everywhere else on earth, or providing the bombs to others.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "wubbalubbazubzub",
            "body": "Maybe any of the advancements in labor rights? Union rights? Or the child tax credit?",
            "score": 59,
            "replies": [
                {
                    "author": "thistornadolovesu",
                    "body": "The President that made it illegal for rail workers to strike? The child tax credit that expired and was never renewed?",
                    "score": 10,
                    "replies": [
                        {
                            "author": "VelvetElvis",
                            "body": "He then negotiated on behalf of the workers and got them most of what they were asking for without the substantial economic damage a strike would have done to a fragile economy.",
                            "score": 37,
                            "replies": []
                        },
                        {
                            "author": "wubbalubbazubzub",
                            "body": "It's not illegal for real workers to strike. Where in the world are you getting that? And why did the child tax credit expire? Who didn't vote to keep it? Was that Joe Biden?",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Rungalo",
                                    "body": "[https://www.reuters.com/world/us/biden-signs-bill-block-us-railroad-strike-2022-12-02/](https://www.reuters.com/world/us/biden-signs-bill-block-us-railroad-strike-2022-12-02/) Idk, maybe from the president signing a bill making it illegal?",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "wubbalubbazubzub",
                                            "body": "Read your article buddy. It does not say that it's illegal for real workers to strike.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "Rungalo",
                                                    "body": "I guess if you don't know what block means, sure it doesn't. What happens if they had gone on strike, do you think?",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "wubbalubbazubzub",
                                                            "body": "They'd be fired. Block does not mean outlaw. They can still strike. Just not without breaking their contract. By the way Biden helped them win their sick days https://www.ibew.org/media-center/Articles/23Daily/2306/230620_IBEWandPaid",
                                                            "score": 9,
                                                            "replies": [
                                                                {
                                                                    "author": "Rungalo",
                                                                    "body": "alright, i was wrong. it happens a lot",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "MrVeazey",
                                                                            "body": "Especially when the Biden administration utterly fails to promote the actual helpful and beneficial things they've done. He's the most progressive president since Jimmy Carter and it breaks my heart to acknowledge how little progress we've made in fifty years.",
                                                                            "score": 12,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "wubbalubbazubzub",
                                                                            "body": "Alright. My point still stands that there's plenty of reasons to vote for Biden besides \"Trump is worse\"",
                                                                            "score": 12,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Optimus3k",
            "body": "Look, I get it. Things will be really bad if Trump gets elected again, and for the record, I'm voting Democrat, but things are bad now, and there's a Democrat in office. We're constantly getting told how low unemployment is and how wonderful the economy is doing, all while we're spending more on food and rent than we ever have. \n\nYou don't win elections by telling people what won't happen if they elect you. We need a plan, maybe some sort of platform thingy, that tells them what we're going to give the people, what we're going to protect, and how we plan to make sure it stays in place. I don't really see that happening right now.\n\nEdit: good grief, I didn't say anything about me or my situation, but people seem to be taking it as me clamoring for handouts or expecting the government to coddle me while offering nothing in return. Not what I said at all. I'm saying that the Democratic platform is virtually non-existent and we need to be telling people what we will be doing for them if they elect Democrats, not just what they'll be avoiding. Otherwise, we're just voting for the status quo, and people aren't happy with that. \n\nAs for if things are bad, [65 percent](https://thehill.com/business/4346224-most-americans-feel-the-economy-is-in-recession-despite-strong-job-market-steady-growth-survey/) of millennials and Gen xers feel the economy is in a recession, despite numbers touting the opposite. The biggest reason for this is greed-driven inflation, which may have slowed, but certainly hasn't reversed. So yeah, we may have more money now than we ever have, but compared to even just twenty years ago, it doesn't go nearly as far.",
            "score": 44,
            "replies": [
                {
                    "author": "VelvetElvis",
                    "body": "The housing crisis is due to policies at the local level and there's not much the federal government can do about it.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Other-Rutabaga-1742",
                            "body": "I doubt the US would ever do this but imo, the federal government should not allow non US citizens to own more than 49% of a property. Of any kind.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "VelvetElvis",
                                    "body": "True but I don't see how that relates to the subject at hand.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "LtPowers",
                    "body": "> all while we're spending more on food and rent than we ever have.\n\nSuch has been the case for 95% of American history. Deflation is rare and harmful to the economy.\n\nThe problem is that wages lag consumer prices by a bit, so the high inflation coming out of the pandemic hasn't been fully offset by rising wages. But, also, inflation was low for many years prior to the pandemic so it actually averages out to near-average over the last 10 years or so.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "Richandler",
                    "body": "> but things are bad now\n\nWhat is bad now?\n\n>, all while we're spending more on food and rent than we ever have.\n\nYou also have more money than you've ever had. In fact you have significantly more than you're grandparents did when they were your age.\n\nWhat do you want? That's maybe the better question. You want a better paying job? Okay, why do you expect more money for what you do? What skills are you picking-up? Why should someone forego their earnings and give it to you? Why should they not just pay someone else to do your job?  You want to government to role in with guns and start shooting everyone that raised their prices? You want a dictatorship, no freedom? Eggs going up in price while salaries outpaced that price raise is not a reason to say things are bad.",
                    "score": -25,
                    "replies": [
                        {
                            "author": "justforthisjoke",
                            "body": "This is stupid. Of course you have more money, in raw dollars. That means literally nothing. Your *buying power* is less than it was. Your grandparents were able to buy a house on a single person's relatively shitty factory salary. That is not a thing anymore. \n\nSecondly, I never understand the point of comments like yours. Are you trying to convince people that the real material conditions of their lives are not bad? Like there are people who are like \"hey I can't afford both food and rent anymore\" and you're sitting here like \"well actually, you have more monopoly money now than you did 100 years ago so shut up\". What's the point? Are you just rich and out of touch with the average worker's struggle?",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "HarriKivisto",
            "body": "A lot of voters are really selfish when they think of politics and only think of the present or the immediate future. They don't care a lot about those political appellations unless they can discern a clear and direct link to their own daily lives.",
            "score": 17,
            "replies": [
                {
                    "author": "Findilis",
                    "body": "Imediate self gratification also comes I to play 4 years watching policies slowly have impact versus immediately getting 25 dollars but everything is worse in 5 years.\n\nA surprisingly number of people take the 25 dollars.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Richandler",
                    "body": "They also are bored. At least that's been my theory for a while. \n\nWe have an entertainment based economy. If we don't or can afford to have the [latest tumbler on the market](https://www.today.com/food/trends/stanley-cup-craze-rcna132901) or [people see prices rise in their latest diet fad](https://www.bodyspec.com/blog/post/how_many_eggs_can_you_eat_per_day_on_a_keto_diet), they go stir crazy and get demoralized. They're not satisfied with the cup they have or the cheap bread they have always been able to buy. It's not entertaining enough. Social media then comes in and entertains them, by telling them they should have more because they listened to these 5 tips to better themselves.",
                    "score": -3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ryumancer",
            "body": "[Reads question quoted from Charlamagne]\n\nWell, Charlatan-...I mean Charlamagne, an okay start would be admitting you weren't helping anything in 2020 by calling importance to Biden's irrelevant, but technically correct, \"you ain't black\" statement.\n\nAnd as a black man myself, Charlamagne, you can help things in the future by learning when to shut your black-ass up every now and then.  You have a tendency to cause friction where there needn't be any and you call attention to moronic things for drama.\n\nSo... Charlamagne...how about:\n\nA) shutting up and fucking off?\n\nor\n\nB) maybe clear things up with Biden and maybe even canvas/campaign for him a little bit?\n\nWe have enough black folk in the country trading in their souls for a red hat, whether they KNOW it or not.  And we've had quite enough of Uncle Kanye West.  So either help or shut up and get outta the way.  Thanks.\n\nRant over.  🙂",
            "score": 2,
            "replies": []
        },
        {
            "author": "Toallpointswest",
            "body": "If he'd been paying attention, a lot:   \n\n\nOne of Biden's biggest unsung accomplishments is getting started on getting lead pipes out of our water systems. Lead pipes that predominately impact impoverished communities by doing brain damage to their children.",
            "score": 1,
            "replies": []
        },
        {
            "author": "loulan",
            "body": "Hard to come up with a more cringey name than \"Charlamagne Tha God\".",
            "score": 1,
            "replies": []
        },
        {
            "author": "NegativeC00L",
            "body": "What does Ja Rule think?",
            "score": -1,
            "replies": []
        }
    ]
}