{
    "title": "Ukraine War MegaThread for the Week of March 17, 2025",
    "author": "AutoModerator",
    "subreddit": "UkraineWarVideoReport",
    "rank": 0,
    "score": 41,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/UkraineWarVideoReport/comments/1jd1x5n/ukraine_war_megathread_for_the_week_of_march_17/",
    "id": "1jd1x5n",
    "selftext": "Use this thread to discuss, ask questions or speculate.\n\nPlease remember the subreddit and Reddit rules and stay civil.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Please remember the human. Adhere to all Reddit and sub rules. Toxic comments (including incitement of violence/hate, genocide, glorifying death etc) WILL NOT BE TOLERATED, keep your comments civil or you will be banned. Tagging u/SaveVideo bot to archive this video in a link below this comment. \n\n**To donate to Ukraine charities check out a verified list here:** https://www.reddit.com/r/ukraine/s/auRUkv3ZBE\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UkraineWarVideoReport) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "dildoeye",
            "body": "Now Kursk has been taken back Ukraine really has no bargaining chips left.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NoResponsibility6552",
            "body": "Recent news was the withdrawal from Kursk.\nLots of fake news coming out from Kursk by the Russian government about Ukrainian war crimes + a large encircling of Ukrainian troops, the latter is less verifiable but the former is a clear example of Russia trying to throw a wrench in the ceasefire plans blaming the Ukrainians.\n\nUkrainian assaults in heavily contested areas - the Donbas (pokrovsk, toretsk)\n\nU.S. led ceasefire has been rejected by Russia, lot of takeaways from its rejection and how it was done:\n\nRussia gave a no but yes answer, stating they agree with the idea of a ceasefire and want peace but not the current US ceasefire and any ceasefire agreement would have to be conditional with maximalist Russian terms being met.\n\nSo realistically unless the US pressures Ukraine to capitulate it doesn’t seem likely (just like it hasn’t done since the initial invasion in 2014) that any long term successful ceasefire would happen if Russia isn’t forced to accept one.",
            "score": 1,
            "replies": [
                {
                    "author": "TrueMaple4821",
                    "body": "I don't think the US can pressure Ukraine to capitulate. They essentially tried that by pausing funding, weapons and intel, and then publicly insulted Zelensky in front of the world press. Zelensky didn't back down. This shows that Ukraine will keep fighting even without US support. Europe has already increased its support to fill the gap should that happen.\n\nThis whole ceasefire circus seems mostly like a spectacle for Trump to cosplay a world leader (that he isn't). [Ukraine is winning this war of attrition](https://archive.is/rjJz6) \\- a ceasefire now would only benefit ruzzia.\n\nIdeally, a coalition of willing nations will put boots on the ground in western Ukraine to \"secure the rear\", i.e. protect the Belarus border, around Kyiv, Odesa, Lviv and other key areas. This would allow those Ukrainian units to move east to support a counter-offensive in Donbas for example. I really hope that European leaders show some bravery for once and do that even without any ceasefire on the table. Ruzzia won't back down from its maximalist goals unless they too see what everyone already sees - that it's only a matter of time until they're defeated on the battlefield.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Sea-Direction1205",
                    "body": "Putin has broken treaty after treaty.\n\nTrump: breaking treaties makes lord Putin a merry man. More treaties!",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}