{
    "title": "Today, Lithuania, Latvia, Estonia (Baltics), and Poland announced plans to withdraw from the Ottawa Convention, which bans the use of anti-personnel mines.",
    "author": "AndriukasV",
    "subreddit": "UkraineWarVideoReport",
    "rank": 11,
    "score": 2247,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 94,
    "url": "https://i.redd.it/jb5gj0q31fpe1.jpeg",
    "id": "1je0uy8",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Please remember the human. Adhere to all Reddit and sub rules. Toxic comments (including incitement of violence/hate, genocide, glorifying death etc) WILL NOT BE TOLERATED, keep your comments civil or you will be banned. Tagging u/SaveVideo bot to archive this video in a link below this comment. \n\n**To donate to Ukraine charities check out a verified list here:** https://www.reddit.com/r/ukraine/s/auRUkv3ZBE\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UkraineWarVideoReport) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "estelita77",
            "body": "Sadly necessary since much of russian military strength is in its ability to send mindless fevered hordes in seemingly endless meatwave attacks.",
            "score": 562,
            "replies": [
                {
                    "author": "SpaceMonkey_321",
                    "body": "It's fine. Ruzzia and the US aren't in the convention either. Why tf bother? Gloves off eradicate the orcs already.",
                    "score": 277,
                    "replies": []
                },
                {
                    "author": "GoyoMRG",
                    "body": "Russians: the original zerg horde",
                    "score": 71,
                    "replies": [
                        {
                            "author": "Blackthorne75",
                            "body": "Horde... now there's an idea I'd like to have become reality; Mongolia deciding it's had enough of Russia's BS and gets the Golden Horde roving through the Russian countryside.",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "fcavetroll",
                                    "body": "Genghis Khan emerging from his hidden grave together with millions of his undead riders. Trampling all of Russia like the Wall Titans in AoT.",
                                    "score": 24,
                                    "replies": [
                                        {
                                            "author": "Ok_Candidate_2732",
                                            "body": "I can see this as some Syfy or Netflix original show (like Kingdom)",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Ikea_desklamp",
                            "body": "Zug Zug ",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "bbcversus",
                                    "body": "Work work",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "aeternus_hypertrophy",
                    "body": "The brave penal battalions will clear the path with their lives and limbs. The greatest glory a poor Russian male can strive for under Putin",
                    "score": 15,
                    "replies": [
                        {
                            "author": "Nugget_Buffet",
                            "body": "Something, something. If minefield, infantry go through like there was no minefield. - Zhukov",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "WhiskeySteel",
                    "body": "Yes, sadly so.\n\nWhen facing Russian aggression without any ability to rely on support from the United States, these countries must make themselves, in the words of Ursula von der Leyen speaking about Ukraine, \"steel porcupines\".",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "314kabinet",
                    "body": "There should be a mine waiting for all of them.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Obst-und-Gemuese",
            "body": "Poland nuclear proliferation when?",
            "score": 160,
            "replies": [
                {
                    "author": "FlowingLiquidity",
                    "body": "Time for them to start mining those deposits!",
                    "score": 41,
                    "replies": []
                },
                {
                    "author": "jugalator",
                    "body": "Poland: [Yes, about that...](https://www.politico.eu/article/donald-tusk-plan-train-poland-men-military-service-russia/)",
                    "score": 23,
                    "replies": [
                        {
                            "author": "GreenStretch",
                            "body": "“Our deficit has been the lack of the will to act, having no confidence, and sometimes even cowardice. But Russia will be helpless against united Europe,” Tusk said, adding: “It’s striking but it’s true. Right now, 500 million Europeans are begging 300 million Americans for protection from 140 million Russians who have been unable to overcome 50 million Ukrainians for three years.\"",
                            "score": 101,
                            "replies": []
                        },
                        {
                            "author": "Raagun",
                            "body": "Its now only question who will be first. Poland or Ukraine which will het nuclear weapon. Cause we now see that westerners dont give two shits about east Europe. Only way to deter Russia is to have our own finger on the button",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "dtrford",
                    "body": "Did somebody say nuclear mines.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "namorblack",
                            "body": "Time for... Nuka Mines!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Jamaica_Super85",
                    "body": "Where's the fun in nukes? Just get lots of  land mines, barbed wire and shit loads of 155mm artillery shells...",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Obst-und-Gemuese",
                            "body": "Isn't Poland doing that already? \n\nAlso, the\" fun in nukes\" at this point is a decreased risk of being invaded by the USA and russia.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "Zwangsjacke",
                                    "body": "I'd rather have some E.V.A.s.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Waterwoogem",
                                    "body": "Not with mines. Until now at least anyway. Illegal border crossings through Belarus just might be getting a lil bit more explosive.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Obst-und-Gemuese",
                                            "body": "That is what I meant with \"already\", that they are going to do that starting now. I misphrased.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Glittering-Bank-8402",
            "body": "In a perfect world, this would be devastating news. In our real world, I applaud the leaders of these four countries for this necessary step, insuring the security of their people.",
            "score": 227,
            "replies": [
                {
                    "author": "Adorable-Gate-2192",
                    "body": "I think it’s smart as long as they mine the ever living shit out of their borders with Russia and Belarus. Dragons teeth, antitank trenches, bob wire, antitank mines, antipersonnel mines, and thermal cameras mounted on fake or real trees should be a great help!",
                    "score": 50,
                    "replies": [
                        {
                            "author": "topforce",
                            "body": "Fortifications are being built now, explosives won't be deployed until there is necessity for it. Having unattended minefields is security risk on it's own.",
                            "score": 37,
                            "replies": [
                                {
                                    "author": "Proglamer",
                                    "body": "Risk? It's a *bonus*: Belarus got into habit of sending waves of illegal migrants as ammo across borders",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "topforce",
                                            "body": "Terrible international optics. And I was thinking more a long the lines that some nefarious people might try to pilfer them and wreak havoc.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "SpecialistLayer3971",
                                                    "body": "An untrained person handling an armed landmine? Wile E Coyote or Daffy Duck would be the only characters to survive that stupidity. Even trained sappers take serious risks demining fields.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "OctopusIntellect",
                    "body": "Indeed. With the world as it is right now, probably Ottawa is considering withdrawing from the Ottawa convention too.",
                    "score": 40,
                    "replies": [
                        {
                            "author": "Arkh_Angel",
                            "body": "And would probably be setting them up at border crossings.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Nknk-",
                    "body": "Agreed. I'm glad to see that the leaders of all these countries are taking active and realistic steps to resist future aggression from Russia, doubly so since Russia has name-checked all of them as being next after Ukraine.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Pippelsons",
                            "body": "Thats nothing new",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "whatupmygliplops",
                    "body": "It should never be part of the treaty to not be allowed to use them on your own soil to defend from an illegal invasion. The treaty is in error.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "AndriukasV",
            "body": "# Joint statement of Poland, Lithuania, Latvia and Estonia\n\n*Since the ratification of the Anti-Personnel Mine Ban Convention (Ottawa Convention), the security situation in our region has fundamentally deteriorated. Military threats to NATO Member States bordering Russia and Belarus have significantly increased.*\n\n*In light of this unstable security environment marked by Russia’s aggression and its ongoing threat to the Euro-Atlantic community, it is essential to evaluate all measures to strengthen our deterrence and defense capabilities. We believe that in the current security environment it is of paramount importance to provide our defence forces with flexibility and freedom of choice of potential use of new weapon systems and solutions to bolster the defence of the Alliance’s vulnerable Eastern Flank.*\n\n*In light of these considerations, we-the Ministers of Defence of Estonia, Latvia, Lithuania, and Poland-unanimously recommend withdrawing from the Ottawa Convention. With this decision, we are sending a clear message: our countries are prepared and can use every necessary measure to defend our territory and freedom.*\n\n*Despite our withdrawal, we will remain committed to international humanitarian law, including the protection of civilians during an armed conflict. Our nations will continue to uphold these principles while addressing our security needs.*\n\n*We appreciate the understanding and support of all Allies and partners who recognize the dire security challenges we are facing and respect our decision in this matter.*\n\nJoint statement of Estonia, Latvia, Lithuania and Poland",
            "score": 58,
            "replies": []
        },
        {
            "author": "jugalator",
            "body": "It's only OK to not use anti-personnel mines when you don't need to use anti-personnel mines.",
            "score": 23,
            "replies": []
        },
        {
            "author": "Shodan469",
            "body": "Why handicap yourself when your likely future enemy doesn't observe the rules of law. \n\nImagine if it was ok for Russia to use certain weapons but their opponent could not because of outside pressure/treaties... Oh wait.",
            "score": 21,
            "replies": []
        },
        {
            "author": "GreenStretch",
            "body": "Yeah, you know who wasn't in the the treaty?  The US and the Orcs. \n\n[https://en.wikipedia.org/wiki/Ottawa\\_Treaty#/media/File:Ottawa\\_Treaty\\_members.svg](https://en.wikipedia.org/wiki/Ottawa_Treaty#/media/File:Ottawa_Treaty_members.svg)\n\nUkraine and all the European states were part of it as long as there was peace.",
            "score": 18,
            "replies": []
        },
        {
            "author": "icily_cool",
            "body": "It's the only sensible course of action to take when you are potentially facing War against an adversary like Russia.",
            "score": 27,
            "replies": []
        },
        {
            "author": "kr4t0s007",
            "body": "Sad for the world! But necessary with these damned Ruzzians",
            "score": 26,
            "replies": [
                {
                    "author": "PhilLynottIsKing",
                    "body": "It's not that sad. Western countries do not throw these here and there, we always make maps where these mines are put, so that it is much easier to neutralize them afterwards.\n\n  \nHere in Finland we had these minefield maps even WW2, so we knew where our mines are.",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "Gullenecro",
            "body": "Just withdraw. All internationnal convention are useless anyway, russia are not respecting them, so we should not if it s hammering our defensive position.",
            "score": 10,
            "replies": []
        },
        {
            "author": "thefinnbear",
            "body": "Hoping Finland would follow",
            "score": 11,
            "replies": [
                {
                    "author": "silentavenger123",
                    "body": "Yeah, but unfortunately our politicians hesitate too much. This would have been a great opportunity to be one in larger group. Hopefully we didn't \"miss the window\" and we are able to follow them soon. A kilometer deep minefield right next to Eastern border will keep the neighbour away at least for a while.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "PhilLynottIsKing",
            "body": "FINLAND, IT'S OUR TURN NOW TOO! Our former president wanted to join this stupid convention 2012 even we have more than 1300 kilometers mutual border with Russia.\n\n  \nBesides, these mines are made for defensive purpose, not to attack.",
            "score": 12,
            "replies": []
        },
        {
            "author": "MilkImpressive1460",
            "body": "Sad but fully understandable. With Orcs as neighbors, I'd do the very same.",
            "score": 10,
            "replies": []
        },
        {
            "author": "SFM_Hobb3s",
            "body": "Canadian here.  Completely fine with this.  Times have changed and the Ukraine war has taught us much.",
            "score": 10,
            "replies": [
                {
                    "author": "Proglamer",
                    "body": "Time to mine YOUR border, eh? ;)",
                    "score": 4,
                    "replies": [
                        {
                            "author": "SpecialistLayer3971",
                            "body": "Fine by me, especially near high traffic corridors. That might help with the illegal immigrant crossings, since nothing else seems to slow them down. Well marked warnings are necessary.  \n\\>>>>   /s  <<<<  \nI know perfectly well this will never happen with our government. Too much hand wringing and whining about everyone elses' rights and never anything for Canadians.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Choice_Ad_9169",
            "body": "Long overdue, but better late than never",
            "score": 12,
            "replies": []
        },
        {
            "author": "angelorsinner",
            "body": "But only to defend borders. Russia is a naughty neighbor",
            "score": 6,
            "replies": []
        },
        {
            "author": "Majestic-Actuator489",
            "body": "Good…they should plaster the whole border with mines, from estonia to romania",
            "score": 7,
            "replies": [
                {
                    "author": "PhilLynottIsKing",
                    "body": "You forgot Finland? We have more than 1300 kilometers mutual border with Russia!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AunMeLlevaLaConcha",
            "body": "Can't wait for Medvedev's take on this \"waaah escalation, waaah red line, waaah nukes\"",
            "score": 6,
            "replies": []
        },
        {
            "author": "Apfelbutze",
            "body": "That is a smart thing to do, if you are able to think further then wall to wallpaper.",
            "score": 7,
            "replies": []
        },
        {
            "author": "UranusReeks",
            "body": "Aaand again, Romanian leaders are \"en retard\"....",
            "score": 4,
            "replies": []
        },
        {
            "author": "Sea-Direction1205",
            "body": "The Russians insist on being unworthy of the 1899 convention on human rights.\n\nWhen our leaders pulled a Russian prank on us in 1914-1918 we dethroned or executed them. So did the Russians in 1917, but to Russia things did not improve.\n\nSo Russia is at 1916. They better dethrone their leader, or we will have them dead WW1-style.",
            "score": 4,
            "replies": []
        },
        {
            "author": "PlaguesAngel",
            "body": "I applaud these leaders, now keep going with their preparations.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Space-Turtle88",
            "body": "Looks like some EU countries are willing to get their hands dirty when it comes to protecting their sovereignty. Glad to see they won't be using kid gloves on invaders. \n\n\n Having to defend yourself while standing on the moral high ground, causes so many unnecessary deaths and prolongs wars. It doesn't make you a horrible country for doing all you possibly can to defend yourself and end a conflict as quickly as possible. \n\n\nI hope every EU country takes a look at their rules of warfare and makes necessary adjustments to match the aggression of future invaders. Otherwise we have another Ukraine - where russians are treated like frightened children and given special treatment, while russia tears through the country like a ravenous barbarian.",
            "score": 5,
            "replies": []
        },
        {
            "author": "quilleran",
            "body": "Well, this is why the Ottawa Convention was stupid. The idea that you won't use landmines until you're at war isn't all that principled. The only thing nations have accomplished by this treaty is make themselves vulnerable to predators like Russia.",
            "score": 8,
            "replies": []
        },
        {
            "author": "SenorPeligrosoBoboso",
            "body": "Time to invest in anti-personnel mine donations donations and crutches boys. Nice ",
            "score": 3,
            "replies": []
        },
        {
            "author": "Three_legged_fish12",
            "body": "Just use the anti Russian personnel mines and we’re all good.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Scorpius202",
            "body": "All Baltics states, Finland and Poland needs to build a modern Maginot line the border with Russia.",
            "score": 3,
            "replies": [
                {
                    "author": "SpecialistLayer3971",
                    "body": "Aside from it's utter failure in 1940, sure. Perhaps Eastern Europe will learn something from that debacle?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "b0bthemolester",
            "body": "Where the fuck is Finland? \n- a finn",
            "score": 3,
            "replies": []
        },
        {
            "author": "Arocos",
            "body": "https://www.politico.eu/article/poland-baltic-states-inch-closer-to-leaving-antipersonnel-mine-treaty/",
            "score": 2,
            "replies": []
        },
        {
            "author": "Apprehensive-List927",
            "body": "Good for them they will need when Putin comes for them.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Acrylic_Starshine",
            "body": "Wont be much of an issue if they are only placed in a buffer zone towards the Russian Border.",
            "score": 1,
            "replies": [
                {
                    "author": "Real_Painting153",
                    "body": "Where else would we place them? Random field in the middle of country?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "MaximumGrip",
                            "body": "> Where else would we place them?\n\nId suggest dropping them wherever the enemy masses.  Best option would be in russia itself.  Then all casualties and cleanup fall on their heads.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "johnwestnl",
            "body": "They better be in place on time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Liquid-Snake-2021",
            "body": "How long before we get military drafts reintroduced in Europe I wonder",
            "score": 1,
            "replies": [
                {
                    "author": "hundiratas",
                    "body": "Estonia has compulsory military training either 8 months or 11 months. I did 11 months as a ammunition truck driver for artillery. But i did that when there were towable howitzers, old soviet ones , we gave those all away to Ukraine. We now have driveable howitzers like Caesars and k9s. I have not seen them myself or driven or anything them. I have not seen any new equipment since i left, and that was 2015.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "inseend1",
            "body": "I would do the same, 1km long minefields along the border. With lava rivers. And toxic waste.\n\nRemove all the roads. Fortifications everywhere, build choke points. Maybe ask the Dutch for help to turn it into soggy swamp land.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Angrymilks",
            "body": "I'd pull out of that nonsense as well. War is hell and with the other side not following international law further proves the point that it doesn't really matter what laws you break as long as you come out the winner.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sir_Henry_Deadman",
            "body": "That's the best way to secure a border",
            "score": 1,
            "replies": []
        },
        {
            "author": "Possible_Chicken_489",
            "body": "It's so convenient that putting those four countries in alphabetical order also puts them in north-south order. Makes it easy to list them :)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Possible_Chicken_489",
            "body": "It's so convenient that putting those four countries in alphabetical order also puts them in north-south order. Makes it easy to list them :)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Possible_Chicken_489",
            "body": "It's so convenient that putting those four countries in alphabetical order also puts them in north-south order. Makes it easy to list them :)",
            "score": 1,
            "replies": []
        },
        {
            "author": "ImaginaryTwist4623",
            "body": "as long as those mines turn russian terrorists into cripples, im fine with it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pippelsons",
            "body": "Shit, I was thinking about this one day- russians love to use ap mines, so why cant we greet the liberators with mines on  our borders?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alexandratta",
            "body": "TL;DR: \n\n\"We would like to live in a world where we didn't need to do this, but sadly we share a border with Russians.\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "hjmcgrath",
            "body": "Good. They know Trump will sell them out, just as he's doing to Ukraine, and they need every weapon they can get to stop Putin.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sad-Statistician2683",
            "body": "More vatnik gore to come in the next few years lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "GreenStretch",
            "body": "New Russian tactic: coercing migrants to walk across the minefields.",
            "score": 1,
            "replies": [
                {
                    "author": "Arguablybest",
                    "body": "Don't give trump any ideas.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "topforce",
                    "body": "Mines won't be deployed unless necessary, for example if there is significant Russian military buildup near border.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "SpitefulRedditScum",
            "body": "This breaks my heart. Mines suck. Always and everywhere. They really fucking suck!!!! \n\nBut I understand… I just hate what the world is becoming again.",
            "score": -2,
            "replies": [
                {
                    "author": "PhilLynottIsKing",
                    "body": "It's a war that sucks... Not these mines that are for protection, not for attack.",
                    "score": 3,
                    "replies": []
                }
            ]
        }
    ]
}