{
    "title": "Ukrainian National Guard clearing enemy buildings and shelters, capturing five occupiers. Those who refused to surrender were eliminated. Likely Hrodivka, Donetsk region",
    "author": "8BallCoronersPocket",
    "subreddit": "UkraineWarVideoReport",
    "rank": 18,
    "score": 406,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 11,
    "url": "https://v.redd.it/j8ngcanepgpe1",
    "id": "1je6vlr",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Please remember the human. Adhere to all Reddit and sub rules. Toxic comments (including incitement of violence/hate, genocide, glorifying death etc) WILL NOT BE TOLERATED, keep your comments civil or you will be banned. Tagging u/SaveVideo bot to archive this video in a link below this comment. \n\n**To donate to Ukraine charities check out a verified list here:** https://www.reddit.com/r/ukraine/s/auRUkv3ZBE\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UkraineWarVideoReport) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "IstvanKun",
            "body": "Those guys have some huge b@lls of steel.\n\nСлава Україні!\nГероям слава!",
            "score": 12,
            "replies": []
        },
        {
            "author": "SNAFU-FUBR",
            "body": "You can feel the anger among the Ukrainians... but they're still taking prisoners.\n\nDid I see one of the ruZZian POWs (the one giving his brothers away by pointing out the next ruZZian strongpoint) was wearing yellow duct tape? I understand that the ruZZians are doing this more to confuse the Ukrainians. To me that's a desperation measure as the Ukrainians' superior command and control make them less likely to be fooled. Using UKR tape colours are more likely to have these ruZZians targeted by their own adjacent units and drone operators.",
            "score": 10,
            "replies": [
                {
                    "author": "finroth",
                    "body": "I think they taped him up as they were returning him to their lines.  \nYou dont want your side to look over the trench as see white tape.\n\nBut other than that, yes they have been caught again using the Ukrainian colours, another war crime.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "Dangerous_Lie77",
                    "body": "I think the Ukrainian placed yellow tape on them to prevent a accidental killing. Earlier in the video it doesn't seem he has the tape on.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "StickAForkInMee",
            "body": "Post this to r/ukrainerussiavideoreport and get banned.\n\nThat sub is nothing but vatniks  ",
            "score": 6,
            "replies": []
        },
        {
            "author": "Mindless-Box8603",
            "body": "Surrender or die bitches. Slava Ukraini",
            "score": 4,
            "replies": []
        },
        {
            "author": "zevalways",
            "body": "Thats chervona kalyna brigade, also isnt hdodivka behind enemy lines",
            "score": 1,
            "replies": []
        },
        {
            "author": "ImaginaryTwist4623",
            "body": "\"Ruki Verk - Hands up !\"\n\n is the only russian sentence you will need.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Aware_Example_3731",
            "body": "Heroyam slava 🇺🇦🇬🇧",
            "score": 1,
            "replies": []
        },
        {
            "author": "BallzInMaFace",
            "body": "This is insane footage",
            "score": 1,
            "replies": []
        }
    ]
}