{
    "title": "The Kremlin rebuffed Trump & The White House",
    "author": "ionbear1",
    "subreddit": "UkraineWarVideoReport",
    "rank": 7,
    "score": 501,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 78,
    "url": "https://i.redd.it/orxwemam6ipe1.jpeg",
    "id": "1jee5x2",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Please remember the human. Adhere to all Reddit and sub rules. Toxic comments (including incitement of violence/hate, genocide, glorifying death etc) WILL NOT BE TOLERATED, keep your comments civil or you will be banned. Tagging u/SaveVideo bot to archive this video in a link below this comment. \n\n**To donate to Ukraine charities check out a verified list here:** https://www.reddit.com/r/ukraine/s/auRUkv3ZBE\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/UkraineWarVideoReport) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "South_Hat3525",
            "body": "No one can truthfully say they are surprised.",
            "score": 1,
            "replies": [
                {
                    "author": "Hriibek",
                    "body": "Well I am! I thought it will take them at least 36 hours to break the rules.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Blussert31",
                            "body": "I'd have guessed 20, but I'm with you. Let's see what the \"deal maker\" Trump makes of this. I hope he gives Tomahawks to Zelensky.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Interesting-Bit-3885",
            "body": "The best deal maker in the universe made such a shitty deal ?  Peace in 24 hours and everyone happy 🙃",
            "score": 1,
            "replies": [
                {
                    "author": "Glydyr",
                    "body": "He said he was being sarcastic. What he really meant was ‘i will surrender in 24 hours’",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Silkovapuli",
            "body": "What a fart of a deal.",
            "score": 1,
            "replies": [
                {
                    "author": "Hriibek",
                    "body": "Did anyone expect anything better?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Fun-Heron2870",
                            "body": "No. As per usual, Donnieboy was his own hypeman before the whole event, and afterwards he is nowhere to be seen, even cancelled his press conference. He is the dumbest president, America has ever seen, and this 2nd term is basically just to remind us of that, for all those morons who voted for him AGAIN.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "FlexasaurusRex_",
                                    "body": "Show some goddamn respect, mans won the Trump-Cup like....65 times.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Glydyr",
                                    "body": "Hes got some golf to be shit at!",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Silkovapuli",
                                    "body": "Never, *ever* could I foresee that I'd eventually miss GWB. \n\nBut here we are.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Hanna-11",
                                    "body": "It's just like the disaster with Kim back then.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Robo-X",
                            "body": "But Putin respects Trump. 😂",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "squirtloaf",
                    "body": "To be fair, the book is not called: \"The art of the GOOD deal\"....",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Glydyr",
                            "body": "“The art of the ordeal”",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Big-Initiative5762",
                            "body": "Well for Putin it was a perfect deal!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "brianhauge",
                    "body": "To be fair, it's not a deal, it's just a list of their original demands. They haven't changed.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "HaZard3ur",
            "body": "I wonder if Putin offered him some eggs in return after the bad EU denied his request ?",
            "score": 1,
            "replies": [
                {
                    "author": "gggg566373",
                    "body": "They have been having a shortage of eggs since 2023 themselves. At some point they were trying to buy from Turkey.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "nomoleft",
                            "body": "Biden was working a deal with Turkey before the end of his term.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Scrapple_Joe",
                    "body": "\n\nhttps://media1.giphy.com/media/v1.Y2lkPTc5MGI3NjExNmJ2dDNtdWZzdDAxcTcxaHRjdWlveWJ2eHhycmVrMmtkNHg1YWtuOCZlcD12MV9pbnRlcm5hbF9naWZfYnlfaWQmY3Q9Zw/xjlC6nomocZhVXuZgM/giphy.gif",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "livinginspace",
            "body": "That doesn't seem like a \"peace deal\". That looks like terms of surrender",
            "score": 1,
            "replies": [
                {
                    "author": "Scared_of_zombies",
                    "body": "There’s been better terms of surrender than what Russia is demanding.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "_MCMLXXXII",
            "body": "I also have a different version which says Russia GTFO of Ukraine... pretty sure it's the only one that counts..",
            "score": 1,
            "replies": []
        },
        {
            "author": "That_Touch5280",
            "body": "And still no outrage?",
            "score": 1,
            "replies": [
                {
                    "author": "Great_Attitude_8985",
                    "body": "Guess Putin atleast wore a suit and might've spasibat enough for Trumps likenings.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "FirstSwordofCarcosa",
                    "body": "How can he outrage at his daddy",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "-happycow-",
            "body": "Trump is being treated like a little bitch. Art of the Deal my ass.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Onnimation",
            "body": "Yea that's not going to happen, especially stopping all mobilizations. That's basically asking for Russia to regroup and just break ceasefire anytime and take over land quickly. Nobody going to trust Russia here",
            "score": 1,
            "replies": []
        },
        {
            "author": "hgreenblatt",
            "body": "Trump is always willing to sell the other guy out. If the Europeans allow this they are morons.\n\nAll Trump wants is a Peace Prize, somehow I do not think that is happening.",
            "score": 1,
            "replies": [
                {
                    "author": "Remarkable_Doubt6665",
                    "body": "You mean Nobel? Zero chance since Sweeden is the one that gives them",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Angry__Marmot",
                            "body": "Norway. But it makes no difference.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Blue-is-bad",
                                    "body": "\"They're not Swedish, Mac. They're Norwegian\"",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "jaxsd75",
                                    "body": "Wait till the Finish find this out!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Reasonable_Poem_6321",
                            "body": "Wait until he cuts swedish internet during winter and threatens to invade ;)",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "SocksOfFire",
                                    "body": "Nice, the Peace Prize War of '26",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "hgreenblatt",
                            "body": "Totally agree, but do you really think the Mental Midget that is President of US understands that?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "L7gunner",
                    "body": "I would rather see Benjamin Netanyahu get the Nobel Peace Prize than Trump ... not that  Netanyahu deserves it, but just to flash a big middle finger in the face of Mr. Trump... effin' backstabber.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Pippelsons",
                    "body": "Hold up, somehow we , europeans, are morons, because you, americans,  voted for that shitstain of a person?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "SycomComp",
                    "body": "This is exactly what's happening Trump is selling out Ukraine for their minerals and soon to Putin.  And then they can both congratulate each other for ending the war.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ludvicious",
            "body": "\"and a slice of butt\" like we say in italy",
            "score": 1,
            "replies": []
        },
        {
            "author": "piptie54",
            "body": "I honestly do not understand how any “deal” can be made without the leader of the attacked country even there. That would be like Jimmy Carter making the Camp David Accords without either Sadat or Begin. Or  a NATO agreement between the US and Hitler and not any of the European countries. That is insane, makes zero sense.",
            "score": 1,
            "replies": [
                {
                    "author": "TigerPoppy",
                    "body": "To be fair,  that is how England made peace deals after WW1",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheAverageObject",
            "body": "Just put a bounty on Putins head already, dead not even dead or Alive. See how loyal Russians really are.\n\nAlso fun Idea, all sanctions lifted for Putins dead body.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Uselesspreciousthing",
            "body": "Current incumbent of the White House putting a brave face on it?  And shutting up?  Now *that* would be unusual.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dramatic_Security9",
            "body": "About what I expected.",
            "score": 1,
            "replies": []
        },
        {
            "author": "-happycow-",
            "body": "Pretty much what was to be expected. Dragging out the war while they destabilize US",
            "score": 1,
            "replies": []
        },
        {
            "author": "QuicksandHUM",
            "body": "Oddly, US leverage with Ukraine will evaporate if the US agrees, then Ukraine can keep resisting with European support. It will come down to European support versus Russia’s ability to fuel its war.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TigerPoppy",
            "body": "Trump was played for a fool.    He really is the worst negotiator ever.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Silly_Initiative_405",
            "body": "Here we go again…",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fun-Heron2870",
            "body": "We all knew if anything comes out of this, it would be favoring Russia, or nothing else. And that is exactly what these two talked about. Zelensky will put on a brave face and agree to it, but he should state that this \"deal\" was only agreed to for the prisoner exchange. Nothing else actually benefits Ukraine here.",
            "score": 1,
            "replies": []
        },
        {
            "author": "vampyire",
            "body": "Oh gee.. trump lies... again",
            "score": 1,
            "replies": []
        },
        {
            "author": "DulcetTone",
            "body": "Ukraine: the Latest hinted that Ukraine has entered Russia in a new incursion near Belgorod, which is East of the Kursk foothold.  I hope it's true and weighty in force level (a big hope).",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ivanovic-117",
            "body": "So keep firing at russian refineries?",
            "score": 1,
            "replies": []
        },
        {
            "author": "SycomComp",
            "body": "Funny how after 6 months in Kursk, NOW it starts to fall apart after Trump turns off support.  Trump is giving Putin a win it's clear as day.  Who knows if he's given away Ukraine locations too.. Ukraine should not trust Trump he's not their friend.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cain-Man",
            "body": "Guess Trump  thought he could put one over putin. He is so delusion in his mind. Sad for America and Ukraine.",
            "score": 1,
            "replies": []
        },
        {
            "author": "golitsyn_nosenko",
            "body": "Krasnov will ignore this completely, say he cut a deal and that the Ukrainians are reneging on the excellent and very fair deal he cut.\n\nHe’ll then cut aid and intelligence to them anyway to penalise them for “defying” him,  and say “you could have chosen peace and no military aid and intelligence, but you chose war and no aid and military intelligence, Russia wants peace but Ukraine doesn’t.” \n\nYet another Kremlin set up designed to push that narrative on American people so they believe Ukraine wants war, Russia wants peace, and we shouldn’t help Ukraine.",
            "score": 1,
            "replies": []
        },
        {
            "author": "_aap301",
            "body": "Orange pig Trump is cheering because this is the best deal ever!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Frosty_Key4233",
            "body": "The stump slump continues apace as Putin slam dunks his appeasing ass!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Prestigious-Tree-424",
            "body": "Who wudda thunk it, putin  making turdy demands.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ashamed-Worth-5663",
            "body": "That's not a ceasefire that is Capitulation.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Think_Comment2060",
            "body": "Anyone hear that Putin already hit some infrastructure in Ukraine and has ships in Black Sea ….Mariupol memories. I could be wrong but let’s do research the next couple hours. Dumped over Trumps game table if true.",
            "score": 1,
            "replies": []
        },
        {
            "author": "janderson176",
            "body": "Trumps needs to grow a set of balls and tell Putler how it is going to be",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hopeful_Ad_4343",
            "body": "If you give a mouse a cookie....",
            "score": 1,
            "replies": []
        },
        {
            "author": "hainz_area1531",
            "body": "And blaiming Zelensky...",
            "score": 1,
            "replies": []
        },
        {
            "author": "badstuffaround",
            "body": "What a shit deal Trump was able to negotiate...",
            "score": 1,
            "replies": [
                {
                    "author": "Think_Comment2060",
                    "body": "What deal? Putin make Trump look like dufas deal!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ill_Consequence403",
            "body": "What’s details…",
            "score": 1,
            "replies": []
        },
        {
            "author": "IntraspeciesJug",
            "body": "\"master of negotiation\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alert-Theory5824",
            "body": "Usual ru BS",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Landscape7154",
            "body": "So it is Trump who has no cards to play .... well who'd a thunk it... the great big Orange Agent Krasnov ....",
            "score": 1,
            "replies": []
        },
        {
            "author": "khoobr",
            "body": "Agent Krasnov will get the Order of Lenin for his fine work for Putin and Ruzzia.",
            "score": 1,
            "replies": []
        }
    ]
}