{
    "title": "I tend to regress when I'm home alone for a whole day",
    "author": "amroki96",
    "subreddit": "ADHD",
    "rank": 319,
    "score": 1323,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 80,
    "url": "https://www.reddit.com/r/ADHD/comments/1j1ynn3/i_tend_to_regress_when_im_home_alone_for_a_whole/",
    "id": "1j1ynn3",
    "selftext": "I've lived with my fiance for about 6 years now, I am a grown adult with a grown up job, pay all my bills, etc. But if he leaves and goes out of town for a day and I'm home alone, I fall deep into Gremlin mode. Cereal for lunch, PJs all day, TV and crafts all day, nothing productive. Leave out clutter piles. A couple naps, maybe. \n\nThen there's the inevitable panic clean up before he gets home because I don't want him to see how disgusting I am. \n\nIf he's gone for like a week, it gets better after a day or two and I find myself wanting to keep my living place functional again and catch up, but what the hell is this?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/amroki96 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Username_1379",
            "body": "I did that before having kids when my husband would be gone for work! \n\nI think it’s our brain/body’s way of just literally letting loose and relaxing without any type of fear of judgement. \n\nAt least that’s how I think of it. lol",
            "score": 763,
            "replies": [
                {
                    "author": "Neren1138",
                    "body": "This 100%",
                    "score": 75,
                    "replies": []
                },
                {
                    "author": "RaidersOak24",
                    "body": "**LOVE** THIS RESPONSE ABOVE\n\n**WELL** SAID",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "GhostOffice",
                    "body": "How are you managing being a parent and never having a truly lazy day? I need to know 🥲",
                    "score": 14,
                    "replies": [
                        {
                            "author": "Username_1379",
                            "body": "Adderall. Lol \n\nI was really struggling before I got diagnosed this past December. I was managing/surviving, but it got way worse last fall. \n\nAnyways, so I am thankful to have a very hands-on husband who truly helps me with all aspects of caring for our kids. And he has a unique work schedule, so when he’s home, he’s home. So I have learned to speak up and advocate for myself. When I need time away, whether it’s errands or to just hang out in our room, he has my back. \n\nOn the rare occasion the kids are at their grandparents’ and my husband is away for work, I totally chill for a few hours (sometimes all day) before I need to get back to the everyday chore list.",
                            "score": 13,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Brad_Da_Rad",
            "body": "Maybe the gremlin mode is just your brain unwinding. I have dirty, lazy order food from home days a couple times of year now that I think about it. \n\nTBH, sometimes it’s nice to unwind mentally get comfortable with yourself. If you don’t like how you’re unwinding or feel like you’re regressing, try researching some other ways to unwind that may feel more rewarding for you, or accomplishing something. That said, there is no need to be productive 100% of the time either, go free will lol",
            "score": 298,
            "replies": [
                {
                    "author": "ema_l_b",
                    "body": "I need to remember the phrase 'gremlin mode', and use it at every possible opportunity",
                    "score": 56,
                    "replies": [
                        {
                            "author": "Username_1379",
                            "body": "Yes. Love this.",
                            "score": 13,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Vivid_Prior7371",
                    "body": "i need a lot of 'bullshit time' to get over all the masking u have to do all day",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Anicanis",
            "body": "Same... I feel it's like I need an audience to function, otherwise I have no motivation. I'm really trying to change this because my partner often travels for work and I spend a lot of time alone. I have definitely improved, but this is a lifetime issue for me. I have this theory that when we are young, someone else (like, parents) have the authority to structure our schedule and activities – which we do our best to rebel against, especially with adhd. As adults, we take on both roles, which is conflicting for us (with adhd). So if you don't have 'social pressure' or external structure (as in, someone else around you living a more structured life) the rebel side can just take over. Anyway, I've been telling myself that I deserve to take care of me even if I'm the only one to witness it.",
            "score": 204,
            "replies": [
                {
                    "author": "amroki96",
                    "body": "Needing an audience to function, yes that's exactly it! It's why I am so productive at work too and not so much when I'm alone.",
                    "score": 106,
                    "replies": [
                        {
                            "author": "Leo_and_Stitch",
                            "body": "I agree with uhhdrina below to the stem comment... It's because him being around is naturally body doubling! Though also ok to just let it slide sometimes. \nAnd I think crafts sounds productive!!",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "sheambulance",
                            "body": "Audience to function is so, so on point. My spouse also works from home and i occasionally find myself wanting “space” to clean and not be irritating to him with my frantic back and forth method.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Alwaysroom4morecats",
                            "body": "Yeah most of the time I still feel I'm 'pretending to be a functional adult' when someone is watching- I'm a 45 yo with a kid and still if I have a chance for a do nothing day I will sit and gremlin!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "uhhhdrina",
                    "body": "that sounds like body doubling!",
                    "score": 22,
                    "replies": []
                },
                {
                    "author": "_snappleapple_",
                    "body": "a great explanation, thank you",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "thesearchingbear",
                    "body": "This makes so much sense! I always feel like I’m fighting myself and my best laid plans are sabotaged by my rebellious nature. The way you explained it as the parent/ child dynamic is eye-opening. And I also need an audience to function. So interesting that other people have these same struggles!",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "RaidersOak24",
                    "body": "TY",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "pilazzo209",
            "body": "I have severe issues with task paralysis. When I’m around other people, it’s mostly non-existent, but when I’m by myself paralysis rears its head. Just here to say, I have a similar experience when I’m on my own. \n\nWhat has helped me is a focused, intentional approach to my alone time. Self-care becomes a bigger priority—full night’s sleep, good nutrition, hydration,exercise and maybe some low-anxiety social events (coffee/lunch with a friend, a hike with a buddy, etc.)\n\nThe biggest one (again for me not saying you should do this since we all experience adhd differently) is getting some simple tasks done at the very start of my day. I clean my kitchen, not a deep clean just putting dishes away, drink a grip of water, and I eat something…anything. After that, I journal for a few minutes and I review my personal trello board and calendar. \n\nFrom there, it’s whatever I want or need to do, but I’ve found a lot of comfort in focusing on myself and basic self care right at the start of my day. It clears my head, and often will prevent my paralysis loops.\n\nLastly, i still have days where my paralysis issues get on top of me. I try to keep those days to a minimum, but when they do occur I accept that they’re part of my adhd experience. I let it go, and I try again the next day. More often than not, a heavy paralysis day is a signal that I just need some rest…which is perfectly normal. We’re allowed to rest.",
            "score": 92,
            "replies": [
                {
                    "author": "RaidersOak24",
                    "body": "Thanks i can relate a lot",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "thesearchingbear",
                    "body": "Such a lovely approach. Thanks for sharing",
                    "score": 2,
                    "replies": [
                        {
                            "author": "pilazzo209",
                            "body": "Thank you. I have so much love for my fellow ADHDers, I believe in all of us.❤️",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "RaidersOak24",
                            "body": "indeed",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "breadpudding3434",
            "body": "Perfect post for me to see right now because I’m going through the same thing. It’s important for me to have at least some small outing every day. Even if it’s just grocery shopping. As much as my body pulls me to just lay in bed all day, it’s so easy to get “stuck.”",
            "score": 38,
            "replies": [
                {
                    "author": "amroki96",
                    "body": "It's nice to have the validation and know we're not alone in these experiences 🥰",
                    "score": 18,
                    "replies": []
                }
            ]
        },
        {
            "author": "RikuAotsuki",
            "body": "Yeah that's just unmasking.\n\nThere's different levels of masks, but the ones ADHD and autistic folks are most known for are basically \"normalhuman.exe\"\n\nEven when we're relatively comfortable around others, our *baseline habits* can be disruptive, annoying, or \"weird\" to others, so we're constantly moderating our own behavior to some degree.\n\nWhen you're alone, that most basic mask comes off after a while.",
            "score": 37,
            "replies": []
        },
        {
            "author": "babz816",
            "body": "Excuse me, crafts and naps are productive. Period.",
            "score": 32,
            "replies": [
                {
                    "author": "Optimal_Cynicism",
                    "body": "Right? Creative outlets and self care should never be seen as a waste of time. We one get one life, every minute does not need to be spent being \"productive\". \n\nPrioritise enjoyment, damn The Man.",
                    "score": 16,
                    "replies": []
                }
            ]
        },
        {
            "author": "PromiscuousT-Rex",
            "body": "You’re totally fine. Whenever my wife has taken our kids with her out of town, I revert back to POS mode. Every single thing I do normally as a responsible adult just flies right out the window. It’s awesome. Allow yourself that freedom!",
            "score": 23,
            "replies": []
        },
        {
            "author": "Difficult_Standard_1",
            "body": "I’m assuming your Fiancé knows about your ADHD? If so then he should absolutely embrace you in gremlin mode too, it’s nothing to be ashamed of, and you should also embrace you in gremlin mode, everybody can burn out ADHD or not. \n\nMy husband (non ADHD) knows just about every Sunday is my gremlin day, I loathe sundays as they are so boring so I just about put on normal shoes to walk the dogs and if not going out for the rest of the day its sloggies, cereal and video games. If he wants something specific for dinner he’ll cook it himself or join me in gremlin mode. It makes for a happy marriage😄\n\nI use to think that it was immature of me to act that way when I was by myself or if I needed to recharge, however, knowing that he was ok with it before we got married made me realise that he understood my ADHD and he accepted it was just me.",
            "score": 20,
            "replies": [
                {
                    "author": "amroki96",
                    "body": "Haha yes he is 100% aware. But I also know that he is very sensitive and overwhelmed by clutter and I already have a deeply ingrained sense of shame that it's hard to not feel bad for existing and taking up space sometimes😅",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Difficult_Standard_1",
                            "body": "😅, OMG you take up all the space! But seriously I get it to, we’re building a house and my husband is the Architect , and bless him he is trying so hard to accommodate my ADHD C , and also his need for a clutter free home. I do get sad at times and feel like I’m going to slowly undue all the hard work he’s put into the design (complicated site) by being so messy.  \n\nThat’s great your so caring too, I definitely don’t have the people pleasing part of ADHD, but I do care about my husband so that’s why I partly went back on meds because I could see and the feel the burden. I’m slowly getting better.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Illustrious-Anybody2",
            "body": "Me too dude. \n\nI have trouble assessing that time is passing when no one is around to provide clues. Plus it’s easier to slump into distractions when there’s no one to witness me not doing whatever I’m “supposed” to be doing. \n\nHave you heard of “body doubling”? It’s a common ADHD strategy where you arrange for someone else to do tasks with you (or just physically be present while you do tasks) because it helps with productivity.",
            "score": 23,
            "replies": [
                {
                    "author": "_snappleapple_",
                    "body": "“i have trouble assessing that time is passing when no one is around to provide clues” ive never related to something more in my life",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "psullynj",
            "body": "Same. Now that I’m married with kids I do gremlin mode when the kids are asleep. I literally make a casserole of buffalo chicken dip that I eat for dinner every night he’s out 😂",
            "score": 12,
            "replies": []
        },
        {
            "author": "Real_Distribution91",
            "body": "So you mean when your routine changes it’s hard to know what to do? Yeah same.",
            "score": 12,
            "replies": [
                {
                    "author": "amroki96",
                    "body": "Totally. I absolutely rely on external pressure to get stuff done if it isn't naturally interesting to me in the moment.",
                    "score": 14,
                    "replies": []
                }
            ]
        },
        {
            "author": "Every-Zombie-4139",
            "body": "Honestly, those are my favorite types of days. Being alone, so I don’t have to put on a show. Or have people around me aggravating the shit out of me. My ADHD currently is making my emotional regulation practically impossible, so the chances of me snapping at people around me are so high and it makes me so sad when it happens, I prefer isolation.  I know it’s probably not healthy, but I am a late diagnosed ADHD perimenopausal female, so I don’t know if the perimenopause is what has created these rage/sadness/frustration/pissed/agitated feelings about 80% of the time for literally the past year. I’d never felt it this intensely before. So I love being home alone. And doing nothing. But I hope this is temporary because I hate treating my loved ones like shit and raging at them. But I find it so hard to control. It makes me sad in the moment and after, and I cry about it all the time and I don’t know what to do. This is all so new to me. Sorry if that was way off-topic",
            "score": 23,
            "replies": [
                {
                    "author": "nailtheory",
                    "body": "I relate to this very much. \nI recently had to get a 2nd apt in addition to living together in a long term relationship.\nIt was for a few reasons but most of all to have my own space where I don’t have to “be on” in front of my partner. I don’t need to be on, but it’s just my nature to be alert to anyone who is in the same space as me.\nLast Sunday, I was alone and I did NOTHING except read. I needed that. I’m also peri-adhd medicated-pmdd person so I’m going though alot internally. I think we have to listen to what we need internally. This world is so crazy and demanding , it’s hard to know.",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "WittyDisk3524",
                    "body": "I went through the rage stage during menopause shenanigans as well.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Every-Zombie-4139",
                            "body": "How long did it last for you? I swear this has been going on for almost a year now already. I just turned 43 in January.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "crispyfolds",
                    "body": "Hey uh, talk to your dr about your mood change. Especially if it seems similar to other women in your family. The women on my mom's side of the family became such raging beezeys with menopause that I'm stunned none of it resulted in divorce. Like truly unbearable to be around for years. I've already got a plan in place to make sure that when it's my turn, I don't become what they did.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Every-Zombie-4139",
                            "body": "What is your plan? Curious. And I’d love to see if you have ideas on how to deal with perimenopause when you get there that I may not have thought of yet. I’m already on hormone therapy. Im on an estradiol transdermal patch and a progesterone pill every evening. My OB just upped my estradiol patch to see if that does anything. \n\nOtherwise, I have an appointment coming up with my psychiatrist because of the intensity of these mood swings. I may try another medication. But I’m not sure. I think I’ll make that decision at my appointment. Scares me because the last medication‘s I’ve tried all made things worse. Literally all of them. Besides Valium and hormone therapy. Ugh.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "crispyfolds",
                                    "body": "Basically what you're doing! Hormones and adjusting the doses until we get it right. I glanced over a few studies and Reddit posts a couple years ago and it sounds like everyone's got their own magic combo, you just have to find the right amounts. I'm also open to anti-depressants or whatever if needed, which my family members angrily rejected. Just going into it knowing that I don't want to be like they were, and being open to trying whatever I have to until people say I'm nice again 😅",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "amberallday",
            "body": "I find these days important. \n\nMy partner actively plans to be out of the house (where possible) for at least part of the day, if not the whole day, when I have a day off work to myself. \n\nHe’s going into the office tomorrow rather than wfh, in large part because I have the day off. \n\nI either get loads done when I have the house to myself, because I’m entirely undistracted (this happened last week) or I stay in PJs all day & get nothing important done - I might do “stuff” all day, if the winds take me there, (I’m not necessarily stuck in bed all day) but it’s rarely high priority stuff - more like reorganising a single kitchen cupboard to within an inch of its life.",
            "score": 8,
            "replies": []
        },
        {
            "author": "CrookedPieceofTime23",
            "body": "It’s okay to just ‘be’ sometimes.  We are human **beings** after all. Whenever I have my ‘check out from all adulting responsibilities’ days and the productivity guilt starts creeping in, I think to myself, “just enjoying the being part of being human today.” I don’t really feel guilt about it much anymore.  I have a lot of stress in my life at the moment and it’s either take time and zone out, or I’ll lose my shit.  It’s necessary.\n\nSociety tells us that if you aren’t being productive, you’re failing.  That’s bullshit. There are religious roots in that way of thinking (Christianity, and being productive as a means of serving god), cultural  (kicking back for some afternoon relaxation, siesta style in the middle of the work day probably isn’t going to fly in other regions, but good luck shopping mid-afternoon in a small Spanish town), and then there is good ole capitalism (gotta maximize that productivity, decrease those labour costs, and increase the profit margins; work em into the ground, just make the line go up!).  We’re conditioned to use productivity as a measure of self-worth. Kids can be kids and play, that’s fine.  Retirees can lounge and read the newspaper and drink tea all morning, that’s great.  But if you’re of working age, how dare you take pause and enjoy some peace and quiet?! We’ve drawn these arbitrary age brackets that dictate at what point in our lives it’s okay to just BE, but for the bulk of our years, it’s not needed and it’s not okay? Meh. I think that’s pretty silly.\n\nIt’s why I loathe the term “rotting” when describing someone just taking a day or a weekend to just BE.  If it’s helping your brain to relax a bit and leaving you feel recharged, it’s not rotting.  It’s resting. I had an insane year last year and I “rotted” for the first five days of my ten day vacation.  I was completely burned out.  I wasn’t rotting, I was exhausted and I needed some time to sleep, do mindless shit to try to get my brain to stop short circuiting, and sleep some more.  A family member commented that I was wasting my vacation.  I asked what I was supposed to be doing on my vacation.   Apparently I was supposed to be out having fun? Not sure who the authority is on vacation time activities but I retorted that I took time off work, and if fun felt like work then it wasn’t really fun. Naps are fun, rewatching game of thrones, super fun.  Screw off with your judgement. \n\nThe demands on us never stop.  There’s so much to do and never enough time to do it.  If I don’t seize the needed moments to just check out from adulting, spend some time making art or journaling or hell, playing word games and binge watching some movies, I eventually burn out.  My brain gets even more chaotic.  My concentration tanks, I get more forgetful. My ability to emotionally regulate takes a nose dive.  \n\nBesides, crafting is good for the soul.  I recently started teaching myself to paint and it’s basically my new mindfulness technique?  Nothing else exists when I’m playing with my art supplies.  The to do lists are forgotten, the stress of what’s not done just evaporates, the 18 different internal narratives get silenced.  I just….paint.  Creating things is not a waste of time, it’s good for the soul. Stay calm and craft on.",
            "score": 6,
            "replies": [
                {
                    "author": "amroki96",
                    "body": "This changed my brain chemistry for the better. Thank you for taking the time to write it all out, everything resonated 100% and it's something I've been telling myself and THOUGHT I'd conquered, but it seems like I still have a ways to go in terms of self acceptance and giving myself permission to just relax without the associated guilt and shame.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "AnimalPowers",
            "body": "It's like a re-calibration.   You're used a certain routine, but a large chunk of your life just got ripped out of that routine.  So you're trying to compensate and calibrate to find the new daily rhythm.   \n\nIf you think about it, I bet there's other times like this.  Like when your fiance returns, or when another unexpected event occurs.  It's not necessarily that they're all 'gremlin' days, but, you have to adjust to every new change and often that means the balance is thrown off and out of whack.   \n\nIt's like a knee jerk reaction, or getting burned, so you pull your hand too far too quickly, then you have to adjust accordingly and get the swing of things. \n\nRoutine for me fragile and changes with the breeze, so it's more of \"what are we doing this week\" - because life is so dynamic and so many things change, I have trouble keeping something longer than that, largely the weekend throws a wrench and resets EVERYTHING.\n\n*Some weeks are just lost to the fishes*\n\nAnd that's okay.",
            "score": 6,
            "replies": []
        },
        {
            "author": "yours_truly_1976",
            "body": "I WISH I could do that! Enjoy being “you” in a space place alone",
            "score": 7,
            "replies": []
        },
        {
            "author": "Linkcott18",
            "body": "Umm... Maybe we all need to gremlin mode once in a while?",
            "score": 5,
            "replies": []
        },
        {
            "author": "Dear_Chemical4826",
            "body": "I feel this.\n\nI'm a single dad.  When my kids are with me, my life has a clear shape, purpose, and direction.  I still have ADHD, but I manage to function pretty well.\n\nWhen I don't have my kids, I just feel lost and pointless. I not only procrastinate on things I need to do, I'll even procrastinate on things I actually want to do. No idea how to structure my days.\n\nIt sucks.",
            "score": 8,
            "replies": []
        },
        {
            "author": "a_naked_caveman",
            "body": "Same.",
            "score": 3,
            "replies": []
        },
        {
            "author": "airysunshine",
            "body": "Haha me. It’s the time I can truly 100% unmask!",
            "score": 3,
            "replies": []
        },
        {
            "author": "ferriematthew",
            "body": "I'm always in gremlin mode",
            "score": 3,
            "replies": []
        },
        {
            "author": "cheese_incarnate",
            "body": "At least you craft lol.\nI want to but then get overwhelmed and quit before I even start.\n\nIf it doesn't become a snowball effect then I personally don't see any problem with letting yourself have one or two gremlin days from time to time.",
            "score": 3,
            "replies": []
        },
        {
            "author": "futurecrazycatlady",
            "body": ">but what the hell is this?\n\nRelaxing? \n\nI actively plan to make weekends like that happen once every 2 months *at least*, they keep me sane/not burned out long term.",
            "score": 3,
            "replies": []
        },
        {
            "author": "_snappleapple_",
            "body": "this happens to me when my bf leaves! i’m so glad to know that it isn’t just me",
            "score": 3,
            "replies": []
        },
        {
            "author": "Meridienne",
            "body": "Good for you! Let your brain relax into Gremlin mode. I love this phrase!",
            "score": 3,
            "replies": []
        },
        {
            "author": "toucanbutter",
            "body": "I used to be ashamed, now I'm not. If I'm left home alone and all I did was rot, I fully tell him. He'll ask what I got up to, and I'll say \"nothing\" and smile. I work all day, so little of my time is my own, I'm done being shamed into needing to be productive at all times. I'm human. I need to chill.",
            "score": 3,
            "replies": []
        },
        {
            "author": "millicentmouse",
            "body": "My husband doesn’t have ADHD, but it is pretty freeing to be able to turn into a gremlin from time to time, and I feel like I’ve been able to help him get in touch with that side of himself, haha! Maybe you can have a mutual gremlin day together? Sometimes people only hold us to the same expectations they hold for themselves, but really it would be a lot nicer if we could all just release those expectations sometimes. Whenever my husband finds me with my sweatshirt hood up, he laughs because he knows I’m in gremlin mode.",
            "score": 3,
            "replies": []
        },
        {
            "author": "notcreativeenough002",
            "body": "I think its just our way to spend time alone and literally not give a fuck about anything. Literally just shutting off and i love it hahaha. Love to embrace it. As long as you know its just temporarily, i don’t think there’s a problem 😄",
            "score": 3,
            "replies": []
        },
        {
            "author": "Present_Cod3692",
            "body": "Same. I think it’s ok to do that. It’s really a luxury. When I get days like that, I’m so grateful for them because wow, I don’t have to do anything for anyone. It’s like a vacation. We all need rest days, and you should spend them however you want, no judgment.  Imo!",
            "score": 5,
            "replies": []
        },
        {
            "author": "jack3308",
            "body": "#### Let's reframe this a little bit\nbecause I feel you but I also think you're being a bit hard on yourself \n\n> *(Shocking?!?! Us??? Hard on ourselves?!?! We would never!!!)*\n\nI know, I know... But just hear me out..\n\nWe adjust ourselves all the time to make sure we fit into the world better. \n\nI feel like - and please correct me if I'm wrong - most of us don't really get the option to exist how our brains would like us to (while also being filly functional adults and the things that entails). \n\nI know I'd love every storage area to basically have no doors, and I'd want to have a charger for my phone at every outlet next to where I sit, an alarm clock that turns on the lights when it goes off, and various other things that help my brain. \n\nSome of those things are very doable without having a huge impact on my partner/others, but some others are not... \n\nWhen I get to be on my own for a day or two, whatever project I'm doing ends up sprawled by in the lounge room so I can see all the parts and my brain let's me get on with it.\n\nI don't have to worry about getting dressed if I don't want cause *I know* I'm not leaving the house...\n\nAnd I likely will have 1 big meal in the day because that's what works for me...\n\n**My brain gets to do it's thing entirely the way it wants to and it *loves* that! And, it *should* be allowed to do that sometimes!!**\n\nLetting yourself live in the way that's easiest for your brain for a bit is awesome and you quickly get to the point where you regulate back to a more sustainable approach than the over-correcting ADHD-goblin mode (I use goblin with an affectionate/positive connotation)...\n\nBut that doesn't mean your brain doesnt need those few days here and there where you can go whole-hog on it, and just not *worry* about filtering yourself that way...\n\nIt's hard work to keep that filter up, and having a bit of time when you don't have to is like catching up on sleep. The first night or two you'll sleep for like 14 hours... But then you get to a more reasonable 9ish hours, which is just fine too!\n\nBut there's *nothing* wrong with catching up on sleep when you're at a deficit!! In fact, it's really really helpful!! Don't feel guilty or bad, just treat it like a little vacation from filtering the way your brain wants to do things!",
            "score": 5,
            "replies": []
        },
        {
            "author": "Throwaway82952",
            "body": "I totally understand. I tend to date people who are super productive and on the go all day, everyday. Like the last four people I dated would never in a million years sit at home all day. I’m currently living by myself but I love it!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Forsaken-Street-9594",
            "body": "Weekends I tend to spend the first 2 nights in sloth/self sabotage mode where I make a mess of everything and start spiralling. Sunday, I’m frantically cleaning up the messes I made over the previous 2 days and I don’t get anything else done that I need to. Fml",
            "score": 2,
            "replies": []
        },
        {
            "author": "ApprehensiveCash6662",
            "body": "For a moment, I thought I wrote this post 😅 very relatable.",
            "score": 2,
            "replies": []
        },
        {
            "author": "meeps1142",
            "body": "Sometimes we need a gremlin day. It only becomes a problem for me when it's too many days in a row (which doesn't really happen now that I'm out of college.)",
            "score": 2,
            "replies": []
        },
        {
            "author": "Enerchai",
            "body": "LOL wtf this is me",
            "score": 2,
            "replies": []
        },
        {
            "author": "NeutralLovebird",
            "body": "I’m 100% the exact same way. Currently like this right now. Not productive. Napping. Cereal for dinner. Sometimes I feel bad for looking forward to his work trips, but I love a few days of couch-rot, crafts, naps, and trashy TV",
            "score": 2,
            "replies": []
        },
        {
            "author": "thepolkagirl",
            "body": "I am the exact same way. Trying not to judge myself for it. My husband takes the kids to his parents on Sundays and it leaves me gremlin time. Sometimes I’m productive but many times I’m just reveling in the peace.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Poobaby",
            "body": "It’s because you miss him and are sad, you function after a few days because you have processed your grief. I would not feel embarrassed but tell him, it’s proof you love him and adorable ❤️❤️❤️",
            "score": 1,
            "replies": []
        },
        {
            "author": "takeosp3cks",
            "body": "Same. I have schizophrenia too, tho, and when I'm left alone I start crying because im afraid of being left alone and all my progress goes down the drain until I see my mom. It's like she fills my HP bar",
            "score": 1,
            "replies": []
        },
        {
            "author": "Eishu0106",
            "body": "Same. But now, after 10 years together, I welcome my husband home in full gremlin mode.\nI love being alone without my husband. And if someone stays at my place for a few days, I can’t relax at all. I can only truly rest once they’ve all left.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zealousideal-Fix2960",
            "body": "Love the”gremlin mode” term.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Larimar1984",
            "body": "Gremlin mode sounds adorable. :) We all need downtime. You deserve a rest.",
            "score": 1,
            "replies": []
        },
        {
            "author": "readithere_2",
            "body": "Our brains are tired. When down time without guilt happens we cocoon.",
            "score": 1,
            "replies": []
        }
    ]
}