{
    "title": "How to not let a hyperfixation get in the way of my work?",
    "author": "Lullypops",
    "subreddit": "ADHD",
    "rank": 468,
    "score": 4,
    "upvote_ratio": 0.83,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/ADHD/comments/1j26ike/how_to_not_let_a_hyperfixation_get_in_the_way_of/",
    "id": "1j26ike",
    "selftext": "Hi! For context, I only just today get prescribed stimulant medications.\n\nAnyways, i recently developed a Lego hyperfixation because my partner gifted me a Lego architecture set for V-day. (They know how much I love architectural design) Anyways, having that set actually helped me a lot to be motivated to do work, cuz I would be able to reward myself and have my relaxation time from building the model. However, now that the model is done, it’s like my brain has been seeking that same satisfaction since then, and I haven’t been able to concentrate on my college assignments. It’s been pretty bad. I’ve been down a rabbit hole watching Lego video essays, speed builds, and have been interested in making my own Lego architectural models now.\n\nI fr can’t seem to concentrate, and I’m not sure what the best way is to limit distractions since all my class work is digital.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/Lullypops and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lullypops",
            "body": "At this point, I might just take apart the model and rebuild it just to feel something…",
            "score": 2,
            "replies": []
        },
        {
            "author": "Stabby_Stab",
            "body": "If your experience is anything like mine a few things might work: \n\n\nDo small amounts of the class work, like writing one sentence. Executive dysfunction makes it hard to stop doing things in order to start doing other things, so use that to your advantage. Sometimes you will just write one sentence, but a lot of the time you'll write more because now that you've started something the executive dysfunction makes it hard to change tasks.\n\n\nReward yourself by turning the logo hobby into a project. There's a lot of lego out there, so deciding exactly what you want to get and build will involve a lot of consuming the content you mentioned already enjoying. Compartmentalize the hobby into the project, and delineate time for work and time for project. You might find that your brain is happy to process in the background and let you work if it knows that you'll be back to your project at a set time. \n\n\nWhen an intrusive Lego thought pops up, I think it should be easier to dismiss with \"not now\" rather than trying to abstain completely. \n\n\nKeep your partner in the loop if you are buying more Lego, it can be a fun thing to do together and keeps you from going overboard.",
            "score": 2,
            "replies": []
        }
    ]
}