{
    "title": "My meds aren’t as effective as they were??",
    "author": "Anonymousfrog__",
    "subreddit": "ADHD",
    "rank": 480,
    "score": 2,
    "upvote_ratio": 0.75,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.reddit.com/r/ADHD/comments/1j29db8/my_meds_arent_as_effective_as_they_were/",
    "id": "1j29db8",
    "selftext": "I got diagnosed with inattentive adhd a couple weeks ago and was put on 36 mg of concerta. I started it and was amazed at how focused I could be. I lived my whole life struggling through zoning out and now I finally didn’t have to shake myself back into the room. However, now I find myself zoning out again. It’s almost as if I’ve never taken it. I’m so confused about it, does this mean I need a higher dose?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "ConcernedPapa2",
            "body": "A couple of things: 1) I found when I started on medication that I immediately felt “zoned in.”  And that’s what made the newly medicated state really wonderful. Over time, though, that initial feeling can fade. The trick is to start to apply discipline and concentration to the time you are medicated. For instance, a lot of people will point out that if they start work or form a firm plan before they take their medication, they will work with focus when the medication kicks in. However, if they don’t have a plan, they will just zone out and scroll while on medication. Don’t let medication drive the bus. But leverage medication to drive the bus better. It is something you will have to work at.  2) it’s possible you have the wrong medication. Concerta worked just okay for me at first, though certainly better than nothing. But I did feel myself kinda zoning out. The biggest effect for me was that I would lose words. Others have talked about that problem. Adderall is a much better fit for me. With Adderall, though, I have to remember my first point:  medication is like crutches. They prop you up, but you need to push yourself forward.",
            "score": 12,
            "replies": []
        },
        {
            "author": "DwarfFart",
            "body": "Concerta or methylphenidate does that to me. It calms my mind but too much so I just space out. Adderall gives more of a drive and focus for me. \n\nBut the top comment is spot on. You gotta drive the bus.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Silver-Bad3087",
            "body": "You experienced the initial euphoria that comes with the hope in the first dose. I think we’re all more well intentioned at first. I think it’s why we don’t get addicted and even often forget to take it regularly. I remember taking prescribed oxycodone after a major surgery and it always felt that great, utterly terrifying.",
            "score": 2,
            "replies": []
        }
    ]
}