{
    "title": "Tips for quitting smoking with ADHD?",
    "author": "cantsayididnttryyy",
    "subreddit": "ADHD",
    "rank": 398,
    "score": 12,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 23,
    "url": "https://www.reddit.com/r/ADHD/comments/1j2byte/tips_for_quitting_smoking_with_adhd/",
    "id": "1j2byte",
    "selftext": "I've been dependent on nicotine for years and I just have no idea how I would be able to function without it. \n\n  \nIf any of you have managed to quit while dealing with having ADHD and all the things that come along with that, I would love advice. \n\n  \nFinancially it makes no sense for me to smoke, and I'm sick of feeling guilty about spending money on something that's essentially poisoning me. I want to quit, but I know if I go cold turkey or even use patches/gum it's just not going to work for me, I've tried it so many times. Please give me advice",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/cantsayididnttryyy and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "InfamousRelation9073",
            "body": "I'm not smoking cigs but I switched to a juul. It made me feel a million times better but is still something. The disposable vapes with the flavors and shit make me feel horrible, but with juul, I don't have flem, no breathing problems, nothing. It's still not good for me no doubt, but it's sooooo much better feeling.",
            "score": 6,
            "replies": []
        },
        {
            "author": "brian_james42",
            "body": "Im not a doctor, but Wellbutrin was super helpful for me with cravings. I started up again after a year though. I recently switched to vaping, and it made it so much easier that I feel like I’m cheating. Whatever works though. It’s not ideal: I’m totally replacing one addiction with another one that’s not nearly as harmful. A lot of people will say that it’s just as unhealthy, but from what I understand, and from how much better my lungs feel, I disagree. It’s harm reduction. Edit: the patch helped, but I’m having a much easier time w/ what I’m doing now.",
            "score": 5,
            "replies": [
                {
                    "author": "cantsayididnttryyy",
                    "body": "That's good advice except that I used to vape almost 24/7 and it really harmed my mental health... Weirdly I feel better smoking than vaping because cigarettes aren't available any time so I can stick to 3 a day. I need to quit nicotine alltogether because if I pick up a vape again I am screwed",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ludguallon",
            "body": "I put all my vape gear in the trunk of my car so I still had it on hand.  But it was to inconvenient to go get it.  If I gave it away, I'd just buy another.  But keeping it just out of reach left me comfortable with keeping away from it.",
            "score": 5,
            "replies": [
                {
                    "author": "thefr0stypenguin0",
                    "body": "Thats actually genius.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "SMpkaVH",
            "body": "I had to double patch the cravings were still so strong with just one patch. I did get professional advice before doing so though. The gum made me feel like throwing up so that didn't last long. \n\nI was diagnosed after I quit though - so if you manage to quit, be aware that your traits will likely come at you significantly harder. If you're medicated, you might need to monitor the effectiveness of your meds as smoking helps us mask and self soothe.",
            "score": 3,
            "replies": []
        },
        {
            "author": "nord501",
            "body": "I switched to nicotine pouches. I'm not sure if I can quit nicotine in the future, but it is much better than cigarettes.",
            "score": 3,
            "replies": []
        },
        {
            "author": "fr4gge",
            "body": "I just quit cold turkey. It's the only thing that works for me.",
            "score": 3,
            "replies": []
        },
        {
            "author": "thefr0stypenguin0",
            "body": "My way will probably not help you... but I got pregnant. I was a smoker for about 12 years and had tried to quit multiple times. Being pregnant forced me to quit. It was a rough 3 days, but those were the worst. \n\nI used suckers, fidget toys, taking a walk, and picked up a new cross stitch to keep my hands busy. \n\nAnother thing to think about is not putting yourself in situations that make you think about smoking. My biggest triggers were booze, bars, sit down meals and driving. \n\nThe hardest ones to get past were my driving cigarettes. Any time I would get into my car I would have a smoke. I kept 1 cigarette in my car and just lipped it while driving. Never lit it but it helped with the driving craving. \n\nI wont lie and say I never think about it. I even tried one again after my kid was born. I gagged and threw it out. I miss them 1000000% but its manageable. It's been a little over 2 years since I actually had a full cigarette.",
            "score": 2,
            "replies": []
        },
        {
            "author": "aquatic-dreams",
            "body": "The patch didn't help me. The gum was great in class or in a pinch, but it always gave me a scratchy somewhat burning throat and it didn't help with the other rituals and things I used smoking for.  But I quit after twenty years by swapping it with vaping, old school vg pg and nic. It is not nearly as satisfying as smoking. I also breathed a lot better than when I smoked. I mixed it myself and didn't bother with flavoring. I figured if I was ok with the taste of cigs, I didn't need chocolate or raspberry or whatever, probably didn't help that the best flavoring I found was a cinnamon like atomic fireballs but it was really bad for my lungs. I had failed quitting so many times, quitting wasn't really the point. I was just trying to replace it.\n\nI was dizzy as fuck. I was getting way too much oxygen and I found when I was out of breath, I wasn't dizzy. So I started running. And I ran quite a bit. I wound up getting in pretty good shape and I followed that up with getting a pull up bar and eventually joining a gym. And the thought of those things as smoker would have probably if not disgusted me, would have at least confused the fuck out of me. \n\nAfter a while I started to get headaches. So I lowered the nic level in my ecig. And a while later, again I would start to get headaches, so I lowered it again. I weened off of nicotine on accident through vaping, but it wasn't salt nic. Eventually the nic levels were so low, that it was just enough to say it was in there because I had a hard time wrapping my head around not being addicted. I was a smoker for twenty plus years, and it was a part of my identity. That's what made vaping doable, I could still use it as an excuse to step outside and take a break a break. It worked as a fidget toy. And I still had a social shield to hide behind. \n\nThese days, I have an ecig floating around somewhere, it doesn't have any nicotine in it and I don't think I've charged it in a month on two. But sometimes it's nice to have around to use to step outside or hide behind. It's weird last week I was at the bar, it was in my pocket and I didn't even think about using it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "alteredpilot",
            "body": "Not smoking is a decision. Once you make the decision to not smoke, you don't smoke. If you continue to smoke, you didn't make the decision to not smoke. \n\nI was a pack a day smoker. I haven't had a cigarette in 30 years. I quit cold turkey, at that time it was the most miserable week of my life, but it got easier every day to not spend the $3.15 (!) per day on a carcinogenic drug. \n\nI made a decision to not smoke. I don't smoke. \n\nThat's the mindset. I don't smoke. Your mind will believe whatever you tell it. Keep telling it you don't smoke.",
            "score": 2,
            "replies": []
        },
        {
            "author": "lauraz0919",
            "body": "Convince yourself you just finished one.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dinandrekompis",
            "body": "I stopped by replacing that addiction with another one. Coffee. I just went all in on coffee.\n\nAlso I never said I am not allowed to smoke ever again. I couldn't lie to myself. I however promised to never buy cigarettes ever again. I could beg other people for smokes, which meant that the times between cigarettes was long, and became even longer when I had no-one around with smokes. Plus, at some point it gets embarrassing to ask. Aaaand before you know it, smoking makes you feel sick. \n\nI dunno, it was really easy for me. I felt like shit for like 4-5 days, then less so. 🤷",
            "score": 1,
            "replies": []
        },
        {
            "author": "BackgroundOutcome438",
            "body": "MY GP is starting me on bupropion next week, its only available for smoking cessation in the UK but its used for ADHD in the States, I need both",
            "score": 1,
            "replies": []
        },
        {
            "author": "AgreeableTomatillo92",
            "body": "I had to take zyban to quit. It also helped with my anxiety",
            "score": 1,
            "replies": []
        },
        {
            "author": "thatonedudewitt",
            "body": "Whether you think you can, or you think you can't, you're right. \nYou got this",
            "score": 1,
            "replies": []
        },
        {
            "author": "peach1313",
            "body": "The Easy Way to Quit Smoking by Allen Carr has helped a lot of people quit for good. There's an audiobook, if that's more your thing.",
            "score": 1,
            "replies": [
                {
                    "author": "alteredpilot",
                    "body": "I used that method before I knew about the method. Haven't touched a cigarette in 30 years.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Cpnbro",
            "body": "I switched from vapes to zyn. The 3mg one. It’s just enough to sate the craving. \n\nFrom there it’s easier to find yourself in a situation where you can get one or two days off, and quit. Just stay on top of it. \n\nFirst theee days are hell, but once you cart them it gets much easier.",
            "score": 1,
            "replies": []
        },
        {
            "author": "capable_alien",
            "body": "Finish ur last pack of cigs, hide your lighters somewhere you’ll forget and tell your local shop not to let u buy any more xx",
            "score": 1,
            "replies": []
        },
        {
            "author": "trottolinodani",
            "body": "Ask your doctor to prescribe Wellbutrin 🤣 it will help with adhd symptoms and it will make you wanna vomit every time you smoke",
            "score": 1,
            "replies": []
        },
        {
            "author": "Think-Amphibian8200",
            "body": "Wellbutrin definitely helped me quitting, although I’m not so sure if it really helps with ADHD symptoms. Smoking for me was clearly some kind of self medication, it made me feel more calm and focused. I’m so glad I was able to quit in spite of that, I had a few minor relapses, it’s an addiction nonetheless and should be treated as such. I also find apps like smoke free and I am sober quite helpful.",
            "score": 1,
            "replies": []
        }
    ]
}