{
    "title": "ADHD and cuddling",
    "author": "Massive_Ad7335",
    "subreddit": "ADHD",
    "rank": 344,
    "score": 69,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 29,
    "url": "https://www.reddit.com/r/ADHD/comments/1j2cjgz/adhd_and_cuddling/",
    "id": "1j2cjgz",
    "selftext": "So you know how your mind decides to move at 100 miles per second the moment you want to fall asleep, regardless of how exhausted you are? Has anyone else noticed how that brain chatter is silenced when you’re holding someone you love and you’re falling asleep together? I’m single right now, but I was just thinking (as I was trying to fall asleep, but alas here I am) about how when I was in a relationship, sleeping with the girl I loved made me so content that I drifted off to sleep so easily. Nowadays I have to play something like scary stories or trip reports on YouTube, or maybe a podcast to fall asleep. Just was wondering if anyone else experienced that :) ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/Massive_Ad7335 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Popular-Lime7302",
            "body": "No. Do not touch me when I'm falling asleep. I like to cuddle but not when I'm trying to sleep.",
            "score": 56,
            "replies": [
                {
                    "author": "mrjowei",
                    "body": "Yeah, that’s me. I’m a light sleeper.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "froggynojumping",
                    "body": "Even cuddling I have a hard time with😅 I think it’s sensory issues but even with my lap cat I feel awful cause sometimes I just cannot be touched",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Ok_Cartographer_6086",
                    "body": "Yep, no. My wife and I sleep with a pillow between us and I wake up at a pin drop even on Ambien. If I tried to cuddle she'd ask wtf I was doing. \n\nAt least we're compatible :) \n\nThe thing is on a serious note, my brain is wired wrong because when it was forming I slept with my back against a wall and in constant fight or flight mode that my older brother would un-alive me while sleeping. Shared a room with that POS for 10 years...\n\nSo yes, I'm a light sleeper as an adult.  I mean, it's a disorder, no I don't cuddle. :/",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Frosti11icus",
            "body": "Uh fucking completely opposite actually and it’s a problem. There is no situation where I don’t have access to my arms that my mind will not completely panic about.",
            "score": 23,
            "replies": []
        },
        {
            "author": "_GraveWave_",
            "body": "I agree. My mind calms down and I sleep right away. I had a partner a while ago that would sleep on me all night and I would be completely rested. When im single or have partners that sleep apart it’s not the same.",
            "score": 18,
            "replies": []
        },
        {
            "author": "Xenifon",
            "body": "Yeah I’ve noticed that especially when I used to lay on my exes chest and hear her heartbeat it was therapeutic, sent me to sleep within a few minutes.",
            "score": 9,
            "replies": []
        },
        {
            "author": "paprikahoernchen",
            "body": "Most of the times I can't cuddle when actually trying to sleep. \nBut when my boyfriend holds me, my brain just gets quiet, and sometimes I fall asleep. Just because of how comfortable and safe I feel.♡",
            "score": 6,
            "replies": []
        },
        {
            "author": "Kahleniel",
            "body": "Yes, 1000%. It’s one of the only times my mind is quiet.",
            "score": 6,
            "replies": []
        },
        {
            "author": "ThePenOfThoth",
            "body": "Nope stay away from me. I fidget most when I’m tired and it hurts so much I want to pull my limbs off. I feel like I’m on fire",
            "score": 5,
            "replies": []
        },
        {
            "author": "Relevant-Split-186",
            "body": "Same",
            "score": 3,
            "replies": []
        },
        {
            "author": "FearlessCloud01",
            "body": "I haven't paid much attention to the calming down part, but I do like to cuddle with people I like…",
            "score": 3,
            "replies": []
        },
        {
            "author": "DatoVanSmurf",
            "body": "Big nope for me. I mean I' also aroace and autistic, but anyone just in the same room keeps me from sleeping guaranteed",
            "score": 3,
            "replies": []
        },
        {
            "author": "Endurlay",
            "body": "Yes, when I am in physical contact with my partner, or even just speaking with them on the phone, my thoughts become much more cohesive (unless something is *really* bothering me).",
            "score": 2,
            "replies": []
        },
        {
            "author": "Pztch",
            "body": "Not for me.",
            "score": 2,
            "replies": []
        },
        {
            "author": "TheAimlessPatronus",
            "body": "I appreciate that my nesting partner sleeps like a log cuz my legs have amarathon to run and only can do that when I'm falling asleep. \n\n(I listen to podcasts to fall asleep)",
            "score": 2,
            "replies": []
        },
        {
            "author": "Mr_Harsh_Acid",
            "body": "I honestly wish this was me. My partner is very cuddly and it's hard for me to match their enthusiasm for it sometimes. I do enjoy it, but not when trying to sleep. Please don't touch me when I'm trying to drift off.",
            "score": 2,
            "replies": []
        },
        {
            "author": "squirreloo7",
            "body": "YES! I hate being touched by anyone except for my partner. But when he is hugging me all the noise stops and then there is only him.",
            "score": 2,
            "replies": []
        },
        {
            "author": "emollenial_mom",
            "body": "My husband and I cuddled so much when we were dating. After a kid we have to take turns napping, but it does take me a while to fall asleep. I rather not cuddle but it does help me fall asleep faster!",
            "score": 2,
            "replies": [
                {
                    "author": "emollenial_mom",
                    "body": "Try a weighted blanket!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "JustNadine1986",
            "body": "I agree ... spooning with my gf makes us fall asleep faster and we sleep better than when we aren't together (we're pre cohabilitating atm) . When I'm alone I sleep with 2 breast feeding pillows, 1 to spoon and the other for pelvic stabilising just to have the feeling of something touching me.",
            "score": 2,
            "replies": []
        },
        {
            "author": "MrSt4pl3s",
            "body": "Yes and no, but I’m an insomniac and have been since I was little.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Golintaim",
            "body": "Cuddling certain helps me sleep but nothing completely calms my mind. It is easier to sleep but I still have to...make an effort, of that makes sense.",
            "score": 2,
            "replies": [
                {
                    "author": "Massive_Ad7335",
                    "body": "That I completely understand",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Vivid_Prior7371",
            "body": "I have a lot of trouble getting to sleep now that I sleep alone. its a primal thing, you actually have more micro-awakenings in the night if you're on your own bc alone = danger is how we are wired.",
            "score": 1,
            "replies": []
        }
    ]
}