{
    "title": "Any tips to watch long educational videos without getting distracted in between due to an interesting word",
    "author": "AGARAN24",
    "subreddit": "ADHD",
    "rank": 476,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 6,
    "url": "https://www.reddit.com/r/ADHD/comments/1j2dlue/any_tips_to_watch_long_educational_videos_without/",
    "id": "1j2dlue",
    "selftext": "For example, when watching slightly boring stuff and trying to concentrate but in between when I listen to a word that's interesting or thought provoking, my brain starts thinking about that word without my permission, and when I come back i already didn't pay attention to the last 10 seconds. And i rewind back and do the same thing again lol. \n\nHow does it differ from normal people? Can they concentrate on both the memories that pop up and the video at the same time? I feel like i prefer putting my entire focus on one thing rather than multiple, even though I don't have the power to choose on what thing I want to focus on. \n\nIt isn't constant, sometimes i can focus on any boring stuff, but sometimes it's very difficult and tiring and i very easily get distracted by some other memories that pop up related to something I listen to while watching. \n\nDo any of you do something to make it easier to concentrate? I tried taking a 2 min break and trying to empty my mind, it kinda helps, but would like to know if any of you developed a better method. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/AGARAN24 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "sobol2727",
            "body": "Whenever I hit a rabbit hole like that I pause the vid and give my undivided attention into researching the word. If there are other people I talk to, the sidetrack could be longer than the vid but we still lose nothung",
            "score": 1,
            "replies": [
                {
                    "author": "AGARAN24",
                    "body": "What would you do if it's an office meeting? Sadly we can't pause the world right.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "sobol2727",
                            "body": "Oh, ok. Id record the whole thing so I can rewatch it later if necessary",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "AGARAN24",
                                    "body": "Im sorry but if you can't record? I guess you don't have an answer to that as well. Just gotta try harder to concentrate and not get distracted I guess.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "sobol2727",
                                            "body": "Ask the person next to you when you missed something important? Thats what I do during lectures. But yeah, sometimes you just can't find a good solution",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}