{
    "title": "Workplace - meeting with boss left me feeling .. shamed",
    "author": "taylorroseap28",
    "subreddit": "ADHD",
    "rank": 373,
    "score": 8,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 10,
    "url": "https://www.reddit.com/r/ADHD/comments/1j2huqf/workplace_meeting_with_boss_left_me_feeling_shamed/",
    "id": "1j2huqf",
    "selftext": "As the title says and just needed to vent to a community that understands… just been in a meeting with my boss who said why can’t you just use a pen and write. Everyone knows I have it. I said I needed the laptop; got told it’s distracting for him, I don’t listen, miss things and don’t make eye contact because I’m typing. I said I am listening I am trying to get all the info down because I won’t be able to remember it or the detail of the task set. Sighing at the fact I don’t use pen and paper. I then tried in that meeting but left it without retaining any information and feeling myself stuck on the task set. I felt lost. Got pulled into a second meeting them trying to do damage control. \n",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/taylorroseap28 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Creatve1",
            "body": "For what it’s worth, I’ve found I’ve gotten a much more empathetic response to framing it as having an auditory processing disorder versus saying it’s ADHD (though everyone knows have ADHD and I know the first is a symptom of the other). \n\nIt would be great if they could accommodate you, but if they’re dug in, would it be possible to record the meetings on your phone? Automatic Transcription functions have gotten really good lately so you could likely leave the meetings with a decent AI-generated script of everything that was said.",
            "score": 6,
            "replies": [
                {
                    "author": "taylorroseap28",
                    "body": "This is really helpful thank you so much",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Bird-Toast",
            "body": "I give a hug. \n\nI'm sorry you are around people that dont want to understand adhd is hard.",
            "score": 3,
            "replies": [
                {
                    "author": "taylorroseap28",
                    "body": "Thank you so much",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Bird-Toast",
                            "body": "All my hugs dude",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ElleEh",
            "body": "Can you tell us more about the second meeting?",
            "score": 3,
            "replies": [
                {
                    "author": "taylorroseap28",
                    "body": "Yeah sure: he said I hadn’t told him directly about ADHD but I have and in group settings and in the open office in general when colleagues pass my desk as the more junior colleagues find it interesting. He then said a few things trying to smooth over the situation but i think from a HR point of view. Gutting really as I often believe it can be a positive thing as I am able to zone into my ‘bubble’ as I call it in the office when I am interested in the task and not move for 3 hours. You know how it is!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Livvin1111",
            "body": "Completely RELATE to your entire post! I literally can’t hold down a job because I can’t retain or learn new things. I tried one to paper…can’t write fast enough and eventually don’t remember what I’m doing. \nGot in trouble several times for trying to document things on my phone or for using audio recorder and or laptop to help me remember. It feels depressing. People just treat you like you are an idiot…and I feel like one too. :(",
            "score": 2,
            "replies": [
                {
                    "author": "taylorroseap28",
                    "body": "This! I tried in the first meeting then using a pen and paper but I couldn’t even read what I had put because I’m too focused listening trying to get as much info down as possible :(. They do. It’s as though they think we just cannot be bothered when really we are trying double time to get information and retain it in the way we know is best for us as an individual",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}