{
    "title": "do you ever want to think but can't?",
    "author": "Extra_Wolverine_810",
    "subreddit": "ADHD",
    "rank": 311,
    "score": 27,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 10,
    "url": "https://www.reddit.com/r/ADHD/comments/1j2o3a5/do_you_ever_want_to_think_but_cant/",
    "id": "1j2o3a5",
    "selftext": "Like you have a problem, you want to think about it but you just can't. it's like its in the back of the brain behind a wall of fuzz and its too much effort to deal with so you just give up\n\nalmost like a tab on google - its there, you can see it, but u have to click it to access it.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/Extra_Wolverine_810 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "davisriordan",
            "body": "Yeah, sounds like brain fog, take vitamins",
            "score": 3,
            "replies": [
                {
                    "author": "i-read-it-again",
                    "body": "What vitamins?",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "bookshelved1",
            "body": "Is trying to think about it also making you feel some way? Anxious, nervous, overwhelmed, scared? It could be brain fog but also your nervous system could be trying to \"protect\" you from the topics that it knows will make you feel \"bad\" - it's not an intelligent system (in the way our rational mind is) so it can't tell the difference between you being afraid of a bear chasing you and you having to do your taxes or submit that job application and so on.\n\nI find what helps is taking out a large blank piece of paper (not a notebook - I don't want to feel like I'm \"ruining\" my planner or like I should be tidy and organized with it) and starting to journal, in a very free way - I'll be throwing this paper away afterwards anyway. So it goes something like, let's say:\n\n\"I can't even start to think about this\n\n꩜ .ᐟ         ᥫ᭡\n\nFfffff\n\nI just feel so out of it\nI HATE logging into that stupid website \nI don't even have my password anymore\n\n(...) \n\nReset password? \nCheck Dropbox for copies of those old docs\" \n\nIt's actually hard to just make something up lol! Just whatever comes out, stream of consciousness, doesn't have to be 'good' or 'useful'. And while I write like this I start writing down parts of what I need to do, reasons why I feel afraid to do it, why I can't do it, and eventually it ends in some kind of down-to-earth to do list or conclusion and I feel better. \n\nSorry if this does not apply or I didn't explain it well! Maybe this is not what you meant at all... Just wanted to share this as I've started doing it relatively recently and I'm pleased it's been working for me consistently.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Interesting_Topic270",
            "body": "Every. Single. Day.",
            "score": 2,
            "replies": []
        },
        {
            "author": "After-Ad-3610",
            "body": "Very often!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "MentallyillFroggy",
            "body": "Constantly",
            "score": 1,
            "replies": []
        },
        {
            "author": "asdfsloth",
            "body": "Like a tab on chrome that won't fully load so you carry on with whatever online shenanigans you were already up to lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "CaptainLammers",
            "body": "That is my life mostly.\n\nFor the bigger problems, I found that a solution only ever presented itself when I wasn’t looking, and that realization came late in life (30 ish).  \n\nIf I want to think about my life problems I need to deliberately get lost in something else. That is the most PITA way to solve anything.\n\nBut the whole “shower principle” does work for me.",
            "score": 1,
            "replies": []
        }
    ]
}