{
    "title": "Strattera (apo-atomoxetin) stopped working?",
    "author": "subj_impft",
    "subreddit": "ADHD",
    "rank": 363,
    "score": 3,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.reddit.com/r/ADHD/comments/1j2ruuu/strattera_apoatomoxetin_stopped_working/",
    "id": "1j2ruuu",
    "selftext": "43M Diagnosed 9 months ago, ADD and high potential..\n\nStarted gradually using vyvansse last summer but stopped after reaching 40mg (so around 4 weeks), as the side effects were unbearable.\n\nOn Strattera for more than six months now; my neuropsychologist recommended a non-stimulating molecule. Side effects not so bad; beneficial effects limited, but perceptible. Really felt it while doing renovations (I stopped constantly looking for my hammer and whenever something unexpected happened, I could stay focused on finding a solution rather than just walking around the house), a little less so during my bureaucratic job, but still, an improvement.\n\nBut for the last weeks I'm suffering from the old usual glitches:\n\n\\- spent hours shopping online for a keyboard with an integrated pointing device while I have a working solution (I like trackpoints Thinkpad keyboards, but the seperate keyboard Lenovo sells comes with a flimsy mini-usb connexion that breaks too easily, the vintage one with a permanent connexion doesn't allow me to scroll, now waiting for vintage mechanical keyboard with a trackball from ebay)\n\n\\- \"stored\" a fresh cabbage in the freezer instead of the fridge (found it after looking in my car, in my bedroom, in the garbage, doubting that I had even carried it home and left it at work)\n\n\\- forgot after thirty seconds that I was waiting for a slice of bread to toast in the toaster for breakfast, just sitting idle beside my girlfriend who went to pick it up after a few minute\n\n\\- as I write this I am troubleshooting the pressure of my heating system (it's not cold, but one radiator doesn't heat), and putting a single plate in the dishwasher and forgetting to close the door\n\n\\- obviously forget tasks/meetigs at work\n\nReading here I see people describing miraculous effects for their medication. Should strattera help me more? And can it just stop working? I'm starting even to wonder wether I was prescribed a placebo...",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lopsided_Message_529",
            "body": "I feel like this is what is happening to me, I used to think my Straterra was helping but lately, not so much.",
            "score": 1,
            "replies": [
                {
                    "author": "subj_impft",
                    "body": "I constantly remind myself that the effects were initially subtle, and that maybe I just got used to it, but I really feel like I lost control over my train of thought…",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Lopsided_Message_529",
                            "body": "It’s my focus and train of thought. On a good day it’s 6-7/10.. it was 8-9/10 clearly..",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}