{
    "title": "Finally medicated, is what im feeling wrong?",
    "author": "Fire_Fist-Ace",
    "subreddit": "ADHD",
    "rank": 377,
    "score": 2,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/ADHD/comments/1j2r9h2/finally_medicated_is_what_im_feeling_wrong/",
    "id": "1j2r9h2",
    "selftext": "Title basically\n\n31 finally diagnose and medicated \n\nI always over analyze, I like my meds I get things done im more focused more than anything I feel like I have one train of thought rather than 10 , but its changed my priorities a bit , and I can see myself becoming dependent on the meds, which if I need Im fine with I guess but I guess I am feeling some doubt or concern.\n\nDid anyone else have similar feelings when starting?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Thricewiser",
            "body": "Anything that was a process became a priority, and anything creative became more and more difficult to move to the top of the list. It’s one of the reasons I stopped taking meds. Not saying you should do that, but perhaps look to speak to your doctor and build in breaks.",
            "score": 1,
            "replies": []
        }
    ]
}