{
    "title": "Are there any Lawyers here with ADHD?",
    "author": "Positive_Candy_5332",
    "subreddit": "ADHD",
    "rank": 362,
    "score": 3,
    "upvote_ratio": 0.8,
    "num_comments (reported by reddit)": 11,
    "url": "https://www.reddit.com/r/ADHD/comments/1j2s107/are_there_any_lawyers_here_with_adhd/",
    "id": "1j2s107",
    "selftext": "I’m considering law school, environmental law specifically. It is something I’m very interested in. Ive always been passionate about environmental justice and I’m also very interested in politics and social happenings that affect the working class population. I have a Bsc in environmental science and work in the field (3 years into working in my field). anyway i have ADHD not medicated (still looking into this) but i want to know if its a field i can thrive in. \n\nI’m curious if anyone here has adhd (diagnosed as adult) who pursued law. I want to know how it’s going for you? Do you enjoy it? Do you regret it? What are the best parts of the job for you and the worst? What kinds of skills natural and learned should you have to go into this field? How has ADHD affected your work (do you feel like it affects you in any way or does it have limitations or is it a great field for someone with ADHD who is passionate about it? Just looking for general words of wisdom! \n\nThanks! ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/Positive_Candy_5332 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "aFoolishFox",
            "body": "I am a lawyer. I have a theory that adhd (often undiagnosed) is actually slightly over-represented among lawyers compared to the general population. \nBut specifically, I think law is a good fit for the kind of adhd people who do well in school while the rest of life falls apart around that. I loved law school, and I enjoy enough of my practice to feel I made the right choice, although there are plenty of areas that I struggle with too.",
            "score": 6,
            "replies": [
                {
                    "author": "WinterDice",
                    "body": "Your theory is accurate. I forget the statistic, but it is well above the average. \n\n(Edited to separate my reply for you and for OP.)",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "NuthinToHoldBack",
            "body": "Not a lawyer, come from family of attorneys, entertained the idea but ultimately went a different route.  \n\nI’m all about hedging my bets. I know myself and how my mind works. Passion is key. When entertaining the idea I focused on the areas of law that 1) were most interesting and by extension stimulating or 2) would allow me to work in industries I was passionate about (example contracts for professional athletes).\n\nAs for why I went a different route, my father’s opinion was that being paid by the hour is a blessing and a curse. Don’t know why that stuck but it did.",
            "score": 2,
            "replies": []
        },
        {
            "author": "P0Rt1ng4Duty",
            "body": "Three of my favorite licensed attorneys have *raging* cases of adhd. Two of them are currently practicing and one is kind of back-burnering it, but I know them through their YouTube channels.\n\nIan Runkle, @Runkle of the Bailey, is a full-time criminal defense attorney.\n\nRob Moreton, @Law and Lumber, is a full-time family lawyer.\n\nEmily Baker, @The Emily D Baker, was an assistant district attorney in LA for at least a dozen years. Her ADHD stories are probably the best, including the time a judge scorned her because ''Mrs. Baker, your face!''\n\nShe went from an environment where it was completely unprofessional to show any emotion to one where she can dye her hair weird colors and swear a lot. It suits her.",
            "score": 2,
            "replies": []
        },
        {
            "author": "helensgrandaughter",
            "body": "I’ve been a criminal defense attorney for 21 years. I have untreated ADHD, though I was diagnosed at 8 with what they then called “ADD.” My parents didn’t believe in medication, told me about the gifted “diagnosis,” but not about the ADD—I learned that all much later. Now I’m 55 and in the midst of taking several steps to get medication.\n\nI started my career at the Public Defender’s office and found that I sort of shined in the crazy, out-of-control dockets in misdemeanor court (then felony) because it was chaos and I felt right at home going from client to client. And being reactionary in court is a gift really (as long as you’re right, of course). I was always completely drained of all energy by the end of the week, but I loved everything about litigation—from the hearings to the jury trials—once I was in the courtroom. Plus, we were all overloaded with work. If I screwed up a court appearance once in a while, I usually had a coworker to cover for me, or at least call me and tell me to get my but to court before the judge even noticed. I always had backup.\n\nBut my office days and the days a leading up to trials were agony. We didn’t have office assistants to assist with most of our administrative tasks, so my calendar, keeping deadlines, client contact, and all research and drafting of motions and getting them filed was on me. I loved the work, but had to take so much extra time on weekends to work on stuff I should have been able to finish during the week, (plus my personal life was a dumpster fire), so after 8 years I went into private practice and was able to hire a paralegal and an assistant who took over everything from reminding me about my deadlines, checking my calendar with the courts so that I didn’t miss any appearances, handling &\\^%$#$ electronic files that are supposed to open, but do not &\\^%$% open, and a laundry list of other stuff I no longer had to worry about and it was really a game changer.\n\nBut I still really struggle/d with focus. Writing motions and trial prep are tooth-pulling events in my life and after a few decades of going into hyper-focus mode for every hearing and trial started to wear me down. I’m doing some very limited post-conviction work for my state, now, and can see how \\[edited because I literally just stopped this sentence at “how”\\] my inattention made me freeze with overwhelm so often during those years. Even though I am still struggling, it’s easier because my caseload is small and I now have great assistants.\n\nI am currently trying to use some of the aids my therapist suggested—using a timer to give myself breaks during my tasks, making sure to make a list for the next day of stuff I need to focus on (for when I fall down that rabbit hole of legal research, mostly…), but it’s been slow going.  Maybe if I had started at your age I would have developed better habits/skills/magic to overcome my constantly darting mind, but I do wish I had the knowledge now that I did when I was younger. I would absolutely have chosen trying medication.\n\nIt’s been hard-going, but I don’t regret the path. I have helped many people and done some good in the world, and still can, so that’s pretty cool. The reading and writing (which is 99% of post-conviction) is still challenging, though. Fingers crossed that meds help me sort that out.",
            "score": 2,
            "replies": []
        },
        {
            "author": "biscuitboi967",
            "body": "Me. Wasn’t diagnosed til last year. I’ll be a lawyer 20 years in August. :)\n\nI had no idea. Just thought I was “legally blonde”\n Like, school was easy, real life was hard. \n\nLitigation was something I stumbled onto because I wanted to do contracts and M&A and IPO and that just wasn’t possible in the post tech bubble burst world. \n\nAnd litigation worked for me. Everything had a deadline that was looming. An admin took care of my organization. A calendaring clerk took care of my court dates. I was encouraged to work long hours and go down rabbit holes for obscure case law. \n\nThere were stereotypes of people that you had to corral and lock in a room and they would turn out brilliant motions. That was me. \n\nBut my work life balance and the state of my house and my bills and whatnot were never in order. My mental health suffered. I also wasn’t diagnosed and when I did get treatment it was for the wrong problem or only part of the problem. \n\nI went, big law too, which meant they worked me hard and I played hard and my impulsivity was a little out of control at times. But I did well and I made a lot of money for the 5 years I toughed it out. \n\nI ended up going to the government and then in house. Much more manageable. And also, I wasn’t diagnosed or medicated for like the first 18 1/2 years of my career. So, totally doable. \n\nBut I wouldn’t recommend something tedious and detail oriented like contract writing. I suuuuck at that. Hate it. Glad I couldn’t get into it when I graduated. Like the *rules* of it. And I like writing. But I don’t do well at remembering what I wrote *specifically* 50 pages ago. Or if I used a little i or an italicized a with a ). Or if we are using , or ;  And missing a “not” or a comma is *devastating* when they find it out 3 years later.",
            "score": 3,
            "replies": []
        },
        {
            "author": "OldWispyTree",
            "body": "IDK if my dad (an attorney) had ADHD, but he sure seemed to at some points, and I got it somehow.\n\nHe survived because he stayed at the same firm and had the same sweet, loyal, helpful secretary for like 40 years.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WinterDice",
            "body": "I’ve been practicing for almost 20 years. I found out about my ADHD just a few years ago. I did well in law school because it was an endless emergency pile of stress. I had the same experience in my first 12-ish years of practice. I enjoyed learning things and the challenge. \n\nThen the cumulative stress caught up with me. \n\nI hate the job now.\n\nI still like meeting people and hearing their stories. I don’t like the pressure to bill every second of my day. I don’t like juggling all of the deadlines, details, and competing tasks and priorities. I hate the needless conflict and egos. I do transactional contract drafting and other things like that and I find it painfully boring. I won’t do litigation because of the stress and the ridiculous posturing and conflict.\n\nIf you do go to law school, focus on minimizing your debt as much as possible so you don’t get trapped.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Silver-Sparkling",
            "body": "Hi, I’m a contracts lawyer/solicitor in England and combined type adhd. Wanted to be a solicitor from being a kid. School was fine, college and university were rough!!! I didn’t realise I had adhd till I was in my 30s and already qualified. \n\nI work in local government practice, rather than private practice, it suits me much better as it’s a lot less business driven and more need driven. \n\nI actually always wanted to do family law to help kids have a better life. Did a few years in child protection and then adult court of protection. It was super interesting but very emotionally draining. Be careful if you’re very passionate about your chosen area that it’s not one which will burn you out. \n\nI can really struggle in the day-to-day, but I think my adhd helps me to be a good lawyer. I’m also helped by having a good employer that has helpful structures and processes. I haven’t disclosed my adhd but I’m able to set things up to how I need them and that makes a huge difference. \n\nOverall, I’d say that it’s very possible to thrive with adhd in law! Definitely try to get some work experience or shadowing to see if you like it and could see yourself doing it, or see if you could go to court to watch if you’re likely to go down the litigation route. Good luck! ",
            "score": 1,
            "replies": []
        }
    ]
}