{
    "title": "Diagnosis without childhood symptoms",
    "author": "distant-transcend-99",
    "subreddit": "ADHD",
    "rank": 345,
    "score": 3,
    "upvote_ratio": 0.81,
    "num_comments (reported by reddit)": 13,
    "url": "https://www.reddit.com/r/ADHD/comments/1j2u6yb/diagnosis_without_childhood_symptoms/",
    "id": "1j2u6yb",
    "selftext": "Hello! 25m Seeking advice/other people's experiences with getting diagnosed and not having childhood symptoms or someone to fill out the childhood forms. Essentially my parents don't think I have ADHD so would be unwilling to fill out the required forms about childhood issues and secondly I remember performing quite well in primary school so the reports/teachers comments are unlikely to support a diagnosis. Anyhow I match pretty much all the symptoms, dealt with depression/anxiety for years and test highly on self assessment tests but is that enough? I understand adult onset ADHD/the symptoms becoming more prevalent in adulthood is a thing but I'm just getting quite anxious about booking the assessment due to the cost and then getting a \"non diagnosis due to lack of childhood info\". So yeah essentially wondering if anyone has gotten diagnosed without childhood info or with childhood info that contradicts ADHD (at least on the surface). Thanks in advance ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/distant-transcend-99 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "unafragger",
            "body": "I don't really agree with Plenty. I didn't need any kind of documentation or whatever, and I was diagnosed in my early 30s.\n\nGranted, I had plenty of symptoms back in school, I just didn't know what they were at the time. I always just thought I was lazy.\n\nWhich, granted, is not entirely untrue.",
            "score": 3,
            "replies": [
                {
                    "author": "distant-transcend-99",
                    "body": "ok that's promising re not needing the childhood docs. I've had a lot of issues with being labeled as \"lazy\" and \"bright kid but not applying himself\" etc...",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Plenty-Mulberry142",
                    "body": "Yeah, I didn't have any documentation, or support of my parents either. I'm not trying to discourage from getting diagnosis at all, and I had an old friend fill out my supporting forms. It's more that, it probably has always been there, and masking is a thing too. It's just worth thinking back. And admittedly, I haven't heard of adult onset ADHD before.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "unafragger",
                            "body": "That's fair. I definitely had the symptoms in childhood, just no documentation or anything",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AltruisticLobster315",
            "body": "I was diagnosed at 27, and I didn't have to do any of the \"get family or friends to comment on it\" kind of thing, the questionnaire part and the psychologist did ask me questions about it in childhood and such but I didn't have much information/proof on that aspect, besides talking about my experiences and how poorly I did in most aspects of school. Thankfully that was enough.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Thadrea",
            "body": "The DSM-5-TR and ICD-11 criteria for ADHD *do* indicate that childhood symptoms are a requirement for diagnosis. So properly speaking, if the diagnostician is following the criteria to the letter, they cannot diagnose ADHD if there were no childhood symptoms. Period.\n\nHaving said that, there's a couple different nuances that are important:\n\n1. There are significant, scientifically justified criticisms to requiring childhood onset in the first place. There has never been empirical basis for requiring onset before age 12 (or for that matter, age 7).\n   * While it does appear that ADHD usually onsets during childhood, we don't actually *know* if there's a specific age threshold where it becomes impossible for ADHD to initiate in an individual.\n   * The age 7 element the diagnosis criteria that was introduced as part of the ADD and ADD/H criteria in the DSM-III was selected because it was the typical age children were being referred for evaluation. A proposal was made to eliminate it in the DSM-5, but the committee wasn't willing to go quite that far, and ultimately the current age criterion of 12 was the compromise.\n   * Research over the last decade has repeatedly demonstrated that a persistent psychopathology that would otherwise be called ADHD *can* onset later than age 12, possibly even into early adulthood in rare circumstances.\n   * Clinicians who routinely deal with ADHD diagnosis and treatment are often aware of the historical complexity and politics within the APA about this. Some will demand evidence of childhood symptoms before giving an ADHD diagnosis (ICD-10 F90) at all. Others will not bother with trying to check into whether childhood symptoms were present at all. Some will alternatively diagnose with F90.8 or F90.9 if childhood symptoms cannot be proven but all other details fit. You have no way of knowing which of these will apply to *your* evaluation until after it has been completed.\n2. Even among those who believe childhood onset is important, many recognize that withholding diagnosis if the adult patient is unable to prove it is typically harmful.\n   * When the patient is an adult, the parents are often unhelpful because had they been invested in the patient's mental health, the patient probably would already be in treatment. Adult diagnoses are a miscarriage of medicine, a failure of the parents and the child's clinicians and other supports to appropriately observe and treat ADHD. These individuals are often not any more helpful years later than they were when the patient was a child.\n   * The patient's parents may simply not be available--divorces, death, disowning, etc., happen and it's silly to insist that the patient get a deceased mother to agree that they have ADHD symptoms for the clinician to diagnose them.\n   * Even when the patient's support system *is* cooperative, they may simply not remember events from decades earlier very well. Cooperative patients and their families are usually off by an average of *4 years* when asked about when symptoms began, based on longitudinal studies.\n\nSo with all of these factors in mind... If you think you may have ADHD based on what you have learned, your inability to recall childhood symptoms may complicate you getting diagnosed, but it doesn't rule it out. I would be open and honest about the facts with your clinician, and let them draw whatever conclusions they draw. If they diagnose you with something else, listen to them seriously and see if it makes sense. If they seem wildly off with their diagnosis, you can always seek a second opinion.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ActiveFlaky1630",
            "body": "I posted about this last week, and had a really great comment. I was a straight A student through high school and college, never had any symptoms except for emotional outbursts. I didn’t even see symptoms until graduating college, so always thought that I didn’t have ADHD because I never showed symptoms and wasn’t really a “daydreamer”. \n\nA user commented saying that they had a similar experience, and they thought it was because their life had always been structured. I think this was the reason for me, I enjoyed learning and therefore wasn’t ever distracted because it was something I enjoyed. There is opportunities to allow your mind to reset during school hours such as changing classes, going to the bathroom, etc. When I went home, my life was very structured, and I wasn’t really allowed any time to notice heavy symptoms even if I had them. After graduating college and beginning my adult life, I started noticing symptoms when I was alone and allowed the time to make (or not) my own decisions with the time I was allotted. My life as a kid was always pretty organized, because my parents didn’t allow it to be disorganized, they made sure I was always on top of stuff, kept me on a strict schedule. I struggle now doing this on my own, which is why I believe I eventually showed symptoms that I didn’t recognize early, plus the stress of adult life and factors I didn’t have before as a kid (job, family, relationships, etc.). Hope this helps!",
            "score": 2,
            "replies": []
        },
        {
            "author": "MentallyillFroggy",
            "body": "Idk how helpful this is for you since it’s not exactly your situation but I’m just gonna put it here just in case, sorry for the super long wall of text but idk how to put it any shorter or how much of this is relevant to your situation \n\nMy psychiatrist brought up me having adhd by herself after knowing me for like 10 minutes lol (17 at the time but was like a week before turning 18, i never suspected it before) I had a majorly traumatic childhood even as a toddler and have barely any childhood memories so we couldn’t actually determine my childhood symptoms because chance was it was just the trauma mimicking ADHD symptoms, I always did decently well in school despite not paying attention or studying, usually just spend all schoolday daydreaming but passed regardless\n\nShe made me do a questionnaire and I managed to get my parents to do one as well, tho their answers were seemingly random and super different than anything I told her, I told her that we barely interact with each other and that they told me they can’t remember what I was like as a child so just did it for „recenty“ , so she basically fully disregarded their questionnaire, mine was highly indicating ADHD but since it was so contradictory to the one my parents did it was basically useless \n\nI didn’t really have any relevant school reports but I found 2 teacher questionnaires from second/first grade, one indicated I had moderate issues with attention/organization etc. The other agreed with some of it while also contradicting a lot of it and because of the childhood trauma it was basically useless as well, so she disregarded those as well\n\nWe talked about what symptoms ADHD has and I just told her whatever came to mind for each symptom she listed  (like in what ways I related) and it overlapped a lot\n\nWhat made her think that ADHD was very likely when talking about the symptoms was that I told her (this exact example) I always get distracted constantly, like I go to the kitchen to do the dishes and see something and have to do it right then, then after that I go back to the kitchen to do the dishes and see the next thing, do that and then forget that I wanted to do the dishes until I walk by them again a couple hours later. \n\nThe dead give away was when I told her about how I did Sp33d for like a month straight and it made me feel „normal and functioning“ (which I thought was just the energy boost helping my depression) and described to her in great detail how it affected me and how I was able to concentrate better and she said I reacted very ADHD typically which was another big indicator (and mind opening to realize I was self medicating ADHD without even realizing lol) I told her how it made me able to properly focus on one thing at a time instead of always having a thousand things I feel like I have to do at once and her words were „wow we’ve definitely got our diagnosis“ \n\nHave an appointment with her to get on meds and while she isn’t 100% sure it’s ADHD she says it’s very likely and getting on meds it’s probably my best option to find out by just seeing if they’ll work or not, I read a lot of info about ADHD and it made me realize SO many things and issues that I never connected to ADHD in the slightest could actually stem from it and It’s absolutely mindblowing. I think it depends A LOT on your individual symptoms/indicators and a lot on how good you can connect to the psychiatrist, Personally, I would absolutely do the assessment and good luck and hope you can figure things out 🍀",
            "score": 1,
            "replies": []
        },
        {
            "author": "Plenty-Mulberry142",
            "body": "If you didn't have symptoms in childhood, then that's not ADHD, but something else. Have a think back though. It's not always picked up by parents or teachers, especially if you would be classed as primarily inattentive. I had lots of childhood symptoms and I'm combined type, but it wasn't picked up by anyone, other than comments that I wasn't achieving my potential. Lots of issues can be missed by parents and teachers.",
            "score": 0,
            "replies": [
                {
                    "author": "distant-transcend-99",
                    "body": "sure I get you. I definitely had struggles back then with motivation, staying focused on class and so forth it's progressively got worse as I was given more responsibility with self directed schoolwork like homework, and moving into self directed study at university and attempting to \"adult\"",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Thadrea",
                    "body": "While it's true that parents and teachers can easily miss ADHD,\n\n>If you didn't have symptoms in childhood, then that's not ADHD, but something else.\n\nis going a bit further than what science would support at the current time.",
                    "score": 0,
                    "replies": []
                }
            ]
        }
    ]
}