{
    "title": "Sleep aid recommendations",
    "author": "Mikecoast2",
    "subreddit": "ADHD",
    "rank": 389,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 6,
    "url": "https://www.reddit.com/r/ADHD/comments/1j2uk2y/sleep_aid_recommendations/",
    "id": "1j2uk2y",
    "selftext": "Got diagnosed late in life @ 61. I take 20 mg of Adderall first thing in the morning. I’ve been medicated for about a week. The meds have helped quite the noise in my head. I’ve had sleep issues on & off for years. I have no problems falling asleep. Staying asleep has been an issue.\n\nLooking for recommendations!",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "ImOlddGregggg",
            "body": "I’ve slept like dog crap my entire life, always had problems. I’m on 30MG of adderall and make sure I don’t take it past 9am. I take 100-150MG of trazodone every night, it’s actually really helped, it doesn’t keep me asleep but really helps me fall asleep I’ve noticed a huge difference. Ask your doctor about it, try with 50mg for a few days then go up if need, it’s non addictive they say (even though my ADHD makes me addictive to everything) and they might say it’s an antidepressant but it’s used for sleep for people.\n\nAlso stay away from electronics and stretch before sleeping and exercise helps too",
            "score": 2,
            "replies": []
        },
        {
            "author": "unafragger",
            "body": "I find that the come-down from adderall is the worst part for me. I also take 20mg and have just recently started taking a lower dose in the afternoon (5-10mg) to sort of ease that come-down. \n\nThat seems to be what makes me jittery and unable to sleep / stay asleep. Honestly, I can pop a 20mg adderall and sleep like a baby an hour later. It's great to have a calm mind. I take more naps now. :D",
            "score": 1,
            "replies": []
        },
        {
            "author": "ActiveFlaky1630",
            "body": "I’ve had this same issue where falling asleep or staying asleep is roll of the dice every night. Someone suggested taking magnesium, and I’ve taken it every night for a few days, and it seems to work pretty well for me.",
            "score": 1,
            "replies": [
                {
                    "author": "Mikecoast2",
                    "body": "Thanks for the suggestion. How many milligrams of magnesium are you taking? I’m assuming you take it before bed?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ActiveFlaky1630",
                            "body": "I take 200mg Magnesium, I got the high absorption one with sleep support just from Walmart. I take it about an hour and a half before bedtime.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}