{
    "title": "My brain makes me feel dumb during disagreements/arguments.",
    "author": "ArtisticStudios",
    "subreddit": "ADHD",
    "rank": 275,
    "score": 18,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 6,
    "url": "https://www.reddit.com/r/ADHD/comments/1j2zgsn/my_brain_makes_me_feel_dumb_during/",
    "id": "1j2zgsn",
    "selftext": "The argument doesn't even have to be something that deep, yk? But sometimes with my friend I start spewing out things that don't connect outloud like they do in my brain. And because I can't get them to understand, it makes me feel dumb and inferior.   \nLike I genuinely had some good points to make but, not being able to properly turn them into words/text is so discouraging...\n\nDoes anyone else feel this way? And how to explain yourself without making it sound like your making excuses? Because sometimes I'll say \"Ah my brain kept jumping around\" but it genuinely just sounds like I'm making excuses for having a weak argument :')",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/ArtisticStudios and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Serazene",
            "body": "My train of thought derails sometimes mid-sentence and then I forget specifically what the other person said that I was responding to, which is super embarrassing. ",
            "score": 8,
            "replies": [
                {
                    "author": "ArtisticStudios",
                    "body": "Right... It's so embarassing haha  \nSometimes I feel like I'm being lectured in an argument though because I can't figure out what to say ugh",
                    "score": 4,
                    "replies": [
                        {
                            "author": "innerfear",
                            "body": "You're not alone see [L'esprit de l'escalier](https://en.m.wikipedia.org/wiki/L'esprit_de_l'escalier) your probably going to finally know it's name. I usually figure out how I need to say it afterwards.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "jackieinertia",
                    "body": "All the time",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Deedaleen",
            "body": "I explain that to my bf all the time when we have an argument, but I don't feel dumb.\n\nUsually, sadly, it's the other way around, like I feel like others don't understand me, while what I'm saying makes sense for me :p so yeah sometimes that doesn't help the argument \\^\\^\"",
            "score": 2,
            "replies": []
        }
    ]
}