{
    "title": "Working through my Adhd.",
    "author": "Ok_Joke_3774",
    "subreddit": "ADHD",
    "rank": 314,
    "score": 3,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/ADHD/comments/1j336rp/working_through_my_adhd/",
    "id": "1j336rp",
    "selftext": "Putting this out there maybe people can relate and help me answer some questions.\n\nI’m 18. I have struggled w focus my whole life I have an adhd diagnosis. I was on meds for a bit but got off them because they would make me depressed for no reason. Throughout highschool and middle school teachers knew I had adhd but decided to treat me like I had special needs so whatever list I was on I told my mom to take me off. I relied pretty much solely on shortcutting my way through school, and I had no problem cruising through life like that. But recently i have realized how much of an effect my adhd and my choices because of it have played a role in my development as a person.\n\nAnd by any means is my life bad lol and I honestly hate blaming things on adhd but I have come to realize how real it is. I work for myself and I tend to take wayyy to long to do things that I can get done in an hour. Often times I forgot things I was just told, or was told recently, I struggle articulating myself, and my brain is so jumpy I didnt even realize it. I honestly just realized how much just not reading that paragraph or finishing that video has caused me to fall short in multiple different ways. \n\nAgain I hate blaming things on adhd and didnt realize how much of a role it has played in my life but how do I deal with this? \n\nI know it’s possible to work through it, i’m not gonna sit here and feel sorry for myself. \n\nAnybody have any tips and tricks to deal with any of problems I listed? (I don’t care if they are tips that I can apply daily or things I have to work on daily to achieve results in years)\n\nJust whatever helps and I hope someone can relate and feel seen from this. \n\n",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/Ok_Joke_3774 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "jimmyjlf",
            "body": "You are 18, you got your whole life ahead of you to figure out what you like to do and how you fit into society. If you can get through school by winging it, you can get through life by winging it. Just don't commit crimes. As stupid as it sounds my best advice is to forgive and accept yourself. Your \"ideal person\" is not you. You will find something to channel your energy into eventually\n\nI can't tell you how to develop organizational habits but for me I went on Vyvanse for a year and started carrying around a notepad at work and writing down everything. Now I'm off Vyvanse and I still have the notepad.",
            "score": 1,
            "replies": []
        }
    ]
}