{
    "title": "What do you do in your free time?",
    "author": "Electrical_Natural35",
    "subreddit": "ADHD",
    "rank": 215,
    "score": 23,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 47,
    "url": "https://www.reddit.com/r/ADHD/comments/1j35z2w/what_do_you_do_in_your_free_time/",
    "id": "1j35z2w",
    "selftext": "I feel like any moment that I have free I just sit on my phone. Lately, even that has become overwhelming but I don't have the energy to get up and do anything else, or even just read a book. What do you do in your free time? Is there anything fun I can do that doesn't take too much energy but isn't just doom-scrolling til I go to bed?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/Electrical_Natural35 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "sakikome",
            "body": "Video games and audio books are my go to. I still feel bad about those because of shame around not being \"productive\" and \"useful\" but it beats scrolling my phone for hours",
            "score": 20,
            "replies": [
                {
                    "author": "Senhor_Alfredo",
                    "body": "what type of books do you listen? I experimented with self-growth audiobooks but I retain about 5% of the info.  \nI found a good technique which is listening and reading at the same time. It's faster",
                    "score": 2,
                    "replies": [
                        {
                            "author": "sakikome",
                            "body": "Novels, mostly. Non-fiction doesn't work for me either.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Ancient-Ask-5072",
                    "body": "Can u name the games u play and for how long cause if I play it continues to over 1hr",
                    "score": 1,
                    "replies": [
                        {
                            "author": "sakikome",
                            "body": "Hades and Hades 2 worked well for me, because one run is like 15 - 40 minutes in real time (ymmv). Although I would sometimes get drawn into it and want to try another run, and another...\n\nAlso farming sims, like Stardew Valley. I would do one to a few days, and stop when my character goes to sleep. \n\nI think everything that has clear in-game breaks like short levels could work?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Akmal20007",
                                    "body": "Dead cells is good to go",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "th4d89",
                            "body": "Roguelites are godsend for adhd, try balatro,  slay the spire, binding of Isaac, dead cells,  risk of rain 2. Even something like rocket league",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Twngy",
                    "body": "Same but instead of audio books i read web/ light novels",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Senhor_Alfredo",
            "body": "Adding things to my endless to do list",
            "score": 5,
            "replies": []
        },
        {
            "author": "Pick_Unlimited",
            "body": "Playing guitar has been a relief of anxiety for me. Although playing instruments is easier and require less focus the more experience you have. So, picking up an instrument as a novice could be difficult",
            "score": 6,
            "replies": [
                {
                    "author": "hotplasmatits",
                    "body": "It's great for developing focus. You can't daydream while sight reading. There's endless levels of difficulty.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Pick_Unlimited",
                            "body": "Very true",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Golintaim",
                    "body": "My experience with music is after playing for a few months or years, depending on the instrument I can focus solely on the music and the fingerings, hand position is just automatic. It means I can focus on just the music and music can take all the focus you have to give without being upset you have no more to give.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Reasonable-Soup-2142",
            "body": "Doom scrolling, you tube, gaming",
            "score": 3,
            "replies": []
        },
        {
            "author": "PorkSnorkle",
            "body": "Suffer",
            "score": 7,
            "replies": []
        },
        {
            "author": "Relative_Passion5102",
            "body": "Drink black stewed tea and milk and endless warhammer40k  mathammer on paper - pages and pages of stat calculi: points and combat scenarios with different equipment!!! I hate any complex maths or sudoku shit but THIS... I become fucking obsessive with multiples and divisors of 6 (D6): 1.66, 3.33, 5.3, 8.3, 6.6, 0.816..  lol and assembly, even though that costs money so, less.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Blackreach18",
            "body": "Listen to music and attempt to tackle the list of things I want to do in my note pad.  Not always easy, never easy actually. But you've got to start somewhere.  It's never too late to develop healthy habits, the hardest part is the initial step.\n\n\nTo clarify,my list is not made up of just things I want to do but includes things I need to do.  Like, dishes, get gas for my car for the week.  Pay bills, etc.  Using a list was one of the better decisions I've made.",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 2,
            "replies": [
                {
                    "author": "ret255",
                    "body": "Or during the work?",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ilikecomer",
            "body": "Currently Pokemon go cuz it helps me get out of the house, sometimes will read ebooks, lots of tv at the moment. But hopefully will try new hobbies soon.",
            "score": 2,
            "replies": []
        },
        {
            "author": "haowei_chien",
            "body": "Reading is the best!  \nTo stop myself from endlessly scrolling, I set up my phone to remind me to switch to the Kindle app whenever I open social media. Even if I use social media, it automatically closes after 10 minutes.",
            "score": 2,
            "replies": [
                {
                    "author": "Ok_Specialist2752",
                    "body": "I'm going to try this!",
                    "score": 2,
                    "replies": [
                        {
                            "author": "haowei_chien",
                            "body": "This setup is very helpful for me! I use a tool called clarymind to configure it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "No_Vermicelli2327",
            "body": "I like to go on evening walks with a friend. I have a couple friends around who also prefer spontaneous last minute plans, seeing as we're all so busy during the day time it's hard for us to say when exactly we're free unless it's half an hour beforehand. The main things that help me is the fresh air and the chatting, which tires me out enough to be able to fall asleep better. Seeing as the plan involves another person, I feel much more motivated to follow through with the plan seeing as I initiated it and I don't want to let the other person down. For me it's always easier going for walks with someone or else I'll likely stay in on my phone!\n\nI try to set a 20 minute timer to tidy one part of my room seeing as it is always a mess. If I'm really stuck in the doomscrolling loop I'll set the timer for 10 minutes, the time pressure helps me get up and I usually end up dismissing the alarm to continue tidying as I've already started the task.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Akmal20007",
            "body": "I play games or install another Linux distro,  I know I won't do anything important like studying so I do something that won't benefit me",
            "score": 2,
            "replies": []
        },
        {
            "author": "elleantsia",
            "body": "Coloring and journaling. I keep a pen and pocket notebook with me all the time (different books juggling them around. Often bring one thing and not the other etc. but it works!",
            "score": 2,
            "replies": []
        },
        {
            "author": "FearlessCloud01",
            "body": "I usually read stuff. On my phone or my laptop… unless there's a rocket launching somewhere that interests me. Also some amount of stuff on YT here and there… And Anime…",
            "score": 2,
            "replies": []
        },
        {
            "author": "DaRealAnnLand",
            "body": "I like making miniatures. A wide variety of things to make. Gaming stuff. Harry Potter stuff. Doll house stuff. \n\nI also cook while listening to audio books.  That keeps me from eating junk too. \n\nI’ve also started to try doing some kind of stretching or yoga or walking every day. So any time I’m ‘bored’ I try to do one of those things.",
            "score": 2,
            "replies": []
        },
        {
            "author": "NewerEddo",
            "body": "kindly inviting my brain to do something :)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok_Stable4315",
            "body": "I work lol I enjoy my work so I see it as paid free time. My main work are studies. I find that just being on the phone takes energy as well. I try to combine it with laundry or cleaning up my place. Today I missed laundry time though, but oh well.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Although_somebody",
            "body": "Define \"free time\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Parking_Buy_1525",
            "body": "nothing",
            "score": 1,
            "replies": []
        },
        {
            "author": "Minute_Ad_5636",
            "body": "I was doomscrolling for the longest time. So I got a hobby one that I’ve stuck with actually it’s pretty expensive with stains glassing.  But I’m now obsessed sooo that’s fun…",
            "score": 1,
            "replies": []
        },
        {
            "author": "Skydiveforlife",
            "body": "Skydive, works like a charm.",
            "score": 1,
            "replies": []
        },
        {
            "author": "slabcobbey",
            "body": "Video games, tiktok / reels, reddit, twitter or youtube.\n\nI can never be productive and I feel like I don’t have enough time to do anything. I can never even relax one bit, I don’t know how to do it",
            "score": 1,
            "replies": []
        },
        {
            "author": "AJD3527",
            "body": "all the time is free time lmao",
            "score": 1,
            "replies": []
        },
        {
            "author": "Red_Horns47",
            "body": "Endlessly scrolling through my phone",
            "score": 1,
            "replies": []
        },
        {
            "author": "BitterRucksack",
            "body": "Reading short stories or a comic book like Calvin and Hobbes. Doodling. Making shapes out of playdoh. Rearranging my furniture. Couple of weeks ago I spent about ten hours fastidiously drawing colored lines over a political district map on my iPad to indicate where the boundaries were recently changed. If you have pets, a casual playtime with them is a good idea. A number of years ago when my internet was out for a week during a school break, I spent the week cutting up printer paper into squares and making a few dozen origami Yodas. I also have a couple basic cheap coloring books and some crayons and colored pencils, and those are great for when I need to do SOMETHING with my hands but don't want to deal with having to think about WHAT to draw or having to clean up a mess of scrap paper. ",
            "score": 1,
            "replies": [
                {
                    "author": "BitterRucksack",
                    "body": "If you want computer ideas, there are lots of free fun programs to play with--I spend a lot of time making 3D models in Blender and sticking them in a program called Sweet Home 3D as a virtual (and free!) dollhouse. There are also emulators to play various old video games--there's this one rollercoaster one that my brother LOVES that I can never remember the name of.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "jackieinertia",
            "body": "Mostly video games for me after work that way since there’s a controller in my hand I can’t also be scrolling on the phone. Unless there’s a cutscene then I’m definitely scrolling my phone then watching a YouTube of the cutscene I missed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WarMundane5420",
            "body": "Podcasts, video games, drawing, crafts",
            "score": 1,
            "replies": []
        },
        {
            "author": "TermOk7703",
            "body": "I listen to true crime podcasts and draw/paint",
            "score": 1,
            "replies": []
        },
        {
            "author": "BobbyNowhere123",
            "body": "I’m honestly too tired to do anything once my meds wear off and I’ve had a full day at work",
            "score": 1,
            "replies": []
        },
        {
            "author": "Variable851",
            "body": "I'm learning to design things for 3D printing and I'm learning to weld. I like archery but don't get time to do it often. Same with riding my motorcycles. Last summer I impulsively took one completely apart so now I have to put it back together. I play video games sometimes. Take my dog to the park. Lots of interests, lots of half done projects",
            "score": 1,
            "replies": []
        },
        {
            "author": "LaMoonFace",
            "body": "I don't get much free time because I have a family and a demanding job but the time I do have I spend in the gym or obsessing about the last 40 years of social interactions that I've screwed up 👍🏼",
            "score": 0,
            "replies": []
        }
    ]
}