{
    "title": "Thinking about getting back on medication for work",
    "author": "TheMatt561",
    "subreddit": "ADHD",
    "rank": 305,
    "score": 2,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/ADHD/comments/1j360ru/thinking_about_getting_back_on_medication_for_work/",
    "id": "1j360ru",
    "selftext": "Little history, I was diagnosed with ADD in 1988 when I was 7. Was on Ritalin for a little bit but my took me off it because it made me a zombie. \n\nIn my 20s I went on Adderall to help with work, but it killed my appetite gave me cottonmouth and erectile dysfunction. The weight loss was nice but   my gf at the time was not to happy. So I dropped it and haven't been on anything since, the ADHD helped in my old career but currently it's nothing but a detriment. \n\nMy current job it's physical and mindless leaving me my to wonder on every problem I see and there are a lot and it's driving me insane. One of the reasons I took the job was not having the responsibilities of ownership but my brain didn't get the memo and I need it to quiet it down. \n\nLong story long what are the new meds out there and what side effects have people been getting. \nI'm making an appointment but it's good to go in with info. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Blackreach18",
            "body": "Concerta is good and fast acting for focusing, it's duration is 6 to 8 hours from my experience, but when it wears off it's like getting hit with a shovel followed by 2 hours of struggling to stay awake.  After that you feel normal again.  It does, for me, tend to make situations involving anger much more intense.  Not good if you have road rage issues to begin with.\n\nFoquest, which I currently take, is similar to concerta but doesn't hit a strong, it's more a straight line throughout the day.  It's about 10 hours but is marketed as up to 16, so keep that in mind.  There is no crash and you don't feel drained.  When it wears off you feel normal, and my wife tells me I'm back in my immature shit disturbing mood.  My 8 year old thinks I'm funny at least.\n\nBoth have appetite suppressant qualities but concerta almost makes you forget to eat where as foquest you still get hungry",
            "score": 3,
            "replies": [
                {
                    "author": "TheMatt561",
                    "body": "Good info thanks, The quick release stuff seems interesting but a lot to go back and forth mentally like that",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}