{
    "title": "Fascinated by ball bearings!",
    "author": "Natural_Wrongdoer_83",
    "subreddit": "ADHD",
    "rank": 289,
    "score": 2,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.reddit.com/r/ADHD/comments/1j38rpt/fascinated_by_ball_bearings/",
    "id": "1j38rpt",
    "selftext": "I seem to have a fascination with ball bearings. I always have. Something about them just intrigues me but it has to be in large quantities. I feel like I could dive into a pool of them. I would love to have a bucket of them and just plunge my hands in and feel them. There used to be an add on TV for a speaker and they had a huge area of ball bearings vibrating on the surface, I think there was a person lying in the middle of it.\n\nThe thing is, I have never touched a large quantity of them, but something about them just calls to me.\n\nNot sure if this is an ADHD thing, a ball bearing thing, I dont know. Anybody else have this, or a similar affection for a random thing?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/Natural_Wrongdoer_83 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "jawnhawk666",
            "body": "Hyper focus is a spectrum thing. Embrace it. \nI would say contact a local electric motor repair shop and ask for some scrap bearing. They would have lots. \nBreak them open and live your dream!",
            "score": 2,
            "replies": []
        },
        {
            "author": "smb3something",
            "body": "Could be a sensory thing? The feeling of dipping my hand in a bucket of bearings sounds enticing. I really do like the magnet ball bearings (I think no longer on the market) as they were really fun to play with.",
            "score": 1,
            "replies": [
                {
                    "author": "Natural_Wrongdoer_83",
                    "body": "I have a set of the magnets on my desk, I do love moulding them into satisfying feeling shapes. I can get very distracted by them when something is coming together but the magnets keep whipping one of the balls out of line! \n\nI think the sensory thing I am looking for could only be achieved by non magnetic balls, like steel water.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}