{
    "title": "Adderall Eliminated Anxiety but makes me depressed",
    "author": "Makmak1403",
    "subreddit": "ADHD",
    "rank": 254,
    "score": 3,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 7,
    "url": "https://www.reddit.com/r/ADHD/comments/1j3bqdj/adderall_eliminated_anxiety_but_makes_me_depressed/",
    "id": "1j3bqdj",
    "selftext": "I’m 37 and have been fighting anxiety most of my adult life. My wife suggested that I get tested for ADHD and well it turns out I have ADHD.\n\nI got prescribed adderral XR 10mg after trying Straterra which is terrible. \n\n-The first day I was kind of wired but no anxiety. Bad crash at the end of the day\n-Second day I was calm, still no anxiety.  End of day crash \nBy about the 4th day the meds just made me tired and depressed with each day getting worse. BUT no anxiety.\n\nI stopped taking it and went back to the doctor\n\nDoctor prescribed me an additional 5mg dose to help with the end of the day crash.\n\nIt helped at first. Then after a few days I would start to crash, take the extra dose and it pretty much didn’t do anything. I got so deep into depression that I had to stop.\n\nI’m just curious if anybody else has had this experience??",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/Makmak1403 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "jdt1984",
            "body": "I also experienced an ease of my anxiety coupled with an end of day stimulant crash, but on Vyvanse.\n\nIt may be that the stimulants are what you need, just not Adderall. On Vyvanse, the crash was bad enough to prompt my prescriber changing my meds. She switched me to Dyanavel XR, which is another long-lasting stimulant. All of the symptom relief is the same, but there is no crash. I take one pill in the AM and a 1/4 dose booster midday.\n\nYou may want to discuss other stimulant options with your doctor. Depression is not an acceptable trade-off for anxiety relief.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Anicanis",
            "body": "Yes, this happened to me with Elvanse and it took me a long time to realise. Also with extended release Ritalin (concerta). The only thing that worked for me was instant release. Keep trying until you find something that helps!",
            "score": 3,
            "replies": []
        },
        {
            "author": "dumpie",
            "body": "Vyvanse would give me such a horrible crash and leave me so fatigued I would barely leave the couch. I'm currently taking extended release Adderall and an immediate release in the afternoon.\n\n\nIt took me a while to dial in my dosage. You may need to tweak both dosages to dial it in for your self. Adderall is probably the most approachable with dosages and extended and immediate relaease. But ultimately if the crash with Adderall is that bad see if Concerta or Vyvanse work better.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Still_Owl2314",
            "body": "I’m not a doctor. This exact thing happened to me. You could be a fast metabolizer for stimulants. The afternoon dose probably isn’t working because it’s too low of a dose to accommodate the crash, and you’d need a full 10mg. You may need 10mg more than 2x a day if you’re a fast metabolizer, because tolerance builds pretty quick when you’re a fast metabolizer. \n\nI had to switch to a methylphenidate med bc I would metabolize adderall too quickly and crash 2 hours after the dose. I tried extended release meds and would metabolize them within 2-3 hours, which was even worse because the extended release meds are usually a higher dose. Jornay PM eventually worked best for me due to the release mechanism. I’m not on adhd meds anymore because my body can’t maintain therapeutic levels due to the constant crashing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wikipeteia",
            "body": "48m on 30mg Adderall XR daily here, also a life long anxiety sufferer and I would have some pretty tough depressive episodes once I started on Adderall, and it started to wear off. As part of my treatment, I spoke to my doctor and I also now take 20mg Fluoxetine (generic for Prozac), it helped immensely. I don't feel the lows (but also don't feel the highs) as badly, and can get through the end of my day easier. \n\nYou may want to consider either increasing your dose or adding something else to the mix to help your peace, OP. Though, your milage may vary on what works for you - wishing you nothing but success and help in finding the right balance for you!",
            "score": 1,
            "replies": [
                {
                    "author": "Makmak1403",
                    "body": "Thanks. I tried Fluoxetine in the past and it was the only SSRI that didn’t feel like it was trying to kill me lol. But After a while its effects wore off and I switched to Wellbutrin.\nBut I recently dropped my dose of wellbutrin from twice to once a day because it was making me emotionless.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}