{
    "title": "Diagnosed yesterday and start meds today. I’m anxious but hopeful.",
    "author": "seangolden06",
    "subreddit": "ADHD",
    "rank": 223,
    "score": 6,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.reddit.com/r/ADHD/comments/1j3bvuu/diagnosed_yesterday_and_start_meds_today_im/",
    "id": "1j3bvuu",
    "selftext": "I’m currently processing and grieving what life could’ve been for me (this seems to be normal for many). Now after almost four decades, I’m told my struggles and failures aren’t my fault. What recommendations do you have as I navigate this new diagnosis and adapt to medication?\n\nI’ve began watching Dr. Barkley’s lecture that’s pinned here. I’m current waiting on his book, “Taking Charge of Adult ADHD.” \n\nI’m anxious but hopeful. I’m just super bummed I spent my entire life wishing I was as smart as other people, when it was just a matter of getting a diagnosis and finding treatment. Thank you for your time and any feedback. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/seangolden06 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Icy_Answer2513",
            "body": "Good luck with your medication and ongoing journey. I am a little way behind you (awaiting main assessment) but having received an autism diagnosis 5 years ago I can totally identify with your upset and frustrations.\n\n\nI feel short changed and let down. I'm pushing 50. Thinking about all the lost years and struggles.\n\n\nI know I can be quite resourceful and maybe 20, or even 10 years ago I might have had more positivity about future possibilities.\n\n\nCurrently, not so sure I've got anything left in the tank. Time will tell once I am diagnosed and medicated.\n\n\nI have received some very thoughtful and positive replies from others late diagnosed like us, who feel energised and ready to take on new challenges, hopefully we will too.\n\n\nGood luck fellow traveller.",
            "score": 2,
            "replies": [
                {
                    "author": "seangolden06",
                    "body": "Thank you for your kind words and sharing your story. I’m sorry to hear that you found out about your autism later in life, but I’m glad to hear you’re working to get an ADHD diagnosis. \n\nNot having much in the tank has to resonate with so many with a late life diagnosis. I hope I have enough left to take advantage of the treatment and start living life normally as possible. \n\nThanks again for your insight and sharing your story. It means a lot to have a community of supporters.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "itsalonghotsummer",
            "body": "Having found the right drug its been a real benefit for ne. Hope it goes well for you x",
            "score": 2,
            "replies": []
        }
    ]
}