{
    "title": "I’m thinking about quitting my job and stop with my medication for a while",
    "author": "superonom",
    "subreddit": "ADHD",
    "rank": 279,
    "score": 0,
    "upvote_ratio": 0.5,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.reddit.com/r/ADHD/comments/1j3fr07/im_thinking_about_quitting_my_job_and_stop_with/",
    "id": "1j3fr07",
    "selftext": "I’ve been on ADHD meds for about a decade. I started with Ritalin — which used to give me a lot of side effects — and switched to Vyvanse recently. \n\nI feel like I'm completely dependent already. I have been increasing the dosage and it works for a while until it doesn't. \n\nMy work (IT) requires a lot of concentration and I get a good salary — incredibly good for my country — but I'm feeling like I only use my meds because of work. I struggle with chores too, but my main reason to take the medicine is work. \n\nI've been considering exploring alternative areas where concentration isn't required as much as it is in my current job. \n\nI am also considering taking a sabbatical to go off meds and maybe “reset” my brain out of these drugs.\n\nHas anyone successfully adapted their careers to a more “ADHD-friendly” area? Or is this just a utopia and I should just keep poisoning my brain and my body with these drugs forever?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/superonom and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "CrayziusMaximus",
            "body": "I feel that.  I'm also in IT.  I used to drive a semi truck and while the hours were long, I didn't have as much to worry about.  Time management was predetermined, and the ability to go to places I've never been was amazing.  The downsides of lack of quality food and a highly variable paycheck as well as being immediately affected by the economy - and I mean *immediately* - were enough to pull me away into something with a bit more structured environment.  I have been IT for several different types of companies/agencies at this point in my career and I have to say that management plays a huge role in how well their employees are taxed.\n\nLong explanation to say, maybe try somewhere else first?",
            "score": 1,
            "replies": [
                {
                    "author": "superonom",
                    "body": "I’ve tried this already. This is my second attempt. I’ve been considering this for a while already, but the money keeps me locked in. And I perform relatively well, but not a lot of people know how much I struggle inside",
                    "score": 1,
                    "replies": [
                        {
                            "author": "CrayziusMaximus",
                            "body": "You are not alone. \n\nhttps://www.reddit.com/r/ADHD/s/2jLrdoGcq7",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}