{
    "title": "does adhd medication help you pay attention in conversations?",
    "author": "RelativelyMango",
    "subreddit": "ADHD",
    "rank": 191,
    "score": 8,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 24,
    "url": "https://www.reddit.com/r/ADHD/comments/1j3gwrq/does_adhd_medication_help_you_pay_attention_in/",
    "id": "1j3gwrq",
    "selftext": "i have a really hard time paying attention to other people speaking in conversations and it’s starting to affect how people are feeling about our relationships. i want to try to improve my attention span so that people don’t feel like they’re having one-way conversations with me. would adhd medication help with that? i’m unmedicated right now, but i would consider medication if it would help with that. i also think medication would help me stay focused and on-task at school and work. i think other tactics like fidgets and adding small responses to engage with what other people are saying would help too, but i don’t think that would fully fix things. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Few_Ask_4679",
            "body": "i’ll be quite honest, i am able to pay attention to said people talking but i get more internally annoyed at the conversation because i actually know what’s going on and im following along.",
            "score": 5,
            "replies": [
                {
                    "author": "RelativelyMango",
                    "body": "that makes sense. i only zone out if i’m not able to react or add responses to what other people are saying. it annoys people that i respond in the middle of what they’re saying too, so i really can’t win in this situation. 😅",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Difficult_Standard_1",
            "body": "Even on meds I can to a point, most conversations around me are pretty f’n boring and I try to participate but it can be difficult. If I don’t feel like I’ve anything to contribute I’ll zone out until I hear my name or they start talking about something I’m interested in.",
            "score": 3,
            "replies": [
                {
                    "author": "RelativelyMango",
                    "body": "i do find some conversations boring too, but i don’t want other people to feel like i don’t care about what they’re saying.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Difficult_Standard_1",
                            "body": "I get that, it is a skill that has to be developed, being medicated will help however you’ll have train yourself to listen and to tolerate it if you’re bored. \n\nI don’t like 1 on 1 conversations with anyone other than my husband. Even if 1 friend is like can we hang out, I will avoid unless at least another person is there. It’s ridiculous I know but it also prevents other schoolyard behaviors that I can’t and won’t deal with.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "RelativelyMango",
                                    "body": "i think for the most part i do value and want to listen to what people are saying to me besides the occasional boring conversation, but it’s just so hard to pay attention even to the conversations i care about. i want to be able to have 1 on 1 conversations with people i care about, since i enjoy being around them.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Soy_un_oiseau",
            "body": "It does help me with conversations. I find myself more present, able to express my thoughts more clearly, and can manage my impatience when people are taking forever to get to the point. ",
            "score": 3,
            "replies": [
                {
                    "author": "RelativelyMango",
                    "body": "ok, that’s super helpful to know. thank you!!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Extreme-Offer-1399",
            "body": "Yes, definitely. I've tried two different ones and every single one of them has.",
            "score": 2,
            "replies": [
                {
                    "author": "RelativelyMango",
                    "body": "that’s so good to hear. i think i’ll definitely ask my psychiatrist about medication then.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "AmbitiousCat9351",
            "body": "I have only been on adderall x r 3 months. For me yes, I can pay attention to conversations. I seem to be quite charming and happy too. not awkward I mean by charming haha and am renembering the conversations. its a good treatment for me. wish I had found it 50 years ago feel good.",
            "score": 1,
            "replies": [
                {
                    "author": "RelativelyMango",
                    "body": "ok, that’s good to know! i’m glad that it helps.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "throw-away-3005",
            "body": "Yes, it's actually nice being able to follow what my boss is telling me to do than try and put pieces of what I heard together. Also just talking with loved ones, I'm not interrupting as much. Basically I don't have to say what I'm thinking, it almost feels okay to let those thoughts go and move on in the convo.",
            "score": 1,
            "replies": [
                {
                    "author": "RelativelyMango",
                    "body": "that’s exactly what i need help with. i’m glad to hear that medication is helpful with that.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "preventworkinjury",
            "body": "It has helped me tremendously.",
            "score": 1,
            "replies": [
                {
                    "author": "RelativelyMango",
                    "body": "i’m glad! it makes me hopeful that medication could improve things for me.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "DJfade1013",
            "body": "Medication has helped me immensely in having conversations & you go off onto different tangents. You definitely will be focused at least for me",
            "score": 1,
            "replies": [
                {
                    "author": "RelativelyMango",
                    "body": "ok, that’s awesome to hear.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Uleepera",
            "body": "In my experience, it does not necessarily help me pay more attention, but rather, feel I have increased self-awareness to recognize when I am drifting off mid-conversation. This still occurs multiple times in a conversation, requiring me to re-engage myself and occasionally improvise a response so that they do not became bored with their tangent.",
            "score": 1,
            "replies": [
                {
                    "author": "RelativelyMango",
                    "body": "that still seems very helpful.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Uleepera",
                            "body": "100., I'm just cautioning that in my case I still drift, but course correct easier.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "isyankar1979",
            "body": "Nah Im pretty much zoned out more than half the time",
            "score": 1,
            "replies": [
                {
                    "author": "RelativelyMango",
                    "body": "that’s a bummer. it sounds like it has helped some other people though.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}