{
    "title": "Advice needed for managing symptoms in school",
    "author": "Puerstella",
    "subreddit": "ADHD",
    "rank": 220,
    "score": 2,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/ADHD/comments/1j3ksd0/advice_needed_for_managing_symptoms_in_school/",
    "id": "1j3ksd0",
    "selftext": "I need to explain some background, but it's all ADHD related.\n\nI got surgery three weeks ago. Nothing serious, but I had to be put asleep. The doctors said this will mess up my health markers for a few weeks. My mother want me to get my bloods done to look for deficiencies as we're learning about the common comordidies with ADHD. But I can't get tested for a few weeks.\n\nSchool has been driving me crazy. My symptoms have stayed the same amount of aggressiveness as when I was younger but I'm nearing the end of my secondary school career (ages 12 to 19, it's European high-school) and that means important exams next year. I'm getting a little distressed with my energy levels, focus (or lack there of) and how much I actually get done in a day, study wise.\n\nMy mother is against the typical ADHD treatment, however, I feel with some explaining as time goes by, she can come around to them. For the mean time, I found some caffeine/energy supplements (SCIENCE BASED! And approved by my countries medical organisations!) online, but I'm not allowed to take them until I get my bloods done. (To get a baseline of my health vitals)\n\nI get half homeschooled so I work from home a lot but honestly, the environment isn't always the issue. Regardless of where I am I just can't focus or take it in unless I'm trying really hard, then get knocked out the rest of the day.\n\n\nActual question:\n\nAnyway, this is a long winded way of asking if any ADHDers have any tips that helped them while they were unmedicated or aren't on any rught now. Anything that could tide me over a few weeks would be greatly appreciated. I take 6 subjects (exempt from one) and are all within my skills set of English and history but even though I want to do something I still can't force myself.\n\nI get good grades eventually but the stress I go through to scrap by will probably cause a heart attack at 30.\n\nAlso, this is my first time posting on this sub reddit. Hope this flies by the mods, thank you for reading.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/Puerstella and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "alionrey",
            "body": "I once told myself over and over the wrong deadline to my exam so I convinced myself for example the due date was 21/02 not 31/02 so I crammed studying 20/02 for no reason and got a lot done way before I needed to. Honestly I’m undiagnosed and unmediated so that’s probably no help at all but I would also tell my friends to convinced me certain sections of my exams were needed to be revised by a date so I would do it.",
            "score": 1,
            "replies": []
        }
    ]
}