{
    "title": "How often were your dose adjustments?",
    "author": "Henthighs",
    "subreddit": "ADHD",
    "rank": 226,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.reddit.com/r/ADHD/comments/1j3pefp/how_often_were_your_dose_adjustments/",
    "id": "1j3pefp",
    "selftext": "I’m starting on adderall but my doctor refuses to do more than 5mg dose adjustments for XR more than once a month so 4 months later, I still feel nothing and do not have the help I need.\n\nHow often were you able to adjust your dose or change your medication? How long did it take you to settle into one type of medication? When swapping meds, were you able to receive a dose of another medication in case?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your body is unique, as are your needs. Just because someone experienced something from treatment or medication does not guarantee that you will as well. Please do not take this as an opportunity to review any substances. Peer support is welcome.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n---\n- If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Computer_3432",
            "body": "Started Vyvanse 30mg, then 1 year later went to 50mg Vyvanse, then a few months later swapped to an equivalent dose of Dexamphetamine 20mg a day and have been there for 3 years",
            "score": 2,
            "replies": []
        },
        {
            "author": "LongjumpingAffect451",
            "body": "I started at 10mg of Dex, increased to 20mg after a week, then increased to 30mg 3 weeks later. Now I’m at 30mg daily.",
            "score": 1,
            "replies": [
                {
                    "author": "Henthighs",
                    "body": "how did your doctor let you get dose adjustments every week? what did you tell him?",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}