{
    "title": "How do you manage not being able to finish a meal?",
    "author": "allthewayd00wn",
    "subreddit": "ADHD",
    "rank": 186,
    "score": 2,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 1,
    "url": "https://www.reddit.com/r/ADHD/comments/1j3rtu6/how_do_you_manage_not_being_able_to_finish_a_meal/",
    "id": "1j3rtu6",
    "selftext": "Much of my ADHD struggles nowadays (for the last few years) have been related to food and eating and it's been tough.\n\nAs of recently, l've been pretty good about eating atleast two meals a day, but the problem starts once itake a bite of the food. I just can't seem to focus on the food, unless I'm starving, then I devour it. But usually, i will take a bite, and sit and wait like 10-15 min between each bite. Again, I have to manually tell myself to eat, sort of mutter to myself to finish. It's pretty bad, and medication doesn't really seem tohelp.\n\nI've developed a couple strategies to help myself finish a meal in under 30 minutes.\n\n1. Record myself eating, like a mukkbanger.\nStrangely enough, watching myself eat helps a lot, as it makes myself directly visually aware...of myself. Reminds me that I exist, which I guess I'm not aware enough of in my everyday An added benefit is that recording urself also visualizes the amount of time passing via number countdown/ up, so that helps me not sit in an 3hr slump on the couch.\n\n2. Eating while doing something active. I sometimes will take my meals to go-as I'm driving, as I'm walking to work, etc. This doesn't work for when i watch TV, listen to music, because i think these are passive activities and it just doesn't hit. Eating while driving can be dangerous so be while driving can be dangerous so be careful.\n\n3. Organizing my bites. A partial reason why I can't finish my meals is because I think I get overwhelmed by the amount on my plate. If possible, I'II separate the food into bite size pieces on the plate/bowl, or I'll count every bite i take so I have a organizational structure.\nSometimes, i will tell myself that I will finish a meal in 15 bites, and keep count. It sets a clear goalpost with simple steps to completion.\n\n\nThese are tips and strategies I have so far. Would love to hear about anyone's struggles related to finishing a meal, and about food in general. Any comment is a good one. <3",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/allthewayd00wn and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        }
    ]
}