{
    "title": "is this cheating?",
    "author": "TTPP_rental_acc1",
    "subreddit": "ADHD",
    "rank": 103,
    "score": 7,
    "upvote_ratio": 0.69,
    "num_comments (reported by reddit)": 23,
    "url": "https://www.reddit.com/r/ADHD/comments/1j3xp2z/is_this_cheating/",
    "id": "1j3xp2z",
    "selftext": "in college rn, i absolutely hate lectures, im supposed to write notes, but my notes never make sense because i rush to write it all down or else i cannot keep up with the lecture, besides, i cant multitask so even just writing alone i will forget everything he says. fortunatley i have access to class powerpoint presentations.\n\nnowadays i just completely ignore the lecture since everything mentioned is on the power point, and whenever i need to find some information i just do a quick n dirty crtl + f, and find exactly what i need in the power point.\n\n  \nit feels like im cheating though because arent i supposed to memorize all of this?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/TTPP_rental_acc1 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hjax",
            "body": "You're supposed to learn the course content in whatever way works best for you. If you don't need to take notes or you learn best by reviewing the presentations after, great! It's definitely not cheating to use the resources that are provided to you, as long as you aren't looking at them while you're taking a test (if you're not supposed to be).",
            "score": 28,
            "replies": []
        },
        {
            "author": "Dark_S1gns",
            "body": "I turn up to all my lectures as sometimes hearing something in person (if it particularly interests me at the time) can help it stick, but I honestly absorb very little at them, I absolutely do the same thing and find it all in the course notes and PowerPoints as that is just what works best for me. I don’t think it matters, we’re paying for an education and with ADHD sometimes we just learn a bit differently, the main thing is we are getting the most out of the course so I think it’s totally fine however it is you may do that.",
            "score": 4,
            "replies": []
        },
        {
            "author": "RA3236",
            "body": "It's not cheating, but be careful doing this. I found myself procrastinating reading the lecture notes properly until just before assignments were due.",
            "score": 3,
            "replies": [
                {
                    "author": "BumbleLapse",
                    "body": "Right, and you’re obviously gonna be missing context and detail by skimming PowerPoints in place of a detailed lecture.\n\nOP’s strategy should work in a pinch and it’s definitely allowed, but attending class where a professor lectures and answers question is where the most information will be laid out most clearly.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Selen_L",
            "body": "You’ll be fine, I skipped all my lectures since year 2 and did exactly what you said for my courseworks.\nAlso did similar things on the textbooks, just searching words from the index and reading those pages only. The college expects you to utilise all available materials provided for courseworks, so I won’t call that cheating. \nExams on the other hand… we had to pull a few all nighters for those",
            "score": 2,
            "replies": []
        },
        {
            "author": "Some1getmeablanket",
            "body": "Not cheating BUT if you have access to the PowerPoints beforehand, take your notes in the PowerPoint presentation and/or record your lecture so you can go back and listen to context. You’ll have to likely do it discretely but was a lifesaver for me in school",
            "score": 2,
            "replies": [
                {
                    "author": "halberdierbowman",
                    "body": "My college hired me to record one of my classes for the remote kids, so I had video and audio of every lecture. I put my phone on the lectern to record the audio.\n\n\nEasiest class ever! Lol granted most classes like that are cakewalks for me, but all I did was listen once to the audio over the couple days before the exams.\n\n\nBut also OP, find the office at your college responsible for accommodating disabilities. ADHD is a disability, and a common accomodation they offer is for them to provide course notes for you. They'd probably hire one of your fellow students to share their notes.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "dwegol",
            "body": "Your professors may or may not teach in a way that is easy for you. Some classes I had to spend just as much time with a tutor. But you’ll learn the methods of reviewing material that work best for you. There are countless ways to study, some require more prep work than others, but what matters is what is effective for you specifically.\n\nWhatever is considered cheating by your college will be well-documented by them and easy to look up! You could even ask at the learning center what the policies are.",
            "score": 2,
            "replies": []
        },
        {
            "author": "AGx-07",
            "body": "Memorizing isnt the same as learning. It was like how I hated learning...sorry \"memorizing\"....my multiplication tables. By brain simply wasn't going to do it. I needed to learn a method of figuring out what 7*7 equals not just memorizing the value. I mean, I'm not going to memorize what 135,678 * 593,746 is right? I'm going to learn how to calculate that. I get that those small numbers form a base that makes the rest easy but that didn't work for me. I needed to learn to math.\n\nSame here. I think you just need to make sure that you're actually learning the content, whatever it is. Forget whether or not it's cheating. You just need to be making sure that the college experience isn't a waste (because it's so damned expensive and hopefully is providing your life some value). If this is what you need to do, do it. Just make sure that, especially if it's something related to your major, you're actually learning it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "AvailableInside9637",
            "body": "remember - you just need to graduate; it does not matter how u do",
            "score": 4,
            "replies": []
        },
        {
            "author": "BumbleLapse",
            "body": "Memorization isn’t learning and it hasn’t been that way for a long time.\n\nUse the tools available to you whether that be CTRL-F, voice-to-text software, or generative AI. If something hasn’t been explicitly outlawed, you should be good to use it if you feel like it’ll help you learn or study better. Ask your teacher/professor if you’re unsure. The worst they can say is “no, you can’t use that.”",
            "score": 2,
            "replies": []
        },
        {
            "author": "Hot_Phase_1435",
            "body": "Not cheating. I'm a virtual student and we have open book tests. It's not cheating if you are able to Control + F to ease the search for answers. I feel like that's better efficiency to staying on task. If it helps. I take my lectures from Power Point and make my notes from them - but I also add additional information from the textbook. And if my textbook doesn't have good enough examples - I google. It's not cheating - I'm researching - It's like asking a professor a question. You still have to analyze what is being told to you because there can be several opinions to a topic. So google is another way of getting those opinions.",
            "score": 1,
            "replies": [
                {
                    "author": "Hot_Phase_1435",
                    "body": "As ADHDer's we have an incredible ability to cross-reference information - and researching is our specialty. So the ability to search for things via all our material plus finding additional outside sources also help. \n\nExample - when writing a paper - I will get a sample from the text, a sample from the lecture, and 1-2 additional outside sources from the internet or book. The ability to link all those examples together in a cohesive thought is what earns you the grade. Especially when you are also incorporating your own personal thought to bring everything together. \n\nOne last thing, I'm a virtual student that doesn't have live lectures - sometimes we have recorded lectures - but most of the time we just have powerpoints as lectures and that's it. We sometimes have YouTube videos as \"Lectures\" too. It's pretty wild but also pretty cool.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "hampserinspace",
            "body": "Personally I found lectures important, followed by massive note taking and then practice questions and text books. Spent most of uni life in the library (our house did not have heating). This was with poorly managed dyslexia and also at the time undiagnosed ADHD.  I struggled in the maths/physics based stuff which made my level drop but did not stop me doing a doctorate. \n\nMy main take from it all was if you can understand the principles you can work it out from there.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TjayJefferson01",
            "body": "This was something that I was told I should do by my course teacher, but to write it “in my own words”.",
            "score": 1,
            "replies": []
        },
        {
            "author": "modest_genius",
            "body": "It is not cheating.\n\n>arent i supposed to memorize all of this?\n\nNo, you are supposed to understand it. That is a huge difference.\n\nI don't know the course or the subject but the higher in educations you get more and more into understanding and reasoning. Especially when you get into writing stuff.\n\n>but my notes never make sense because i rush to write it all down or else i cannot keep up with the lecture, besides, i cant multitask so even just writing alone i will forget everything he says. \n\nI think you should look into efficient notetaking. Because you are saying it yourself that you don't get anything from the way you are doing it right now.\n\nTry sitting and listen to the lecture next time. But this time just write down things that you don't understand in like \"Chromodynamics?\", and then after you go figure it out. Or ask in class.  \nAnother way I like is writing down the essence of something, like \"1/σ^2 => the smaller variance means more information in the statistics\". This is from a lecture that I had today, and that was like half of the lecture. Then I check to see if I understand that correctly.  \nThis means sometimes my notes are just two sentences for a whole lecture, sometimes there are 2 full pages.\n\nSometimes I rewrite them afterwards and sometimes I don't. Sometimes I start working with them immediately, like writing something or do some programming or calculations.\n\n...and I did learn this the hard way. I did well in school and a while in the university. But after a while it got to hard to just wing it. Then, crash... now I am a Ph.D student. And it is hard again, but in a new way.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mr_peanut_butterrr",
            "body": "Ctrl-f got me two graduate degrees, you’re fine",
            "score": 1,
            "replies": []
        },
        {
            "author": "doneb1957",
            "body": "I don’t know about you and adhd, I can’t memorize anything. Things like this is what got me through life. I just finally memorized “I before e except after c” and I’m 67.",
            "score": 1,
            "replies": []
        },
        {
            "author": "whatever7894321",
            "body": "I would recommend reading ahead, it took me more time to learn than in lecture, and it helped me follow what the teacher was saying better. Be prepared before class if possible….(I know, easier said than done)",
            "score": 1,
            "replies": []
        },
        {
            "author": "WoodsWalker43",
            "body": "Just remember that a test is just a test. The real goal is to learn. \n\nEveryone learns differently. I had some of the same struggles you described. There's nothing wrong with using the resources that are available to you. You aren't stealing test answer keys. You're just using the published slides. I've been a professional programmer for a decade now. You better believe I still have to look up details all the time, even for languages I've used for ages. Nobody can memorize everything. \n\nThat said, do definitely still study with the goal of at least temporary memorization. It doesn't really matter how effectively you can use the resources if you aren't allowed to use them on the test.",
            "score": 1,
            "replies": []
        },
        {
            "author": "batty3108",
            "body": "If all the content is on the slides and there's literally no extra detail given in the lecture... then don't go to the lecture if you don't want to.\n\nI had a class like that back in my Uni days. The online slides included the speaker notes, which he was just reading verbatim. I went to two, then sacked it off and just downloaded the slides. Passed the class with a good grade.",
            "score": 0,
            "replies": []
        }
    ]
}