{
    "title": "Have you tried gamifying your lives?",
    "author": "VishnOx",
    "subreddit": "ADHD",
    "rank": 27,
    "score": 46,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 51,
    "url": "https://www.reddit.com/r/ADHD/comments/1j3xdiv/have_you_tried_gamifying_your_lives/",
    "id": "1j3xdiv",
    "selftext": "I love anime. And a while ago I came across this series called Solo Levelling. It’s absolutely amazing and a growth arc for this underdog character who then becomes the most powerful person in all the realms. (I guess we all want to be that person, and I’ve fantasised about it all my life, which now I can attribute to the challenges of ADHD.)\n\nBut, it’s the manner in which he grows that caught my attention and interest more than anything else. He’s a ‘player’ within a system which rewards him and penalises him based on daily achievements.\n\nHe can level up infinitely, and faces harder challenges each time. \n\nThe that stats which are in his control to improve are - HP, Intelligence, Agility, Strength, Health, Sense, and based on the nature or intensity of the challenge Fatigue increases. As he grows in level, he also gets different Titles and powers.\n\nObviously this fantasy world can’t be translated into reality, but if you were to build a gamified system for yourself, how would you do it? Have you already managed to gamify parts of your life to counter your ADHD? What rewards do you give yourself or get? (This is especially hard for me because I get into phases where nothing interests me and no reward seems worth pursuing)\n\nVery curious to know your thoughts on this.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/VishnOx and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "sakikome",
            "body": "I tried Habit RPG for a while. It was fine for a while, but like everything - didn't stick.\n\nThe problem is, it's not gamifying to me because points aren't allocated and achievements aren't recognized automatically. If I have to sit down and enter \"Got out of bed\", \"Did x number of steps\" etc myself it's not a game, it's a tracker.",
            "score": 50,
            "replies": [
                {
                    "author": "FearlessCloud01",
                    "body": "Yeah, even I tried this stuff. But I quickly realised that it wasn't automated. I had to manually input most if not all of the details.\n\nI was like, \"you expect me to categorise and judge my own work? Me?\" and deleted the app.",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "ArtbyLinnzy",
                    "body": "It was exactly the same for me.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Krypt0night",
            "body": "Yup. Doesn't work for me unfortunately. It starts out good for a few days and then quickly doesn't as I realize it's all something I can simply stop doing and nothing changes.",
            "score": 19,
            "replies": [
                {
                    "author": "Dadewitt3",
                    "body": "Yeah this is the challenge of every self help hack and tip when you don't have someone conscientious participating with you.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Krypt0night",
                            "body": "Yup, the only way I get ANYTHING done is because of other people, either my partner or at work it's because of deadlines or if it's for a friend. If it's just up to me, nothing in the world will make me get it done as fast than if someone else is expecting me to and needs me to.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "yahmumm",
            "body": "I tried all those other ones now I use finch and I have a 98 day streak. I'll admit it's not the same as before where I do stuff first and then tick it off to get points. I cheat more with it now but hey I've still managed to stick with it for this long which is amazing and plus the game is SUPER CUTE",
            "score": 12,
            "replies": [
                {
                    "author": "blackdove88",
                    "body": "Finch is really good for ADHD, especially if you like cute things. I'm in the same boat- I've had it for almost a year, and it's helped me remember to do specific tasks like taking my meds/supplements, doing some type of movement/exercise, etc. It's not perfect, and I cheat a bit sometimes, but it's quite effective otherwise. Kind of like a wellness Tamagotchi. I highly recommend!!",
                    "score": 3,
                    "replies": [
                        {
                            "author": "VishnOx",
                            "body": "A friend introduced me to Finch, and she used to send me these daily hellos and gifts, but I found Finch especially annoying because of that and other things. Too many notifications and I couldn’t really bring myself to care for my character =/",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Kuschelfuchs",
            "body": "Doesn‘t work because my brain knows it’s some actually mesningless bullshit ploy in order to get it to function. I tried all sorts of things to trick it into complying, but it’s too smart for me.",
            "score": 9,
            "replies": [
                {
                    "author": "sakikome",
                    "body": "\"My brain is too smart for me\" is such a vibe",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sorsha_OBrien",
            "body": "Search up “the only thing that stopped me from infinite scrolling” by SwiftFilms on YouTube. He basically has a bunch of things he tracks every day and he ticks them off if he does them. But it’s all on one page and tracking a month so he can see how he’s improved throughout the month. I’ve been doing it recently and it’s really helped with adding/ trying to do a lot of little habits :)",
            "score": 6,
            "replies": []
        },
        {
            "author": "TinkerSquirrels",
            "body": "This assumes I'll keep playing games even just for fun... so, personally, no real benefit other than it's worse when you come back around to it and have failure laid out so clearly.",
            "score": 5,
            "replies": []
        },
        {
            "author": "QueenGlitterBitch",
            "body": "I used to have tons of different hobbies. So I I created a The Book of Life to keep track of how much I did them, and so I wouldn't forget about them. Each time I did that hobby or activity, it gained an exp. point. Level 1 needed one point and to get from Level 2-3 took 2 extra points, and so on. It was fun to watch it grow, and  I learned how to make a macro for it, so I could just hit a button to level it. I did it for a couple years until my computer died. Then forgot about it, and now you reminded me. Thanks for that. It's not a life changer, but helps  me to be more productive.",
            "score": 4,
            "replies": [
                {
                    "author": "VishnOx",
                    "body": "*username XD*\n\nSo the app that worked best for me for general habit tracking is [Habit](https://apps.apple.com/in/app/habit-daily-tracker/id1445651730). It doesn’t have levels but they have a formula that takes you from 0-100% but on a logarithmic scale of sorts. Your system reminds me of that. I had great success with that app until about a year ago - they haven’t updated it for a while and with the new iOS versions it lost the widget functionality and then things just fell apart.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "EnBipBip",
            "body": "Try out Habitica. It’s an app that gamifies building habits and to do’s by using xp’s, health, and quests✨ I’m in a quest party with two other people, and it honestly helps to have some accountability in a funny way towards them, which helps me do my daily tasks",
            "score": 4,
            "replies": [
                {
                    "author": "VishnOx",
                    "body": "This sounds interesting! I was wondering if there was an app that could also help with some real accountability and not just streaks and points.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "EnBipBip",
                            "body": "If you can get some friends to join, and you’re doing a quest, it’ll impact the group as well. So in that sense you can have accountability. The other day i finally did all my daily tasks again because i didn’t want to be the cause of letting them take damage. It may sound silly, but it can be helpful",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Worksnotenuff",
            "body": "Personal tale of caution: for years i sort of “gameified” my life by challenging myself to do better every day. Trouble is that you can’t develop indefinitely and you must experience setbacks to learn, and I forgot to applaud my own mistakes (as good tries) and also to schedule and reward rest, not only using it as reward. My psyche didn’t hold in the long term of course & now I know it all was a way to mask and live with undiagnosed adhd.",
            "score": 4,
            "replies": [
                {
                    "author": "VishnOx",
                    "body": "How do you do things now after your diagnosis? It seems like you have a great opportunity here to modify your gamification with the feedback and learnings you’ve gleaned from your previous attempt.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Worksnotenuff",
                            "body": "I’ve had lots of support from others that I lacked before and that helps. Both professionally and privately. Still having a hard time asking for help, but try to follow my own advice above: be kind to myself, congratulate me on simple tasks that I now know costs a lot of energy. I’m trying to plan and get some real rest, not just watching teve while scrolling Reddit. Sometimes I practice being present. I have to force myself to focus on whatever it is I’m doing without over focusing. Meds help me with that. They help me focus on single tasks but I still have to decide those tasks before I take them. My old ways was making everything into a sort of life and death situation, including procrastinating until the event horizon. I try to plan. Notice I say I try. I am the same guy, can’t pretend I’m not. Accepting that and finding people who can live with that is hard. I feel much better about myself today than before the diagnosis.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "silvaras_12",
            "body": "I have! And with great results so far.\n\nI am also an avid Solo Leveling fan (even got a tattoo of the Ahjin Guild logo) and have been a D&D player/director for a lot of time and I have for the past few months working on gamifying my life. I created a character sheet of myself and started keeping track of most actions I take during a day for either rewards or punishments in the most important categories of life (that I could think of).\n\nThe good actions make me gain exp and gain coins, and bad actions make me lose life points.\n\nIf I lose all my life points I need to pass certain tests to regain my life (so far it hasn't happened.. I'm staying pretty consistent).\n\nThe way I level up and recover life points is by gaining exp... up to a certain level. If I want to ascend, I have to do some trials, and then my life points regrow.\n\nI also have a game store to spend the coins I'm gaining by doing good actions, which allow me to buy certain items that otherwise would make me lose life points.\n\nI can also see if I'm lacking in some life aspects and start working on them a little bit more, like socializing or studying more.\n\nIt's pretty funny and it's making me a lot more consistent with keeping up on work/workout/studies and avoiding a bit of procrastination.",
            "score": 4,
            "replies": [
                {
                    "author": "VishnOx",
                    "body": "*tattoo choice noice* \n\nThis sounds INCREDIBLE! And quite thorough. I’m curious, how do you keep a track of this? It seems like quite an intensive process - also if I take into account your D&D experience it all makes sense. Haha. But still curious.\n\nLacking in life aspects - this interests me a lot. I’d love to know more because personally, if I’ve managed to ‘fix’ one part of my life it’s because I’m neglecting another. It’s a serious problem that’s led to issues with health, relationships, caring for my pets, work… the list goes on.\n\nAnother thing - how have you accounted for days of mental paralysis? A friend once pointed out that I needed to learn to reset myself multiple times over the course of a day - “If you reset once everyday, you lose a day. But if you reset multiple times you only lose a couple of hours.” - it seemed like sound advice until I tried to put it into action and I just couldn’t work out a system for it.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "silvaras_12",
                            "body": "Thanks! I have set it up with a habit tracker app that allows me to, instead of tracking a specific action like working out, playing an instrument or meditating, just tick an option for an unspecified \"health\" or \"mind\" or \"spirit\" task, and once a week I go through the process and upload it to the character sheet. I intend to develop a way to do this automatically but for now it is a manual process.\n\n\nThe way I noticed this is helping me the most is that I am more present when I do things because I have to think about which category it belongs to and how big the action is, instead of autopiloting most of my day, which has led me to procrastinate and have anxiety before. \n\n\nThe balancing part is just that I get a sort of a weekly overview of what I have and haven't focused, so if I don't get many exp for social or family it means I have to call my parents a bit more or set up dinner with friends for example, and for the days of mental paralysis... I have had a couple lately and I noticed that even by just doing a few things that earn exp I didn't feel like I wasted all of the day, but I always try not to be too hard on myself, have objectives and try to work towards them. My motto is that one step back doesn't invalidate all the previous hard work.\n\n\nI think some of the apps for habit tracking can be good, but we need to be creative on the approach of how to use them, otherwise they get boring really fast.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "johnnyorange",
            "body": "I’ve been told to *gamify* my life to *help me forget* as it’ll “*be so fun*.”\n\nI could never get past the suspension of disbelief that they were just trying to make things a touch easier for the lab rat aka moi",
            "score": 3,
            "replies": []
        },
        {
            "author": "_Which-Secretary_",
            "body": "I have used and still use gamification, but only with limited success. \n\nIt usually works in the long term if there is an objective value or level that I want to reach or exceed. For instance, it works wonderfully in managing my type 1 diabetes because there is a range where I want my BS to be that I can change, also levels, results I can improve (or at least try to), and if you break down the whole thing, there aren't many options to choose from in any actual moment.\n\nIn contrast, it is a complete failure, when the goal is to establish or maintain a routine or a habit.",
            "score": 2,
            "replies": [
                {
                    "author": "-AllCatsAreBeautiful",
                    "body": "Good point on externalising the goal & with real consequences -- not just breaking the streak or not levelling up on some arbitrary thing, but getting results IRL instead.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "_Which-Secretary_",
                            "body": "or with rewards/positive feedback.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "VishnOx",
                            "body": "What does externalising the goal mean exactly?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "paprikahoernchen",
            "body": "That's why I'm using Habitica xD",
            "score": 2,
            "replies": []
        },
        {
            "author": "ChartreuseZebra",
            "body": "I try, once in a while. But did you know that you can just lie to yourself about what you've done and what you deserve?   \nSure I said I'd only get this reward if I did these 4 chores, and I only did the 3 easy chores, but what if I just had the reward anyway? 3 out of 4 is pretty good. And the reward is right there, I literally have it already. And as long as no one knows that I'd planned to accomplish that fourth chore there's not even anyone to be mad.\n\nHabitica and Finch both worked until I figured out I could just check the box on Habitica to get the XP, and there's no consequence to not finishing your tasks in Finch.",
            "score": 2,
            "replies": [
                {
                    "author": "VishnOx",
                    "body": "Oh yeah. Things are starting to seem bleak for me now because all of the ways to cheat the system mentioned in some of the comments, including this, are things that I’m guilty of doing.\n\nI approached my studies the same way throughout my school days. And when I got into college for UG, the accountability that my parents provided was also severed, so I was a loose cannon. Kept everything for the 11th hour - preparations, submissions, getting into class, waking up - and then I figured it’s okay if I lose a few marks or just not turn in my assignments and that led to a completely different outcome. \n\nPG was even worse. The guardrails were off, and the freedom was too much to handle without having an internal system of accountability.\n\nThis continued into my professional career and then finally at 33 I got diagnosed and things started to make sense. I’ve only just reached a point where I’ve managed to curb some of my most destructive tendencies and looking to invest into systemic changes - internally and environmentally.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "fr4gge",
            "body": "Since I hate both anime and rpgs this just isn't for me",
            "score": 1,
            "replies": []
        },
        {
            "author": "Safe_Toe_3422",
            "body": "Does not work at all for me, i always think to myself, why do I have to wait for the rewards, I can just get this now.",
            "score": 1,
            "replies": [
                {
                    "author": "VishnOx",
                    "body": "I feel so seen. This is exactly my experience. Also I think you’re specifically describing the rewards system with delayed gratification, which I’m doubtful would work for anyone with ADHD - maybe for a small percentage of people. Contributes to ADHDers having shit financial control.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dadewitt3",
            "body": "In finances and it has been utterly game changing",
            "score": 1,
            "replies": [
                {
                    "author": "VishnOx",
                    "body": "Details please?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lol_cookie_22",
            "body": "I try to make my weight loss journey into a game! Like I get rewards every time I lose a kg, or other things like for example when I walk 10k steps for the whole week I get a reward for the end of the week💓 but the reward is not food related it’s like maybe a small lip gloss or just a small item or every time I reach a goal I add a new thing to my SHEIN cart, it keeps me motivated to loose weight, I have been doing this for 2 months now and I am already 6kg down!! I am so proud of myself and I see a big difference in my body, making my journey into a game makes the journey much more enjoyable and exciting!🥳🥳",
            "score": 1,
            "replies": [
                {
                    "author": "VishnOx",
                    "body": "That is some EPIC achievement!! Congratulations!!! How do you approach it on the daily? Like getting the motivation to do the deed (as part of a routine or at a planned time)?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Lol_cookie_22",
                            "body": "Aww, thank you so much!! 💖 Honestly, I stay motivated every day by treating my weight loss journey like a little game! 🎀 I set small goals (like walking 10k steps a day or losing a kg), and when I hit those, I reward myself with something cute, like a new lip gloss or adding a fun item to my SHEIN cart! 💕 It keeps things exciting and helps me stay on track. As for how I approach it daily, I try to make it part of my routine by planning when I’ll do my steps or workouts (usually at a set time, like in the morning or after class) so it becomes a habit! It’s all about making it fun and keeping that motivation up with fun rewards! ✨ That way, I actually look forward to it every day! 💫",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "irl_potate",
            "body": "Such a good anime but i can't seem to find it anywhere besides Netflix and Crunchyroll and I'm a baller on a budget T-T could never finish it ugh",
            "score": 1,
            "replies": [
                {
                    "author": "VishnOx",
                    "body": "Oh you’re looking for [Stremio](https://stremio.com) ;) thank me later.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Safe-Split-9572",
            "body": "35M, my 14 yr old daughter and I both take concerta, Im a compulsive maniac and shes inattentive. We have gameified our chours   bc we both hate them and nothing was getting done, plus my 5yr old daughter is no help either 🤣 so we do time trials and made a point system and such and whoever ends up with the most points at the end of the week gets 25 bucks( well she gets 25 bucks and I get to take some of my money back from the swear jar) and also gets to pick where to eat Saturday night. We also recently introduced trophies for longest winning streak,  all time shortest completion time ect.. it's actually been pretty sweet and affective 👌",
            "score": 1,
            "replies": [
                {
                    "author": "VishnOx",
                    "body": "This is so wholesome! Thank you for sharing this. Also the *swear jar* 🤣. Do you have any other such systems you’ve managed to come up with for you as an individual?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Safe-Split-9572",
                            "body": "Well I'm really lucky to enjoy my career choice so I haven't had trouble with at. I took  a chance and quit college my sophomore year bc i fuckin hated it and went to work for a commercial painter. 7 years later I started my own painting company and after a few shitty years at the beginning I started doing well. I look at my job as a sort of game in itself bc the the better job I do the more likely I am to get a recommendation for  job of someone my customer knows. Also the faster I get done the faster I get paid and can move on to the next job before I get bored. I was diagnosed at 33 so my life choices and actions started to make alot more sense and also it was a huge help in recognizing that my oldest daughter also was showing a lot of symptoms so I was able to help her understand herself a little more and get her a diagnosis. I got my eye on that 5yr old too, shes a little TOO much like me 🤣",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Safe-Split-9572",
                            "body": "Also sorry  for all the cursing but I gotta get it out somehow. It's free if I type it, if I say it I'm screwed.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "VishnOx",
                                    "body": "I think you still owe a donation to your swear jar 🤣 not that I mind the swearing at all hahaha.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Safe-Split-9572",
                                            "body": "But fucks are 5 bucks a peice!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}