{
    "title": "lack of energy",
    "author": "jessbain29",
    "subreddit": "ADHD",
    "rank": 143,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.reddit.com/r/ADHD/comments/1j41ven/lack_of_energy/",
    "id": "1j41ven",
    "selftext": "hey everyone, I've got a bit of a back story for this question but I've got adhd, aspergers and psoriatic arthritis in my back joints. I constantly feel like I have no energy which I know is a symptom of all of those conditions, but mine is to the point where I have to literally talk myself into doing simple tasks like moving my hand, for example, my phone needs charging and my charger is right next to me. I start going through the pros and cons in my head of Wether or not I should grab my charger and I have to talk myself into doing so, I know I want to do it but I feel like I physically can't, its like I'm yelling at myself to move my hand and my hand won't do it. is this normal orr? I know it's not laziness because I can tell the difference between not wanting to do something and wanting to do something but feeling like I physically can't. any advice would be great, thanks! also sorry if this is confusing or makes no sense, im not great at making sense lol",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/jessbain29 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "jessbain29",
                    "body": "thankyou, I was diagnosed as a child and I got put on Duramine I think because I could never concentrate, after I started taking it apparently I didn't eat or sleep and I got really angry and moody all the time out of nowhere so my mum stopped me taking it as she thought it wasn't worth me having it if it was going to make me behave like that. I haven't tried anything since as it's only been in recent years I've started having noticeable problems with it, as a kid I never noticed but as I'm 18 now it's affecting my everyday life, im thinking of speaking to my doctor about it and seeing if there's anything I should do.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "jessbain29",
                                    "body": "I definitely will, thankyou for that it helped a lot! :)",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Fun_Investigator9412",
            "body": "Check for sleep apnea, which is repeated suffrocating during sleep. It's a rather serious condition leading to fatigue and lack of energy during the day.",
            "score": 1,
            "replies": []
        }
    ]
}