{
    "title": "I need a strategy for distraction",
    "author": "Own-Definition2438",
    "subreddit": "ADHD",
    "rank": 140,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/ADHD/comments/1j42osx/i_need_a_strategy_for_distraction/",
    "id": "1j42osx",
    "selftext": "So normally, my strategy for online usage woudl be a browser blocker during certain hours.  Which I used to do but haven't in some time.  The reason for that is I've been doing a lot of trainings and research on Youtube, so it didn't make sense to turn it off.\n\nIt's been ok, until now.  Now, I'm trying to start an ebay store, and am spending a lot of time online posting.  So I can't block Facebook, because i\"m posting on Marketplace. I can't block Youtube, because I'm researching item value, shipping strategies and so on.   But then I find myself watching reaction videos or fashion videos or cats or Jon Stewart or....\n\nToday I\"m going to focus on being time-blocked and disciplined (a strategy that does work when I use it).  But I sat down to do something else, and just killed a half hour reading facebook posts about watercolor and cats and didn't even know it went by.\n\nOutside of meds, which aren't an option for me,, or a shock collar (ha) does anyone have a suggestion?  This is critically important because I need to be working and productive, not in distraction.  thank you\n\nMel Robbins suggests setting the display to grayscale. Going to see if that helps",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/Own-Definition2438 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Atthewall",
            "body": "Time blocking is a good start! You could also try setting strict goals for how long you’re gonna spend on specific apps or content. Consider a tool like FocusPledge to help limit distractions on your devices if you’re using an iPhone.",
            "score": 1,
            "replies": [
                {
                    "author": "Own-Definition2438",
                    "body": "Great idea. I'm on a macbook but there are probably similar programs.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}