{
    "title": "Sudden feeling of just \"nothing\"",
    "author": "MooCowDivebomb",
    "subreddit": "ADHD",
    "rank": 29,
    "score": 9,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.reddit.com/r/ADHD/comments/1j460rj/sudden_feeling_of_just_nothing/",
    "id": "1j460rj",
    "selftext": "I was curious if others experience this sensation. Some days I will get up and just feel nothing. I wouldn't call it depression, it's just a feeling of nothingness. No emotions, no motivations, no bad feelings either. Like you are just sitting inside your own body waiting for it or your brain to do something. I find this happens a lot more on the weekends and I need to take my medication to snap out of it.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/MooCowDivebomb and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "KingDaffid",
            "body": "Yes, I call it vacancy.",
            "score": 4,
            "replies": []
        },
        {
            "author": "IdaKaukomieli",
            "body": "Yes! Had one of these earlier today! Went from brain doing conspiracy theories to that feeling you get when a plane exits the cloud and there's just blue everywhere, or the feeling of mirror still lake. It's kinda pleasant, and usually doesn't last very long. Sometimes it turns into autistic shutdown instead, and that's a whole different animal. But to me those two are related because both have the same feeling of stillness. I think of it as my brain doing a lil reboot.",
            "score": 2,
            "replies": []
        },
        {
            "author": "thegundamx",
            "body": "I experience this too. When it happens I start stimulus seeking, looking for something that will hold my attention. Sometimes nothing works and then I just rewatch an old show or youtube video.",
            "score": 2,
            "replies": []
        },
        {
            "author": "copudhjjhhcchhchc",
            "body": "Yes in fact I was having this feeling while reading this.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Lucilla_Inepta",
            "body": "Yeah, when it happens I often just sit in silence for half an hour cause I just can’t bring myself to do anything",
            "score": 1,
            "replies": []
        },
        {
            "author": "Twentie5",
            "body": "yeah, my thoughts hit my feet.. ground.... some say its moment of clarity too",
            "score": 1,
            "replies": []
        },
        {
            "author": "Historical_Metal_807",
            "body": "I know exactly what you mean. It’s like being stuck in standby mode—just existing, but not really there. No emotions, no urgency, just this weird empty state where even thinking feels like too much effort. It’s not sadness, not boredom, just… nothing.\n\n\nFor me, this happens most when I don’t have structure, like on weekends when there’s nothing forcing my brain to engage. Meds help snap me out of it, but if I don’t take them, I just drift. Sometimes, even after taking them, I still need something external—like a podcast, music, or even a random task—to pull me out of the void.\n\n\nIf you relate to this, this video really captures the weird way ADHD meds can make such a huge difference between feeling present and feeling nothing: youtube[dot]com/watch?v=bQ_wDpISzGY. You’re not alone in this.",
            "score": 1,
            "replies": []
        }
    ]
}