{
    "title": "How do you translate your thoughts to words?",
    "author": "devilcollar",
    "subreddit": "ADHD",
    "rank": 114,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 7,
    "url": "https://www.reddit.com/r/ADHD/comments/1j47yw6/how_do_you_translate_your_thoughts_to_words/",
    "id": "1j47yw6",
    "selftext": "I'm not even sure if that title makes sense funny enough. Although I don't struggle as much with getting my thoughts down over text. Trying to speak or explain something out loud often ends in embarrassment for me. I know what I want to say in my head but it often comes out so jumbled and rushed that it confuses others and leaves me feeling stupid (pair that with RSD..not fun).. It's the biggest reason I don't talk much unless spoken to...which I'm sure is making things worse lol.\n\n\nI've always assumed this was tied to my ADHD and/or social anxiety. My thoughts are all over the place and they rush to get out. I take 10mg adderall twice a day but I don't feel like it helps that specific aspect. How do I work on this? Do I just have to power through and force myself to speak out loud more? ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/devilcollar and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "devilcollar",
            "body": "Sorry this is my first post on this sub and I wasn't aware RSD was even a contested topic.",
            "score": 2,
            "replies": []
        },
        {
            "author": "PawBeansWorkshop",
            "body": "I have some challenges translating thoughts into words. It's slow to think thoughts in English compared to what I call Primordial Word Goo, or just the flow of ideas, images, shapes, and wordless thoughts. There's a few things I've noticed about this.\n\nThe more stuck I'm in my head, the harder it is to translate thoughts into English. On bad sleep days, when hungry or overwhelmed, it takes quite a bit more effort to transition ideas into words.\n\nWhen I feel more present and aware of my body, it's much easier to come up with words. Mindfulness, yoga, and exercise all help to feel more in tune with the present and might help.\n\nThe advantage of not thinking in words is that it's much faster to process thoughts. English has an impressive number of words in the language, but it limits possibilities and idea construction. It's a skill to be able to feel more present, and it may allow you to feel more comfortable starting conversations.",
            "score": 2,
            "replies": [
                {
                    "author": "devilcollar",
                    "body": "This makes so much sense...because I'm ALWAYS stuck in my head. It's incredibly hard for me to be in the moment or present all the time. I thought that would make communication easier--my inner world is so tangible to me it should be easy to communicate to others. But the Primordial Word Goo is not easily translateable. Thank you, this genuinely gave me a better understanding of my thought process. The hard part will be pulling myself out of the goo.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "PawBeansWorkshop",
                            "body": "I'm glad it helped! It's a rare conversation topic, so I was glad to contribute. One last thought, feeling present is a skill. With practice, it can eventually be used outside to feel present even when at school or work. Nidra yoga is a super chill way to start practicing feeling present at home. Hatha yoga is great, too. Anything that allows you to notice the signals of how your body feels will help get you there. Best of luck!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AutoModerator",
            "body": "Please be aware that RSD, or rejection sensitivity dysphoria, is not a syndrome or disorder recognised by any medical authority. \n\nRejection sensitivity dysphoria has not been the subject of any credible peer-reviewed scientific research, nor is it listed in the top two psychiatric diagnostic manuals, the DSM or the ICD. It has been propagated solely through blogs and the internet by William Dodson, who coined the term in the context of ADHD. Dodson's explanation of these experiences and claims about how to treat it all warrant healthy skepticism.\n\nHere are some scientific articles on ADHD and rejection:\n\n* [Rejection sensitivity and disruption of attention by social threat cues](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2771869/)\n* [Justice and rejection sensitivity in children and adolescents with ADHD symptoms](https://pubmed.ncbi.nlm.nih.gov/24878677/)\n* [Rejection sensitivity and social outcomes of young adult men with ADHD](https://pubmed.ncbi.nlm.nih.gov/17242422/)\n\nAlthough r/ADHD's rules strictly disallow discussion of other 'popular science' (aka unproven hypotheses), we find that many, many people identify with the concept of RSD, and we have **not** removed this post. We do not want to minimise or downplay your feelings, and many people use RSD as a shorthand for this shared experience of struggling with emotions. \n\nHowever, please consider using the terms 'rejection sensitivity' and 'emotional dysregulation' instead.\n\n^(*A moderator has not removed your submission; this is not a punitive action. We intend this comment solely to be informative.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "432ineedsleep",
            "body": "It might be a good idea to practice speaking. And I don’t mean just throwing yourself into conversations. Specific exercises, such as reading out loud, purposely slowing down the pace you’re speaking at, catching when you make filler sounds (words or sounds used to fill in the silence while you process what you want to say. examples: um, like, uh, er, sorta, basically) and intentionally pausing until you find the right words. It’s just to train your brain to be more mindful of what it’s saying, or at least to make sure your sentences are coherent when you speak out loud. I got these things from a public speaking class, but they have helped me when talking to other people one-on-one.",
            "score": 1,
            "replies": []
        }
    ]
}