{
    "title": "How do you live life knowing you can't do it all?",
    "author": "lolxd194",
    "subreddit": "ADHD",
    "rank": 20,
    "score": 8,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 17,
    "url": "https://www.reddit.com/r/ADHD/comments/1j4bod0/how_do_you_live_life_knowing_you_cant_do_it_all/",
    "id": "1j4bod0",
    "selftext": "It's been almost a months a since I've been diagnosed with ADHD and what I've realised is that my own nature now makes so much sense to me...\nI'm much more at peace with myself \n\nBut...\n\nAt the same time, I don't in actual sense don't know what am I doing and what interest do I actually want to pursue. \n\nCurrently I live in shared living situation and I barely get by with my current salary as a graphic designer.\nI know I'd do much better as a freelancer but I lack the discipline (obviously) as well as the confidence to do it.\n\nAnd on top of it all I can't seem to focus with all my interests piling up in my subconscious, it feels as if I get by 2 days with a good routine where I meditate, exercise and everything and the. I'm back to struggling to get off my bed the 3rd day.\n\nCurrently I'd somehow like to pursue creative coding, learning how to dj, learn how to be social and date more (haven't really had much dating life)\nAnd just be a different person and I know that I need to get a better place and get my career in line first but...\n\nIt's just that I don't really know how to do that..\n\nShould I change career, just live one day at a time right now and try learning new things everyday or struggle and force myself to do things that I'm not interested in, which is pretty much futile. \n\nI don't know what to do, help me. I get into tarots and they all tell me different things because I think my energy fluctuates so much that I don't know who I am anymore maybe.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/lolxd194 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Future-Translator691",
            "body": "I’m not sure if this was a life hack, or luck, or just different effect of ADHD. It feels like to me that your job is not motivating enough for you so your brain is trying to find that stimulation and motivation somewhere else. I had to try a few things to get to the right one - but when you find the right thing for you every little aspect of your life seems easier (waking up, getting ready, doing what you need even without a super structured work environment). I feel the place where I’m at my best is work 😂 I get it, I can do it, I can feel good about myself. So maybe that’s somewhere to start - looking for something slightly different? Maybe different structure/ environment/ creative content of the job? Saying that, I am a life long struggler with getting out of bed - although definitely having something good to look forward to helps!",
            "score": 4,
            "replies": [
                {
                    "author": "lolxd194",
                    "body": "I think now that I think about it, I feel I've been bored of my job for so long and as soon as I joined it felt as if I was bored out of mind. The thing is that right now I don't know what even interests me anymore, I'm scared that what if I leave it too and all this time would be wasted",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Future-Translator691",
                            "body": "I know it’s hard, but don’t tell yourself you wasted time. I feel everything I lived was useful and brought me to my next place. I gave up my first uni degree because I felt like I would never be happy doing that and would feel too much like a failure. So I literally gave up in my first year and found a new degree. That degree was amazing, I loved it, I did great. Then that opened doors to a slightly different thing - and I went and did that. I do always keep working so I don’t just throw myself at things. But when I know I’m not happy/stimulated I start looking at new possibilities - go for interviews. Just give it a go because it might bring unexpected happiness! I started in a classic sciences field and ended in healthcare and now higher education. It all made sense at each step and I’m very happy now. I feel each part helps you understand more what you like and what you don’t like. How your brain works better and how it really doesn’t. So every experience is important",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "lolxd194",
                                    "body": "Woah, that's actually a nice approach. I've been wanting to try coding for a while now, maybe I'll give that a try while I finish my current course that I too head on just because I want to freelance because I'd really like a lil more money, to live in a better place.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Future-Translator691",
                                            "body": "You must have noticed I’m a positive person 😂but another thing I’ve been recently trying is because I will have 100 ideas of things to do - even at work or home etc, and I know it’s just not possible but how can I not pursue all these interesting things. So I’ve started doing expectation management to myself. For example if I have 5 new ideas I know I will just keep 1 or 2 - but I accept it’s ok to have loads of ideas and things to choose from later on. And that also not all project ideas will be good anyway - so I think about the various interests as a positive but fully knowing I will never do it all. I feel ADHd for me - being diagnosed as an adult as well - it’s a lot about acceptance - accepting myself as I am and not feel guilty about every single “failure”. So just to add that it’s fine we can’t do it all - no one can!",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "lolxd194",
                                                    "body": "Yeah, maybe I don't or can't do all that and that's something new to me as tbh I was just recently diagnosed and still learning the ways I can regulate myself.\n\nExpectation management feels like a right term that'd help me for years to come lol. It makes me sad that I can't do it all but I'm human and got a few disadvantages when compared to a god.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Future-Translator691",
                                                            "body": "Exactly 😂 also I think I used to feel “I can’t do it all but others are doing it” - now I think it’s more “I would like to do a lot more things than the average person so I obviously can’t 😂” I mean I do have a few degrees and quite a few different jobs experience - so probably already doing a lot compared to a lot of people although some people are more god like level indeed!",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "imasensation",
            "body": "You can if you try",
            "score": 1,
            "replies": [
                {
                    "author": "lolxd194",
                    "body": "Can you be more specific on the how?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ed_Blue",
            "body": "You wait for the adderal to kick in. /s\n\nIt can actually help though.",
            "score": 1,
            "replies": [
                {
                    "author": "lolxd194",
                    "body": "My doctor won't prescribe it to me",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Ed_Blue",
                            "body": "Like, any stimulants whatsoever? Depending on what his stance and reason is i'd just try a different dr. and talk to a psychologist to document your symptoms beyond diagnosis. Anything that you already have on paper can help cutting waiting times if you mention it in your initial phone call or e-mail.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "KittenBalerion",
            "body": "have you seen the [11 lives comic](https://www.smbc-comics.com/?id=2722)?",
            "score": 1,
            "replies": [
                {
                    "author": "lolxd194",
                    "body": "I never open random internet links but this. Comic was kinda eye opening \n\nThanks",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok_Stable4315",
            "body": "Throw the cards away, if you believe in anything spiritual then believe me when I say they’re from darkness. I’ve been in spirituality and healing and never ever got a good message about tarot cards. It’ll mess up your energy even more and lead you to worse paths. If you crave anything spiritual read the Bible (new living translation version) or try to understand God through prayers. Don’t wanna come off as “that Christian” but it’s genuinely what I’ve learned from 8 years in the energy healing.\n\nI know a way of how to find your identity but I’ll come off as “that Christian” again so I’ll let you ponder on that a bit. But I found a way that worked for me.\n\nAs for work, you need to be able to make a living. Find something you don’t get repulsed by. That’s an indicator of a good fitting work for you. If you can manage a week or a month and not get repulsed by it on though days I’d say it’s a keeper. You can try several jobs but the work market is really not good currently. So just keep doing what you do for now for a while maybe while trying out part time jobs.",
            "score": -1,
            "replies": [
                {
                    "author": "lolxd194",
                    "body": "I think keeping your doors open is a part of it. Being flexible and all. Thanks \n\nAlso, can you please share the way you found your identity? I promise not to put you in that category",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}