{
    "title": "Meds Working Great, but Feeling Weirdly Apathetic Outside of Work",
    "author": "Dapper_Form_2330",
    "subreddit": "ADHD",
    "rank": 74,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 1,
    "url": "https://www.reddit.com/r/ADHD/comments/1j4er90/meds_working_great_but_feeling_weirdly_apathetic/",
    "id": "1j4er90",
    "selftext": "Hey fellow ADHDers,\n\nI’ve been on Elvanse/Vyvanse (40mg) for about three months now, and it seems to be my ideal dose—long-lasting, no side effects, and overall, it has improved my life significantly. Uni is going better than ever, and my student job is both enjoyable and well-paying.\n\nHowever, for the past two weeks, I’ve noticed something odd: outside of work and responsibilities, I have zero interest in anything. My hobbies, relaxing, even just aimlessly scrolling—I don’t feel like doing anything. It’s like my brain just shuts off fun mode. Once the meds wear off, I mostly feel... bored. I do take days off medication (usually 2 days a week). \n\nThis is weird because I’ve always been someone who could easily find ways to spend my time. I’ve had tons of hobbies and never struggled with finding something to be passionate about.\n\nFor context: I have a history of depression, but ever since my ADHD diagnosis at 22, I haven’t really struggled with it. I know what anhedonia feels like, and while this resembles it a bit, I’m confident this isn’t depression. I feel balanced, emotionally stable, and objectively, life is going well—1.0 GPA at uni, a fulfilling student job—yet everything suddenly feels so monotonous?\n\nI know this isn’t the worst issue to have, and I’m not trying to complain—I’m just genuinely confused. Has anyone else experienced this on Vyvanse? Is this an ADHD thing, a med thing, or something else entirely? Would love to hear your thoughts! ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/Dapper_Form_2330 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        }
    ]
}