{
    "title": "Casa Maria Mortar & Pestle",
    "author": "CommentOld2140",
    "subreddit": "Costco",
    "rank": 17,
    "score": 8,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 18,
    "url": "https://i.redd.it/ov43vbod4ipe1.jpeg",
    "id": "1jedv3p",
    "selftext": "Got the Casa Maria mortar & pestle from Costco but can’t find too many solid review online. \n\nHas anyone bought this product - what are your impressions? \n\nI’d like to use it for the usual dips, sauces and for grinding spices. I also want to make fresh traditional pesto, but not sure if granite stone is the best material for pesto. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Posts that do not follow r/Costco subreddit rules **MAY** be subject to removal. \n\n**Reminder: No vague or non-descriptive post titles or availability questions.**\n\nWhen applicable, please make sure that you're using a descriptive post title with product name(s) and/or exact question mentioned as it yields better subreddit search results. \n\n**Including item number, price, and approximate location or region where found is also helpful since product availability can vary.**\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Costco) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "GreedyWarlord",
            "body": "Not a fan of the design on these. I checked it out in person and the pestle is way too short and the shape is off. I also didn't like the quality of the granite. You're better off just spending money on a good Molcajete.",
            "score": 16,
            "replies": [
                {
                    "author": "CommentOld2140",
                    "body": "I had a feeling it wasn’t ideal when I unboxed it. Just wasn’t quite sure what was off. My husband already threw out the packaging, so hope Costco accepts my return (I haven’t cured or used the product yet).",
                    "score": 2,
                    "replies": [
                        {
                            "author": "GreedyWarlord",
                            "body": "They will. Just explain what happened. You can give it a shot and see if you like it but I personally didn't like the materials used and the size of pestle when I checked it out.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Long-View-7989",
            "body": "Not sure if this comment is any good and can’t comment on the quality but I saw it in store for $23 yesterday.",
            "score": 6,
            "replies": [
                {
                    "author": "CommentOld2140",
                    "body": "Yes, I saw it for the same price and picked it up since it looked to be a good deal. I’ve been wanting a M&P for a while, but didn’t want to fork over more than $50 for a decent one. $23 looked to be a steal, but am just not sure if people are keeping the item vs. returning.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Long-View-7989",
                            "body": "I bought one from Costco few years ago (not sure if it’s the same brand but looks very similar) and it’s well worth the price for just $23",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "chrischanhanson",
            "body": "I will buy it at death star $5 price",
            "score": 5,
            "replies": []
        },
        {
            "author": "Ok-Seaworthiness4488",
            "body": "I've read common complaints are about how short the pestle is",
            "score": 4,
            "replies": [
                {
                    "author": "mufc4lyf",
                    "body": "Hey, we've all been there!",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "RJValdez216",
                    "body": "Hey now, It’s not how long your pestle is, it how you use it that matters",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "CommentOld2140",
                    "body": "Interesting. I wonder if that can be corrected by getting another pestle. The underside trough looks to be for grinding spices and maybe the original pestle is better suited for that purpose.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Logical_Warthog5212",
            "body": "I bought one years ago when it was only one sided. It was the same Casa Maria brand. I just can’t remember how much I spent. I want to say less $10. Maybe even around $5. I remember that it was around Cinco de Mayo and it was a really good sale price. I haven’t had any issues with it. I use it often during gatherings to make and serve guacamole in it. I’ve also used it to mash or grind other herbs and spices with it. I have no complaints.",
            "score": 2,
            "replies": []
        },
        {
            "author": "mtch43",
            "body": "Note that this thing is HUGE. I got one thinking I would leave it on the counter and use it mostly for spices but it’s way too big for that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lorbmick",
            "body": "Don't ever make guac in a mortar pestle. It'll turn into an ugly brownish green color. Ruins a beautiful bright green dish into that monstrosity.",
            "score": -2,
            "replies": [
                {
                    "author": "CommentOld2140",
                    "body": "Oh I didn’t know this, I was thinking it has to do with the oxidation process. Wouldn’t adding a bit of lime or other citrus help prevent this? I thought Mexican restaurants use the molcajete to make some of the best guac, but I can’t confirm.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "TheHeatWaver",
                            "body": "I've used this exact one to make guac and it comes out perfectly green. I thought it was fine for the price and I liked the large size that easily held 5 avocados in it. Though the pestel is a bit short like some others are saying.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Lorbmick",
                            "body": "They'll use a mortar and pestle for making salsa and grinding up spices. I know Rick Bayless doesn't use a mortar and pestle to make guac. But, it's your kitchen and you're the chef.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}