{
    "title": "Lots of snow in Sierra Nevada Spain :)))))",
    "author": "BuenaVida095",
    "subreddit": "snowboarding",
    "rank": 16,
    "score": 59,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 6,
    "url": "https://v.redd.it/tyr4jikzffpe1",
    "id": "1je20ce",
    "selftext": "",
    "comments": [
        {
            "author": "SwedishSanta",
            "body": "Just as Japow season is ending here, it seems to have started in Sierra Nevada. 2m Fresh, right? Enjoy!",
            "score": 6,
            "replies": [
                {
                    "author": "BuenaVida095",
                    "body": "the winter season is ending in April, but march is historically a month when big snowfall occur. the snow depth is around 85-300cm.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "martin_cy",
            "body": "wow looks crazy!! is that why only a few lifts are open, too much snow too quickly?\n\nI assume you are a local? or have visited it?  \ncurious about the resort as a whole.. going to the official website (https://sierranevada.es/en/) was interesting learning something new every day. would be nice to learn a bit about the resort, slopes, lifts, is it crowded? when is it the most/least busy? which months would your recomend people to go for best overall experience? (p.s. I'm one of those that do not care at all about the \"party life\", after I've spent 8-10 snowboarding I just want to eat and go to sleep and do again next day :D)",
            "score": 2,
            "replies": [
                {
                    "author": "BuenaVida095",
                    "body": "I am not Spanish, but i have snowboarded in Sierra Nevada around 20 times (many years ago). I like to follow snowfalls around Europe, and at the moment, both Portugal and Spain are being hit with back to back storms, that are bringing in lots of rain and lots of snow in the high altitude regions.\n\nThat being said, I am probably not the best person to inform you about the resort, but personally, I do I like it very much, even though it can get crowed at times, specially the Beginners area and maybe the main slope (Rio) that connects Borreguiles to the Village (Pradollano). I think its a pretty friendly beginner resort with plenty of green and blues pistes. The lifts are modern as far as i remember and March is my preferred time to visit.\n\nIt is also the sunniest ski resort in Europe.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Few_Bags",
                            "body": "username checks out",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "YoloSwagersaurus",
            "body": "Really great to see this, we also got really good snowfall up in the Pyrenees!",
            "score": 2,
            "replies": []
        }
    ]
}