{
    "title": "Need Advice on Arm Control",
    "author": "SashaDieryckx",
    "subreddit": "snowboarding",
    "rank": 6,
    "score": 46,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 28,
    "url": "https://v.redd.it/nnj89ong1ipe1",
    "id": "1jedgj6",
    "selftext": "Took a 4year break from snowboarding due to school & work and not being able to access the hill. Was able to get back into it this season and am looking to progress further in the park. \n\nBeen getting lots of reps in this spring but I can’t seem to figure out how to control my arms. Need some advice. I don’t want to look like I’m hitting the griddy when I slide off every rail. Any tips / feedback would be appreciated. ",
    "comments": [
        {
            "author": "Chednutz",
            "body": "Start with mellow stock tricks and work on keeping your arms down. I'm talking real mellow like Boardslide, front board, nosepress, backside 180s. It's harder to keep your arms from flailing when doing bigger and more tech tricks. Keep doing reps. The more comfortable and controlled you are doing tricks the easier it will be to control your arms.",
            "score": 23,
            "replies": [
                {
                    "author": "SashaDieryckx",
                    "body": "Thank you for the reply 🙏🏻, going to go up tmr choose a down-rail, hike it, and focus on just this",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Chednutz",
                            "body": "Honestly you're off to a really good start and it won't take much to clean up your style. If you want some inspo on what to do with your arms, watch some Tommy Gesme footage.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "SashaDieryckx",
                                    "body": "Will do, thanks again!",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "buchaguzzler",
                    "body": "Best advice here, just learn how to basics while basically sleeping on features and it’ll eventually translate when throwing tech tricks. No way to completely remove arm flair tho, especially when spinning more, embrace it and integrate it into your style",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "EVH_kit_guy",
            "body": "Hands down is a lifestyle \n\n\nhttps://youtube.com/shorts/M5JkD36F0O0?si=Gzn-SmdWnNstSMxm",
            "score": 18,
            "replies": [
                {
                    "author": "SashaDieryckx",
                    "body": "Crazy steez😫",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "LeGrandePoobah",
                    "body": "Never seen that before, LOL!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "fvckspeak",
            "body": "just stick them in your pocket like a chill guy",
            "score": 10,
            "replies": [
                {
                    "author": "SashaDieryckx",
                    "body": "Honestly I’m going to try and get a clip of this tmr and see how it goes😅",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "AssGagger",
            "body": "![gif](giphy|14ytbNcL4X2gVi)",
            "score": 6,
            "replies": []
        },
        {
            "author": "LeGrandePoobah",
            "body": "Stance and balance is the key to keeping arms low. On some of those rail shots- you are hunched way over, that of course, means that you’re not balanced very well on your board. A nice stacked posture will greatly decrease your need to have your hands up high. With all this said- if you jump, usually arms go up with your body going up. So, a lot of it is just physics as well.",
            "score": 5,
            "replies": [
                {
                    "author": "SashaDieryckx",
                    "body": "Going to be more mindful of this tomorrow. So basically I should focus on keeping my back straight and my shoulders aligned with my feet?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "LeGrandePoobah",
                            "body": "Yup. A good trick we use when teaching others is to put hand on your hips (elbows out) and keep your elbows over your board at all times. Edge changes are all initiated with ankles/knees, not through rotating your upper body.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "SashaDieryckx",
                                    "body": "Thank you this is very helpful 🙏🏻",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Isaac_sux",
            "body": "Do a grab",
            "score": 3,
            "replies": []
        },
        {
            "author": "the_ghost_knife",
            "body": "You gotta get those elbows in so you can do the TRex steez",
            "score": 3,
            "replies": []
        },
        {
            "author": "The_Masterful_J",
            "body": "What hill is this, park is sick",
            "score": 2,
            "replies": [
                {
                    "author": "SashaDieryckx",
                    "body": "Camp Fortune in Chelsea Quebec! It’s honestly not bad but super small, they only have one good kicker and you have to bomb the entire run from the lift to even clear it. Personally I love the rail section it’s good for progressing. Best part about it is you’re pretty much dodging ski kids the whole time cuz the park run is also the bunny hill / main lift lol",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "InkyPoloma",
            "body": "I like your steez but if you want to have less arm flail, back when I did slopestyle competitions for practice occasionally we would to tie big bandanas to our belt loops and to our gloves.  Gives you a little movement so you can break a fall but won’t let you flail your arms.  Any sort of tether will work.  Start very basic, we started on I big wide ride on party box and went from there.",
            "score": 2,
            "replies": [
                {
                    "author": "SashaDieryckx",
                    "body": "Thanks g🙏🏻 That makes a lot of sense, Il see what I can find to tie em up and give it a shot",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Patthesoundguy",
            "body": "Dunno man, looking stylin' to my old school eyes",
            "score": 2,
            "replies": []
        },
        {
            "author": "Professional_Turn209",
            "body": "Might be just me but, I think hand flailing creates your own unique style.",
            "score": 3,
            "replies": [
                {
                    "author": "addtokart",
                    "body": "Yah I'm into it. Kinda shows the dynamics of what's going on",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "slightlychaared89",
            "body": "Smoke weed",
            "score": 1,
            "replies": []
        },
        {
            "author": "country_garland",
            "body": "Some good advice in here already, I’ll just add that a little core flexing and focus on keeping your body tight would also help",
            "score": 1,
            "replies": []
        },
        {
            "author": "glockster19m",
            "body": "Just keep at it.\n\nThe flailing comes from using them instinctually to balance, once you're comfortable enough to just balance instincually it'll come naturally \n\n\nNo different than flailing your arms for balance when you first learned to ice skate",
            "score": 1,
            "replies": []
        },
        {
            "author": "Interesting_Art_2174",
            "body": "My riding got better following the snowboardprocamp advice, hold the bottom of your jacket (not hands in pockets, but hold the bottom skirt) with both hands and it teaches you correct/better body language, but i cant say it was park advice, more riding advice",
            "score": 1,
            "replies": []
        }
    ]
}