{
    "title": "Rule",
    "author": "camnarok",
    "subreddit": "196",
    "rank": 11,
    "score": 356,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 50,
    "url": "https://i.redd.it/bkor2jvuyipe1.jpeg",
    "id": "1jehy9g",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "# REMINDER: Bigotry Showcase posts are banned.\n\nDue to an uptick in posts that invariably revolve around \"look what this transphobic or racist asshole said on twitter/in reddit comments\" we have enabled this reminder on every post for the time being.\n\nMost will be removed, violators will be ~~shot~~ temporarily banned and called a nerd. **Please report offending posts**. As always, moderator discretion applies since not *everything* reported actually falls within that circle of awful behavior.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/196) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "jennazed",
            "body": "Nancy Mace can go fuck off and while I normally agree with Kyle I also wont stand this bean slander",
            "score": 1,
            "replies": [
                {
                    "author": "ItsYaBoiVanilla",
                    "body": "He didn’t call the beans nasty, just the person eating them. Perhaps he doesn’t believe that such a nasty ass bitch deserves them?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "LeStroheim",
            "body": "\"47 never felt so good!\" - Diana Burnwood, in her bedroom",
            "score": 21,
            "replies": []
        },
        {
            "author": "bisexual_obama",
            "body": "Kyle what the fuck?",
            "score": 33,
            "replies": [
                {
                    "author": "Josgre987",
                    "body": "Nancy Mace is indeed a nasty bitch",
                    "score": 67,
                    "replies": [
                        {
                            "author": "bisexual_obama",
                            "body": "But what did the beans do?\n\nI thought we were a pro-bean subreddit.",
                            "score": 33,
                            "replies": [
                                {
                                    "author": "deformedexile",
                                    "body": "That doesn't mean Nancy Mace can have any.",
                                    "score": 35,
                                    "replies": [
                                        {
                                            "author": "killians1978",
                                            "body": "Is this the r/196 equivalent to inviting someone to the cookout?",
                                            "score": 10,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "enchiladasundae",
                                    "body": "Beans are for people who deserve them, not nasty ass bitches like Nancy Mace",
                                    "score": 13,
                                    "replies": []
                                },
                                {
                                    "author": "Dragonman0371",
                                    "body": "which is why we shouldnt allow nancy mace to tarnish the reputation of beans",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ibwitmypigeons",
            "body": "I genuinely have no idea who these people are.",
            "score": 1,
            "replies": [
                {
                    "author": "ItsYaBoiVanilla",
                    "body": "Transphobic congresswoman, idk who the guy is though",
                    "score": 1,
                    "replies": [
                        {
                            "author": "bisexual_obama",
                            "body": "Kyle Kulinski online left wing political guy.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "gibbonsoft",
            "body": "She belong on the severed floor wit a face like that",
            "score": 7,
            "replies": []
        },
        {
            "author": "Alceasy",
            "body": "Haha, chucklesome! What really strikes me here is the incessant and unnecessary cursing, surprising for such an otherwise family-centred and mild-mannered post. The fact that this woman, who seemingly has no connection to the R-rated world of cursing, is in fact called a \"nasty bitch\" for the non-transgression of ordering plentiful beans gives this post its humorous surplus value. Truly a classic of its time.",
            "score": 91,
            "replies": [
                {
                    "author": "killians1978",
                    "body": "Ah, I see where the misunderstanding is here. The OOP was commenting that it is, in fact, a lot of beans. The \"nasty ass bitch\" part is likely a reference to the fact that Nancy Mace is a nasty ass bitch.",
                    "score": 142,
                    "replies": [
                        {
                            "author": "Alceasy",
                            "body": "Wowzers! I was unaware that a name such as Nancy Mace was to mean something noteworthy! In my blind ignorance, I had presumed her to be yet another actress or maybe TV personality. Yet, my surface-level research confirms her status as a \"nasty ass bitch\"! I thank thee for alerting me to these nuances and wish you farewell.",
                            "score": 43,
                            "replies": [
                                {
                                    "author": "Pengu-Link",
                                    "body": "i checked out her twitter and was scrolling through a bunch of the shitty stuff she's said on there, only to look at the post date after reading 21 different tweets and see 9 hours ago lmao",
                                    "score": 37,
                                    "replies": []
                                },
                                {
                                    "author": "enchiladasundae",
                                    "body": "She’s incredibly transphobic and has a habit of attacking other congresswomen. She was behind the rule that the new trans congresswoman can’t use the women’s bathroom at the capitol. She also repeats so much how she at one point in her life was raped which she uses as justification to attack all trans people",
                                    "score": 29,
                                    "replies": [
                                        {
                                            "author": "qtzd",
                                            "body": "She’s straight up used transphobic slurs iirc. And saw another trans woman’s instagram reel earlier today where she was being harassed by this woman.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Bisexual_Cockroach",
                    "body": "killing myself after reading this",
                    "score": 18,
                    "replies": [
                        {
                            "author": "Weekly-Major1876",
                            "body": "Alien archeologists attempting to understand long lost human culture",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "HighwaySmooth4009",
                                    "body": "It's actually a punishment for the worse criminals among those aliens",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Cognitive_Spoon",
                                            "body": "Hi alien prisoners!!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "deadhead_girlie",
                    "body": "Thanks Peter",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "pingu677",
                    "body": "Don Quixote, go back to Manchagan, your family's worried about you",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DAMONSIPICH",
            "body": "I hate this nasty ass bitch",
            "score": 1,
            "replies": []
        },
        {
            "author": "EnergyAndSpaceFuture",
            "body": "she is houngry",
            "score": 1,
            "replies": []
        },
        {
            "author": "LittleMac2001",
            "body": "She looks like the serpent witch from the manga fork and knife\n\nhttps://preview.redd.it/bltdu1zokjpe1.jpeg?width=1179&format=pjpg&auto=webp&s=e20a251744b82d051957b0e6e6b6cd9b841bb5e7",
            "score": 1,
            "replies": []
        },
        {
            "author": "HighwaySmooth4009",
            "body": "Something looks off about that picture, is that a cardboard cutout or something?? Maybe it's a skinwalker???",
            "score": 1,
            "replies": []
        },
        {
            "author": "TrumpSmokesMids27",
            "body": "She definitely has a lot of beans, but she also doesn’t seem to have any meats on her tray. Am I reading into this too much or did they bring a vegetarian to bbq for her birthday?",
            "score": 1,
            "replies": [
                {
                    "author": "B_D_I",
                    "body": "There's meat on the other tray. It looks like they got a lot of meat and a lot of sides. ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "TrumpSmokesMids27",
                            "body": "You’re probably right. To me it looked like the tray of all meat is for the person taking the picture, but I guess I don’t know how big the table is and whatnot. Or I guess they may just serve it that way and it’s all going to be shared.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "bisexual_obama",
                    "body": "Those are just the sides the whole thing is gonna be served family style.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "TrumpSmokesMids27",
                            "body": "Yeah i guess for some reason my brain was thinking it was like a buffet, not a regular bbq place that would serve what you order",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "BriannaMckinley2442",
            "body": "idk who these people are and I'll trust what people are saying when they say she's a terrible person, but to be fair that's probably just how many beans the restaurant serves. We don't really control how many beans a restaurant gives to us and most people probably wouldn't think to ask about the amount of beans included with their meal before ordering.",
            "score": 1,
            "replies": [
                {
                    "author": "mgquantitysquared",
                    "body": "The whole point was that it's something innocuous; she's such a nasty ass bitch that an equivalent response would be appropriate on any post of hers, even her petting a puppy",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "connorkenway198",
            "body": "Ey? Tf is wrong with beans?",
            "score": 1,
            "replies": [
                {
                    "author": "Outrageous_Map_6639",
                    "body": "shes gonna be gassing her family on the way back home",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "femfuyu",
            "body": "Love Kyle",
            "score": 1,
            "replies": []
        },
        {
            "author": "_S1syphus",
            "body": "This will never not floor me",
            "score": 1,
            "replies": []
        },
        {
            "author": "reddythedemon",
            "body": "ok mrs fart",
            "score": 1,
            "replies": []
        },
        {
            "author": "WalnutSoap",
            "body": "Why she kinda look like the ball face thing from Nier franchise",
            "score": 1,
            "replies": []
        },
        {
            "author": "thatvillainjay",
            "body": "Arguably one of the funniest tweets I've seen in a while",
            "score": 1,
            "replies": []
        },
        {
            "author": "Real_Bretta",
            "body": "I am not very fond of kyle kullinski",
            "score": 1,
            "replies": [
                {
                    "author": "domenatorw1",
                    "body": "Why",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TrysteroTrooper",
                    "body": "Why",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}