{
    "title": "ysk Unlicensed dispensaries exist too",
    "author": "CaregiverLive2644",
    "subreddit": "YouShouldKnow",
    "rank": 13,
    "score": 0,
    "upvote_ratio": 0.44,
    "num_comments (reported by reddit)": 11,
    "url": "https://www.reddit.com/r/YouShouldKnow/comments/1j8e0c4/ysk_unlicensed_dispensaries_exist_too/",
    "id": "1j8e0c4",
    "selftext": "So while there are licensed dispensaries everywhere in legal states, there's 1 unlicensed dispensary for every 5 licensed.\n\nThe signs:\n\nThey sell tobacco products as well. That's a smoke shop. There's no one stop shop.\n\nThey don't even ID. Every legal state mandates dispensaries to ID everyone. They will eventually end up shut down.\n\nThey break local state laws. Examples: Ohio measures by the 10th not 8th. Some states don't allow the product on display. Some ID multiple times.\n\nThey sell clearly fake products. Examples: 1g or 2g hardware that the brand doesn't make. Or just counterfeits. \n\nThe prices are too good to be true. No 2g disposable will only cost $10. In some states 2g disposables are illegal as well.\n\nWhy YSK is because they sell sprayed buds and fake carts that could be laced.",
    "comments": [
        {
            "author": "None",
            "body": "[deleted]",
            "score": 13,
            "replies": [
                {
                    "author": "kensingtonGore",
                    "body": "Full of pesticides and banned chemicals too.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Its_Pelican_Time",
            "body": "Let me see if I got this right. If the dispensary is breaking the law, they're breaking the law.",
            "score": 29,
            "replies": [
                {
                    "author": "shroomigator",
                    "body": "Hey they can't do that, it's against the law",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "AuDHDMDD",
            "body": "The tobacco shops are usually selling Delta 8 and a ton of it's derivatives. There's \"THC-A, THC-O, THC-X, etc.\" and many more. \n\nIf you see \"mushroom bars/gummies,\" they're usually research chemicals. \"Geisha Bars\" seem like a huge mix of research chemicals that will fuck you up\n\nDon't ask me how I know",
            "score": 10,
            "replies": []
        },
        {
            "author": "DixOut-4-Harambe",
            "body": "I'd never buy shady stuff. \n\nThere was a farm in my state that grew and processed and sold... and then it was found during testing that they had DDT in their stuff. \n\nThey never did a soil sampling before buying the farm, and apparently that farm used a lot of DDT back in the 70s - and since trees tend to absorb anything in the soil, they picked up the DDT and then the buyers smoked it. \n\n\nWhich is why I am a fan of testing and regulation on things like that.",
            "score": 2,
            "replies": []
        },
        {
            "author": "CaregiverLive2644",
            "body": "To clarify I’m talking FULLY LEGAL states",
            "score": -1,
            "replies": []
        },
        {
            "author": "Vegeta710",
            "body": "Lolz wait until you find out about the 5g disposables for $60 after tax",
            "score": 0,
            "replies": [
                {
                    "author": "CaregiverLive2644",
                    "body": "wtf where lol",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Vegeta710",
                            "body": "Colorado. It looks exactly like a geek bar except 10% smaller called a nerd bar",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "CaregiverLive2644",
                                    "body": "Damn I bet it tasted burnt 2g in",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Vegeta710",
                                            "body": "My buddy that smokes said it has a high and low setting. He said on low as long as you don’t go more than 2-3s it’s actually super nice and doesn’t burn the element. But he said they only come in fruity flavors which idk if that’s a good thing or not",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}