{
    "title": "YSK: In-Flight Entertainment Systems can be manually restarted.",
    "author": "leavethisearth",
    "subreddit": "YouShouldKnow",
    "rank": 3,
    "score": 2505,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 52,
    "url": "https://www.reddit.com/r/YouShouldKnow/comments/1jdel22/ysk_inflight_entertainment_systems_can_be/",
    "id": "1jdel22",
    "selftext": "If the screen of your plane seat every get‘s stuck or freezes, you should know that you can force restart these screens. Just hold their power button (the button that turns these screens on and off) until the screen restarts.\n\nWhy YSK:\nSometimes you cannot be reseated when you entertainment system doesn’t work on a 12-hour flight. Instead of raw-dogging it, you can try to restart your system to restore functionality.",
    "comments": [
        {
            "author": "TJS1138",
            "body": "Bet that one person going to Japan wishes they knew that.",
            "score": 1964,
            "replies": [
                {
                    "author": "I_am_INTJ",
                    "body": "And their flight left 15 minutes before this tip was posted.",
                    "score": 452,
                    "replies": [
                        {
                            "author": "halite001",
                            "body": "Isn't it ironic, don't you think?",
                            "score": 125,
                            "replies": [
                                {
                                    "author": "bizzznatchio",
                                    "body": "Like rain on your wedding day.",
                                    "score": 54,
                                    "replies": [
                                        {
                                            "author": "dinosaurscantyoyo",
                                            "body": "It's a free RIIIIIIIDE when you've ALREADY PAID",
                                            "score": 43,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "batteryforlife",
                                    "body": "A little… too ironic",
                                    "score": 27,
                                    "replies": [
                                        {
                                            "author": "kaka-mayka",
                                            "body": "It's like rain ... on your wedding day.",
                                            "score": 15,
                                            "replies": [
                                                {
                                                    "author": "ShitGuysWeForgotDre",
                                                    "body": "It's like ten thousand spoons when all you need is twenty thousand spoons",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "author": "divinecmdy",
                                                            "body": "It’s like meeting the girl of your dreams and finding out she’s five",
                                                            "score": 8,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "kangario",
                            "body": "Link?",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "mismamari",
                    "body": "Literally wish I knew this on the way back from Narita several years ago. lol The FA seemed to try everything, so in the end my hubby and I periodically switched seats (he was a row away) so we could both watch movies. It worked out.",
                    "score": 32,
                    "replies": [
                        {
                            "author": "IceBankMiceElf",
                            "body": "Misread that as Narnia… in-wardrobe entertainment? ",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "mismamari",
                                    "body": "Ayyyyy 🥁",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "StellarJayZ",
                    "body": "I told them, go up to the flight deck, and POLITELY request the pilots turn the auxiliary power unit off, then on again. Yes you will lose some minor things like cabin lights, and yes, people will probably freak out, but I'm 20% into Moana 2 and I need to know what happens!",
                    "score": 34,
                    "replies": [
                        {
                            "author": "ValuableJumpy8208",
                            "body": "lol they don't run the APU in flight",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "hawkinsst7",
                                    "body": "And who's fault is that? Mine? Why should I have to suffer because of their decisions?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "ValuableJumpy8208",
                                            "body": "You apparently have no idea what you're mad about.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "hawkinsst7",
                                                    "body": "I'm mad as hell, and i'm not gonna take this anymore!",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Psychological-Owl783",
                                    "body": "They do on some of the more exciting flights at least.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "pandaSmore",
                    "body": "I don't understand this reference.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "damgood135",
                    "body": "Why are you pointing me out like that? What did I ever do to you?",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "RBlomax38",
            "body": "Related YSK: you can easily turn off or darken these screens too. Crazy to me how often I’m on a late night flight where most of the plane is asleep yet every screen is just spewing bright light directly into their faces.",
            "score": 320,
            "replies": [
                {
                    "author": "dejova",
                    "body": "This is why sunglasses or a sleep mask is a good idea in overnight flights",
                    "score": 100,
                    "replies": [
                        {
                            "author": "RBlomax38",
                            "body": "I’m almost always watching something myself (can’t sleep on planes), but I have the brightness setting on very low and am distracted by all the other bright screens in my eye line. Sunglasses may be a good idea though",
                            "score": 65,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "whereiswhat",
            "body": "Or just ask a flight attendant if they can restart it. Holding down the power button doesn’t work on a lot of the in seat screens.",
            "score": 348,
            "replies": [
                {
                    "author": "ShitGuysWeForgotDre",
                    "body": "What do you mean by power button?\n\n>power button (the button that turns these screens on and off)\n\nOh nevermind luckily OP defined it. Would have no clue what a power button is without that note!",
                    "score": 52,
                    "replies": [
                        {
                            "author": "leavethisearth",
                            "body": "That‘s what I thought while writing this post. I wasn‘t sure what else to call it, so I just defined it too.",
                            "score": 13,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "westo4",
            "body": "OP: Sir, have you tried turning it off and then restarting it?\n\nPassenger: Doh!",
            "score": 53,
            "replies": [
                {
                    "author": "sweetreat7",
                    "body": "Didn’t work for me on my 15 hr flight to South Africa.  Fortunately, I was prepared with more than 15 hours phone and tablet entertainment.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "k_dubious",
            "body": "Do people really have so much social anxiety that they'd rather do a 12-hour flight with no movies than just ask a flight attendant to reboot their screen?",
            "score": 54,
            "replies": [
                {
                    "author": "mrningbrd",
                    "body": "Yes. I hate bothering people because I’d rather they have an easier shift instead of having to deal with problems that need to be sorted out. I frequently apologize to cashiers and other workers. (I am medicated and in therapy)",
                    "score": 20,
                    "replies": [
                        {
                            "author": "vulcanofvanburen",
                            "body": "From Minnesota?",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "mrningbrd",
                                    "body": "Nope, east coast",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "robsablah",
                            "body": "You may try the phrase \"when you have a second, id really appreciate.....\"\n\n\nnot rude, not pushy, not apologetic. ",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "bc-bane",
            "body": "Had a 8 hour flight that people kept asking them to reset the system, it happened 3 or four times and took down the system for the whole plane every time. Couldn’t finish a movie because of that amount of time it would take to reboot. ",
            "score": 11,
            "replies": []
        },
        {
            "author": "quetejodas",
            "body": "There's also a diagnostic menu you can access.",
            "score": 10,
            "replies": [
                {
                    "author": "RobbMeeX",
                    "body": "On one flight I saw the chick in front of me repeatedly mashing the hidden buttons of the system and getting nowhere. So I started with mine and ended up in the android environment. It passed the time.",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "leavethisearth",
                    "body": "Oh do tell!",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "ThePrideOfKrakow",
            "body": "Did raw dogging the screen fix?",
            "score": 4,
            "replies": []
        },
        {
            "author": "sad-cringe",
            "body": "I needed this for NYC to Ireland. I watched the Bohemian Rhapsody movie over the shoulder of someone in front of me, obviously with no sound. Worth it to watch again with sound?",
            "score": 5,
            "replies": [
                {
                    "author": "Draxtonsmitz",
                    "body": "It’s a fun movie.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "EmpatheticNihilism",
            "body": "This does not work.",
            "score": 9,
            "replies": [
                {
                    "author": "Rugged_Turtle",
                    "body": "Maybe not on every system, but it 100% works on some, I have done it myself.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "HerrKarlMarco",
                            "body": "70% of the time it works 100% of the time?",
                            "score": 11,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "HandicapperGeneral",
                    "body": "I've never had an inflight screen that had a physical power button. It's always a digital button you have to navigate to.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Apprehensive_Hat8986",
            "body": "Great tip that says you can, but not the how. As in, how/where do you find the power button",
            "score": 2,
            "replies": [
                {
                    "author": "leavethisearth",
                    "body": "It is the button that you press to wake up the screen and turn it dark again. Usually right in the center bottom of the screen. I tried to define it in the post, but I hope this makes it clearer!",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "fictionalreality08",
            "body": "I had 12 hours flight to Dubai and I had same issue at Emirates. They crew member manually restarted the system multiple times but it didn’t work. Needless to say, it was a long flight!",
            "score": 1,
            "replies": []
        },
        {
            "author": "afCeG6HVB0IJ",
            "body": "Between you resetting and re-seated, they can also reboot the system for you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Xiaxs",
            "body": "I might be high but I don't think you're allowed to call them that anymore, bro.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cojemos",
            "body": "NO flight attendant has ever done this. They always restart the system elsewhere.",
            "score": -7,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -4,
            "replies": [
                {
                    "author": "horsetooth_mcgee",
                    "body": "I don't think you're hip to the current slang.",
                    "score": 0,
                    "replies": []
                }
            ]
        }
    ]
}