{
    "title": "YSK: If Someone Is Following You While Walking or Driving, Make FOUR Right Turns",
    "author": "enlightenedmonk00",
    "subreddit": "YouShouldKnow",
    "rank": 2,
    "score": 11395,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 354,
    "url": "https://www.reddit.com/r/YouShouldKnow/comments/1jdiyl2/ysk_if_someone_is_following_you_while_walking_or/",
    "id": "1jdiyl2",
    "selftext": "Why YSK: If you suspect someone is following you on foot or in a vehicle, making four consecutive right turns will either:\n- Confirm they’re following you (since normal drivers or pedestrians wouldn’t loop in a square).\n-Lead you back to your starting point, where you can seek help or go somewhere safe.\n\nIf you’re sure you’re being followed:\n-Avoid going straight home. Instead, head to a police station, a busy public place, or a well-lit area.\n-Call for help. If in a car, don’t stop or exit until you’re in a secure location.",
    "comments": [
        {
            "author": "RobinHanford",
            "body": "I once worked somewhere where we were given alternative routes home if we suspected we were being followed. Mine involved going to a university library, which had multiple entrances/exits where one had to have a card to get past the barriers. Thankfully, I only had to use this strategy once.",
            "score": 4871,
            "replies": [
                {
                    "author": "aswerfscbjuds",
                    "body": "Damn, where were you working that this was standard ?",
                    "score": 1377,
                    "replies": [
                        {
                            "author": "RobinHanford",
                            "body": "Nothing too impressive! I was working for a church in the middle of a large city that was subject to some antisocial behaviour and had the occasional threat made against it.",
                            "score": 1677,
                            "replies": [
                                {
                                    "author": "UnicornTitties",
                                    "body": "Yo, wtf did your church do? That’s wild security measures.",
                                    "score": 703,
                                    "replies": [
                                        {
                                            "author": "RobinHanford",
                                            "body": "It didn't really do anything to antagonise anyone. Some drug dealers just viewed the church becoming more active as a threat to their operations. With more people around, they couldn't use the church grounds as a place to deal away from prying eyes anymore.",
                                            "score": 915,
                                            "replies": [
                                                {
                                                    "author": "SirDigbyChknCaesar",
                                                    "body": "You infringed on their turf. \"Opiate of the masses\" and all.",
                                                    "score": 535,
                                                    "replies": [
                                                        {
                                                            "author": "RobinHanford",
                                                            "body": "Now that is a top-quality pun!",
                                                            "score": 146,
                                                            "replies": [
                                                                {
                                                                    "author": "complete_your_task",
                                                                    "body": "Not really a pun. Just a witty statement.",
                                                                    "score": 41,
                                                                    "replies": [
                                                                        {
                                                                            "author": "RobinHanford",
                                                                            "body": "You are technically correct, which is the best kind of correct.",
                                                                            "score": 46,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "4_hammer",
                                                                                    "body": "Another hilarious pun.",
                                                                                    "score": 28,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "White_Dynamite",
                                                                                            "body": "Incorrect, that was a limerick.",
                                                                                            "score": 5,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Araceil",
                                                                                                    "body": "You are technically incorrect, which is the best kind of incorrect.",
                                                                                                    "score": 5,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Vimes-NW",
                                                    "body": "> couldn't use the church grounds as a place to deal away from pr**a**ying eyes anymore.\n\nFTFY 😜",
                                                    "score": 26,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "HonoraryGoat",
                                                    "body": "Scientology?",
                                                    "score": 27,
                                                    "replies": [
                                                        {
                                                            "author": "RobinHanford",
                                                            "body": "None of us were rich enough to be Scientologists. 😂",
                                                            "score": 80,
                                                            "replies": [
                                                                {
                                                                    "author": "TehChid",
                                                                    "body": "Mormon missionary huh",
                                                                    "score": 32,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "celestial1",
                                                            "body": "😂 This stuff happens at regular 'ol churches, not everything is some grand conspracy.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "HonoraryGoat",
                                                                    "body": "Scientology isn't a grand conspiracy, it is a well documented cult with very famous members.",
                                                                    "score": 6,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "WastePotential",
                                            "body": "Some people just target religious places. In Singapore, we've had multiple instances of radicalised individuals threatening and/or targeting churches and mosques just because of their religious nature.",
                                            "score": 34,
                                            "replies": [
                                                {
                                                    "author": "shamy52",
                                                    "body": "Yeah my UCC church in Oklahoma City got threatened by the KKK once because we didn’t hate GLBTQIA people.  The day they said they were going to come was really cold and icy so they didn’t show up.  I guess it was just too many snowflakes for them.\n\nI’ve also had a few encounters with the Fred Phelps people because of me going there 🤢🤮🤢",
                                                    "score": 23,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Soccham",
                                                    "body": "Many would argue that the radicalized ones are those who attend the churches",
                                                    "score": -10,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "ukjohndoe",
                                            "body": "Guarding Templar relics from the Assassin guild.",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "platysoup",
                                            "body": "Must be one of those churches from John Wick",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "Satire-V",
                                            "body": "Churches have been improving their security since they have been targeted multiple times in mass casualty events \n\nIt's not super rare now for there to be designated armed members now too",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "UsualBluebird6584",
                                            "body": "Westboro baptist.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "BigUSA",
                                            "body": "The Boondock Saints",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Loud_Ad3666",
                                            "body": "Westboro Baptist",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "HoodieGalore",
                                            "body": "Scientology shit. ",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "XxxAresIXxxX",
                                    "body": "I feel like an organization that plans alternate safe routes home for it's members would have a semi believable cover story for the job. Like a church organization in a large city or something...",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Impossible-Ad-6326",
                                    "body": "Damn bro i bet the pastor dips out in his private jet when he's getting followed",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "NietszcheIsDead08",
                            "body": "I used to work in a bank and this was standard practice at the time. In theory, it helped prevent potential robbers from determining when and by how many the bank would be staffed at any given time.",
                            "score": 53,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MatthewMcnaHeyHeyHey",
                    "body": "I volunteered at an abortion clinic for a long time and we had the same training. That, and rotate our travel routes as randomly as possible. We were taught to assign each possible route to numbers in a deck (so, 1-10), shuffle and whatever order the cards dealt out was our routes for the week/month whatever. All routes had options for quickly accessing public spaces for the same reason.",
                    "score": 42,
                    "replies": []
                },
                {
                    "author": "mrwongz",
                    "body": "Best case if you didn’t need to use it at all!",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -65,
                    "replies": [
                        {
                            "author": "ColonelAverage",
                            "body": "Hey guys, I found the driver this post is about!",
                            "score": 47,
                            "replies": [
                                {
                                    "author": "ColonelAverage",
                                    "body": "Aww they deleted it. How fragile.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Waiting4The3nd",
                            "body": "Hey, question... When you lie on the internet, do you really, like after you hit the \"Post\" button, sit back and think to yourself \"That shit sounds so cool. I bet I get a lot of upvotes\"?\n\nDo they ever believe you?\n\nAlso, what's the motivation? Are you afraid of being irrelevant, so you make up stories that fit a situation? Is it to feel important?",
                            "score": 38,
                            "replies": [
                                {
                                    "author": "bart7782",
                                    "body": "I don't think he's lying. The wording is a bit off but on his post history you can see that he is telling the truth.",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "Posraman",
                                            "body": "Thanks! Not sure why he thinks I'm lying lol. \n\nI just put my wording as such because I figured there might be people from other countries who don't know what Tacoma is or a Lexus IS is. I was just trying to save them the trouble of having to look it up. \n\nAlso, I meant it's not uncommon for someone to get pissed at me when I'm on a road trip. In my day to day driving everyone is fine lol. I try to be a courteous driver but where I live, there's a lot of fragile ego lifted pickup drivers that get mad when a little Tacoma passes them\n\nEdit: people have tried bullying me, as grown men, for driving my Tacoma because \"it's not a real truck.\" One of the guys who tried drove a compact car.",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "nanadoom",
                            "body": "Assuming this is true, why? Do you do things that get you followed a lot?",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "Posraman",
                                    "body": "I try to be a courteous and considerate driver. I don't swerve between lanes, I don't cut people off, I don't tailgate and I let people merge. If someone is driving slow in the passing lane and won't move over, I just undertake them rather than flashing my high beams or honking my horn.\n\nAlso, I'd like to point out that I travel a lot by car and it's on those longer drives where I see the more aggressive drivers. I should've specified that in my post. In my day to day driving I don't have people follow me lol. \n\nI think part of it is because I drive a nicer car. People tend to have a negative bias towards cars like that. I understand it and I do the same whenever I see a BMW pass me. \n\nAt the same time, I've noticed people move over a lot more when I'm driving my car, even if I'm not driving fast. Like 8/10 people will move over. It's kinda nice actually. I feel like a cop lol. \n\nSorry if I explained. I'm ADHD af and had a lot of caffeine today.\n\nTLDR: I try not to be an asshole driver\n\nEdit: not sure why people think I'm lying. I don't really lie about things. Especially when there's nothing to gain. Believe me if you want",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "el-dongler",
                            "body": "Careful everyone. This reddit user is a *Certified Badass",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "martphon",
                            "body": ">if I undertake them.\n\nOh, you're an undertaker!",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Posraman",
                                    "body": "Yes. I do the thing with the bodies. Whatever it is the undertakers are supposed to do.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "LordTopley",
            "body": "If you’re in the UK, I’d suggest not going to a police station if driving as many are difficult to access, while yes your follower will likely move on if they notice you’re at a police station, they might not. \n\nGo to a fire station, they’re fully accessible and staffed 24/7, they will provide shelter and contact support. \n\n(Just don’t block their garage doors)",
            "score": 1067,
            "replies": [
                {
                    "author": "Baba_-Yaga",
                    "body": "Driving fully round a roundabout is a UK version of OP’s suggestion also - proves you’re being followed. Four left turns in the UK would likely land you in a deserted trading estate, a cul de sac or the open country. Or Dewsbury.",
                    "score": 303,
                    "replies": [
                        {
                            "author": "lxgrf",
                            "body": "Hate it when I turn right too often and end up in Dewsbury. ",
                            "score": 51,
                            "replies": []
                        },
                        {
                            "author": "Baconoid_",
                            "body": "Big Ben! Parliament!!",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AmySmooster",
                    "body": "Can't believe I never thought of the fire station. Brilliant idea. \nThanks for this.",
                    "score": 24,
                    "replies": [
                        {
                            "author": "Embarrassed-Weird173",
                            "body": "Plus, the fire is a good weapon. ",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SmieyGuy",
            "body": "Funny thing, one day I was walking behind someone, and because I walk fast (NY thing), the person freaks out and starts walking faster. \nTurns out we are neighbors 😅😅",
            "score": 1558,
            "replies": [
                {
                    "author": "SyntheticDreams_",
                    "body": "Awhile back I did this to someone in a car. Every turn they made happened to also be my next turn, so I followed this car for a solid 35 minutes until we hit a highway and they laid into the gas and vanished. I eventually pull into my parents' driveway, look over, and three houses down is the same car. Turned out they went to my college and we were both driving home.",
                    "score": 771,
                    "replies": [
                        {
                            "author": "BlatantlyCurious",
                            "body": "I always get anxious and think the car in front of me thinks I'm following it if I follow a car for more than three turns in the city.",
                            "score": 211,
                            "replies": []
                        },
                        {
                            "author": "SmieyGuy",
                            "body": "The akward moment for both us was me pulling out my keys and getting into the house while the other person, ringing the doorbell and waiting to get inside 🙃",
                            "score": 231,
                            "replies": []
                        },
                        {
                            "author": "Bradddtheimpaler",
                            "body": "I used to do this a lot more pre-gps driving in cities.  “Shit.  Looks like that guy knows where he’s going….”",
                            "score": 18,
                            "replies": []
                        },
                        {
                            "author": "DuckfaceDramaqueen",
                            "body": "My husband had this once. On the highway he was driving behind someone and they took the same exit. Every turn, roundabout and traffic light they were going the same direction for about 25 minutes. So eventually the guy in front of him stopped the car and blocked the road, hopping out of the car and started walking towards my husband. My husband responded by rolling down his window, waited for the guy to come close and shouted ‘you still owe me money!’ So the guy froze and my husband started laughing and said sorry I’m kidding, just happen to go the same direction. Turns out the guy lives a few houses down our road",
                            "score": 14,
                            "replies": []
                        },
                        {
                            "author": "sirbissel",
                            "body": "I had something like this happen this morning when I was taking my kid to school. \n\nAt a stop light, my light turns green but the person to my right was making a right hand turn and pulled in front of me (at the light) - not exactly cutting me off, but it would've had I taken off as soon as the light changed. The road is about a mile and a half with a couple more stop lights, but they were all green. Stop light where I turn left the car in front was also turning left, and continued on for another mile or so, through more lights. Then, down a kind of residential road that I take to avoid some of the obnoxious roads, they turn right... as do I. At this point I think they thought I was following them because they started going probably 40 in a 25. Except there are also stop signs, so they'd stop, wait for the car to cross, I'd get up behind them again, and they'd book it - at least until we reached the stop sign where I turned right after they went straight (3 or 4 stop signs down)",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "PineapplePizza99",
                            "body": "Sometimes when I go back to my hometown and notice a license plate from there on the road I just go in autopilot mode and tail that car. That way the ride is a bit more relaxing for me since I only have to follow this car in front of me and do what they do. I have had people speed up on me lol.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "baffledninja",
                                    "body": "My mom always did this growing up! She called it her speed buddy.",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Derpy_Diva_",
                    "body": "This kind of happened to me a couple months ago lol. I was walking behind a small family (with my baby) and followed them for about a mile coincidentally. We even went down a small side street (I happened to live on it). I think I scared them once down this street (no one ever goes down it so it did seem sus) as they stopped right in front of my building to look at me 😅 luckily the ramp (had a stroller) was before where they were stopped so I didn’t have to engage in anything awkward and it became painfully obvious I lived there (fob only entry).",
                    "score": 37,
                    "replies": [
                        {
                            "author": "c8akjhtnj7",
                            "body": "Ha, I did this one. Thought a car was following me on the final approach to my house with lots of turns, didn't want to stop at my own house, so I pulled up like 5 doors down, as it turned out, outside the car \"following me\"'s house.",
                            "score": 28,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DogsDucks",
                    "body": "This can be very scary to a lady who has been followed before— I bet it was such a sigh of relief when they found out it was a coincidence!",
                    "score": 89,
                    "replies": [
                        {
                            "author": "Triquetrums",
                            "body": "Yes, specially when the person arrived home and saw them right behind them trying to enter the building too.",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "Jazzvinyl59",
                            "body": "I would always give my keys a shake if I was walking up to my building behind someone else I didn’t know, just so they thought I had a key and lived there too.  Realize now that anyone can have keys but I was trying at least.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "DogsDucks",
                                    "body": "That would actually be calming, that’s not a bad idea. Someone who is fixated on nefarious purposes usually just wouldn’t do anything else that shows they are otherwise occupied.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "whatshamilton",
                    "body": "Mmm you can’t speed up behind someone unless you have a calculated pass in mind. I’m always panting when it takes me a whole block to overtake but I gotta keep up the acceleration!",
                    "score": 40,
                    "replies": [
                        {
                            "author": "im_not_u_im_cat",
                            "body": "I feel this so hard. So awkward, but better than walking behind someone going just a bit too slow.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "cwispywotr",
                    "body": "I had a similar experience. A group of 3 men got off at my bus stop with me, and they followed me to my apartment complex until I unlocked my door and they saw a pitbull haha. For weeks I thought my dog saved me, turns out they were my next door neighbors and they had to walk past my apartment to get to theirs. Lol.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "SmieyGuy",
                            "body": "This one must have been terrifying, especially with the Adrenaline rush, and the fact its 3 people walking together to the same place lool",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "cwispywotr",
                                    "body": "It was, I was scared every night (I always got home late from work) until I found out. \n\nWhile in the bus, the men kept switching to another language (French?) and looking at me from time to time, so that didn’t make it better back then.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "EloquentGoose",
                    "body": "I moved to the south from NYC and everyone is so freaked out by how fast I walk when to me it's just... walking? Like, I have a place I need to be and I go directly there. Fuck a slow stroll, no time for that nonsense!\n\nI usually just jiggle my keys to signal my presence and keep ~~speeding~~ walking by.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "bobbybob9069",
                    "body": "I had a very similar experience. I'd just moved to LA and was in downtown at a place that was cash only. I was walking over to the ATM, and there was a woman ahead of me. She looked back. Then she looked back again and picked up her pace a little. Which freaked me out, so I sped up a bit, thinking of all the dangers I've heard about. She looks back again and starts hustling. I maintain pace but start having a heart attack. She looks over her shoulder again, busts into a run for the last 20-30 feet and runs into into some building, and makes sure the door closes behind her. I'm super nervous. I realize I have no indicator now, suck it up and glance over my shoulder and see.... no one. The ATM was two doors down from the door she ran in. I realize she's running from me. My then GF observed the whole thing and was dying of laughter. \n\nAnother story:  my grandmother was in comfort care in the hospital. It was like 2:00 a.m., and my dad asked me to run to his truck for a pack of smokes. I get super anxious in the garage and start running back. He asks me what's up and if everything's okay. Told him I felt sketched out but didn't see anyone, and he proceeds to laugh and tell me, \"Bud, you look like the guy people are running out of parking garages to get away from.\"",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Xtorin_Ohern",
                    "body": "Dude I accidentally did this in Kyoto to a schoolgirl and I felt SO BAD.\n\nturns out the AirBnB I was staying in was in her neighborhood and we got off at the same train station, I was walking along behind her and after about 2 turns thought \"man, this girl is absolutely hustling, and looking around a lot, what's got her on ed- oh no it's me\".\n\nEnded up ducking into a convenience store and finding an alternative route on my phone... Lmao",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "mrwongz",
                    "body": "At least now you finally recognise your neighbour 😂",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "tulobanana",
                    "body": "I’m a woman and ended up walking behind two women for like 10 minutes. Turned out we’re neighbors who were going to the same gym",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Ok-Substance4694",
                    "body": "I’m always worried that I’m scaring the other person if I’m walking behind them and going the same way. Sometimes, if it’s night and the person in front is a woman, I just cross the street and walk on the other side",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "juxtoppose",
            "body": "Just drive round and round the roundabout until your would be assailant falls asleep or runs out of gas.",
            "score": 502,
            "replies": [
                {
                    "author": "jangobotito",
                    "body": "Or in my case gets dizzy and I crash. So if I’m ever following you, you know how to get rid of me.",
                    "score": 62,
                    "replies": []
                },
                {
                    "author": "shallower",
                    "body": "this assumes you have more gas / dizziness endurance than your pursuer",
                    "score": 16,
                    "replies": [
                        {
                            "author": "FrenchFryCattaneo",
                            "body": "that's because I do",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "brianr1",
                    "body": "Look kids, Big Ben, Parliament.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "HusGrr",
                            "body": "Oh Clark. I love me some Griswold humor",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AbsorbAndPlay",
                    "body": "And if that doesn't work, throw a banana peal out the window and exit when they spin out.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "ispshadow",
                    "body": "*\"Hey look kids, there's Big Ben, and there's Parliament. Again.\"*",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "RoastyMyToasty99",
                    "body": "Funny thing about America...",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Jeciew",
            "body": "I definitely agree with the don’t go home part! Definitely dont want them to know where you live",
            "score": 803,
            "replies": [
                {
                    "author": "7h4tguy",
                    "body": "Drive to a police station and park. If that doesn't deter them (it likely will), then photo their license plate, walk in, and give them stalker documentation.",
                    "score": 121,
                    "replies": [
                        {
                            "author": "ray_0586",
                            "body": "A Houston area donut shop owner was robbed this week. He went to the bank to get small bills and coins to make change at the cash registers. Unbeknownst to him, he was followed by three vehicles without license plates. His car was blocked in and one person got out and snatched the money while the owner was walking to the entrance. It was a lot of effort for a little bit of money on the part of the robbers. Owner made a brief attempt to keep the money, but later said it just wasn’t worth the risk to engage the robbers.",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "gizamo",
                            "body": "It also works to just call the police.    \n    \nThat's better than showing them your car. A moderately savvy stalker can learn a lot from your license plate, make, model, etc.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Flesh_Dyed_Pubes",
                    "body": "Conversely you should drive towards their home",
                    "score": 20,
                    "replies": [
                        {
                            "author": "Electronic_Mango1181",
                            "body": "Assert dominance over your stalker",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Apartment-Drummer",
                    "body": "Go to your exes house ",
                    "score": 61,
                    "replies": [
                        {
                            "author": "Opening-Two6723",
                            "body": "Unethical pro life tip",
                            "score": 27,
                            "replies": []
                        },
                        {
                            "author": "destinofiquenoite",
                            "body": "Plot twist: it was your ex following you",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "bex_mex",
                            "body": "Nice try Satan",
                            "score": 27,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Sirius_J_Moonlight",
                    "body": "Had a guy try to cut me off and fail, and then he seemed to be following me. When he turned in to my street, I told my family (wife & 2 grown sons were in the car) that I wasn't stopping. I made a few random turns in our tract and he turned off in a direction that somebody randomly going in the same direction wouldn't have gone. If he kept on, I was going to the hospital that's nearby, hoping a cop would be around. But as somebody here said, the fire station up the street would have been at least as good.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "PaulyRocket68",
            "body": "This happened to me while my teenage daughter was in the car with me. It was an aggressive driver who started following me. I called 911, gave a description of both cars and my location. The dispatcher had me make 2 right turns and the cops caught up with us at the 3rd turn. They questioned us then let us go. Not sure what happened to the other guy but following someone is considered aggressive driving here in AZ.",
            "score": 196,
            "replies": []
        },
        {
            "author": "OGigachaod",
            "body": "What if you do 4 left turns?",
            "score": 985,
            "replies": [
                {
                    "author": "CanIPNYourButt",
                    "body": "Not as good because you are more likely to be stuck at an intersection, immobile for some period of time.",
                    "score": 1328,
                    "replies": [
                        {
                            "author": "Heroic_Folly",
                            "body": "Unless you're in England",
                            "score": 535,
                            "replies": [
                                {
                                    "author": "lizardfang",
                                    "body": "How many left turns does it take to get to England?",
                                    "score": 360,
                                    "replies": [
                                        {
                                            "author": "OGigachaod",
                                            "body": "42",
                                            "score": 273,
                                            "replies": [
                                                {
                                                    "author": "Quantum_Tangled",
                                                    "body": "I've heard you end up with all the important answers that way...",
                                                    "score": 50,
                                                    "replies": [
                                                        {
                                                            "author": "mrmadchef",
                                                            "body": "The problem is nobody knows the question.",
                                                            "score": 18,
                                                            "replies": [
                                                                {
                                                                    "author": "lifevicarious",
                                                                    "body": "The unsolvable jeopardy clue.",
                                                                    "score": 6,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "OnlyTalksAboutTacos",
                                                                    "body": "the books say it's \"what is six times nine\"",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "NinjaKitten77CJ",
                                                    "body": "38 of you take the secret shortcut",
                                                    "score": 4,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "yurtlizard",
                                                    "body": "13 because of the different time zone",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Wit_and_Logic",
                                            "body": "I dunno, but you're bound to wind up there if you make enough wrong turns.",
                                            "score": 8,
                                            "replies": []
                                        },
                                        {
                                            "author": "Angelforce5",
                                            "body": "All roads lead to Rome, so however many left turns it takes to get to the chunnel from Rome",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Sowf_Paw",
                                    "body": "If you are in the UK or Japan and you think you are being followed, drive immediately to the United States so you can easily make four right turns. \n\nIf you are in Australia, you must drive your car off a bridge.\n\nIf you are in India or South Africa, you must stop and give yourself up to the person following you.\n\nIf you are in any other country that drives on the left, you must immediately go into reverse the moment you even slightly suspect you are being followed and crash into the suspected follower.",
                                    "score": 140,
                                    "replies": [
                                        {
                                            "author": "Mbembez",
                                            "body": "In Australia you just disengage the magnets that's holding you onto the ground, you simply fall down into space and you're safe.",
                                            "score": 26,
                                            "replies": []
                                        },
                                        {
                                            "author": "Heroic_Folly",
                                            "body": "Relevant username",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "chaigulper",
                                            "body": "I'm in India, I would stop and fight the person following me \\s",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Sowf_Paw",
                                                    "body": "It goes against the recommended protocol but that's how you get ahead in life.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Teauxny",
                                            "body": ">drive immediately to the United States so you can easily make four right turns\n\n'cause there's way more rights than lefts now.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "TurtleRockDuane",
                                    "body": "Bunch of leftists in England",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "BritishLibrary",
                                    "body": "Also 4 left turns in England is highly likely to be a legitimate route to someone’s destination here, since we loath all forms of grid based urban planning. \n\nApart from Milton Keynes but we won’t speak of that",
                                    "score": 10,
                                    "replies": []
                                },
                                {
                                    "author": "SteO153",
                                    "body": "Unless you are in Swindon, they are not following you, but they are simply stuck in the Magic Roundabout like you.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "im_not_u_im_cat",
                                    "body": "Drive around a traffic circle (roundabout?) endlessly. Just keep going, never get off. Eventually someone’ll get dizzy and crash.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "asphodel67",
                                    "body": "Or Australia…or New Zealand…or Japan…",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Kung_Fu_Kracker",
                            "body": "Country-dependent life pro-tip!",
                            "score": 27,
                            "replies": []
                        },
                        {
                            "author": "Anonymouse-C0ward",
                            "body": "Or, it could get them stuck waiting for the next light, assuming you are driving and not in the UK, Japan, or somewhere else that drives on the left hand side.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "controversialupdoot",
                                    "body": "Even then you could get stuck at the light. Most of the world does not have 'turn on red' rules like the states.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Pugneta",
                    "body": "If you do it in LA, there is a chance they will stop following you considering it takes forever to turn left.",
                    "score": 47,
                    "replies": []
                },
                {
                    "author": "satan-cat",
                    "body": "Believe it or not straight to jail.",
                    "score": 23,
                    "replies": [
                        {
                            "author": "Sirius_J_Moonlight",
                            "body": "Do not pass Go?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Genocidal_Duck",
                    "body": "Car explosion",
                    "score": 36,
                    "replies": []
                },
                {
                    "author": "NoseMuReup",
                    "body": "You're a male model.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "whatshamilton",
                            "body": "Most male models are ambiturners",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Cobrachimkin",
                    "body": "Now you’re a nascar driver",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Jayypoc",
                    "body": "Nascar",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "HebridesNutsLmao",
                    "body": "You summon automotive Beetlejuice",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "AnsweringLiterally",
                    "body": "You summon the Slenderman.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "classynathan",
                    "body": "Oh sure just rub it in, I bet you’re not even a yegooglyzer",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "NodusINk",
                    "body": "Stop following that person",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Japjer",
                    "body": "You explode",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "burntothepowerofer",
                    "body": "You won’t be all-right",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "InternalCucumbers",
                    "body": "It's okay because they'll still do four right turns and then they'll be back safely behind you again.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "lushico",
            "body": "I was driving alone at night and had to use this strategy when a car with 4 men in it started following me. It started with them doing a U-turn from being parked on the opposite side of the road.\n\nOnce I confirmed that I was probably being targeted for a car jacking, I headed towards the nearest petrol station, prepared to run red lights if necessary. Luckily right after I turned back onto the main road I spotted a private security van, and pulled up behind it flashing my lights and honking. This was enough to deter the pursuers. In South Africa you can never be too careful",
            "score": 60,
            "replies": [
                {
                    "author": "Climaxite",
                    "body": "You should’ve just pre-faced that you live in South Africa. The wildest fucking shit happens there.  ",
                    "score": 40,
                    "replies": [
                        {
                            "author": "lushico",
                            "body": "It is wild, and it hones your senses! That time was in an affluent suburb of Cape Town but I got bad vibes and moved almost on instinct.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "cocoamilky",
            "body": "I had this happen and did this exact thing. it was the only way I could really confirm what was happening to me.\n\nI live in nyc and I was on a train home from work around 11pm. I worked in manhattan and lived in queens so my commute was an hour and thirty with 2 trains & 1 bus.\n\nThe first train ride, I noticed a dude looking at me a lot but I didn’t think anything of it, it’s free to look.& happy to be look-able so I just continued to mind my own business.\n\nThe next train, he sat across me again all the way to the last stop, just glancing. I assumed he noticed we were on the last train so again, I gave it the benefit of the doubt.\n\nI got on the bus, a bus stop that has like 20 other buses and again, seated right across from me. What were the chances? I mean, I’m taking this commute too, it’s not out of the realm of possibility\n\nBut something told me to get off at a few stops earlier than my own as my stop was literally right in front of my house\n\nI got off and so did he, it’s close to 1am now on this dark sidewalk alone with this man and I didn’t want to be rude and start running so I start marching but then he kept calling out to me and I felt if I didn’t stop, he’d start running and attack me.\n\nI stopped reaallll close to a house with lights in case I had to scream and calmly asked what I could help him with \n\n**Blah blah I wanna get to know you mumble**\n\nI apologized because I was very busy and tired from work and would like to go home. He kept walking with me for a bit to try to convince me but at that point I was really done  and I said “mmkay have a good night and just basically walked off, doing the 4 right turn & he noticed and headed for the bust stop for the opposite direction which I confirmed that he at least followed me some of the way. \n\nLike shoot your shot buddy but maybe not in the dead of night after that long commute and I didn’t look at you back.",
            "score": 149,
            "replies": [
                {
                    "author": "pegar",
                    "body": "That's not shooting your shot. He would have done so sitting across from you. That's the perfect opportunity. He was stalking you to see where you live and wanted to corner you and put you in a position where you would be afraid to refuse.",
                    "score": 76,
                    "replies": [
                        {
                            "author": "cocoamilky",
                            "body": "No, I know lmao \n\nThis wasn’t a normal dude in the slightest, when he was talking i could tell he was missing a screw, just making light of something dark",
                            "score": 21,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Dry-Magician1415",
                    "body": "If you’re on a bus , why not just mention your concerns to the driver? You could tell them you’re going to get off, wait a few seconds and get back on.\n\nAnd if you’re on a train - just get off at the next stop, walk down a few carriages and get back on. Bonus points if you get back on just as the doors are closing and your stalker is left on the platform. \n\nMuch better to confirm the stalker ina. Public place with others around than rely on the “four right turns alone” thing. ",
                    "score": 24,
                    "replies": [
                        {
                            "author": "cocoamilky",
                            "body": "At the time I couldn’t confirm anything other that “this guy is looking at me” and did not expect for him to be on the same car. \n\nThis is a major city, it’s not a crime or an issue for a dude to ‘have the same commute’ as I.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "SnooCrickets7386",
                            "body": "She didnt know the guy was following her until she got off the bus. A lot of people are gonna have the same commute as you.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Keizojeizo",
            "body": "Shit I just ended up at a dead end and they blocked me in and beat me to death",
            "score": 123,
            "replies": [
                {
                    "author": "muchhuman",
                    "body": "RIP in peace",
                    "score": 38,
                    "replies": [
                        {
                            "author": "HusGrr",
                            "body": "RIPIP in peace",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "martofski",
                                    "body": "What's going on in this ITT thread?",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Holmes02",
            "body": "So I was driving home from work. I got the feeling someone was following me so I passed by my house and took four rights. When I drove by my house again, their police lights came on. I pulled over right in my driveway  and they yelled over the speaker asking where I was going. I pointed at my house and yelled home and they drove away.",
            "score": 191,
            "replies": [
                {
                    "author": "cold_quinoa",
                    "body": "ACAB. They clearly had no reason to be following you. It's not illegal to drive in circles.",
                    "score": 133,
                    "replies": [
                        {
                            "author": "bdfortin",
                            "body": "Reminds me of an encounter a few weeks ago. I was leaving someone’s place in the evening when I noticed a car about 0.5 km up the street turns on and starts following me. 2.5 km later it turns out to be an unmarked police car and he pulls me over. No crime, nothing illegal, just wanted to follow me for a while then pull me over.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "Amatharis",
                                    "body": "Got pulled over four times in the last years (shift work does that, I suppose) and in three out of four times they followed me for 1 up to 4 km before pulling me over. (These three were like: Papers? Did you take drugs or did you drink something? Got all necessary equipment on your car? (I opened my trunk to show.) Okay, Have a nice day!)\n\nExcept the first time where we passed each other and they did make an aggressive u-turn over the gas station and charged full throttle after me with lights on and flashing their high beams like hell and stopped me right where they catched up to me. The whole thing then went kinda rude from their side...\n\nGuess they actually were called onto the asshole in front of me (same colored car and also same overall body form) who came flying out of a side street and forced me to brake hard and then took off like a maniac. (Probably someone called the emergency number for a drunk driver? They asked me like ten times if I had a drink and then basically (verbally) forced me to take a breathalizer test - which I accepted because I basically never drink.. passed that seemingly with 0.0 and suddenly they let me go as if nothings wrong?)",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Big_sugaaakane1",
                                    "body": "I ran from a cop once because i was on my motorcycle and this EXACT THING HAPPENED. I noticed the car turn on and then start following me.\n\nWhat tipped me off was that i was on the road and can see down it for a few minutes so it was just weird that not one car passed by, no one left their house…BUT THE SECOND i start making moves a car turns on and starts following me (again i didnt see anyone leave their house or walk into any cars) \n\nSo i did the 4 turn thing but i kept going faster and faster and eventually i saw the back of his car, kept going straight, hit my kill switch on my lights and fucking booked it lmao)  \n\nHe could have just pulled up to me as i was in front of a friends house. Not reason to be a fucking creep lol.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "GitEmSteveDave",
                            "body": "[People commiting crimes tend to take rights to avoid police](https://youtu.be/wezI3p0Bmys?t=16).  Probably suspected they were trying to \"lose\" the police car.",
                            "score": -31,
                            "replies": [
                                {
                                    "author": "savage_engineer",
                                    "body": "attempting to shake off a police tail does not probable cause make",
                                    "score": 40,
                                    "replies": []
                                },
                                {
                                    "author": "celestial1",
                                    "body": "Serious though, do you have brain rot? You literally linked to a fictional TV show acting like what they're saying is a complete fact.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Existing_Phone9129",
                                    "body": "people who suspect theyre being stalked also tend to take rights",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Lityeah",
                    "body": "My sister had truck tailgate her out in the boonies at night until she got up to like 25 over the speed limit (dumb, but she was like 17) so she took 3 rights to get him off her tail and finally the truck went straight. She saw in her mirror that it was a cop once she got the side view. He was out of his jurisdiction so he couldn't do anything, he was just doing that for kicks.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "clapclapsnort",
            "body": "This happened to me. I drove to the police station. The car pulled up behind us and waited! I got out and went in the station and the fucking lady told me the cameras are out, “good time to commit a crime!” I said, madly and went back to my car alone because the lady wouldn’t even leave the desk to come outside and see. I had to drive away with them still following me. I had to call the cops while I was driving and give them my location and coordinate with them for them to pull the car over and I could finally go home.",
            "score": 228,
            "replies": [
                {
                    "author": "LordTopley",
                    "body": "Go to a fire station instead (just don’t block their garage doors). \n\nThey’ll shelter you and get the police. Additionally should the follower remain, you have a fire house full of witnesses that are also very strong and they stand their ground to fires daily, they’ll stand their ground to the douchebag following you.",
                    "score": 160,
                    "replies": [
                        {
                            "author": "SirDigbyChknCaesar",
                            "body": "Especially good if a fire is following you",
                            "score": 123,
                            "replies": [
                                {
                                    "author": "BAD4SSET",
                                    "body": "Hilarious ",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "joomla00",
                                    "body": "Just make sure your trunk isn't on fire.  Otherwise they'll think you're an idiot",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "mfigroid",
                            "body": "What if the station responded to a call?",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "savage_engineer",
                                    "body": "you follow them, naturally",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "clapclapsnort",
                            "body": "Hey! Thank you. I will keep that in mind.",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "oojiflip",
                            "body": "Unless that person has a gun, then you'll really wish you went to the police instead",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "acchaladka",
                                    "body": "Not sure I agree, most cops in N America are poorly trained and a bit stupid. Unless you get the rare one who is a combat veteran.",
                                    "score": 13,
                                    "replies": []
                                },
                                {
                                    "author": "LordTopley",
                                    "body": "I live in UK, I rarely consider guns. Knives are our problem and they’re much easier to combat.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BUSY_EATING_ASS",
                    "body": "There weren't any cops on duty to walk out with you?",
                    "score": 63,
                    "replies": [
                        {
                            "author": "clapclapsnort",
                            "body": "It was late at night and she was the only one on duty in the lobby.",
                            "score": 15,
                            "replies": []
                        },
                        {
                            "author": "rolyoh",
                            "body": "She didn't bring donuts.",
                            "score": 41,
                            "replies": [
                                {
                                    "author": "clapclapsnort",
                                    "body": "😆",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ghilliesniper522",
                            "body": "No because  this probably a fake story",
                            "score": -7,
                            "replies": [
                                {
                                    "author": "clapclapsnort",
                                    "body": "It’s not, actually. When they pulled them over the cop said they said they thought we were someone they knew. But they never tried to get up next to us or flag us down they just creepily followed me through several right turns and even running red lights. They just ran the red light, too.",
                                    "score": 21,
                                    "replies": []
                                },
                                {
                                    "author": "griffcoal",
                                    "body": "r/nothingeverhappens",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Herohades",
            "body": "Important addendum: do not turn into an alleyway or similarly empty road or area. If somebody is following you, they're probably waiting until there aren't onlookers for whatever reason. So make sure the roads you're turning on still have people around.",
            "score": 29,
            "replies": []
        },
        {
            "author": "Russell_Jimmy",
            "body": "Once, I was driving home, and a car in front of me was going the same way I was. He turns left, I turn left, etc. I didn't think much of it, as I was using shortcuts, but everyone in my neighborhood uses the same ones, and while usually there is no other cars on the back streets, it isn't unheard of.\n\nWe get to the last right before my house, and the dude in front pulls over and gets out of his car, ready to brawl. He does the \"What the fuck, come on bro!\" gestures as I roll past. I can see a woman sitting in the car next to him.\n\nI pull in to my driveway and get out of my car, glance over at him and open the front door of my house and go in. I see through the windows that he is a bit deflated and gets back in his car and drives off.\n\nThis four rights turns thing can prevent you from looking like an idiot, too.",
            "score": 27,
            "replies": [
                {
                    "author": "Sirius_J_Moonlight",
                    "body": "I was the following car in a situation like that once too. Like 4 turns in a row the same, and I WAS a little worried they'd get paranoid. Then they went another way and suspicion was off me.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheLazyHippy",
            "body": "Location clearly matters here. I very well could be circling 1 block or more multiple times if I'm looking for a parking spot in downtown.",
            "score": 110,
            "replies": [
                {
                    "author": "YESIMSUPERRGAYY",
                    "body": "this. i could also be a popular walking loop/route.",
                    "score": 30,
                    "replies": []
                },
                {
                    "author": "plantythingss",
                    "body": "Or if you’re in a city/town that isn’t on a grid.  A lot of places if you keep turning right it won’t take you back to where you started.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "EmperorSexy",
            "body": "Two wrongs don’t make a right. But three rights make a left!",
            "score": 22,
            "replies": []
        },
        {
            "author": "Oprah_Pwnfrey",
            "body": "Also, carry a small 1500-2000 lumen flashlight with a quick access button to activate it. No one is going to see anything for 60 seconds after getting that flashed in their eyes. Also doesn't do permanent damage. You need like 3000+ lumens for that.",
            "score": 23,
            "replies": []
        },
        {
            "author": "downtownflipped",
            "body": "this happened to me once. i did the four right turn things and the car kept following me. i panicked and drove to the nearest police station that i could remember. as soon as he saw me get closer to the police station and signal to turn in he fucked right off. i didn’t sleep well that night.",
            "score": 20,
            "replies": []
        },
        {
            "author": "Resident-Loquat-8241",
            "body": "Someone was following me once and I did this exact thing. It's because my fuel filler cap was not on and they were trying their hardest to tell me lol.",
            "score": 18,
            "replies": []
        },
        {
            "author": "BogdanPradatu",
            "body": "I'll make 5 right turns, just to be extra sure.",
            "score": 37,
            "replies": [
                {
                    "author": "ArchiStanton",
                    "body": "I make one left. Everybody is expecting the 4 rights!",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "mklilley351",
            "body": "Me thinking I'm still following my buddy to the new restaurant he said was cool: \"why tf are we going around in circles??\"",
            "score": 19,
            "replies": []
        },
        {
            "author": "_The-Alchemist__",
            "body": "Turn your blinker on, watch for them to turn the same blinker on. Turn the opposite way of your blinker. If they do the same then you're being followed,  champ.",
            "score": 11,
            "replies": [
                {
                    "author": "Herohades",
                    "body": "That might be a good way to catch a stalker, but it's also a super good way to get into a car accident.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "_The-Alchemist__",
                            "body": "Well obviously you do it where you won't cause an accident for someone else. I feel like that's obvious.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "iisdmitch",
            "body": "I did this once, I thought someone was following me after I picked up my friend for a party once, I did this, made four right turns trying to confuse the person following me, and it did, but it turns out the person that was following me, I had told to meet at my friends house and follow me, but I forgot, but it did indeed confuse them.\n\n10/10 would recommend this method.",
            "score": 10,
            "replies": []
        },
        {
            "author": "Apidium",
            "body": "Note. This only works in American style grids. It absolutely does not work at all in Europe. If you do this where I live you will end up down a dead end and trapped. \n\nThis is frankly dangerous advice in some areas. I wish posts here specified nation more.",
            "score": 313,
            "replies": [
                {
                    "author": "nashbrownies",
                    "body": "I think most people can grasp if 4 right turns is a 27km loop or your 3rd right will take you down a road for 16km, it is not a viable option.",
                    "score": 150,
                    "replies": [
                        {
                            "author": "Guy-Inkognito",
                            "body": "Speak for yourself 😡",
                            "score": 17,
                            "replies": []
                        },
                        {
                            "author": "Dry-Magician1415",
                            "body": "People have literally driven into the ocean because their GPS told them to. ",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "nashbrownies",
                                    "body": "Yes indeed. And tens of millions (hundreds?) of people use a GPS 24/7 and it's a rare occasion even then.\n\nWe can do this all day, there is always going to be an outlier. But 99.99% of people will grasp the concept. And those who don't? Well that is a them problem.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "kidwithglasses",
                    "body": "Bold of you to assume American cities are walkable",
                    "score": 87,
                    "replies": [
                        {
                            "author": "Apidium",
                            "body": "I'm not following you on that one",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "kidwithglasses",
                                    "body": "Definitely an exaggeration lol. Just a popular thing on reddit to poopoo on American cities for not being as walkable as other areas of the world.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "jimmybabino",
                                            "body": "The closest city to me has zero sidewalks at the busiest areas. Not a one. It’s dealerships, supermarkets, and restaurants. No way to walk to any of them if you’re not in their parking lot",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "kidwithglasses",
                                                    "body": "All of the ones near me are super walkable. There are hundreds of cities in the US, definitely going to have different experiences across them",
                                                    "score": -4,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "savage_engineer",
                                            "body": "not much of an exaggeration tbh, the default is the stroad and by jove is it a pain for pedestrians",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "tert_butoxide",
                    "body": "Oh don't worry, this does not work in a lot of American cities either.",
                    "score": 38,
                    "replies": [
                        {
                            "author": "exolyrical",
                            "body": "It works on grid-layout cities which is *most* of them to be fair. Older coastal cities are the main exception, good luck trying it in Boston.",
                            "score": 32,
                            "replies": [
                                {
                                    "author": "djwm12",
                                    "body": "Yeah, if you try this in Boston you'll be in Providence pretty quick",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TheRealTengri",
                    "body": "Even in America I consider this horrible advice. If someone was trying to discreetly follow someone and then the victim did a full square, the follower would know that the victim knows they are being followed, then the follower would likely be a lot less discreet, making it a lot harder for the victim to escape.",
                    "score": 23,
                    "replies": [
                        {
                            "author": "BoseczJR",
                            "body": "Honestly yeah, if you suspect you’re being followed just go right for the police station and don’t bother with the driving in a circle thing.",
                            "score": 20,
                            "replies": []
                        },
                        {
                            "author": "Frowny575",
                            "body": "Or, depending on time of day, a random place like a store. Going in a circle is horrible advice.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "FrenchFryCattaneo",
                    "body": "It's true, one time I took four right turns and now I'm dead",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Electrical-Lab-9593",
                    "body": "if you are Europe on foot cross the road then cross back if they cross, that is normally a good sign if they cross back to your side again they are trying to follow you. the turning the same direction as mentioned could get you in a dead end.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Particular_Ticket_20",
            "body": "If you makee 4 right turns you can end up behind them.  Now who feels nervous?",
            "score": 9,
            "replies": []
        },
        {
            "author": "lakmus85_real",
            "body": "And if you are on a metro, exit a few stations early and jump back into another car. Chances that some random person will need to change cars the same time with you are vanishing. And them jumping back after you will give them away, forcing them to either stay on the platform, or  rush to another car.",
            "score": 10,
            "replies": []
        },
        {
            "author": "TwistedOvaries",
            "body": "If I make 2 turns with someone I try and slow down so I get stuck at a light. If a 3rd one would take me into a neighborhood I drive past the turn and go in another way. I’m so paranoid about being followed I don’t want anyone to think I’m following them.",
            "score": 9,
            "replies": []
        },
        {
            "author": "luckygirl54",
            "body": "True story: my friend was celebrating her birthday. She was overserved and on her way home. She thought someone was following her and pulled into the police station. Went in, the car following her passed on by, but she got ticketed for DUI.",
            "score": 28,
            "replies": []
        },
        {
            "author": "seaway48",
            "body": "Plot twist, they are following you cause you just stole their wallet.",
            "score": 51,
            "replies": [
                {
                    "author": "muchhuman",
                    "body": "Obviously. The advice (4 right turns) puts you back behind them so you can put the wallet back!",
                    "score": 14,
                    "replies": []
                }
            ]
        },
        {
            "author": "ZelGalande",
            "body": "This happened to me once when I was in high school. I stopped at the convenience store next to my neighborhood to grab an ice cream sandwich and ate it on my car. A man in the car next to me was pointing at me and I thought he was asking if I was backing out so I waved him off intending to let him leave. Except he stayed. When I left and drove into the neighborhood, I noticed he also did and had a weird feeling. I ended up driving past my block and out the other end of the neighborhood. I drove to my friend's neighborhood five minutes away and did four left turns, but the man was still following me. In a panic because I was a dumb kid, I called my friend and begged her to open her garage and let me in. She stood by the garage while I drove up and the man's car drove past and away. Her parents were home thankfully but looking back I do feel stupid for going to her house and potentially putting her in danger too.",
            "score": 7,
            "replies": []
        },
        {
            "author": "ColonelJayce",
            "body": "I needed to turn left and there was a dude going way over the speed limit (I was actually going about 10 over already). He was far enough behind that I decided to merge left anyway to get in the correct left lane to turn into a neighborhood. This dude got PISSED, he held his horn down for like 10 seconds that I would dare merge into the lane he was going 30mph over the speed limit in.\n\nAnyway I slowed down and made him hit a red light just to be an ass. He ran the red light and followed me in a circle like 4 times while I just kept taking left turns. I called the police immediately once I knew he was following me. He realized I wasn't going to stop so he left me alone.\n\nPeople are crazy.",
            "score": 8,
            "replies": []
        },
        {
            "author": "jaximilli",
            "body": "This is great advice if you’re driving in a predictability laid out city grid.\n\nDon’t try it in Boston.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Puzzleheaded-Hat9667",
            "body": "One time I was following my boyfriend’s (at the time) car so he could drop it off somewhere and I’d drive us back. He left without waiting for me to follow so I started following what I thought was his car, for like 20 minutes on the highway. My phone was almost dead, so I couldn’t call him, and before the ride we got into an argument, so I was sobbing. I had mascara and eyeliner running down my face and I was ranting and crying to myself the whole time, but assumed I was following my boyfriend. He did 4 left turns and I was so confused, but I just figured he kept missing a hard turn or got lost or something. The car went into some blocked off college you have to have a college ID to enter, and I realized the car I followed was not my bf and I looked like a crazed lunatic. I probably freaked that person out so bad!",
            "score": 9,
            "replies": []
        },
        {
            "author": "Hand-Of-Vecna",
            "body": "If you feel someone is following you on the sidewalk, cross the street and turn around walking the other way.",
            "score": 13,
            "replies": []
        },
        {
            "author": "GitEmSteveDave",
            "body": "I still remember the night  I accidentally followed some lady I honked at to my house.  \n\nWe were in a traffic circle, which in NJ means you have the right of way until you exit the circle.  She kept stopping at every merge though, so I eventually laid on my horn to get her to move.  She ended up taking the back road exit I take home, and as I'm behind her, she is taking every turn I take to get home, just before I can even hit my turn signal.  She eventually turns down my back road, and there's only two choices.  She makes a left, and goes down my road to where there's ~100 houses, or she makes a right and is on my block, where there's only 2 other houses besides mine and I know both my neighbors and the cars they drive.  \n\nShe made a right.  I decided then to make the left and pretend thats the way I was going.  I watch in my rear view and she stopped, banged a U-turn, then turned back down the back road.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Jonthrei",
            "body": "My test for if I was being followed on foot has always been to cross the street, see if they follow, then immediately cross back.\n\nIt has identified someone following me once, and I immediately put myself in a position that he decided wasn't worth the risk. I made it very clear I knew what he was doing and was ready to fight - walked to a group of people, turned, looked him dead in the eyes and armed myself with an improvised weapon.",
            "score": 8,
            "replies": [
                {
                    "author": "savage_engineer",
                    "body": "wtf... what was it, a simple mugging or?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Jonthrei",
                            "body": "Not sure, it started when he got *right* behind me at a bus stop and stood uncomfortably close. I turned so he was always in my vision and i had room to react.\n\nHe then followed me onto the bus, I waited to the last possible second to flag my stop and he followed me off so all the red flags were flying. Then things went as described.\n\nI think he was after my wallet (standing close behind someone is an old pickpocket technique I've seen before), but I don't keep my wallet in my back pocket.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "UltimaGabe",
            "body": "I did this once and it literally saved me from getting carjacked.\n\nMy wife and I had moved out of state and were driving back to visit family for the holidays. We got in late at night, and were staying at grandma's house so we turned into her subdivision. My wife and I have this little \"game\" we play where I pretend to turn down the wrong street, she rolls her eyes, and I get a good laugh. Not being one to pass up an opportunity, I turned down the wrong street.\n\nNow, I had noticed a car pulled into the subdivision after us, but of course it was nothing out of the ordinary. I also noticed they also turned down the \"wrong\" street and were still behind us. When I made another turn to get back on track, I noticed then that they were, again, still behind us.\n\nWe weren't in a hurry, so I decided better safe than sorry- so I just kept turning in a big loop. They followed us right up until it was clear that they were following us, at which point they made a sudden turn away and sped off.\n\nThe next morning, there were reports of people getting carjacked in that neighborhood. I'm 100% certain that would have been us if I hadn't played this stupid game with my wife. \n\n(I did call the police afterward and told them my story, not that it would be much help.)",
            "score": 7,
            "replies": []
        },
        {
            "author": "dumbsugarplumb",
            "body": "If I think someone is following me I start driving to the police station to scare them off",
            "score": 7,
            "replies": [
                {
                    "author": "SpiceWeasel-Bam",
                    "body": "if i think someone is following me I pull over and if they pass i start following them. ",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "griff_girl",
            "body": "This happened to me; an aggressive driver didn't like that I merged in front of him. I didn't cut him off or anything, nevertheless, it pissed him *off.* I could see him in my rear view mirror yelling, cursing, and gesticulating wildly. When I got onto the freeway, I could tell he was following me as soon as he paced me, changing lanes when I did, etc. It was the early 2000s, smart phones were still pretty new, and I didn't know where the nearest police station was or look at my phone while driving. \n\nI wound up exiting the freeway and going into the drive through of a fast food restaurant so I could ask the person working it for help. The guy had followed me to the restaurant and was watching me from a parking spot. He must have seen us both looking at his car because as soon as I told the person at the drive through window (there was no line) what was happening, he left.",
            "score": 7,
            "replies": []
        },
        {
            "author": "LeeHide",
            "body": "Not in Europe; in old cities, turning right four times does not bring you back to the start",
            "score": 5,
            "replies": [
                {
                    "author": "demonspacecat",
                    "body": "Probably end up in another city",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "yParticle",
            "body": "You can do the same thing in a less obvious manner. Sanitizing your route is just basic countersurveillance everyone should practice.",
            "score": 31,
            "replies": [
                {
                    "author": "SilentMeatball",
                    "body": "Can you please expand on that? I know it’s self-explanatory but could you go into details? I have personally never heard of  “sanitizing” your route.",
                    "score": 28,
                    "replies": [
                        {
                            "author": "FabulousComment",
                            "body": "It’s how you lose your tail bro - I do this shit all the time when the KGB or Mossad is on me, it’s basic\n\nAlways make right turns and loop back on yourself, don’t use turn signals, turn right on red whenever possible, roll through lights to keep them stuck on red\n\nSwitch to a taxi if you are sure your tail is not in view \n\nAll else fails duck into a crowded area with multiple entrances/exits - barriers are a plus",
                            "score": 32,
                            "replies": [
                                {
                                    "author": "muchhuman",
                                    "body": "You forgot grab someone of the opposite sex and start making out.  \nGrab a coat / shirt off the rack and change your outfit.  \n\n10/10 advice. Haven't been abducted for my in-depth knowledge of Fallout: New Vegas to date!",
                                    "score": 27,
                                    "replies": []
                                },
                                {
                                    "author": "SnakeJuce_1453",
                                    "body": "KGB and Mossad  lol",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "SirNuggly",
                            "body": "I'm assuming they mean choosing multiple routes that take you home rather than picking and using one every time. It just prevents people from knowing where you are at specific times. This can help with break-ins and stalkers but it's not foolproof and usually needs you to implement other things to make it work (randomly deciding to visit a park or a cafe but not on any particular day for example). It makes you a less appealing target because they don't know where you'll be at any given time.",
                            "score": 11,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "HebridesNutsLmao",
                    "body": ">basic countersurveillance everyone should practice\n\nWhere the hell does everyone in this thread live lmao 😂",
                    "score": 15,
                    "replies": [
                        {
                            "author": "yParticle",
                            "body": "_In Soviet Russia, Leader follows You._",
                            "score": 11,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "BarcaStranger",
            "body": "i do you better, i stop",
            "score": 4,
            "replies": []
        },
        {
            "author": "VirusZer0",
            "body": "*me who accidentally made 4 right turns by accident behind this guy that also did the same and now they think I’m following them 😫*",
            "score": 4,
            "replies": []
        },
        {
            "author": "RandomGuyWithPizza",
            "body": "I had to make five right turns in a row to get home from work back in the day",
            "score": 3,
            "replies": [
                {
                    "author": "keithgabryelski",
                    "body": "you live in boston",
                    "score": 1,
                    "replies": [
                        {
                            "author": "RandomGuyWithPizza",
                            "body": "I live in California but that was back in Michigan",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Holy_Smokesss",
            "body": "Lack of street smarts. Go ahead, walk down the dark isolated side street while someone is following you.\n\nYour first instinct instead should be to get to safety. Go in a restaurant and wait things out. If that's not an option, just jaywalk across the street to create a physical barrier.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Vimes-NW",
            "body": "Shit. I'm not an ambiturner. I can only turn left",
            "score": 4,
            "replies": []
        },
        {
            "author": "Mammoth26",
            "body": "This happened to me while walking my dog and I did exactly this! I turned right until I had gone in a circle and the driver with blacked out windows would go to the front of the block, wait for me to get there, then turn the direction I did. I was only a block from home but my husband was with my toddler so I called him and told him I was being followed if he could watch me while I walked past our home. I called 911 and went to a very busy intersection while my husband watched (unknown to the driver) and the driver had to keep going past that intersection. The police took it surprisingly seriously and allowed me to file a harassment complaint since I got the plates.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Zaphod1620",
            "body": "A fire department also works great if you are being followed. Firefighters are super vigilant about keeping the bay doors for the fire engines clear. Pull up to a fire station, park in front of the bay doors, and honk your horn. You will have several firefighters out coming out to see what's happening in seconds.",
            "score": 4,
            "replies": []
        },
        {
            "author": "MamaKiplak",
            "body": "Wrong, make only right turns until they decide it's not worth it",
            "score": 7,
            "replies": []
        },
        {
            "author": "jbarchuk",
            "body": "4 rights is not a 'rule.' The point is to do something that doesn't make *sense*.",
            "score": 11,
            "replies": [
                {
                    "author": "diablol3",
                    "body": "Can you think of something some idiot might not do that could be used as a hard rule?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "savage_engineer",
                            "body": ">Can you think of something some idiot might not do\n\nnot possible I'm afraid - given enough idiots, anything and everything can be expected",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "jbarchuk",
                            "body": "I'm trying to think of places where going into something but not continuing through 'normally' could trap the next car. Also recall the intent is to be able to call the police.\n\nIf in an urban area, pull into a paid parking lot. Then immediately leave through the exit gate, and stop. If the car follows, they're trapped until the car in front leaves the gate. They can call the police from there. What happens next is a tossup.\n\nPull into a bank drive through, go through a lane and stop just past the teller window. The car behind can't open the driver door because the bank window is there. Best if multiple lanes of ATMs or vacuums and the passenger door is also blocked.\n\nFor both of these obviously the car behind now knows they're caught \\*and\\* stuck, and what they decide to do is a tossup, but they had their options the whole time anyway. It could also put a parking lot attendant or bank teller in a situation, but the basic point is survival, and the driver is the one under active attack not others.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "CiTrus007",
            "body": "Reminds me of SDRs (surveillance detection routes) that cold war spies used to check if they were followed before proceeding with their assignments. Crazy stuff if you read about it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "LoosieGoosiePoosie",
            "body": "I once intended to do this because a car had followed me on an extremely weird route that I take home (it's just the most direct way and avoids main roads and stop lights). Every single turn I made, I noticed him about 6-7 cars back, making the same turn. When it came to turning onto my road, I did so with the intention of turning off a couple blocks before my house. As I got closer, I guess the geography refreshed my memory? I suddenly remembered the people who lived across the street from me drove a white Chevy, and it dawned on me that this guy was just driving home. Most direct route. Avoid stop lights.",
            "score": 3,
            "replies": []
        },
        {
            "author": "amandanick7",
            "body": "My mom always said if someone’s following you go straight to the police station.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Substantial_Back_865",
            "body": ">call the police \n\nInteresting proposal, but that doesn't help if I'm being followed by the police",
            "score": 3,
            "replies": []
        },
        {
            "author": "killerkartoon",
            "body": "Fuck it, do ten!",
            "score": 3,
            "replies": []
        },
        {
            "author": "amla819",
            "body": "Then drive to the nearest police station",
            "score": 2,
            "replies": []
        },
        {
            "author": "Puppet007",
            "body": "Isn there a number to call when you’re out on the road and there’s a car following you?",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 2,
            "replies": [
                {
                    "author": "Beebonh",
                    "body": "Three",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "redpatcher",
            "body": "“I took four lefts, just like the map said.”",
            "score": 2,
            "replies": []
        },
        {
            "author": "MartinThunder42",
            "body": "A while back, this huge truck (F-250?) started tailgating me while I was driving at night. I took a turn off a main road into a residential area. Turn left, turn right, turn right, turn left. Damn truck kept following me. I looked up a police station on my nav and started driving towards it while increasing my speed and zigzagging through the neighborhood.\n\nBy the time I got to the police station, the truck was lagging behind a tad in the turns. (I drive a very nimble car.) As soon as I pulled into the station and parked, I killed the engine and the lights. The truck raced past. Either he saw me but saw where I was parked, or I managed to shake him in the nick of time. I waited 10 minutes to make sure he didn't double back before driving home.\n\n(I pulled into the police parking lot like a bat out of hell, way over the speed limit, but not a single cop came out to question me what was going on. Don't they have surveillance cameras outside the building?)\n\nTo this day, I have no idea what I did that made him follow me like that. Did I cut him off? Was he planning on carjacking me? Did he decide to hassle a small car with his monster truck just for laughs? No idea...",
            "score": 2,
            "replies": []
        },
        {
            "author": "Kuzkuladaemon",
            "body": "*me who likes to walk around the block a few times* oh no",
            "score": 2,
            "replies": []
        },
        {
            "author": "BootsOfProwess",
            "body": "This does NOT work if it's the police following you.",
            "score": 2,
            "replies": []
        },
        {
            "author": "doomgiver98",
            "body": "What about while biking?",
            "score": 2,
            "replies": []
        },
        {
            "author": "IamSunka",
            "body": "My first girlfriend, the first time we met in person. I picked her up and decided to go to a restaurant. She was giving directions to a restaurant which she had chosen and I was driving. She made me take 4 right turns, then she was surprised that I took her back to the same spot that we drove past.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Baron_VonLongSchlong",
            "body": "If you make 4 turns fast enough, then they become the followed. Life hack.",
            "score": 2,
            "replies": []
        },
        {
            "author": "frankydie69",
            "body": "My small town thinks everyone is following them lmao I just moved here a few years ago and it seems like everyone thinks they’re the number 1 criminal. Lowkey hate it here lol",
            "score": 2,
            "replies": []
        },
        {
            "author": "reshsafari",
            "body": "I make four right turns looking for parking in manhattan",
            "score": 2,
            "replies": []
        },
        {
            "author": "jagenigma",
            "body": "If you're walking, go inside the nearest store and be by the cashier's. If you're in a big city.\n\n\nIf you're walking alone in the middle of buttfuck nowhere, find something on the ground and prepare to fight for your life.",
            "score": 5,
            "replies": []
        },
        {
            "author": "camboSoup_",
            "body": "I’ve made 4 consecutive rights before. But\nI was just looking for a parking spot",
            "score": 2,
            "replies": []
        },
        {
            "author": "sammyraid",
            "body": "Why not just walk into a dark alley and see if they follow you?",
            "score": 2,
            "replies": [
                {
                    "author": "Holy_Smokesss",
                    "body": "I prefer to just invite them into my house",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "suesueheck",
            "body": "Do a u turn, completely turn around while staring directly at them.",
            "score": 1,
            "replies": [
                {
                    "author": "Climaxite",
                    "body": "That’s what I do, and I do it aggressively to let them know I know they are following me. ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Arad0rk",
            "body": "What if you never stop driving or walking?",
            "score": 1,
            "replies": []
        },
        {
            "author": "CelticSith",
            "body": "When I walk around the block, I make four right turns.  Guess I'm \"not normal\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "catresuscitation",
            "body": "I got followed to my work desk and my employer says it’s okay because they didn’t hit me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "darkkite",
            "body": "rather drive to a police station and hope they're scanning license plates",
            "score": 1,
            "replies": []
        },
        {
            "author": "yogtheterrible",
            "body": "I'll use this to fuel my overthinking as I drive home from the store and someone is behind me for more than a minute.",
            "score": 1,
            "replies": []
        },
        {
            "author": "V6Ga",
            "body": "Four right turns equals four left turns\n\nChirality notwithstanding. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Raxian_Theata",
            "body": "this is good advice.  I have a different method.   I keep a plastic knife and fork in my pockets.  If someone I don't know approaches me and my Pit-mix Rocky. I pull them out and say in my most inbred Alabama voice \"Thank you lord for this meal I am about to receive\" , I grin as big and crazy as I can, and than my dog and I run toward them.  I have only had to do this 1 time in 20 years of waking at night.  Still better safe than sorry",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rometwopointoh",
            "body": "When I was 19 I drove to McDonald at 2am and on my way back, I noticed a car following me aggressively.\n\n4 right turns and he was still behind me. On the next turn I quickly blocked the road. That was enough to spook him, and then I started following him. \n\nHe pulled over and was pretending he needed directions from a pedestrian. I pulled up to his window and yelled “don’t fuck around!”",
            "score": 1,
            "replies": []
        },
        {
            "author": "Happycarriage",
            "body": "least obvious bot ai generated post",
            "score": 1,
            "replies": []
        },
        {
            "author": "drowningintime",
            "body": " Pretty unrelated but one time after a bar this girl and I wanted some taco bell. I woulda easily blown over.. A cop was following us. Luckily our towns hospital was sooo close. I said just grab my hand, let's go inside and ask for someone.",
            "score": 1,
            "replies": []
        },
        {
            "author": "garbagegal69",
            "body": "A man once had eyes on me at the grocery parking lot and started following me once I pulled out. I did the four right turn thing and he was still following me, but it was semi rural and there were no police stations or fire stations nearby. There WAS a local park with a kids baseball game going on. I pulled into that and waited until he finally drove away before going home right down the street",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tracybytheseaside",
            "body": "Can confirm after a long-term stalking. Making four rights messes them up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "snakemakery",
            "body": "What if I just shit on their windshield?",
            "score": 1,
            "replies": []
        },
        {
            "author": "areeyeseekaywhytea",
            "body": "I’ve had a situation where I was being followed m, I drove straight to the police station lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sign-Spiritual",
            "body": "Two wrongs don’t make a right. But three lefts do!",
            "score": 1,
            "replies": []
        },
        {
            "author": "elphiekopi",
            "body": "I really support pulling into a police station. Once, I was worried about being followed and simply lost myself in the city for a bit before heading home. I worried. What if I was followed? What if they knew where I lived? \n\nAnother time, I was absolutely followed. That time, I drove directly to the police station and parked. It was pitch black, no cops in sight. The following car floored it and drove away fast. I drove home and felt safe.",
            "score": 1,
            "replies": []
        },
        {
            "author": "False_Local4593",
            "body": "I've been concerned a couple of times and made sure to not go home and fortunately they were just people who lived in my neighborhood and off my street. They followed me for quite a distance which concerned me. But I also have wondered if someone thought I was following them because of the same thing. 2 people from the same neighborhood just happened to be leaving the same place quite a distance away from our neighborhood.",
            "score": 1,
            "replies": []
        },
        {
            "author": "phxflurry",
            "body": "I work for 911 in a large city. We never tell people to pull over anywhere when they're being followed. If the person following wants to hurt that person, they're going to do it regardless of an audience. Our city doesn't leave officers at precincts, so pulling into a police station isn't always a safe option. We tell people to keep making right turns at major intersections, so they're going in a box and officers can intercept the vehicle that's following. If they're on foot it's not as cut and dry but it's still a priority 1, lights and sirens type call.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Vandal_A",
            "body": "I did this once to a cop who was following me when I was a teenager. He'd seen a bunch of kids leaving a house and either assumed we were drinking or just wanted to f with us (it was that type of place). Soon as I made the fourth turn he pulled me over. When he asked I told him I was going in a circle bc the car behind me was obviously following me bc, while I had made the 3rd right to go back to the house for something I forgot (true), I knew there was no good reason for someone else to bc the way the neighborhood was set up, so I made a fourth to check. He got red and flustered and I played it up pretending I was worried about some car following me. He muttered something about how I should drive to the police station next time, clearly not having the fun he was expecting.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Embarrassed-Weird173",
            "body": "Make five turns.  If they were going straight and turned right and then thought, \"oh crap, I was supposed to keep going straight\", they might make four turns to continue.  If you make five right turns and they follow, they'd have had tons of time to remember early on and make a u turn earlier, so it would be a crazy coincidence to follow you for that long. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Redditor_throwaway12",
            "body": "Always thought driving to nearest military base was also a good option. Those gate  guards would definitely stop me, but also once in queue, there’s not an easy way for anyone following to just turn around.",
            "score": 1,
            "replies": [
                {
                    "author": "WeaponB",
                    "body": "Nearest military base is like 3 hours away for me...",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Redditor_throwaway12",
                            "body": "I’m in a military town- they’re everywhere.  I think the point of this YSK is always have a plan.   \n\nI honestly have no idea where my police stations are.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Away_Adeptness_2979",
            "body": "If you want to know for SURE, loop back around for seconds at a drive-thru",
            "score": 1,
            "replies": []
        },
        {
            "author": "Salnder12",
            "body": "I was sure I was being followed, their was a traffic circle coming up so I decide to go through the entire circle and exit onto the street I needed to be on. The car follows me the entire way and I soon as it's out of the circle it hits the lights and pulls me over.\n\n\nCop: may I ask why you went all the way through the circle?\n\nMe: yeah because I thought the person behind me wasing following me.\n\nCop:......oh",
            "score": 1,
            "replies": []
        },
        {
            "author": "Emotional_Pace4737",
            "body": "4-right-turns only works if you're following a city block.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ArthurSeanzarelli",
            "body": "If you can make three turns (any direction) in less than 10 seconds without the car seeing you, they'll lose you",
            "score": 1,
            "replies": []
        },
        {
            "author": "skbailey711",
            "body": "Drive to a liquor store if a police station is not near by. Most liquor stores have an insane amount of cameras .",
            "score": 1,
            "replies": []
        },
        {
            "author": "Boring_3304",
            "body": "How common is this, really? How often is the average person followed?",
            "score": 1,
            "replies": []
        },
        {
            "author": "1_headlight_",
            "body": "Three rights are enough to know. On a normal grid of streets, anyone making three rights would've more easily made a single left turn.",
            "score": 1,
            "replies": []
        },
        {
            "author": "QueefMyCheese",
            "body": "Don't do four left turns though that doesn't work",
            "score": 1,
            "replies": [
                {
                    "author": "but-whyy-tho",
                    "body": "It doesn't! Taking 4 left turns will always lead you right to your stalker's home.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "WibbleWobble22",
            "body": "I got followed once for two miles by a road rage driver. I should have done this, I ended up panicking and getting stuck behind them in traffic. Out of a lifted matte black truck came a 4'9\" manlet who threw an iced coffee taller than him at my car before driving over a median to make his escape.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Good-Occasion-7099",
            "body": "I was once followed home by an angry road rager. Even followed me up my driveway.  Man was he surprised when I open my garage door and my sisters gigantic boyfriend and all his buddies were in there.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lothcent",
            "body": "but what if it is 2 cars following you- and both drivers are arduant readers of reddit and know of the mystical 4 right turn trick.   so one car follows you make those 4 right turns- while car 2 pulls to the side and waits for the 4th turn and car 1 doesn't make the 4 turn- then you are unsuspectingly going past car 2 and heading home thinking you are safe \n\nmeanwhile car 1 is now further back just waiting to join the part at your house.\n\n\n\nand if you were primo stuff-- I am sure they could add more cars to the following- after all- there is a party in it for them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HiyameMifa",
            "body": "Sometimes 4 right turns might cause suspicion from the follower. I suggest a left then 2 rights then a left again (if able). It puts you back on the same path, which they would have no reason to follow as well. 4 rights may end up with you walking into your follower any pursues behind him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "princesscuddlefish",
            "body": "I did this once, and called the police station to let them know I was coming and asked to have an officer come out to make the person go away. Turns out it was a cop following me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "smellslikebigfootdic",
            "body": "1:05 \nhttps://youtu.be/BLxrCACUmV4?si=RT-oW1TxcJGzp9dH",
            "score": 1,
            "replies": []
        },
        {
            "author": "Spiritual_Big_9927",
            "body": "What if they're the feds?",
            "score": 1,
            "replies": []
        },
        {
            "author": "HalfaSpoon",
            "body": "I was being followed once on a highway, keeping perfectly in speed with me, looking at me, ect. Tried to pull infront of me right before an exit. Luckily he forgot tbat the exit lane was also a truck lane so instead of turning off with my blinker on, i kept straight. He went and tried to remerge and i slammed on the gas. He gave up at that point, thankfully.",
            "score": 1,
            "replies": []
        },
        {
            "author": "tardigrade37",
            "body": "Alternative: drive all the way around a roundabout. I did this to shake a dumptruck that was tailgating me",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hooper627",
            "body": "Now you’re following them",
            "score": 1,
            "replies": []
        },
        {
            "author": "earthwormjimwow",
            "body": "> -Lead you back to your starting point\n\nIf you travel far enough on each leg, you can do the same with only 3 right turns, since we live on a globe!",
            "score": 1,
            "replies": [
                {
                    "author": "Aliceable",
                    "body": "Slim chance they could have missed a left turn and did 3 rights to get back and catch it. \n\nNo chance they wanted to continue going straight but after a 4 turn detour.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "earthwormjimwow",
                            "body": "It's a joke about spherical geometry, the equivalent of a triangle on the surface of a sphere can have three 90 degree corners.  Meaning on the surface of a sphere, you don't have to make four 90 turns to get back to where you started, you only have to make three 90 degree turns, provided you travel far enough on each leg of the turn.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "hudsoncress",
            "body": "[ Removed by Reddit ]",
            "score": -3,
            "replies": []
        },
        {
            "author": "hruebsj3i6nunwp29",
            "body": "[Could get out and ask'em.](https://youtu.be/-GAM_2aPwls?si=UHHn4HNuWhIb-B71&t=62)",
            "score": 0,
            "replies": []
        },
        {
            "author": "Semour9",
            "body": "I had someone follow me home from work once because, at 12 at night, they mistook my hand gesture saying they could park where I was for “follow me home” apparently.",
            "score": 0,
            "replies": []
        },
        {
            "author": "hollaSEGAatchaboi",
            "body": "Do not got to a police station lol",
            "score": 0,
            "replies": []
        },
        {
            "author": "ayinsophohr",
            "body": "What you should do is make a left turn, followed by a right turn and keep repeating this pattern. If done correctly you should reach a tunnel where no tunnel existed before. Enter and once on the other side continue to keep to the pattern, a left turn followed by a right turn. Eventually you will see a hitchhiker. Pick him up but regardless of what he says do not speak to him or accept anything he gives you. With any luck the hitchhiker will deal with your follower.",
            "score": 0,
            "replies": []
        },
        {
            "author": "thezuffymammoth",
            "body": "2 wrongs don't make a right, but 4 lefts do",
            "score": 0,
            "replies": [
                {
                    "author": "that_blasted_tune",
                    "body": "3 lefts",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "rememberall",
            "body": "What is you are in a place that only has one way streets and 4 rights is just \"the way\"? ",
            "score": -1,
            "replies": []
        },
        {
            "author": "Paper_Patience",
            "body": "No one is chasing you. Paranoid af",
            "score": -21,
            "replies": [
                {
                    "author": "scorpious",
                    "body": "Until they are, and then you are a statistic, the fool who insisted on \"not being paranoid\" despite mounting evidence that you were actually in danger.",
                    "score": 14,
                    "replies": []
                }
            ]
        },
        {
            "author": "Excellent-Baseball-5",
            "body": "Concealed carry permit also works.",
            "score": -8,
            "replies": [
                {
                    "author": "Existing_Phone9129",
                    "body": "no, a hidden gun does not deter from being stalked. you just get stalked and then you possibly kill 1+ people on top of that",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Excellent-Baseball-5",
                            "body": "There certainly are nuances to armed self defense…",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Existing_Phone9129",
                                    "body": "hence why i said ***kill*** instead of ***murder***. killing may or may not be legal, murder never is. use your head",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Excellent-Baseball-5",
                                            "body": "OK. I’ll use my head. Thank you for the profound guidance.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Unlucky-Pumpkin2786",
            "body": "Exit the vehicle run around your vehicle like your on fire. Start rolling on the ground. \n\nRicky Bobbie style.",
            "score": -3,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -11,
            "replies": [
                {
                    "author": "koenigsaurus",
                    "body": "Bad bot",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "leebleswobble",
            "body": "How is this a YSK?",
            "score": -4,
            "replies": [
                {
                    "author": "Ranku_Abadeer",
                    "body": "It's basic personal safety information. Why would it not be?",
                    "score": 0,
                    "replies": [
                        {
                            "author": "leebleswobble",
                            "body": "It's written as lpt.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Ranku_Abadeer",
                                    "body": "What? I genuinely don't understand what you're getting at here.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -41,
            "replies": [
                {
                    "author": "synapse187",
                    "body": "In some relativistic way you always stalk yourself.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "lankymjc",
                    "body": "Do it fast enough and you’ll yourself in your own mirrors!",
                    "score": 6,
                    "replies": []
                }
            ]
        }
    ]
}