{
    "title": "I thought I’d never see the day",
    "author": "Allhaillordkutku",
    "subreddit": "Helldivers",
    "rank": 11,
    "score": 3793,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 229,
    "url": "https://i.redd.it/mbuetwqkcfpe1.jpeg",
    "id": "1je1q0f",
    "selftext": "",
    "comments": [
        {
            "author": "SadMcNomuscle",
            "body": "Now that's democratic!",
            "score": 587,
            "replies": [
                {
                    "author": "Zackyboi1231",
                    "body": "Pentagon thief be like: \"what you got a CB-9 exploding crossbow? Nah keep that bro\"\n\nhttps://preview.redd.it/ml7ze018sfpe1.jpeg?width=515&format=pjpg&auto=webp&s=d8490a6d3dfb9b707472c93068d68e9c0fb5fa85\n\n*this comment was made by true R-36 eruptor fans*",
                    "score": 215,
                    "replies": [
                        {
                            "author": "Mr-dooce",
                            "body": "close enough \n\nwelcome back m14 gang",
                            "score": 59,
                            "replies": []
                        },
                        {
                            "author": "AFriendlyGnome",
                            "body": "Is it just me or did this guy scare the living SHIT out of you when he spawned..",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "Rusty_Jake",
                            "body": "Can't get you if you glitched onto the table\n\n![gif](giphy|d3mlE7uhX8KFgEmY)",
                            "score": 12,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ReflectionNo9912",
                    "body": "I'm all about buffs, but why is this that big of a deal? It didn't get a damage buff and still takes eternity to reload. The pen is nice but it stopped needs a little more to be viable unless I'm missing something",
                    "score": 4,
                    "replies": [
                        {
                            "author": "No_Collar_5292",
                            "body": "The effect of ap3 vs ap4 against an ap3 target will be equivalent to like a 40% impact damage buff.  This will affect certain breakpoints that the gun previously struggled against for consistent 1 shots and add some new utility.  Examples off the top of my head would probably include hiveguard direct face hits, overseer heads, devastator chests (when not quite making your headshot), bile spewer heads, rocket strider leg/pelvis.  This will also allow the weapon to take out hulks with relative ease which is big if you want to run stalwart on bots and want something besides a senator (ultimatum) for structures and striders.  I suspect it will improve 1 shot tendency on gunship engines and maybe make turret vents a 2-3 shot now as well. You can also kill bunker turrets with it now….but that will be very slow. It should also greatly ease the rate at which a harvester leg goes down as the impact was doing most of that already. Titans and chargers it shouldn’t change much other than being able to add chip damage to other weapons, like the senator.  \n\nEdit:  I should add that you can drop a charger with the senator in 1 mag if you let them charge past you and manage to unload all 6 shots directly into the booty.  This happens due to overpenetration into a 300% to main 30% durable internal hitbox, a mechanic I don’t fully understand but it allows railgun to 1 shot them and AMR to 3 shot them.  Senator rounds are about half an AMR so that explains that.  I don’t think AP4 is going to change its overpenetration ability and even if it does it would be 4-5 via that method alone unless the shrapnel is also able to overpenetrate.  It would be crazy if it could now be 2.  Seriously doubt it.",
                            "score": 42,
                            "replies": [
                                {
                                    "author": "saagri",
                                    "body": "It also goes from 126m max range to 180 due to the projectile lifetime buff.",
                                    "score": 36,
                                    "replies": [
                                        {
                                            "author": "No_Collar_5292",
                                            "body": "Indeed!",
                                            "score": 8,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "ReflectionNo9912",
                                    "body": "Very cool. I didn't know it affected tiers below the top pen. Makes sense. Will try it out when I get home. It is a cool gun, I'd love for it to not suck",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "No_Collar_5292",
                                            "body": "Learn the quick fire tech where you switch to secondary then back or open strategem menu for a sec then close.  Once you do that your fire rate doubles and it’s very very good.  It can 1 shot many enemies a crossbow requires 2-3 to kill and with that, does it at roughly the same fire rate. Now that “should” happen more frequently.  It’s an unintended method sure, but so is animation skipping the end of the recoilless reload animation and that’s something everyone seems to recognize as “the way” so why not.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "alpackabackapacka",
                                                    "body": "Big eruptor fan, can do the speed load but I choose not to to save my fingies after a few hours of doing it lol",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "ShortYellowBus",
                                                            "body": "I just set primary to mousewheel up and secondary to mousewheel down so I can just spin in the direction I want without worrying about it cycling.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "No_Collar_5292",
                                                            "body": "I hear you lol.  I usually use the control key with my left pinky and that doesn’t seem overly tiring.  I’ve considered making a macro to ready the next shot with my mouse software for giggles and once did for a total msg dump stupidly fast but obviously that’s not a thing you’d ever actually use and was entirely impractical just to see how fast you could theoretically make it work (fast)",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Critical999Thought",
                                    "body": "bro, it glanced off from the armour of bile titan, same with hulk and chargers, the weapon is good now, i like it, did some craaaaaazy kill streaks on the bug front, but unless there's something wrong, but i clearly have seen in glanced off every time.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Contrite17",
                                    "body": "All of this could have been trivially done with AP 3 direct hit damage buffs :/, zero need to trivialize hulks further as that is the only thing AP4 really does that AP3 cannot.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Muted-Account4729",
                                            "body": "You gotta two shot the hulk with a slow firing, slow projectile six round mag, and have to engage within 180 meters. The average diver isn’t gonna be consistent with that. It’s roughly the same ttk as the senator. It also gives a diver without dedicated anti armor an ability to slowly contribute to a factory strider or titan takedown. I think it’s a good differentiation for the eruptor over the crossbow",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "Contrite17",
                                                    "body": "I mean you can contribute to Factory Strider and Titan kills with AP3, in fact for Bile titans at the very least it is still optimal to shoot the underbelly not the head (I haven to checked Factory Striders)\n\nAP4 almost exclusively affects hulk frontal kills as every other heavy has too much HP for the damage to be meaningful.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "No_Collar_5292",
                                            "body": "I tend to agree, or simply restoring its original shrapnel profile.  I railgun hulks in droves anyway though so it’s not going to change their level of triviality for my typical builds.  I’d say it just opens other things up which I know arrowhead tends to like.  It needs to be much stronger than the crossbow to justify its many downsides, I suppose this is a way.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "The_Captainshawn",
                                            "body": "This moves the needle in a way that doesn't make it fly out of proportion.  increasing the AP3 damage would've meant needing to increase the base damage by a proportional amount (+35%) but then it's doing quite a bit extra damage to BT underbellies, Charger butts, hulk vents etc. AP4 gives it no high TTK than the Senator for direct damage but smooths out its performance by effectively bumping its damage by that 35% for Devastators and below.\n\nThe biggest loser isn't the Hulk though it's the Harvester. AP4 with all the AP3 shrapnel is going to ruin it's day.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Contrite17",
                                                    "body": "> but then it's doing quite a bit extra damage to BT underbellies, Charger butts, hulk vents etc.\n\nI mean is this not WHY everyone wants AP4. To threaten heavy units more. Giving an 120 damage increase to impact damage would not break any interactions with these units and would be exactly the same vs AP3 units and better vs AP2 and below (who die anyway to the explosion and shrapnel anyway).\n\n> The biggest loser isn't the Hulk though it's the Harvester. AP4 with all the AP3 shrapnel is going to ruin it's day.\n\nThe only change for the harvester is 80 more impact damage... which we could have just done with +120 impact damage (equivalent to essentially 1 extra piece of shrapnel hitting). AP 4 is only required if we want to shoot Hulk eyes.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "JonDenero",
                            "body": "can close bug holes, fabricators, and park ships. Deal with hulks and maybe just maybe kill bile titans/factory striders...",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Critical999Thought",
                                    "body": "not sure how it deals with hulks, aimed for the eye today to try the newly buffed eruptor out, it glanced off.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Harlemwolf",
                            "body": "Eruptor was really good already with appropriate eq combos. Now it is solid gold tier.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "RussianDisifnomation",
                    "body": "Democracy stonk 📈🚀",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "EinsamerZuhausi",
                    "body": "Some may say... democratic detonation.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Utkalon",
            "body": "WHAT THIS IS TRUE?",
            "score": 201,
            "replies": [
                {
                    "author": "Duckinator324",
                    "body": "Yes, todaya patch (new wsrbond trailer too)",
                    "score": 98,
                    "replies": [
                        {
                            "author": "Blueverse-Gacha",
                            "body": "I CAN FINALLY USE THE WEAPON I WANT TO!\n\n# **YEAAAAAAAAHHH**",
                            "score": 43,
                            "replies": []
                        },
                        {
                            "author": "AdhesiveNo-420",
                            "body": "Another warbond?? Man I just saved up for the last one",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AdWest2648",
            "body": "https://preview.redd.it/mj708lpxlfpe1.jpeg?width=640&format=pjpg&auto=webp&s=6f714db9da0067dde004973f37657388c1f651a1\n\nBad day to be a Terminid Charger.",
            "score": 141,
            "replies": [
                {
                    "author": "SyncShot",
                    "body": "It wont change it's behavior against a Charger.  You'd need 13 shots to its head to kill it.  9 shots to strip its leg armor.  So you can, but you'd still want to aim for their butts",
                    "score": 38,
                    "replies": [
                        {
                            "author": "Insane_Unicorn",
                            "body": "It's decent to finish off wounded chargers for example when helping your sentry and can one tap charger butts. Pretty good for a primary weapon.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "SyncShot",
                                    "body": "Right, but that isn't changed by the AP buff is all I'm saying.  It's not doing more damage to their butts because of this.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Spirited-Zucchini-47",
            "body": "I actually started using the eruptor on all fronts about a month ago and still love using it.",
            "score": 219,
            "replies": [
                {
                    "author": "ZenkaiZ",
                    "body": "yeah people always say \"it sucks because the crossbow is better\". That's like saying Vegeta is weak because Goku is stronger, it was still a good gun.",
                    "score": 102,
                    "replies": [
                        {
                            "author": "kingl0zer",
                            "body": "It was so much better on release it's been nerfed buffed and buffed again so I'm excited to play around with it but release one was so strong and stupid fun",
                            "score": 34,
                            "replies": []
                        },
                        {
                            "author": "Hello_There_2_0",
                            "body": "But when you have goku and vegeta free to use, it isn't worth to use vegeta.\n\nOnly if you want to have fun with vegeta.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "DiomedesTydeus",
                                    "body": "If I needed someone done dirty, I'd pick Vegeta. Like when I want to kill a bug and 5 of his closest friends... moments like that.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Phantomebb",
                            "body": "It's always had significantly more damage potential due to the shrapnel but it's so hit and miss. It's also better vs bugs but harder to use vs them. I'm really excited to try it.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "TheRealGingerBitch",
                                    "body": "Naw man, its fantastic vs bots, can shot it into bot factories from so far away, now even further",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Phantomebb",
                                            "body": "Unless your straight on it explodes without entering far enough to kill it.",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Tokyo_Echo",
                            "body": "I still want the shrapnel back",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Spirited-Zucchini-47",
                            "body": "I always felt like the eruptor is a mini airburst and i agree it's a completely different weapon.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Thanes_of_Danes",
                            "body": "Honestly it felt like a pure bug front weapon to me, but now that it got heavy pen I can see use cases on all fronts.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Sithishe",
                    "body": "Yeah SAME! I already have anti bot and anto bug Eruptor loadouts! Love to see massive buff to the weapon I am already used to!",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Spirited-Zucchini-47",
                            "body": "What is your eruptor loadout for both fronts? \n\nI'm a fan of running the stim pistol with the eruptor and stick by the team.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Xero0911",
                    "body": "I was but crossbow felt better in the end due to basically doing the same thing but faster.\n\nWill for sure give the eruptor another go.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "lilpeachboy",
                    "body": "I am literally never putting this gun down ever again. One shots devastators, 180m range, takes out hulks. I don’t need a support weapon.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Spirited-Zucchini-47",
                            "body": "An amazing weapon! \nI recently learned that for one shot kills, you dont always aim for the weak spot, but rather aim for a spot that hits the most explosives in one shot.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "illiterateboii",
                    "body": "It was hard picking it over the crossbow but now I actually have good reasoning for it",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Knuroid9000",
                    "body": "Never stopped using it",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sheep_in_wolfclothes",
            "body": "I’m about to erupt!",
            "score": 74,
            "replies": [
                {
                    "author": "mranderson2099",
                    "body": "Eruptor, hell I barely knew her!",
                    "score": 17,
                    "replies": [
                        {
                            "author": "PerceiveEternal",
                            "body": "\\[Live Studio Audience erupts in laughter\\]",
                            "score": 12,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Electronic-Flower921",
            "body": "The Crossbow is in shambles",
            "score": 85,
            "replies": [
                {
                    "author": "xTekek",
                    "body": "crossbow is still good as a higher rate of fire weapon thats more efficient at destroying spawners. This just gives the eruptor a niche.",
                    "score": 71,
                    "replies": [
                        {
                            "author": "Electronic-Flower921",
                            "body": "Its a joke",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "9inchjackhammer",
                                    "body": "Crossbow users SEETHING!",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "WithinTheGiant",
                                            "body": "Eruptor EVISCERATES Crossbow in new update.",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "QueryCrook",
                                            "body": "If they start malding, I'm outta here.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "gizakaga",
                    "body": "The crossbros welcome the eruptor back to the meta. The more strong, stupid weapons the better.",
                    "score": 32,
                    "replies": [
                        {
                            "author": "Any_Sample_8306",
                            "body": "Nah, the eruptor still has that dreadfully slow RoF, so i don't see it becoming a meta weapon.\n\nAlso the problem with always buffing is that AH will inevitably leave weapons behind until they realize it after a couple patches, honestly they should just focus on adding new challenges instead of forever tinkering with the gear.",
                            "score": -14,
                            "replies": [
                                {
                                    "author": "gizakaga",
                                    "body": "I think it makes it even more viable as a sort of situational backup for a support weapon build. Plus it's cool, and if it now also blows pretty much everything up im gonna be more inclined to use it for the fun factor alone",
                                    "score": 14,
                                    "replies": []
                                },
                                {
                                    "author": "Electronic-Flower921",
                                    "body": "How do Factory strider patrols with one of them having a jammer on the top sound? Sounds like a challenge to me",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Any_Sample_8306",
                                            "body": ">How do Factory strider patrols with one of them having a jammer on the top sound? Sounds like a challenge to me\n\nYeah, and they should focus on **that**, not on eternally buffing some stuff and leaving others to rot until they realize, and to the same song and dance again with some other gun. \n\nI just want them to finalize weapon balance and be done with it.",
                                            "score": -9,
                                            "replies": [
                                                {
                                                    "author": "Classy_communists",
                                                    "body": "Not sure if you’re aware but they did implement factory strider convoys with a jammer as a side objective. \n\nAs new content gets added, you still have the rebalance old guns somewhat for the new content. Otherwise people get mad that their favorite gun isn’t viable, or another is overpowered. So you have to balance somewhat. The pace of the content is fine in my opinion, so the way they are allocating devs to balance v new content is fine.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "Any_Sample_8306",
                                                            "body": ">Otherwise people get mad that their favorite gun isn’t viable\n\nSo why haven't they also the Lib Pen? or the Dominator? My problem is that AH buff some things and leaves other to rot, and then do it again and again instead of doing decent, finalized, blanket balancing.\n\nBut of course i am on r/Helldivers, simply mentioning the words \"Buff\" and \"No\" in the same sentence drives people insane for some reason.\n\nEDIT: Also this was a Buff on Primaries, that has no impact on fighting striders really.",
                                                            "score": -6,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "SkanakinLukewalker",
                                    "body": "Rate of fire is fine if you hit your shots, Diver",
                                    "score": 0,
                                    "replies": []
                                },
                                {
                                    "author": "DamezUp",
                                    "body": "You can pull your stratagem ball out and put it away to skirt the bolting animation and basically double the fire fate when you get the timing down. It’s really not that bad",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ch0m5",
                    "body": "The crossbow is one-handed and fires faster. Using it along with a Ballistic Shield in the bot front makes devastators a non-issue, even if caught in the open.\n\nEruptor and Crossbow were very same-y, I welcome this change as each weapon can have a more unique purpose and identity.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "gunnar120",
                            "body": "Ballistic shield also makes you borderline immune to bugs. I've been using that combo with whatever secondary and light armor on Super Helldive and I only die when my barrages or teammates kill me.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "qwertyalguien",
                    "body": "It got erupted",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "XD_TOASTY_DX",
                    "body": "One-Handed equipable with both shield backpacks.  \nFaster firing.  \nIt just has its own place now like it should have been.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Terran_Lifeform",
            "body": "WHAT!? WHAT!? LETS FUCKING GOOOOOOOO\n\nhttps://preview.redd.it/25s3097slfpe1.jpeg?width=1170&format=pjpg&auto=webp&s=6b81995069345fef284fffb8acf2d245307b3b1d",
            "score": 68,
            "replies": [
                {
                    "author": "lilpeachboy",
                    "body": "I have been advocating for this gun for a few months now. I won’t shut up about it, I’M SO HAPPY\nMaybe it’ll finally get the recognition it deserves",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Few_Classroom6113",
            "body": "It now:\n-2-shots hulk faceplates\n-1 shots devastator faces\n-reliably 2-shots gunships\n-allows side shot on turret towers rather than just turret ring splash damage\n\nAlready my favourite weapon in the game and hard to swap out from, and now it’s hugely improved on my favourite front as well.",
            "score": 36,
            "replies": [
                {
                    "author": "QroganReddit",
                    "body": "2 shots hulk faces?\n\nbro the hulks I was shooting must've been made of fucking stalinium then cause those mfs refused to die after several eruptor shots to their face\n\nreal talk if I ever get a confirmed kill on a hulk like that though would be amazing",
                    "score": 16,
                    "replies": [
                        {
                            "author": "MistrJelly",
                            "body": "Lmao Stalinium because they’re robo-communists?",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "LegitimateAlex",
                            "body": "I think something wonky is going on with Hulk faceplates. Either it is blocking more damage since like two patches ago or, and I suspect it is this, their stagger animation seems highly exaggerated after a shot to the faceplate, so they dip their head down very far and slowly raise it back up. I swear I used to be able to reliably two tap them with the AC or AMR but it seems very hard to pull off now. \n\nAlso they walk off ultimatum rounds. I don't know how.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "The_Fighter03",
                            "body": "I think the new fire hulks are way tankier than regular hulks",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "smokingateway",
                    "body": "I saw dropships got more health, are gunships still the same?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "stephanelevs",
                            "body": "most likely yes. They only change the hp pool of the body of the dropships, anything else like the thrusters are still the same so I see no reason why they would change the gunships (since they arent even the same enemy anyway)",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MrVyngaard",
            "body": "I'm gonna manage to kill myself in all new kinds of ways with THAT level of stopping power.\n\n***Now that's freedom!***",
            "score": 24,
            "replies": []
        },
        {
            "author": "LostConscious96",
            "body": "Now if we can get some dominator buffs I'll be happy",
            "score": 28,
            "replies": [
                {
                    "author": "qwertyalguien",
                    "body": "Tbh the dommy mommy is quite good as is. It's only issue (ergonomics) can be cancelled by a passive. \n\nEruptor was just a worse crossbow with no niche of its own.",
                    "score": 28,
                    "replies": [
                        {
                            "author": "LostConscious96",
                            "body": "I think it needs an extra mag in reserves and the mag size buffed by around 5 shots. Everything else is workable with it.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "qwertyalguien",
                                    "body": "Gotta agree on maybe one more mag. But 5 shots is a bit much, perhaps 1 or 2 would be enough. I think with this patch AH is trying to make the slugger and the JAR sidegrades to one another, and with 20 in a box mag the JAR would be too superior to the Slugger's 16. And in total bullets the JAR is at 90 spares with the Slugger at 60. So, the JAR has potentially better DPS AND ammo eco.\n\nRight now, you can choose between higer DPS low ergo box mag JAR, or lower DPS (but still same per hit) high ergo shell slugger.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "LostConscious96",
                                            "body": "Honestly i don't think 5 rounds at most would be bad. On paper it's strong enough but in practice you usually end up using 2-3 extra rounds on medium armored enemies compared to other similar weapons like Counter sniper or the Slugger. It lacks the single hit stopping power to weakpoints that they have and it's much more sluggish to use without the armor meaning you can get away with taking armor for reload speed and ammo reserves on them over the dominator.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "qwertyalguien",
                                                    "body": "Imho, the deal is that AH seems to be balancing the slugger and JAR around each other. Notice how similar they are in use, damage and accuracy, with diferences around rate, mag type, ergonomics and ammo type. IMHO they'll balance both around each other, so while 20 rounds ain't much compared to other weapons, it's quite a lot compared to the slugger's 16. And do note, that in a triad, the CS has around a third less damage per shot than the JAR and the Slugger, but higher DPS and accuracy, on a 15 mag. \n\nThe JAR has the potential to take weakspots in LESS shots than the CS and the same as the slugger. It has more raw AND durable damage PER SHOT than the CS. It's only reason to take more shots is accuracy alone. IT's stronger overall than both.\n\nBy making the JAR 20 mags, you are making it completely outclass both the Slugger and the CS tbh. And while you may take more shots due to accuracy, that's the drawback of the gun itself. With good timed shots it's already strong enough, it's just different.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "LostConscious96",
                                                            "body": "They are completely different weapons that act differently. Slugger and CS are the pinpoint damage type where you can knock enemies down with usually 2 shots to weakpoints at most and can cover multiple ranges.\n\nDominator is a rocket propelled shot with explosive ammo that usually takes 3-4 shots to down enemies but also can staggering them easier as it's bonus. It's sluggish, has good accuracy but is fixed on being at least a mid ranged weapon unless you use a specific armor set which the other 2 don't need to have.\n\nOn paper it seems just as strong but in actuality and practice it is weaker. Trust me the spreadsheet is a lie especially if you come from other games where devs balance based on stats. What's on paper isn't how it acts in game.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "qwertyalguien",
                                                                    "body": "I've used the three a lot and the dominator feels every bit as powerful as it's stats suggest with well timed shots. And it's fire rate makes it viable even on bugs, unlike the CS and Slugger who struggle there. \nI've seen nothing to suggest it does less damage on weakspots other than the rocket propeller messing with the aim. \n\nAnd i don't see the issue of it being midrange. It's a specific niche. Weapons don't need to be good at everything. \nYou may say the rocket makes them non comparable, but imho that's the key difference between two almost equal guns. The slugger is slower, but has far range potential. The JAR is harder to wield, but a midrange king. \n\nHonestly, i feel like making the JAR stronger would not just fully outclass the slugger, but also start entering on the midpen ARs' territory.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SyncShot",
                            "body": "With the buffed Slugger, the jar just seems like quite a downgrade.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "qwertyalguien",
                                    "body": "Eeeh i think it's debatable. They both now have similar damage, but the JAR has triple the fire rate at the expense of ergonomics; with less recoil, so it has a much higher, more controllable DPS overall. Yeah, you may need peak physique to make the most, but slugger needs siege ready to compensate it's reload in a pinch. And the JAR still has better durable damage and slightly better stagger.\n\nI'd say they are now sidegrades to one another. I don't consider one better, and they depend on what you prefer. Giving it Heavy pen would be complete overkill, and IMHO the ergo and funky rocket rounds are part of it's unique gamestyle.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "SyncShot",
                                            "body": "You have to take into account the Slugger's projectile speed is twice that of the Jar while now having less bloom.  So the Slugger does more damage, is more accurate, and has much better ergonomics.  The round reload is better than mag reload since you can fire/reload/fire/reload...  You essentially have an unlimited mag so it's also a straight upgrade here as well.  You trade all that for a small boost to durable damage and stagger.  Not worth it.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "qwertyalguien",
                                                    "body": "I'm taking it into account. The JAR is better at mid range, the slugger is better on far. \nPer shot slugger is slightly better, but over time the JAR does more than triple. \nThe shells can be handloaded, but when fully shooting (which you'll do more due to it's fire rate) the JAR wins, while also having about 30% more spare rounds. \nThe JAR is more unwieldy and innacurate, but less recoil on fast shots.\n\nThey're both sidegrades. If you want a close-mid gun the JAR wins out. If you want Mid-Far the slugger does better.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "MtnmanAl",
                                                    "body": "I think they're trying to balance around drag factor with range. It might be hard as hell given the sight and slow projectile but the dom does still have 0% drag for further targets, and unless they changed it without mention the slugger should still have drag comparable to plasma weapons.  \n  \nBut most engagements happen at close range, so eh.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Maerkonator",
                    "body": "The Dominator was arguably the strongest (bot) primary before the 60-day buffs hit the rest of the arsenal. It's far from bad in its current state, buffing it would just end up in another Purifier/Crossbow situation.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "LostConscious96",
                            "body": "If you look at another reply I'm not looking for damage or pen buffs but rather an extra mag of reserve ammo and maybe a mag size increase of at most 5 rounds",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Maerkonator",
                                    "body": "The Dominator already has the same amount of ammunition as the DCS, but with 275/90dr damage per bullet instead of 200/50dr. It does not need more ammo, it already has a damage output edge over its closest competitors, the Slugger and DCS.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "LostConscious96",
                                            "body": "DCS is a much better weapon... it doesn't require an armor set to make it feel viable. It has higher weakpoint damage which makes it easy to take out targets in weakpoints. It can also hit more accurately at much longer ranges.\n\nSlugger has better handling and absolutely rips enemies in close to mid ranged and yet again does more weakpint and limb damage.\n\nDominator can stagger with medium explosive pen but requires more shots to kill 80% of the time due to lower weakpoint damage.\n\nNo more than 5 extra rounds in the mag and at least 1 extra mag of reserves will hurt. It'll still be relegated to mid ranged engagements whereas Slugger and DCS will have close to long range locked down. You can also argue that the Slugger is the better choice due to the handling and that allows you to take armor for reload and ammo reserves.\n\nDamage means nothing if the weapon is sluggish to handle. The explosive ammo is a blessing and a curse, while it's good for groups, or striders it makes it's usage feel bad because instead of damage being focused all on one hit for weakpoints or limbs it's spead out meaning it staggers some but makes it frustrating for weakpoints resulting in more ammo usage.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Maerkonator",
                                                    "body": ">DCS is a much better weapon... it doesn't require an armor set to make it feel viable. It has higher weakpoint damage which makes it easy to take out targets in weakpoints. It can also hit more accurately at much longer ranges.\n\nWhat is this \"weakpoint damage\" you speak of? The Dominator projectile has higher damage against all targets it can hurt. The range is an advantage, but that is also the niche of the DCS.\n\n>Slugger has better handling and absolutely rips enemies in close to mid ranged and yet again does more weakpint and limb damage.\n\nI can find no reference to weapons doing different damage to limbs in comparison to each other, unless we are talking explosive damage (which the Dominator DOES NOT have, btw). Since very early in the game's lifecycle up until todays patch, the Dominator dealt more damage than the Slugger against both durable and non-durable targets, while simultaneously having considerably more ammunition at hand.\n\n>requires more shots to kill 80% of the time due to lower weakpoint damage.\n\nCitation fucking needed.\n\n>You can also argue that the Slugger is the better choice due to the handling and that allows you to take armor for reload and ammo reserves.\n\nEven with Siege-Ready, the Slugger has less total ammo than the Dominator in its current state. I also find people exaggerate the poor handling of the Dominator as someone who frequently uses and enjoys it, it's totally usable without ergo increases even against Hunters (though not optimal in this situation). I will concede that the handling does make the Slugger easier to use at extreme close range.\n\n>The explosive ammo is a blessing and a curse, while it's good for groups, or striders it makes it's usage feel bad because instead of damage being focused all on one hit for weakpoints or limbs it's spead out meaning it staggers some but makes it frustrating for weakpoints resulting in more ammo usage.\n\nAre we even talking about the same weapon here? The Dominator does not, I repeat, DOES NOT, have any explosive properties to its projectiles. It has always been a single-target weapon. Any perceived increased ammo consumption is due to misses caused in large part  by the slow projectile velocity.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "xTekek",
                    "body": "Yeah I have no idea why that doesnt have heavy pen while the senator does.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "PerceiveEternal",
                            "body": "Either heavy penetration or added explosive damage, since it’s a rocket propelled round.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "xTekek",
                                    "body": "Its inspired by the bolter from warhammer where its just projectile damage. The bullet leave the barrel and then a second explosion propels the bullet a second time. There would be no explosive damage in this situation as the explosion is just propellant not in the delivery. Heavy pen on the other hand would explain where all that extra force is going from having two propulsion and the warhammer version is all about extra pen.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Ceraunius",
                                            "body": "That's not how bolt rounds work. Yes, there's a kicker charge to clear the barrel and a subsequent ignition of the gyrojet (not really an explosion), but bolt rounds don't work on pure projectile penetration. In fact, bolt rounds come in a huge variety of warhead types. Standard bolt rounds are APHE, not solid shot. The fact that they punch into the target and then explode is what makes them so devastating.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "xTekek",
                                                    "body": "Oh TIL thanks",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Plastic_Souls",
            "body": "stayed loyal all the way, for an entire year.\n\nit payed of!",
            "score": 29,
            "replies": []
        },
        {
            "author": "Haardrale",
            "body": "This rifle has an even more powerful version ingame. Don't believe me? just google Helldivers 2 R-34 and check yourselves.",
            "score": 26,
            "replies": []
        },
        {
            "author": "chainer1216",
            "body": "Bittersweet, I've been singing its praises for months and now everyone's going to be using it.",
            "score": 55,
            "replies": [
                {
                    "author": "jac104",
                    "body": "People still gonna hate on it. I’m happy the eruptor is finally getting some love. So fun to use",
                    "score": 41,
                    "replies": [
                        {
                            "author": "PM_ME__YOUR_HOOTERS",
                            "body": "Its been my go to bug primary, it will be even more so now. Maybe even bring it to the bot front for some testing, would be fun to shoot down some gunships with it",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "jac104",
                                    "body": "I love it on bugs, but I couldn’t bring it against the predator strain or in the gloom missions. Brought it with me on Bore Rock yesterday tho and will def be trying out the buff today. I’m pretty stoked to see buffs to the AR’s and SMG’s too. Finally have a reason to try them again. I’m hopeful the slugger will be useful again too, but not sure they buffed it enough. Used to be my main primary against bots before they nerfed it into the ground",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "PM_ME__YOUR_HOOTERS",
                                            "body": "I still bring it on gloom missions, as a crisper/sterilizer enjoyer i need something with a bit of range that can finish off a charger/BT while also being able to pressure groups of small things when im too far away and eruptor has been a solid tool.\n\nAP4 is great, but another common complaint has also been addressed, range. With projectile lifespan going from 0.7 to 1.0 seconds, the projectile thould go to what, like 200m-ish up from 120m? That means pot shotting gunships and and harassing heavies far away and on a fellow diver is now much more effective",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Starumlunsta",
                                    "body": "Eruptor is GOATed on bots if in the right hands. Now even more so.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Dr_VidyaGeam",
                                    "body": "Bot front is where it shines IMO, even more so now.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "PerceiveEternal",
                    "body": "I think like everything it’ll have a spike in usage and then settle into a new equilibrium. It’s not as user-friendly as the crossbow so I doubt we’ll see it completely taking over the front at least on bots. That being said a heavy penetration shrapnel opens up a lot of possibilities for loadout combos. I think it’ll benefit loadout diversity more than it will reduce the number of primaries people take.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "WithinTheGiant",
                    "body": "Nah, most folks will still not like the bolt-action, max range (though that is improved thankfully), or drag. At most you'll see an uptick this week and then it will probably drop close to where it is now.\n\nI am just happy because it's part of my weapons rotation and now it has even more uniqueness going for it.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Crombell",
                    "body": "It wasn't bad, but it *was* a worse crossbow",
                    "score": 12,
                    "replies": [
                        {
                            "author": "MtnmanAl",
                            "body": "Tbf, the crossbow is pretty much on-par with the grenade launcher for power. Possibly better for high-mobility play since you get more ammo back on yellow boxes. I guess they decided to turn the eruptor into a mulch fabricator rather than dial the xbow back, but surprised the launcher got nothing.  \n  \nGonna be weird being able to hit shots past 125m.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "chainer1216",
                            "body": "No, it wasnt.",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "Blueverse-Gacha",
                                    "body": "key word is probably \"was\", opposed to being \"is\".",
                                    "score": 11,
                                    "replies": []
                                },
                                {
                                    "author": "Jellyfish15",
                                    "body": "just had a go with it, still less fun & more annoying to use than crossbow.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "shaash44",
            "body": "What is the projectile lifetime?",
            "score": 11,
            "replies": [
                {
                    "author": "Zufallstreffer",
                    "body": "Eruptor shots auto-destruct, this means its ranged is buffed. \n\nshould be around \\~200m after the buff",
                    "score": 36,
                    "replies": [
                        {
                            "author": "HybridTheory2000",
                            "body": "This is really nice. Finally I can snipe those bat nests and Christmas mushrooms from afar with it.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "Shikaku",
                                    "body": "> Christmas mushrooms\n\nThe fucking what lmao",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "HybridTheory2000",
                                            "body": "I mean, big ass mushrooms 'decorated' with lights, and underneath them there are plenty of 'presents' (samples), so yeah...",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "MtnmanAl",
                                            "body": "You need to catch up on your service songbook, helldiver.  \n  \nDashing through the fog  \nin a one-wheeled FRV,  \nover the hills we go  \nspreading liberty!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "WithinTheGiant",
                            "body": "It was always hilarious to me how the max range was not remotely close to the highest scope magnification.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "K1NG_of_ReVeNGe13",
                            "body": "Ironic that it needs a buff to reach 200 meter when it has.. you know.. a 200m Scope option.\n\nBut after some missions on the bug front I absolutely love the Eruptor",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "cursed-annoyance",
            "body": "Why didn't people use this more often?\n\nThe explosive radius is large man",
            "score": 11,
            "replies": [
                {
                    "author": "ZETH_27",
                    "body": "Poor handling (both in hand and the slow bullets) and the fact it can't be used at long range.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "Few_Classroom6113",
                            "body": "Effective firing range is within it’s range bounds anyway and the viper commandoes armor massively helps with the first complaint.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "ZETH_27",
                                    "body": "I'm not complaining. It's just how it is. With Peak Physique you definitely get better handling, but foregone other armour advantages.\n\nIt's a balance in exchange for the disruptive damage potential you get.",
                                    "score": 12,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "cursed-annoyance",
                            "body": "That's it?",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Any_Sample_8306",
                                    "body": "The RoF is dreadfully slow and it doesn't have much reserve ammo.  \nAlso unless you are a Senator Dead Eye master it forces you to give up on AT stratagem weapons in favor of the Stalwart/MMG to fight in close combat without killing yourself with the AoE.",
                                    "score": 10,
                                    "replies": []
                                },
                                {
                                    "author": "ZETH_27",
                                    "body": "You can't engage mobile targets without extreme effort. It's a heavy hitter, and if you shoot anywhere close to yourself you'll die.\n\nIt's a balanced weapon intended for medium-range engagements.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Good_Policy3529",
                            "body": "...or short range.  You'll blow yourself up. ",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Key-Lengthiness-7563",
            "body": "Eruptor my beloved",
            "score": 6,
            "replies": []
        },
        {
            "author": "Hexnohope",
            "body": "Heavy pen primary??????? Hell yes new main",
            "score": 6,
            "replies": []
        },
        {
            "author": "Roffolo",
            "body": "BOLTERS, BROTHERS!!\n\n![gif](giphy|VT81lAAamPTxHK3w0H|downsized)",
            "score": 8,
            "replies": []
        },
        {
            "author": "0nignarkill",
            "body": "I would have taken the og shrapnel vs higher AP.  Maybe a bit more damage on the primary bullet, I was still 1 tapping broods with it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "FullTweedJacket",
            "body": "https://i.redd.it/3yiutyofjhpe1.gif",
            "score": 2,
            "replies": []
        },
        {
            "author": "TheEnderDen27",
            "body": "HECK YEAH this thing is useful now",
            "score": 4,
            "replies": []
        },
        {
            "author": "TimberAndStrings",
            "body": "Can it reliably oneshot alpha commanders now?",
            "score": 3,
            "replies": [
                {
                    "author": "Hardcore_Qtip",
                    "body": "This buff shouldn't change that unfortunately. Alpha commander heads have light armor (2) and the Eruptor's precious pen was enough for 100% damage. Eruptor is now better against spewers and hive guards on the bug front and a lot of stuff on the bot front.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "ZB3ASTG",
                    "body": "No, pen changed not damage. It can just pen heavy armour shit now instead of having to aim for their weakspots.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Brob0t0",
            "body": "Eruptor+heavy mg+viper commando armor=my favorite build for bugs let's goooo",
            "score": 3,
            "replies": []
        },
        {
            "author": "VAUDEVlLLE",
            "body": "Eruptor mains rejoice",
            "score": 2,
            "replies": []
        },
        {
            "author": "TenshouYoku",
            "body": "Thank fuck this thing is now ap4",
            "score": 2,
            "replies": []
        },
        {
            "author": "_bumfuzzle_",
            "body": "I like to take Eruptor over the Crossbow on the bot front. I feel like it hits harder, even one-shots mulitple devastators if the RNG is on my side. So, this is very welcomed haha",
            "score": 2,
            "replies": []
        },
        {
            "author": "DnZ618",
            "body": "https://i.redd.it/i8n78ivybgpe1.gif\n\nLezgoo Eruptor my beloved!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Silver-Roll3488",
            "body": "OH MY SWEET DARLING, I KNEW IF I STUCK WITH YOU, IT WOULD BE OKAY 😭😭😭",
            "score": 2,
            "replies": []
        },
        {
            "author": "Routine-Wolverine-45",
            "body": "God damn it, I missed you buddy🥲.",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "author": "ZenkaiZ",
                    "body": "when i run into a jammer factory strider i might want a quasar",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Blueverse-Gacha",
                    "body": "Quasar Cannon is still AP6, so not really.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "majakovskij",
            "body": "Be careful using it in close range ;)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tomae002",
            "body": "My baby finally got an upgrade",
            "score": 1,
            "replies": []
        },
        {
            "author": "IgonTrueDragonSlayer",
            "body": "I can only get so erect, this and cowboy war bond, stop it arrowhead, you sexy bastards.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tall_Eye4062",
            "body": "https://i.redd.it/3xkf6oo2nhpe1.gif",
            "score": 1,
            "replies": []
        },
        {
            "author": "Degmograndfather",
            "body": "Projectile lifetime? What does that mean exactly?",
            "score": 1,
            "replies": []
        },
        {
            "author": "runarleo",
            "body": "![gif](giphy|2WxWfiavndgcM)\n\nIt’s beautiful",
            "score": 1,
            "replies": []
        },
        {
            "author": "CurryOmurice",
            "body": "Eruptor status has been erected!",
            "score": 1,
            "replies": []
        },
        {
            "author": "SirD_ragon",
            "body": "Eeeeeh, the ergonomics are still pretty bad, not to mention the dps and capacity.\n\n\nWill test it out but the Plasma-Sniper + Senator on bots will probably still be better.\n\nAnd on bugs the gun is too slow to Deal with oncoming Bugs on anything higher than 5/6\n\n\n\nMuch more interested in the 3rd Exosuits and Buffs to the pummeler",
            "score": 2,
            "replies": [
                {
                    "author": "Max7242",
                    "body": "I did pretty well using it on lvl 8 bugs the other day using democracy protects armor",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Eggberti",
                            "body": "Yeah, paired with Stalwart it always shredded everything up to a bile titan. Now, I'm really intrigued what it can do.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Max7242",
                                    "body": "I just brought the quasar, guard dog, and verdict. I was playing with a friend too, so he helped me maintain some distance",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Alkemeye",
                            "body": "I haven't played in a while (since before predator variants) and it was my go to for diff 9 bugs.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Max7242",
                                    "body": "With the predator strain active and urban combat being a thing, it's gotten challenging and the death loops can be a pain, but I was leading the kill count every time",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "stephanelevs",
                    "body": "Yeah, I mean on paper it's better, but the downside are still there. Like unless you have some specific build with it, I dont think it will gain that much popularity after the hype dies down.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "PerceiveEternal",
            "body": "This makes me really happy and I don’t even use the Eruptor. Eruptor fans haven’t had it easy so I’m glad you’re getting a solid win!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok-Caterpillar6031",
            "body": "Should have about 200m range now and take out big big mushrooms twice as fast",
            "score": 1,
            "replies": []
        },
        {
            "author": "scn-3_null",
            "body": ">heavy pen\noh i can be a deadly sniper now",
            "score": 1,
            "replies": []
        },
        {
            "author": "DeathKnight101010101",
            "body": "Just recently used it but I didn't really feel a difference against AV4 enemies like the hulks and I still get the ricochet indicator",
            "score": 1,
            "replies": [
                {
                    "author": "stephanelevs",
                    "body": "I think it's normal. Even in the [patch notes video](https://youtu.be/E_8gDkwJ5PA?si=bdOJrx97TsvLvNFX&t=134), when he kill the hulk, you can see the bullet ricochet up. It looks like it's the bullet itself, before it explode, that does have the heavy pen (4).\n\nRealistically speaking, I feel like you most likely wont be using it to kill them in that specific way often. The slow firerate and travailing speed means it's still gonna be awkward to line up multiple shots just to kill 1.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "OrdoSkirata",
                    "body": "Hulks are ~~AV5. You have to hit them in the eye plate for~~ AV4 and it takes 2 shots to the eye plate.\n\nEdit: I was wrong and hulks are AV4. I will try to do some testing and update if needed.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "DeathKnight101010101",
                            "body": "I guess the wiki is lying to me now, cause there it says AV4 on the body. We really need some more ways to figure enemy armor out without just dropping in a mission and getting killed for trying without knowing",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "stephanelevs",
                            "body": "Nope, it's an armor of 4 everywhere on the hulk (except for the weakspot obviously)\n\n5 would be the same level as the bot fabricator and you cannot destroy them with the AMR.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Robosium",
            "body": "honestly I think the eruptor should have toggleable ammo like auto cannon or recoiless rifle, so you can swap between anti infantry shrapnel and anti armor piercing warheads",
            "score": 1,
            "replies": [
                {
                    "author": "Doomcall",
                    "body": "Me too",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ImpressiveHorse3583",
            "body": "We are so back!",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Hearing8087",
            "body": "THEY BUFFED MY BOY!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Thomas_JCG",
            "body": "Finally my baby is back!",
            "score": 1,
            "replies": []
        },
        {
            "author": "H345Y",
            "body": "Ill say it now, I used it after it was nerfed but before it was buffed. I aint no trend chaser. \n\nI paired it with a jump pack and laser cannon, quasar or eat.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Mechasaurian",
            "body": "This is not the Eruptor buff I wanted.\n\nWhy can't AH just give it back the original shrapnel profile it had on release?",
            "score": 0,
            "replies": []
        },
        {
            "author": "adidas_stalin",
            "body": "Very nice, the stalker bolter being what it always should have been",
            "score": 0,
            "replies": []
        },
        {
            "author": "Boamere",
            "body": "Lets goooo",
            "score": 0,
            "replies": []
        },
        {
            "author": "timonten",
            "body": "I never thought badly of the eruptor, but now it takes all the more strength not to use it for the next month",
            "score": 0,
            "replies": []
        },
        {
            "author": "RipperonIsl",
            "body": "https://preview.redd.it/5vapi8g4yfpe1.jpeg?width=753&format=pjpg&auto=webp&s=23dd7ea5e2c5b36b13658d49749f8eac0dca9621\n\n(Sauce: Greatest Estate Developer)",
            "score": 0,
            "replies": []
        },
        {
            "author": "Illustrious-Can4190",
            "body": "Yeah, i expect the number of missed shots that deflect off something into teammates to be even more numerous.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Ok-Caterpillar6031",
            "body": "I still want an HE dominator variant",
            "score": 0,
            "replies": []
        },
        {
            "author": "Tomliwag",
            "body": "Poweeeer !",
            "score": 0,
            "replies": []
        },
        {
            "author": "britoninthemitten",
            "body": "It’s been my primary for the Bots since it dropped but now… it’s going to be a few more people’s choices.\nBanging outcome.",
            "score": 0,
            "replies": []
        },
        {
            "author": "KaleidoscopeOwn7161",
            "body": "Hehehehehe… This is the way",
            "score": 0,
            "replies": []
        },
        {
            "author": "Competitive-Pin-8592",
            "body": "I  used this weapon with the senador. Since the warbond came out.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Phosphorus444",
            "body": "Eruptor suddenly becomes top pick.",
            "score": 0,
            "replies": []
        },
        {
            "author": "HouseOfWyrd",
            "body": "Finally my ongoing devotion to the explosive sniper rifle has been rewarded.",
            "score": 0,
            "replies": []
        },
        {
            "author": "_Weyland_",
            "body": "Tbh I'd rather see firerate or ergonomics increase. But hey, I'll take heavy pen too.\n\nAnd while they're at it, can they make it not ricochet from the ground?",
            "score": 0,
            "replies": []
        },
        {
            "author": "supatim101",
            "body": "This feels like a super reasonable way to buff the eruptor. It was basically a niche explosive weapon, but mostly less effective crossbow.\n\nThe downsides were not worth the upsides. But with AP4(!) this seems great. I can't wait to try it!",
            "score": 0,
            "replies": []
        },
        {
            "author": "gokartninja",
            "body": "About time. Thing was borderline pointless for a while there.",
            "score": 0,
            "replies": []
        },
        {
            "author": "whisperingstars2501",
            "body": "OMG YESSSSSS",
            "score": 0,
            "replies": []
        },
        {
            "author": "DamascusSeraph_",
            "body": "Ya know.. ill try it. This + MG.",
            "score": 0,
            "replies": [
                {
                    "author": "mxdupnut",
                    "body": "Grenade launcher pairs well also, lol",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "PenguinPeng1",
            "body": "As a day 1 Eruptor simp [I even used it during the shrapneless days] we just can't stop winning! Pairing it with the WASP makes you pretty tanky on the bot front",
            "score": 0,
            "replies": []
        },
        {
            "author": "ec1ipse001",
            "body": "I'll guess I'll swap out my automaton loadout for a new one. I was getting kinda bored of it anyway.",
            "score": 0,
            "replies": []
        },
        {
            "author": "3rrMac",
            "body": "Literally rips the devastators in half\n\nDon't bother with hulks but it's a good desperate alternative\n\nStill have to try it with the bugs",
            "score": 0,
            "replies": [
                {
                    "author": "Doomcall",
                    "body": "Doesnt it 2 shot hulks to the eye?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "mxdupnut",
                    "body": "Works great against bugs. Can confirm.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Zerofoxy3384",
            "body": "as an R-36 lover, I have been dying for a chance to use this weapon again\n\nincreased range AND armor pen? I can not be happier",
            "score": 0,
            "replies": []
        },
        {
            "author": "Grandmaster_Invoker",
            "body": "Is the weapon handling improved?",
            "score": 0,
            "replies": []
        },
        {
            "author": "Temporary-Log8717",
            "body": "This is exactly what it needed",
            "score": 0,
            "replies": []
        },
        {
            "author": "Ezabez",
            "body": "HEAVY PENETRATION ON A PRIMARY?",
            "score": 0,
            "replies": []
        },
        {
            "author": "A_Shady_Zebra",
            "body": "Wait what??? I already used this gun and it's somehow better?",
            "score": 0,
            "replies": []
        },
        {
            "author": "Carb0nFire",
            "body": "Looks like it's time.\n\nI'm going to Erupt!",
            "score": 0,
            "replies": []
        },
        {
            "author": "Glass-Produce2108",
            "body": "Eruptor, my beloved...",
            "score": 0,
            "replies": []
        },
        {
            "author": "FreiBier117",
            "body": "Sooo, which secondary do you guys use with it?",
            "score": 0,
            "replies": [
                {
                    "author": "Doomcall",
                    "body": "Axe, goes well with peak physique and covers close range. Stalwart for general purpose. Maybe an added drone for overlapping fire.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "FoundationLive1668",
            "body": "Omg, yasssss! Sweet Liberty, my baby is going to spread so much democracy!",
            "score": 0,
            "replies": []
        },
        {
            "author": "rick_the_freak",
            "body": "YOOOO\n\nMY BOY IS EATING",
            "score": 0,
            "replies": []
        },
        {
            "author": "Fun1k",
            "body": "Why the penetration increase? Its strength is AOE and shrapnel, not penetration. They should have improved the drag instead.",
            "score": -4,
            "replies": [
                {
                    "author": "Very_Melonlord",
                    "body": "Now it reliably oneshots medium armored enemies (devastators) without overtuning its damage.\n\nIncreasing damage will make it still meh against armored enemies, but will obliterate unarmored \"fat\" enemies.\n\nThis buff allows it to damage AP4 enemies, and is 40% damage buff vs AP3 enemies. At the same time it doesn't affect AP1 and 2 enemies at all.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Fun1k",
                            "body": "Does it one shot Devastators anywhere? I think having to hit their head for a oneshot made sense for the heavier ones.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Very_Melonlord",
                                    "body": "Head has 110hp and no armor if I recall, so most single shot weapons can oneshot devastators in the head.\n\nNow Eruptor can oneshot devastators in the chest, where it has armor rating of 3. It was able to damage them before, but as it's AP3 Eruptor only did 65% of damage, and it was not enough to reliably kill devastators.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MtnmanAl",
                    "body": "Improved the drag? Isn't it already 0% drag just like the dominator?",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Just_A_Hyena",
            "body": "Now the dominator just needs to get it",
            "score": -1,
            "replies": []
        },
        {
            "author": "AmericanScammer",
            "body": "Good, now people can STFU about giving the Constitution heavy-pen.",
            "score": -1,
            "replies": []
        },
        {
            "author": "Dances_With_Flumphs",
            "body": "I wish that the AMR got some loving in this direction too, but I guess I have to accept that its outclassed by the eruptor until it gets another balance pass",
            "score": -1,
            "replies": []
        },
        {
            "author": "WhiteNinja84",
            "body": "Eh, no amount of damage buff or AP buff will make me use it again. Just tried it out and it still handles like dogshit and reloads take half a century. Unless they improve the ergonomics (it still sucks even with Peak Physique), I won't touch it. At least the heavy armor pen feels kinda justified now.\n\nFor those who like it, it's a great alternative and allows for interesting loadouts.",
            "score": -1,
            "replies": []
        }
    ]
}