{
    "title": "Got my first ever Iphone, the iPhone 15",
    "author": "_An_unknown_Person_",
    "subreddit": "iphone",
    "rank": 2,
    "score": 194,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 40,
    "url": "https://i.redd.it/u9ege6mr7ipe1.jpeg",
    "id": "1jeebjg",
    "selftext": "I am an Android user but I have grown very curious about iPhones and iOS that I decided to grab a new Iphone 15.      \n\nAny tips and tricks are welcome!",
    "comments": [
        {
            "author": "ButtGelly",
            "body": "as an android fanboy, here are some thoughts:\n\n\\- shortcuts app is cool: scripts can be downloaded from the web or have fun yourself. I have for making screenshots (as there is no button in the control panel), convert videos etc.\n\n\\- Apple Explained youtube channel helped me understand weird things apple does, for example the alarm and timers have the stop button in different locations.\n\n\\- there are a lot of services in the background draining the battery - don't forget to turn them off\n\n\\-  Accessibility > display & text size > reduce white point. usefull for nighttime scrolling\n\n \\- challenge yourself to set up a custom ringtone :)",
            "score": 20,
            "replies": [
                {
                    "author": "CheCorchete",
                    "body": "You can add a Control Center shortcut to enable/disable ‘Reduce white point ‘",
                    "score": 10,
                    "replies": [
                        {
                            "author": "captjohn_yossarian",
                            "body": "Omg thank you, this is useful for my tired eyes",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "tranquil45",
                    "body": "The volume up and power button takes a screenshot.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Prestigious_Newt_508",
                    "body": "GarageBand trick for ringtone? Honestly kinda difficult if you’re new to iPhone but it’s neat.\n\nhttps://preview.redd.it/z21iwuzokipe1.png?width=749&format=png&auto=webp&s=0d06ce50898f77d27f98653569cbf2792351d168\n\nAlso for taking a screenshot you have to click the volume up & power button together",
                    "score": 4,
                    "replies": [
                        {
                            "author": "KP0719x",
                            "body": "Or you can set it up as a double tap or triple tap on the back of your phone to take screenshots",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Prestigious_Newt_508",
                                    "body": "yeah that’s pretty useful too",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Desd1novA",
            "body": "Welcome! Hope you enjoy the new phone! \n\nJust go in with an open mind knowing that while they have become more similar over the years, they both still have their own unique strong suits. Try not to make one be the other. There may be feelings of being outside of your comfort zone, and that's normal, but that's generally just a muscle memory thing. It would be the same for an iPhone user switching over to a new Android device. Just give it a little time and don't toss in the towel at the first hiccup. Give it a solid try.\n\nMaybe you'll end up wondering why you hadn't switched sooner, and maybe you'll absolutely hate it. In the end, it's your device and yours alone. If it doesn't work for your needs, there is no shame in swapping back. There are likely just as many people out there that would never leave Android as there are that would never leave iOS. Isn't choice a beautiful thing? 😃\n\nEnjoy!",
            "score": 8,
            "replies": []
        },
        {
            "author": "BellamyRFC54",
            "body": "Enjoy (if you’re happy with it you made the right choice)",
            "score": 5,
            "replies": []
        },
        {
            "author": "oklch",
            "body": "I switched from android to 15 Pro last year and like it, but the iOS keyboard is crap compared to Gboard on android.",
            "score": 3,
            "replies": [
                {
                    "author": "Prestigious_Newt_508",
                    "body": "There’s have Gboard on iPhone as well :). [Here you go](https://apps.apple.com/us/app/gboard-the-google-keyboard/id1091700242)",
                    "score": 2,
                    "replies": [
                        {
                            "author": "oklch",
                            "body": "I know... but it's not the same experience as on android. But yes, better than apples keyboard.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Prestigious_Newt_508",
                                    "body": "you do you, i like the Apple keyboard ngl",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "sharts_with_wolves",
                    "body": "This is my biggest iphone complaint since switching to the 14",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Joudeh_1996",
            "body": "Best regular iPhone in years, you should be fine with it and congratulations friend 👍🏻",
            "score": 3,
            "replies": []
        },
        {
            "author": "greybunnyyyyy",
            "body": "Yay congrats! I recently switched from the s24 to the IPhone 16 pro max! I’m really enjoying it, hope you do as well!",
            "score": 6,
            "replies": [
                {
                    "author": "Prestigious_Newt_508",
                    "body": "why tho, S24 is pretty solid too",
                    "score": 1,
                    "replies": [
                        {
                            "author": "greybunnyyyyy",
                            "body": "Definitely a great phone. But the camera and battery were getting pretty bad even tho I only had it a year. I really wanted a bigger phone too. Also just wanted back into the apple ecosystem. My last iPhone was the 13.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Apprehensive-Sail924",
                    "body": "why did you switch",
                    "score": -1,
                    "replies": [
                        {
                            "author": "greybunnyyyyy",
                            "body": "I had it for just a little over a year and the battery and camera were just getting worse and worse. The battery on the s24 was AMAZING when I first got it tho. And so was the camera. I also just wanted a bigger phone, and to get back into the apple ecosystem. My last iPhone was a iPhone 13.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "snehasaha02",
            "body": "Congratulations 🎉🎉",
            "score": 2,
            "replies": []
        },
        {
            "author": "Maleficent-Cry2869",
            "body": "Cool, I hope Airplay will work properly, because I bought an ipad and the apple ecosystem is a myth.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok_Chocolate3253",
            "body": "Usually an iPhone hater (iPhone 7 was rough) but my 15 Plus swayed me. I had a MacBook and now an iMac and I love the continuity between devices. They’re not immensely different from a day to day use, it’s those smaller amenities that make it enjoyable. Came from an S22 that’s a solid backup",
            "score": 1,
            "replies": []
        },
        {
            "author": "leave_me_aloneplease",
            "body": "My first IPhone, too! Had mine since around when it came out bc I'd been considering a switch for a while. I personally like it a LOT (the Dynamic Island is so much better than a notch too lol), hope you do as well!",
            "score": 1,
            "replies": []
        },
        {
            "author": "BobbyABooey",
            "body": "That’s you for supporting an American company 🙌🏻🇺🇸🙌🏻🇺🇸🙌🏻🇺🇸",
            "score": -6,
            "replies": []
        },
        {
            "author": "Nayfonn",
            "body": "it’s funny to see how many people have been brainwashed by advertising, enjoy your phone",
            "score": -1,
            "replies": [
                {
                    "author": "Teenage_techboy1234",
                    "body": "Enjoy your phone being dropped from Support at the exact same time as the iPhone 13 lol.",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "BooBee",
            "body": "Should have gotten the pro, it'll last practically forever unless you upgrade often. I keep my phone minimum 3 years, often times 4 years.",
            "score": -10,
            "replies": [
                {
                    "author": "Prestigious_Newt_508",
                    "body": "the base model is just fine. I’ve been rocking an iPhone SE for 3+ years, battery life is kinda less but the phone is great for the cheapest iPhone there is",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Teenage_techboy1234",
            "body": "Should've gotten the 13 or 16 instead, 14 and 15 are not worth it.",
            "score": -2,
            "replies": [
                {
                    "author": "Prestigious_Newt_508",
                    "body": "They’re just fine, plus he probably got a discount too",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Teenage_techboy1234",
                            "body": "The 14 isn't worth it because it's literally the 13 with a couple of minor upgrades that are not worth paying for, and the 15 isn't worth it because the 16 isn't a whole lot more expensive and brings several notable upgrades, and I'm not talking about Apple Intelligence or the camera button, I'm talking about the action button, it does get improved cameras, and it has a much newer chipset that now has support for Wi-Fi seven, when the regular 15 only had Support for standard Wi-Fi six and not even 6E. Unless OP got it for like 300 bucks I don't think the 15 a good deal.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Prestigious_Newt_508",
                                    "body": "i think the 15 is still a fine deal cause of the whole redesign. Mind you 99% of people don’t gaf about the internals as long as their phone looks like the recent iPhones, takes good pictures and lasts long without hiccups. But i get your point, i don’t think the 15 has Apple intelligence either, not like it’s good. But it’s still a great choice. Cause it’s better than 14. A16 > A15. iPhone 14 is kinda pointless cause it shares almost the same chipset with the 13 and has no major improvements in any aspect.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "YaBasicDudedas",
                    "body": "I think the other reason OP considered 15 is because of the Type C port. :)",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Teenage_techboy1234",
                            "body": "The 16 and 16E both have that as well. So does the 15 pro which is another phone that I recommend over the 15.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "N_word_generator2005",
            "body": "Prepare to be disappointed",
            "score": -14,
            "replies": [
                {
                    "author": "heyshiv18",
                    "body": "any specific reason ?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "TheGyattDevil_Yoru",
                            "body": "Probably because \"its not the pro max ultra giga super 2TB version\"",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SupermarketGold3638",
            "body": "But iphone 16 is the latest",
            "score": -7,
            "replies": [
                {
                    "author": "Gsaucechrist666",
                    "body": "not necessarily needed",
                    "score": 7,
                    "replies": []
                }
            ]
        }
    ]
}