{
    "title": "Games Workshop Stock: Is Warhammer worth more than Star Wars when acquired by Disney?",
    "author": "JCRUZ_z",
    "subreddit": "stocks",
    "rank": 17,
    "score": 39,
    "upvote_ratio": 0.7,
    "num_comments (reported by reddit)": 55,
    "url": "https://www.reddit.com/r/stocks/comments/1je3mot/games_workshop_stock_is_warhammer_worth_more_than/",
    "id": "1je3mot",
    "selftext": "This post is in relation to Games Workshop (LON: GAW), the \\~£4.66 billion (\\~$5.93B USD) tabletop gaming titan behind Warhammer.\n\nMy thesis: Warhammer’s universe, intellectual property (IP) and ecosystem are worth *more* than GAW’s current market cap *and* what Disney paid for Star Wars in 2012 ($4.05B, or $5.54B in 2025 dollars).\n\nI know this might sound bold. One can say that Warhammer’s a niche , not a mainstream beast like Star Wars was. However, as someone that's been closely monitoring latest developments of Warhammer in social media and considering an almost 50 years of lore, a rabid fanbase, and catalysts like Henry Cavill’s Amazon series, this could be a sleeper hit the market’s undervaluing.\n\nLet’s break it down.\n\nGAW is the king of tabletop wargaming, crafting Warhammer universes—*40k* (grimdark sci-fi), *Age of Sigmar* (fantasy), and *The Old World* (retro fantasy). Founded in 1975 by Steve Jackson and Ian Livingstone with *Owl and Weasel*—a newsletter that became *White Dwarf* in 1977—it’s been building lore for 50 years. Today, it’s a £145/share stock with:\n\n* **Market Cap**: £4.66B ($5.93B).\n* **Revenue (2024)**: £577.5M ($735M), up 15.6% CAGR over 5 years.\n* **Margins**: 71% gross, 41% operating, 30% net—insanely efficient.\n* **Cash**: £125.8M, net debt negative (-£79.4M).\n* **P/E**: 27.1—pricey, but growth justifies it.\n\nWarhammer’s niche: 1-2M players dropping $200-500/year on minis, paints, and books. It’s not Disney’s scale, but it’s a moat—high-margin, loyal, and sticky.\n\n# The Thesis: Warhammer’s IP is worth more than $5.9B (and Star Wars’ 2012 Price). GAW’s $5.9B cap reflects a tabletop business, but Warhammer’s IP (its lore, brand, and potential) could fetch $9-10B if sold to a Disney/Amazon/Netflix. (*)\n\n*\\[\\*Edit: I am just trying to* ***value*** *WH's IP and $GAW, not saying I want it to be sold or anything.\\]*\n\nWhy?\n\nIt’s a 50-year universe with untapped multimedia juice, and it’s firing on all cylinders in 2025. Let’s compare:\n\n* **Disney’s Star Wars Deal**: $4.05B in 2012 ($5.54B today) got Lucasfilm—six films, $4.4B box office, $20B in merchandise, 35 years of lore. Disney turned it into $12B+ by 2024.\n* **Warhammer Today**: No films (yet), but $735M revenue, 50 years of history and a lore deeper than Star Wars—10,000 years of *40k*, Chaos Gods, Space Marines, plus *Old World* nostalgia. Licensing’s just $38M—5% of revenue—but it’s a powder keg.\n\n**Valuation Math**:\n\n* Core revenue ($735M) x 8 (media IP multiple) = $5.88B.\n* Licensing upside ($500M/year from films/TV, Star Wars-scale) x 5 = $2.5B.\n* 50-year brand premium = $1-2B.\n* **Total**: $9-10B—above GAW’s cap and Star Wars’ 2012 price.\n\nCrazy? Maybe. But Warhammer’s fans are deep into it. Warhammer’s got potential.\n\n# Why Now? 2025 is lighting up:\n\n1. **Warhammer 40k 10th Edition**:\n   * Launched June 2023, drove 10.8% core revenue growth in 2024 ($490M). Half-year to Dec 2024: 16.4% up ($307.5M).\n   * X buzz (Q1 2025): “warhammer\" traffic’s 12-15M/month, up 10-20% from Q4 2024.\n   * Potential: $75M/year growth through 2026.\n2. **Henry Cavill’s Amazon Series**:\n   * Deal locked Dec 2024: Cavill stars/produces a *40k* cinematic universe.\n   * Licensing ($38M now) could double to $76M by 2027, with $40M+ indirect sales if 200K newbies buy armies.\n3. **The Old World Resurgence**:\n   * Jan 2024 launch, new faction drops (and rumours regarding Cathay).\n   * People +30 are getting back to Warhammer. Veterans spending $50-250/army per year\n4. **Hachette’s Combat Patrol**:\n   * Launched Sept 2024 (UK), Jan 2025 (Spain via Salvat). Weekly mag with minis hooks newbies.\n   * Launched in US too.\n\n# Warhammer vs. Star Wars?\n\nWarhammer’s no Star Wars, yet. Star Wars had mass appeal; Warhammer’s a cult with 1-2M players. But:\n\n* **Lore**: 50 years, denser than Star Wars’ 35 in 2012. *Black Library* churns 20+ novels/year—*Horus Heresy* alone is 60+ books.\n* **Fanbase**: Smaller but fanatic—players co-create (painting, campaigns). Star Wars sold toys; Warhammer sells a lifestyle.\n* **Upside**: Star Wars had films in the can; Warhammer’s a blank slate. Cavill’s series could be its *Force Awakens*.\n\nSome say Warhammer's too niche. I say it has a potential future mass craze.\n\n$9-10B is what a buyer pays for potential, not just today’s market cap.\n\n* **Now**: £145, P/E 27, 4.2% dividend yield. Fair value: £150-160 (EPS $5.35 to $6).\n* **Bull Case**: Revenue hits $850M by 2027 (Cavill, *Old World*), EPS $9, P/E 25 = £225—50% upside.\n* **Buyout**: A $9B bid spins the IP to Amazon, triples licensing in 5 years.\n\nRisks? Cavill flops, *Old World* fades—growth slows to 5%, stock stalls at £150. But GAW’s 67% ROIC and monopoly scream resilience IMO.\n\n# Thank you in advance for your feedback on my comparison of Warhammer to Star Wars.\n\nBest.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi, you're on r/Stocks, please make sure your post is related to stocks or the stockmarket or it will most likely get removed as being off-topic/political; feel free to edit it now and be more specific.\n\n**To everyone commenting:**  Please focus on how this affects the stock market or specific stocks or it will be removed as being off-topic/political.\n\nIf you're interested in just politics, see our wiki on [\"relevant subreddits\"](https://www.reddit.com/r/stocks/wiki/index) and post to those Reddit communities instead without linking back here, thanks!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/stocks) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "ollienorth19",
            "body": "Anyone remember that WoW movie? Execution matters.",
            "score": 62,
            "replies": [
                {
                    "author": "hotdogpartytime",
                    "body": "I liked it and wanted more :(",
                    "score": 17,
                    "replies": [
                        {
                            "author": "Rex_Laso",
                            "body": "sicko",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "JxSnaKe",
                            "body": "I did too, and I don’t care about wow (but maybe that’s why.. idk…)",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "TotalWarspammer",
            "body": "The last thing any Warhammer fan wants is for it to be sold to Disney and then systematically destroyed.",
            "score": 142,
            "replies": [
                {
                    "author": "thunder_crane",
                    "body": "Came here to say exactly that. Still lament all the possibilities and expanded universe of SW.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "Creative_Beginning58",
                    "body": "It's one of the best managed IP's in gaming. There is nowhere to go but down unless Disney can bring itself to throw money at them and let them keep doing their thing.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "-spartacus-",
                    "body": "This, properties aren't worth shit if the acquiring company uses the same unqualified movie producers, directors, writers, etc to make movies/shows no one wants to watch.\n\nCompanies have already spent billions and then lost money trying to create content for \"modern audiences\" by people who have no interest respecting the IP and think they know better than the original artists who have works loved by billions of people.\n\nThen after they destroy a franchise they will hire people who will try to mimic the original art with member berries which won't do any better.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "JCRUZ_z",
                    "body": "I am not saying I want it to be sold. I am just valuing GAW and its Warhammer Universe. Thanks for your comment.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "thebeastiestmeat",
            "body": "**BEAR CASE TO YOUR BULL CASE**\n\nRealistically, i don't see anyone buying GAW for $9-$10 billion. In terms of return on investment it doesn't make sense. Right now GAW currently has an operating income of £200/$259 million. It would take 35 years for any ROI. Say with Disney's economies of scale, that drops to 25 years? Still too much. Disny bought Star Wars for just over $4 billion and disclosed it made $12 billion by the endo of 2023. That's an ROI of 200% (about 10% CAGR). All things being equal, Star Wars had a PE of about 4 at the time of acquisition (assuming \\~$1 billion earnings per year). Even with all the new Warhammer things going on, what's their operating income in 3 years? $300? $350?\n\nYou can argue that Disney made $12 billion because of the strategy they implemented. But Warhammer is much more niche. How many people play Warhammer? 2 million? 5 million? Star Wars is one of the most popular franchises in the world. Jedi Fallen Order sold 10 million copies. The Force Awaken is the 5th highest grossing movie of all time. No way does Disney spend more money or even the same amount, on Warhammer simply because Warhammer will never generate the same amount of money anually.\n\nStar Wars \\~ $1billion/year\n\nWarhammer \\~$250million/year\n\nEven if Disney buys Warhammer at $4b market price (which it won't) they'll have to at least quadrouple the income it generates for the investment to make sense. At best, Disney buys it for $2.5 billion. As far as growing the franchise, it's risky. Disney has to invest a lot of money behind movies, games, etc. The Force Awakens cost Disney 500 million to make and generated 2 billion in sales. Is there a world where that happens for Warhammer? No way. Never. Disney won't pour half a billion into a movie that isn't a huge franchise with guaranteed sales. Disney is just too big of a company to take risks like that. Warhammer just doesn't have the same fan base and it isn't even close. It's safe to assume that Disney's investment behind the world building in Warhammer will be substantially smaller than Star Wars. Therefore Star Wars is worth much more than Warhammer.\n\n  \nAll that said, I'd be glad to be proven wrong! 😁",
            "score": 20,
            "replies": [
                {
                    "author": "JCRUZ_z",
                    "body": "Thanks for the feedback. I am just trying to put a fair price on $GAW and Warhammer. I am seeing many old-school fans getting back to spending money on their hobby. Many new Instagram accounts about the hobby and WH universe. And I thought that, maybe, IP is not fairly valued. That's it.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "elgrandorado",
                    "body": "This bear case only becomes worse when you take into account how much the Star Wars brand has been diluted by execution risk materializing on the Sequel trilogy films post-Force Awakens, and the TV show bombs aside from The Mandalorian. \n\nThere's no guarantee a buyer would be able to even deliver similar returns to what Disney got for Star Wars, even if they execute in similar fashion to how Disney did for Marvel with the valuation needed to take private.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RaXXu5",
            "body": "I can say that as both a starwars fan and a warhammer fan I have probably spent more money on 40k.",
            "score": 23,
            "replies": []
        },
        {
            "author": "TheProfessional9",
            "body": "You can't base a Warhammer valuation on star wars. Star wars is to Warhammer as power rangers were to beetleborgs. One of them is a household name and the other is not.\n\n\n\nI love the Warhammer universe but it's popularity is not even remotely on the same scale",
            "score": 28,
            "replies": [
                {
                    "author": "ffruhauf",
                    "body": "Whilst true, I assume the mean spend per fan is heavily skewed in GAW's favour.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "-spartacus-",
                    "body": "Star Wars is space fantasy wizards that can have the simplicity to appeal to everyone.\n\nWarhammer 40k is a grimmdark adult scifi that has limited appeal to a general audience without destroying the very core of IP.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "sizziano",
                            "body": "What exactly is the point of this correct and factual comment lol?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Razkaii",
                    "body": "Beetleborgs now that’s a nostalgia hit I didn’t expect to see today!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "JCRUZ_z",
                    "body": "Thanks. Yes, its popularity is not on the same scale for now, correct",
                    "score": -6,
                    "replies": [
                        {
                            "author": "WaifuHunterActual",
                            "body": "I'm not sure it will ever be on the same scale. The universe is just too dark for a wide audience",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "TheProfessional9",
                            "body": "Its way too dark to ever reach that level without damaging the brand. \n\n\n\nThink about it this way. Sc2 was the first major esport. It had some momentum but it wasn't until the simple and dumbed down mobas that esports really took off.\n\n\nWarhammer is just too brutal and too complex to compete with things like sw or lotr",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "otterform",
            "body": "I've been buying during drops, currently already sitting on some nice gains, plus steady dividends as icing on the cake.\nI am somehow reinvesting my dividends into the company though, as I spent more than my current holdings in GW in actual Warhammer miniatures ahaha",
            "score": 8,
            "replies": [
                {
                    "author": "rocc_high_racks",
                    "body": ">plus steady dividends as icing on the cake\n\nTBF mediocre gains with monster dividends/dividend growth is the specialty of most FTSE100 components.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "JudgeCheezels",
            "body": "If anything, that (very impressive) animated Secret Level episode on Prime shows potential that the warhammer franchise could go mainstream with a full fledged movie or series. \n\nSo… yeah I think there’s life left yet for warhammer.",
            "score": 6,
            "replies": []
        },
        {
            "author": "EmbarrassedMelvin",
            "body": "Please don't tell everyone about this stock as I haven't accumulated enough shares just yet...\n\nP.s. Old World isn't going to be a big Revenue generator relative to 40k, AOS and KillTeam, but it does potentially bring more people into the ecosystem or back in at least",
            "score": 18,
            "replies": [
                {
                    "author": "JCRUZ_z",
                    "body": "I know, I was thinking the same while writing, but of course it has risks since its current PE is kind of pricey. I am curious to know however what people think of this comparison... Thanks for your feedback.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "EmbarrassedMelvin",
                            "body": "I'm only joking 😁. Other plus points. The CEO is a no nonsense guy who is only interested in running the company well and their return on capital is immense.\n\nThey are also an effective monopoly given how they dominate the space with a massive moat driven by their IP as well as high quality. \n\nIt's a great stock with loads of potential. Question is timeframe, but I can't imagine anyone will be disappointed with returns over next 10 years if they invest.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Thoughtful_Tortoise",
            "body": "I've been buying this steadily for a while and it's been a quiet grower. I'm also banking on the Amazon series raising the brand's profile quite a bit, I think it's a decent buy. Nice dividend too.\n\nOh, and they recently issued a press release to announce that they're likely to smash guidance for earnings next time around.",
            "score": 6,
            "replies": [
                {
                    "author": "greenpride32",
                    "body": "AMZN bought the rights so most GAW gets out of it is exposure (well in addition to the rights fee).  It would be the same as Marvel selling properties to Fox and Sony - Marvel didn't get anything from the movies or media sales.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Theta_kang",
            "body": "I can't speak for financials, but I can speak for exactly how niche the products are. I'm somewhat of a nerd, play TTRPs, and have sunk countless hours into fantasy and space RPG video games and strategy games. I'm only vaguely aware of Warhammer 40k as a game with expensive miniatures and space orcs, and have never heard of Age of Sigmar, Old World, or anything else you mentioned. If I'm unfamiliar with it, I can't imagine that the average consumer is itching to consumer their content. Plus, Warhammer's name similarity with Warcraft, a game that also features people fighting orcs, is probably going to dilute brand recognition.\n\n\nIn comparison, everyone has heard of Star Wars. Kids love it in particular, and kids drive sales of toys and merchandise.",
            "score": 13,
            "replies": [
                {
                    "author": "Somenakedguy",
                    "body": "Have you never heard of any of the Warhammer games? There are a shit ton of them and some of them are damn good, granted in frequently more niche spaces but with great sales. The Total War Warhammer games made a killing, Vermintide was big, Rogue Trader did well, and there are tons of small and mid sized games that have licensed the IP over the years and done well enough \n\nI’ve never touched the figurine stuff and never well but the universe is pretty big in the overall gaming community",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Theta_kang",
                            "body": "Oh yeah, totally forgot about the Total War series. I didn't have much interest when the first one came out but apparently they've sold well enough to justify two sequels. I've seen other Warhammer titled games come up in steam sales before but the titles you listed don't ring a bell.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "0rphu",
                    "body": "Afaik warcraft is actually based on warhammer, but few know that. Just goes to show how niche it is.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Pin_ups",
            "body": "Oh shit, they gonna sissify the ultra marines.",
            "score": 8,
            "replies": [
                {
                    "author": "breaker167",
                    "body": "What! not my Girlieman marines",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "lemongrenade",
                    "body": "and the emperors children are gonna do it",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "BussySlayer69",
                    "body": "Putting the slay in **slay qwueeen yaasssss**",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "OutlandishnessOk3310",
            "body": "I've been a longterm stock holder and don't plan on changing that anytime soon.\n\nOne thing that I think alot of this rides on is the success of Amazon's foray into WH40k. Given they secured Cavill early, he will love this thing like his baby and has proven time and time again that he has an eye for screen adaptations. Most notably The Witcher when he wasn't happy that they were diverting too far from the source material. As both the star and an executive producer, he will be having a really material impact on the outcome, and I think that is top balls!\n\nBullish all the way and don't think a sale will happen.",
            "score": 3,
            "replies": []
        },
        {
            "author": "orangehorton",
            "body": "No a niche board game played by a bunch of \"nerds\" is not worth more than an international phenomenon that changed Hollywood",
            "score": 5,
            "replies": []
        },
        {
            "author": "Stellar_Impulse",
            "body": "SW was at a low point when acquired so it makes sense.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Mithrandir_1019",
            "body": "No. Next question",
            "score": 5,
            "replies": []
        },
        {
            "author": "ffruhauf",
            "body": "Players dropping $200-500 per year?\n\nTry per month 😂\n\nWhat's more, a lot of the guys who grew up with Warhammer in its first hey day (late 90s/early 00s) re picked up the hobby during the pandemic, only now we have disposable income. \n\nI own some shares, but I kick myself that I didn't pick up more when it was trading around £90 a share like a year ago. \n\n100% bullish on GAW.",
            "score": 1,
            "replies": [
                {
                    "author": "JCRUZ_z",
                    "body": "Thanks. I was trying to be conservative but, yes, many hardcore fans spend much more than many can imagine.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "xampf2",
                    "body": "Loaded up when it was £90 good times. I think that was about 18 times earnings iirc. Since then the company improved quite a bit with the AMZN deal in the bag and even better sales numbers. I would say it currently is about fair value I'm considering buying a little bit more.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "cdttedgreqdh",
            "body": "They would have to manage to market it to kids in a big way. Like a Lego Movie or something otherwise just no.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Salaas",
            "body": "You need to factor in that GW are notoriously controlling of their IP and cultivate it strictly since it impacts their core business of the boardgames.\n\nThis comes into play when licencing out to others as could block some projects if say the other company hires a director or writer that starts to crap all over the IP as jj abrams did with SW ip.\n\nNot saying there won't be growth or potential but there is speedbumps to deals that would drive up stocks.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zealousideal_Look275",
            "body": "Warhammer lends itself to a more diverse catalog of media than Star Wars ever could. This would allow Warhammer to keep it fresh long term and avoid the fatigue of Star Wars or Marvel. Action, adventure, mystery, spy thriller, suspense, horror, political thriller, crime drama, etc ",
            "score": 1,
            "replies": []
        },
        {
            "author": "NeonistheFuture",
            "body": "I think GW would have to push more licensed video games to reach a larger audience first.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jazzlike-Check9040",
            "body": "DEIHAMMER LETS GOOOO",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lyci0",
            "body": "Warhammer needs a triology or two to hit homerun and become mainstream, before it will hit that price. The universe is deep enough for it to be possible!\n\nHowever if Disney get Warhammer, how the f would they know how to run the physical product line. It will be neglected for tv potentially. The LOTR model of licensing is much more likely.\n\nWith the current macro enviornment I think GAW will fall 30% or so, it does make money, but the money will decrease in US increasingly with the hardship that will come.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Unlucky-Prize",
            "body": "I don’t think it’s a great fit for Disney or Amazon, they’d struggle to use the IP well. Could see a large toy company considering though.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Emotional_Goal9525",
            "body": "Resin printers becoming more and more ubiquitous are pretty much gonna kill the company by the end of the decade.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Eltrits",
            "body": "I think the value will be close to zero if acquired by Disney '",
            "score": 1,
            "replies": []
        },
        {
            "author": "muggsleek",
            "body": "This is comparing apples with oranges. Star Wars is a franchise designed by Disney for mass audiences. A lot of stuff goes over the counter to enthusiastic viewers, but very few people buy something that is expensive. With Warhammer, it's a community that spends more money on a hobby or at least a deep passion than a regular Star Wars viewer. If Warhammer was opened up to the masses, it wouldn't just be people who spend a lot of money like they do now.   \n  \nMeaning the future growth of Warhammer would not be as profitable as it is now.",
            "score": -1,
            "replies": []
        }
    ]
}