{
    "title": "Germany votes for historic boost to defence spending",
    "author": "Lofi-Fanboy123",
    "subreddit": "stocks",
    "rank": 4,
    "score": 1293,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 136,
    "url": "https://www.reddit.com/r/stocks/comments/1je7i9g/germany_votes_for_historic_boost_to_defence/",
    "id": "1je7i9g",
    "selftext": "https://www.bbc.com/news/articles/c62z6gljv2yo\n\n\"German lawmakers have voted to allow a huge increase in defence and infrastructure spending - a seismic shift for the country that could reshape European defence.\n\nA two-thirds majority of Bundestag parliamentarians, required for the change, approved the vote on Tuesday.\n\nThe law will exempt spending on defence and security from Germany's strict debt rules, and create a €500bn ($547bn; £420bn) infrastructure fund.\n\nThis vote is a historic move for traditionally debt-shy Germany, and could be hugely significant for Europe, as Russia's full-scale invasion of Ukraine grinds on, and after US President Donald Trump signalled an uncertain commitment to Nato and Europe's defence.\n\n...\"\n\nTime to buy some Rolls Royce or other EU Defense Stocks\n\nMy Recommendation: I personally love Rolls Royce because they have a 1 billion share buyback this year and also pay Dividends 💚 also they do a lot for Infrastructure\n\nhttps://www.rolls-royce.com/~/media/Files/R/Rolls-Royce/documents/investors/results/2024-full-year-results/rr-plc-holdings-2024-full-year-results-press-release.pdf\n\nETF: WisdomTree Europe Defence UCITS ETF - EUR Acc (A40Y9K)",
    "comments": [
        {
            "author": "Shot-Net-9648",
            "body": "My Grandmother sold her House this Minute just to Go all in 10x rheinmetall",
            "score": 237,
            "replies": [
                {
                    "author": "Rooty_tooty111",
                    "body": "This girl fucks",
                    "score": 72,
                    "replies": []
                },
                {
                    "author": "vergorli",
                    "body": "r/wallstreetbetsGER is vibing right now",
                    "score": 17,
                    "replies": [
                        {
                            "author": "luigman",
                            "body": "Is that sub for WSB geriatrics?",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "vergorli",
                                    "body": "wsb home of the rheiner",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Consistent_Panda5891",
                                            "body": "I made a lot on weekly Siemens calls today. Sold half of them when started to decline and progressively sold out finishing with +80% overall since weekend! I personally think it can get to 200% but not worth the risk with 3 days that left to expiration... I placed half of that money on deep ITM Siemens Energy calls. They are almost printing now and no doubt it will rise this year more than current value. (OTM was expensive as hell, you make same profit with ITM in +20% uprise and clearly 0 risk)",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "fenwickfox",
                    "body": "This is end of bull run energy, but maybe that's my fomo talking haha.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "ninjagorilla",
                    "body": "Honestly I’d also be looking at several of the Korean firms…\n\nHyundai and hanwha both have been trying to break into the European market, hanwha with its mrls system which is gonna look like a great alternative to HIMARS if people don’t wanna buy American, and Hyundai just signed a big deal for the k2, which is gonna be the alternative to the leopard. \n\nYou probably won’t see a big jump from the naval firms bc the us doesn’t actually export that much naval armaments, but the big one will be if countries are willing to ditch f35 for any of the alternatives… America had been DOMINATING that sector",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "csgodox",
            "body": "i put 3k into rheinmetall and 2k in deutz",
            "score": 60,
            "replies": [
                {
                    "author": "shroomeric",
                    "body": "Deutz? What do they do?\n\nEdit nevermind, top quality engines",
                    "score": 16,
                    "replies": [
                        {
                            "author": "csgodox",
                            "body": "diesel engines going to the defence sector now",
                            "score": 27,
                            "replies": [
                                {
                                    "author": "shroomeric",
                                    "body": "Thanks",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Aladiah",
                    "body": "Do you know of any good European web or app in which to invest?",
                    "score": 0,
                    "replies": [
                        {
                            "author": "InsaneShepherd",
                            "body": "We don't have internet in Europe, just tanks.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "No-Anchovies",
                            "body": "Racebook",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "OrkzOrkzOrkzOrkz0rkz",
            "body": "Glöm inte köpa Thyssenkrupp i allt spenderande på vapen SSAB med \n\nDet är underleverantörerna som är nästa boom\n\nEdit *Sheisse* in English then:\n\nDon't forget the European subcontracting steel companies, Swedish SSAB and German Thyssenkrupp. They basically make all the military grade steel in Europe. They will boom.",
            "score": 58,
            "replies": [
                {
                    "author": "Rooty_tooty111",
                    "body": "I agree with what the boy says, but only the Swedish part.",
                    "score": 24,
                    "replies": []
                },
                {
                    "author": "GruenBeiSchliessung",
                    "body": "Thyssen krupp also builds submarines",
                    "score": 8,
                    "replies": [
                        {
                            "author": "OrkzOrkzOrkzOrkz0rkz",
                            "body": "Should have fucking added that in my ADHD fueled vigor",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "GruenBeiSchliessung",
                                    "body": "Definitely.\n\nIf you look at the share price performance over the last month, they seem to be secretly building rockets too 🚀",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "OrkzOrkzOrkzOrkz0rkz",
                                            "body": "I just fell in love with them a bit more \n\nI just hope Tesla gets done crashing and burning so I can take all my Bear-Gold and stuff it into defense adjacent EU companies \n\nThis is only the beginning we've got 5-15 years of defense spending ahead of us. This ironically is also going to be a huge motor in the EU economy. Never really got why Keynes theories of state-fueled capitalism died. It's how the US built its fortune in the post WW2 era and most of Europe also. Aye I'll agree the stagflation of OPEC 1-2 fucked it up but.. meh",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "GruenBeiSchliessung",
                                                    "body": "Yes, I can well understand that. They also build ships, 6 more of [these](https://en.m.wikipedia.org/wiki/Type_F127_frigate) were decided today.\n\nIn any case, the defence industry will compensate well for the decline in the automotive industry.\n\nAs for the theory, I think it's a typical philosopher-king problem and can cause real problems. You just have to handle it carefully. But it must also be said that we have overdone it with the opposite.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BattleGrown",
                    "body": "They already boomed, but will boom still",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "gabolicious",
                    "body": "Yay Kruppstahl ist wieder hip! faschismus is back! 🥺",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ambroxol9",
            "body": "Sheesh Rheiner goes international",
            "score": 21,
            "replies": []
        },
        {
            "author": "Oquendoteam1968",
            "body": "It's time to buy European stock indices, not just German stocks",
            "score": 14,
            "replies": [
                {
                    "author": "whoorenzone",
                    "body": "Wisdomtree created a EU defense ETF",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Oquendoteam1968",
                            "body": "No creo que concentrarlo todo en el sector de defensa europeo sea buena idea. Es mejor concentrarse en indices como ibex, dax... porque hay más sectores que se verán beneficiados como el bancario, el de construcción de infraesttructuras...",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "WiredMaster",
            "body": "Amazing",
            "score": 13,
            "replies": []
        },
        {
            "author": "Legust",
            "body": "Seems pretty good, I think Rheinmetall and Renk might be a good call!",
            "score": 11,
            "replies": []
        },
        {
            "author": "KoNeRsGG",
            "body": "Rheinmetall fucks",
            "score": 11,
            "replies": []
        },
        {
            "author": "kmn1989",
            "body": "Last chance before it finally takes off I guess. Germany may the gods be with you...",
            "score": 25,
            "replies": []
        },
        {
            "author": "You_2023",
            "body": "there is not only Rheinmetall,  don't forget about Hensoldt, Renk, Thyssen and Deutz",
            "score": 21,
            "replies": [
                {
                    "author": "hogannnn",
                    "body": "I bought DHL (exposure to German and Euro materials economy) and OHB (make rocket components for the ARIANE and satellites)",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Lofi-Fanboy123",
                    "body": "y there a lot",
                    "score": 2,
                    "replies": [
                        {
                            "author": "StinkySmellyMods",
                            "body": "Because we used to be one of the world's largest manufacturing giants. Not only for throughput but also for quality and price. Let's bring it back baby!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PornoPaul",
                    "body": "I can only buy Rheinmetall on webull, and maybe Thyssen.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Upstairs-Hamster3803",
            "body": "Not only Rolls and Rheinmetall. \nDeutz, Renk, Hensoldt are interestingt too.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Stoic-Hippo",
            "body": "I sold my grandmothers last Gehhilfe to support this",
            "score": 7,
            "replies": []
        },
        {
            "author": "leeuwvanvlaanderen",
            "body": "Fucking finally. As a fellow European it was painful watching Germany’s slow decline. DB went from a train service we were all jealous of to the joke of Europe.\n\nBunds are back baby",
            "score": 28,
            "replies": [
                {
                    "author": "Shot-Net-9648",
                    "body": "Just bought a leopard 2 as my First car :))) all my Friends have them too",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "MiniTab",
                    "body": "Just bought into EWG. \n\nDeutschland über alles!",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "GuyLuxIsNotUnix",
            "body": "Not exactly an unprecedented move on the part of Germany.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Kusen1004",
            "body": "Hello, That sounds good. \nIs this a Anlageberatung ?",
            "score": 22,
            "replies": [
                {
                    "author": "Rooty_tooty111",
                    "body": "Sprich....",
                    "score": 9,
                    "replies": [
                        {
                            "author": "b00gizm",
                            "body": "Deutsch...",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Any_Pollution3347",
                                    "body": "Du…",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "SoftwareOdd8846",
                                            "body": "Juansohn",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "Competitive-Path-196",
                                            "body": "Hu",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "kwijibokwijibo",
                                            "body": "Hast...",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "JadedAd5617",
                    "body": "Du",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Yetiius",
            "body": "$EUAD still pumping!",
            "score": 5,
            "replies": []
        },
        {
            "author": "AltruisticPops",
            "body": "\"f*ck orange man\" for the free karma yet fails to understand the only reason EU is finally growing a pair and spend money on necessary things is because of orange man.",
            "score": 13,
            "replies": [
                {
                    "author": "ernapfz",
                    "body": "Yep … MEGA! He did it!",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "DevOpsMakesMeDrink",
                    "body": "Sure, but it wasn’t for free. The cost was USA soft power. So many countries rely on the USA they were able to ask for things and countries would bend over for them most times. \n\nThese countries in Europe (and other places) are plainly saying we can’t rely on the US and doing their own thing. \n\nThe leverage has changed for America.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "AssignmentChoice762",
                    "body": "Sooo..they are doing now what he is demanding since his first term ?  Wow..that will show him.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "SeaweedMelodic8047",
                    "body": "I hope we can tank the US s weapons industry with this, too. After all, Europe was their best customer and it was us who made them rich. Time to get sth back.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Blue026",
                            "body": "Europe barely spent anything on defense. It was mostly the US subsidizing it.\n\nIn fact most EU defense companies and US based subsidiaries made great money from US purchases.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "hogannnn",
                    "body": "Sure, but then the US regime makes fun of Europe for upping its defense spending and commitments. See: JD Vance.\n\nThere’s a difference between shoveling your neighbors driveway (before) and lending them a shovel. The US has taken their shovel, gone home, and used it to hurl rocks at their neighbors window.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "nickkon1",
                    "body": "It depends on the viewpoint. Yeah, the EU grows a spine. But it comes hand in hand with the US giving up their soft power they projected all over the world for basically nothing",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Recent_Ad936",
                            "body": "The US still has said power, no European country is gonna be even close to the US when it comes to military force, keep in mind all of the EU combined has a lower GDP by like 30% compared to the US alone. This ignores technological differentials (EU has to catch up), geographic advantages (Europe is way more vulnerable), etc.\n\nThe long term projections are a possible conflict with China, Russia already got burnt with their war against Ukraine which is a pretty good thing western powers, the EU is gonna remain allied with the US except now they'll hopefully be more than just a bag of rocks when it comes to military power/presence.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Gammelpreiss",
                                    "body": "That is hard power you talk about. And though you are correct the US military is the strongest in Europe, part of that is because it can rely on alliances and bases all around the world and that said alliance also purchasing US american gear to make development and production in numbers viable. \n\ntake that away and the US finds itself in a much weaker position. \n\nand I do not think youa re understanding what is currently happening. Europe is rearming itself not just against Russia, but a US that has obviously switched sides to Russia and is an opponent now. Threatening war and annexation just like Russia or China. \n\nThe US is not an ally anymore and I think you really fail to realize thze world is rapidly changing and rearranging itself after the US has become this threat to peace.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Qiagent",
                                    "body": "US GDP is going to be in the shitter if it abandons global trade.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Recent_Ad936",
                    "body": "Trump unironically carrying Europe's politics.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Own_Tomatillo_1369",
                    "body": "Russia is the reason, Trump destroying the transatlantic partnership and bargaining with Russia about EU security and seizing Ukraines ressources is the accelerator. I think US citizens are unaware of the damage Trump is causing with this turmoil. Are Americans really that ignorant to think this is a game?\n\nCanada? Let's annex it, mentioning military force.\n\nGreenland? Let's annex a EU and NATO partners land? Cool. Nato is obsolete anyways.\n\nEU? Let's destroy it, we hate liberals. Stupid European weaklings, like so much being governed they need a government for their government.\n\nGermanys car industry? Let's destroy it, we need Tesla to dominate by force. (Now this went well, my short says TY)",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Pitch_Shoddy",
            "body": "Oh what is that, seems like the german stock rheinmetall is a good choice now",
            "score": 8,
            "replies": [
                {
                    "author": "Shot-Net-9648",
                    "body": "POV Average fettbürger nach der dritten mcdonalds Bestellung zum Frühstück",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Pitch_Shoddy",
                            "body": "i dont speak german sorry habibi",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "SeaweedMelodic8047",
                            "body": "Aber hallo😂 \nAuch wstbetsGER aficionado?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ok_Entrepreneur9855",
            "body": "Rheinmetall is overbought at this point - I‘d go in Deutz as they have earnings release on the 20th so should go up soon 💪🚀",
            "score": 3,
            "replies": []
        },
        {
            "author": "hsoftl",
            "body": "I put $23k into Rheinmetall just three and a half weeks ago. It’s now worth $35k.",
            "score": 5,
            "replies": [
                {
                    "author": "Electronic_Chain1595",
                    "body": "I should have invested more. My Rheinmetall is up 425%.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok_Quote2241",
            "body": "Just bought 1000 Deutz and Rheini 🤑💸",
            "score": 4,
            "replies": [
                {
                    "author": "garack666",
                    "body": "Too late? Musst be sell the news time after the run started a month ago",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "russ_nas-t",
            "body": "Smart to invest there right now because everything else is about to go down. A sudden shift to larger military spending is going to cause mass inflation as the German government needs to circulate more money. I can promise you, as an American that has 50% of his tax dollars going to military, it’s gonna be a culture shock.",
            "score": 4,
            "replies": [
                {
                    "author": "SeaweedMelodic8047",
                    "body": "Eurozone",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Kitahara_Kazusa1",
                    "body": "Military spending is approximately 12% of the US budget, not 50%. \n\nUnless Uncle Sam takes special care to use more of your money for bombs",
                    "score": 0,
                    "replies": [
                        {
                            "author": "russ_nas-t",
                            "body": "It was sarcasm but sure. Also if you want to get technical about it, it was closer 20% in 2024.\n\nWhich I’m willing to bet was a SIGNIFICANTLY higher percentage than what Germany spent in 2024.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DrWho37",
            "body": "Does this mean money printing?",
            "score": 2,
            "replies": [
                {
                    "author": "Former_Friendship842",
                    "body": "Financed via bonds. Also, money printing is primarily done by the European Central Bank.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "DrWho37",
                            "body": "I am a completely ignorant, but do you think this will weaken the Euro vs. other currencies like the dollar or pound?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Former_Friendship842",
                                    "body": "The effect on the Euro has largely already happened because it was expected Germany would pass this bill. The effect has been positive for the euro.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "DrWho37",
                                            "body": "Interesting. I wouldn't have thought this was priced in. Thanks for your perspective!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DarkRooster33",
                    "body": "By end of it probably everything, printing money, stealing it, borrowing it, extorting it.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "adrianbarboo",
            "body": "r/poland 🙄",
            "score": 2,
            "replies": []
        },
        {
            "author": "No-Anchovies",
            "body": "The boost from these news already happened 8 days ago but the way is up even if you buy now (just don't expect a 200% return)",
            "score": 2,
            "replies": []
        },
        {
            "author": "draw2discard2",
            "body": "This is a very, very bullish sign. I seem to recall that the last time an economically floundering Germany went into a massive military build up things went really well.",
            "score": 2,
            "replies": []
        },
        {
            "author": "uh-oh_spaghetti-oh",
            "body": "Beware of FOMO",
            "score": 4,
            "replies": [
                {
                    "author": "Lofi-Fanboy123",
                    "body": "Lets invest in US stocks - doin nothing :D",
                    "score": 8,
                    "replies": [
                        {
                            "author": "uh-oh_spaghetti-oh",
                            "body": "Something something be fearful when others are greedy",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Blue026",
                                    "body": "Something something +200% in a year, 105 P/E, $50 bill market cap. \n\nDefinitely not a bubble or already priced in\n\nSomething something shoe shine boy saying to buy",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "65465654654DS",
            "body": "Over due.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Guglomogluduglo",
            "body": "Germany’s recent €500 billion debt surge for infrastructure and defense spending signals strong growth potential for tech and security firms. CeoTronics (DE0005407407), a leader in communication systems for military and industry, benefits directly from increased defense budgets, like its 2024 Bundeswehr contract, making it a compelling investment.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Recent_Blacksmith282",
            "body": "Care to share any stocks besides rhetinmetall? ",
            "score": 1,
            "replies": [
                {
                    "author": "garack666",
                    "body": "Wisdom tree Europe defense eft",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Wheels_Weisswuerscht",
                    "body": "Check out Deutz AG, they build engines for military vehicles and generators ",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "GruenBeiSchliessung",
                    "body": "ThyssenKrupp AG (DE0007500001)\n\nRENK Group AG (DE000RENK730)\n\nDeutz (DE0006305006)\n\nHensoldt AG (DE000HAG0005)\n\nMTU Aero Engines AG (DE000A0D9PT0)\n\nI quickly had these to hand, but I'm sure there are more",
                    "score": 3,
                    "replies": [
                        {
                            "author": "StickRodent",
                            "body": "MTU is also used in datacenters, AI & defence play",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "jmalez1",
            "body": "that's to bad it took this long",
            "score": 1,
            "replies": []
        },
        {
            "author": "21Outer",
            "body": "My 100k RNMBY purchase yesterday is making me quite aroused.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FreakyNeighbour",
            "body": "Good to hear seeing how I bought some XEF and EAUD",
            "score": 1,
            "replies": []
        },
        {
            "author": "ManulifyGamesFlo",
            "body": "Rheinmetall is gonna pump hard for months to come xd ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ramon-Galuptra",
            "body": "How everyone immediately comes up with Rheinmetall ...\n\nThere are also interesting second-line stocks in the sector, such as Indra Sistemas",
            "score": 1,
            "replies": []
        },
        {
            "author": "chookiebaby",
            "body": "Steyr has been skyrocketing the last few days",
            "score": 1,
            "replies": []
        },
        {
            "author": "commentman10",
            "body": "When the reich is finally on the right side this time!\n\nGo Rheinmetal![gif](emote|free_emotes_pack|upvote)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Julian1971",
            "body": "Wow, can u get imagine that, a soverign nation will have their own defense force. How novel.",
            "score": 2,
            "replies": []
        },
        {
            "author": "MileiMePioloABeluche",
            "body": "Expect EU debt to tank as well as the EUR, but don't expect much money actually invested in weapons. At the end of the day, they won't spend the new debt money in building up their armed forces",
            "score": 1,
            "replies": [
                {
                    "author": "Former_Friendship842",
                    "body": "It is literally constitutionally mandated that the new debt money has to go to infrastructure (maximum amount 500 billion) and defence (no set  limit).",
                    "score": 1,
                    "replies": [
                        {
                            "author": "MileiMePioloABeluche",
                            "body": "It was constitutionally mandated that Germany couldn't borrow more than X amount of money, which this motion violates.\n\nI don't think doing something \"unconstitutional\" in Germany it's as big an issue as you think it is",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Former_Friendship842",
                                    "body": "No. The bill Germany passed today is a constitutional amendment that changes those rules to what I described earlier.\n\n\n\nYou don't know what you are talking about, sorry. Our Constitutional Court is quite literally internationally recognised as one of the most powerful in the world and violating the constitution is definitely a big deal lol.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "museum_lifestyle",
            "body": "I don't like orange man, but I am not going to cry much for the US military industrial complex.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Atuk-77",
            "body": "This spending will not be coming to the US at least not directly.",
            "score": 0,
            "replies": []
        },
        {
            "author": "OhridMK",
            "body": "About time. See. That’s all trump wanted.  That wasn’t hard. And look it’s citizens excited about it. Win win",
            "score": -9,
            "replies": [
                {
                    "author": "Chris97786",
                    "body": "And there he is: The undisputed reigning world champion in mental gymnastics! The crowd goes wild!!!\n\nBut what's this?! Vladimir Putin with a ~~steel chair~~ bot army to win over the uneducated!!!",
                    "score": 17,
                    "replies": [
                        {
                            "author": "FistyFistWithFingers",
                            "body": "How are they wrong though? Trump literally told them he wants this since his first term\n\nYou don't have to do any gymnastics if you want. Just a straightforward answer",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "jrex035",
                    "body": "Yeahhh so here's the thing, they aren't investing in defense because Trump told them to. \n\nTheyre doing it because Trump has convinced them that America is no longer a trustworthy ally and partner, and that we may very well be an *enemy* if Trump continues down the path he's currently on, cozying up to Russia, abandoning the rule of law/democracy, throwing countries like Ukraine and Taiwan under the bus, supporting Israeli ethnic cleansing in Gaza, and threatening sovereign countries.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "OhridMK",
                            "body": "Whatever his theory. It’s working lol. Germany is now doing exactly as they were told. Let’s gooo. Strong nato",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "jrex035",
                                    "body": ">Strong nato\n\nBro, you really dont get it do you? They don't *trust* us anymore. For good reason. \n\nNATO was far stronger 2 months ago, before Trump started trade wars on our allies (they're called a war for a reason, we've been attacking the economies of our allies), suggested that he wouldn't come to their defense if attacked (undermining the core rationale for NATO), and siding with Russia in its conflict on Ukraine. That Trump is also threatening not one but two NATO allies with violence and demands they give up territory to us further undermines the entire alliance. \n\nEurope isn't rearming to placate Trump, they're doing it because they see us as a dire threat. In other words, they're moving away from a US-led NATO and making Europe more independent of the US altogether. That's not a good thing for the US at all.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "OhridMK",
                                            "body": "Trump has been saying the same thing now for two terms. Europe needs to up their defense spending. Great they don’t have to depend on US. Let them be then. I see it as a positive for both. European nations spend money get stronger. The US doesn’t have to subsidize. Win - Win.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "OhridMK",
                                                    "body": "Hense. \n\nhttps://www.nbcnews.com/politics/national-security/trump-admin-considers-giving-nato-command-exclusively-american-eisenho-rcna196503",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "sualk54",
            "body": "how did it work out the last time Germany increased their military spending?",
            "score": -6,
            "replies": [
                {
                    "author": "Puzzleheaded_Gur5143",
                    "body": "MASSIVE shortterm gains tbf",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "Chris97786",
                    "body": "Last year?",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "ManulifyGamesFlo",
                    "body": "Yeah cause times are totally comparable. What a stupid comment ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ManulifyGamesFlo",
                    "body": "Yeah cause times are totally comparable. What a naive comment ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Blue026",
            "body": "Wasn’t this priced in last week? The only real change could have been if they didn’t agree to it\n\nIt’s literally a stimulus bill for an economy that’s been on the decline for 2 years. \n\nWho knows if the new parliament that’s coming in next week will do anything to stop it since they wouldn’t have voted to approve it\n\n\n“The conservatives and SPD wanted to pass the legislation through the outgoing parliament for fear it could be blocked by an enlarged contingent of far-right and far-left lawmakers in the next Bundestag starting March 25. Merz has justified the tight timetable with the rapidly changing geopolitical situation.“",
            "score": 0,
            "replies": []
        },
        {
            "author": "Simple_Phrase3579",
            "body": "Deutz ist Amtssprache",
            "score": 0,
            "replies": []
        },
        {
            "author": "Emerald-Trader",
            "body": "Germany might have to defend Europe against communism once again. Hopefully we don't need the rearmament but for those who know their history us Europeans are using the Ukrainian army as our 6th Army to hold Russia back, we must be grateful for that and continue our support.",
            "score": -1,
            "replies": []
        }
    ]
}