{
    "title": "Ethan Klein does a nazi salute while addressing his \"haters\", this is after he's been actively attacking and harssing pro-palestine creators for months on end while accusing them of antisemitism, and doxxing random people on Instagram because he believes their comments were antisemitic",
    "author": "wankah69",
    "subreddit": "Fauxmoi",
    "rank": 10,
    "score": 7482,
    "upvote_ratio": 0.85,
    "num_comments (reported by reddit)": 709,
    "url": "https://v.redd.it/twhjpzc9adpe1",
    "id": "1jdvxhc",
    "selftext": "Once again I present to you Ethan Klein, the world's biggest hypocrite. He is the embodiment of rules for thee, but not for me. Doesnt matter if he's \"joking\" while doing it either ... if he wants to be taken seriously maybe don't do the Sieg Hiel multiple times on air.",
    "comments": [
        {
            "author": "spotlight-app",
            "body": "Pinned [comment](https://reddit.com/r/Fauxmoi/comments/1jdvxhc/ethan_klein_does_a_nazi_salute_while_addressing/migsjb9/) from u/Appropriate-Soup-188:\n\n> JEWS 👏 WERE 👏 NOT 👏 THE 👏 ONLY 👏 VICTIM 👏 OF 👏 THE 👏NAZIS.  That's why you can't \"reclaim\" the sieg heil   because black and brown people were inferior poles were inferior , Romani , queer, handicapped.  This  is essentially a black man walking around saying white power  it's not reclamation is dilution at best and Nazism at worst",
            "score": 1,
            "replies": []
        },
        {
            "author": "Silent_Handle_6096",
            "body": "There’s a much, much larger discussion here about how fucking cancerous YouTubers and streamers are to our youth. It could go in so many directions that I genuinely cannot even begin, it would be like a 500 page essay. And there are so many smaller streamers doing the most foul stuff that no one would know about unless you’re already in the culture of it.",
            "score": 2220,
            "replies": [
                {
                    "author": "No-Assumption-1738",
                    "body": "I think the damage is already done, my younger brother went through a 4chan incel type period. \n\nI was making similar complaints about young men, he ranted that after gamer gate political figures including some of trumps first cabinet targeted young men with right wing bullshit using gaming communities, \n\n\nTarget 11 year old boys with backwards ideals on discord and suddenly slurs are funny again ",
                    "score": 520,
                    "replies": [
                        {
                            "author": "peanuts_arbuckle",
                            "body": "i feel like it's not even comparable to that, it's even worse. shit like this is mainstream, easy to access, pretty much mainstream and the norm for kids.\n\n4chan shit was something you'd have to go out of your way for and bringing it up around other people felt like a taboo. i'd know because id frequent as a teen, thankfully im not stupid enough to let shit like that take over my mind but yeah.\n\nstreamers and youtubers basically being the only social connection some kids/teens have has got to be thr most dangeroud shit ever",
                            "score": 198,
                            "replies": [
                                {
                                    "author": "fddfgs",
                                    "body": ">4chan shit was something you'd have to go out of your way for and bringing it up around other people felt like a taboo.\n\nYeah they were shocking images that someone might send you and you'd click away immediately. People would laugh because \"holy shit that was fucked\" and there wouldn't be an argument around it. \n\nNow it's \"Andrew Tate has some good ideas\" and if you argue against it then you need to have watched a minimum of 300 hours of content before you're allowed to criticise him.\n\nNot saying that 4chan era beheading videos were good but they're not on the same level as brainwashing teenagers. Sad to see Ethan fall into the same pit.",
                                    "score": 117,
                                    "replies": [
                                        {
                                            "author": "Scary-Revolution1554",
                                            "body": "Interestingly enough, I was having a convo with my coworker and we were discussing random stuff and somehow got to redpill and then Andrew Tate.  And I was saying how there are small nuggets of truth that can draw ppl in but, it's also buried under mounds of crap.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "No-Assumption-1738",
                                    "body": "Sorry I wasn’t clear, he wasn’t saying they were being targeted on 4chan , I was just using it as a descriptor for him \n\n\nHe said they’re in most gaming/social spaces frequented by kids,  there’s been a jump from multiple generations agreeing ‘you don’t say certain words’ to kids from all backgrounds arguing it’s an unnecessary over correction that causes bigotry. ",
                                    "score": 21,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Miserable_Cress_1678",
                            "body": "Stop saying the damage is done. It helps resolve the guilt of those who might eventually be inspired to actually do something to stop it. Time will keep moving and we have to at least try to be organized and stand for something",
                            "score": 54,
                            "replies": [
                                {
                                    "author": "highschoolnickname",
                                    "body": "You are pointing out something important.  In the before time, climate deniers were getting kicked off social media for false information.  \n\nThe bots and trolls then turned into climate “doomers” saying exactly this same thing, yes it’s man made but it’s too late to do anything. Anyone saying it’s too late might be operating in bad faith.",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "ammybb",
                                            "body": "This is critical. Look at indigenous people and international folks all over the world who are enduring worse and yet are still resisting and surviving. Yes, we are in a tough situation and the outlook is bleak, but doomerism only serves those who wish to do us harm. They want us becoming despondent and depressed so we do nothing.",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "SunOk6305",
                                            "body": "just like it’s too late to save kids from gun violence through legislation, it’s always too late…",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "IndignantQueef",
                            "body": "Not for nothng but this is straight out of the Nazi playbook. They spent years broadcasting antisemetic rhetoric on the radio until it was just backgound noise and people believed it without even thinking.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "peter-pan-am-i-a-man",
                            "body": "Heck, i went through a similar phase as influenced by the internet, this was well before streamers/YT was popular though",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "bigwhiteboardenergy",
                            "body": "Steve Bannon specifically saw the potential of harnessing the Gamergate incels. There’s a really good documentary about 4chan and this progression called The Antisocial Network—I think it’s on Netflix. Highly recommend!",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Dwashelle",
                            "body": "I'm a millennial and I thought younger generations would continue the trend of becoming more progressive but now it looks like they're regressing, particularly young men, especially young men.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Dry_Excitement7483",
                            "body": "I spend my entire youth on 4 chan 2004-2010 and i can assure you most of it was irony on there. It wasn't until Facebook took over the internet that people became morons",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Rddt_stock_Owner",
                            "body": "Slurs have always been funny to (pre)adolescents. It's a part of growing up and maturing for the majority of people that you then realize it's wrong. The problem is people aren't growing up.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Accomplished_Deer_",
                            "body": "Young kids like being edgy. Let's not pretend that's a new thing in this political climate.  COD lobbies were slurs 15 years ago, Youtube had nothing to do with it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "scorpiomoon1993",
                    "body": "This 👆🏾I’m a teacher and the amount of times I’ve heard of kids hyping up weird YouTubers/streamers. And I’m like you mean the one who did [insert whatever creepy/heinous act]? I know kids can be sneaky, but I’m gonna need parents to get re-engaged.\n\nEdit: oh just wanted to add I teach mid to late elementary school (3-5), so yeah it starts young.",
                    "score": 33,
                    "replies": []
                },
                {
                    "author": "hollyw00d8604",
                    "body": "yep I weep for the future of gen alpha.  They're gonna be so fucked up mentally, especially since so many parents think putting a screen in their face all day is good parenting",
                    "score": 140,
                    "replies": [
                        {
                            "author": "deisukyo",
                            "body": "It’s worse than that. We were raised with screens (Gameboy, n64, PS, Xbox), however, what’s making it bad is that the parents are PUTTING the kids as early as newborns on social media. They’re straight up exploiting and making the children into content while exposed to social media at a younger age. That’s a larger digital footprint",
                            "score": 75,
                            "replies": [
                                {
                                    "author": "FullyFocusedOnNought",
                                    "body": "My nephew's grandad was trying to convince me to give our two-year-old an iPad a few years ago when he was busy making something out of wrapping paper.\n\nJust why?",
                                    "score": 29,
                                    "replies": [
                                        {
                                            "author": "Rays_LiquorSauce",
                                            "body": "Isn’t that…your uncle ",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "deisukyo",
                                            "body": "Exactly? Like what child needs that? Give him some LEGOs (the big ones), some fun action figures, race cars and that’s a happy kid 😭",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Designer_Valuable_18",
                                    "body": "At lease ouf Suepr Famicom/Playstation 1/PSP weren't talking about how Hitler was a great guy and how arabs are subhumans\n \nThey just let us play Mario, Resident Evil and Tekken.",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "deisukyo",
                                            "body": "Well, let’s not get too carried away when we had those COD lobbies 😭 mofos we’re screaming “white power” or “I’m your slave master” like the most foul shit. It’s just that we had more layers and easier to protect your kids. \n\nThe parents aren’t even worried about protection when they can post the kids to TikTok.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Djana1553",
                                    "body": "At least we were made our families tech support.I have a friend who has a half sister that is like 9-10 and he put her on his pc.She was trying to use the desktop like a touch-screen and was confused by the keyboard.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "deisukyo",
                                            "body": "Omg this!!! Now parents aren’t even involved in setting up things or knowing what their kids are doing. They just hear “oh they got kids videos” on YouTube and let them have unfiltered access. \n\n“Oh everyone else have it, let me get my kid this item/app” without any form of research. “Oh this guy talks about the president and how to ‘be a man,’ must be educational!” It’s like they don’t even want to be involved with their children and expect everyone else to raise them hence the pressure that’s put on underpaid teachers to teach them everything. It’s laziness in the worst way.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Melodic_Type1704",
                            "body": "iPad babies are this generation’s latchkey kids.",
                            "score": 19,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Uplanapepsihole",
                    "body": "The edgy 13 year old boy has always been a thing but my god it’s getting worse now.  One issue is that people like Andrew Tate are actually being legitimised by people like Donald trump etc. \n\nWhen my older brothers were edgy teenagers, they were making social media’s and emails called like “big dong” and shit.  Yes immature but ultimately harmless and you grow out of it.  Fucks sake, now justifying rape is the new thing.",
                    "score": 100,
                    "replies": [
                        {
                            "author": "FullyFocusedOnNought",
                            "body": "Just reading through the \"personal life\" section of the Wikis of Trump, Hegseth and Musk is enough to make you wonder what is going on.\n\nAnd then they have Conor McGregor in the White House...",
                            "score": 32,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Benevolent__Tyrant",
                    "body": "It's really telling that Asmongold who is essentially just a different flavor of Ethan Klein is the most popular non gaming streamer on twitch and one of the biggest channels on youtube among gen Z.",
                    "score": 23,
                    "replies": [
                        {
                            "author": "andorgyny",
                            "body": "He is THE most popular \"political\" streamer on twitch. An absolute moron and a genocidal freak.",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "Mamacitia",
                            "body": "And even then he’s known for playing WOW",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "kakarot-3",
                    "body": "I’m not youth and am in my 30s but about 7-8 months ago, I purposely unfollowed every “influencer” and YouTuber on all socials. I stayed following influencers who provided something helpful, like cooking or working out. Only YouTuber I follow is Ryan Trahan who makes some fun travel, challenge type content. \n\nMy mental health has improved so much being able to scroll my timelines and only see real people I know, plus a couple athletes/artists. I haven’t been happier tbh. Influencers, especially ones who contribute nothing, are toxic cancers to society. Just an embodiment of gluttony and overconsumption capitalism. They’re destroying society",
                    "score": 53,
                    "replies": [
                        {
                            "author": "reallyintothistho",
                            "body": "May I recommend Rajiv surendra’s channel. He does vids that are just practical housekeeping/cooking and there’s something so delightful and charming that is so counter to the toxicity online. ",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "kakarot-3",
                                    "body": "Thanks for sharing! Will def check it out! It’s nice to see practical content nowadays",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "SwimmingDelay8152",
                                    "body": "Oh I love him! I didn't know that he is doing housekeeping and cooking videos now! Thanks!",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "SwimmingDelay8152",
                                    "body": "Oh and also I really love Squirmy and Grubs. They're a really wholesome couple that are inter-abled and have lots of funny personal stories about their misadventures. They both have really awesome positive attitudes (in a non-toxic way); they always laugh at themselves and they always make the best of everything. They are \"couple goals\" in a non-annoying, non-superficial way.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Expensive-Can-6212",
                            "body": "I love watching Ryan Trahan. As book lover, I find his wife, Haley, just as entertaining to watch.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "kakarot-3",
                                    "body": "I haven't seen much of her content as book content isn't my interest but I have heard and read that she's very popular and has great content for people who love reading. I know Ryan recently said he challenged himself to read like a book a month or something for her. They seem like a very wholesome couple and his content is really great. It isn't sensationalized or heavily fake. It reminds me of older, simple content. plus his joyride candy is great haha",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Kriandis",
                    "body": "It's crazy that a whole generation is being raised under disinformation, and eating it up like it is cake.",
                    "score": 35,
                    "replies": []
                },
                {
                    "author": "HispanicAtTehDisco",
                    "body": "h3 has always had a bit of a rabid fanbase even before this “zionism/fuck hasan” arc (i’m reminded of how much they defended the fact that teddy fresh regularly stole designs) but it’s been crazy to see what the fuck they’ve turned into in the past year or so. \n\ni’m sure a lot of it is the sexpestiny fans that transplanted over once it became (even more) embarrassing and indefensible to be a fan of his publicly but people are fr out here harassing random instagram commenters and youtubers for the fucking vape nation guy and his IDF wife that steals designs like what the fuck are we talking about here bro 😭",
                    "score": 31,
                    "replies": []
                },
                {
                    "author": "Warm_Perspective9180",
                    "body": "You hit the nail on the head. This is a symptom is a bigger problem.",
                    "score": 31,
                    "replies": []
                },
                {
                    "author": "what_the_actual_fc",
                    "body": "This shit has become mainstream now. Trying to tell a 14 year old that this isn't OK is becoming impossible 😕",
                    "score": 25,
                    "replies": [
                        {
                            "author": "deisukyo",
                            "body": "Now everyone trying to get a microphone for a podcast to give shitty opinions and advice to impressionable teens and young adults",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "what_the_actual_fc",
                                    "body": "Yep. It's so easy to say what people want to hear, adults nevermind kids 😒",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "EmykoEmyko",
                    "body": "Yes, l saw someone saying that young men feel angry that they missed out on the time where you could get away with slurs — and they were referring to the 2010’s! Kids are getting sucked into these streamers’ orbit because the gaming seems innocuous, but they’re getting all this toxic ideology. And now we’re dealing with them as voting adults.",
                    "score": 31,
                    "replies": [
                        {
                            "author": "kill-billionaires",
                            "body": "I think people are always just thinking of middle school?  I felt like slurs were everywhere in middle school and I barely heard any after the first day of HS it was weird.\n\nThe streamer thing used to be called the pewdiepipeline back in the 2010s",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Freenore",
                    "body": "I'm so glad I stopped ritually watching every video from my favourite YouTubers in the 2016-2019 period. I grew out of their content and realised that we don't need to know pretty much everything that they make a video out of. We don't need yet another house tour of your mundane house, or for you to bring out your girlfriend for views. Or the new trend of reacting to videos and reddit, the pinnacle of laziness and lack of creativity.\n\nNow I occassionally watch one or two channels, and mostly keep to videos on a certain topics. Learning that there are so many academic and book lectures on YouTube has been incredible, there are so many amazing channels, for instance, Overthink Podcast (hosted by two academic philosophy professors).",
                    "score": 13,
                    "replies": [
                        {
                            "author": "garbagebagchic",
                            "body": "I love Overthink! The Grey Area with Sean Illing is a good one too.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ThlnBillyBoy",
                    "body": "There is this analysis that touches on that topic I think is quite good https://www.mediamatters.org/google/right-dominates-online-media-ecosystem-seeping-sports-comedy-and-other-supposedly",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "golosee",
                    "body": "Genuinely tho, who is watching h3? Like what’s their demo???",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Silent_Handle_6096",
                            "body": "I turn 26 this month and he hasn’t been relevant to me or anyone else in my life since like late high school / early college lol. I really can’t imagine adults with real lives and jobs saving their time for him, regardless of politics.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "NicoToscani",
                    "body": "Not directly related to streamers but I would fully support legislation to require streaming content platforms to block fight videos filmed at schools or videos that include people obviously under the age of 18 engaging in violence towards others and vandalism. Thats a whole other epidemic that’s harming children, people and businesses everyday. Kids are just filming and posting these videos for attention, they don’t care who gets hurt.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "FullyFocusedOnNought",
                    "body": "There are also good ones. I am now middle-aged but randomly came across a video by Jreg, and he and his associates seem to put out a lot of thoughtful and pretty human content (plus a load of funny stupid stuff too). It gave me a bit of hope.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "ghettone",
                    "body": "I miss vape nation…..",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "YouFoolWarrenIsDead",
                    "body": "Right? Hasan is literally creating a new generation terrorist sympathisers, or just regular ol terrorsts.",
                    "score": -3,
                    "replies": []
                }
            ]
        },
        {
            "author": "knickstapeeee",
            "body": "he genuinely scares me, like I would feel soooooo unsafe around him omg",
            "score": 3511,
            "replies": [
                {
                    "author": "Classic-Carpet7609",
                    "body": "https://preview.redd.it/jbu3rmmhjdpe1.jpeg?width=1170&format=pjpg&auto=webp&s=7a924a5feb2ac4e7a11660e1b312711a60e8cf15\n\nExcept in this case we know what’s wrong with him cuz he filmed it all and put it on the internet",
                    "score": 1669,
                    "replies": [
                        {
                            "author": "Uplanapepsihole",
                            "body": "Ok off topic but this tweet is so real.  I can’t think of a time where I’ve had a proper bad gut feeling about someone and ive been wrong.  Perhaps is self fulfilling prophecy, perhaps I’m a psychic",
                            "score": 424,
                            "replies": [
                                {
                                    "author": "MouseRaveHouse",
                                    "body": "If you like reading you should check out a book called The Gift Of Fear. It gets suggested often in the 2x sub quite often. Here's a link that gives a brief summary but basically it's about learning to listen to your intuition to keep you safe. \n\nhttps://www.blinkist.com/en/books/the-gift-of-fear-en#:~:text=Brief%20summary,staying%20safe%20in%20today's%20world.\n\nAnd here's the wiki\n\nhttps://en.m.wikipedia.org/wiki/The_Gift_of_Fear",
                                    "score": 57,
                                    "replies": [
                                        {
                                            "author": "Uplanapepsihole",
                                            "body": "Oh someone told me about this book a while ago and I actually put it in my notes.  Thanks for reminding me haha!",
                                            "score": 15,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "stolen-kisses",
                                    "body": "I think people who give us bad \"vibes\" or an ill gut feeling often unconsciously project their unpleasantness in other ways — such as the way they talk (through their tone, choice of words), how they hold their eye contact, etc. We pick up these subtle signals and are immediately repelled by them.   \n\nThere are, of course, very charismatic individuals who mask their unpleasantness well, but the mask also reads as uncanny or overcompensating, which is why we are often unsettled by their presence too.",
                                    "score": 239,
                                    "replies": [
                                        {
                                            "author": "Uplanapepsihole",
                                            "body": "Oh yeah, it’s definitely subconsciously noticing things that we wouldn’t usually think about",
                                            "score": 9,
                                            "replies": []
                                        },
                                        {
                                            "author": "jonboyblues",
                                            "body": "This is well said! It seems it’s those subtle things that our gut must be picking up on a subconscious level. Cool thought",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "PeeFromAButt",
                                    "body": "It’s called your subconscious picking things up your conscious mind ignored and sending you warning signals. \n\nRead The Gift Of Fear, fantastic book about gut feelings and why we should listen to them and the science behind it all.",
                                    "score": 10,
                                    "replies": []
                                },
                                {
                                    "author": "Fantastic_Click5912",
                                    "body": "Nah, it's not a self fulfilling prophecy, your subconscious picks up on things that you consciously do not take notice of right away. Your subconscious is warning you and whether your gut feeling is wrong or right you should follow it and ask questions later. Having a healthy relationship with fear could save you from so much trouble. I wish I had listened to it when I met one of my ex friends.",
                                    "score": 22,
                                    "replies": []
                                },
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 53,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "cassafrass024",
                                    "body": "It’s the lizard part of our brain. That survival instinct that has stayed with us for thousands of years. A lot of people ignore it as just being dumb. It’ll save your life though. Gavin de Becker writes about it in The Gift of Fear.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Straight-Hospital149",
                                    "body": "I grew up around a lot of people with questionable character. Now, for the most part, it's easy to pick them out. You can call it intuition but, imo, it's really just identifying patterns in people's behavior (including communication). When you have that gut feeling, explore it. Dissect it. Figure out what they're doing and what their behavior means. Then use what you've learned. It's not being psychic. It's being human. We are pattern recognition machines. The feeling you get is just the beginning. Don't dismiss the rest.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "veganbeast1",
                                    "body": "Trump gave me that feeling when he was running for president the first time..he gave me that ick feeling from his stupid show first. Then when he ran for president I got such a sense of dread that this was going to be very very bad. I even broke up with someone over it. lol..",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "HispanicAtTehDisco",
                            "body": "there’s so many people you run into in life that you can tell have *something* off with them but until the mask slips you have to keep your mouth shut so you don’t seem like you’re hating for no reason",
                            "score": 44,
                            "replies": [
                                {
                                    "author": "veganbeast1",
                                    "body": "In Jamaica..we say..”my spirit is not taking to that person”(paraphrasing so people can understand)",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "Cumdump90001",
                            "body": "Wasn’t he widely liked on the internet until relatively recently? I’ve never paid much attention to him, and I’ve always had a feeling in my gut that he’s… off/not to be trusted. But I feel like until relatively recently every time I saw him posted or mentioned it was neutral or positive. It seems he fell off FAST. Am I wrong about this? Again, I never really paid enough attention to him to be sure of any of this other than my general distrust/dislike of him.    \n\nI also didn’t trust Ellen long before the news broke about her.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "mmmbuttr",
                    "body": "I still have no fucking clue who this guy is",
                    "score": 26,
                    "replies": [
                        {
                            "author": "PhutureLooksBrighter",
                            "body": "I think he is the next jared the subway guy",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Raddish_",
                            "body": "He was a 2016 edgelord era YouTuber who got popular and then transitioned to be a podcaster when edgy content became unprofitable on YT.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "lollulomegaz",
                            "body": "Neither does he.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "WifeOfSpock",
                    "body": "Right? He’s the type of dude you cross the street to avoid. He’s such a creep.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "RecordingNervous7921",
                    "body": "Idk how all of the staff hasn’t quit",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Classic-Carpet7609",
            "body": "Well, I certainly can’t believe my lying eyes cuz I know Ethan Klein has always been against antisemitism \n\nCant believe Hasan Piker would make Ethan do this smh\n\nQuestion for longtime Ethan fans, is the Sieg Heil his new n-word? I know how much he loved to throw that around",
            "score": 1009,
            "replies": [
                {
                    "author": "distantmusic3",
                    "body": "His fans are actually quite happy with his arc and see no problems about it. They are busy brigading and harassing his ‘haters’. I pity the H3 community. They’ve become desentisized. His whole career is about hating, harassing, bullying, and racist, misogynistic ‘jokes’",
                    "score": 279,
                    "replies": [
                        {
                            "author": "thousandthlion",
                            "body": "My husband pulled up a clip yesterday that was from like a year and a half ago, maybe two years ago. He was like “it’s like a different person” the difference in his behavior and overall demeanour was SO wild compared to now. We had been h3 fans early on but outgrew it and got tired of him punching down instead of up. It’s actually concerning that his remaining fans don’t seem to be worried about him. This is a paranoid, angry, obsessive shell of a human who’s clearly going through some kind of crisis but instead of being concerned for his behavior they’re enabling him and blaming everyone else.",
                            "score": 47,
                            "replies": [
                                {
                                    "author": "MachineElf432",
                                    "body": "My partner and I found the podcast/show in 2022 and we liked it for the “goofs and gaffs” (actually harmless funny videos) and things you laugh you lose, & guess who’s high. There were many unbearable episodes during the time we watched like when he made every episode for a month about Collen Ballenger where we just had to tune out. Left after he showed his true colors regarding Palestine. \n\nNow, the show themselves is the goof and gaff cause they are all clowns, and instead of guess who’s high it’s guess who’s Heil.",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "stormdahl",
                                    "body": "He was a piece of shit then as well. You’d have to go back a lot longer to find any redeeming traits in this guy. ",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Sevensevenpotato",
                            "body": "Any h3 fan with any sense of decency dropped him ages ago. I know I did. \n\nHis fanbase has been completely sanitized into right wing nuts and sadistic internet trolls. There’s literally zero reason to pay attention to him unless you’re comfortably in one of those camps.",
                            "score": 34,
                            "replies": []
                        },
                        {
                            "author": "Flapappel",
                            "body": "Came across this sub/post as a suggestion. I havnt seen this dude since he just started making YT videos 10years ago. What the hell happend to him...?",
                            "score": 28,
                            "replies": [
                                {
                                    "author": "_fire_and_blood_",
                                    "body": "He started spiralling after October 7. He's a narcissist so he can never be wrong, and he thinks everyone on the internet is out to get him because he's Jewish.",
                                    "score": 62,
                                    "replies": [
                                        {
                                            "author": "Equivalent-Koala7991",
                                            "body": "Oct 7th, what year?\n\nThis dude has been batshit for years. And I say that as someone who used to watch him, before he was absolutely batshit lol.",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "author": "lampstaple",
                                                    "body": "I liked his videos in 2016 when I was like fresh out of high school but it didn’t take long to realize the dude was a massive hypocrite with a ridiculous superiority complex",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "StupidSexyAlisson",
                                                    "body": "I stopped watching him after his podcasts became a regular thing.",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "DazeDawning",
                                                    "body": "I assume you're out of the loop. On October 7th, 2023, Hamas attacked Israelis in Gaza and killed ~800 civilians. Zionists take the event as carte blanche for Israel to do whatever atrocities they want to the Palestinian population because now it's \"payback,\" and suffice to say Israel is doubling down on the human rights abuses. \n\nEthan twisted his brain into a pretzel trying to arrive at a position where it was completely unbiased of him to support Israel doing human rights abuses, so now everyone who criticizes him is an antisemite, making fun of people who like a shitty brand of hummus is blatant racial discrimination, Zionist is a slur, Twitch is irredeemably biased because they won't ban the people he wants banned, he's spending all his free time compiling unflattering clips of his former podcast co-host because he \"tricked\" him into thinking they agreed on things during the podcast, and apparently now sieg heiling is cool. He may have been batshit for years, but he's really been kicking it up a notch lately.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "andorgyny",
                            "body": "of course you are right, the guy's career was built on disgusting racist and misogynistic bullshit, and definitely bullying, but it does sound like a lot of the people who came to his content during his \"progressive\" turn, maybe when he was trying to trick steven crowder into debating sam seder (lmfao how the turntables i stg), have left the community. because over and over again in hasan's community, whenever i check in to hear about the news and not what new lows this delusional gopher ass crackup eninem-re: mariah-carey-obsessed ass man is sinking to, there are so many people talking about how they used to be h3 fans before oct 7th.\n\nI think it is important for those of us who are chronically online to remember that millions of people casually engage with these creators and don't go through like a vetting process or whatever. that said, the guy said the n word enough for a compilation like I'm assuming that a lot of his fans knew about that shit if they were in the community longterm. just... to be clear, h3 has lost a bunch of fans. its part of why he is cracking up so hard.",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "sparklingwatterson",
                            "body": "Or his “fans” have left the community and stopped watching the show. It used to be fun before all this stuff with him and Hasan. His views on the Palestinian genocide. They used to do fun segments and now it’s just Hasan hating and this shit. Like he had problematic moments before this but he had owned them and apologized largely. Something seems to have broke in his brain and now he’s just fully whatever is happening now. I had to unsubscribe and leave the communities. It’s really disappointing to see this unfold",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "stprnn",
                            "body": "All twelve of them",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "stormdahl",
                            "body": "I think it’s a different community. Everyone I knew watched and loved him during the vape nation days, but we all ditched a loooong time ago. ",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Wonderful-Analysis28",
                            "body": "Brigading anything that might be linked with their enemies.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Chrywillia",
                    "body": "Last time he did it a few times while shouting \"I'M JEWISH. IT'S OKAY. I'M JEWISH\" and said \"watch people try to get mad at me for this\"\n\nSomehow, YouTube did indeed not get mad at him for it",
                    "score": 132,
                    "replies": [
                        {
                            "author": "LittleMissQueef",
                            "body": "I said this in another thread but I'll repeat it here:\n\nSo disgusting. I hate that he thinks he has a pass to sieg heil because he's Jewish. He proves time and again how uneducated about WWII and the Holocaust he is.\n\nThe Nazi's invaded and killed so many innocent people, whole towns and villages bombed, broken and devastated. Europe will never forget those atrocities and here is a privileged pos mocking every victim of that war. Abhorrent and repulsive aren't strong enough words to describe him.\n\nEthan doesn't care that the nazi salute for most people is not funny and not something to use as a political joke.\n\nThere are unexploded bombs from WWII still being uncovered all over Europe. Here in the UK we've had multiple found around schools. \n\nSome of our family members never returned home from the war, our grandparents couldn't talk of them because of how traumatic it was. \n\nThere are places that are still \"bombed out\" as a reminder of what the Nazis did. \n\nEthan has such a narrow view of the world he doesn't see anything beyond himself. I'm tired of privileged, ignorant people having platforms that spout ill-informed, uneducated information on past and current events.\n\nEdit: Wikipedia - \n\n> World War II was the deadliest military conflict in history. An estimated total of 70–85 million deaths were caused by the conflict, representing about 3% of the estimated global population of 2.3 billion in 1940.[1] \n\n>Deaths directly caused by the war (including military and civilian fatalities) are estimated at 50–56 million, with an additional estimated 19–28 million deaths from war-related disease and famine. \n\n>Civilian deaths totaled 50–55 million. Military deaths from all causes totaled 21–25 million, including deaths in captivity of about 5 million prisoners of war.",
                            "score": 61,
                            "replies": [
                                {
                                    "author": "Captainbluehair",
                                    "body": "In the US, men are doing Neo N-zism in Lincoln Heights, Ohio, a historically African American neighborhood composed of Black people who fled the fascism of Jim Crow. \n\nSo the Lincoln Heights community - as of a few weeks ago - is now patrolling the streets with arms, because \n\n1) cops not only did zero but a another video showed cops actually coddling these Neo NZs 🤢and \n\n2) what else should Black people do when these neoNZs show up at their kids’ school, on their streets, etc to harass them? \n\nTLDR: People like Musk and Klein embolden Neo NZs to terrorize Black people; it’s clear it’s not only Jewish people who are affected by normalization of NZ gestures ",
                                    "score": 13,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Sevensevenpotato",
                            "body": "As if Jewish people can’t be antisemitic. H3 is such a fucking joke. Yeah and black people cant be racist either. Sure bud. \n\nCan’t wait for this loser to disappear from my consciousness.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Bielzebuby",
                    "body": "https://preview.redd.it/7x1kr5e5rdpe1.jpeg?width=288&format=pjpg&auto=webp&s=41bc6691f4e78395cd8d886d95632e2e36151ee0",
                    "score": 67,
                    "replies": []
                },
                {
                    "author": "HispanicAtTehDisco",
                    "body": "the funniest part about ethan claiming to have been fighting extremism and antisemitism for a long time is that he didn’t even cover the elon sig heil until like 2 days later because he would be demonetized for talking about it. \n\nkinda puts a big ol asterisk on his claim. “fighting antisemitism: only when i can get paid for it”",
                    "score": 58,
                    "replies": []
                },
                {
                    "author": "fddfgs",
                    "body": "Ex fan, but probably. From what I've heard he did it like 7 or 8 times in today's stream at different moments.",
                    "score": 44,
                    "replies": []
                },
                {
                    "author": "No-Plankton2721",
                    "body": "Its so crazy how psychopaths like this get to control the narrative because their insane babble goes 10k mph.",
                    "score": 63,
                    "replies": []
                },
                {
                    "author": "birchtree63",
                    "body": "Ethan thinks it's okay because he's Jewish, talk about blatantly disregarding the millions of other deaths of non-jewish peoples",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Civil_Acadia4923",
                    "body": "Not an Ethan fan but he is doing it ironically… are you guys being serious? Are his lame attempts at comedy simply not allowed now?",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Bielzebuby",
            "body": "Sorry but I had to laugh at them celebrating Paddy's Day considering Ireland is one of the most anti Zionist countries on Earth-joining SA in their ICC case and a country who was colonised, it's population genocided and who had a bloody fight for independence. The population is pushing for Israeli goods to be banned and for Palestine to be free. \n\nSaoirse Don Phailistín 🇵🇸",
            "score": 362,
            "replies": [
                {
                    "author": "Zestyclose_Visit4834",
                    "body": "He's said in the past that Paddy's day is an American holiday and we don't celebrate it here in Ireland lol. I don't think he knows much about Irish culture",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "No-Split-5601",
                    "body": "the population isnt pushing for that mate , everyone is allowed to get smashed and celebrate paddys day",
                    "score": -57,
                    "replies": []
                },
                {
                    "author": "Bielzebuby",
                    "body": "Lol. No one in Ireland says mate unless you're a Brit or an Aussy so I'm gonna go ahead and say ssh!",
                    "score": 19,
                    "replies": []
                }
            ]
        },
        {
            "author": "SkinADeer",
            "body": "Everything I’ve seen about Ethan and Hila Klein has been against my will. They’re so corny.",
            "score": 507,
            "replies": [
                {
                    "author": "RAWR_Orree",
                    "body": "Same.  Corny is somewhat endearing, though.  Ethan and Hila Klein are disgusting.",
                    "score": 222,
                    "replies": [
                        {
                            "author": "Suggestion2592",
                            "body": "tbh being called corny is exactly the word that would annoy them though. people thinking they are cringe probably upset them more than ppl calling them disgusting.",
                            "score": 49,
                            "replies": []
                        },
                        {
                            "author": "Sevensevenpotato",
                            "body": "Fucking vile is how I would put it",
                            "score": 11,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "jkraige",
                    "body": "I honest to God do not understand people who watch these people stream and \"podcast\". It's just them babbling I think? Some years back I tried watching for to see what the hype was about but after a few minutes I was left more confused than when I started. There's no real content. It's just people kinda going blah blah blah at each other for multiple hours every day it seems like",
                    "score": 57,
                    "replies": []
                },
                {
                    "author": "OpenThePlugBag",
                    "body": "Im tired boss, i just miss vape nashe",
                    "score": 25,
                    "replies": [
                        {
                            "author": "AP_professional",
                            "body": "Those days are long gone and they’re never coming back.",
                            "score": 28,
                            "replies": []
                        },
                        {
                            "author": "CardmanNV",
                            "body": "Dude, that was like a 9 month period a decade ago. \n\nThe second the podcast started everything we off the rails hard.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "HelixSapphire",
                            "body": "Calling out Leafy and dropping Vape Nation not even a day later was such a baller move. It’s sad how far removed we’ve become from lovably goofy 2016 H3H3.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "fujoshirealness",
                            "body": "reminiscing about the days he was throwing around the n-word as better than the current days where he is doing nazi salutes is wild lmao",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "mnjvon",
                    "body": "And just generally sloppy and annoying. Never understood the fandom.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Gabe_b",
                    "body": "So fucking cringe. Politics aside, I'd avoid them like the plague at any party, clout chasing mediocre dorks",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "_Thrilhouse_",
                    "body": "I still don't understand what is their value, appealing or \"their thing\"",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Goat_gutz",
            "body": "It’s not antisemitism to call out Israel on its bullshit and War crimes.",
            "score": 102,
            "replies": []
        },
        {
            "author": "gogosox82",
            "body": "How could Hasan Piker make him do this/s",
            "score": 181,
            "replies": []
        },
        {
            "author": "wankah69",
            "body": "It doesn't matter if he's \"joking\" while doing it. If he wants to be an authority on this topic and be taken seriously, maybe don't do the Seig Hiel live on air multiple times. Also if he wants to actively try and ruin the lives of pro-palestine creators because he believes they're being antisemitic, it's not wise to joke around about it. Just my opinion\n\nEdit: He also just recently called this subreddit \"a bunch of neo-nazis\" for absolutely no reason at all",
            "score": 598,
            "replies": [
                {
                    "author": "bigwigx",
                    "body": "This edit was made too soon because in the same stream as the first clip (from today) he did another salute later on.",
                    "score": 166,
                    "replies": []
                },
                {
                    "author": "beerzebulb",
                    "body": "What kind of a fucking joke would that be anyways? Adolf Hitler  and Nazism is the greatest disease that has ever happened to my country (arguably the planet) and Ethan as a descendent of the victims should and does know that well enough to know not to joke about this shit, let alone online in front of tens of thousands of people he has influence on. Sick of it. Don't even post this piece of shit here anymore. (Edit: ok I agree keep posting but still:) He doesn't deserve the slightest bit of a platform. How can you disrespect your own people like that I genuinely don't understand.",
                    "score": 86,
                    "replies": [
                        {
                            "author": "wankah69",
                            "body": "Yeah, he's a foul individual. His entire \"nobel crusade\" against antisemitism he's been on for 6+ months has been completely dismantled by him doing the nazi salute live on air. Nobody should ever take this man seriously again. Also not posting clips of him here is exactly what he wants, he's been actively trying to silence any criticism against him by throwing his money around with frivolous lawsuits. He's scared of being called out because he actually might have to reflect on his horrific behavior for once in his life. This fucker deserves to be front and center for the internet to see who he truly is. The amount of people he's sent his rabid fanbase to harass is disgusting. He needs to face accountability",
                            "score": 86,
                            "replies": [
                                {
                                    "author": "beerzebulb",
                                    "body": "You're right actually, I was just so angry, sorry. It's important to show off how horrible people are otherwise we as a mass would never know, I suppose. I'm just so sick of this face! This is how it starts guys... Musk was first, then Kanye, now this happens. They are normalizing it. Be vigilant.",
                                    "score": 20,
                                    "replies": []
                                },
                                {
                                    "author": "GreenUnderstanding39",
                                    "body": "Has he even actively sued anyone? Seems like he just keeps screaming he's going to as a scare and distract tactic. Meanwhile he is the one being sued by a former employee. Not a good look.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "cheetodustcrust",
                                            "body": "He tried to sue people and then revealed in an angry tirade that his lawyers said he had no case.",
                                            "score": 20,
                                            "replies": [
                                                {
                                                    "author": "GoldenGodMinion",
                                                    "body": "Equal parts hilarious and sad",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "what_the_actual_fc",
                            "body": "As a bit of a history geek it really is history repeating. Normalising shit like this with youth is in the fascist playbook. It's been happening for a few years now.",
                            "score": 29,
                            "replies": [
                                {
                                    "author": "realmistuhvelez",
                                    "body": "i thought it rhymes. Like how in the geopolitical stage, US are becoming akin to Russia.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Maverick5074",
                                    "body": "Maybe trying to get clout within that crowd or grifting.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Loud-Version-2539",
                    "body": "I legitimately have heard him say things so antisemitic that you would be shocked the man is a fucking disaster. \nWhen you read this Ethan being Jewish ain't the issue it's being a cunt hypocrite that people resent ",
                    "score": 31,
                    "replies": []
                },
                {
                    "author": "PrettyB0nes1313",
                    "body": "Yeah, honestly we need to put the “it’s just a joke, bro!” excuse for weak “irony” humor back in 2017 were it belongs. \n\nHe’s obviously doing it to get a rise out of his critics, but if someone pulled a gun to your face, doesn’t matter if they were genuinely angry, if it was unloaded, or they thought it’d be funny, they still did it. And that salute emboldens people who’d looove to point guns at people like Ethan",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Dinklem4n",
                    "body": "Feels like nothing but projection with these people.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Johnny_blueballs6969",
                    "body": "Watched Ethan for years, loved the show previously, and this is a fantastic take. I just can't take him seriously when he tries to be 'serious'. He can be very funny, this is not very funny.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Thrownaside789",
                    "body": "The allegations he's levied towards this subreddit follow a rule I'm calling h3's law \"every accusation is a confession.\" Each day I'm more embarrassed that I was ever a fan.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Commercial_Bus_5157",
            "body": "“iTs A j0KkKe”",
            "score": 89,
            "replies": [
                {
                    "author": "distantmusic3",
                    "body": "Like the n-word one! And the Boston bombing victim one! And the Aaron Bushnell one!",
                    "score": 58,
                    "replies": [
                        {
                            "author": "nunpho",
                            "body": "And the qtcinderella one",
                            "score": 18,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "elithalia",
                    "body": "Legalize Comedy™ /s",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Comfortable-Load-904",
            "body": "https://preview.redd.it/gx5j2dhcmdpe1.png?width=1319&format=png&auto=webp&s=2f4ecef530812ec05c682311ffbcc1c6ba3c9493\n\nWhat a vile human being!",
            "score": 89,
            "replies": []
        },
        {
            "author": "drizzes",
            "body": "he seems like a thoroughly unhappy guy",
            "score": 169,
            "replies": [
                {
                    "author": "_fire_and_blood_",
                    "body": "He's miserable and wants everyone else around him to feel the same. Every podcast episode is him yelling and berating his team live for everyone to witness, and also malding about how hot Hasan is 😂",
                    "score": 12,
                    "replies": [
                        {
                            "author": "genetic_nightmare",
                            "body": "Not surprising that the cast are leaving 😬",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MuggyOnionSlop",
            "body": "lol, again?? \n\nLast time I called him out for doing this I was accosted by an H3 fan who said we weren’t allowed to criticize a Jewish man for doing a N*zi salute because it’s “his way of coping”. It must take some extreme dedication to remain an H3 fan at this point. You’ve gotta start saying nonsensical things to attempt to defend him and he just keeps getting worse.",
            "score": 113,
            "replies": [
                {
                    "author": "Xx_Gambit_xX",
                    "body": ">It must take some extreme dedication<\n\nFanaticsism is the word. That's some strict lunatic behavior from them. Frothing at the mouth kind of stuff.",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "aqualink97",
                    "body": "I used to be a fan. That fanbase is borderline cult-like. It's insane the amount bending over backwards people do to justify what Ethan does. \n\nIt's unacceptable really. I finally stopped watching last year, and I feel so dumb. Looking back, Ethan has always been horrible, and I'm really embarassed that I watched for so long.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "downpill-skiing",
            "body": "Just when you thought he couldnt dig himself a deeper hole..",
            "score": 182,
            "replies": [
                {
                    "author": "JesusSaidAllah",
                    "body": "In this timeline, Jews can do the Nazi salute for \"fun\" without much fuss, and far-right politicians get invited to conferences in anti-Semitism.\n\nMeanwhile Jews supporting Palestine get arrested.",
                    "score": 128,
                    "replies": [
                        {
                            "author": "angrymamabearr",
                            "body": "Many people don’t care about reality, reasoning or the lives of the innocent. Only clicks,engagement, power and money.\n\nKeep fighting for truth and justice is all we can do.",
                            "score": 14,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Cube_",
                    "body": "well YouTube has yet to do anything about this or his live doxxing of private citizens so why would he stop digging",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "hollyw00d8604",
            "body": "absolute trash person being absolute trash, shocking",
            "score": 162,
            "replies": [
                {
                    "author": "Unlucky_Internal9686",
                    "body": "why the fuck are they \"famous\" in the first place",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "RockyMountainSchrute",
            "body": "There was a couple seconds of Ludwig in that video. Please tell me Ludwig is still one of the good ones, I thought he was a good one? I’ve only seen his YouTube videos they are fun",
            "score": 14,
            "replies": [
                {
                    "author": "inexusabletomato",
                    "body": "He is don’t worry! He’s friends with Hasan Piker and in his videos is usually talking about just being a decent person to others (obvious things like not being racist, transphobic, homophobic etc)",
                    "score": 20,
                    "replies": []
                }
            ]
        },
        {
            "author": "86248Diamond",
            "body": "It's so much worse because he knows he's changing his audience to people like that and its a direct signal to that new audience. Gross.\nWhy youtube allows him on the platform is beyond me. Children could see that...",
            "score": 57,
            "replies": [
                {
                    "author": "Suggestion2592",
                    "body": "youtube is owned by google. google is up trumps 🍑 they donated 1 million to elmo like…. ",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "sksksi",
            "body": "I understand he will say he is joking, but in the current political climate this is irresponsible and needs to stop. Like it's never okay to do this salute, but with how things are in the world, I can't believe anyone is doing this as a joke and not catching a ban. Even Twitch is banning people for joke salutes. YouTube really needs to step in at this point. Ofc Ethan will blame Hasan, leftists, pro-palestines and Reddit over taking personal accountability and changes. But this bitter hateful era of his needs to be stopped, or he just needs to go to Kick and embrace the roaches that invaded his community.",
            "score": 28,
            "replies": [
                {
                    "author": "dogecoin_pleasures",
                    "body": "Yep, all joking about it does is normalise it, as if it's edgy and funny and not a symbol of violence. I guess we really can't expect any OG YouTuber to understand that edginess is not the peak of comedy...!",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "Audra-",
                    "body": "**YouTube does not care and will not do anything** because Ethan makes them enough money to be immune from TOS.\n\nSniperwolf straight up doxxed another large creator and showed their actual house to tens of millions of people, and YouTube only banned her for a week or two, and only after massive amounts of backlash for *not* banning her in the first place.\n\nYouTube is totally cool with fascism as long as they make a bigger profit. ",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Uplanapepsihole",
            "body": "He’s really aggressive when he gets irritated.  I know he makes it part of his “humour” or whatever but weird.",
            "score": 11,
            "replies": []
        },
        {
            "author": "nahfella",
            "body": "The Irish are the most pro Palestinian people, the irony of them celebrating st Patrick’s day lol",
            "score": 9,
            "replies": []
        },
        {
            "author": "cheetodustcrust",
            "body": "Seeing this post after reading about another 200+ Gazans senselessly, needlessly killed, and yet the hill Ethan wants to die on is not actually about ending the war, but it's for his personal obsessive beef over one creator, his petty need to Seig Heil, and the tiny dopamine bursts he gets when he attacks pro-Palestenian people while actively deflecting from the true horrors at hand...it's truly sickening.  The day he stops earning money for this shit is 1000 days too late.",
            "score": 55,
            "replies": []
        },
        {
            "author": "Freenore",
            "body": "Zionists often show that they don't really realise what Holocaust was about. They think of it as akin to a blank cheque Hitler wrote that justifies anything they do afterwards. This Nazi salute humour comes from exactly that lack of awareness of Nazism. He can engage in such humour because he fundamentally doesn't find Nazism and Holocaust worthy to be serious about.",
            "score": 39,
            "replies": [
                {
                    "author": "cheetodustcrust",
                    "body": "Kinda crazy that he met his wife at a Holocaust museum and yet doesn't seem to fundamentally understand how harmful he is being.",
                    "score": 23,
                    "replies": []
                }
            ]
        },
        {
            "author": "nochimpanzeenodo",
            "body": "I’m beyond tired of creators trying to pass off forced “edginess” as personality. It’s not clever, it’s not refreshing—it’s just desperation in disguise. At this point, it’s a worn-out gimmick used by those who can’t hold attention any other way. Their entire existence hinges on hijacking our focus because, deep down, they know that without an audience to entertain, they have nothing else to fall back on. No real skills, no substance—just a relentless need to be watched.",
            "score": 18,
            "replies": []
        },
        {
            "author": "FiannaNevra",
            "body": "Ugh while dresses up for Ireland day! Don't be doing Nazi shit while dressed up to celebrate my country! We will always stand with Palestine 🇮🇪🇵🇸 us Irish don't claim him!",
            "score": 17,
            "replies": []
        },
        {
            "author": "mv35-020225-1250",
            "body": "Ethan needs to get off the internet, his mental health looks like it gets worse every month that passes. Was a huge H3 fan, fan of the first podcast episodes, but when Frenemies started to end, I don’t see the same Ethan anymore. He’s gotten so out of control",
            "score": 32,
            "replies": []
        },
        {
            "author": "Jon-Slow",
            "body": "the woman next to him, Hila Klein is an ex IDF soldier who raided homes in the City of Ramallah against international law. She is a war criminal and a clear terrorist who boasted about raiding Palestinian homes because she was bored.\n\nThey are Zionists. Zionists and Nazis are ideologically aligned. There are videos of both of these racist shitbags doing black face and calling it \"the black challenge\". The video is still up on terrorist Hila Klein's YouTube channel.  There is a 10 minute long compilation of them just yelling the Nword over and over on camera.\n\nThese two need to answer for their actual crimes. Specially that terrorist woman, who admitted to being a terrorist on camera.",
            "score": 10,
            "replies": []
        },
        {
            "author": "Icy_Party954",
            "body": "He needs to just hang it up. Apples and oranges, but he reminds me of kanye a bit at this point just complely lost the plot and all over the place. But could easily just step away and improve his life. I've heard it speculated Israel pays him. Which I kind of doubt but regardless he isn't doing them any favors",
            "score": 14,
            "replies": []
        },
        {
            "author": "downgoesbatman",
            "body": "How backwards is this? Dude is doing a HITLER SALUTE to others who he deemed OFFENDING HIS JEWISH BELIEF.  The mental gymnastics here bravo",
            "score": 22,
            "replies": []
        },
        {
            "author": "captainlardnicus",
            "body": "He is not well.",
            "score": 25,
            "replies": []
        },
        {
            "author": "Material-Custard2941",
            "body": "The salute aside, I haven’t seen video of him in many months. He looks like shit and completely unhinged.",
            "score": 24,
            "replies": []
        },
        {
            "author": "MrAlexman3G",
            "body": "I keep forgetting who this man is ...and don't remind me, I do know but I wish I didn't",
            "score": 13,
            "replies": []
        },
        {
            "author": "No_Leather_4319",
            "body": "Wtf",
            "score": 17,
            "replies": []
        },
        {
            "author": "Imanoldtaco",
            "body": "Didn't he make a shirt about how much he hates elon musk?",
            "score": 15,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "KittyKenollie",
            "body": "Everything I’ve ever seen about this man has been against my will.",
            "score": 25,
            "replies": []
        },
        {
            "author": "PPPHHHOOOUUUNNN",
            "body": "Who is this loser looking loser? 😂",
            "score": 13,
            "replies": [
                {
                    "author": "AmphoePai",
                    "body": "What a blessing it is not knowing who that is. He's a nobody, let's keep it that way.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Designer_Valuable_18",
            "body": "Yeah, he's a nazi. Straight up. \n\nPeople will claim that he can't be one because he's jew. To these people I will ask to open a history book once in their life.",
            "score": 10,
            "replies": [
                {
                    "author": "IH8Neolibs",
                    "body": "Literally \"The Haavara Agreement\".",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "ParticularUpper6901",
            "body": "they could give up the internet and live life super discreet since they are super rich \n\ndont know why they continue to be toxic exposed",
            "score": 5,
            "replies": []
        },
        {
            "author": "No-Raspberry7840",
            "body": "wtf is with all the plastic paddy decorations. I didn’t know this guy existed a few months, but everything I have seen appears like a scream for help.",
            "score": 22,
            "replies": [
                {
                    "author": "Emucks",
                    "body": "He does this stream every St Paddy’s where he just gets drunk. CLEARLY a great idea, as highlighted by this video…",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Lorn_Muunk",
                    "body": "Trash people accumulate a lot of trash in and around themselves. The windowdressing is meant to distract from the giant black hole in their self where empathy, humility and capacity for self-growth should be.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "DickCheeseCraftsman",
            "body": "I must confess, it’s quite entertaining watching this human turd accelerate his own circling the drainpipe",
            "score": 12,
            "replies": []
        },
        {
            "author": "Dogu_Star99",
            "body": "Please stop picking on Ethan. He is obviously hangry and suffering from irony deficiency disease. It's an epidemic in Israeli society.",
            "score": 12,
            "replies": []
        },
        {
            "author": "skinaked_always",
            "body": "Who is Ethan Klein?",
            "score": 8,
            "replies": []
        },
        {
            "author": "signofthetimez",
            "body": "Who knew he could look even worse, it’s impressive!",
            "score": 7,
            "replies": []
        },
        {
            "author": "FuzzBun25",
            "body": "At a time of rising fascism it’s so incredibly irresponsible to even joke like this, let alone to millions of (primarily young) people on his platform",
            "score": 8,
            "replies": []
        },
        {
            "author": "PorcelainHorses",
            "body": "he looks genuinely unwell",
            "score": 8,
            "replies": []
        },
        {
            "author": "vryvryberry",
            "body": "I used to be a huge h3 fan but the way his fanbase are like genuinely nasty asf, I'm so glad I stopped watching that POS also being pro Palestine doesn't make you antisemitic 🫠 he really is on a decade long toddler tantrum",
            "score": 4,
            "replies": []
        },
        {
            "author": "SatisfactionRude6501",
            "body": "Don't worry guys, Hasan made him do this.",
            "score": 5,
            "replies": []
        },
        {
            "author": "MeGustaMiSFW",
            "body": "As a former fan of theirs, it’s lowkey embarrassing that they’re still trying to seem like a “fun” podcast with the festive decorations. Like nah you guys are a full-blown, crash out rage pod, embrace it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "loki_dd",
            "body": "If you watch or interact with these fuckwits then you're also to blame",
            "score": 5,
            "replies": []
        },
        {
            "author": "Jolly-Introduction36",
            "body": "Fuck this prick, how can he be Jewish and do this shit, utterly disrespectful",
            "score": 5,
            "replies": []
        },
        {
            "author": "JohnBrine",
            "body": "Honest question what brain dead morons watch this shit?",
            "score": 5,
            "replies": []
        },
        {
            "author": "Competitive_Law_7195",
            "body": "h3 is straight up garbage now. ethan literally has negative iq now",
            "score": 3,
            "replies": []
        },
        {
            "author": "fluffyKomodoDragon",
            "body": "So it's comedy to do a sieg heil now?",
            "score": 5,
            "replies": []
        },
        {
            "author": "Due_Net_7118",
            "body": "anyways, all the love and support to Palestine 🇵🇸",
            "score": 5,
            "replies": []
        },
        {
            "author": "Sleepingguitarman",
            "body": "Why does anyone still watch this loser?",
            "score": 3,
            "replies": []
        },
        {
            "author": "Shrimp_Logic",
            "body": "You do you Ethan, but don't cry when you'll have to face the consequences. You know what you are doing.",
            "score": 4,
            "replies": []
        },
        {
            "author": "OPTIPRIMART",
            "body": "I remember when he was the one calling out assholes, narcissists and people who took themselves too seriously. \n\nLook at the absolute state of the fuckwit.",
            "score": 7,
            "replies": []
        },
        {
            "author": "negative_space3",
            "body": "Doesn't he currently have a CPS case?",
            "score": 25,
            "replies": []
        },
        {
            "author": "brief_affair",
            "body": "I can't stand Ethan Klein, what a bag of worthless human garbage",
            "score": 13,
            "replies": []
        },
        {
            "author": "OldGarbageTV",
            "body": "Fuck this guy",
            "score": 10,
            "replies": []
        },
        {
            "author": "ChemicalSummer8849",
            "body": "Who is this weirdo?\n\nPeople really are fearful of their own shadows… they resort to performing nazi salutes because they think its in?\n\nRemember when these 4 years up how alone you will be once again…",
            "score": 3,
            "replies": []
        },
        {
            "author": "FountainXFairfax",
            "body": "Celebrating st Patrick’s day whilst supporting israel is wild",
            "score": 3,
            "replies": []
        },
        {
            "author": "Big-Payment-389",
            "body": "I know very little about this dude, but an ex friend of mine who became a Nazi sympathizer was a big fan of him. I can't say that I'm surprised.",
            "score": 3,
            "replies": []
        },
        {
            "author": "gamerboy_taken_what",
            "body": "So I have always stayed away from this man  he always seemed like a shitty edgelord who would have shitty values and not be an ally to anyone. But a lot of people did not see that and really liked him right? I was surprised to see Captain Dissolution being a fan, I assume he isn't anymore. Is this like Jon tron but way bigger? I know people liked that nazi before he showed his true colors. There really is a strong argument for keeping kids away from these creators, maybe all content creators.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Eastern-Reindeer6838",
            "body": "In a country where you can nazi salute all day long but can't say \"fuck\".",
            "score": 3,
            "replies": []
        },
        {
            "author": "nopizzaonmypineapple",
            "body": "He has always been such a weirdo. Genuinely baffled that he managed to get this successful",
            "score": 3,
            "replies": []
        },
        {
            "author": "aboysmokingintherain",
            "body": "Dude has been driven insane. Wild Trisha Petra’s is the stable one between them",
            "score": 3,
            "replies": []
        },
        {
            "author": "butterwheelfly00",
            "body": "what the hell? what? WHAT? \n\nGenuinely can someone explain the logic here; I thought he was a \"being pro palestine is antisemitic\" type? and now he's pro-nazi? how is that not antisemitic?\n\n  \nLike who is this clown? what is going on? I have never heard of him or hehe or whatever until this shit started happening.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Aolflashback",
            "body": "Oh, just another grifter",
            "score": 3,
            "replies": []
        },
        {
            "author": "xBlackFeet",
            "body": "Bill burr made him cry",
            "score": 3,
            "replies": []
        },
        {
            "author": "InterneticMdA",
            "body": "The call was coming from inside the house.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Guilty-Loss6476",
            "body": "Isn't he pro isreal? I bet he would criticize a Jewish person that supports Palestinian liberation if they did this. I guess if you are pro isreal then you can Nazi salute as much as you want and it's ok.",
            "score": 3,
            "replies": []
        },
        {
            "author": "euqistym",
            "body": "1. Who the fuck is this guy. 2. Who the fuck watches this shit?",
            "score": 3,
            "replies": []
        },
        {
            "author": "trendingtattler",
            "body": "This post has hit r/all or r/popular and thus may not be as strictly moderated as most posts on this subreddit. Please keep this in mind when browsing the comments — and **especially when viewing upvotes/downvotes** — and please report any rulebreaking comments that you see.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fauxmoi) if you have any questions or concerns.*",
            "score": 3,
            "replies": []
        },
        {
            "author": "Logical_Bite3221",
            "body": "What a piece of shit",
            "score": 3,
            "replies": []
        },
        {
            "author": "Busy_Philosopher1392",
            "body": "proof that cancel culture is a myth",
            "score": 3,
            "replies": []
        },
        {
            "author": "ExcellentMedicine",
            "body": "Full blown nazi salutes. \n\nI mean this literally... *how* does Ethan still have followers? \n\nHow is he still on YouTube period. Isn't this hate speech?",
            "score": 3,
            "replies": []
        },
        {
            "author": "Retired19Kilo",
            "body": "His parents must be proud",
            "score": 3,
            "replies": []
        },
        {
            "author": "Pistonenvy2",
            "body": "WHAT IS THE JOKE?! \n\n  \nWHY IS DOING THIS FUNNY? GENUINELY. PLEASE EXPLAIN.",
            "score": 3,
            "replies": []
        },
        {
            "author": "dive_owen",
            "body": "Ethan is a bitch.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Darkavenger_13",
            "body": "So wild to see this pathetic downfall. Urgh where they always pos but good at hiding it or did the internet cancer hit them too hard? \n\nThe time they where viewed in a positive light is shorter than the time they’ve been viewed negative!",
            "score": 3,
            "replies": []
        },
        {
            "author": "ChocoMog03",
            "body": "Stop making stupid people famous or stop giving these guys platforms",
            "score": 3,
            "replies": []
        },
        {
            "author": "marion85",
            "body": "Well, he's married to an Israeli woman and, as such, can't be racist or anti-Semitic.\n\nJust calling people Nazis because they publicly do a Nazi salute, or call for the deportation of their political opponents, or an ethnic cleansing is why the Left keeps losing people...\nDuh.\n\n/S because their are plenty of people stupid enough to believe the insaniy I just wrote is a valid defense of Ethan Klein.",
            "score": 3,
            "replies": []
        },
        {
            "author": "MiddleInfluence5981",
            "body": "What a douchy asshole. Fuck Off Nazi.",
            "score": 3,
            "replies": []
        },
        {
            "author": "linkedarmsforpeace",
            "body": "Wow, it was almost a decade ago my roommates and future husband and I would laugh at their silly h3h3 videos. Money really changes people.",
            "score": 3,
            "replies": []
        },
        {
            "author": "excellent-throat2269",
            "body": "I’m not sure who this person and I haven’t even joined this sub. But I keep seeing this person pop up and they look very unwell.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Competitive_Bath_511",
            "body": "What an absolute piece of shit, our ancestors would be ashamed",
            "score": 3,
            "replies": []
        },
        {
            "author": "Scarlet_Addict",
            "body": "remember like 10 years ago when he was sane?",
            "score": 3,
            "replies": []
        },
        {
            "author": "TehRiddles",
            "body": "Okay, at first I thought you were lying because that was clearly a dab. But then he did it again saying \"my heart goes out to you\", which of course is the same excuse Elon did when he did the salute. And we know he's lying because he did the heart gesture properly in the past.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Appropriate-Soup-188",
            "body": "JEWS 👏 WERE 👏 NOT 👏 THE 👏 ONLY 👏 VICTIM 👏 OF 👏 THE 👏NAZIS.  That's why you can't \"reclaim\" the sieg heil   because black and brown people were inferior poles were inferior , Romani , queer, handicapped.  This  is essentially a black man walking around saying white power  it's not reclamation is dilution at best and Nazism at worst",
            "score": 3,
            "replies": []
        },
        {
            "author": "wheeler9691",
            "body": "An actual, real life loser who got really lucky with youtube.  His content a decade ago was just punching down at anything and everything.",
            "score": 3,
            "replies": []
        },
        {
            "author": "DeadOrcSociety",
            "body": "He’s such a lowlife piece of shit.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Upbeat_Praline_3681",
            "body": "Kleins always seemed a hacky weasel, kinda pathetic the fall he’s taken this last year n a half. Genocide apologists are gross",
            "score": 3,
            "replies": []
        },
        {
            "author": "Audra-",
            "body": "1. Ethan Klein seems like one of the most miserable people alive, just constantly full of overwhelming feelings of angst, hatred, & victimhood. \n\n2. YouTube is an utterly immoral, unethical social media company that allows Ethan (& other big creators) to do whatever they want, regardless of TOS violations, up to & including illegal acts such as doxxing. Remember when sniperwolf doxxed Jacksfilms because he was criticizing her, and even though doxxing is illegal in California YouTube didn’t even ban her until subjected to massive backlash, & then only banned her for a week or two? **Social media companies will happily help fascism progress as long as it means higher profits for them.**",
            "score": 3,
            "replies": []
        },
        {
            "author": "sixtedly",
            "body": "doing that horrible gesture and claiming antisemitism… the mental gymnastics are astounding",
            "score": 3,
            "replies": []
        },
        {
            "author": "AnyEar1056",
            "body": "The crash out is real.",
            "score": 3,
            "replies": []
        },
        {
            "author": "S0LR4C",
            "body": "Fuck him and his podcast. He's been insufferable for years now.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Low-Independence9411",
            "body": "The dudes a fuckin loser lol",
            "score": 3,
            "replies": [
                {
                    "author": "Low-Independence9411",
                    "body": "Always has been too",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "SubstantialBasket709",
            "body": "We have come to the point when doing the nazi salute is nothing out of the norm, disgusting.",
            "score": 4,
            "replies": []
        },
        {
            "author": "TigerFisher_",
            "body": "\"Comedy\"",
            "score": 7,
            "replies": []
        },
        {
            "author": "Invaderjay87",
            "body": "This mf actually said he shouldn’t be held accountable for his actions because he’s a comedian, then when Hasan called him a failed comedian he said, “I never claimed I was a comedian.” Dude fell off so hard and all because he couldn’t admit that what Israel is doing is too far.",
            "score": 7,
            "replies": []
        },
        {
            "author": "napalmnacey",
            "body": "What the actual fuck is wrong with this douchebag?",
            "score": 8,
            "replies": [
                {
                    "author": "Broad_Yogurt_6111",
                    "body": "I think it's a joke no?",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Kooky_Bodybuilder_97",
            "body": "beloved youtuber to nazi pipeline strikes again",
            "score": 6,
            "replies": []
        },
        {
            "author": "nilsinleneed",
            "body": "\"comedian\"",
            "score": 5,
            "replies": []
        },
        {
            "author": "redditerla",
            "body": "I don’t know who this Ethan Klein guy is but what a pos",
            "score": 2,
            "replies": []
        },
        {
            "author": "Lucky_Valuable_7973",
            "body": "These people are disgusting",
            "score": 2,
            "replies": []
        },
        {
            "author": "zoetwilight20",
            "body": "I had bad vibes about this guy years ago, I could never understand why he and his podcast was so popular.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Awkward-Exercise1069",
            "body": "I don’t know who this guy is, but anyone throwing a Nazi salute should be immediately deplatformed, and I am surprised why this is even a debate",
            "score": 2,
            "replies": []
        },
        {
            "author": "Electrical_Soft3468",
            "body": "Ethan no, come on dude",
            "score": 2,
            "replies": []
        },
        {
            "author": "Quirky_Produce_5541",
            "body": "Something is deeply wrong with Ethan and Hila, as a former fan i find it very pitiful",
            "score": 2,
            "replies": []
        },
        {
            "author": "nemerosanike",
            "body": "Hey Ethan, your followers call me horrible slurs for Jewish people because I support Palestinians. Holy shit, hope your followers stop sending Reddit cares BS and yall learn what we’ve been finally talking about for years!",
            "score": 2,
            "replies": []
        },
        {
            "author": "mannyd16",
            "body": "Dude was an early promoter of Peterson, no surprise ",
            "score": 2,
            "replies": []
        },
        {
            "author": "_Hamburger_Helpme",
            "body": "It's always the ones you most expect.",
            "score": 2,
            "replies": []
        },
        {
            "author": "mittens617",
            "body": "this man is not famous enough that I have to hear his name this many times",
            "score": 2,
            "replies": []
        },
        {
            "author": "Macrov28",
            "body": "Its insane how quickly he fell off in my eyes. \n\nI loved his old reaction stuff, but once he started with the podcasts and he wasn't just a short video it was really evident how annoying and horrible he is. The more he is on air the easier it is to see how garbage he is.",
            "score": 2,
            "replies": []
        },
        {
            "author": "GumGumnoPistolReturn",
            "body": "The irony",
            "score": 2,
            "replies": []
        },
        {
            "author": "TrollBurnerAccount1",
            "body": "Dang what happened to this guy? Him and his wife would guest on a podcast I listen to frequently and always seemed nice.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Nikolai_1120",
            "body": "Man I'm used to really like this guy in the 2010's, what the fuck happened",
            "score": 2,
            "replies": []
        },
        {
            "author": "Kyuso__K",
            "body": "He used to.do genuinely funny skits making fun of trends and YouTube videos, but slowly devolved into clickbait and drama machine pseudo intellectual podcaster",
            "score": 2,
            "replies": []
        },
        {
            "author": "groolfoo",
            "body": "Stop supporting this fucking piece of shit",
            "score": 2,
            "replies": []
        },
        {
            "author": "Greedy_Honey_1829",
            "body": "This guy has gotten unbelievably hateful it’s crazy",
            "score": 2,
            "replies": []
        },
        {
            "author": "SeeBadd",
            "body": "Ethan has always been a hypocritical troll his targets used to just be more acceptable to the audience. He's a lot like Ben Shapiro in that way he doesn't care if people are actually Jewish, he'll throw them under the bus if they disagree with his anti-Arabic racist crap.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ruenin",
            "body": "To think I used to like this guy. I mean, it was years ago when he was a lot heavier and focused on being funny instead of whatever the hell this is.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Grizzly_Corey",
            "body": "![gif](giphy|lcjWzvc9po5Og6eV4V|downsized)\n\nIgnore this nerd, ya'll",
            "score": 2,
            "replies": []
        },
        {
            "author": "Alarming_Bee_4416",
            "body": "Downside of the bell curve. Never funny now descends into madness.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Outside_Juice_166",
            "body": "Nazi scum… they’ll lose again",
            "score": 2,
            "replies": []
        },
        {
            "author": "SPZ_Ireland",
            "body": "He did it on a St Patrick's Day stream because Ireland is Pro-Palestine and I won't be convinced otherwise",
            "score": 2,
            "replies": []
        },
        {
            "author": "Magikarp23169",
            "body": "Damn, I used to really like his content and he was one of the creators that got me leaning more progressive. To see him do this now is like watching a wild animal that you've bonded with and it comes back one day with rabies",
            "score": 2,
            "replies": []
        },
        {
            "author": "DaSovietRussian",
            "body": "How the mighty have fallen. This guy is disgraceful. Wife used to watch him for years. Moment he started doing this shit she threw all their shit out. At least people finally are realizing that he's not a good person.",
            "score": 2,
            "replies": []
        },
        {
            "author": "GirlWithBonesaw",
            "body": "[\"Stand back and stand by\"](https://apnews.com/article/election-2020-joe-biden-race-and-ethnicity-donald-trump-chris-wallace-0b32339da25fbc9e8b7c7c7066a1db0f) is also what Donald Trump said to the Proud Boys in 2020.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Giam_Cordon",
            "body": "He's stupid enough to believe he's doing it “ironically.” Nazi pos",
            "score": 2,
            "replies": []
        },
        {
            "author": "tankhwarrior",
            "body": "Dude think he's actually \"winning\" too. Dude, you're radioactive af now bro. No one except the right-wing grifters want anything to do with you(and they will probably bail too once this Hasan stuff ends)",
            "score": 2,
            "replies": []
        },
        {
            "author": "Nightowl21021",
            "body": "Good grief he needs to just quit and seek counseling what happened to him? I used to watch his older videos",
            "score": 2,
            "replies": []
        },
        {
            "author": "AztecGodofFire",
            "body": "Who?",
            "score": 2,
            "replies": []
        },
        {
            "author": "AccomplishedCat8083",
            "body": "Who is that?",
            "score": 2,
            "replies": []
        },
        {
            "author": "RobsyGt",
            "body": "Am I right in thinking it's only kids that watch this guy as I can't see what's entertaining?",
            "score": 2,
            "replies": []
        },
        {
            "author": "IZeppelinI",
            "body": "Who?",
            "score": 2,
            "replies": []
        },
        {
            "author": "demolitionmaletf2",
            "body": "Who even is ethan klein",
            "score": 2,
            "replies": []
        },
        {
            "author": "Armation",
            "body": "He's such a disgusting weasel ",
            "score": 2,
            "replies": []
        },
        {
            "author": "KingKongoguy",
            "body": "Bro has not been the same ever since he stopped being funny.",
            "score": 2,
            "replies": []
        },
        {
            "author": "nage_",
            "body": "remember when he would just eat pizza and talk about metamucil?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Responsible_Let6674",
            "body": "I see these idiots, and I just have to question who are the absolute dipshits that watch them and make them rich and internet 'famous'?\n\nThese people are not experts in anything, they don't have real jobs, they 'make content' and target dumb kids, who are impressed by the quasi intellectual bs they spew.\n\nIf these streamers stopped streaming, now, the world would immediately be a better place.",
            "score": 2,
            "replies": []
        },
        {
            "author": "minev1128",
            "body": "Oh wow he has lost it",
            "score": 2,
            "replies": []
        },
        {
            "author": "mazdiggle",
            "body": "He is a troll, has always been a troll .... and has the same level of societal relevance as any random D level podcaster, ie no one outside of his tiny bubble cares.",
            "score": 2,
            "replies": []
        },
        {
            "author": "tornado962",
            "body": "We're a long ways away from the Gamer Gunk and fupa days. What happened to this fool?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Natural-Biscotti9465",
            "body": "These people are so ugly in and out",
            "score": 2,
            "replies": []
        },
        {
            "author": "dngrspersin",
            "body": "I got a neighborhood for him to come visit.",
            "score": 2,
            "replies": []
        },
        {
            "author": "kittyypawzz",
            "body": "He really loves to “jokingly” make a gesture that was accepted by people who thought genociding Jews was a good idea, while stating he is going after antisemitism…",
            "score": 2,
            "replies": []
        },
        {
            "author": "Psychological-Dig598",
            "body": "On the same stream, the hosts wife questions why people are so upset at Elon musk they are burning teslas… \n\nThese are the true champions of antisemitism.",
            "score": 2,
            "replies": []
        },
        {
            "author": "netherwxrldsyndicate",
            "body": "They realise we Irish despise anyone who identifies as, or with, oppressors right? Fucking piece of shit.\n\nFuck israel.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Ooooof_sis",
            "body": "It pains me seeing him cover himself in green shamrocks and leprechaun hats and showing so much hate….the Irish are HUGE supporters of Palestine and forever will be.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Limp_Evidence9667",
            "body": "Stop giving this attention seeker the time of day, he causes chaos then plays the victim when he is called out and shifts the blame onto someone else. Trash behavior at his grown ass age. Be a father your children can look up to.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Straight-Ad6926",
            "body": "I’m sure it’s just a coincidence that his jokes keep aligning with hate group ideologies….",
            "score": 5,
            "replies": []
        },
        {
            "author": "bratgirlsummer",
            "body": "It surprises me that he still hasn't been canceled yet.",
            "score": 2,
            "replies": []
        },
        {
            "author": "dumbaldoor",
            "body": "It's ironic they are celebrating St Patrick's day when Ireland is fully supporting Palestine",
            "score": 3,
            "replies": []
        },
        {
            "author": "Exotic_Instance421",
            "body": "They need to get those Irish decorations down and off of them. If they were in Dublin yesterday they would have seen actual Irish people displaying Palestinian badges, scarves, and flags. Ireland is staunchly anti-Zionist. How ridiculous of them to celebrate St Patrick’s Day.",
            "score": 3,
            "replies": []
        },
        {
            "author": "OPTIPRIMART",
            "body": "I cannot believe I ever liked this guy. He's such a piece of shit. He's become the very thing he once mocked. \n\nI was watching him back in the days of Ethan Bradbury and Joe Salads. \n\nHe's turned into Joey Salads!",
            "score": 4,
            "replies": []
        },
        {
            "author": "Effective_Target_578",
            "body": "This guy has gone off the deep end",
            "score": 4,
            "replies": []
        },
        {
            "author": "masterdebaten",
            "body": "I find it odd that no one in the more right wing mainstream creator sphere is calling him out on this.\n\nIt really does feel like as long as you’re pro Israel you can literally do and say whatever you want.",
            "score": 7,
            "replies": [
                {
                    "author": "Juno_no_no_no",
                    "body": "That’s because that’s exactly the case, the right also dont give a shit if you throw Nazi salutes and behave like this because they either don’t care or behave in similar ways.\n\nI’m not really sure how you can be surprised by this or find it odd that the right hasn’t said a thing about this, but especially with the state of the US right now (and for decades and decades prior)",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "Rogan4Life",
            "body": "What? A Zionist is a horrible human being? Shocking!",
            "score": 3,
            "replies": []
        },
        {
            "author": "AfternoonChoice6405",
            "body": "What. The. F",
            "score": 3,
            "replies": []
        },
        {
            "author": "HopefulLobster8273",
            "body": "It is SO crazy to me that Trisha walked out of that friendship as the less problematic one",
            "score": 2,
            "replies": []
        },
        {
            "author": "SummerArcadeNight",
            "body": "Wtf happened to him...this is insane",
            "score": 4,
            "replies": [
                {
                    "author": "Jon-Slow",
                    "body": "he was always a right wing Zionist and Nazi aligned dirtbag. His wife is a literal IOF terrorist that was assigned to him in his \"birthright\" trip. look it up",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "bearbear0723",
            "body": "Ethan doing this for clout. What a sad sack of shit",
            "score": 3,
            "replies": []
        },
        {
            "author": "giovetta",
            "body": "Am I wrong, or was the story of their meeting literally not at a trip to Auschwitz?! Or wasn't that trip specifically somehow very important to the development of their relationship? Like what. the. fuck.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Dog-Poop-Oop",
            "body": "He acts exactly like Tim from On Cinema at The Cinema. They are pretty much the same person now.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Psychological-Cat1",
            "body": "i love that i am an adult with friends so i don't have to know anything about steamers other than when i see this shit on the popular feed",
            "score": 2,
            "replies": []
        },
        {
            "author": "Dwashelle",
            "body": "Ew I'm from Ireland and I hate how he's doing this while celebrating Paddy's Day",
            "score": 2,
            "replies": []
        },
        {
            "author": "ABCDEFandG",
            "body": "Speedrunning to the White House",
            "score": 2,
            "replies": []
        },
        {
            "author": "youtakethehighroad",
            "body": "Disgusting actions on both fronts. Horrible that people feel so emboldened.",
            "score": 2,
            "replies": []
        },
        {
            "author": "glamazon_69",
            "body": "Glad idk who this person is",
            "score": 1,
            "replies": []
        },
        {
            "author": "wi11epi11e",
            "body": "Youtube and Twitch should be banned",
            "score": 2,
            "replies": []
        },
        {
            "author": "ArieVeddetschi",
            "body": "Oh, so it IS a Nazi salute then? Gotcha.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ok_Possible8770",
            "body": "He's unhinged. How anyone can question that is beyond me at this point",
            "score": 2,
            "replies": []
        },
        {
            "author": "hmmisuckateverything",
            "body": "Ethan doesn’t care about antisemitism. It’s all about how HE feels. God I hate him",
            "score": 3,
            "replies": []
        },
        {
            "author": "ErikasPrisonGlam",
            "body": "Zionists hate Palestinians more than they do Nazis. Racism is a helluva drug",
            "score": 2,
            "replies": []
        },
        {
            "author": "stprnn",
            "body": "What a monumental loser holy shit. \n\nMarrying a terrorist wasn't enough hes going for the \"biggest loser on the planet\" award",
            "score": 2,
            "replies": []
        },
        {
            "author": "kakarot-3",
            "body": "It’s projection. It’s always projection with these weirdos. Every conservative, right wing, MAGA nut is a real antisemitic who projects it onto others. \n\nEvery synagogue that gets attacked in America is by a right wing nut job. MTG once said California fires were caused by Jewish space lasers. The right is pro-Israel and antisemitic at the same time. It’s literal insanity.",
            "score": 3,
            "replies": [
                {
                    "author": "IH8Neolibs",
                    "body": "They only want Israel to exist to simply bring about Armageddon",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "SolangeXanadu222",
            "body": "So he’s a Zionist Nazi?",
            "score": 2,
            "replies": [
                {
                    "author": "floodingurtimeline",
                    "body": "Yes",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fluid_Cat2269",
            "body": "Used to watch his early videos when he didn’t have much $. Guess this guy sold out big time and lost all his morals and dignity along the way.",
            "score": 3,
            "replies": []
        },
        {
            "author": "SamifromLegoland",
            "body": "What a pathetic POS. He lost the plot.",
            "score": 2,
            "replies": []
        },
        {
            "author": "DeathsDefiance",
            "body": "Dudes crashing out so hard hahaha",
            "score": 2,
            "replies": []
        },
        {
            "author": "GrandMasterF1ash",
            "body": "Crazy how off the rails he’s gone in less than a year",
            "score": 2,
            "replies": []
        },
        {
            "author": "Bots_R_Us",
            "body": "0% surprised, this is the logical devolution. Sad.",
            "score": 2,
            "replies": []
        },
        {
            "author": "HighForLife95",
            "body": "Lmao threatening, attacking and calling everyone out for anti semitism, claiming to be a victim of anti semitism yourself, and now doing a nazi salute. People are fucked in the head I swear",
            "score": 2,
            "replies": []
        },
        {
            "author": "SamwiseTheOK",
            "body": "WTF is happening to this man :D I can't believe I used to be a fan",
            "score": 2,
            "replies": [
                {
                    "author": "SamwiseTheOK",
                    "body": "damn that was accidentally poetic",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Small_Ad_2905",
            "body": "I’m glad everyone outside his circle can see how insane he is",
            "score": 2,
            "replies": []
        },
        {
            "author": "Mara_White",
            "body": "So I don't know who this is but I keep seeing his name afloat. Is he not Jewish?",
            "score": 1,
            "replies": []
        },
        {
            "author": "SevroAuShitTalker",
            "body": "Who is this and why do people care about what he has to say?",
            "score": 1,
            "replies": []
        },
        {
            "author": "kitty-chef",
            "body": "I don’t get it isn’t his wife Jewish?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Expert_Ambassador_66",
            "body": "Is the implication that the person he's attacking isn't antisemitic and pro violence? I need some clarification please.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DevilinFendiGlasses",
            "body": "There really is two internets cus I’ve never heard of this man and the only post/videos I’ve seen of him are from here. 💀",
            "score": 1,
            "replies": []
        },
        {
            "author": "ChundoIII",
            "body": "Who?",
            "score": 1,
            "replies": []
        },
        {
            "author": "theLuminescentlion",
            "body": "no audio but what is the one clip of Ludwig supposed to be?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Substitute47",
            "body": "Who?",
            "score": 1,
            "replies": []
        },
        {
            "author": "DangMe2Heck",
            "body": "I've fallen off h3 the past couple of years. But is he being a shit about the salute? Like obviously this Jewish man isnt throwing the Hitler salute in solidarity.\n\nHas he gone in too deep and losing his mind? Sure but this post is framing him as a sympathizer for nazis.\n\nHowever I'm so out of the loop idk.\n\nBasically, yeah I think he is losing it but no he is not a nazi.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Curious_Cause065",
            "body": "who else has no clue who this guy is ?",
            "score": 1,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "**This post is currently restricted so that only approved members can comment or post. Please note that your comment may be approved if the moderators feel it adds to the discussion.** \n\n___\n\nTo be added as an approved member, please message the mods via modmail by clicking [here](https://www.reddit.com/message/compose?to=/r/Fauxmoi). We are currently only approving users who have a recent comment history on this sub and do not have a history of rule violations.\n\n\n___\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fauxmoi) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wonton_soup_1989",
            "body": "![gif](giphy|LD4R8B2uihbBdhcQQl)",
            "score": 1,
            "replies": []
        },
        {
            "author": "YouDumbZombie",
            "body": "This guy is such an annoying pustule and nothing more.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mathpath123",
            "body": "I fucking hated his guts from day 1. Just something about him never felt right at all.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Grand-Web-1206",
            "body": "and further he falls.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "What a fucking Nazi.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Curiedoesthestream",
            "body": "Yo! It’s the Eastern Front of streamers!",
            "score": 1,
            "replies": []
        },
        {
            "author": "somebishhh",
            "body": "Despicable",
            "score": 1,
            "replies": []
        },
        {
            "author": "Whofreak555",
            "body": "Is it a joke if not a soul laughs?",
            "score": 1,
            "replies": []
        },
        {
            "author": "skinaked_always",
            "body": "I’m assuming he’s a YouTuber or podcast person and it always amazes me who we make famous. We need to do some more research on these people because the amount that have come out to be horrible people is like for every 10 we get 8 horrible people",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jewicer",
            "body": "I wonder if Bunny still does \"Does This Thing Really Work\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sylvia_Platypus",
            "body": "Sorry to be that person, but who is he? I live in Europe and consider myself fairly well-informed, but never heard of the guy before he started popping up on Reddit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "N00bcak3s",
            "body": "He is not. This sub is brigades by willingly obtuse Hasan fans latching on to anything. There was a segment on how Charlie Kirk was defending Elon doing the salute, but couldn’t do it himself. It’s an edgy joke.",
            "score": -5,
            "replies": []
        },
        {
            "author": "6pool4gateBunkeRush",
            "body": "Lol yikes y'all just missed the elon reference my heart goes out to y'all nazi salute",
            "score": 0,
            "replies": []
        },
        {
            "author": "jjamesw1995",
            "body": "I think Ethan’s outta his mind but if you think he’s doing an actual nazi salute I think you’re reaching hard, which doesn’t really do your actual points about him many favours",
            "score": -11,
            "replies": []
        },
        {
            "author": "polski_criminalista",
            "body": "there is a difference between using it seriously and ironically  \n  \nthis sub is obviously too stubborn and biased to acknowledge any nuance though, full blown echo chamber",
            "score": -57,
            "replies": []
        },
        {
            "author": "GreenUnderstanding39",
            "body": "Please break down the irony in doing a Hitler salute. Explain it to me like I'm 5.",
            "score": 45,
            "replies": []
        },
        {
            "author": "Aware-Bodybuilder169",
            "body": "Ethan is jewish.",
            "score": -41,
            "replies": []
        },
        {
            "author": "GreenUnderstanding39",
            "body": "So am I. Still waiting on the irony. Give it to me simple like.",
            "score": 35,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -4,
            "replies": []
        },
        {
            "author": "AlayneKr",
            "body": "Stephen Miller is Jewish, does that mean he can’t be a Nazi? \n\n“I’m making fun of Hitler by throwing sig heils” doesn’t really seem to be much of a joke, guess I’m missing what’s funny about the Nazi salute?",
            "score": 3,
            "replies": []
        },
        {
            "author": "IH8Neolibs",
            "body": "Just like the Haavara Agreement, when Zionists betrayed non-zionists to create Israel with *direct* collaboration with the Nazis.",
            "score": 10,
            "replies": []
        },
        {
            "author": "alone-in-the-town",
            "body": "He's also a Zionist ethnosupremacist piece of shit, context y'know",
            "score": 15,
            "replies": []
        },
        {
            "author": "TecuaNando",
            "body": "Maybe you are in a echo chamber, only in the H3H3 (now we know the meaning of the 2 Hs) subreddit don't accept the meaning of \"Roman Salute\" that everyone else sees and agrees.",
            "score": 19,
            "replies": []
        },
        {
            "author": "N00bcak3s",
            "body": "On fridays show, there was a segment on Charlie Kirk trying to defend Elon. He couldn’t do the salute it was hilarious. So he does it make fun of those idiots and how obvious that it was a Nazi salute. It’s an edgy joke, but that’s the context",
            "score": -6,
            "replies": []
        },
        {
            "author": "Ac55555-",
            "body": "Why is no one understanding he’s poking fun at the people who do this UNIRONICALLY",
            "score": -36,
            "replies": []
        },
        {
            "author": "targaryeh",
            "body": "making fun of people who do the nazi salute by doing the nazi salute? okay 💀",
            "score": 19,
            "replies": []
        },
        {
            "author": "RmView",
            "body": "was there happened before Elon’s situation or after? if after, than he is probably mocking him",
            "score": -14,
            "replies": []
        },
        {
            "author": "avidpretender",
            "body": "Do you.. not understand.. context?",
            "score": -1,
            "replies": []
        },
        {
            "author": "Charming_Middle_3179",
            "body": "Bruh he was drunk asf did anyone watch the stream it’s clearly a joke and also it’s a big thing on his mind. Like come on he’s not maga right wing or crazy",
            "score": -1,
            "replies": []
        },
        {
            "author": "Ctrl_Alt_Boner2",
            "body": "Obviously he’s making fun of that salute. This video’s goal is to not provide context and paint a bad angle.",
            "score": -53,
            "replies": []
        },
        {
            "author": "Stewman_Magoo",
            "body": "Please provide context that makes this appropriate and/or funny then.",
            "score": 11,
            "replies": []
        },
        {
            "author": "Juno_no_no_no",
            "body": "OP replied but, adding to their comment, Ethan has proved he doesn’t give a shit about real antisemitism and has just used it as a means to weaponise it against his perceived enemies. He’s said nothing and even aligned or sided with actual nazis and people who have platforms nazis all because they gave his old friend some shit or threatened his life.",
            "score": 11,
            "replies": []
        },
        {
            "author": "wankah69",
            "body": "Doesn't matter if he's trying to be \"funny\" by doing it. If he wants to go on a 6+ month long tirade harassing others, doxxing others and their families and sending his rabid fanbase to go harass them over what he believes is antisemitism, maybe ... just maybe he shouldn't be doing a nazi salute live on air multiple times. If he really cares about being a serious authority on the topic of antisemitism, it isn't wise to openly be \"funny\" about it by doing a nazi salute. It just invalidates his whole movement and reassures others that they can't take him seriously",
            "score": 32,
            "replies": []
        },
        {
            "author": "N00bcak3s",
            "body": "How does it at all invalidate his position? Are you trying to tell him what he can and cannot laugh at as a Jewish man when antisemitism is clearly on the rise again? He is choosing to make a joke about the Nazi salute, well within his rights as a Jewish man. You are being willfully obtuse. Stop.",
            "score": -16,
            "replies": []
        },
        {
            "author": "AssumptionNo4859",
            "body": "I stopped watching a big group of streamers/youtubers last year because they had ties to Hasanabi, including Ludwig.  I'm really not sure why or how they became friends with him, but it happened.",
            "score": -6,
            "replies": []
        },
        {
            "author": "CheekApprehensive675",
            "body": "Immitating someone doing the nazi salute is not the same as doing a nazi salute",
            "score": -2,
            "replies": []
        },
        {
            "author": "Beneficial_Rip8527",
            "body": "He's Jewish...",
            "score": -2,
            "replies": []
        },
        {
            "author": "Secure-Acanthisitta1",
            "body": "Seems like he is making fun of Elon Musk though. But maybe a bit too far",
            "score": -47,
            "replies": []
        },
        {
            "author": "snowhawk04",
            "body": "You are 3 seig heils late with this defense.",
            "score": 27,
            "replies": []
        },
        {
            "author": "GarySparkle",
            "body": "It's weird how people take sides with something like this.\n\nEthan, Hasan, Denims, Frogan... these are all people engaging in rampant propaganda and drama farming for clicks/clout/cash.\n\nThe idea that there is always a good side & a bad side is the biggest failure of modern society. There can be multiple sides in a scenario and ALL of them can be bad.",
            "score": -5,
            "replies": []
        },
        {
            "author": "Background-Bug-4611",
            "body": "He literally said he was dabbing. This is an insane reach lol are you not familiar with what dabs look like?\n\n![gif](giphy|xUOwGmG2pRfFZUmdVe)",
            "score": -32,
            "replies": []
        },
        {
            "author": "Any_Fix_3534",
            "body": "Yes, then he dabbed. Then he said my heart goes out to you and did the salute yet again. So where is the reach?",
            "score": 19,
            "replies": []
        },
        {
            "author": "N00bcak3s",
            "body": "The reach is that if you watch the show he constantly makes fun of Charlie Kirk and all these right wing pundits trying to defend Elons Nazi salute.",
            "score": -6,
            "replies": []
        },
        {
            "author": "Embarrassed-Parfait7",
            "body": "So… just cancel him",
            "score": -6,
            "replies": []
        },
        {
            "author": "Mrfriskylamar",
            "body": "I don’t know anything about him, but spell his name right",
            "score": -7,
            "replies": []
        },
        {
            "author": "Strange-Deja-Vu",
            "body": "You realize he's being satirical right?",
            "score": -7,
            "replies": []
        },
        {
            "author": "MemeOps",
            "body": "Youre trying to tell me he isnt doing that to make fun of the whole Elon situation? Come off it dude.",
            "score": -7,
            "replies": []
        },
        {
            "author": "Nalrahh",
            "body": "He be clearly making fun of Elon…",
            "score": -8,
            "replies": []
        },
        {
            "author": "ancienthumanbot",
            "body": "Ethan is Jewish so I feel like he has good reason to be joking about something that is probably very upsetting to him. I’d also grant that it might be kinda stupid of him given his large platform and public presence so it can easily be taken out of context",
            "score": -12,
            "replies": []
        },
        {
            "author": "Big-Resolve1645",
            "body": "You people are crazy 😂😂",
            "score": -12,
            "replies": []
        },
        {
            "author": "Love-Laugh-Play",
            "body": "It’s disingenuous to clip Ethan making fun of the fact how stupid people look trying to defend Elons nazi salute, and calling him anti-semitic for it.",
            "score": -12,
            "replies": []
        },
        {
            "author": "justcalmwaters",
            "body": "This sub is fr obsessed with this dude",
            "score": -13,
            "replies": []
        }
    ]
}