{
    "title": "Rachel Zegler Says Ariana Grande 'Reached Out to Me' to Offer Support Ahead of Snow White's Release: 'She Is So Deeply Kind'",
    "author": "cmaia1503",
    "subreddit": "Fauxmoi",
    "rank": 13,
    "score": 586,
    "upvote_ratio": 0.89,
    "num_comments (reported by reddit)": 47,
    "url": "https://people.com/rachel-zegler-ariana-grande-reached-out-ahead-of-snow-white-11698886",
    "id": "1je7lhp",
    "selftext": ">Zegler, 23, told Allure magazine in a cover story published online Tuesday, March 18 that Grande, 31, is among those who have lent their support to her in recent weeks. \"She reached out to me — kind of apropos of nothing — and was like, 'If you need anything, I am here,' \" Zegler said. \"She is so deeply kind. She has gone through so much in the public eye, and I have always really, really admired her courage in the face of all of that.\" \n\n\n\n>In addition to Grande, whose big screen role as Glinda in Wicked put her in the spotlight for the last several months, Zegler also said that The Good Place star Jameela Jamil was \"like a big sister to me\" while she discussed her experiences working in Hollywood and racist fan backlash that erupted after Disney cast a Latina woman to portray the fairy tale's title character.\n\n\n\n>Zegler also said Helen Mirren and Lucy Liu — whom she costarred with in 2023's Shazam! Fury of the Gods — “have been my keepers in all of this, where I feel very held by them.” ",
    "comments": [
        {
            "author": "pureslashhoney",
            "body": "it's good to know that these bigger, more established stars are looking out for and offering support to newcomers who were put in a bad position. giant corporations won't protect these young girls who they use for diversity points and then let them get eaten alive, but at least there are others out there who will. i've heard ariana do this for other girls, and rachel has continuted the cycle by offering her support to girls like leah jeffries and francesca amewudah-rivers. it sucks that they have to do it, but i'm glad they're looking out for each other.\n\n\\*edited to fix name spelling",
            "score": 502,
            "replies": [
                {
                    "author": "meatball77",
                    "body": "Agreed, and with Disney offering 0 support to these girls it's good to hear that others are offering their support.  Evenmoreso with how Rachel basically arrived as a lead actress, she had a career start that's unheard of.  She went from high school to working with Steven Spielberg, being a Disney Princess and starring in a major YA franchise back to back.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Any-Difficulty-1247",
            "body": "damn, Ariana Grande did more to make sure Rachel Zegler was okay than Disney does.",
            "score": 152,
            "replies": []
        },
        {
            "author": "ThatBabyIsCancelled",
            "body": "That’s really nice, tbh \n\nIdk, at least someone did something instead of letting her twist in the wind.",
            "score": 230,
            "replies": [
                {
                    "author": "Mysterious-Coyote442",
                    "body": "I’ve never heard or read that phrase before. It’s good, I’m stealing it.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "BatEducational4247",
            "body": "Ariana took Lillyjay's \"not a girl's girl\" comment to heart lowkey.",
            "score": 352,
            "replies": [
                {
                    "author": "Bbychknwing",
                    "body": "There is so much nuance to Ariana it’s wild. It’s correct that she is historically unfaithful & disrespectful of relationships not limited to her own, but I believe it’s also correct that she’s a kind person. She gives the court of public opinion whiplash.",
                    "score": 666,
                    "replies": [
                        {
                            "author": "Illustrious_Fix2933",
                            "body": "A lot of people have layers. My own mum is a terrible mother but a terrific woman otherwise. Great cook, great scientist, and just a wonderfully kind woman to impoverished kids and people in the lower stratas of society.\n\nIt’s truly comical to realise some people can be so bad at one thing and great at everything else.",
                            "score": 105,
                            "replies": []
                        },
                        {
                            "author": "Narrow_Equivalent_47",
                            "body": "We need to find a middle ground in society for holding people accountable while also acknowledging that people are complex and everyone makes mistakes.",
                            "score": 336,
                            "replies": [
                                {
                                    "author": "DesperateInCollege",
                                    "body": "This very much strikes me as a \"someone may be nice to you, but doesn't mean they're nice to everyone\" situation. As the other commenter has mentioned Ariana is a repeat offender in messing with taken men.",
                                    "score": 189,
                                    "replies": [
                                        {
                                            "author": "frostiebuggie",
                                            "body": "So true!! It’s like when Ellen was called out for being nasty to us plebeians and all these famous, rich celebrities were saying “well Ellen has always been so nice to us!”\n\nTwo things can exist at the same time. Ellen has done nice things, is probably nice to some, and has genuinely done a lot for the animals welfare community. But she’s also a raging asshole scab who tries to get people fired for chipped nail polish. \n\nSame kind of energy can be applied to Arianna.",
                                            "score": 74,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "littlebruise",
                                    "body": "Its not a mistake if its a repeated behaviour",
                                    "score": 231,
                                    "replies": [
                                        {
                                            "author": "Narrow_Equivalent_47",
                                            "body": "I'm not here to defend anyone hahaha",
                                            "score": 11,
                                            "replies": []
                                        },
                                        {
                                            "author": "hagaelquadradinho",
                                            "body": "That’s a pretty unsympathetic take. People don’t learn lessons the first time around. Whatever insecurity that causes this behavior doesn’t go away with a single therapy session. \n\nThis doesn’t just apply to celebrities and I hope you give the people in your life more grace than you do in gossip subs.",
                                            "score": -10,
                                            "replies": [
                                                {
                                                    "author": "meatball77",
                                                    "body": "And just because someone was a jackass 19 year old doesn't mean we throw them out as a bigot forever.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "TorneDoc",
                                            "body": "is that… how mistakes work?",
                                            "score": -5,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "1stOfAllThatsReddit",
                                    "body": "She has cheated on every dude she has been with since her early nickelodeon days and im pretty sure every dude she got into a new relationship with was a taken man at the time she got with them.\n\nIve also seen multiple accounts of her trashing hotel rooms and charter jets in those “whos the worst celeb you met” type threads. Sure some might be made up but to share such a common theme among the complaints?",
                                    "score": 32,
                                    "replies": [
                                        {
                                            "author": "Narrow_Equivalent_47",
                                            "body": "Go off sis",
                                            "score": 8,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "windexfresh",
                            "body": "This may be parasocial as *fuck* but like, I have to assume Mac’s death really fucked with her (and her response to love/relationships) as well. I know if I had been in that situation, even without the world watching it would take years upon years to heal from that kind of pain.",
                            "score": 138,
                            "replies": [
                                {
                                    "author": "Jellybean199201",
                                    "body": "Also the Manchester Bombing. I can’t even begin to imagine the effect that would have on someone\n\nThere’s an awful lot of trauma that has went on in her life especially considering she’s still very young",
                                    "score": 119,
                                    "replies": []
                                },
                                {
                                    "author": "Sh3D3vil84",
                                    "body": "I would say a lot of this is true but also I think it stems from her parents being divorced when she was young. We don’t know how much she was a witness to. She never talks about it unless it’s pretty surface level. It seems like she hasn’t had too many great examples of relationships coupled with extensive traumas, workaholic nature and being a child star-I’m surprised she’s as seemingly normal as she is. It doesn’t excuse her behaviors but does explain some of it.",
                                    "score": 53,
                                    "replies": []
                                },
                                {
                                    "author": "allthepinkthings",
                                    "body": "She was already behaving like this before he passed though. She had a bf and he had a long term gf and they cheated with each other.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Kooky_Bodybuilder_97",
                            "body": "she has done a lot of good. I think you can be shitty in one area and be genuinely great in others. the human mind is strange",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "jrhendr",
                            "body": "Layers and three dimensionality?? In MY celebrity??",
                            "score": 14,
                            "replies": []
                        },
                        {
                            "author": "poontangpooter",
                            "body": "Reddit and the rest of the internet just have to learn people are nuanced and can do bad things as a good person and vice versa and that literally no one is perfect including all the people judging celebs themselves. You can appreciate a good act without condoning a bad one at the same time.",
                            "score": 31,
                            "replies": [
                                {
                                    "author": "imma_super_tall",
                                    "body": "Yup. I’ve met plenty of people who are great friends and kind to strangers but are super messy with relationships.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "meatball77",
                                    "body": "And there are plenty of people who are shit at relationships but that doesn't make them bad people.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "EbbLocal266",
                            "body": "She's kind to you if you don't have a man she wants.",
                            "score": 43,
                            "replies": []
                        },
                        {
                            "author": "meatball77",
                            "body": "People do grow and mature.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SuggestionMedical736",
            "body": "I really feel bad for her. Because those populist assholes will try to spin this as woke losing out, while most people, me included, will not watch this movie because of the IDF soldier associated with the movie. \n\nBut like always, the person of collor will be the scapegoat.",
            "score": 36,
            "replies": [
                {
                    "author": "1stOfAllThatsReddit",
                    "body": "You're very naive if you think most people will not watch this because of gal gadot instead of because they are racist towards rachel…",
                    "score": 3,
                    "replies": [
                        {
                            "author": "rawrkristina",
                            "body": "The people being racist towards Rachel don’t care and weren’t planning on watching Snow White to begin with, lbr.",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "SuggestionMedical736",
                            "body": "I mean, i don't think the average Asmongold viewer is the targeted audience of this movie to begin with. Most people who claim to boycott it, would not have gone to begin with.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "zakattak456",
            "body": "I really hope the film ends up being somewhat successful. I know it's far fetched at this point but I can pray",
            "score": 20,
            "replies": [
                {
                    "author": "meatball77",
                    "body": "The reviews have basically said that she provides an amazing performance and is the only good thing about the film.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Starlight-x",
            "body": "Helen Mirren is a massive zionist 🤢\n\nI wish the best for Rachel - she's incredibly talented and kind.",
            "score": 61,
            "replies": []
        },
        {
            "author": "honeybeesandmagpies",
            "body": "TIL Rachel Zegler is only 23. That’s crazy considering how talented she is, the roles she’s had, and the public backlash that she repeatedly handles so well",
            "score": 3,
            "replies": [
                {
                    "author": "meatball77",
                    "body": "She went from HS to performing Maria for Steven Spielberg, being a Disney Princess and a lead in a YA film franchise, to Broadway and now she's going to be Evita on the West End.  She has been the lead in almost every professional project she's done.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}