{
    "title": "\"Last year, we went to Ireland for the first time to meet my dad [Ed Begley Jr's] family. As a former drummer, they asked if he wanted to play with the band. He said he couldn’t play anymore because of his Parkinson's, but they insisted. He was quiet at first but then… Happy St. Patrick's Day🍀\"",
    "author": "jaffacakes077",
    "subreddit": "Fauxmoi",
    "rank": 4,
    "score": 1451,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 46,
    "url": "https://v.redd.it/8a24h9kgohpe1",
    "id": "1jebn49",
    "selftext": "",
    "comments": [
        {
            "author": "Immediate_Taste6810",
            "body": "I had no idea he had Parkinson's.  \n\nI love how every year he and his daughter go to the Oscars by city bus and subway",
            "score": 343,
            "replies": [
                {
                    "author": "AlarmingFill",
                    "body": "Truly a man who doesn’t waiver on his environmental activism",
                    "score": 164,
                    "replies": [
                        {
                            "author": "recklessrecentpast",
                            "body": "He along with Jane Fonda and James Cromwell are some of our best old folks who are doing what they can to save our planet.",
                            "score": 106,
                            "replies": [
                                {
                                    "author": "BT4US",
                                    "body": "James Cromwell is my favorite. He went vegan after acting in Babe. A few years ago he went to a Starbucks in Manhattan and superglued his hand to the counter to protest extra charges for plant milk. Eventually he just dissolved the glue and left lol. Love him.",
                                    "score": 22,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ironicshowchoir",
            "body": "Wow I didn’t know he had Parkinson’s, always loved him as an actor.",
            "score": 468,
            "replies": [
                {
                    "author": "ShinyPrizeKY",
                    "body": "Me too! He has such funny cameos in so many of my favorite movies and shows like Pineapple Express and Party Down. Wishing him well ♥️",
                    "score": 103,
                    "replies": [
                        {
                            "author": "Stonkyard",
                            "body": "He had some great moments on Portlandia, too.",
                            "score": 32,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "solanamell",
                    "body": "My dad was diagnosed with Parkinson's 16 years ago. He's in the advanced stages with dementia on top of it.\n\nIf you've never had a family member with these issues... you live for these moments. You pray for them.  It's such an unpredictable disease, and I just don't know when the last time my dad will be able to smile at me and tells me he loves me. I try to soak up those moments to steel myself for the bad ones.\n\nThe expression Ed is making here reminds me SO MUCH of my dad. Rooting hard for him and his family.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "barbaraanderson",
                    "body": "He was looking fairly frail in the Hallmark Kansas City Chiefs Christmas movie from last year, so it is already starting to take its toll on him as an actor.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Sproose_Moose",
                    "body": "You said it all. He seems like a genuinely nice dude.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Motherofsmalldogs",
            "body": "I remember hearing he and his daughter take public transit to award shows together and he just seems like such a lovely man. We love you Stan Sitwell. 🥲 ",
            "score": 193,
            "replies": [
                {
                    "author": "renandstimpyrnlove",
                    "body": "And Cliff Main!",
                    "score": 17,
                    "replies": []
                }
            ]
        },
        {
            "author": "prettystandardreally",
            "body": "Seeing him see his daughters crying and then him also breaking down got me. Thanks for sharing this, OP.",
            "score": 109,
            "replies": [
                {
                    "author": "Curiosities",
                    "body": "Same. That joy in the moment and then the tearing up. So pure. \n\nAlways really liked him in anything he'd turn up in.",
                    "score": 18,
                    "replies": []
                }
            ]
        },
        {
            "author": "StillJobConfident",
            "body": "Ed and his family do a ton for addiction counseling in LA, saved my life more than once. deserving of sainthood he is",
            "score": 91,
            "replies": [
                {
                    "author": "suredont",
                    "body": "guy has been walking the talk for decades, at this point. he's a gem.",
                    "score": 20,
                    "replies": []
                }
            ]
        },
        {
            "author": "post_obamacore",
            "body": "Through an ex, I once ended up at a charity dinner in Beverly Hills at Judy Garland's old house. Ed Begley Jr. was in attendance, and at one point I held open the door to the bathroom for him. He said, \"Thank you, young man,\" before walking back out to the dinner. Seems like a nice dude. Anyways, that's my story!",
            "score": 53,
            "replies": []
        },
        {
            "author": "Thereg0esmyhero",
            "body": "![gif](giphy|j0qSbeNFuzjhXKFVSP)",
            "score": 86,
            "replies": []
        },
        {
            "author": "AwkwardBet7634",
            "body": "Spent yesterday (Patrick's Day) watching Better Call Saul with my missus here in Dublin. A great actor.\n\nThis put a smile on my face.",
            "score": 22,
            "replies": []
        },
        {
            "author": "soupseasonbestseason",
            "body": "my family has a lot of parkinson's. it is not fun to watch. the smile on his face as he plays the drum is such a gift.",
            "score": 21,
            "replies": [
                {
                    "author": "frolicndetour",
                    "body": "My dad passed from it.  Rock Steady Boxing is a wonderful program for people with Parkinson's that helps tremendously...I believe we got an extra couple of good years with my dad from him doing the program.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "soupseasonbestseason",
                            "body": "my grandpa who passed was a boxer in life. i imagine it would have helped him. my auntie is now improving greatly through a boxing program! we have multiple generations affected. it's no bueno.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "frolicndetour",
                                    "body": "Oh I'm glad your auntie is finding it helpful.  My dad improved so much.  It's such an awful disease.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "jaffacakes077",
            "body": "@ haydenbegley on tiktok",
            "score": 11,
            "replies": []
        },
        {
            "author": "Negotiation-Current",
            "body": "Music has magical powers and I’m not even kidding. I have severe debilitating PTSD myself but I’m also an artist and when I play music I swear you can see how I was before this thing took me over. If I didn’t have music I don’t know what I would do.",
            "score": 21,
            "replies": []
        },
        {
            "author": "Cute_Speaker5490",
            "body": "So good seeing John ‘Stumpy’ Pepys recovered from his fatal bizarre gardening accident and back behind the drums where he belongs.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Palindrome_01289",
            "body": "Ugh I love EBJ! I’ve never seen my dad laugh as hard as he has at this video so I’ll always have a soft spot for this angel of a man.\n\nhttps://youtu.be/evx_Ps85yu8?si=hXg-JrdqGGrrHDOv",
            "score": 6,
            "replies": []
        },
        {
            "author": "Pandabumone",
            "body": "What a gem. Beautiful to see family come together like this.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Consistent_Profile47",
            "body": "This man is a delight and inspiration in every way. Thank you for being you, Ed.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Cool_Cry_9602",
            "body": "https://preview.redd.it/dgk18gu5mipe1.png?width=454&format=png&auto=webp&s=ac36794515635ba17895a092d0a205a3574e5c3e\n\nHe guest starred on a show I worked on and seemed super sweet (unsurprisingly!).  He also improv'd a line that I will never forget: he was supposed to be on the phone with his doctor and said \"why don't I bring you a pair of my underwear, then you'll have a sample of all three\" 😂😭 incredible",
            "score": 4,
            "replies": []
        },
        {
            "author": "Lucky_Valuable_7973",
            "body": "Beautiful",
            "score": 3,
            "replies": []
        },
        {
            "author": "yashedpotatoes",
            "body": "I will never forgive OP for informing me that Ed Begley Jr has Parkinson’s.",
            "score": 4,
            "replies": []
        },
        {
            "author": "JosephMadeCrosses",
            "body": "Your dad is John \"Stumpy\" Pepys?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Luna_Soma",
            "body": "Someone’s cutting onions in here. How lovely",
            "score": 2,
            "replies": []
        },
        {
            "author": "Callmekaare",
            "body": "What a coincidence as I am also bawling my eyes out now 🥹❤️",
            "score": 2,
            "replies": []
        },
        {
            "author": "issi_tohbi",
            "body": "I’m so sorry to hear he has Parkinson’s! \nAlso why was I convinced this man was from a Nordic country.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ok-Reflection5567",
            "body": "This is so heartwarming - I was so touched by this and felt patriotic (I’m not even Irish) 🥹",
            "score": 1,
            "replies": []
        },
        {
            "author": "filleauxyeuxverts",
            "body": "I love humanity ❤️",
            "score": 1,
            "replies": []
        },
        {
            "author": "Irishpanda88",
            "body": "Nobody asked but the drum he’s playing is called a bodhrán. Pronounced bow-ron (bow as in the front of a ship)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Massive_Sir_2977",
            "body": "Go swab Begley, he likes it.",
            "score": 0,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -21,
            "replies": []
        }
    ]
}