{
    "title": "Tina Fey on Amy Poehler’s ‘Good Hang’ podcast: “…I have a problem with rich people having a side hustle…”",
    "author": "hairtie1",
    "subreddit": "Fauxmoi",
    "rank": 19,
    "score": 129,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 27,
    "url": "https://v.redd.it/0e49ambxkipe1",
    "id": "1jeg4xx",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "**THE R/FAUXMOI DISCORD IS NOW LIVE!** \n\n___\n\nIf you're a regular commenter on the sub and want to join, [click here for the invite link!](https://discord.gg/BuNp5fsJwS)     \n\n___\n\n\n \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fauxmoi) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Classic-Carpet7609",
            "body": "Someone send this clip to Joe Rogan who has $500 million and still shills ‘Alpha Brain cognitive enhancing’ supplements\n\nSnake oil salesman through and through",
            "score": 130,
            "replies": []
        },
        {
            "author": "HedgehogIll6059",
            "body": "Honestly, I agree with Tina on this one. Like why are you rich and stealing from the poor??",
            "score": 193,
            "replies": [
                {
                    "author": "Baddecisionsbkclb",
                    "body": "I also agree. I do believe there's a line. So like the Kardashians are one extreme. All these celebs doing mobile game ads is up there. But if it's kinda niche and in line with their passion then I'm less judgmental. (Like they care what I think lol they're not getting any of my money either way)\n\n\n I'm trying to think of a celeb with a side hustle that doesn't bother me and I'm only coming up with Kaley Cuoco who sells something for dogs (I can't remember) bc she's literally obsessed with her animals. Also I'm not really a Jessica Simpson fan but I respect all those clothes and shoes and bags she sells bc I really think she likes it and at least it's somewhat affordable",
                    "score": 44,
                    "replies": [
                        {
                            "author": "AmazingStrategy8621",
                            "body": "I'd say Shay Mitchell's bag company Beis or Jessica Alba's Honest Company are examples of good side hustles. Those don't bother me but I think that's because these businesses became their priority rather than \"I'll employ others to do this and that\"",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "Redd11r",
                                    "body": "Jessica Alba and Jen Garner seem to actually care. It’s clear that it’s more than just a side hustle to them. I mean Jen Garner is an actual farmer.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Toffeerain",
                            "body": "Jessica Simpson sunglasses suit my face perfectly and are very affordable. It annoys me to buy from a celeb line but...",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "kissmeonthehead",
            "body": "The side hustles I don’t mind are things like Kyle McLachlan’s winery and Seth Rogan’s pottery. I’m more frustrated with everyone and their dog making a skincare line. 😵‍💫",
            "score": 11,
            "replies": [
                {
                    "author": "sofar510",
                    "body": "Hair care and makeup too! We don’t need it\n\nBut the bane of these are tequila lines and celebrity liquor. We don’t need it!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "andreaisinteresting",
            "body": "I agree with her and I'll take it a step further. I also think they should all Venmo me $2,000 immediately.",
            "score": 18,
            "replies": []
        },
        {
            "author": "ithinksotoomaybee",
            "body": "Haha! Amy sighs- Yeah, Like having a podcast?  And it’s her podcast.  Love these legends.",
            "score": 8,
            "replies": []
        },
        {
            "author": "AmazingStrategy8621",
            "body": "Props to Tina. I respect Amy for doing a masterclass and hosting a podcast but saying that they should learn from Gen Z? I mean they all look like they aged by decades, exhausted, and gambling on random hustles to suddenly make a breakthrough? No thank you.",
            "score": 24,
            "replies": [
                {
                    "author": "AgitatedStove01",
                    "body": "As a long time fan of both of them, it was very much sarcasm.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "Redd11r",
                            "body": "Relieved to hear this",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "AmazingStrategy8621",
                            "body": "I'm sure you're right (I'm also a huge fan)",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "40_Love",
            "body": "I don't mind an entrepreneurial spirit. Those side hustles employ people, too. If you don't want to support it, don't buy it and if enough people agree, it will go away.\n\n  \nMy issue is with rich people like the Kardashian-Jenners promoting BS products or obvious scams for a quick buck that they absolutely do not need.",
            "score": 36,
            "replies": []
        },
        {
            "author": "PizzaReheat",
            "body": "I agree, but my issue with it my laziness. If I’m a millionaire, I’m doing the least amount of work possible. I’m sitting in my lake house reading, I’m not doing a promo tour as the creative director for a dog CBD company.",
            "score": 4,
            "replies": []
        },
        {
            "author": "id0ntexistanymore",
            "body": "No we should not stop judging it Amy, tf!",
            "score": 5,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "Fauxmoi-ModTeam",
                    "body": "Hi OP: as you are submitting a Twitter, Meta, TikTok or tabloid link, we have verified your source and removed this comment to prevent further traffic to those sites! Thank you for your submission!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "FreudianNegligee",
            "body": "I will never forgive Amy Poehler for ruining Broad City for me forever by putting Hillary Clinton on the show in 2016. Never in a million billion years would Ilana’s character have supported Hillary over Bernie.",
            "score": -3,
            "replies": [
                {
                    "author": "cee-ell-bee",
                    "body": "Calm down",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "andreaisinteresting",
                    "body": "This is so dramatic lmfao",
                    "score": 12,
                    "replies": []
                }
            ]
        }
    ]
}