{
    "title": "I finally platinumed destiny 2",
    "author": "niceguy2003",
    "subreddit": "DestinyTheGame",
    "rank": 16,
    "score": 169,
    "upvote_ratio": 0.85,
    "num_comments (reported by reddit)": 66,
    "url": "https://www.reddit.com/r/DestinyTheGame/comments/1je1rjt/i_finally_platinumed_destiny_2/",
    "id": "1je1rjt",
    "selftext": "I know people probably don't care but I don't have friends to share this with and just wanted to share this with someone. But after years I finally platinumed destiny 2 and I'm now working on destiny 1 ",
    "comments": [
        {
            "author": "Fazlija13",
            "body": "Not enough, do the all titles next",
            "score": 30,
            "replies": [
                {
                    "author": "AdrunkGirlScout",
                    "body": "I’m still salty about braytech never dropping so I couldn’t get Wayfarer",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "rhago32",
                    "body": "😅",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Brandon0159",
            "body": "Congrats bro I remember when I platinumed d2 back in 2017 before the trophies were changed like you didn’t have to do a prestige mode raid before and could just do a prestige nightfall back then.",
            "score": 21,
            "replies": [
                {
                    "author": "WaitHealthy4454",
                    "body": "U still needed 2 do the leviathan raid",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Brandon0159",
                            "body": "Oh yeah you right my fault thanks for the correction the trophy that was changed was to complete the leviathan raid on prestige difficulty is what I meant the original description said you could also do a prestige nightfall as well before they removed prestige nightfall in favor of the adept-grandmaster difficulties.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "WaitHealthy4454",
                                    "body": "That's the description of belly of the beast the prestige is 2 complete the leviathan raid but those 2 trophies changed in 2020",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "niceguy2003",
                    "body": "Congrats on your platinum yeah I would have loved to get the plat for D1 and D2 much sooner but I was out of it for large periods of time so I missed out on so much. Finally in a somewhat better mental so I finally decided to go for the plat. Currently working on D1 at the moment I just really want to finally get these awesome games fully complete.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Brandon0159",
                            "body": " Cool keep up the grind I know for D1 I got the platinum years later like around 2017 after with rise of iron released because of the hard mode raid where no one in your fire team can die seemed too hard back then but I ended up doing it on crotas end hard mode first try with friends it’s the easiest raid in the game",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Prooch412",
            "body": "Only thing I need is a Last Wish run. Only thing I’ve never done.",
            "score": 6,
            "replies": [
                {
                    "author": "Swimming_Let_8610",
                    "body": "Last wish is a super fun raid. If you're ever looking for a sherpa I'd be happy to help :)",
                    "score": 3,
                    "replies": [
                        {
                            "author": "YawningMorpheus",
                            "body": "Could I take you up on that offer? I've got just Last Wish to do as well for the platinum.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "RaNDiiM",
            "body": "Nice dude! Now log into the PS4 version and all the trophies will pop again 😂",
            "score": 9,
            "replies": [
                {
                    "author": "niceguy2003",
                    "body": "Oh really sweet I was so happy that I didn't even think about that being an option thanks for letting me know.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Friendly--Introvert",
                    "body": "Works on pc as well 😭 same thing happened when I first crossed over",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "turkeymcgiblets",
            "body": "Good work!! I am jealous. Trying to do the same in reverse - 1 and then 2",
            "score": 2,
            "replies": [
                {
                    "author": "niceguy2003",
                    "body": "Good luck  guardian if you need help with anything at all I'd be down to join you on your platinum journey.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "PhuriosoClive",
                            "body": "I've had D1 on the back burner for yearssss. I'd be super interested in joining your platinum journey 👍 pretty much need all the clan and raid trophies",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "niceguy2003",
                                    "body": "I'd love to help you out I'm still a long ways away from the D1 plat myself I'm just missing the upgrade each class trophy. But like I said I'd love to help with whatever I can.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "PhuriosoClive",
                                            "body": "Oh nice. If you need another for strikes just message me. Psn - phurioso",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "niceguy2003",
                                                    "body": "I'll shoot you a request when I'm online tomorrow I'm going to try and get some sleep I'm exhausted",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "turkeymcgiblets",
                                                            "body": "Basically anything in co op beyond basic strikes is still on my list. I was too shy to be social online when the game first came out lol.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Justamegaseller",
            "body": "I’ve been at 98% for 2 years now",
            "score": 2,
            "replies": [
                {
                    "author": "niceguy2003",
                    "body": "You should definitely finish it off if there is anything you need help with I'd love to help out a fellow guardian I'm not the greatest but I'm a good distraction haha.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "wakinupdrunk",
                    "body": "Same - just haven't made a Titan yet.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "KarateKid917",
                            "body": "Literally same. That’s the only thing I’m missing and just haven’t bothered ",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "corbz010",
            "body": "Good job bro",
            "score": 1,
            "replies": [
                {
                    "author": "niceguy2003",
                    "body": "Thank you glad to finally platinum a game that's a part of a series I love so much.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "procl0ne",
            "body": "congrats bro! i actually just got my plat too this month. been playing since 2014 but honestly dont care about trophies. but a friend was confused as to why i didnt have plat so i gave it a go lol",
            "score": 1,
            "replies": [
                {
                    "author": "niceguy2003",
                    "body": "Congrats I'm glad I finally got in the right headspace to go for it been playing since house of wolf's/taken king the franchise has always been something I've loved so I'm so glad to finally have the plat it's just D1 now.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "hessuya",
            "body": "Congrats! Going back to plat D1 was what launched me into a year long addiction of Destiny - only went back for a couple of odd jobs. Good luck with the D1 plat, might need to use some communities to get the raid ones done but I think there's easy ways around them from what I remember.",
            "score": 1,
            "replies": [
                {
                    "author": "niceguy2003",
                    "body": "I'm already two steps ahead I already got all the stupid difficult raid stuff I would have had the plat for D1 and D2 ages ago. But because of this stupid cringe thing called depression I have been all over the place. Now that I'm in a somewhat better place I finally want to go for these games I just need to max out hunter and warlock as well as the 50 ghosts and then the plat is finally mine.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "hessuya",
                            "body": "Nice one! I was the same haha, all raid stuff done just the classes and some of the Rise of Iron stuff left. Depression isn't cringe man it's debilitating. May this better place last for you",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "niceguy2003",
                                    "body": "Thank you seriously it's just exhausting trophy hunting has been helping out mentally it's just exhausting. Like I'll have this great high where I'll want to do so much and then in the same breath want to lay on the road. On a less depressing note if you somehow are missing a trophy or need help with anything I'd love to help.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ChrnoCrusade",
            "body": "Hey I still need flawless raid in D1. I'm down to help with that one!",
            "score": 1,
            "replies": [
                {
                    "author": "niceguy2003",
                    "body": "Hey I already got the flawless and clan raider trophies a while ago I just need the max out warlock and hunter trophies but I'd definitely be willing to help you with yours.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "KnockupAbyss",
            "body": "Damn lucky I personally need two left Nightfall and Grand Nightfall trophies but can't seem to get help with team finder.",
            "score": 1,
            "replies": [
                {
                    "author": "niceguy2003",
                    "body": "I can definitely try and help you out tomorrow I'm not going to be the most helpful but I'll be a willing distraction haha.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheMoonFanatic",
            "body": "Congrats. Now if you load up the game on Steam or Xbox it should auto unlock everything there too lol",
            "score": 1,
            "replies": [
                {
                    "author": "niceguy2003",
                    "body": "Thank you I only play on PlayStation but thank you so much for the suggestion.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Friendly--Introvert",
            "body": "I've done d2, I'm just missing the flawless raider on d1 console. I was planning on doing solo flawless crota's end or something but probably won't ever get around to it",
            "score": 1,
            "replies": []
        },
        {
            "author": "tapititon",
            "body": "Noice, what was your final trophy?",
            "score": 1,
            "replies": [
                {
                    "author": "niceguy2003",
                    "body": "Unlock every hunter subclass was my last trophy haha but seriously the trophy that was gatekeeping me from the plat was the master and grandmaster nightfalls. Back then I had really severe social anxiety so I just always avoided endgame content like the plague because I was worried I would be a bother for other people. years later my mental is now stable far from good but it's not all over the place and one day I decided to go for them I got lucky because it was an easy strike and got it done very easily.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Monkey-Hands",
            "body": "congrats! 👏🏻",
            "score": 1,
            "replies": [
                {
                    "author": "niceguy2003",
                    "body": "Thanks mate do you reckon I'm the first person who got the plat haha in all seriousness I'm glad it's finally done just have to work on D1 now and I'll be happy.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Monkey-Hands",
                            "body": "lmao absolutely not. 😄\ndestiny 1 was a fun plat as well, but took more time than d2.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "niceguy2003",
                                    "body": "Yeah I guess I was off by a year or few haha I can see why D1 is harder thankfully I was able to get clan and flawless raider done. So it's just max out warlock and the hunter subclasses and find 50 ghosts after that I have officially platinum both games.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Monkey-Hands",
                                            "body": "yeah that’s just an xp grind then. annoying at times, but it’s still a great game.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "niceguy2003",
                                                    "body": "Oh absolutely it's what got me into the series I think I started around either the start of house of wolves or at the very end going into the taken king unfortunately my memory is fried so I don't remember large chunks of things. It's definitely slow especially solo but it's manageable.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Monkey-Hands",
                                                            "body": "i felt titan took the longest. not sure why.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "niceguy2003",
                                                                    "body": "Huh interesting well thankfully I was a crayon eater main in D1 so I just got it over time at the moment I'm just trying to figure out the most efficient way of grinding for exp once I figure that out everything will be fine.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Monkey-Hands",
                                                                            "body": "i think i just did random missions and quests. also lots of bounties.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "MrrBannedMan",
            "body": "Grats my guy, Grandmaster was my last one, finally popped it during the Craftpocalypse :L",
            "score": 1,
            "replies": [
                {
                    "author": "niceguy2003",
                    "body": "Congrats guardian definitely not as hard as D1 in my opinion but still extremely difficult.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "MrrBannedMan",
                            "body": "I can't take any credit for that particular trophy I'm afraid I had a shotgun frame Ammit, the boss died in seconds :L",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "niceguy2003",
                                    "body": "Hey a win is a win doesn't matter the situation haha but seriously congrats.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "OldJewNewAccount",
            "body": "Nu way dude!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gullible_Vacation_34",
            "body": "Good job!  I'm on Xbox and only have one achievement left for 100%.  It's PvP so I'm dreading it lol.",
            "score": 1,
            "replies": []
        },
        {
            "author": "drjenkstah",
            "body": "Nice! Now work on those in game titles and triumphs. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "YaboiMassiah",
            "body": "If you need some guys to do Flawless Raider in D1, let me know, and I'll be sure to let my buddies know, we've been looking for others for a looooong time. We need flawless raider as our final trophy for plat. If you are not interested, I understand, and good luck!",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrSundowner",
            "body": "Nice bro, I'm trying to do the same now. I feel like the hardest ones for me are going to be the Triumph Seal, Collections Badge and 10 Forsaken Exotics. Anyone have any tips for these in 2025? A lot of guides are from years ago before a lot of changes...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fledgy",
            "body": "Damn that's crazy",
            "score": 0,
            "replies": [
                {
                    "author": "niceguy2003",
                    "body": "Yeah I'm a few years late haha but I'm just happy to finally have done it.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "MoldybreadOO",
            "body": "Well, since you started with \"since people probably don't care\" you may get some of the pity engagement you were seeking. GL",
            "score": -17,
            "replies": [
                {
                    "author": "niceguy2003",
                    "body": "I only said that because it's just a platinum and a lot of people might find it stupid that I'm happy about it I wasn't looking for engagement. I was just genuinely happy and just don't have friends to talk to about this kind of thing.",
                    "score": 0,
                    "replies": []
                }
            ]
        }
    ]
}