{
    "title": "Every Destiny 2 non-Exotic weapon sorted by their weapon model progenitors",
    "author": "Kliuqard",
    "subreddit": "DestinyTheGame",
    "rank": 6,
    "score": 190,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 48,
    "url": "https://www.reddit.com/r/DestinyTheGame/comments/1jebm7l/every_destiny_2_nonexotic_weapon_sorted_by_their/",
    "id": "1jebm7l",
    "selftext": "https://docs.google.com/spreadsheets/d/1Ww9-hb9Z0J4cVBm9IRCVupLsu7oe8oAYpObIcfBLz6E\n\nMostly did this to satisfy some curiosities. It was rather eye opening seeing the gradient in quality when it comes to recycling weapon models throughout the game. While some are extremely obvious, you may find it pretty surprising that even some rather distinct models are just a recycle.  \n\nAlso hoping to contribute to the recycled weapon debate with this. Recycled weapons are a must to keep the loot flowing, so it helps to see what can be done with them and maybe adjust your expectations accordingly.",
    "comments": [
        {
            "author": "packman627",
            "body": "Honestly I think it's really cool! \n\nIt's just hard for me to get interested in new linear fusion rifles when 99% of them use the Veist model. Can we get a cassoid, hakke, or Suros LFR model?\n\nAlso my biggest issue is Trials weapons. It's technically not free to play, you have to own the most recent expansion in order to play trials, yet in my opinion it's the biggest offender of reskins/recolors.\n\nIf you look at raid or dungeon weapons, they either are unique, or heavily modified to where they better fit the theme of said raid or dungeon.\n\nThe last time we got a semi-unique looking Trials weapon was igneous hammer back in 2021. Yes that used a Suros HC model, but at least they tried to make it look a little more unique, and they gave it a unique firing sound. \n\nBut now at least for me, it's not exciting to get one new trials weapon per episode or season because it's just going to be a world drop weapon that's painted black and gold, that sounds exactly like the world drop weapon, but it just has juiced stats and juiced perks.\n\nI feel like, imo, in short, I wish that trials weapons got more artistic style in their models and in their firing sounds, bringing them in parity with raid and dungeon weapons.",
            "score": 70,
            "replies": [
                {
                    "author": "CrotaIsAShota",
                    "body": "I don't think Suros and Hakke would feel right for LFRs but an Omolon linear would look dope.",
                    "score": 19,
                    "replies": [
                        {
                            "author": "Aroused_Pepperoni",
                            "body": "I'm imagining a Hakke LFR that works like a modern railgun - firing an extremely high speed physical projectile after a short delay using electromagnetic energy. Think of the dummy thick \\*whump\\* that bitch would make",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "CrotaIsAShota",
                                    "body": "YKW I like it. They do love to make exotics into their own legendary weapon archetype so I could see Hakke LFRs based on Arbalest.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Aroused_Pepperoni",
                                            "body": "lol I totally forgot arbalest already used that gimmick",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "robborrobborrobbor",
                                    "body": "Basicly legendary arbalest?, hell that would be realy fun.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "UUDDLRLRBAstard",
                                    "body": "OG Graviton Lance sfx, RIP",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TerrorSnow",
                    "body": "With this season's weapons being pretty sick I'm getting hopeful we'll see more fresh models in the future",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "eddmario",
                    "body": "To be fair, the Trials of Osiris guns have always been reused models with a new skin added to them.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "packman627",
                            "body": "Yeah true, the only exception has been Iggy.\n\nI mean, if Bungie wants trials weapons to stand out, maybe they need to take a look at Iggy, make the new weapon silhouettes look different and sound different",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Kliuqard",
                                    "body": "Sola’s Scar tends to be forgotten, but it is the other exception. It does look similar to the rest of the casters, but it is a uniquely slimmer model.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Ofnir_1",
                    "body": "Bungie needs to bring back the Year 3 Trials weapon models as well as the Jewel of Osiris handcannon (do not see this handcannon model used anywhere in D2)",
                    "score": 2,
                    "replies": [
                        {
                            "author": "packman627",
                            "body": "That would be cool to see. Some more unique D1 models, and standouts.\n\nI would love to see Rise of Iron IB weapons make a return in D2 as their weapon models are pretty unique. Like Clever Dragon coming back, etc etc",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Ofnir_1",
                                    "body": "One thing I wished they would do is add things like laser sights or other cosmetic things to adept weapons like they did in D1 (non-adept Doctrine of Passing was fairly basic but the adept version had the cage looking thing with wires coming out the back). Makes them feel extra unique in a way",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "HellChicken949",
            "body": "Please for the love of god we need a new trace rifle model. I don’t care much for reskins, but man when I see a legendary trace rifle I just get turned off from it cause it looks like retraced path/path of least resistance. Just reskin lodestar or navigator or literaly any other exotic trace rifle.",
            "score": 36,
            "replies": [
                {
                    "author": "DrRocknRolla",
                    "body": "I didn't mind traces being reskinned when there were like three of them. \n\nNow that we have three new ones in a season, they should have come up with something else. At least the Sundered Doctrine trace is \"unique\" I guess.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Velthome",
                    "body": "Trace Rifles are so weird in general. I feel like a brand new player today has very few accessible ones with they if don’t have old patterns without farming Rotators for a hard drop.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Bosscharacter",
            "body": "\"Totally not Halo Swords\" is hilarious as a descriptor.",
            "score": 12,
            "replies": [
                {
                    "author": "ImJLu",
                    "body": "Tbh there should also have been Totally not Halo Pulse Rifles",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Glaedien",
            "body": "Oh wow, you're right, some of this is surprising. Never would've matched Brass Attacks and Division for instance.\n\nTrace rifles could definitely use some variety though. Strange how legendary Glaives have 4 models despite being a season younger as a weapon type (not counting exotic traces, obviously). I wonder if that lends credence to the idea that Lubrae's was originally supposed to be the raid exotic instead.",
            "score": 10,
            "replies": []
        },
        {
            "author": "Ab501ut3_Z3r0",
            "body": "This is so good to have - people never believe me when I say there’s been one new legendary model from season 17 onwards (greasy luck) so this is a great way to show it",
            "score": 30,
            "replies": []
        },
        {
            "author": "repapap",
            "body": "I argue that there are 2 kinds of Hakke HCs. There are pretty distinct differences between the revolving cylinder models and the break action models with the only thing in common being the rear sight.",
            "score": 5,
            "replies": []
        },
        {
            "author": "monkeypea1212",
            "body": "Absolute gem of a spreadsheet. Was thinking of doing something like this myself, but you've already beaten me to it.\n\nI'd say my only feedback is maybe shifting some of the weapons around. For example, putting the Suros Handcannons together based on their model, like Minuet-42 and Exalted Truth being together, and Cantata and Minuet-12 together, so they can be directly compared.\n\nOther than that, lovely bit of work.",
            "score": 4,
            "replies": []
        },
        {
            "author": "OryxTheTakenKing1988",
            "body": "I find it hilarious when people talk about \"reskin weapons\" when the vast majority of the weapons we have, are reskins of blue from way back during the Red War, and possibly from way back in D1. People loved The Immortal, but it's a reskin of a blue SMG then became a Gambit smg",
            "score": 5,
            "replies": [
                {
                    "author": "AgentUmlaut",
                    "body": "On one hand I get how you mean and I understand the situation of how things are rendered on particular fixed skeletons and all that, can only do so much that wouldn't have collision with animations etc etc, on the other hand I feel like that reality does give some reason for criticism when we've had moments of actually having more unique interesting things like in the case of Vow's or Throne World stuff or stuff that builds off a core model(Scourge of Past weapons) and then have periods of future loot looking a bit scruffy or just not really doing a whole lot. \n\nJust going through this chart I was actually more surprised instances where it's been awhile since we have even got a repeat, not a ton of repeats even exist, if at all in the case of Swift Justice VI. Or how we only just got a Vestian Dynasty repeat by way of The Call and even then it doesn't really feel as similar given the cadence of each fire. \n\nLastly I do think people had a valid point to be a little let down that Neptune stuff just went straight for the suite of Moon stuff with garbage removed and racing stripe, and even then people still had to beg Bungie en masse to put the box art's handcannon physically in the game and we still never got the breech GL that the Titan holds in the art.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "eddmario",
                    "body": "Speaking of reusing models, I'm suprised we haven't gotten more D1 weapon models in D2, like the ones used by Zero Day Dilemma or Impeacher V",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ASleepingDragon",
                            "body": "Apparently due to engine differences between D1/D2, old D1 guns take almost as much work to import as it does to make a new design from scratch. I believe this was mentioned in an Into the Light era interview with Chris Proctor to explain why there were so few D1 selections in the BRAVE weapon lineup.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "OryxTheTakenKing1988",
                            "body": "There's a lot of D1 guns/models I'm surprised haven't been brought over to D2.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "VenomViper100",
                    "body": "Because pretty much every gun since lightfall has been either a blatant reskin, or barely passable at best. If you look at raids and dungeon guns over the years it becomes apparent when the reskin issue really started to get nasty (Hint: LIGHTFALL!). Not gonna get into seasonal guns, but just looking at all the major dlc weapons makes it pretty apparent when reskinning started to get really bad. Forsaken brought tons of new models, so did shadowkeep (which were reskinned in LF), so did beyond light, and so did witch queen. You could maybe argue the final shape guns are different enough to be reskins, but that's subjective at best. So no, reskinning hasn't really been a problem for the majority of D2's lifespan until now. Hell CoO and Warmind had more original models than lightfall and final shape did which is laughable to say the least.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ThunderBeanage",
            "body": "very cool",
            "score": 2,
            "replies": []
        },
        {
            "author": "GreySentinel95",
            "body": "Looks like Adhortative is missing from the \"No Time to Explain\" pulse rifles. Love the spreadsheet, great work!",
            "score": 2,
            "replies": [
                {
                    "author": "Kliuqard",
                    "body": "Good catch, thanks. I think I somehow lost it when I decided to branch it out.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "NeonAttak",
            "body": "Trace Rifle and Glaive section looks about as expected",
            "score": 2,
            "replies": []
        },
        {
            "author": "Velthome",
            "body": "We’re never getting Steelfeather Repeater back, are we?",
            "score": 2,
            "replies": []
        },
        {
            "author": "SHROOMSKI333",
            "body": "how can you even tell with the last 4 auto rifles in the daito category",
            "score": 1,
            "replies": []
        },
        {
            "author": "beterlove",
            "body": "Thank you",
            "score": 1,
            "replies": []
        },
        {
            "author": "fawse",
            "body": "I’ve wanted something like this for a very long time, thanks for putting in all the effort that I’m sure this took. Reminds me of a website in D1 that had pictures of all the different scopes, that was super cool and so is this",
            "score": 1,
            "replies": []
        },
        {
            "author": "r_dageek",
            "body": "You’re missing mountaintop on the breech GL tab I think",
            "score": 1,
            "replies": []
        },
        {
            "author": "tjseventyseven",
            "body": "Fwiw lunas howl is a reskin of lord high fixer",
            "score": 1,
            "replies": []
        },
        {
            "author": "_Nerex",
            "body": "Neat. Though wouldn't DARCI be a member of the Hakke long-scout rifle family? Given that it's an AI slapped on top of the picatinny rail.\n\nAlso we need more Hakke long-scout rifles ;-;",
            "score": 1,
            "replies": [
                {
                    "author": "Kliuqard",
                    "body": "I’ve chosen to have Exotics take precedent since they tend to be the reason for a unique sculpt.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Voidjumper_ZA",
            "body": "This is the type of shit that I looooooove about the game and the people who play it. I wish there was more of this than the rest of the constant bitching.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AFriendlyToad",
            "body": "Forcer's gonna have a field day with this. Good job!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Voidjumper_ZA",
            "body": "Why is Sola's Scar in the \"Unique\"  category and not in the \"Temptation's Hook\" category?",
            "score": 1,
            "replies": [
                {
                    "author": "Kliuqard",
                    "body": "I’ve debated this with myself for a time because of the identical blade and visually similar silhouette, but nearly every other facet of Sola’s Scar is shaped differently compared to the Temptation’s Hook series.  \n\nThe pommel is shaped differently. The grip is round and not rectangular. The frame lacks the sharp corners and fully encloses the back half of the blade. The distinct accent line is missing and instead the frame is partially hollowed out. It’s not done in a superficial matter where you can see the seams and mentally separate them, but rather it is simply molded differently.  \n\nThere is a slight double standard as something so prominent as sharing an entire blade would normally be merged together, but hopefully my reasoning makes sense.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ASleepingDragon",
            "body": "It's really cool to see this all laid out. Would have been helpful a few weeks ago when I was trying to figure out what model a gun I was looking at was based on, could have saved me some time. However, could you give a little more insight into your methodology for determining what goes together, as there are a few places where it's not clear why some weapons were grouped together despite major differences, and others where similar weapons were separated. I haven't had a chance to look closely at the whole document, but these are the things that seemed off to me:\n\n* LFRs: Threaded Needle/Doomed petitioner are quite different from the other \"Veist\" models. Even the parts that are similar - just the handguard, mag, trigger, and lower stock - are subtly different and not just a geometry copy like the other Veist guns. This is also inconsistent when compared to Trace Rifles, which are split into two categories despite sharing large swaths of identical geometry.\n* Cassoid Pulse Rifles: Definitely a shared lineage, but there are enough major but repeated variations that I think this could be broken down into at least 3 sub-families.\n* Hakke Pulse Rifles: Blast Furnace doesn't seem to belong with Hakke group - different barrel, shroud, body, stock, mag design, and mag insertion angle. Only notable similarity is the shape of the cut where the mag is inserted.\n* Cassoid Scout Rifles: Like the pulses, this is another that could use some separation, as there are shared aspects to all, but also repeating varations among the members.\n* Omolon Scout Rifles: I probably would have separated the 'open frame' and 'closed frame' variants into separate sub-families.\n* Cassiod A/Tex Hand Cannons: The distinction here is not clear. For example Fatebringer and Luna's Howl are in different categories, yet more similar to each other than many of the others they are classed with.\n* Cassoid/Crux Rockets: Hezen Vengeance feels more in line with the Crux/Lomar category. Notably it's lacking the distinct chunky flared barrel opening of the Cassoids, and shares some upper body and tail geometry with Cold Comfort.\n* Hakke/Bad Omens Rockets: These are clearly related, and should probably be one category. If kept as separate subfamilies, Crowning Duologue should be classed with Bad Omens as it's a near-copy geometry-wise, including the distinctive 'tail rings' at the back.\n\nAnyways, those are just my thoughts, and I would love to hear about how you decided some of these matters. Appreciate the hard work!",
            "score": 1,
            "replies": []
        },
        {
            "author": "MarcyxBubby",
            "body": "now this is actually something I've been interested in, neurodivergent stimulant",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nukesnipe",
            "body": "I'm sick of all the reskins man.  We haven't gotten anything actually new since before Lightfall came out.\n\nAnd no, I do not fucking buy \"stats are the only thing that matter!\" as an argument.  It's an excuse for lazy development, and one of Destiny's strongest elements has always been its very strong visual identity.\n\nShit, look at Monster Hunter.  One of the biggest complaints World got was that a lot of weapons were just the generic bone or ore weapons with monster bits glued onto them.  This was so unpopular that Capcom had to promise that Wilds wouldn't have it.  Why is that acceptable here?",
            "score": 0,
            "replies": []
        }
    ]
}