{
    "title": "How to Tank a Boss EFFECTIVELY While Not Being Passive!",
    "author": "Striker_Hutassa",
    "subreddit": "DestinyTheGame",
    "rank": 18,
    "score": 33,
    "upvote_ratio": 0.81,
    "num_comments (reported by reddit)": 27,
    "url": "https://www.reddit.com/r/DestinyTheGame/comments/1jecw3p/how_to_tank_a_boss_effectively_while_not_being/",
    "id": "1jecw3p",
    "selftext": "ATTENTION ALL STRONGHOLD PLAYERS!\n\nSeen and heard a lot about new stronghold players not tanking bosses effectively so here's a quick guide on how to lock down a boss for your team while also not being too passive!\n\nIf you didn't know standing next to a boss will cause it to do a melee stomp attack attempting to knock the player backwards so it can continue using its ranged attack. This is where sword block comes in with its COMPLETE IMMUNITY TO KNOCKBACK! Meaning you can \"lock down\" the boss into just spamming melee over and over and while the boss recovers from its melee attacks you can start dealing damage with your sword. Flash counter storms keep does a decent amount of damage but there are even more ways to provide value to your team than just holding block!\n\nVideo guide here: [https://youtu.be/POtXusPRa5E](https://youtu.be/POtXusPRa5E)\n\nIf you have any questions I'd love to answer them! I have around 900 hours with stronghold and love it to death!",
    "comments": [
        {
            "author": "Helpful_Egg5031",
            "body": "While I’ve seen a lot of Reddit posts lately crediting (blaming?) Rick Kackis for the sudden interest in using Stronghold, it was actually your videos that turned me on to how much fun it is to use these gauntlets.  I’ve only used it in solo activities so far, but I’m having a blast with it and the new flash counter sword.  Expert Court solo isn’t too bad with this setup, although I’ve only made it through five bosses solo so far.  Thanks for the videos and keep em coming.",
            "score": 15,
            "replies": [
                {
                    "author": "Striker_Hutassa",
                    "body": "Thank you! I also find Expert Nether to be an absolute cakewalk with this setup as well!",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Helpful_Egg5031",
                            "body": "Just got the second exotic catalyst step for barrow dyad.  Looks like I’m gonna get my chance to try expert nether with stronghold!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "NovelSun1993",
            "body": "This resurgence in Strongholds makes me miss the behemoth lament builds of the selfu days ... iykyk",
            "score": 10,
            "replies": [
                {
                    "author": "Striker_Hutassa",
                    "body": "Hell yeah I know. Unfortunate that Lament got nerfed so hard in the past...",
                    "score": 4,
                    "replies": [
                        {
                            "author": "SassyDalmatian",
                            "body": "Even in its nerfed state I have a hard time taking it off of my Strongholds build just because of how the guard/heavy meter charges gradually rather than in a burst. It makes it way comfier for Strongholds than any other sword imo.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Striker_Hutassa",
                                    "body": "I can totally get that",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Im_Alzaea",
                    "body": "Where the hell did he even go? He just.. disappeared. I hope nothing happened to him",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "IKnowCodeFu",
            "body": "I’m a newly converted stronghold titan and have been loving it so far. Just started using Le Monarch and ground out the 700 kills for the catalyst. \n\nOne thing I’ve noticed is that you can still get frozen. Any suggestions on how to deal with Stasis?",
            "score": 3,
            "replies": [
                {
                    "author": "Striker_Hutassa",
                    "body": "You can use your light attack to move outside of the bubble and if you are on a wave frame sword you can pop yourself out of the bubble with your heavy attack and then zoom towards the enemy that caused it in the first place. Don't be afraid to use sword ammo to get out of sticky situations!",
                    "score": 6,
                    "replies": [
                        {
                            "author": "IKnowCodeFu",
                            "body": "I have been trying to leverage the movement tech more. One thing i’ve noticed more is that the ‘zoom’ only works when you hit an enemy with the wave? I guess I can’t just pretend that it’s Eager Edge. \n\nAlso what are your recommendations on weapons? I’ve settled on Le Monarch for a primary to maximize my bolt charge, and I’ve found I’m lacking a ‘I want that thing far away to be dead’ weapon. I was playing around with the idea of switching to a legendary void bow and breaking out Arbalest.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Striker_Hutassa",
                                    "body": "You can run basically anything on stronghold but I prefer having a precision frame bow for far away targets (Vengeful Whisper my beloved) but anything can work.\n\nBeen a HUGE fan of Final Warning recently because of how effective it is at killing tormentors in the nether. It goes absolutely crazy with the extra precision damage while ADS.\n\nI can also recommend lord of wolves on the strand version without flash counter. Nothing like banner of war x4 with woven mail and 16 seconds of resto 2 while holding one of the highest dps weapons in the game lmao",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Alexcox95",
            "body": "This man is the witness and I aim to be his Rhulk. I beat GM Psiops cosmodrome for the first time this week and being able to deflect nova bombs was stupid",
            "score": 6,
            "replies": []
        },
        {
            "author": "Mrsparkles7100",
            "body": "For my arc stronghold, got blind grenade as well, if that and flash counters blind enemies, place barrier, then wither hoard for some bonus passive damage whilst blocking to trigger bolt charge.",
            "score": 2,
            "replies": [
                {
                    "author": "Striker_Hutassa",
                    "body": "Wither Hoard is so much fun on stronghold lol. Just more passive damage!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "icurnvs",
            "body": "Give us a hint. What’s the alternative to flash counter?",
            "score": 2,
            "replies": [
                {
                    "author": "Striker_Hutassa",
                    "body": "It's something that I bet a lot of people just looked at once and then disregarded entirely : )",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "AdrunkGirlScout",
                    "body": "Energy Transfer is probably decent with storms keep",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "just_a_timetraveller",
            "body": "As a long time stronghold player I feel this new popularity is going to get the exotic nerfed. Hopefully they nerf only flash counter but knowing Bungie, they will probably nuke the exotic.",
            "score": 1,
            "replies": []
        },
        {
            "author": "randallpjenkins",
            "body": "“COMPLETE IMMUNITY TO KNOCKBACK” isn’t really accurate. Plenty of Melee’s that still knock you around especially Lightfall Calus second phase.",
            "score": 1,
            "replies": [
                {
                    "author": "Striker_Hutassa",
                    "body": "Oh yeah I forgot about him. Good point!",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "CatSquidShark",
            "body": "*note that hugging Crota will not work very well this way, his hitbox will launch you into a wall and you will die almost immediately. Better to taunt Crota into using his ranged attack on you, or only take a slam if someone is about do deal sword damage.",
            "score": 1,
            "replies": [
                {
                    "author": "WiseLegacy4625",
                    "body": "Either that or just learn how far back you need to stand in order for him to not send you flying. Although I did notice that even during contest Crota's ranged attack was hitting so weakly against Strongholds my passive health regen kicked in during the attack.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "CatSquidShark",
                            "body": "It’s better to avoid him slamming as much as possible (regardless of whether or not you get sent), since some poor bastard getting caught in the AOE by accident is tragic. Plus, you build Perfect Guard stacks more quickly off of his ranged attacks.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "WiseLegacy4625",
                                    "body": "What are you going to proc the perfect guard from though? You can't proc it from enemies with immune shields like Crota so you'd have to go out of your way to proc the restoration and potentially lose his aggro. Perfect guard in this scenario is basically a moot point.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "CatSquidShark",
                                            "body": "There are other things to do while on Babysitter duty besides AFKing in front of the boss. On day one I babysat, cleared right tower, AND grabbed final chalice. Having a source of restoration up my ass was really helpful for doing that.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "BlackPlague1235",
            "body": "Speaking of tanking things, Unbreakable feels so much better especially with Ursa.",
            "score": 1,
            "replies": []
        }
    ]
}