{
    "title": "Next Barrow Dyad quest found!",
    "author": "Dan3rz86",
    "subreddit": "DestinyTheGame",
    "rank": 2,
    "score": 574,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 192,
    "url": "https://www.reddit.com/r/DestinyTheGame/comments/1jecrvn/next_barrow_dyad_quest_found/",
    "id": "1jecrvn",
    "selftext": "i found it in the 2nd hidden chest, that you take the portal to in the Nether in the Trenchway, it gives you a Shard which begins the next part.\n\nThe chest in question is the jump puzzle one in the hidden alcove.\n\nQuest is called Heavy Osseous Spine, and rewards you with \"A Hammers Path\" quest when turned in.\n\n  \nAdded here for visibility, but it seems you require a high ish rank (not sure what rank exactly as i was rank 11 when i picked it up) on Path of Ambition to get the portal open, and you require rank 12 on Path of Ambition to be able to progress on the quest after picking it up.",
    "comments": [
        {
            "author": "Trevorzky",
            "body": "Unfortunately the quest itself requires you to max out your rep on the Path of Ambition. Any recommendations for speed running that?",
            "score": 77,
            "replies": [
                {
                    "author": "Fart_McFartington",
                    "body": "Consume EVERYTHING",
                    "score": 79,
                    "replies": [
                        {
                            "author": "Winterbite-Enjoyer",
                            "body": "America moment.\n\n*manifesting destiny intensifies*",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "Blackfang08",
                                    "body": "Buddy, it's literally a looter shooter. Always has been an America moment.",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "brodes_",
                                            "body": "my mouth fell open ngl. stellar.",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "General-Biscuits",
                    "body": "Court of Blades completions (regular or expert) give you up to 200 - 250 rep in addition to any of those consumables you find on the ground.",
                    "score": 34,
                    "replies": [
                        {
                            "author": "n080dy123",
                            "body": "How much faster is that than Nether?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "effreti",
                                    "body": "Quite a lot faster since it is timed and you just rush boss arenas. I forget the timer of the top of my head but it's probably like 15 min",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Dan3rz86",
                    "body": "i dont know how far up it you need to be to get the quest, as i was rank 11 when i got it, but you are better having 12 as the quest itself requires level 12",
                    "score": 15,
                    "replies": [
                        {
                            "author": "Trevorzky",
                            "body": "You can get the quest much earlier (I was rep 6), my question was how to get to twelve fast as it seems slow as hell",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "Dan3rz86",
                                    "body": "Court of Blades seems to be the fastest way, or spamming the first nether boss if you can get to it quickly. just dont forget to pick up the essences you find as theyre worth 20, and every little helps",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "jizzle12",
                    "body": "Expert nether first boss farm gets you 131 rep per completion",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Oblivionix129",
                            "body": "13 bosses in court gives 209. Easy 10-12mins right there",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "notarealfakelawyer",
            "body": "> The chest in question is the jump puzzle one in the hidden alcove.\n\n“Do you have any idea how little that narrows it down”",
            "score": 479,
            "replies": [
                {
                    "author": "Psyduckdontgiveafuck",
                    "body": "In the trenchway, narrows it down a lot. It's across from the solar shard spawn I assume.",
                    "score": 112,
                    "replies": [
                        {
                            "author": "notarealfakelawyer",
                            "body": "I was just going to do both because most people don’t know about the other jumping puzzle, I assumed this one too but it’s always good for people to be detailed & include screenshots!",
                            "score": 23,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Oblivionix129",
                    "body": "Trenchway. Go to the area where you have to pick and escort that solar crystal and look at the area behind the spawn point of it. There's alot of open space. Pull up your ghost and follow the hidden platforms up to a secret room with things in it.\n\nEdit: in the left side of that room there's a claw thing yellow button whatever. Activate that to open a portal. Go thru that and yoink the right side chest. It should give you the heavy spine fragment (or whatever exotic mission thing). Take this back to slab to exchange for \"A hammers path\".\n\nStep 1 of it - must be rank 12 with path of ambition (and have all the tome upgrades)\n\nStep 2: complete expert nether with shotgun, dyad (and something else) equipped. [Unsure if it can be 1 encounter or it has to be all 3. Also unsure if we can damage with whatever and switch to required weapons as boss dies or that EVERY weapon damage instance must be done with one of the 3 required weapons]\n\nStep 3: get (xyz) caty. I'm still on step 1 of this so idk. A buddy of mine is on step 2 and we all want to catch up to him\n\n\nThanks for coming to my TED talk",
                    "score": 37,
                    "replies": [
                        {
                            "author": "Tempo_Delta",
                            "body": "In addition to this, there is a panel on the left-wall of the room. You hold interact on it and it opens a portal.\n\nIf you've seen the \"You are found lacking\" tablets around the Nether, its ones of those.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "ivdown",
                                    "body": "Strange, I'm there and nothing dropped from either chest. What could I be missing?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "jaymdubbs",
                                            "body": "this happened to me.  \"rites of the deep tithe found lacking\" even though I am  level 12 on both",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "AdMediocre8212",
                                                    "body": "That has to do with completing the Act’s questline. We had one from the first act we could open up once we completed that Act’s story quest line",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "jaymdubbs",
                                                            "body": "figured it out.  needed to grab the drop from the ogre on the opposite side of the pit after lighting the three torches by the waterfalls, spawns an ogre",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "AbsoluteAgonyy",
                                                                    "body": "Can't light the torches, there's no option to",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "BifJackson",
                                                                            "body": "You might have to reload. There's 2 different variations of each location. You got the wrong one.",
                                                                            "score": 7,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "AbsoluteAgonyy",
                                                                                    "body": "Alright this did work, I was able to kill the ogre and got the drop it had. However it still says I'm lacking anyways, so at this point I'm probably gonna give up honestly",
                                                                                    "score": 6,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "BifJackson",
                                                                                            "body": "Are you caught up with all the seasonal quests?",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "AbsoluteAgonyy",
                                                                                                    "body": "Yeah I am, I've done the barrow dyad quests so far and the first catalyst too. I've also gotten the 8 tithing wormspawns too if that matters at all",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "BifJackson",
                                                                                                            "body": "Are you at max rank for write of ambition?",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "AbsoluteAgonyy",
                                                                                                                    "body": "I'm not but I've seen people getting it at as low as rank 7 so I don't think this affects whether you're found worthy or not",
                                                                                                                    "score": 3,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "MercuryTapir",
                            "body": "alternatively, swing your happy ass up that slanted wall with a sword.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Pockyboy420",
                            "body": "This always lead to a dead end for me ?? Maybe it’s different now lol",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "kharzianMain",
                            "body": "This was the advice I was looking for",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "SuperHarrierJet",
                            "body": "I'm rank 10 and I was able to pick it up",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Crazy_Kai",
                    "body": "Sounds like the hole in the wall that mimics the king's fall raid wall chest",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "d13w93",
                    "body": "Batman Beyond reference!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "PenSquare4482",
                    "body": "Up the invisible platforms by where you pick up the crystal",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "notarealfakelawyer",
                            "body": "That is very not true.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "360GameTV",
            "body": "Thanks for sharing! Unfortunately you need rang 12 to continue at the Path of Ambition :(\n\n/e made a short video about the start of the quest in Trenchway (Final step missing because need rang 12)\n\nhttps://www.youtube.com/watch?v=PPHvhdSWJPQ\n\nAccording to some people the last step is\n\n* Complete a Nether expert run with the Barrow-Dyad and in the other slots only Swords, Glaives or Shotguns",
            "score": 99,
            "replies": [
                {
                    "author": "Dan3rz86",
                    "body": "for me it says i need the last upgrade which is at rank 12, ive currently just turned to rank 11, so picking it up is doable, completing it for me is not just yet.",
                    "score": 21,
                    "replies": [
                        {
                            "author": "360GameTV",
                            "body": "I'm at 6 but I don't grind it now. Thats not a good quest design for me, if you ask me. I will get in the next weeks without grind.\n\nAccording to some people the last step is\n\n* Complete a Nether expert run with the Barrow-Dyad and in the other slots only Swords, Glaives or Shotguns\n\nNot sure if true but sounds like that",
                            "score": 31,
                            "replies": [
                                {
                                    "author": "Dan3rz86",
                                    "body": "i agree, helpful the little essences drop everywhere, but its a shame they only give 20 rep a time, to be honest, i only spammed court as i wanted to get most of the title meta done asap.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Shanethesoultrain",
                    "body": "It's you! You  have helped me and many of my friends out for challenges and triumphs. If Aztecross gets Shaw Han to represent him, you need a vendor based on you. We all love you and appreciate your help throughout destiny 2.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Winterbite-Enjoyer",
                    "body": "Oof. That nether expert with double special and a sword is going to *SUCK*",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Dan3rz86",
                            "body": "its single special, you need barrow equipped too.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Ragingpsoriasis",
                                    "body": "Last restricted loadout quest step you could just swap right at the end to the required weapons. I have to assume that this isn’t any different…",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "AShyLeecher",
                                            "body": "Just did it and can confirm you can just swap weapons at the end",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Oblivionix129",
                                            "body": "Do you need to do all 3 encounters of expert nether? Or just one of the three",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Winterbite-Enjoyer",
                                    "body": "Oh okay, sorry I thought since he didn't mention it that it was a different challenge this time",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Dan3rz86",
                                            "body": "im pretty sure all of them will require Barrow equipped, since thats the weapon youre getting the catalysts for",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Mwp401",
                            "body": "Barrow, a glaive, and a flash counter strand sword on your Strongholds Titan. Walk around invincible and blind/unravel everything",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Mtn-Dooku",
                            "body": "Arc Titan + Stronghold = EZ",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Winterbite-Enjoyer",
                                    "body": "Wait.\n\nDoes stronghold work with glaives now. I've just been using it with a flashcounter sword",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Mtn-Dooku",
                                            "body": "No. But you use a glaive or a sword. Just use sword, Barrow-Dyad and some energy slot shotgun.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "404-User-Not-Found_",
                                            "body": "> Does stronghold work with glaives now.\n\nIt doesn't but glaives don't really need stronghold.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "aaronwe",
                            "body": "get two people, sit in the first boss arena, go eat some lunch, when timer is done, complete the first boss...\n\ndone.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "just_a_timetraveller",
                                    "body": "I believe you have to do the Nether and not the court.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Brys_Beddict",
                    "body": "Always goated",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "404-User-Not-Found_",
                    "body": "> Complete a Nether expert run with only Swords + Glaives and Shotguns\n\nstronghold enjoyers rejoice!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Dan3rz86",
                    "body": "The last step is entirely true, Expert Nether with Barrow dyad, and sword/glaive/shotgun ONLY",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "dinodares99",
            "body": "tithe found lacking. Am I missing something?",
            "score": 20,
            "replies": [
                {
                    "author": "Bran-Muffin20",
                    "body": "Probably finish the story quest. The same \"Tithe found lacking\" message was there for the thing in the Mausoleum that opens the portal to the two bonus chests until you finished the Act 1 quest",
                    "score": 11,
                    "replies": [
                        {
                            "author": "AbsoluteAgonyy",
                            "body": "I finished the quest this week and it still says tithes found lacking. I'm assuming it must be tied to rep or something since I'm only rank 9 on the path of ambition (I have also done panic response iv and the high impact reserves catalyst)\n\nedit: saw a video of someone getting it at rank 7. Not sure anymore then. Also tried loading it on expert and it says the same thing, also doesn't work if you complete the entire area encounter and go back either\n\nedit2: Saw the comments here saying that lighting the 3 torches near the platform with the waterfalls spawned an ogre with a drop that would unlock the portal. I was able to do this and got the drop the ogre had, but it still says I'm lacking. At this point I'm assuming it's bugged or something honestly",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Bran-Muffin20",
                                    "body": "Huh. I just now went in on normal mode, with Barrow-Dyad equipped. Killed the ogre just to be safe, but he didn't drop anything (I mean, there was the minor boon and the chest like usual, but nothing special). Went up to the room and my tithe was worthy.\n\nFor what it's worth, I've unlocked everything in Act 2. Rank 12 in Ambition, bought all the Court of Blades upgrades for sigil shards, unlocked all the upgrades for dunking at the totem at the end of Court.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "GaZzErZz",
                                    "body": "I was rank 3 and could open the portal to get the exotic quest.\n\nI picked up the item in this weeks seasonal missions. If i remember correctly, it was after doing the shrine of oryx bit",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Rider-VPG",
                                    "body": "It's tied to the tithing (glowy white) wormspawn collectibles. You need 3. \n\nI'm rank 3 with Ambition and 11 with Resolve, and managed to get the quest to drop while doing the story for this week.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "AbsoluteAgonyy",
                                            "body": "I got all 8 of these and still have the same issue, so I don't think it's this either",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Rider-VPG",
                                                    "body": "They only started showing up today and you need to be following Ambition to get them.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "AbsoluteAgonyy",
                                                            "body": "I'm a little confused then, I am following the path of ambition and I've gotten the 8 tithing wormspawns (not sure if all 10 are possible to get?). They're part of the Ambitious Collector triumph right? I am 8/10 on that",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "Rider-VPG",
                                                                    "body": "Yeah those ones. That is weird then.\n\nGrabbing both worms in Trenchway unlocked it for me.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Dan3rz86",
                            "body": "I dont think its quest related, more rep related, as i managed to access it before finishing this weeks quest.",
                            "score": -5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "just_a_timetraveller",
                    "body": "Ok figured it out.\n\nI started looking for more secrets in the area. Found a worm, and some secret area. The one that opened up for me is that at the opposite end of this area there is a platform with water features. There are 3 torches to light. One that is by a door and then when you go across to the watery area, there are 2 more torches to light.\n\nThis spawns a taken ogre. Kill him and he drops some random item. After that I was able to interact with the tithe thing.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "dinodares99",
                            "body": "I can't interact with the torches on that side of the map. Where did you find the worm?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "AbsoluteAgonyy",
                                    "body": "I found a worm next to the torch across from the platform with the water but it didn't do anything. Also can't light any of the torches either. Lighting the 3 other torches that are far right of the tormentor boss room and killing that taken doesn't count either, still says lacking\n\nedit: after reloading a lot I finally got a variation(?) that let me light the torches. Killed the ogre, got the item that it dropped... and it still says I'm lacking. At this point I think it has to be bugged honestly, I've gotten all the worms in trenchway too",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "dinodares99",
                                            "body": "Yeah that worm was just a tithing wormspawn. Why is this so goddamn opaque bungie.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "just_a_timetraveller",
                                            "body": "I think you may need to uncover more secrets in the area. There is a hidden chest that spawns nearby the invisible platforms. So basically go towards to claw room but look right and there is a floating solid platform. Jump on that and take out your ghost for more invis platforms. You end up climbing the wall and entering a tunnel that leads to the chest.\n\nSo 3 things total i did\n\nFind tithe worm\n\nSecret chest from climbing the wall\n\nLighting 3 torches by water area to spawn taken ogre",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "zurk78",
                            "body": "This worked for me. Thnk",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Greel89",
                            "body": "Interesting. So the people who spawned the portal with no issues either were \"bugged\" and accessed without doing this part or just did it without realizing it was a necessary step?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "just_a_timetraveller",
                                    "body": "I think the latter. Depending on how much secret exploration done prior to this step would determine if you were \"worthy\" or not",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "WonderfulOpinion",
                            "body": "That worked for me",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "sh1dLOng",
                            "body": "This DID NOT work for me. I'm rank 12 in both paths, finished the story for the week. Collected all the worms. Had barrow dyad equipped. Killed the ogre you mentioned. Still says tithe lacking.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "McGoonathan",
                    "body": "Same thing here. Wondering what I need to do",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Dan3rz86",
                            "body": "well i managed to access it doing the next part of the weekly quest.\n\nIt may help im quite far into both Path of Resolve and Ambition like r12 on the first and  11 on the newest afaik, but i hadnt tested previously, so that may be the deciding factor perhaps?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "McGoonathan",
                                    "body": "Which path were you on when you were able to access it?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Dan3rz86",
                                            "body": "the second one, which is ambition i do believe",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "McGoonathan",
                                                    "body": "Ok thanks. Not sure what the problem is then! Appreciate the post though",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "No-Pomegranate-5883",
                                                            "body": "You probably haven’t progress the path far enough to be allowed in.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "McGoonathan",
                                                                    "body": "I’m rank 12 and 10. Still isn’t showing up",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "No-Pomegranate-5883",
                                                                            "body": "It might be like the other portals on those switches. They randomly work. They’re not guaranteed access. And, just to be sure, you’ve claimed all the items on the track?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "McGoonathan",
                                                                                    "body": "Maybe, but I’ve been to the room 8-10 times now and never have access. I’ve claimed all the items from the Ambition track up to level 10 (and all the Resolve ones up to 12). Only thing I haven’t done is purchase the last couple upgrades from the Court of Blades.\n\nI’ve also done the ogre, claimed all the worms, and done all the secrets in the area (plus most of the other secrets in the nether)",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "No-Pomegranate-5883",
                                                                                            "body": "Rapidly approaching the point where the only answer left is there’s yet another bug in a progression quest.",
                                                                                            "score": 3,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "McGoonathan",
                                                                                                    "body": "Seems like it to me at this point",
                                                                                                    "score": 2,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "ScoobyStu95",
                                    "body": "I’m only rank 7 and I was able to get the portal to open, I had barrow equipped at the time also\n\nEdit: Actually I just checked and I’m rank 12 resolve and rank 6 ambition",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Greel89",
                                            "body": "To counter, I'm also rank 7 in ambition path, with barrow dyad equipped (with catalyst), and portal will NOT open for me.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "ScoobyStu95",
                                                    "body": "Interesting, what’s your rank in path of resolve? And which did you have on at the time?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "just_a_timetraveller",
                    "body": "Same. Just curious, are maxed out on your reputation at the slab?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "dinodares99",
                            "body": "Maxed on Resolve, but not the new one. Do I need to do that?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Mysterious-Major8822",
            "body": "normalize taking screen shots",
            "score": 101,
            "replies": [
                {
                    "author": "bojanged",
                    "body": "Normalize being thankful for what you get and not always wanting more.",
                    "score": -80,
                    "replies": [
                        {
                            "author": "garfcarmpbll",
                            "body": "What a silly comment lmao. \n\nSure the one you responded to was rude but yours is straight up sad. ",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "bojanged",
                                    "body": "Lol whatever, everyone on here is so fucking whiny, buddy said exactly where it was, how is that not good enough? Guess y'all never graduated from picture books.",
                                    "score": -20,
                                    "replies": [
                                        {
                                            "author": "garfcarmpbll",
                                            "body": "Normalize self awareness. ",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "bojanged",
                                                    "body": "Working on it.",
                                                    "score": -14,
                                                    "replies": [
                                                        {
                                                            "author": "DerKaiserXIII",
                                                            "body": "Work harder.",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "bojanged",
                                                                    "body": "Why? I could just wait for someone to post a video of how to do it and then just do exactly that.",
                                                                    "score": -3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "GearHeadMeatHead",
                    "body": "Not everybody can easily take screenshots and upload them if they're on consoles.",
                    "score": -51,
                    "replies": [
                        {
                            "author": "Caedus116",
                            "body": "Bro what???? Console literally has a DEDICATED screenshot button on the controller",
                            "score": 38,
                            "replies": [
                                {
                                    "author": "GearHeadMeatHead",
                                    "body": "The upload part though.",
                                    "score": -33,
                                    "replies": [
                                        {
                                            "author": "DrkrZen",
                                            "body": "There's a button for that, too.",
                                            "score": 19,
                                            "replies": []
                                        },
                                        {
                                            "author": "slaphappyhobo",
                                            "body": "Upload part is easy dude. Use the damn app for the console",
                                            "score": 11,
                                            "replies": []
                                        },
                                        {
                                            "author": "Caedus116",
                                            "body": "Mobile app, PC gamebar, OneDrive. There's a dozen option to upload screenshots and game clips from Console",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "DrSmook1985",
                            "body": "Yes they can.  Very easily.  All you need is your phone and your console.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": -20,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "ZoeticLock",
                                                    "body": "Some people just can’t fathom being wrong",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Mastershroom",
                                                    "body": "No slurs.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "Phantatos",
                                                            "body": "I didn’t say a slur.",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "Mastershroom",
                                                                    "body": "Yes you did. Don't do it again.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Phantatos",
                                                                            "body": "Tell me the slur, because I didn’t say one.",
                                                                            "score": -1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Dan3rz86",
                    "body": "Sorry, i apologize for not taking you a screenshot, when id rather actually play the game myself?",
                    "score": -79,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "Dan3rz86",
                                    "body": "no wonder people say the community is toxic. While ive had good responses and bad responses to this post, my only intention was to give people the location they can start the next part of the quest, the fact im being attacked for not including a screenshot is ridiculous.",
                                    "score": -26,
                                    "replies": [
                                        {
                                            "author": "DrSmook1985",
                                            "body": "pointing out the flaws in your excuses isn’t toxic.",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "Centila",
                                            "body": ">acts rude\n\n>people call them on it\n\n>\"no wonder people say the community is toxic!\"\n\nmany such cases! the sad thing is, this community IS pretty fucking toxic, but in this specific instance you replied with snark to a pretty basic request",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "VacaRexOMG777",
                            "body": "Yet you took the time to stop playing and make a post on reddit 😭",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Mysterious-Major8822",
                            "body": "well i went to the only portal i know of in the trench way and nothing, so a screen shot of the area its found would have been great it takes 1 button to SS something.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "gingerpower303006",
                            "body": "It takes 2 seconds and anyway you posted about it, not very hard to take the 5 minutes to get a screenshot of the proper location so people aren’t wondering where to go",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Dan3rz86",
                                    "body": "as others have described in this post, the main jumping section in the trenchway is where you need to be near the flame crystal escort start, its not exactly that hard to find.",
                                    "score": -13,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "DrSmook1985",
                            "body": "You had time to make a post about into on Reddit and retroactively take the screen shots.  Literally 30 seconds.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "wanderingwilbs",
                            "body": "I want to thank you for posting where I can start the quest because I probably wouldn't have found it myself. Clear description of the location so easy to find for when I play tomorrow. \n\n(This reads like sarcasm, but it actually isn't! Now I know where to get the dang quest!)",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Aaqry",
            "body": "I'm already ranked 12 with ambition and that hidden portal still says i lack offering despite doing the latest act quest \n\n\n[Shaping slab rank + ambition](https://i.postimg.cc/QNJkHqzp/195aadf4d6620-screenshot-Url.jpg)\n\n\n[Rites of the deep tithe still lacking](https://i.postimg.cc/sgQh9PTH/195aadf6f8968-screenshot-Url.jpg)\n\n\nI'm gonna assume lots of trolls or genuinely just bugged - it better be bugged cause a 5-10 minute quest to last the whole week is kinda just stupid, downtime + an extended hour just for what we have currently is meh",
            "score": 9,
            "replies": [
                {
                    "author": "CrisisBurger",
                    "body": "Ditto",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Supz3ro",
                    "body": "Do you have 8 tithing worms that are found in the Nether when on the path of ambition? I’m trying to see if that unlocks the “Rites of the deep tithe”",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Rider-VPG",
                            "body": "It does, you need 3 of them. The first one to unlock the path of ambition and 2 more found in the nether.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "just_a_timetraveller",
                    "body": "You have to find more secrets in the area. It eventually worked for me",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "benjimima",
                    "body": "It’s definitely the ogre thing - I’m also rank 12 on both, have all the available collectibles and still ‘lacked offering’. After reading about the ogre, I just kept loading in until I could interact with the 3 columns (one of the secrets in the area so it’s not active in every instance) as soon as I could and got the ogre to spawn, it dropped the offering and I was straight through.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Aaqry",
                            "body": "That's the thing, the ogre is a part of the resolve secrets only way to interact with the 3 pillars is by running path of resolve (tithe requires ambition) and I had gotten that ogre awhile ago \n\n\n-edit: I had just not long before this summoned and killed that ogre again for the millionth time, the questline / activation for alot of people is bugged bungie needs to address this.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "AbsoluteAgonyy",
                                    "body": "I actually did get the ogre to spawn while on the path of ambition which did give me the coalescence of sorrow drop (I think there's just variations of the area where some of them don't let you interact with the torches). Unfortunately this didn't help, and even after getting all 8 tithing wormspawns it still says I'm found lacking. At this point I'm just gonna hope I can get someone else to open the portal or something if they aren't bugged",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Rider-VPG",
                    "body": "Go find the glowy white worms. They're what everyone is missing.",
                    "score": -2,
                    "replies": [
                        {
                            "author": "Aaqry",
                            "body": "I got all available 8 - so many useless suggestions floating around with no real fix unless you're genuinely missing things; I have all available secrets, worms and objectives completed - I'm sure bungie is well aware of the issue and hopefully fixes this bug soon.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Mahertian220",
            "body": "Esoterikk has a video showing how to get there. No one seems to know about the lacking tithe, I’m looking all over rn",
            "score": 5,
            "replies": [
                {
                    "author": "Rider-VPG",
                    "body": "Glowing Worms.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "Mahertian220",
                            "body": "Are those separate from the initial 8?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Rider-VPG",
                                    "body": "Yes. They only show if you have Ambition selected. 2 in each zone, they're white.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "Mahertian220",
                                            "body": "Those are the ones I’m talking about. I have those.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Rider-VPG",
                                                    "body": "Try having a ritual active in the tome of want",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Bran-Muffin20",
                                                            "body": "Doesn't matter. I got it with no ritual active",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "sh1dLOng",
                            "body": "No. I have all of them and still am lacking",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Wormboy23",
            "body": "Just to comment. You don’t need a high rank. I noticed when doing my explore in the nether that there was 3 more glowing tithing worms. One in each area I was in. Which was court of oryx area, the fount, and finally the trench way. After I gathered them the tithing switch was able to be used.\n\nEdit: I was also like rank 2 on my path of ambition",
            "score": 4,
            "replies": []
        },
        {
            "author": "DJ_Immortal_UK",
            "body": "I’m found lacking despite maxing out both resolve & ambition, having all 8 worms on each path, being up to date on the week 2 story, having unlocked all scrolls, killed the ogre (in multiple instances)… I have no idea what else there is",
            "score": 3,
            "replies": [
                {
                    "author": "Equivalent_Region842",
                    "body": "I'm there too literally at a loss",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "EaroRS",
            "body": "I'm rank 8 in the Path of Ambition but discovered that investigating the [3 totems](https://imgur.com/HT7Rjqe) by the Taken doorway spawns an Ogre. Killed that & it dropped something of Sorrow. Went to the chest and was able to access the Tithe.\n\nEdit: Added image of totem locations.",
            "score": 6,
            "replies": [
                {
                    "author": "ivdown",
                    "body": "I did this, I lit the totems on the main side of trenchway and killed that captain. I still can't get this thing to work. I am fully leveled up and did everything to this point that needed to be done. No idea why this won't work",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "just_a_timetraveller",
                    "body": "This is what did it for me",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "StuuPendous",
                    "body": "This worked. Thank you!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dan3rz86",
            "body": "Also for the record, i DID have Barrow equipped when i got the item",
            "score": 6,
            "replies": [
                {
                    "author": "Legitimate_Push_6253",
                    "body": "Do u know what catalyst is this week",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Dan3rz86",
                            "body": "Unfortunately not, as i need to be rank 12 to progress the exotic quest any further",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Legitimate_Push_6253",
                                    "body": "Last weeks quest I thought said it on the bottom of the quest in screen. Could be wrong tho",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Dan3rz86",
                                            "body": "it says im on 2/3 path of ambition upgrades unlocked on step 1/2 of the quest. the only thing left from the path i need is rank 12, i assume it would show me after getting the next step but as of yet i dont know.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "Legitimate_Push_6253",
                                                    "body": "Ok thx. I might’ve remembered last week wrong then",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Rider-VPG",
                            "body": "Hatchling",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Smoking-Posing",
            "body": "Thanks",
            "score": 2,
            "replies": []
        },
        {
            "author": "bigredking",
            "body": "Next step is expert nether with dyad and only swords, shotguns, or glaives.",
            "score": 2,
            "replies": [
                {
                    "author": "bigredking",
                    "body": "And catalyst is hatchling refit.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "bigredking",
                    "body": "And there is a Intrinsic Upgrade V, not related to the catalyst quest.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "jagwaguar",
                            "body": "Sorry, how do you get Panic Response V?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "conceptualfella11",
            "body": "Is that one chest available yet? Tithe found lacking?",
            "score": 2,
            "replies": [
                {
                    "author": "Equivalent_Region842",
                    "body": "It is but pretty sure rank has to be above 6 to do it. There's 3 posts that need lit to kill and ogre to drop a thing you need ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "conceptualfella11",
                            "body": "Damn that’s it? EZ PZ. And you mean vendor rank?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Equivalent_Region842",
                                    "body": "And be caught up on the story",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "conceptualfella11",
                                            "body": "Check and check. I’ll load in after work and see. Thanks!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Equivalent_Region842",
                                    "body": "Yeah I'm only rank 6 and im not worthy yet lol",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "CrotasScrota84",
            "body": "Sounds like a wait until all quests are out then complete",
            "score": 2,
            "replies": []
        },
        {
            "author": "Electronic_Highway71",
            "body": "Unfortunately, I was one of the unfortunate souls who dismantled their uncrafted gun thinking I could simply craft it later. Until I can actually craft a new weapon, I’m out from the questline here.",
            "score": 2,
            "replies": [
                {
                    "author": "dejexus",
                    "body": "Pretty sure this was fixed with todays patch yeah?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Electronic_Highway71",
                            "body": "(runs immediately to the enclave)",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Electronic_Highway71",
                            "body": "Omg 😳 it was. I’m sorry for pooping on this party (crawls into a hole to never return)",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MFA_Nay",
            "body": "I'm going crazy. \n\nHow many tithing worms are there now exactly? On the Ambitious Collection triumph for heresy it says I'm on step 2 out of 3. which is 8/10 worms. So I'm guessing 18 worms in total so far?\n\nI've also killed the Ogre in the Trenchway x3 already on nether explore. I'm rank 12 on both paths.",
            "score": 2,
            "replies": []
        },
        {
            "author": "SeVIIenth",
            "body": "The post I've been waiting for. Legend.",
            "score": 5,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "author": "Dan3rz86",
                    "body": "id like to think so, its an exotic quest. not sure which just yet though as i lack the rep to find out :)",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "eddmario",
            "body": "You're referring to the room with the 2 chests, right?",
            "score": 1,
            "replies": [
                {
                    "author": "Dan3rz86",
                    "body": "the one you have to take the hidden blocks on, with two chests and a portal activate, yes, the item is through the portal, or atleast was for me.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "yuochiga93",
            "body": "Joining someone who could open the portal did it for me :/",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hoockus_Pocus",
            "body": "Which perk is it?",
            "score": 1,
            "replies": []
        },
        {
            "author": "gitgudred",
            "body": "I enjoyed the little grind, and hatchling is crazy good.",
            "score": 1,
            "replies": []
        },
        {
            "author": "platinumdubb",
            "body": "If you have an issue with lacking rites, kill the subjugator that is randomly roaming in the landing area.  I had the same issue, and after I killed him, and took his dropped, it progressed",
            "score": 1,
            "replies": [
                {
                    "author": "Teampunk5",
                    "body": "I changed mine to path of resolve and was able to finally get it to work after kill ogre",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dawg605",
            "body": "I opened both chests inside the portal and both chests inside the room where you turn the portal on and didn't get any shard or quest. All I got was some Coalescence of Something.\n\nEDIT: Looks like you may have to have Barrow-Dyad equipped when opening the chest. I'll try that.\n\nEDIT 2: Apparently it went to my Postmaster the first time and I didn't realize. So I don't think you need Barrow equipped to get it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DrSmook1985",
            "body": "No screenshots or video.  Thanks for the vague descriptions. /s",
            "score": -4,
            "replies": [
                {
                    "author": "Bran-Muffin20",
                    "body": "there's only one jump puzzle to a hidden alcove in the trenchway dawg",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ImmediateBowl7048",
            "body": "The quest disappeared from my warlock. Hoping it’s patched to come back. Can’t seem to find a way to reacquire it",
            "score": 1,
            "replies": []
        }
    ]
}