{
    "title": "Rushdown Boss Rotation - 18th March",
    "author": "Bennijin",
    "subreddit": "DestinyTheGame",
    "rank": 3,
    "score": 141,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 16,
    "url": "https://www.reddit.com/r/DestinyTheGame/comments/1jefmq7/rushdown_boss_rotation_18th_march/",
    "id": "1jefmq7",
    "selftext": "1.  Ahamkara Illusion  \n2.  Nightmare of Kethiks, Grief Unforgiven (the one with the scythes)  \n3.  The Machinist  \n4.  Valus Dralgur, the Exiled (three dampeners guy)  \n5.  Voice of Riven (Forsaken meatball)",
    "comments": [
        {
            "author": "OldboySamurai",
            "body": "This set of bosses is easiest one I've done on expert so far.",
            "score": 114,
            "replies": [
                {
                    "author": "PinkieBen",
                    "body": "Damn, of course it has to be the day I can't really play lol",
                    "score": 26,
                    "replies": []
                },
                {
                    "author": "Ready_Geologist2629",
                    "body": "Good to know! Might give it a whirl tonight.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "DMYourDankestSecrets",
                    "body": "Fits with last week, first day was the easiest. I think they are intentionally making it rise in difficulty as the week goes on. Which i like.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "pm_me_ur_anything_k",
            "body": "Maybe I can get the stupid flawless requirement done on this.",
            "score": 18,
            "replies": [
                {
                    "author": "may_or_may_not_haiku",
                    "body": "It's really easy today.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "blackdog2077",
            "body": "Most tame rotation since day 1. Voice of Riven hits hard, avoid any of its attacks as much as possible and switch to void resistance if you’re running other elements for prior bosses",
            "score": 43,
            "replies": []
        },
        {
            "author": "BC1207",
            "body": "Thank you I was looking for this",
            "score": 8,
            "replies": []
        },
        {
            "author": "NotoriousCHIM",
            "body": "I'll never understand why they thought it was a good idea to include The Machinist in this mode.\n\nA boss with more than 4 immunity sequences in a mode that revolves around quickly burning down bosses. Some of the other ones I can understand since they usually involve a quick mechanic to do, but Machinist is literally just \"Gonna immune every 5 seconds because fuck you, that's why\"",
            "score": 23,
            "replies": [
                {
                    "author": "jaytothen1",
                    "body": ">I'll never understand why they thought it was a good idea to include The Machinist in this mode.\n\nSame with the Ahamkara.\n\nI hate that fight. Two seconds were I can do damage and that damn gargle sound it makes just infuriates me.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "DMYourDankestSecrets",
                            "body": "If you're a warlock, with geomags, if you can pop your chaos reach right before the damage window (so right at the end of the spewing bullshit attack), your chaos reach will last through 2 of his attacks and you will blast that whole chunk of health off with your one super. It's pretty nice, and there are enough adds to get your super back before the next round.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Dangerous_Flower3646",
            "body": "Ngl we need more new bosses in the rotation",
            "score": 7,
            "replies": [
                {
                    "author": "Blaze_Lighter",
                    "body": "It's been a week, I think we've seen all the new bosses by now. \n\nI'm not upset, there's a good number of them and there's variety for sure. But I wouldn't hold out hope that Bungie's secretly hiding Panoptes from Curse of Osiris to release on some random March 20th rotation.",
                    "score": 44,
                    "replies": [
                        {
                            "author": "blackdog2077",
                            "body": "It’s unobtainable, lost in legacy game builds according to Bungie. As is all the pre-Forsaken story content. They’d have to remake the encounters from the ground up.",
                            "score": -20,
                            "replies": [
                                {
                                    "author": "silentj0y",
                                    "body": "Forsaken was also vaulted for the same reason as the rest- and we have the Machinist encounter.\n\nThey had to have put work into that to get it working in the new engine, even if it was only a little bit. So I wouldnt say it's 100% unobtainable- but they would have to put work into it- and sadly GG is only a three week long event. \n\nMaybe next year we'll get a few more fights.",
                                    "score": 14,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ThyUniqueUsername",
            "body": "Stronghold op.  If I'm up there holding attention just fucking shoot it.\nEdit inb4 just do damage yourself, I'm out damaging half the people I play with even with stronghold...",
            "score": 1,
            "replies": []
        }
    ]
}