{
    "title": "LoK Mystery of Penquan Island - Official Discussion Thread",
    "author": "MrBKainXTR",
    "subreddit": "TheLastAirbender",
    "rank": 1,
    "score": 13,
    "upvote_ratio": 0.86,
    "num_comments (reported by reddit)": 12,
    "url": "/r/legendofkorra/comments/1j2v35r/mystery_of_penquan_island_official_discussion/",
    "id": "1j30lbv",
    "selftext": "",
    "comments": [
        {
            "author": "Randver_Silvertongue",
            "body": "Pretty good. It was nice to see that detail with Mako and Bolin's mother and the story highlighted a lot of Mako's character and growth. My only problem was that the comic should have been longer.",
            "score": 16,
            "replies": []
        },
        {
            "author": "Ready_Chocolate8516",
            "body": "Pales in comparison to the rage Katara showed against her mother’s killer compared to Mako and Bolin. I’m disappointed :/ \n\nArt was gorgeous though 10/10.",
            "score": 6,
            "replies": []
        },
        {
            "author": "lnombredelarosa",
            "body": "Seeing the avatarverse equivalent to a neo nazi community was interesting.\n\nAlso I just realized that Mako and Bolin’s mom was a lot like Korra.\n\nI would’ve enjoyed seeing the Fire neonazis reaction to seeing an earthbender produce something hotter than their fire.",
            "score": 6,
            "replies": [
                {
                    "author": "Hydrasaur",
                    "body": "I agree, it would have been cool to see him react to Bolin lavabending.\n\nI'd probably compare Penquan Island more closely to the neo-confederate towns of the deep south, though. I think the sheriff was a fairly direct analogy to towns like that, where the sheriffs often have a lot of power, they're wary of outsiders, and the town tends to glorify the days of the Confederacy.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "lnombredelarosa",
                            "body": "They both match though I’d argue their putting mass murderers on a pedestal, their paramilitary tendecies and connection to criminal groups feel more neonazish, though then again neo nazis aren’t necessarily german and they tend to be anti establishment rather than overtly traditional so you might’ve a point.\n\nThe Agni Kais might be closer to Neo Nazis.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Hydrasaur",
                                    "body": "I actually think the idolization of the wartime firelords was a pretty close analogy to the way that neo-confederates glorify confederate leaders, such as Robert E. Lee and Jefferson Davis.\n\nI wouldn't say the writers were trying for perfect analogies, of course, though there are a number of neo-confederate paramilitary militias as well. I think the Sheriff's triad connection was just thrown in as a convenient plot device to enable his murder of Naoki without his direct involvement, and to explain why they believed it was a triad mugging for so long.\n\nAs for the Agni Kais, they just seem like an ordinary gang/mafia to me. Many do have a strong degree of ethnic exclusivity (ie. gangs and mafias don't usually recruit members from other ethnic groups), but usually aren't ideological like neo-nazis are. That said, the triads haven't really been explored very much.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "lnombredelarosa",
                                            "body": "Well personally, I always figured their parents were involved with the triads which would’ve explained why they were eventually taken in by them (I haven’t seen republic city hustle) but I don’t feel this guy being connected to the Agni Kais feels forced. Their naming themselves after a grueling dueling system that scarred a ruler they hate would make sense.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Hydrasaur",
            "body": "I liked it. Could have been longer, but it was good. Bolin and Mako finding out about where their mother was from and that their parents were really killed by the sheriff and not a random mugger was a neat addition. I liked that they turned Penquan Island into the equivalent of one of those neo-confederate towns in the deep south.",
            "score": 7,
            "replies": []
        },
        {
            "author": "CrystalThrone11",
            "body": "Charming little brotherly tale!",
            "score": 4,
            "replies": []
        },
        {
            "author": "AtoMaki",
            "body": "This was an okay comic. The pacing and the Mako-Bolin dynamic were great, but the story was kinda flat and the dialogue was often corny. I also didn't expect Pakku's sexist angle to show up. But Mako used lightningbending! That's something. Even though the following conversation between him and the villain guy sidesteps the whole thing despite a fairly relevant story being in there. I guess Mako thought it was too awkward to reveal he learned lightning generation from a mob boss who took him in from the streets.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Tuskin38",
            "body": "Great story. I didn’t even know this was coming out \n\nThere’s a minor speech bubble error at the end, pointing at Mako and not the person it was intended to come from",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -2,
            "replies": [
                {
                    "author": "ChemicalExperiment",
                    "body": "Men can love too",
                    "score": 3,
                    "replies": []
                }
            ]
        }
    ]
}