{
    "title": "I will never get how some people hate aang",
    "author": "JazlynSweet",
    "subreddit": "TheLastAirbender",
    "rank": 16,
    "score": 1956,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 91,
    "url": "https://i.redd.it/pztccs2zmbpe1.jpeg",
    "id": "1jdoyil",
    "selftext": "",
    "comments": [
        {
            "author": "Zairy47",
            "body": "Who the heck hates Aang?",
            "score": 349,
            "replies": [
                {
                    "author": "hummingbird_mywill",
                    "body": "Kids who watched Caillou and were cursed to hate bald children to the end of their days.",
                    "score": 230,
                    "replies": [
                        {
                            "author": "BitterMechanic546",
                            "body": "why do people hate Caillou, i grew up with that show.",
                            "score": 35,
                            "replies": [
                                {
                                    "author": "Honeyfoot1234",
                                    "body": "Whiny toddler who teaches kids to disrespect people and to cry until you get what you want",
                                    "score": 66,
                                    "replies": [
                                        {
                                            "author": "BitterMechanic546",
                                            "body": "but its a kids show no need to hate him because he is a dumb kid",
                                            "score": -26,
                                            "replies": [
                                                {
                                                    "author": "Honeyfoot1234",
                                                    "body": "but he’s caillou",
                                                    "score": 46,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "ILikeCheese510",
                                                    "body": "Bro there's a subreddit called r/fuckcaillou, you ain't gonna change anyone's mind.",
                                                    "score": 41,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "BA_TheBasketCase",
                                    "body": "Because caillou himself is a selfish brat most of the time, but the show is meant to help kids realize that. Like every episode I watch while my daughter watches, caillou is a little brat and whines whenever he doesn’t get his way, throws tantrums when his toddler sister does anything, then his parents or whoever teaches him why it’s wrong. It’s the whole point of the show. He’s still a brat, but like, he’s a kid learning not to be one.",
                                    "score": 23,
                                    "replies": []
                                },
                                {
                                    "author": "mondaymoderate",
                                    "body": "r/fuckcaillou",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "ConditionEffective85",
                                    "body": "Cause it kind of teaches kids that if you complain you'll get what you want.",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "ImpGiggle",
                                    "body": "That show was so gentle. I needed it as a kid.",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "BitterMechanic546",
                                            "body": "yeah",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "ImpGiggle",
                                                    "body": "I do wonder if that's why it was hated. It wasn't made with ugly animation and filled with wacky nonsense. It had gentle life lessons and imparted good values. Like Aang. He's naive, and his philosophy only works because he has the power to back it up, but that was kinda the point. Great responsibility and all that. So I think people who don't value empathy and kindness hate those kinds of shows and characters because all they feel is annoyance at something they don't understand. Possibly can't. Which is sad.",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "hummingbird_mywill",
                                                            "body": "Because he’s whiny af. I realize toddlers are like that IRL, I just finished raising one (he’s 5) and I’m about to head into it again with the baby, but there’s enough of it in real life. I feel like little kids mimic what they see more than put 2 and 2 together and learn the lessons that are taught. For the same reason Peppa Pig is banned in our house, it typically ends up with kids acting up.",
                                                            "score": 8,
                                                            "replies": [
                                                                {
                                                                    "author": "ImpGiggle",
                                                                    "body": "That sounds... Like a lack of discussion and introspection regarding your children's consumption of media. \n\n\"Wow I liked the blue dog, what do you think he learned today?\" \n\n\"Let's get our word wiggles out with this phrase, but if we use it too much we can't watch this show for a week. Too much of a good thing is bad.\"",
                                                                    "score": -2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "hummingbird_mywill",
                                                                            "body": "Nothing wrong with any blue dogs I know of… big fans of Bluey, Blues Clues, and Tumbleleaf. I don’t see the point of showing my child programs of kids misbehaving. He copies what he sees and likes having good role models.",
                                                                            "score": 6,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "ImpGiggle",
                                                                                    "body": "Kids do react to stuff differently.",
                                                                                    "score": 0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "BitterMechanic546",
                                                            "body": "yeah, couldn't have said it better myself",
                                                            "score": 2,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Responsible_Push1085",
                                                            "body": "Very well said. It made me realize why I often dislike the “nice guys” in shows and movies. I wouldn’t say I don’t understand or value empathy, but for me in some cases, the ends justify the means and I feel Aang could’ve avoided some situations if he wasn’t so opposed to doing the “hard thing”",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "ImpGiggle",
                                                                    "body": "This I agree with! It's very toned down because it's a kid's show. There's potential political reasons why not killing Ozia was a good idea, at least not right away. But overall he worked way to hard to please people who just wanted to use him, like the villagers being attacked by a spirit, and I feel his journey to adulthood would have to include him learning what his past selves were trying to say, or least acknowledging that others fighting alongside him will *have* to do some dirty work. But a better version of what his past selves did, one still tempered by his dedication to his people's morals. A difficult road but one he has the power to follow, it'd be a very good story. \n\nYa know, like how Superman being so good is important *because* he's so powerful.",
                                                                    "score": 4,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "wishiwasfiction",
                            "body": "😂😂😂",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "AustraliumHoovy",
                            "body": "DON’T COMPARE HIM TO THAT QUEBECOIS FUCK",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "MikolashOfAngren",
                            "body": ">cursed to hate bald children\n\nNumbuh One from KND shows up and suddenly it's reversed.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "HAZMAT_Eater",
                    "body": "They don't usually show up on this sub. But Tumblr is where they spew their bile.",
                    "score": 46,
                    "replies": [
                        {
                            "author": "mondaymoderate",
                            "body": "How can you be a fan of the show and also hate Aang that doesn’t make any sense",
                            "score": 32,
                            "replies": [
                                {
                                    "author": "Jacobloveslsd",
                                    "body": "It’s gotta be the azula stans",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Historical_Bunch_927",
                                            "body": "Azula is one of my favorite characters on the show, but Aang is my other favorite. \n\n\nI think the Aang hate mostly comes from intense Zutara shippers. ",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Medical_Barracuda_87",
                            "body": "Is this a joke? Tumblr is still alive?",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "Jamz64",
                            "body": "One of the many reasons to avoid Tumblr.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "HAZMAT_Eater",
                                    "body": "But where else do I go for the Azulaang drugs?",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Alexpander4",
                                            "body": "Hmmm. I don't know if you're joking about that ship existing but either way I don't like it.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "hroaks",
                    "body": "Fire Lord Ozai, Wan Shi ton,  Zhao",
                    "score": 10,
                    "replies": [
                        {
                            "author": "seth1299",
                            "body": "“I suppose that counts.”",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DaenysDreamer_90",
                    "body": "Zutaras",
                    "score": 33,
                    "replies": []
                },
                {
                    "author": "topsincity",
                    "body": "People who think he’s should’ve killed Ozai, Korra stans, shippers of a certain ship, people who think he’s not masculine enough compared to the other boys.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "Express_Order_1421",
                    "body": "TBF there is ONE version of Aang i hate. But thats due to M night shamalamadingdong fucking the movie.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "adil228",
                            "body": "Not Aang, his name is Ong.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "Express_Order_1421",
                                    "body": "Thats Aangs wario",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "tmtmdragon04",
                            "body": "Haha",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Suitcase08",
                    "body": "All my friends to insist that Zutara was the superior narrative direction.  Ok it's a playful hate, but a dead serious ship.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Yogurt_Ph1r3",
                    "body": "Some Korra apologists performatively hate on everything about the original show and Aang is the biggest target",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "AKingQ",
                    "body": "People that say he should put ALL of his enemies on t-shirts.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "KevineCove",
                    "body": "I didn't hate Aang but I found him a bit annoying early on in the season. Nothing against him personally, I think his behavior was pretty normal for a 12 year old, and he predictably matures as repeated trauma forces him to grow up, but I was lukewarm on him for a while.",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "FlimsyRabbit4502",
                    "body": "Yeah the hate is usually aimed at Korra",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "marpocky",
                    "body": "No seriously, OP, this isn't a rhetorical question. Pics or it didn't happen.\n\nAnd if it's some tumblr bullshit, leave it on tumblr.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "OutrageousActuator37",
                    "body": "I wouldn't say \"hate\" but I certainly don't like him.\n\nHis character design and personality are very off putting for me.",
                    "score": -9,
                    "replies": [
                        {
                            "author": "Coco_snickerdoodle",
                            "body": "May I ask why?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "OutrageousActuator37",
                                    "body": "A bald 12 year old boy in dorky looking colorful monk clothes with a huge blue arrow on his head. He looks so akward to me that I can't take him seriously.\n\nHis personality constantly switches between an immature dork and a super wise pacifist monk who is out of touch with reality. Both are character tropes I find annoying.\n\nI know I am getting downvotes for this, but that's how I personally feel about him.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Savings-Big1439",
            "body": "Imagine if someone like Zhao was leading those attacks.\n\nKya/Aang: If I cooperate, will you leave everyone in the village alone?\n\nZhao: Oh yeah, no problem.\n\n(after he gets what he wants)\n\nZhao: Burn these.....do you actually consider these \"houses\"? Doesn't matter, burn them all. Let it be known that if you harbor the enemy, you lose your home.\n\n\\_\\_\\_\\_\\_\n\nNot that Yon Rha was a good guy, but he *did* order a retreat after eliminating who he thought was the last Southern Waterbender.",
            "score": 100,
            "replies": [
                {
                    "author": "MotherSithis",
                    "body": "Imagine if someone like *Zuko* was.",
                    "score": -2,
                    "replies": [
                        {
                            "author": "bamen96",
                            "body": "Zuko also made that deal with Aang and honored it",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "MotherSithis",
                                    "body": "Exactly. Maybe Kya would still be here if someone *like* him had made the deal.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Fox7567",
            "body": "Damn Katara just can’t catch a break",
            "score": 88,
            "replies": [
                {
                    "author": "BitterMechanic546",
                    "body": "who is talking about katara?",
                    "score": -24,
                    "replies": [
                        {
                            "author": "phoenixremix",
                            "body": "Both of them made the sacrifice for Katara I guess?",
                            "score": 48,
                            "replies": []
                        },
                        {
                            "author": "NorthGodFan",
                            "body": "We are. Who did both of them sacrifice themselves for?",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "BitterMechanic546",
                                    "body": "the fricking village, did you read the caption?",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "plogan56",
            "body": "Kya in heaven: Katara please marry this boy at any cost",
            "score": 43,
            "replies": [
                {
                    "author": "HAZMAT_Eater",
                    "body": "Kya: What the hell Katara why are you letting that ashmaker skank steal your man?\n\nhttps://preview.redd.it/db843b96ybpe1.jpeg?width=1639&format=pjpg&auto=webp&s=1d8df45fef3765acd69e5fca8e957c3a9d35f3c1",
                    "score": 12,
                    "replies": [
                        {
                            "author": "Mr-OhLordHaveMercy",
                            "body": "Screw the downvotes this was hilarious to read.\n\nThat being said I love Azula and Aang so I......kinda have no problems with this honestly.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Suitcase08",
                                    "body": "Ozai, get the fire.",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "HAZMAT_Eater",
                                            "body": "Ozai get the marriage certificate, wouldn't you love to have such a powerful and influential son-in-law?",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Mr-OhLordHaveMercy",
                                            "body": "I....I.....I.would not be opposed to a throuple. GET IN HERE OZAI!",
                                            "score": -7,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "PCN24454",
            "body": "Precisely why Katara went back for him",
            "score": 11,
            "replies": []
        },
        {
            "author": "NbfZay",
            "body": "If you hate Aang you aren’t a true fan because what😭???",
            "score": 21,
            "replies": []
        },
        {
            "author": "NoRequirement1582",
            "body": "I think the only real problem people have is the way that he interacts with his environment.\n\n\nBefore the pitchforks, just let me explain. \n\n\nAang is a moral character in a morally deficient setting. The entirety of the world of ATLA(with a few exceptions) operates on a fundamentally different moral grounding than the real world. It is a war torn(if slightly censored by the writers) setting. We see tragedies like the 41st or prison camps like where the earth benders are held.\n\n\nSeeing Aang not fit with that established moral sentiment can sometimes feel unnatural. This, I also think, is what the writers meant to do. Aang IS unnatural. He is the remnant of the pacifist people - the airbenders. \n\n\nThe only problem being, we never get to know that culture, so when other characters(like sokka) make great points about having to kill the fire lord, some people accept it as keeping with the moral character of the world - Aang being the one who is incorrect. \n\n\nThat feeling of being morally correct in our world but morally dubious in the world of ATLA is where the disconnect happens. Aang is moral, and good. The world he lives in isn't. Some people think that the main character should fit the setting instead of being the lone exception.",
            "score": 26,
            "replies": [
                {
                    "author": "Mr-OhLordHaveMercy",
                    "body": "Honestly.....beautifully put. If I had gold, I'd give it.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "JinFuu",
                    "body": "Another argument that you can use against Aang is he picks and chooses what he wants to follow in his own people's teachings. \n\nWhich I mean, a lot of people do in real life, but you go on and on about 'not killing anyone' yet marry someone and start a family, Aang?!? \n\nYou hypocrite! Earthly attachments! Etc.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "exessmirror",
            "body": "There is people who hate on Aang? Never met em. Not even online.",
            "score": 4,
            "replies": []
        },
        {
            "author": "ConditionEffective85",
            "body": "People hate Aang? Blasphemy.",
            "score": 7,
            "replies": []
        },
        {
            "author": "tmtmdragon04",
            "body": "People hate aang?",
            "score": 4,
            "replies": []
        },
        {
            "author": "Calm-Composer5155",
            "body": "Peak",
            "score": 2,
            "replies": []
        },
        {
            "author": "idontwant_account",
            "body": "Look idk what anyone else says but my buddies at the farmers market always told me Aang was nothing but a menace.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Rich_Application6135",
            "body": "There’s people who hate Aang ??? He’s the most lovable character ever !!",
            "score": 4,
            "replies": []
        },
        {
            "author": "Educational_Film_744",
            "body": "Who the FUCK hates Aang?\n\n![gif](giphy|b8RQzkElbBsXqEPF2X)",
            "score": 4,
            "replies": []
        },
        {
            "author": "sirprize_surprise",
            "body": "Who hates Aang?",
            "score": 3,
            "replies": []
        },
        {
            "author": "sirprize_surprise",
            "body": "Who hates Aang?",
            "score": 3,
            "replies": []
        },
        {
            "author": "RealLars_vS",
            "body": "I feel like this post is a reference to some recent events… perhaps a war… with an agressor that won’t stop even if you make a deal with them… that stopping isn’t an option unless you can fully protect yourself… \n\nHmm…",
            "score": 2,
            "replies": []
        },
        {
            "author": "MotherSithis",
            "body": "Sometimes I think people hate Aang because they forget *he's twelve*.\n\nNot even a teenager. A child, with a child-like, kind, idealist view of the world that is taken from you when you aren't raised in a peaceful environment - for example, war!\n\nAang doesn't need to be more like the others. *It's sad that the others can't be like Aang.*",
            "score": 3,
            "replies": []
        },
        {
            "author": "ImNotRealTakeYorMeds",
            "body": "could it be that kya was aang's past life?",
            "score": 1,
            "replies": []
        },
        {
            "author": "joadarium",
            "body": "People hate Aang? Since when?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alarming_Flow7066",
            "body": "I don’t dislike Aang but I do think that the writers did him a massive disservice and the finale is the weakest part of the series.\n\nThey built up a fantastic arc about Aang not only being a pacifist by his nature but also pacifism being the last link to the airbenders. They set up a moral choice between saving the world and maintaining the memory of the airbenders. But they didn’t know how to resolve it so they added an asspull about energy bending. They wanted their massive fight of good versus evil but lost the moral plot. In the end there is still a slight support for the idea that ‘might makes right.’ Ozai lost his might ‘bending’ therefore he lost his right ‘legitimacy’ to be fire lord.\n\nAang at his best was when he ‘fought’ Zhou on the river. He was a pacifist but he as clever and used Zhou’s aggression against him. I would have loved if instead of an isolated canyon. Aang had challenged Ozai in the center of the fire nation and fought in a way that delegitimized Ozai. Ozai’s lack of control and wanton destruction would be unleashed on his own people and he loses legitimacy just as his son returns with the avatar preaching peace and reconciliation. That way Aang’s story isn’t over shadowed by the Agni Kai it’s enhanced by it, all of the elements of Aang’s victory exist in the story from the beginning and the airbender’s way of life process itself ultimately victorious over the fire nation.",
            "score": 0,
            "replies": [
                {
                    "author": "That_Engineer7218",
                    "body": "Ozai's philosophy of might makes right won out in the end. Aang had to overpower Ozai or Ozai had to lose his power, either way the most powerful dictated what was right",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Alarming_Flow7066",
                            "body": "They didn’t have to write it that way. They wanted to have their final shonen battle. But the writers had set up the plot perfectly to be subverted and they missed their shot.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -2,
            "replies": [
                {
                    "author": "Few-Banana-3497",
                    "body": "I mean, Zuko showing mercy to the village is definitely noteworthy when compared to some of his more ruthless Fire Nation contemporaries. What’s wrong with people liking to highlight that?\n\nAlso regardless of whether or not that last bit is true, it’s not like Zuko was acting with the threat of Iroh’s/Aang’s/Appa’s wrath in mind as a deterrent. So that’s a moot point at best",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "Jamz64",
                    "body": "No, but it still stands in contrast to a lot of other villains that Zuko actually keeps his word. One of the first signs he’s not as bad as he initially appears.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "AdOverall7619",
            "body": "Aang is just Caillou but with magic powers",
            "score": -10,
            "replies": [
                {
                    "author": "Mr-OhLordHaveMercy",
                    "body": "Caillou didn't save the world, did he now",
                    "score": 6,
                    "replies": [
                        {
                            "author": "wishiwasfiction",
                            "body": "The most Caillou would do if he were the Avatar is bitch at the Fire Nation and throw a temper tantrum",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}