{
    "title": "Who's Idea Was it that Katara Pretend to be Pregnant?",
    "author": "JetKusanagi",
    "subreddit": "TheLastAirbender",
    "rank": 12,
    "score": 1626,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 86,
    "url": "https://i.redd.it/ihqd3o63xcpe1.jpeg",
    "id": "1jduini",
    "selftext": "Who do you think suggested it? Was it Sokka, Aang, Toph or did Katara think of it herself?",
    "comments": [
        {
            "author": "Sitherio",
            "body": "I'd say Katara. \"How do I look like a mother and older?...PREGNANCY!\" Cause she is still a child physically. Sokka gets away with the beard but Katara doesn't have an easy out like that.",
            "score": 2501,
            "replies": [
                {
                    "author": "KinkyPaddling",
                    "body": "I wonder if it crossed their minds that the headmaster would just chalk up a heavily pregnant girl who’s barely a teenager as just weird, rustic colonial shit (like she’s the same age as some of the older kids in Aang’s school but none of them are married and pregnant, nor are any of the teenagers at Chan’s party). I feel like it’s funnier if they didn’t even consider that, and thought that they were just being brilliant.",
                    "score": 844,
                    "replies": [
                        {
                            "author": "Sitherio",
                            "body": "They absolutely thought they were being brilliant. And I'm sure the \"superior\" FN headmaster just saw that as \"backwater nonsense\", his arrogance blinding him to being tricked by children in bad costumes. Adults aren't stupid or blind (mostly), but some are more easily manipulated.",
                            "score": 513,
                            "replies": [
                                {
                                    "author": "ClassyOod",
                                    "body": "As someone who has worked retail and customer support, I have to disagree with your last statement there",
                                    "score": 170,
                                    "replies": [
                                        {
                                            "author": "Hallowed-Plague",
                                            "body": "honestly the ones that make me want to punch them the most is the \"do you have x?\" as they stand in front of it and would see it if they fucking looked down. i work an ice cream shop, i cannot tell you how many times ive been asked if we have *vanilla*",
                                            "score": 64,
                                            "replies": [
                                                {
                                                    "author": "AleksCombo",
                                                    "body": "I would assume it's not about \"do you have x in your list?\" and more about \"do you have x in the stock right now?\" Unless, in your specific case, your cart is transparent and allows to see all available flavours and how much is still there.",
                                                    "score": 24,
                                                    "replies": [
                                                        {
                                                            "author": "tempralanomaly",
                                                            "body": "I've been that customer, but its usually because for some reason my eyes glazed across that option and I missed it.",
                                                            "score": 17,
                                                            "replies": [
                                                                {
                                                                    "author": "gyroda",
                                                                    "body": "Yeah, you walk in and there's dozens of options, it's not hard to get a little overwhelmed and struggle to pick out a specific flavour.",
                                                                    "score": 4,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Hallowed-Plague",
                                                            "body": "our freezers have a glass cover and a label with the name over each ice cream, it's not even like its a guessing game of \"is this vanilla or some other white ice cream?\"",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "SeanC84",
                                                    "body": "I used to work at a Burger King. It's less stressful to just assume that kind of customer is blind.",
                                                    "score": 6,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Comfortable_Clerk_60",
                                                    "body": "Oh monkey feathers…you’ve given me horrible flashbacks to when I used to work at subway. Seriously people the cheese list is right in front of you!",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "metalflygon08",
                                            "body": "Yeah, but those are not people, those are *customers*.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "santaclaws01",
                                    "body": "It's not so much about stupidity, blindness or being easily manipulated by others. It's that people are slaves to their own biases for the most part. Without active effort, everything we experience is filtered by our subconscious expectations.",
                                    "score": 11,
                                    "replies": []
                                },
                                {
                                    "author": "WontTellYouHisName",
                                    "body": ">  Adults aren't stupid or blind (mostly), but some are more easily manipulated.\n\nGeorge Carlin: \"[T]hink of how stupid the average person is, and then realize that half of them are stupider than that.\"",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "BatmansDietitian",
                            "body": "Well there’s a lot of baby faced people who look at least a decade younger than they are. Take Nicola Coughlan who makes a convincing teenager even though she’s in her thirties. What I’m saying is I wouldn’t question someone I assumed to be an adult just because they look a lot younger, it’s the mannerisms that would give them away more like and Katara was quite a professional mom here “oh my, that doesn’t sound like my Kuzan”",
                            "score": 64,
                            "replies": [
                                {
                                    "author": "geek_of_nature",
                                    "body": "Katara was always great at committing to the bit too.",
                                    "score": 33,
                                    "replies": [
                                        {
                                            "author": "AleksCombo",
                                            "body": "June Pippinpaddleopsicopolis, nice to meet you! 👋",
                                            "score": 20,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Independent-Couple87",
                            "body": "This reminds me of how in Dragon Ball, Goku and Chi Chi were 19 years old when Gohan was born. \nAnd they live in the rural area.",
                            "score": 36,
                            "replies": []
                        },
                        {
                            "author": "Szygani",
                            "body": "> they were just being brilliant.\n\nYou mean the minds that came up with Wang Fire and Sapphire Fire weren't absolute galaxy brains",
                            "score": 21,
                            "replies": []
                        },
                        {
                            "author": "3z3ki3l",
                            "body": "Nah. They were posing as the parents of a twelve year old. The youngest they could reasonably be, even if we make it kinda disgusting, is 24-25. \n\nYounger than that is possible biologically, but not reasonably common. He certainly didn’t think they were teen parents, though.",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "StubbyHarbinger",
                            "body": "But aang is 12 how would she have a 12 year old",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SleepingDragons57",
                    "body": "Did they show Sokka putting the beard on? Always wondered how he got an absolutely perfect fake beard, especially when the last time anyone attempted fake facial hair was Pippenpaddelopsicopolis",
                    "score": 33,
                    "replies": [
                        {
                            "author": "Cucumberneck",
                            "body": "\"Ok Sokka you can take off the beard now. \"\n\n\"No i can't, i used super glue.\"\n\nI always thought that he used Appas hair again and died it.",
                            "score": 30,
                            "replies": []
                        },
                        {
                            "author": "Gabcard",
                            "body": "Sokka can actually just spontaneously grow a beard whenever he wants to.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "goat-stealer",
                    "body": "They should have gotten her a beard as well, such an obvious fix smh\n\n/s",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Evrant",
            "body": "Her pregnant bulge is a disguised pouch of water she'll fight with, just in case!",
            "score": 669,
            "replies": [
                {
                    "author": "JetKusanagi",
                    "body": "That would actually be pretty smart. I never thought of that.",
                    "score": 210,
                    "replies": [
                        {
                            "author": "Evrant",
                            "body": "Enemies will sure be surprised when her water breaks!",
                            "score": 184,
                            "replies": [
                                {
                                    "author": "AutisticPenguin2",
                                    "body": "![gif](giphy|ac7MA7r5IMYda)",
                                    "score": 63,
                                    "replies": []
                                },
                                {
                                    "author": "CJohn89",
                                    "body": "Een Fire Nation colonies, water break *you*!",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TiredPlacebo",
                    "body": "Or is it Toph?",
                    "score": 49,
                    "replies": [
                        {
                            "author": "Golden-Sun",
                            "body": "Ok this is my headcanon",
                            "score": 31,
                            "replies": []
                        },
                        {
                            "author": "Evrant",
                            "body": "XD she gives birth to Kuzon's sister if things go south",
                            "score": 26,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Midnightdreary353",
                    "body": "This is my new headcannon",
                    "score": 88,
                    "replies": [
                        {
                            "author": "Garr_Incorporated",
                            "body": "Careful with your armaments. A head cannon can blow your mind.",
                            "score": 19,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "sirprize_surprise",
                    "body": "“My water broke!”\n*ice daggers to the eyes*",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "BananaBladeOfDoom",
                    "body": "But can actual pregnant waterbenders break their water and use it to fight",
                    "score": 20,
                    "replies": [
                        {
                            "author": "DrPikachu-PhD",
                            "body": "Can they break their water and induce their own labor? 🤔 Have the baby on their terms?",
                            "score": 32,
                            "replies": [
                                {
                                    "author": "whetherwaxwing",
                                    "body": "Doing this on oneself sounds scary but doing it on others must be a standard part of a waterbender-midwife skill set.",
                                    "score": 31,
                                    "replies": [
                                        {
                                            "author": "starwalker327",
                                            "body": "honestly that's probably one of the things the girls taking the healing class learned (eventually) in the northern water tribe",
                                            "score": 19,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "burnt_romances67",
                                    "body": "They can't break the amniotic sac with water bending ",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "THE_F0REVER_MAN",
            "body": "Probably Toph. Remember when she insulted her with that 'motherly' remark?",
            "score": 202,
            "replies": [
                {
                    "author": "EthanTheJudge",
                    "body": "Yeah, there is no way Sokka would even consider that idea and Aang is too kind to do that to his crush. ",
                    "score": 80,
                    "replies": []
                }
            ]
        },
        {
            "author": "Few-Conclusion-483",
            "body": "Ah yes, Wang and Sapphire Fire. The Fires. This scene always cracks me up 🤣🤣",
            "score": 148,
            "replies": [
                {
                    "author": "SevenSixOne",
                    "body": "One of the comics has a great story where \"Wang Fire\" enlists in the Fire Nation army as a spy and immediately gets in over his head",
                    "score": 73,
                    "replies": [
                        {
                            "author": "TheOncomimgHoop",
                            "body": "And they fake his death and he is remembered as a hero of the fire nation",
                            "score": 23,
                            "replies": [
                                {
                                    "author": "Low_Course_6195",
                                    "body": "Yea, that part cracked me up!",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "depressedpotato777",
            "body": "Probably Sokka, without thinking about it too much, or Katara. I'm sure they thought having a pregnant women in their group disguise would make them seem less threatening or can use multiple excuses from said 'pregnant lady' if they needed to, \"oh, remind me what happened last week, I've gotten so forgetful during this pregnancy\", \"ooh, I'm feeling faint, don't look over there\" etc. Etc. Etc.",
            "score": 106,
            "replies": []
        },
        {
            "author": "Animedingo",
            "body": "I always joke Toph is in there",
            "score": 63,
            "replies": [
                {
                    "author": "Ibuprofen_Idiot",
                    "body": "https://preview.redd.it/8ahvhyt2adpe1.jpeg?width=583&format=pjpg&auto=webp&s=b384626707d25ac3d78c97aed2f9ecde98d6de99",
                    "score": 21,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ibuprofen_Idiot",
            "body": "Sokka: \"Come on! I've got a beard! It'll make you look more like an adult!\"\n\nKatara: \"Fine but I still think this is a really weird idea.\"",
            "score": 33,
            "replies": []
        },
        {
            "author": "Its-your-boi-warden",
            "body": "I agree with the idea over analyzing avatar had that it was in order to make it too socially awkward to comment on how young they looked like \n\n“I’m suspicious but they already have another one so it’d be weird to comment.” But in general is just a disguise addition like Sokka’s beard",
            "score": 24,
            "replies": []
        },
        {
            "author": "Willing-Book-4188",
            "body": "They were at least more believable acting wise in this scene verse when Katara got arrested for “earth” bending. So at least they’re learning?",
            "score": 18,
            "replies": []
        },
        {
            "author": "Historyp91",
            "body": "Wow, Mrs Fire looks like a teen despite having a son whose a decade plus old. What's her secret?",
            "score": 14,
            "replies": [
                {
                    "author": "halfbakedhiking",
                    "body": "It’s that famous pregnancy glow everyone talks about! It does wonders for the skin",
                    "score": 14,
                    "replies": []
                }
            ]
        },
        {
            "author": "KpopFashionistasRise",
            "body": "Lmao, why’d I read the title and think it said Katniss 😭 I was scratching my my head like “why would Sokka be talking to Katniss?”",
            "score": 30,
            "replies": []
        },
        {
            "author": "RadTimeWizard",
            "body": "Either way, Katara's obviously okay with it or she wouldn't have done it.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Haunting_Test_5523",
            "body": "Sokka for sure came up with the idea and then Aang jumped on board",
            "score": 14,
            "replies": [
                {
                    "author": "JetKusanagi",
                    "body": "Sokka came up with the idea of his sister pretending to be impregnated by him? Lol",
                    "score": -26,
                    "replies": [
                        {
                            "author": "Haunting_Test_5523",
                            "body": "Being fake pregnant for their cover story? Sure.",
                            "score": 52,
                            "replies": []
                        },
                        {
                            "author": "marshenwhale",
                            "body": "I think the reason they assumed Sokka was because he seemed the most obsessed with the disguises and even gave Katara a pun for a name so it makes sense if the whole thing was his idea.",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "Historyp91",
                            "body": "You saw how small there village was.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "metalflygon08",
                                    "body": "And it IS the *Southern* Water Tribe...",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Little-bad-witch",
                            "body": "How else were they going to make it more believable?",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Goodbyepuppy92",
                            "body": "They're kids. They weren't thinking that in-depth about it. Don't make it weird.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MiaCutey",
            "body": "Where do you see Katara? I only see Kuzon, Wang and Sapphire Fire",
            "score": 6,
            "replies": []
        },
        {
            "author": "janieebug",
            "body": "That's Toph under there! 😂",
            "score": 3,
            "replies": []
        },
        {
            "author": "metalflygon08",
            "body": "I assume it was so they could smuggle things they might need on the off chance things went South and they'd have to fight and escape.\n\nA skin of water, Boomerang, some snacks, Momo, everything you'd need to make a daring escape.",
            "score": 3,
            "replies": []
        },
        {
            "author": "EnycmaPie",
            "body": "Katara will start touching her necklace and talk about how her mother used to be pregnant.",
            "score": 8,
            "replies": []
        },
        {
            "author": "AnthonyDayByDavis",
            "body": "![gif](giphy|7FyMQm2vBiTjG|downsized)\n\nVince was visiting the office that day.",
            "score": 4,
            "replies": []
        },
        {
            "author": "R1ch0999",
            "body": "things to consider: \n\nthe time period Avatar was portrayed in is the dark ages where it was common for people to start marrying after they begin puberty, as life expectancy wasn't as high as it is now.\n\nIn hollywood we still get people aged 20-30 acting like 16-18 years old and pulling it off.",
            "score": 2,
            "replies": []
        },
        {
            "author": "anotherlonelypoet",
            "body": "This ATLA scene was pretty funny though 😂😂😂",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ill_Pie7318",
            "body": "It could be her own idea.. kids sometimes do shit like this just for fun..",
            "score": 2,
            "replies": []
        },
        {
            "author": "Tommy5796",
            "body": "While it's meant to be a gag, but I do think that when Aang brought the news to his friends Toph dared Katara to do something over the top with it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "goldfishgold",
            "body": "It's the easiest way to sell her as a mother",
            "score": 2,
            "replies": []
        },
        {
            "author": "berserkzelda",
            "body": "The animators",
            "score": 2,
            "replies": []
        },
        {
            "author": "Garo263",
            "body": "*whose",
            "score": 5,
            "replies": [
                {
                    "author": "Yer-Real-Da",
                    "body": "Nobody cares bro. We all got what they meant.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Carbon-Base",
            "body": "So, this is how melon lord started out...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fairlibrarian101",
            "body": "My question is, what did she use to make it convincing??",
            "score": 1,
            "replies": []
        },
        {
            "author": "Little-Efficiency336",
            "body": "Probably Sokkas; he probably thought it’d be funny.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sagerunes",
            "body": "Isn’t it Momo under?",
            "score": 1,
            "replies": [
                {
                    "author": "JetKusanagi",
                    "body": "That would be super risky lol\n\n\"Excuse me Mrs Fire, is your baby....trilling?\"",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "VerbingNoun413",
            "body": "She just had a big lunch.",
            "score": 1,
            "replies": [
                {
                    "author": "JetKusanagi",
                    "body": "Literal food baby",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Oryzanol",
            "body": "The writers obviously. Its a gag, Sokka has a beard, Katara is doing what women do, no need to over analyze it.",
            "score": -1,
            "replies": []
        }
    ]
}