{
    "title": "They really said “copy and paste”",
    "author": "ramcee_",
    "subreddit": "TheLastAirbender",
    "rank": 3,
    "score": 9109,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 234,
    "url": "https://i.redd.it/ywr4kq05agpe1.jpeg",
    "id": "1je4zeb",
    "selftext": "",
    "comments": [
        {
            "author": "AlianovaR",
            "body": "To be fair that last one was very intentional",
            "score": 3027,
            "replies": [
                {
                    "author": "umarmg52",
                    "body": "Bro Nickelodeon almost brought me to tears when that episode aired, by far the best scene in LOK",
                    "score": 1100,
                    "replies": [
                        {
                            "author": "avicado_toast",
                            "body": "Almost?? Damn you got tear ducts of steel, I’m at 10+ rewatches and never not once have I gotten through that scene without sputtering like a baby lol",
                            "score": 284,
                            "replies": [
                                {
                                    "author": "TumbleWeed75",
                                    "body": "I've watched LOK as much as you have and I have tear ducts of steal. LOL. However, that scene always makes me smile.",
                                    "score": 40,
                                    "replies": []
                                },
                                {
                                    "author": "AlexVal0r",
                                    "body": "Mine must be made of titanium then, I wasn't even close to crying.",
                                    "score": -32,
                                    "replies": [
                                        {
                                            "author": "armoured_bobandi",
                                            "body": "People are obsessed with over exaggeration online.\n\nYou're going to sit there and tell me you cry multiple times watching the finale of a kids cartoon?",
                                            "score": -25,
                                            "replies": [
                                                {
                                                    "author": "TreesBeesTeas",
                                                    "body": "You say that like it's a bad thing..?",
                                                    "score": 22,
                                                    "replies": [
                                                        {
                                                            "author": "armoured_bobandi",
                                                            "body": "Going online and telling everyone that you ball your eyes out every time you watch this episode, while not harmful, is obviously a lie.",
                                                            "score": -36,
                                                            "replies": [
                                                                {
                                                                    "author": "Daring_Ducky",
                                                                    "body": "This is a rather strange hill to die on bud",
                                                                    "score": 13,
                                                                    "replies": [
                                                                        {
                                                                            "author": "armoured_bobandi",
                                                                            "body": "Oh no, downvotes 😱",
                                                                            "score": -9,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Infinite-Effort-3719",
                                                                                    "body": "People think they're so tough when they leave comments or edits like this. You just look like a baby.",
                                                                                    "score": 8,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "armoured_bobandi",
                                                                                            "body": "👍",
                                                                                            "score": -1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "Beneficial-Fold-8969",
                                                                                    "body": "You're so cool",
                                                                                    "score": 2,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Hunderweurd",
                                                                    "body": "Ah yes, the old 'I don't do that so no one else does that either' mentality",
                                                                    "score": 6,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "moneyh8r_two",
                                                                    "body": "*bawl\n\nA ball is an object, not an action.",
                                                                    "score": 6,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "TreesBeesTeas",
                                                                    "body": "It isn't a lie, and not everyone has the same emotional sensitivity.",
                                                                    "score": 15,
                                                                    "replies": [
                                                                        {
                                                                            "author": "armoured_bobandi",
                                                                            "body": "Of course it's a lie. Nobody reading this actually believes it. They either just want to participate in the conversation, or like me, jump in and say how ridiculously fake it is.\n\nPeople lie on the internet constantly. Maybe open your eyes and think for a moment. Are **all** of these people just bawling their eyes out every time they rewatch this?\n\nOf course they aren't, that would just be silly",
                                                                            "score": -21,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "LumpyJones",
                                                                                    "body": "Man i tear up at awesome fight scenes, or sad moments, or even funny moments and I'm a dude in his 40s. It's fine if you don't but it's weird as hell that you think no one else does.",
                                                                                    "score": 19,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "armoured_bobandi",
                                                                                            "body": "Do you tear up every single time you watch them? Which is what I'm talking about?\n\n>It's fine if you don't but it's weird as hell that you think no one else does.\n\nIt's weird as hell to pretend a children's cartoon finale makes you bawl your eyes out every single time you watch it",
                                                                                            "score": -5,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "LumpyJones",
                                                                                                    "body": "Some scenes have emotional impact on people. I don't know why that's hard for you to wrap your head around, but it's true. It's wild to me that you hear someone describe their own emotions and your reaction is \"no way you're lying\"",
                                                                                                    "score": 10,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "armoured_bobandi",
                                                                                                            "body": "Okay, so you just can't read. Let me single out the important part.\n\nDo you tear up **EVERY SINGLE TIME YOU WATCH THE SAME SCENE OR EPISODE**\n\nI know reading can be hard, but I have been very specific about what I've been talking about. People over exaggerating online to elicit a response. I have never said a scene can't have an emotional impact on people. I said you aren't watching the same scene over and over again and having the exact same response.\n\nIt's a bunch of people that just want to sit in an echo chamber barking the same thing back and forth forever",
                                                                                                            "score": -2,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "LumpyJones",
                                                                                                                    "body": "Yes I do. On some scenes at least. Sometimes they resonate with me, or relate to something in my own life. The weird part is that you seem to care so much that someone else has a specific reaction to a specific scene, and you are just like, dug in, defiant that anyone could possibly feel like that. It's weird man. Like, whats at stake for you here that you need to argue this so much?",
                                                                                                                    "score": 8,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "armoured_bobandi",
                                                                                                                            "body": "There is nothing at stake. I enjoy calling out obvious lies from sad people with nothing better to do. You all attend this clown and pony show. I point and laugh with the rest of the people that don't tell lies for attention.\n\nLike, this has got to be one of the most pathetic things to lie about. \"I've watched this kids cartoon 1000 times, and I still cry every time\"\n\nAhh, the classic reply and immediate block. You desperately want the last word, but you know I'll reply, so you block me after making your comment to make it seem like I can't respond.\n\nCongratulations, you've completely proven my point",
                                                                                                                            "score": -1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "LumpyJones",
                                                                                                                                    "body": "I feel like if we're calling out sad habits, you don't really have a strong foot to stand on there. Seems like a waste of time and energy.",
                                                                                                                                    "score": 8,
                                                                                                                                    "replies": []
                                                                                                                                },
                                                                                                                                {
                                                                                                                                    "author": "Uber_Ober",
                                                                                                                                    "body": "Jesus Christ dude, reread your comments. Not everyone has the same experiences as you. Really weird hill to die on.",
                                                                                                                                    "score": 8,
                                                                                                                                    "replies": []
                                                                                                                                },
                                                                                                                                {
                                                                                                                                    "author": "lovegirls2929",
                                                                                                                                    "body": "\"sad people with nothing better to do\"? Talk about projecting, fucking hell man.",
                                                                                                                                    "score": 3,
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "TreesBeesTeas",
                                                                                    "body": "I'm sorry you're so pressed about this, but I am serious when I say that this show gets me emotional every time I watch it. And I think that's a really special thing. What's sad is not being able to get emotional over your favorite shows. Plus, I don't see the point in lying on an anonymous board for clout. \n\nAnyway, I hope your day gets better, stranger.",
                                                                                    "score": 13,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "armoured_bobandi",
                                                                                            "body": "I never said I don't get emotional over shows, I said people don't watch the same episode multiple times and just bawl their eyes out. It just doesn't happen\n\n>Plus, I don't see the point in lying on an anonymous board for clout. \n\nPeople that lie online always say \"well why would somebody tell lies like that online?\"\n\nFor the same reason they tell lies IRL. Because they are bored, and they crave attention",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Wheeeeellsss",
                                                                                                    "body": "\"It just doesn't happen\" it does, and real people are telling you otherwise. I don't really cry when sad things happen in my life (or in this case a tv show), but that doesn't mean other people don't cry as well.",
                                                                                                    "score": 9,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "armoured_bobandi",
                                                                                                            "body": "No, it doesn't. It's a bunch of people that want to fit in with a group so they all tell each other how they can't stop crying when they rewatch an episode.\n\nThe first time? Okay, I get it. The second time, maybe it's really impactful. The third time? You're just lying for attention.\n\nThere is nothing you or anybody else can say that will change your mind. It's obvious to anybody that doesn't play the \"omg I cry everytime\" game",
                                                                                                            "score": -1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Wheeeeellsss",
                                                                                                                    "body": "You have no idea what people do, they could cry every time they lift the toilet seat. calling people crying watching a show impossible and saying they do it for attention is so out of touch that I think you need to breath some fresh air, and stop watching fox news. You don’t need to change my mind, you need to re-evaluate yours.",
                                                                                                                    "score": 5,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "armoured_bobandi",
                                                                                                                            "body": ">You have no idea what people do\n\nThat's right. What I do have a great idea of, because I see it every single day online, is people telling obvious lies for attention.\n\n>calling people crying watching a show impossible\n\nThat's not what I said at all. Learn to read.\n\n>that I think you need to breath some fresh air, and stop watching fox news.\n\nNo wonder you can't read, you're American. Here's a news flash for you Uncle Sam. There is an entire world outside of your country. What a goof you are 🤣\n\n>You don’t need to change my mind, you need to re-evaluate your\n\nMake me",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "Spazzymcgee1990",
                                                                                                                                    "body": "Maybe get off the Internet for a couple days",
                                                                                                                                    "score": 5,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "armoured_bobandi",
                                                                                                                                            "body": "Nah, I don't think I will actually",
                                                                                                                                            "score": 0,
                                                                                                                                            "replies": []
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                },
                                                                                                {
                                                                                                    "author": "TreesBeesTeas",
                                                                                                    "body": "And I never accused you of it, dude. But obviously, you don't have any problem accusing me of lying, which is kinda weird, ngl. I get what you're trying to say, but I'm just being honest about my personal experience, which invalidates your claim. Anyway... peace",
                                                                                                    "score": 5,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "armoured_bobandi",
                                                                                                            "body": ">And I never accused you of it, dude. But obviously, you don't have any problem accusing me of lying, which is kinda weird, ngl\n\n**What's sad is people not being able to get emotional over their favorite shows**\n\nThat was obviously aimed at me, seeing as it was a direct response to me saying people don't cry every time they watch a specific episode.\n\n> get what you're trying to say,\n\nThen what am I trying to say?\n\n>but I'm just being honest about my personal experience, which invalidates your claim. Anyway... peace\n\nNah, I don't think you are. I think you want random strangers to believe you, so you're telling inconsequential lies that don't matter if you're telling the truth or not.\n\nIf you sit down right now and watch that episode, will you cry? If you watch it immediately after, are you going to cry again? How many times can we repeat the process?",
                                                                                                            "score": -1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "TreesBeesTeas",
                                                                                                                    "body": "Not gonna read all that, so congrats or my condolences. But have a blessed day",
                                                                                                                    "score": 5,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "armoured_bobandi",
                                                                                                                            "body": "Aww, you're parroting the hot new way to reply to people. It couldn't be that you don't actually have any argument at all, so despite you having read the comment, you're going to pretend you didn't.\n\nJust like you pretend to have a mid life crisis everytime you watch the finale to LOK.\n\nYou aren't crying your eyes out everytime you watch the finale. You just aren't",
                                                                                                                            "score": -1,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "MayoBaksteen6",
                                                                                    "body": "Idk what you're on but it's not a lie. I for certain can recognize tears on my own cheeks",
                                                                                    "score": 4,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "None",
                                                                                    "body": "[deleted]",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "armoured_bobandi",
                                                                                            "body": "For the same reason you can't get the same high from doing the same drug over and over again. \n\nThat's not how it works. It's called diminishing returns.\n\nIt is literally impossible to elicit the same level of reaction by repeating the same event over and over and over",
                                                                                            "score": 0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ErectPotato",
                            "body": "Makes me cry every time\n\nI always think about how her father Tenzin’s ceremony would have gone. With only one airbender (Aang) able to conduct the ceremony. Jinora’s ceremony is the first time Tenzin’s ever seen a “full” ceremony with all the airbneders needed. It’s the first time it’s happened in almost 200 years. Its hearwrenching to think of all the years of Tenzin being the only master airbender in the world for so long and finally being there to see them airbenders being brought back from extinction and the weight being lifted from his and his family’s shoulders",
                            "score": 51,
                            "replies": [
                                {
                                    "author": "umarmg52",
                                    "body": "Never really thought about it this way lol, knowing Aang was dead and then seeing him once again in his granddaughter was just so emotional for me",
                                    "score": 16,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "OneWholeSoul",
                            "body": "Ending your Nickelodeon cartoon's season on a shot of the main character crippled and crying silently on what should be one of the happiest, most vindicating days of her life is a fucking ***choice.*** *Actual* respect to the writers and director for having the nerve. Honorable mention to Season 1 essentially ending in an onscreen murder-suicide with *absolutely* no magic or plot shenanigans to soften the reality of it. Dude just... reached over and killed them both.",
                            "score": 27,
                            "replies": [
                                {
                                    "author": "CatAteMyBread",
                                    "body": "It cannot be stated enough how brutal of a choice season 3s ending was, and how good the beginning of season 4 is because of it.",
                                    "score": 12,
                                    "replies": []
                                },
                                {
                                    "author": "tjmaxx501",
                                    "body": "I remember that scene going say crazy back in middle school and it still hasn’t lost the impact. The two being brothers made it sting even more.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Independent_Plum2166",
                                    "body": "The cry. The single tear. I swear to Vaatu that single image is no joke one of the most powerful moments in any form of media. Period.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "DrDingsGaster",
                                    "body": "That was such a good choice. Season 4 wouldn't've been the same without it imo.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "DICKJINGLES69",
                            "body": "I rewatched the whole series and it made me cry again.. it’s a wonderful scene!",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "Naefindale",
                            "body": "What made her a master again?",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "ArcadianBlueRogue",
                                    "body": "Her affinity for entering and manipulating the Spirit World",
                                    "score": 25,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Marcyff2",
                            "body": "Agree on it being one of the best scenes. Lok gets a lot of flak but they did a lot of good things too: wan (my favourite episodes ever of avatar) , azami , bolin (except season2) , 3 out of 4 main villians being excellent....",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "its_all_one_electron",
                            "body": "When they took her hood off I audibly gasped",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "DrDingsGaster",
                            "body": "I cried! Aint ashamed to say so either, that part was a real tearjerker and I was so happy for her!",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Heather_Chandelure",
                            "body": "Wish I could agree, but it just didn't feel earned to me. Jinora hasn't done anything that demonstrates she's deserving of being called a master.",
                            "score": -210,
                            "replies": [
                                {
                                    "author": "starlord97",
                                    "body": "Did you watch the show?",
                                    "score": 123,
                                    "replies": [
                                        {
                                            "author": "starlord97",
                                            "body": "Chat gpt cause I don't wanna type it.\n\n1. **Strong Spiritual Connection** – She had an unmatched natural affinity for the Spirit World, guiding Korra and others with her wisdom.  \n\n2. **Advanced Airbending Skills** – Despite her young age, she demonstrated incredible control, agility, and technique in airbending.  \n\n3. **Leadership and Maturity** – She often acted as a guiding force for her siblings and even adults, showing wisdom beyond her years.  \n\n4. **Key Role in Harmonic Convergence** – She played a critical role in helping Korra enter the Spirit World and later in defeating Unalaq.  \n\n5. **Guiding the Air Nation’s Revival** – She helped locate and guide new airbenders after Harmonic Convergence, reinforcing her importance to the Air Nation.  \n\n6. **Aang-like Qualities** – Her spirituality, kindness, and skill mirrored her grandfather, proving she embodied the ideals of an Airbending Master.",
                                            "score": -218,
                                            "replies": [
                                                {
                                                    "author": "Great_Leather9967",
                                                    "body": "If you can't be bothered to type it we can't be bothered to read it lmao",
                                                    "score": 190,
                                                    "replies": [
                                                        {
                                                            "author": "discord-ohmygoodness",
                                                            "body": "And yet all those statements are accurate and true and proves she deserves the airbender tattoos",
                                                            "score": 30,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "starlord97",
                                                            "body": "I just saw copy-paste, and I thought that's what we were doing.",
                                                            "score": -118,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Internal-Pie-7265",
                                                    "body": "Loser",
                                                    "score": 12,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "PjButter019",
                                                    "body": "Oh you have no capacity to think, crazy. Good luck in life buddy",
                                                    "score": 29,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "rainstorm0T",
                                                    "body": "if I could downvote you twice for using AI, I would.",
                                                    "score": 34,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Heather_Chandelure",
                                                    "body": "Give an actual response, not something an AI made up for you.",
                                                    "score": 54,
                                                    "replies": [
                                                        {
                                                            "author": "starlord97",
                                                            "body": "Did you not even read it?",
                                                            "score": -88,
                                                            "replies": [
                                                                {
                                                                    "author": "Innsjo",
                                                                    "body": "The problem with using Chat GPT to argue a point is that it will always agree with what you say. So even if those points are valid, it isn't considering arguments for the other side.\n\nFor example, I asked it to give me a list of reasons why Jinora *shouldn't* have been given master tattoos, which it provided all of these fairly valid reasons:\n\n\n- **Age & Experience** – Jinora was very young compared to past airbending masters, raising concerns about her readiness.\n\n- **Limited Combat Ability** – While spiritually strong, she lacked advanced airbending combat skills compared to older airbenders.\n\n- **Tenzin's Bias** – Her father, Tenzin, may have influenced the decision due to familial pride rather than pure merit.\n\n- **Unclear Mastery Criteria** – The Air Nation's traditions were disrupted, and the standards for mastery seemed less strict than in Aang's time.\n\n- **Other Candidates Overlooked** – Kai and other new airbenders had potential, yet Jinora was fast-tracked due to her lineage.\n\n- **Symbolism vs. Skill** – The tattoos seemed more symbolic to inspire the new Air Nation rather than a reflection of true mastery.",
                                                                    "score": 18,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Myth_5layer",
                                                                    "body": "No because AI lacks any nuance or actual facts, most of it is generated falsehoods that should be thrown out \n\nYou literally shot yourself in the foot the moment you resorted to ChatGPT. Its not a reliable source, ever.",
                                                                    "score": 47,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Heather_Chandelure",
                                                                    "body": "I'm not reading some AI garbage.",
                                                                    "score": 52,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Eomb",
                                                                    "body": "Why should we bother to read it if you didnt bother to write it?",
                                                                    "score": 11,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "MetalMewtwo9001",
                                                                    "body": "Did you? If you need chat GPT to do your thinking for you I'll bet you need someone to read for you too. Hello there person who reads u/starlord97 's Reddit for them.",
                                                                    "score": 27,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Actual_Archer",
                                                    "body": "I was on your side til you used ChatGPT",
                                                    "score": 13,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "RexNovus",
                                                    "body": "1 hour and past 200 downvoted with your chatgpt talk? This was the fastest downvotes grind I've ever seen.",
                                                    "score": 6,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "LordAsbel",
                                                    "body": "I think this is the only way you could lose a reddit argument where the other person got 165 downvotes lol",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "starlord97",
                                                            "body": "![gif](giphy|kQmr2OwBTD2L5Hzo1T|downsized)",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "starlord97",
                                                    "body": "Yall are just down voting cause you hate Jinora. Super fucked up guys.",
                                                    "score": -25,
                                                    "replies": [
                                                        {
                                                            "author": "Sidicle",
                                                            "body": "Nah, people just don't like AI. Using it here is kind of lazy. I agree with you about Jinora.",
                                                            "score": 48,
                                                            "replies": [
                                                                {
                                                                    "author": "starlord97",
                                                                    "body": "Oh definitely. I understand. I just felt compelled to throw in my 2 cents and am currently hunched over a toilet sick so I didn't want to type a novel. All the points are factual though. I even edited the main points down a lot so it's more of a 50 50 split of the response. \n\nNow it's about my usage of a chat bot instead of the actual point I was making. Classic reddit.",
                                                                    "score": -6,
                                                                    "replies": [
                                                                        {
                                                                            "author": "HotColor",
                                                                            "body": "it’s not ur 2 cents it’s chat gpts.",
                                                                            "score": 35,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "starlord97",
                                                                                    "body": "Uh huh",
                                                                                    "score": -13,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Glass-Work-1696",
                                                            "body": "No, I’m on your side of the arguement, AI is just scum",
                                                            "score": 4,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "JoshuaMaly",
                                    "body": "While I agree it wasn’t “the best scene in LOK,” I would say that she did demonstrate that she deserved being called a master as she ~~invented a new airbending technique~~ mastered the use of an advanced airbending technique (astral projection). Aang achieved his mastery in the same manner by the creation of the air-scooter. Although, if we continue this chain of logic, Meelo should have gained mastery through fart bending (assuming he was the first).\n\nEdit: through reading the wiki, I found out others have done astral projection before Jinora but as far as it’s recorded in the same wiki, she’s the youngest airbender to do so.",
                                    "score": 25,
                                    "replies": [
                                        {
                                            "author": "RecommendsMalazan",
                                            "body": ">through reading the wiki, I found out others have done astral projection before Jinora but as far as it’s recorded in the same wiki, she’s the youngest airbender to do so.\n\nOther people (benders and not) have done spiritual projection, projection their spirit into the spirit world. But to my knowledge no one but Jinora has done astral projection, projecting your spirit into the real world.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "JoshuaMaly",
                                                    "body": "I thought this as well initially, however, an individual by the name [Mangal](https://avatar.fandom.com/wiki/Mangal) used it as a form of communication with nearby villages to the Northern Air Temple during the time of Kyoshi.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "RecommendsMalazan",
                                                            "body": "Ah okay. Yeah I saw that on there, but the wiki didn't seem to differentiate between projection into the spirit world vs real world so I assumed he just did spirit world stuff.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Heather_Chandelure",
                                            "body": "Spirituality is a part of all bending. Even non benders can enter the Spirit world. I disagree that astral projection should be considered an airbending technique.",
                                            "score": -23,
                                            "replies": [
                                                {
                                                    "author": "JoshuaMaly",
                                                    "body": "I didn’t say anything about spirituality. In the cannon of the show, astral projection is explicitly an airbending technique. There is record of other airbenders doing astral projection, however, I think it’s her age (11) that makes her eligible for the title of master, considering how difficult that skill is to perform.",
                                                    "score": 15,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "adrian-alex85",
                                    "body": "This is the most ridiculous LoK take I’ve ever heard, so genuinely thank you for that. It’s rare for me to find a take to very disconnected from any sense of reality. I’d say this was based in sexism given that Jinora is older than Aang was when we first met him and he already had master tattoos no one really questioned, in spite of not seeing what he did to earn them, but… no wait there’s no but, this just smells like sexism to me.",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "umarmg52",
                                    "body": "What did Aang do to earn the title?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "DrPikachu-PhD",
                                            "body": "He earned the title off screen before the show started, by creating a new form (the air scooter) which = automatic mastery. Jinora, meanwhile, had rediscovered the lost art of Astral Projection and guided an actual, full sized tornado in this same episode. She absolutely deserved her tats imo",
                                            "score": 42,
                                            "replies": []
                                        },
                                        {
                                            "author": "-patrizio-",
                                            "body": "Mastered 35/36 tiers of airbending and invented a completely new airbending form (the scooter). \n\nDid Jinora do this, too? Maybe, but if so, they didn't explicitly tell us that. My best guess is she also mastered most if not all tiers of airbending, and then *maybe* they count her technique of making a GIANT tornado with the other new airbenders as a new form? But I can't imagine that hadn't been done before, whereas the scooter is distinct/unique enough that I buy it. \n\nOn top of that, Jinora is almost *constantly* put into \"damsel in distress\" scenarios where she relies on someone else—often someone purportedly less skilled than her, almost ALWAYS a man/boy—to save her. I think they had a lot of really cool ingredients when they made her character, but they executed it poorly most of the time IMO. And I'm a huge Korra stan/LOK defender lol.",
                                            "score": -11,
                                            "replies": [
                                                {
                                                    "author": "Glass-Work-1696",
                                                    "body": "Where did you get those numbers from",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Chief-weedwithbears",
                                                            "body": "In the original series aang explains how he got his tattoos. Or it might be  in a flashback?\n\nFor airbenders, you can master all 36 tiers of airbendering or you can create a new technique to earn your tattoos.\n\nAang had only mastered 35 tiers but invented the air scooter so he became a master.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Heather_Chandelure",
                                            "body": "The fact that he's a really good airbender? If you want examples of that, I point you towards basically every episode of the series.\n\nHe is also the avatar, so i concede it's possible he got special treatment there. Id still say he demonstrates a high level of skill, though, something which I just don't feel Jinora ever does in the first 3 seasons.",
                                            "score": -12,
                                            "replies": [
                                                {
                                                    "author": "AlianovaR",
                                                    "body": "To be fair he was a master airbender before he even knew he was the Avatar, that was pure skill",
                                                    "score": 7,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "PureBat7689",
                                            "body": "Be the avatar",
                                            "score": -10,
                                            "replies": [
                                                {
                                                    "author": "mothwhimsy",
                                                    "body": "He was already a master Airbender before the show started aka before he was Avatar. Did you watch either show?",
                                                    "score": 8,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Fantastic-Artist-833",
                            "body": "It really wasn’t.",
                            "score": -52,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Pitiful_Caregiver511",
                    "body": "They all are intentional.",
                    "score": 49,
                    "replies": [
                        {
                            "author": "AlianovaR",
                            "body": "I mean that the specific moments weren’t necessarily intended to draw parallels, but the last one was very specifically intended to have her resemble Aang in the moment, not that it was unintentional that she looks like Aang in general",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Remarkable-Dig-1241",
                    "body": "All of them are intentional... He's her grandpa and it's a whole plot line how tenzin isn't like his dad yet his kids are the spitting image of him/ have his whole personality.",
                    "score": 60,
                    "replies": [
                        {
                            "author": "AlianovaR",
                            "body": "I mean that the specific moments weren’t necessarily intended to draw parallels, but the last one was very specifically intended to have her resemble Aang in the moment, not that it was unintentional that she looks like Aang in general",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DIDidothatdisabled",
                    "body": "That last one is Bobby Hill",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ThatsNumber_Wang",
                            "body": "that boy ain't right..",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Major_R_Soul",
            "body": "Woah it's almost like... they're related or something\n\n![gif](giphy|ToMjGpnXBTw7vnokxhu)",
            "score": 1198,
            "replies": [
                {
                    "author": "DICKJINGLES69",
                    "body": "Came here to say this but the gif makes it lol",
                    "score": 92,
                    "replies": []
                },
                {
                    "author": "RhynoD",
                    "body": "And also a part of a culture that values conformity. Not in a bad way, they also obviously value individual experiences, but they're monks, after all.",
                    "score": 33,
                    "replies": []
                },
                {
                    "author": "DoodleJake",
                    "body": "That one scene from Bicentennial man popped in my head\n\nhttps://preview.redd.it/hhkoj1dnmhpe1.jpeg?width=500&format=pjpg&auto=webp&s=a659ebd3c3c10c6994f1bc1aae997a88c68a932c",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "Guba_the_skunk",
                    "body": "Woahwoahwoah, are you telling me that children often look like a mix of their parents, who in turn take on traits of THEIR parents?\n\nHang on, I can't wrap my head around this third grade biology...",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Doctor429",
            "body": "I mean, there's this thing called genetics also.",
            "score": 865,
            "replies": [
                {
                    "author": "anonymous_coward69",
                    "body": "Couldn't keep it his jeans, so it got passed off in his genes😂",
                    "score": 83,
                    "replies": [
                        {
                            "author": "quagsi",
                            "body": "I'm just imagining the vibe change if Aang was wearing JNKOs the whole series",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Faeriemary",
            "body": "It’s almost like they’re related 🤔",
            "score": 509,
            "replies": [
                {
                    "author": "RupeeGoldberg",
                    "body": "Genetics are weird. You could look like none of the relatives you've ever meet and then find an old photo of your great great grandfather who looks like your twin",
                    "score": 242,
                    "replies": [
                        {
                            "author": "IceKrabby",
                            "body": "Not quite that drastic, but I don't really look like either of my parents, but I could be my aunt's male clone lol.\n\nMeanwhile my aunt's kids look *very* much like their father.",
                            "score": 76,
                            "replies": [
                                {
                                    "author": "chadsomething",
                                    "body": "My nephew looks more like me than either of his parents. Like seeing him next to a picture of me as kid we could legit be twins.",
                                    "score": 12,
                                    "replies": []
                                },
                                {
                                    "author": "Luciifuge",
                                    "body": "The seed is strong.",
                                    "score": 22,
                                    "replies": []
                                },
                                {
                                    "author": "plzdontbmean2me",
                                    "body": "My sisters and I were literally dragged into one of the biology teachers’ classrooms every year when they went over genetics because we all look so different. I have the same nose as one sister and the same eyes as the other, but everything else is different. Hair color, eye color, skin tone, complexion, etc. \n\nMy oldest sister looks way more like her husband than she does any of us, so that’s weird. Their kid looks exactly like them",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "juxxthefluxx",
                            "body": "Exactly my case. My mom always said that I didn't look like anyone else in the family and then when I was 17 at my great grandfather's 95th birthday party we found a photo of him in his early 20s that looked just like me. My mom was so excited.",
                            "score": 18,
                            "replies": []
                        },
                        {
                            "author": "Faeriemary",
                            "body": "That happened to me! I came out pale as hell; meanwhile, no living relatives of mine look like me and are all tan/brown. I look like a great-aunt who died 40 years before I was born!",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "Wombizzle",
                            "body": "Yeah if you look at my dad's high school senior photo compared to my older brother's, you'd assume it was the same person",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Moloore420",
                            "body": "Happened to me. When seeing old pictures, I could be my grandfather's twin, but my mom still has to clarify to people that yes, I am her child.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Fyrrys",
                            "body": "Nowadays I barely look like my dad, but as a kid I thought one of his school pictures was mine and was so confused because I didn't remember having that cool shirt",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "StriderPharazon",
                            "body": "Yeah, I don't really look like my dad or grandfather too much, but I'm the spitting image of my great-grandfather's brother, so my great-great-uncle.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "IndianGeniusGuy",
                            "body": "Reminds me of my grandpa on my dad's side. He died young so those are the only pictures we have of him, and he looks fucking identical to my cousin. Like the man is practically a clone.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Quick_Assumption_351",
                    "body": "I thought we were not allowed to compare the to shows since they're different things or so I've been told for the past 10 years",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -64,
                    "replies": [
                        {
                            "author": "Faeriemary",
                            "body": "Didn’t mean it as a bad thing LOL",
                            "score": 15,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Beautiful-Bit9832",
            "body": "![gif](giphy|efwUQ5Da0mhTq)\n\nIn the middle",
            "score": 258,
            "replies": [
                {
                    "author": "anacondabluntz",
                    "body": "Love the theory that she has some air nomad blood in her",
                    "score": 148,
                    "replies": [
                        {
                            "author": "Beautiful-Bit9832",
                            "body": "Her fighting style is also almost close to air nomad",
                            "score": 76,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[removed]",
                                                            "score": 8,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "[removed]",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "None",
                                                                            "body": "[removed]",
                                                                            "score": 3,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Sir_Oligarch",
                    "body": "Boink",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "SadTomorrow555",
                    "body": "I definitely saw Ty Lee first lol",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "jordvpn",
            "body": "I loved this because I think a lot of us didn’t see it, myself included, until Jinora shaved her head for her ceremony. Which is extra poetic because she’s the youngest with airbending master in history following her grandfather.",
            "score": 75,
            "replies": []
        },
        {
            "author": "TheHoennKing",
            "body": "Like Grandfather like Granddaughter! To say Aang would be proud of her would be an understatement!😄",
            "score": 26,
            "replies": []
        },
        {
            "author": "The_Sambo",
            "body": "mfw the grandchild of Aang looks exactly like him",
            "score": 96,
            "replies": []
        },
        {
            "author": "Xiao1insty1e",
            "body": "No they said \"The grand daughter will be the most like Aang.\" \n\nBecause that's how families/genetics work.",
            "score": 17,
            "replies": []
        },
        {
            "author": "Verbindungsfehle",
            "body": "I'll raise you:\n\nhttps://preview.redd.it/tca6nx03chpe1.jpeg?width=665&format=pjpg&auto=webp&s=501b6917b9128c7bd77097de3c35652769e8290c",
            "score": 18,
            "replies": [
                {
                    "author": "ChristophCross",
                    "body": "OK NOW THIS IS CURSED, TELL KOH TO STOP MESSING AROUND & PUT IT BACK 😭",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Verbindungsfehle",
                            "body": "Nah, I'm way too scared to visit that monster 😅😭",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Excellent_Pea_4609",
            "body": "Jinora is the most like Aang it's actually adorable ",
            "score": 51,
            "replies": []
        },
        {
            "author": "Brand_Zero_O",
            "body": "They finally turned Aang into a girl, the Ember Island Players predicted the future lol",
            "score": 16,
            "replies": [
                {
                    "author": "Nipple-Cake",
                    "body": "To be fair, Aang was the spitting image of Roku's wife. So perhaps, \"Girl Aang\" came before and after Aang.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Brand_Zero_O",
                            "body": "Honestly, I can believe  that. Especially since he was a woman or 2 in his past lives.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "berserkzelda",
            "body": "Tbf, Avatar does have a case of same face syndrome sometimes.",
            "score": 75,
            "replies": [
                {
                    "author": "AtoMaki",
                    "body": "[Compulsory link.](https://www.reddit.com/r/TheLastAirbender/comments/qp1zj2/azula_and_ursa_hairstyle_swap/) Click on it at your own peril.",
                    "score": 40,
                    "replies": [
                        {
                            "author": "berserkzelda",
                            "body": "Cursed, but interesting",
                            "score": 17,
                            "replies": []
                        },
                        {
                            "author": "Riccma02",
                            "body": "Now do Azula and Ozai",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "GamerRipjaw",
                            "body": "While genetics do play a role, this was still too uncanny a resemblance for them to be individual character designs imo",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "JetKusanagi",
                    "body": "If anyone should have same face syndrome, it should be a grandparent and their grandchild lol",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "Rs90",
                    "body": "The animation has never been consistently amazing. Least in the original series. Fights are great and there's amazing scenes.\n\n\nBut you can pause the majority of scenes and you're likely to see some real silly shit. It all works cause it's in motion and you're not hyper-focusing on a characters eyebrows during a chase scene.\n\n\nBut I've paused the show enough to see some hilarious stills when I come back from the restroom. People lookin like Jimmy Nuetron characters lol. ",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Jacksontaxiw",
            "body": "Aang would love his grandchildren so much",
            "score": 15,
            "replies": [
                {
                    "author": "Nipple-Cake",
                    "body": "Aang would have loved his grandchildren, to see Bumi become an Airbender, and to see the Air Nation reborn. But he was reborn into Korra, so in a way, he did get to see it through her eyes. He would be so proud to see what his family and Korra achieved.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "ProfessorCagan",
            "body": "Almost as if she's blood related to him.",
            "score": 9,
            "replies": []
        },
        {
            "author": "JoshthePoser",
            "body": "That was the point",
            "score": 6,
            "replies": []
        },
        {
            "author": "One_Recognition385",
            "body": "Shit man, think they're related?",
            "score": 6,
            "replies": []
        },
        {
            "author": "StrikeCold9679",
            "body": "That’s kind of how genetics work…",
            "score": 8,
            "replies": []
        },
        {
            "author": "Armycat1-296",
            "body": "Heaven forbid a person has a good resemblance to their grandparent.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Mx-Adrian",
            "body": "The fact that they're the same age helps LOL",
            "score": 17,
            "replies": []
        },
        {
            "author": "Bubbly_Midnightt",
            "body": "Makes sense",
            "score": 4,
            "replies": []
        },
        {
            "author": "Corkchef",
            "body": "That’s how kids work!!",
            "score": 3,
            "replies": []
        },
        {
            "author": "blackbutterfree",
            "body": "That's how genetics work sometimes.\n\nMy nephew looks like my grandfather, his great-grandfather.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Bojangles1987",
            "body": "All of Tenzin's kids have some piece of what we loved about Aang, it's so good.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Natural1forever",
            "body": "Damn I could almost believe they're related or smth",
            "score": 3,
            "replies": []
        },
        {
            "author": "ClemsonPrice112",
            "body": "Even if the scenes are similar they're very clearly not copy-pasted, as any amateur with an iota of art experience can tell you. I genuinely don't know what you were trying to prove with this post.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ltravis0",
            "body": "I dunno man, in my opinion there's a big difference between \"copy and paste\" and \"drawing parallels\" which I think is more likely what their intention was.",
            "score": 3,
            "replies": []
        },
        {
            "author": "KenseiHimura",
            "body": "Honestly, if the whole ‘avatar reincarnation’ wasn’t part and parcel of it I would wonder if Jinora was Aang’s reincarnation.",
            "score": 3,
            "replies": []
        },
        {
            "author": "matande31",
            "body": "Wait, you're telling me that people are similar to the grandparents?! NO FREAKIN WAY!",
            "score": 5,
            "replies": []
        },
        {
            "author": "OldSnazzyHats",
            "body": "I mean… it’s intentional though, she clearly showed a deep connection to Airbending and even managed something her father couldn’t. I thought it was great, while she might not have Aang’s carefree whimsy, she got the gift.",
            "score": 4,
            "replies": [
                {
                    "author": "Nipple-Cake",
                    "body": "I don't think Jinora needed Aang's \"carefree whimsy\", that's one of the reasons he ran away from his responsibilities. Besides, her siblings have more of those qualities that Aang had. Jinora worked hard to get her tattoos earlier than even Aang. She's a true prodigy that takes her airbending, spiritual connection, and Air Nomad brand of empathy very seriously.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "OldSnazzyHats",
                            "body": "I never said she needed it.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AmberIsla",
            "body": "I’m just wondering how painful is it to get the airbender master tattoo cause I remember getting my back tattooed it hurt by the 3rd hour :/",
            "score": 2,
            "replies": []
        },
        {
            "author": "trueum26",
            "body": "She got the looks but Meelo got the personality.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Dr_Straw-man",
            "body": "Wait...do you think they're related or something? /s",
            "score": 2,
            "replies": []
        },
        {
            "author": "tightsandlace",
            "body": "It’s cute, if only Ang saw the grandkids before he passed",
            "score": 2,
            "replies": []
        },
        {
            "author": "ZestycloseAlfalfa736",
            "body": "Jinora is Aang before he knew he was the Avatar.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Two-Words007",
            "body": "\"Imagine having the same emotions as other human beings. Couldn't be me.\" - OP, 2025.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Isiah6253",
            "body": "hm, i wonder why his granddaughter is a lot like him when she was raised by her dad and he was raised by aang, i kean there's no way children are impressionable, or that even some behaviors are genetically inclined, no way\n\n/s",
            "score": 2,
            "replies": []
        },
        {
            "author": "UnNamed_Profile27",
            "body": "I mean she IS Aangs granddaughter so clearly it runs in the family",
            "score": 2,
            "replies": []
        },
        {
            "author": "Nakatsukasa",
            "body": "It's like none of katara's genes get passed on at all, I think only kya got her skin tone",
            "score": 2,
            "replies": [
                {
                    "author": "LyssaNells",
                    "body": "I think Kya is also a Waterbender.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok_Surprise_4090",
            "body": "damb are they related or sumn?",
            "score": 2,
            "replies": []
        },
        {
            "author": "MrToonyGuy",
            "body": "I feel Aang would absolutely adore Jinora",
            "score": 2,
            "replies": []
        },
        {
            "author": "MutatedRodents",
            "body": "How much of a dumbass is op? Its almost like shes her granddaughter duuuuh.",
            "score": 2,
            "replies": []
        },
        {
            "author": "StressSuspicious5013",
            "body": "I look exactly like my grandmother it isn't odd for family to look alike or even the same.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Carioca-AleatorioRJ",
            "body": "I quite like it though. She’s his granddaughter after all. But bald ginora is quite scary though",
            "score": 2,
            "replies": []
        },
        {
            "author": "Throw_Away1727",
            "body": "They kinda did him dirty now that I think about it because Aang was crazy upset they picked a girl to play him in the play lol.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Cranky-George",
            "body": "It’s his granddaughter, makes sense they would have similarities. If memory serves me right their personalities were similar too.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Sophion",
            "body": "Meng was right Aang really has some big ears even compared to his grandchild.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Jojo-Action",
            "body": "Damn. It's like they're related. This is like the azula is zuko with makeup thing all over again.",
            "score": 2,
            "replies": []
        },
        {
            "author": "0megaManZero",
            "body": "Like grandfather like granddaughter",
            "score": 2,
            "replies": []
        },
        {
            "author": "flyingcircusdog",
            "body": "You mean a biological grandchild might look like their grandparent from around the same age?\n\nCrazy.",
            "score": 2,
            "replies": []
        },
        {
            "author": "jake03583",
            "body": "I know, right? It’s almost like they share the same genetic makeup or something. Man, would it be wild if they were related?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Fhugem",
            "body": "Almost like family traits can be inherited. Genetics really knows how to make a striking resemblance.",
            "score": 2,
            "replies": []
        },
        {
            "author": "legit-posts_1",
            "body": "Oh so that's why I had a crush on Jinora as a kid",
            "score": 1,
            "replies": []
        },
        {
            "author": "agr85",
            "body": "Sometimes it really do be like that",
            "score": 1,
            "replies": []
        },
        {
            "author": "Randomhumanbeing2006",
            "body": "Aang’s daughter is a really good airbender",
            "score": 1,
            "replies": []
        },
        {
            "author": "FPSGamer48",
            "body": "And this is why Jinora is the second best character in Legend of Korra (after Tenzin)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Metal_Fish",
            "body": "100% sure that was the point",
            "score": 1,
            "replies": []
        },
        {
            "author": "kooliocole",
            "body": "Almost like thats her relative hmmmm",
            "score": 1,
            "replies": []
        },
        {
            "author": "Crazyjackson13",
            "body": "Genetics:",
            "score": 1,
            "replies": []
        },
        {
            "author": "Isiah6253",
            "body": "hm, i wonder why his granddaughter is a lot like him when she was raised by her dad and he was raised by aang, i kean there's no way children are impressionable, or that even some behaviors are genetically inclined, no way\n\n/s",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mobile_Ad_2402",
            "body": "To be fair, that's genetics for you",
            "score": 1,
            "replies": []
        },
        {
            "author": "Iron_Phantom29",
            "body": "Well, she IS Aang's granddaughter.....",
            "score": 1,
            "replies": []
        },
        {
            "author": "BlackMagic0",
            "body": "It was intentionally done. If you didn't get that.. I dont know how to help you. Haha. As if you have never seen someone resemble their parents or grand parents. I look like a carbon copy of my grandfather at my age, and we have very similar mannerisms.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ReadWriteTheorize",
            "body": "I almost want a Sozin and Roku prequel to see how Zuko and Azula have similar traits of theirs like this",
            "score": 1,
            "replies": []
        },
        {
            "author": "FunSmoke4476",
            "body": "She looks like Bobby Hill in the last one",
            "score": 1,
            "replies": []
        },
        {
            "author": "AzraelTheMage",
            "body": "Almost like she's his granddaughter or something.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Patient-Reality-8965",
            "body": "Literally his granddaughter",
            "score": 1,
            "replies": []
        },
        {
            "author": "DonkeyNo4268",
            "body": "„The Seed is strong !“\n\nWait wrong francise 😂😂😂",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cleveland_Guardians",
            "body": "Give me a break...",
            "score": 1,
            "replies": []
        },
        {
            "author": "New-Number-7810",
            "body": "“Hey Aang, we need you to wear a wig for the new show.”",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ihateyou510",
            "body": "I didn't like the legend of korra and I found it disrespectful that a crap show tried to ride the coattails of an amazing one.",
            "score": -25,
            "replies": [
                {
                    "author": "ramcee_",
                    "body": "ermm… relevance?",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Ihateyou510",
                            "body": "Yeah, I understand. I felt that it was relevant.",
                            "score": -14,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Laggingduck",
                    "body": "okay",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Ihateyou510",
                            "body": "Just an opinion, didn't think anyone would even care to react to it.",
                            "score": -15,
                            "replies": [
                                {
                                    "author": "Laggingduck",
                                    "body": "then why post it if you expected no interactions?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Ihateyou510",
                                            "body": "Bored.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SpecialObjective6175",
                    "body": "Based",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "alejandrodeconcord",
            "body": "More like they said “lemme copy your homework 👀”",
            "score": -13,
            "replies": []
        },
        {
            "author": "wishiwasnthere1",
            "body": "Oh no it’s almost like they’re humans and have emotions and the ceremony has been the same forever.",
            "score": -41,
            "replies": [
                {
                    "author": "ramcee_",
                    "body": "its never that serious love. i thought it was cute “like Grandfather like granddaughter”",
                    "score": 24,
                    "replies": []
                },
                {
                    "author": "Mega7010realkk",
                    "body": "bro just said that aang's granddaughter looks like him, it doesn't have any criticism it's literally just an awesome/cute post",
                    "score": 15,
                    "replies": [
                        {
                            "author": "wishiwasnthere1",
                            "body": "That’s not the way the caption reads at all. “They really just said “copy and paste”” is a criticism for being lazy.",
                            "score": -23,
                            "replies": [
                                {
                                    "author": "MenuExisting5036",
                                    "body": "No love, the caption reads as sarcasm. lol you can just glance at the pictures and tell it’s a cute post",
                                    "score": 11,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}