{
    "title": "It PAINS me how little attention people paid to certain instances in TLOK because really….?",
    "author": "thisisreii",
    "subreddit": "TheLastAirbender",
    "rank": 4,
    "score": 1683,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 85,
    "url": "https://i.redd.it/ecvkh5mnfipe1.jpeg",
    "id": "1jeff3m",
    "selftext": "“They haven’t met her”…So Jinora coincidentally knew to call her “gran gran”. That certainly doesn’t seem like something Katara would’ve told them to call her🤗",
    "comments": [
        {
            "author": "peachykeenjack",
            "body": "I was under the impression they just didn't go visit often, maybe every 2-3 years, so Meelo (is that the correct spelling?) didn't remember meeting her. but there's no way she wouldn't want to see her grandkids whenever she could!!!",
            "score": 1551,
            "replies": [
                {
                    "author": "Hau5Mu5ic",
                    "body": "Even if they did see her like 1-2 a year, I could easily see Meelo’s hyperactive butt completely forgetting about most of the visit by the time they left her house. I always took that scene as more of a point about Meelo’s character than it was about Katara’s.",
                    "score": 793,
                    "replies": [
                        {
                            "author": "deevulture",
                            "body": "He's a child. Children do not often remember adults that show up sporadically in their lives",
                            "score": 434,
                            "replies": [
                                {
                                    "author": "BS0404",
                                    "body": "Heck, I'm 26 and the amount of distant family members that come up to me like \"Remember me, we met that one time when you were 9.\" Like!?! Gurl, no, I don't remember you. I barely remember what I had for breakfast yesterday!",
                                    "score": 236,
                                    "replies": [
                                        {
                                            "author": "deevulture",
                                            "body": "Exactly. my grandparents had tons of siblings and cousins and my parents have a lot of cousins therefore. At large family events I spent my time going ??? at ppl who apparently knew me as a child",
                                            "score": 65,
                                            "replies": []
                                        },
                                        {
                                            "author": "Big-Project-3151",
                                            "body": "My mom has done this with two of my former aunts (one’s a widow and the other’s divorced, twice) ‘sweetie, don’t you remember your Auntie Mary/Rose?’\n\nMom, I was literally just over a year old when Uncle Conrad died and sometime later Auntie Mary moved away so I don’t remember Auntie Mary at all and I don’t remember Auntie Rose either despite maybe her and Uncle Doug still being married when I was around six.\n\nAll names are fake.",
                                            "score": 12,
                                            "replies": []
                                        },
                                        {
                                            "author": "BlackMagic0",
                                            "body": "The big difference is that this is grandma. I never once didn't remember my grandparents as a child. Even the ones I saw once a year.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "BS0404",
                                                    "body": "It must be nice to have such a good memory at 5 years old.",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "author": "BlackMagic0",
                                                            "body": "My kids have no issues remembering their grandparents either, and the youngest only met the one a handful of times. I don't know where you got this idea children can't remember long term things.",
                                                            "score": -2,
                                                            "replies": [
                                                                {
                                                                    "author": "jetvacjesse",
                                                                    "body": "You might want to take a seat for this one….\n\nNot all kids are the same.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Hau5Mu5ic",
                                    "body": "Exactly. If Ikki or Jinora had made that comment, I could see the implication being that they very rarely see Katara. But Meelo? Yeah, he is not gonna remember family unless they live at the Air Temple.",
                                    "score": 51,
                                    "replies": [
                                        {
                                            "author": "deevulture",
                                            "body": "He's literally 5 years old at this point in the story. when was the last he saw her 2 years ago? likely doesn't register in his mind",
                                            "score": 26,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "CRT_SUNSET",
                                    "body": "Exactly. My kids don’t remember relatives we’ve gone to see literally every Christmas for the past 5 years. At their age, a year passed basically feels like a lifetime ago.",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "Aggressive_Flight145",
                                            "body": "It’s a different between random relatives and grandparents though.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "CRT_SUNSET",
                                                    "body": "My situation includes grandparents (who are admittedly pretty hands off). The kids have even video chatted with them a couple times a year, but once in person the kids act like they’re strangers.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "RhynoD",
                                    "body": "Can confirm, am army brat. My whole life has been my parents asking if I remember Chaplain Whatshisname or the Soandsos that we knew at Ft Placename when I was like two. I'm in my 30s and they still ask me even though I've said repeatedly that the answer is always *always* going to be \"no.\" Also, people I don't know coming up and telling me that they knew me when I was \"this big\" from Ft Wherever, \"Do you remember me?\" Sure don't.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "peachykeenjack",
                            "body": "good point, you're right!!",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "humbug-",
                    "body": "Yeah I definitely got the impression the other kids knew her - the older one even seems fond of her, wanting to keep close reading stories about her.\n\nAlso, they use the term “gran gran” (like Katara and Sokka did), to me that implies closeness as well. She seemingly got to pick her “grandma name” which would make it seem she’s around.\n\nThe fussy one looks quite little - most babies and toddlers don’t remember meeting people after only 1 or 2 times .",
                    "score": 34,
                    "replies": []
                },
                {
                    "author": "Mampt",
                    "body": "Also we have places that can get you from one side of the US to the other in a few hours, pretty much anywhere in the world in a day or so, and people STILL have close family they only see sparingly. Now imagine if the trip took several days or weeks (to get to the South Pole), you have three kids, and you’re a major world political and spiritual leader. Hard to find the time to travel, and Katara is probably too old to make the trip but normal means (aka, without a sky bison)",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "Killjoy3879",
                    "body": "Meelo is 5 years old in season 1 so it's very possibly he just hadn't met her at an age he could really remember her.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Baelzabub",
                            "body": "It’s also possible that Meelo is just a doofus and is making a joke like a hyperactive child",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "thisisreii",
                    "body": "Like hello!!!",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "toasterstrudelboy",
                    "body": "I thought the same thing, and it would make sense for Jenora to nerd out and read up on Katara's adventures in between visits.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Voltage_Z",
            "body": "The way the girls interact with Katara pretty clearly demonstrates they know her.\n\nMeelo is five in book 1 of Korra, though, so it's quite possible it's been a couple years and *he specifically* doesn't recognize her.",
            "score": 286,
            "replies": [
                {
                    "author": "Joelblaze",
                    "body": "I just assumed that Meelo was being a little asshole.",
                    "score": 58,
                    "replies": [
                        {
                            "author": "KingOfThePlayPlace",
                            "body": "Same here. I didn’t occur to me at all that he actually didn’t know her.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "LatinMillenial",
            "body": "This is literally not true. Obviously Katara met them before, both Jinora and Ikky talk to her like they have seen her plenty of times before and Meelo was either too young to remember of just being dumb as he usually is.\n\nAlso, Katara living there has nothing to do with being distant. She is literally there training Korra in water bending, overseeing the rest of her training, and making sure she is safe. Katara is there because of Aang. She never left his side, even after he passed away, until it was time to let him go once Korra could start her journey",
            "score": 591,
            "replies": [
                {
                    "author": "catwhowalksbyhimself",
                    "body": "And in a later season you see she's near a pretty large city, at least when that season takes place.  If she was in isolation before, she leaves it as soon as she is no longer actively caring for Korra.",
                    "score": 93,
                    "replies": []
                }
            ]
        },
        {
            "author": "WandererNearby",
            "body": "Yeah, exactly. There’s a good chance that Meelo had met her but forgotten or was just being goofy (I don’t remember if the episode directly disputes this portion). Plus, Katara and Tenzin lived almost half of a world away from each other and she’s pretty old. It makes sense that she wouldn’t see them that much.",
            "score": 182,
            "replies": []
        },
        {
            "author": "SteveOMatt",
            "body": "Yeah, I wasn't getting that they haven't visited her at all, just Meelo being Meelo and Tenzin states the obvious because it's literally the first episode and they're trying to establish the relationships.",
            "score": 42,
            "replies": []
        },
        {
            "author": "untablesarah",
            "body": "Some of yall have never had a relative look at you and say “I bet you don’t even remember me changing your diaper” because ofc you don’t remember that\n\nAnd it shows",
            "score": 49,
            "replies": []
        },
        {
            "author": "DannyTreehouse",
            "body": "I mean I always interpreted at Meelo was like 4-5 during season 1 both Tenzin and Katara are both busy/workaholics so I assumed they just haven’t seen each other for a while\n\nPeople also forget she lives very far away form Republic City and Air Temple Island",
            "score": 23,
            "replies": []
        },
        {
            "author": "donetomadness",
            "body": "The scene was more about Meelo than Katara. Also, she’s not living in isolation. She’s living in the Southern water tribe. How is it ooc for an old woman to want to return to her childhood home after her husband passed away and her kids grew up?",
            "score": 22,
            "replies": []
        },
        {
            "author": "Far-Mammoth-3214",
            "body": "If this isn't proof people blatantly ignore the show...\n\nThat is littleraly Meelo just being Meelo",
            "score": 14,
            "replies": []
        },
        {
            "author": "gustav0xth",
            "body": "Why some Avatar fans talk about the show like they personally know the characters like they were real people",
            "score": 6,
            "replies": []
        },
        {
            "author": "Iamaquaman24",
            "body": "My six year old niece didn't remember going to Disney at 5. Kids just forget stuff.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Sorry_Union_780",
            "body": "She was avoiding Aunt Wu’s prediction 🤓",
            "score": 12,
            "replies": [
                {
                    "author": "American_Apple2",
                    "body": "😂",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Crpal",
            "body": "Meelo was probably too young to remember when he first saw gran gran, Jinora and Ikki clearly remember her from past visits.",
            "score": 11,
            "replies": []
        },
        {
            "author": "Great_Employment_560",
            "body": "That was literally not what even happened. The joke is meelo acts dumb. How did you extrapolate that she lived in isolation. Tenzin’s wife even has a heart to heart with Katara about how she’s expecting ANOTHER CHILD.",
            "score": 19,
            "replies": []
        },
        {
            "author": "Ok_Surprise_4090",
            "body": "Katara (and Kya) returned to the Southern WaterTribe after Aang died. One of Katara's big passions was rebuilding the SWT, and she'd be considered a leader/honored elder in it by then, so she could have assisted quite a bit. Sokka was probably chiefain by then too, so most of her remaining family would have been there.\n\nBumi was Republic military and Tenzin took over the new Air Temple, so of course they couldn't come too. I never got the impression that they didn't visit (or vice versa), though.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Kegger98",
            "body": "“Lives in isolation” YOU MEAN HER HOMELAND WHERE HER ANCESTORS LVIED FOR THOUSANDS OF YEARS!?",
            "score": 10,
            "replies": []
        },
        {
            "author": "zazathebassist",
            "body": "this take feels like it’s written by someone who isn’t an immigrant or doesn’t have distant family. Travel isn’t free, we can see that even with a flying bison it can take days or weeks to traverse the world. my grandparents lived (one still lives) in mexico. they would come visit us every 2-4 years. \n\nEven if you remove any of the political issues like passports and visas and remove the cost of travel, it would make sense that Katara would only travel to Republic City irregularly. Two years is absolutely a normal span of time to be away from your family that’s literally an ocean away. And for a 5 year old, two years is an eternity.",
            "score": 4,
            "replies": []
        },
        {
            "author": "PizzaTime666",
            "body": "I never took this as katara never meeting her grandkids. I just assumed they hadnt seen eachother in a while. There were plenty of times i met relatives and forgot them after i hadnt seen them in a few years. With tensin being responsible for his new family and restoring the air nation i assume he is too busy to visit often, especially since she lives halfway across the planet.",
            "score": 3,
            "replies": []
        },
        {
            "author": "starfire92",
            "body": "The lack of media literacy seeing this posted twice makes me wish avatar never got resurgence in popularity because all these people really have little understanding of the show, how real life works and also expect a perfect character out of everyone. \n\n1. Just because Meelo needs to be told that’s his gran doesn’t mean the other kids haven’t met\n2. Meelo is 5. A lot of little kids don’t know who is who when they don’t see them often\n3. Tenzin is trying to rebuild the air nation and run republic city half way across the world. My mom lives in another country as her first gran kid and saw him like once a year if we were lucky based on everyone’s finances. He didn’t start remembering her or me until he was 6\n4. When you meet someone the first time you don’t say “it’s good to see all of you”, you say “it’s so nice/lovely/good to finally meet all of you”. \n\nGetting ratio’d too with the top comment having 5x as many upvotes as this post arguing against the post.",
            "score": 5,
            "replies": []
        },
        {
            "author": "DerSchweinebrecher",
            "body": "Don't think so really, Tenzin and his family are insanely important, cause up to the reemergence of the airbenders they were the only ones in the world. So they had to be guarded and in direct reach of the authorities. Katara on the other hand would have a lot of responsibilities in rebuilding her water tribe and it makes perfect sense for her to return home after her own kids reached adulthood. And the rest is just a realistic portrayal of distance, especially if one thinks about how hard traveling is in that world, even if you have a sky Bison.",
            "score": 2,
            "replies": []
        },
        {
            "author": "MinnieShoof",
            "body": "Meelo being weird and Jinora telling her grandmother that she’s reading. Normal.",
            "score": 2,
            "replies": []
        },
        {
            "author": "scholarlysacrilege",
            "body": "The girls remember her; Meelo is five; most likely, he either went to her multiple times, but his child's brain didn't make the connection, or he didn't go before and stayed home with his mom because it's the literal fucking Arctic, and that is probably not that healthy for a young kid.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ProfessionalGold9239",
            "body": "As much as I love ATLA and TLOK, and the resurgence of popularity for these shows in the past several years has led to great things like a whole new show, I do sometimes miss when the community was a little more quaint. Some people have some really awful takes on these shows, to be honest. Like this one is just downright wrong and also doesn't make sense. I said this on the other post about this take, but obviously Katara has met her grandkids, but did people forget how old she is? Do other people just not have grandparents or any old people in their lives? Katara's probably too old to travel much, if at all, at this point.",
            "score": 4,
            "replies": []
        },
        {
            "author": "hung_fu",
            "body": "People assume it’s Katara and not Tenzin shows a little bias",
            "score": 4,
            "replies": []
        },
        {
            "author": "ADLegend21",
            "body": "Tenzin you got a whole Bison. Fly them kids down there to meet Grandma while she trains Grandpa's reincarnation.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ChildofFenris1",
            "body": "Um she didn’t become and absent parent. Maybe she wasn’t there as much for her grandkids but the show never said that she wasn’t their for Tenzin, Bumi, or Kai. If you’re going to say this about one of the two it would be Anng with his clear favorites and two out three kids believing that he would be disappointed in him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "randmperson2",
            "body": "Yeah, this is a purposefully obtuse take.\n\nFirst off, Katara wasn’t “living in isolation”. She was living back home in the Southern Water Tribe helping the White Lotus train Korra. Tenzin was taking care of one aspect of Aang’s legacy; training and protecting the next Avatar was another important aspect.\n\nSecond, Meelo was DEFINITELY just being Meelo. With Tenzin’s tone, you can definitely infer that this isn’t the first time Meelo has seen his grandmother, and this is probably a regular occurrence because Meelo is a little weirdo (whom I love).",
            "score": 1,
            "replies": []
        },
        {
            "author": "swarlesbarkley_",
            "body": "Not true tho lol they just live far away\n\nAnd she’s been far away helping train the avatar… I won’t stand for more TLOK slander!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "SmoothDinner7",
            "body": "Aang being a bad father was an odd choice",
            "score": 1,
            "replies": []
        },
        {
            "author": "bearhorn6",
            "body": "This is just normal kid behavior lmao. My little cousins act like they’ve never met me if even a couple weeks pass between visits",
            "score": 1,
            "replies": []
        },
        {
            "author": "AudienceOfOne-10101",
            "body": "The way I see it, this scene it not about Katara not seeing her grandkids for an extended amount of time. Just because Meelo called her, \"strange woman\" doesn't mean he doesn't know who Katara is. I'm quite sure within the family, they've shared stories and pictures around.\n\nWhat I see is Meelo displaying a kind of macho kind of attitude. Think about it. He grew up in a family a female characters. His dad is always busy trying to rebuild the Air Nomads and Republic City. Maybe along the way, at 3ish, he decided to be fully a male figure. You can see how he displays common perceptions about being a boy.\n\nSo seeing Katara and being hugged by her, he could have felt an uncomfortable sense of affection and reacted an icky response.\n\nThat is just my two cents.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FrostedVoid",
            "body": "LOK is far from a perfect show, but my god some people are dumb as hell.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RendolfGirafMstr",
            "body": "Aang on the other hand was a terrible grandparent! It’s canon that he never went to meet his grandchildren once!",
            "score": 1,
            "replies": [
                {
                    "author": "mini_chan_sama",
                    "body": "Aang died relatively young (in his 40s) \n\nHe didn’t have grandchildren to meet",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "bigdreamsbiggerhog",
            "body": "to be fair, it would be more surprising if people whose job it was to save the world had time for their children. i would certainly hope that parenthood would rank low on their priority list",
            "score": 1,
            "replies": []
        },
        {
            "author": "mini1006",
            "body": "I think people forget that Meelo was super young and was probably very little when he met Katara. Also…there’s nothing wrong with Katara living in isolation. I would also live far away and alone in my final years if I had a life like hers.",
            "score": 1,
            "replies": []
        },
        {
            "author": "blackbutterfree",
            "body": "That’s more about how Tenzin sucks and less about Katara.",
            "score": 1,
            "replies": []
        },
        {
            "author": "eribear2121",
            "body": "I would think Katara would move to be closer to her children and grand children",
            "score": 1,
            "replies": [
                {
                    "author": "Eurell",
                    "body": "She did live by Kya didn’t she?    This is just how it is when your kids grow up and all move to different places.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Rogthgar",
            "body": "Are we kinda forgetting that we are still in an 1800 kind of world where travelling 1/4 around the world takes several weeks or months to complete?",
            "score": 1,
            "replies": [
                {
                    "author": "bens6757",
                    "body": "1920s by Korra's time, but planes weren't invented until later in the season, so it is still valid.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "iNullGames",
            "body": "I mean I don’t know how accurate this specific point is by the characterization of Katara in LOK is kinda crazy. Feels like they took away everything that made her interesting and turned her into a kind old lady and a healer.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Boanerger",
            "body": "Grief changes people. \n\nMaybe losing Aang did just that, causing her to isolate herself for a while. By the time of Korra's show however we see a Katara who's come to proper terms with things.",
            "score": 0,
            "replies": []
        },
        {
            "author": "jhor95",
            "body": "They really have both of them the now \"Naruto\" treatment (yes I'm aware of the chronology)",
            "score": 0,
            "replies": []
        },
        {
            "author": "Professional-Hat-687",
            "body": "Was anyone in the Gaang a good parent?",
            "score": -8,
            "replies": [
                {
                    "author": "DannyTreehouse",
                    "body": "Yes all of them \nKatara: people forget that she raised and trained Kya and has a very close relationship with Bumi, she couldn’t ask Aang to give up his one chance to continue his people’s culture through Tenzin (even though as we know Bumi should also have been included)\n\nToph: Had to balance being a cop with being a mother and unfortunately that’s not easy when your daughter falls into a bad crowd, we know she never held any resentment toward Su or Lin and Lin’s issue with her weren’t really on Toph\n\nZuko: Man literally dropped everything at the mere possibility the Red Lotus were going after his daughter and he advocated the throne to her\n\nAang: This is going to be very controversial but I don’t think Aaang was a bad father, being the Avatar isn’t easy especially when the word is (seemingly) left unbalanced and their is very little you can do about it…..but then your wife gives birth to an airbender!? You have to make sure you impart EVERYTHING there is to know about being an air nomad to him!\n\nIt’s fine it’s not like you abandoned your kids, you’d never do that, besides your daughter is a water bender and your wife is an expert so your literally helping her by leaving her at home\n\nWhat I mean is I don’t think Aang favored Tenzin intentionally but he had a lot of pressure, pressure we see Tenzin inherited",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Einrahel",
                            "body": "I always hate how that Aang scene is misinterpreted. Aang isn't a bad father. It's just that Tenzin was misrepresenting things, so the other two pointed out Aang wasn't perfect. Not perfect =/= bad. In the end, they all loved their father, and idk if Bumi holds any resentment, he wouldn't have those scenes where he says he hopes he made Aang proud.\n\nAlso, that scene was meant to take Tenzin down a notch. It's really crazy when people instead decide it is all about Aang.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Mampt",
                                    "body": "Also acting like having any conflict or mixed emotions about a partner means they’re a horrible parent is kind of an insane standard",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "randomdude1959",
                                    "body": "Like honestly if bumi barely had a relationship with aang how do you explain that he’s the one that acts the most like him",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Haunting_Test_5523",
                            "body": "Toph was a pretty mediocre parent at best. She's in the same boat as her own parents good intentions but not a great parent.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "WallyWestFan27",
                    "body": "By virtue of not having any sign of being a bad parent, looks like Zuko wins.\n\nOf course, not being a bad parent is not the same that being a good parent",
                    "score": 2,
                    "replies": [
                        {
                            "author": "DannyTreehouse",
                            "body": "Idk I always assumed after the shit with Ozai, Zuko leaned into the Iroh school of parenting",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Professional-Hat-687",
                            "body": "I can't recall much if anything that we learned about his daughter.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "aegonthewwolf",
                    "body": "Zuko and Katara, which was definitely deliberate from the showrunners given they were the characters with the biggest parent issues on the OG show.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Professional-Hat-687",
                            "body": "I guess I'm seeing things too much from the kids' perspective. No matter how you raise them, your kids are gonna be talking about you in therapy anyway.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "32FishInaBucket",
            "body": "Well tbf, it is LoK. The writers didn't really seem care to remember stuff already established in ATLA or even just make things make sense for continuity sake. Like oh, I don't know, the whole AVATAR WONG BS?!? They already told us that in ATLA people learned to bend the elements by studying nature and the world around them. Airbenders learned from sky bison, earth benders from badgermoles, water benders from the moon pulling on the tides, and fire benders from dragons. Wasn't no magic rug spirit doing that. Smh.",
            "score": -3,
            "replies": [
                {
                    "author": "musical_dragon_cat",
                    "body": "They learned techniques from those entities, but they weren't gifted bending from them. The lion turtles giving tribes bending tracks with the lion turtle giving Aang energy bending, and we see Wan learning firebending techniques from the dragons in his time in the outer world, which improved his proficiency beyond just throwing fireballs willy-nilly.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "32FishInaBucket",
                            "body": "I must've missed that. Been a while.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}