{
    "title": "Zheo making the moon disappear could have destroyed the Fire Nation too.   If he survived the north siege, would he have been welcomed home or branded a traitor?",
    "author": "AcanthaceaeMiddle134",
    "subreddit": "TheLastAirbender",
    "rank": 10,
    "score": 116,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 38,
    "url": "https://i.redd.it/z76gkwyanipe1.png",
    "id": "1jeggt8",
    "selftext": "",
    "comments": [
        {
            "author": "FellowDsLover2",
            "body": "Probably branded an extremist traitor. This is what Iroh was telling him to stop him from killing the moon spirit but he didn’t listen. Ozai *might* praise him but will soon realize he fucked up massively.",
            "score": 150,
            "replies": []
        },
        {
            "author": "Chaos-Pand4",
            "body": "*would have\n\nIf you just made earths moon disappear, it would drastically affect tides, earth’s rotation,  and so on.\n\nNow… I don’t think ATLA really ever clarifies if the moon is going to *disappear* or if killing the moon spirit just renders it into a dead rock that still performs all non-spiritual/bending related functions. \n\nIf it’s the former, Zhao would absolutely be burned at the stake for vanishing the moon. If it’s the latter, and all he did was eliminate or severely weaken water benders, then probably not.",
            "score": 99,
            "replies": [
                {
                    "author": "Kolby_Jack33",
                    "body": "The moon vanishes. It was a full moon, which means the light from the sun was no longer hitting it. It was gone.",
                    "score": 42,
                    "replies": [
                        {
                            "author": "Sting_the_Cat",
                            "body": "I think the physical rock was still up there but it went dark",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "Tumblrrito",
                                    "body": "That would require the sun to have gone out surely",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "Sting_the_Cat",
                                            "body": "Assuming it worked like real life, yes. But in Avatar a \"Full Moon\" is seemingly an inherently spiritual thing, not just light off the Sun.\n\n(And yet they also have Eclipses. It's a bit confusing what is scientific and what is \"a fish did it\")",
                                            "score": 10,
                                            "replies": []
                                        },
                                        {
                                            "author": "DarkPhoenix_077",
                                            "body": "Maybe it just turned the moon's albedo down to zero",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "steveyp2013",
                                                    "body": "Physics and spirit magic could be one and the same, yeah\n\nThe moon spirit dies, and with it, whatever caused the moon to reflect the suns light in this universe dies too",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "monti9530",
                                    "body": "This was my thinking. I figured it lost the spiritual/magnetic connection to the earth and it was symbolized with the red. It might lose magnetic pull from the Earth and then leave. That would be dope",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Wazula23",
                    "body": ">If it’s the former, Zhao would absolutely be burned at the stake for vanishing the moon. If it’s the latter, and all he did was eliminate or severely weaken water benders, then probably not.\n\nWhether he knows it or not, doing this WOULD debalance the world and lead to its destruction.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Antigonos301",
            "body": "Lighting bolt to the chest",
            "score": 13,
            "replies": []
        },
        {
            "author": "Ok-Lynx3444",
            "body": "It would for sure have had negative consequences for the fire nation and the second those consequences became apparent he would have been signed off as a madman that acted on his own accord by ozai to save face with his subjects then executed",
            "score": 14,
            "replies": [
                {
                    "author": "Sting_the_Cat",
                    "body": "Which is technically the truth in this regard.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fernando_qq",
            "body": "We saw the moon go out, but other than that, what other consequence did we see?\n\nEven in that darkness, the characters seemed to see pretty well, and since the moon only rises at night, I don't think there was much of a change in that regard.\n\nThere were no unusual tides, and during the day the sun would still illuminate the planet normally.\n\nHonestly, I think they would have received praise for it.",
            "score": 18,
            "replies": [
                {
                    "author": "PockysLight",
                    "body": "Those were the immediate effects. The long term effects could range from minor to extreme flooding to ecosystem collapses. Small animals like shellfish and some fish rely on tides/waves to feed, if they die out, the small fish die out, then the big fish and so on. \n\n[https://www.rmg.co.uk/stories/topics/what-would-happen-if-moon-disappeared](https://www.rmg.co.uk/stories/topics/what-would-happen-if-moon-disappeared)",
                    "score": 25,
                    "replies": [
                        {
                            "author": "Fernando_qq",
                            "body": "However, we must take into account the spiritual factor, since Zhao killed the moon spirit, but the moon, like an asteroid, continues to orbit the planet.\n\nSo I assume most of its functions were unaffected, except that it no longer lights up at night and the absence of waterbending.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "kr4ckenm3fortune",
                                    "body": "You have to consider those fact...this is a spiritual world, not a \"scientific world\". The moon spirit is what gave the moon to be there and created the tides.\n\nIf you killed the \"moon spirit\", the moon itself disappear. It won't be like a \"rock\" that will still be there, because if the moon disappeared, the world would've been in the dark since the sun will have died off as well.\n\nRemember the solar eclipse? In their story, that is the only time that the moon and the sun meet.\n\nAnd if you remember, they never even showed the moon at the same time as the sun, not even in TLoK.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Kid-Atlantic",
                    "body": "All I know is that however Zhao gets treated at first, he would definitely get thrown under the bus the minute the Fire Nation sees any negative consequences from the Moon being gone.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Napalmeon",
                            "body": "Exactly.\n\nAlso, let's just keep it real, it was probably for the better that Zhao let himself be taken by the Ocean Spirit. The Fire Nation is a culture that is not only extremely militaristic, but also extremely honor based. In his very first voyage as an admiral, Zhao lost an immense amount of sailors and resources, thus making the Fire Nation look weaker, just when they were edging to an overall victory for the war.\n\nZhao's ass would have been grass if he had the balls to return home.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ZestycloseAlfalfa736",
            "body": "He would at the very least be twinning with Zuko.",
            "score": 3,
            "replies": [
                {
                    "author": "Additional-Media5513",
                    "body": "HOW WOULD YOU LIKE ONE TO MATCH?!?!",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "newtreeguy",
            "body": "He would have been branded a traitor. Mostly because his mania would have progressed to the point that he would have tried to overthrow Ozai.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Uruguaianense",
            "body": "Would have been funny if the moon fell into Earth",
            "score": 1,
            "replies": []
        },
        {
            "author": "PynoxYT",
            "body": "The \"Zheo\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "AcanthaceaeMiddle134",
            "body": "I find it funny that Zheo screwed over so badly; even Ozai would be forced to \"act in the interest of the world\" and stop him for good.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wazula23",
            "body": "He was nuts. I think his success would essentially doom the world. Or at least kick in a grand spirit intervention to put everything back in order, since this is a kids show and things usually work out.",
            "score": 1,
            "replies": [
                {
                    "author": "Fluffynator69",
                    "body": "UN intervention incoming",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Jesbro64",
            "body": "I think he would have been publicly commended but privately reprimanded. \n\nThey would never admit that a fire nation general is responsible for all the negative implications of the moon disappearing. They would blame it on the water benders or make up some other fascist nonsense to divert blame.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ravonna",
            "body": "Kinda makes sense why live action made Zhao an ambitious ladder climber but dumb, coz killing the Moon Spirit isn't what a smart person would do.",
            "score": 1,
            "replies": []
        },
        {
            "author": "EnycmaPie",
            "body": "I don't think there would be home for him to go back to if the moon was destroyed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DramaticAd7670",
            "body": "From what we can gather, the effects are as such:\n\nWhat was night, from now on becomes pitch black. Think it like staring out into absolute nothing at night. Like total darkness. \n\nDuring the day, no tidal currents, meaning all non-motorized vessels either stop dead in the water or move at severely reduced speed. \n\nAnd this is just the physical world, spiritual repercussions are bound to be cataclysmic. Nature spirits normally docile would likely run amok. Deadly spirits restrained by the moonlight would have free rein.\n\nSo likely AT FIRST Zhao would be hailed as a hero upon returning to the Fire Nation. But then, as the effects are witnessed and experienced, the public opinion will turn on him and he will become an outcast. Zhao The Moonslayer will no longer feel like a conqueror’s title and more like a damned man’s sentence.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Odd_Potential_7203",
            "body": "Ozai: You have become a Rival",
            "score": 1,
            "replies": []
        },
        {
            "author": "wishiwasfiction",
            "body": "That plot never really made sense to me. If he was so smart how could he not have seen how harmful eliminating the moon spirit would be for everyone? Including himself, since no one in the Fire Nation would view the person who threw their own country off balance as collateral damage, as a hero.",
            "score": 0,
            "replies": [
                {
                    "author": "Napalmeon",
                    "body": "Zhao *wasn't* that smart.\n\nThe only thing he was thinking about was destroying the Northern Water Tribe, period. Anything that happened after that was not part of his thought process.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "math_and_cats",
                    "body": "The fire nation didn't want balance. That was their thing.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "wishiwasfiction",
                            "body": "They didn't want balance in that they wanted to rule the other nations and get rid of the the Avatar, but I'm sure they didn't want their own country thrown off of balance. Like Iroh said, the FN needed the moon as well.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "math_and_cats",
                                    "body": "Why? Pretty sure it was only Irohs affinity for spirits. The moon spirit is not that important, the rock was still there.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "math_and_cats",
            "body": "He would be praised. He only took the \"spirit power\" of the moon away (aka water bending). The actual moon was not gone, so the tides would be still a thing.",
            "score": -5,
            "replies": []
        }
    ]
}