{
    "title": "Study suggests that semaglutide, a weight loss drug commonly used to treat diabetes, may help protect the brain from the effects of Alzheimer’s disease. Semaglutide reduced inflammation in the brains of genetically modified mice that mimic Alzheimer’s disease and improved their memory performance.",
    "author": "mvea",
    "subreddit": "science",
    "rank": 15,
    "score": 5809,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 192,
    "url": "https://www.psypost.org/semaglutide-reduces-brain-inflammation-and-improves-memory-in-an-alzheimers-model/",
    "id": "1jdmff9",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) apply to all other comments.\n\n---\n\n**Do you have an academic degree?** We can verify your credentials in order to assign user flair indicating your area of expertise. [Click here to apply](https://www.reddit.com/r/science/wiki/flair/).\n\n---\n\nUser: u/mvea  \nPermalink: https://www.psypost.org/semaglutide-reduces-brain-inflammation-and-improves-memory-in-an-alzheimers-model/\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mailman7",
            "body": "There’s a pretty big trial on semaglutide from Novo completing end of 2025. I suspect we’ll see semaglutide rolled out alongside amyloid and tau focused medication in the coming years.",
            "score": 859,
            "replies": [
                {
                    "author": "Pigeonofthesea8",
                    "body": "My god. Imagine if we could get rid of dementia. Unbelievable.",
                    "score": 402,
                    "replies": [
                        {
                            "author": "Mi11ionaireman",
                            "body": "Dementia. Isn't that Diabetes type 3? If I recall correctly, they did a study on Ozempic which found that it helped relieve symptoms of Dementia/Alzheimer's.",
                            "score": 161,
                            "replies": [
                                {
                                    "author": "venerablem0m",
                                    "body": "I have never heard this before. I have heard of Type 3C - being damage to the pancreas from non-autoimmune  mediated damage. As a Type 1 diabetic, I know there are several types, but I'm curious where Alzheimer's fits into this.",
                                    "score": 56,
                                    "replies": [
                                        {
                                            "author": "Mi11ionaireman",
                                            "body": "If I recall correctly, researchers found that it's the inability for insulin to pass through a membrane in your brain. It's been over a year since I read the study, but apparently it's a thing. My parents are both diabetic and they were warned that there was a heavy possiblity of them getting dementia/Alzheimer's due to their condition. They failed to mention that to me so I was surprised at their reaction when I read the report to them. They already knew.",
                                            "score": 80,
                                            "replies": [
                                                {
                                                    "author": "venerablem0m",
                                                    "body": "Wow! I had no idea about this. \nDo you mind my asking if they are T1's or T2's? \nI was diagnosed with T1D last year at the age of 48, and just the sheer amount of things we need to be mindful of daily is boggling.",
                                                    "score": 24,
                                                    "replies": [
                                                        {
                                                            "author": "Mi11ionaireman",
                                                            "body": "Both are Type 2. Dad has high blood sugar, Mom has low blood sugar. Mom was \"borderline\" for decades. Unsure the cause of her being labelled as such for so long. Dad got diagnosed in his 40's and he's now in his 60's. Mom officially got diagnosed 2-3 years ago in her fifties.",
                                                            "score": 19,
                                                            "replies": [
                                                                {
                                                                    "author": "venerablem0m",
                                                                    "body": "From what I understand, T1's do not make insulin due to beta cell death from an autoimmune process, while T2's make insulin, but it is unable to access their cells due to resistance. I wonder if that same cellular resistance process is what hampers the brain in cases of Alzheimer's. Maybe diabetic neuropathy contributes to dementia, too.",
                                                                    "score": 6,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "the_noise_we_made",
                                                                    "body": "Can you explain how one has high and one has low and they both have Type 2 diabetes? I thought Type 2 was that it was too high with the occasional one off low blood sugar.",
                                                                    "score": 5,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Mi11ionaireman",
                                                                            "body": "My mother doesn't take insulin or have a pump. Her blood sugar is usually 4-5 but dips lower. She eats minimal amounts so she usually has some juice or food at that point. I don't know all that much about their conditions to be honest. My dad talks about his regularly but my mother never does. My mother and I aren't on good terms and she doesn't talk all that much to me. She makes my dad do all the talking.",
                                                                            "score": 9,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "AntGood1704",
                                    "body": "Are you saying dementia is a type of diabetes??",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "Mi11ionaireman",
                                            "body": "From what I have know, the term Diabetes type 3 refers to Dementia/Alzheimer's as the same disease. Diabetes type 3 is not medically accepted yet, at least in North America. However, it is a proposed term in medical research circles due to their recent findings.",
                                            "score": 25,
                                            "replies": []
                                        },
                                        {
                                            "author": "THEpottedplant",
                                            "body": "From my understanding, thats what new research seems to indicate.",
                                            "score": 13,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Flowy_Aerie_77",
                                    "body": "Looks promising. I'm glad.",
                                    "score": 14,
                                    "replies": []
                                },
                                {
                                    "author": "ali-hussain",
                                    "body": "In Outlive Peter Attia talked about the four killers of old age. Cardiovascular issues, diabetes and insulin resistance, neural issues like dementia and Alzhimers, and cancer. All of them had a very strong correlation with blood sugar levels. Cancer is different in that it has a very high luck factor associated with it when the rest are progressive diseases. But there is a relationship.\n\nAlso, I believe Semaglutide is the same as Ozempic.",
                                    "score": 13,
                                    "replies": []
                                },
                                {
                                    "author": "panconquesofrito",
                                    "body": "It’s insulin resistance of the brain to be exact.",
                                    "score": 12,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "gizajobicandothat",
                            "body": "It may not work for vascular dementia though which is the second most common after Alzheimer's.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Brighteye",
                    "body": "How much of that is us based research? science there.... not going well",
                    "score": 27,
                    "replies": [
                        {
                            "author": "stevieZzZ",
                            "body": "Lots not going well..",
                            "score": 28,
                            "replies": [
                                {
                                    "author": "irrision",
                                    "body": "Hey now, authoritarianism is going great here.",
                                    "score": 25,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Meet_Foot",
                            "body": "The science that gets funded goes just fine. The problem is they’re destroying funding for science, and of course popular reception is basically impossible.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Brighteye",
                                    "body": "Universities and funding bodies being destroyed, the stuff not affected is pretty thin.  Reasonably the us as a leading source of science is probably over and not coming back for at least a decade or so.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Meet_Foot",
                                            "body": "Agreed, but they asked how much of the research is US based as a way of calling the research into question. But if the research has already been funded and conducted, then that shouldn’t undermine it. The problem is that future studies are going to be extremely few and far between, and perhaps even of lesser quality.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "2legittoquit",
                    "body": "Truly a wonder drug if it works.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Nvenom8",
            "body": "Kind of astonishing how many seemingly-unrelated things semaglutide seems to help with.",
            "score": 708,
            "replies": [
                {
                    "author": "Johnnygunnz",
                    "body": "No lie... I had an addiction medicine specialist call my office last week asking if I'd heard about a recent study of GLP-1s being used to help treat addiction and if we could discuss it at the next P&T meeting to try with interested patients.",
                    "score": 378,
                    "replies": [
                        {
                            "author": "Nvenom8",
                            "body": "I've heard anecdotal accounts of it basically just making the craving for alcohol go away.",
                            "score": 227,
                            "replies": [
                                {
                                    "author": "ThreeQueensReading",
                                    "body": "I'm an ex-smoker (almost a decade), who never really kicked the mental desire. If I saw or smelt a cigarette I wanted one & I thought about it everyday.\n\nI'm currently on Tirzepatide (a different GLP-1 medication) and the desire is completely gone. It's uncanny how differently my mind is reacting to the thought of smoking.",
                                    "score": 231,
                                    "replies": []
                                },
                                {
                                    "author": "RandomPersonBob",
                                    "body": "I used to drink bourbon quite a bit, loved it.  Still do, but since starting ozempic, I have zero desire to drink at all or gamble for that matter..  I've gone through half a bottle of bourbon in about 7 months now..\n\nIt's weird, that plus all the food noise just gone.",
                                    "score": 133,
                                    "replies": [
                                        {
                                            "author": "wii_u",
                                            "body": "Do you feel like you lost something in terms of having fun or do you just feel equally happy without the cravings?",
                                            "score": 49,
                                            "replies": [
                                                {
                                                    "author": "scout-finch",
                                                    "body": "Answering this as a fellow glp1- user - no! I don’t feel like I’ve lost anything at all, and this was something I worried about. I just don’t crave the bad stuff all the time or uncontrollably. I still partake in alcohol and “bad” food, but it’s easy to reach satiety with very reasonable portions, and I don’t feel driven by the cravings. For example I have my weekly calories set up to me higher on the weekends and if I think something like pizza sounds good on a Tuesday, I can just say “Eh I’ll get some this weekend”. I literally couldn’t do that before.",
                                                    "score": 74,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Rinzack",
                                                    "body": "Honestly no, its weird because you _can_ drink, like I can go out and drink with friends it just that I don't feel the need to crack one open when ive had a tough day at work or the need to drink in excess. Its the rare case where it seems like borderline magic with how effective it was for me personally with zero side effects (I got lucky and didn't have any of the gastrointestinal issues)",
                                                    "score": 21,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "PM_ME_BOYSHORTS",
                                                    "body": "I feel significantly happier. My relationship with food is more similar to that of a normal human. I still drink in social settings but I don't have to.",
                                                    "score": 6,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Nerubim",
                                                    "body": "I think that's a weird question but I understand the intention I think. You mean are things in general less fun while cravings are gone, right? Because your question as you worded it could also be answered with \"Yes I lost drinking\". Like is fun in general dampened or is it really just addiction centers/cravings in isolation to the rest of the brain suppressed?\n\nThat I would also like to know if it's not too personal to ask. Desire and reward go hand in hand usually. Very interesting if one can be suppressed while the other is unaffected.",
                                                    "score": 11,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "rolandofeld19",
                                                    "body": "I get the anhedonia a bit. It's not awful but its there .",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "BoneGrindr69",
                                            "body": "Oh yep welcome to my life. I don't usually have food cravings and alcohol is basically non existent in my brain unless social events. I can imagine it must be difficult for you guys trying to keep the weight off if that food noise is a constant stream every day.",
                                            "score": 8,
                                            "replies": []
                                        },
                                        {
                                            "author": "bass_poodle",
                                            "body": "Same. Sometimes I habitually still grab a beer from the fridge but I now the cravings are so much less it takes me over an hour to finish and I never go back to the fridge for a second now. So the net result is I can still enjoy the taste of a beer after work but my overall consumption is now probably about a quarter of what it was. And I'm still only taking the titration dose.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "KnowAllSeeAll21",
                                                    "body": "I had half a glass of wine with dinner yesterday, first time since I started sema. Wasn’t in the mood for any more. It have pizza, but only eat one slice. Go out to eat, but fill up on veggie appetizers first. All these things were unthinkable before I started.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "MaleficentFrosting56",
                                    "body": "Helps with a several compulsive and addictive tendencies",
                                    "score": 41,
                                    "replies": [
                                        {
                                            "author": "dumbestsmartest",
                                            "body": "So you're saying it might destroy the porn inside industry? I'm curious why it wouldn't if it works on all those other addictions.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "MaleficentFrosting56",
                                                    "body": "I don’t think it’s going to destroy the booze or candy industry either. People will always have vices.",
                                                    "score": 10,
                                                    "replies": [
                                                        {
                                                            "author": "Xanjis",
                                                            "body": "People have vices because there are flaws in the brain that those vices exploit, fix those flaws and people would have as much motivation for vices as they have for eating sand.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Nvenom8",
                                                    "body": "Because porn addiction is a way less common and more exaggerated thing than it’s made out to be. Most users of porn are not addicted to it.",
                                                    "score": 21,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "ENCginger",
                                    "body": "I had a family member in their 70's, lifelong heavy drinker. They started taking tirzepitide and basically just quit drinking without any effort. I take.semiglutide, and the amount of money I have saved due to cutting back on impulse online shopping is impressive.",
                                    "score": 25,
                                    "replies": []
                                },
                                {
                                    "author": "MacroFlash",
                                    "body": "My anecdotal experience has been that beer is too carbonated and wine is too acidic for more than 1-2",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "jalendskyr",
                                    "body": "Anecdotally true for me.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "PM_ME_BOYSHORTS",
                                    "body": "I'm on it... it basically eliminates cravings for everything I used to want to eat/drink. It's kind of insane.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "ArkCatox",
                                    "body": "Bingo. I've dropped all cravings for N2O, alcohol is down DRASTICALLY, and even my usage of nicotine is much lower. It's only been a week or so since being on tirzepatide, but it's phenomenal. The big thing on the alcohol front that helps is the slower GI motility, so instead of being able to slam beers back to back and passing right through your system, the cooldown timer between being able to even fit another drink in my stomach is way higher.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "scout-finch",
                            "body": "I’m on tirzepetide (Zepbound) and in a few groups that talk about our general experiences. People are constantly bringing this up as a surprise side effect. Not even just alcohol, but shopping, gambling, etc. It’s an incredible drug with seemingly lots of potential.",
                            "score": 34,
                            "replies": [
                                {
                                    "author": "ENCginger",
                                    "body": "Yeah, I said elsewhere, I didn't fully grasp how much impulse shopping I did online until I started taking sema and suddenly had a lot more money in my \"fun money\" bank account.",
                                    "score": 12,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Honest-Efficiency-60",
                            "body": "I went on it for weight loss and ended up kicking my bottle of wine a night habit. It’s magical stuff",
                            "score": 44,
                            "replies": []
                        },
                        {
                            "author": "randomlyme",
                            "body": "The way to think about if you read this and many of the comments are that GLP-1 Semaglutides have a profound effect on Satiety.  This is why it can curb, drinking, smoking, and weight loss, even the desire for opioids.  It’s possibly the most impactful drug discovery since penicillin.",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "Da_Zou13",
                                    "body": "Yea all this news of seemingly unrelated areas with only a small overlap of “impulsiveness” is starting to lead me into the “whoa…. this is huge” reaction. Maybe the other shoe drops soon, but so much research is supporting the ideas that this drug could drastically change humanity.",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "randomlyme",
                                            "body": "Most of the bad news I’ve seen needs to be significantly studied. As someone taking zepbound I have found  I could easily go a day without eating, however I work out a lot and pay attention to my macros.  I suspect the people that are seeing tons of muscle and bone density loss have been traditionally unhealthy personas that need more than just the nudge that I have needed towards a more healthy lifestyle.    \n\nI suspect (anecdotally) that many of the people having issues are self inflicted due to lack of proper nutrition and care.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "PM_ME_BOYSHORTS",
                                                    "body": "That's absolutely the case. I worked out and strength trained regularly but ate to excess and have been on semaglutide to lose \\~35lbs. Zero issues with muscle and bone density loss (at least not in any form different from what happens losing weight normally.)",
                                                    "score": 6,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "KnowAllSeeAll21",
                                                    "body": "Yup. Sadly, some users are using it to further their disordered eating habits, which is a crying shame. This medication has enabled me to make better choices in multiple areas of my life. I always wanted to make these changes, but kept failing- even when I was skinny and fit(thanks to ephedra). \n\n The down side is that taking it and then running into a situation that causes extreme stress has made it incredibly difficult to eat. But on balance, it’s completely worth it.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "nikdahl",
                            "body": "I wish they would expand the label usage to include that, so that it could be prescribed.\n\nNow that it’s not at risk anymore, they can’t sell the compounded versions at scale anymore.",
                            "score": 16,
                            "replies": []
                        },
                        {
                            "author": "pm_sweater_kittens",
                            "body": "Personal anecdote, but for me it removes a significant amount of the desire to seek dopamine responses across the board.",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "ProfessionalMockery",
                            "body": "The mental addiction to food is the same mechanism as addiction to anything else, so seems very plausible to me.",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "jendet010",
                            "body": "There was an article in February JAMA",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "captaincumsock69",
                    "body": "I mean it seems like it helps suppress inflammation diseases",
                    "score": 34,
                    "replies": []
                },
                {
                    "author": "autism_and_lemonade",
                    "body": "they’re all kinda related, \n\nfor example addiction, an appetite suppressant would help with that because appetite is not just for food, it’s for everything, less appetite for food means less appetite for drugs too\n\nand less eating means less metabolism, which is the main source of “maintenance” inflammation",
                    "score": 69,
                    "replies": [
                        {
                            "author": "Nvenom8",
                            "body": "But like, also all the blood sugar regulation effects that have less to do with eating/apetite and more to do with digestion/hormones.",
                            "score": 24,
                            "replies": [
                                {
                                    "author": "doughcant",
                                    "body": "Maybe it affects additional systems in our body which are responsible for areas he was talking about",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "autism_and_lemonade",
                                    "body": "i’m not quite sure what you mean by this? if you’re saying that the effects on appetite is caused by changes in hormones and blood sugar instead of directly suppressing appetite, i would ask how you think the body changes your appetite? it uses hormones, and many of those cause blood sugar changes",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Nvenom8",
                                            "body": "I meant the opposite: it controls blood sugar through increasing insulin, slowing digestion, and reducing sugar uptake, not via appetite suppression.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "autism_and_lemonade",
                                                    "body": "well that’s how it helps diabetes, diabetes is not solely or sometimes not an issue of diet at all",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Nvenom8",
                                                            "body": "Right, exactly.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "fattyfondler",
                            "body": "What do you think the mechanism of action is for these drugs?",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "ProfessionalMockery",
                                    "body": "The brain forms habits when an activity or substance gives the right chemical signal. Sugar, drugs, sex, achievement etc. Its to compel you to continue that behaviour, which was useful back when it was just fruit and sex, but not so good in today's world.\n\nGLP-1 agonists were meant to mimic the hormone released by the gut after eating, to trick the brain into thinking it didn't need to eat. My guess would be that it turns out this hormone is also an important part of that rewards/habit forming pathway in a way we weren't expecting. The digestive system continues to surprise us.",
                                    "score": 17,
                                    "replies": []
                                },
                                {
                                    "author": "autism_and_lemonade",
                                    "body": "depends on what aspect you’re looking at",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "smiley_x",
                            "body": "I was under the impression that most medication that suppressed all kinds of appetite also lowered libido, is that right? Is there any study about how semalglutide affects libido?",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "autism_and_lemonade",
                                    "body": "there’s very little research on how semaglutide affects libido, people have reported both increases and decreases",
                                    "score": 12,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "RG3ST21",
                    "body": "its WILD.  like I want it. I don't have that much weight to lose, but like hit me low dose, let me rot slower.",
                    "score": 36,
                    "replies": [
                        {
                            "author": "DifferentManagement1",
                            "body": "Same. And to kick impulsive spending? That would be amazing",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "PM_ME_BOYSHORTS",
                            "body": "You can absolutely do that. I was overweight but was not obese or anything. I went from 225 to 193 over the last couple months with zero effort on a relatively low, ramping dose. I feel so much better. I don't hate the person I see in the mirror, my clothes fit better, I have more energy. It's awesome.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "RG3ST21",
                                    "body": "yea, the cost at this point. isn't it hundreds per month?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "PM_ME_BOYSHORTS",
                                            "body": "Yeah it's expensive. My 6 month supply is like $1500 or something. so about $250 per month. Worth every penny if you can afford it.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "DifferentManagement1",
                                    "body": "How bad were your side effects? If any?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "mnewman19",
                    "body": "Oh god what if the “gut health will cure every disease” people were right",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Nvenom8",
                            "body": "Don’t even joke…",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Notoday44",
                            "body": "It’s not a particularly contested health claim",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SocraticTiger",
                    "body": "Reminds me of Naltrexone, which is also used for both obesity and alcoholism. There seems to be an overlap between addictive behaviors and overeating.",
                    "score": 31,
                    "replies": [
                        {
                            "author": "Nvenom8",
                            "body": "I guess that part's not really surprising. Both can result from inadequate dopamine responses.",
                            "score": 19,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SimoneNonvelodico",
                    "body": "Chemists just accidentally stumbling on the formulation of the philosopher's stone while messing around with molecules.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Boofin-Barry",
                    "body": "Alzheimers is basically a metabolic disease. AD, obesity, diabetes, and heart disease are all very closely related. If you have heart disease your brain is almost certainly toast. So it actually is a very logical study to conduct.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "Cthulhu208",
                    "body": "Turns out being overweight and having chronic inflammation is bad in a myriad of ways",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "Comp625",
                    "body": "It has penicillin vibes to me.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Flextt",
                    "body": "Yeah it seems to have a positive effect on the risk of relapse for alcohol and cocaine addiction - two very physical, severe forms of addiction.\n\nIt seems to be related to how semaglutide changes the positive reinforcement between substance (food, drug,...) and satiating a need.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Thebandroid",
                    "body": "...\nYeah I'm almost suspicious. To many instances of things that seemingly have a thousand uses later turning out to be really bad in life and media.\n\nSee asbestos, radium, many scifi examples",
                    "score": 8,
                    "replies": [
                        {
                            "author": "HotSauceRainfall",
                            "body": "GLP-1s have been around and studied since at least the late 1980s. \n\nSemaglutide will actually start to come off patent next year. Liraglutide aka Victoza came off patent this year. There will be a decent number of diabetic people who were on Victoza followed by Ozempic for up to 20 years at this point. If there were going to be radium-level problems, we would be seeing them by now. \n\nInstead, we’re looking at a penicillin-level breakthrough in human health.",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "srslybr0",
                                    "body": "the main problem with liraglutide is the fact it's a daily injection. even ozempic and zepbound are only once a week, but *daily* injections? woof.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "HotSauceRainfall",
                                            "body": "For the people who needed it, they probably were grateful to not be taking insulin shots multiple times a day. ",
                                            "score": 19,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DocSprotte",
                    "body": "That's what makes me sceptical. Just seems too good to be true. ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Nvenom8",
                            "body": "Or a lot of things are more closely related than we classically think of. This is why we need to do science. Understanding the underlying mechanisms could open up even more possibilities if the effects are real.",
                            "score": 42,
                            "replies": []
                        },
                        {
                            "author": "azzers214",
                            "body": "TBH - that's sort of the problem with what is essentially diseases of moral failing.  Weight gain, addiction, thrill seeking, or just about anything else you can think of.\n\nThe fact that human beings inherently have the just-world fallacy problem has dictated that perhaps certain diseases don't deserve study.  If you get cancer at the age of 40 if that's in your genetics, that's morally superior to having genetics predisposing you to obesity causing a heart attack at 40.\n\nTo me its not related to to-good-to-be-true.  It exposes how many things we failed to study or try to fix because we had morality as an excuse.",
                            "score": 21,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "dvrzero",
                    "body": "yeah, it's almost as if they want everyone taking it, no matter what. That's so cool!\n\nit also protects your heart. or hurts it. It also prevents covid deaths! but you may go blind.",
                    "score": -23,
                    "replies": [
                        {
                            "author": "Nvenom8",
                            "body": "Try not to cut yourself on your tinfoil hat.",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "dvrzero",
                                    "body": "at least my tinfoil doesn't cost $1000 a month",
                                    "score": -17,
                                    "replies": [
                                        {
                                            "author": "calantus",
                                            "body": "You can get it for less than 200, and as much as it saves on food/alcohol it can almost help people save money",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "dvrzero",
                                                    "body": "you'd need to cite <$200; because the lowest i've heard is >$300, and you have to not tell your insurance company about it. It's $499 from novo-nordisk.\n\nIf you're talking about compounding pharmacies, the semaglutide manufacturers did a *lot* of damage to their reputations, and i don't think people think \"oh, i'll just go to my *local compounding pharmacy* to get this!\" In Australia, they were raiding compounding pharmacies, saying \"omg maybe isn't safe!\" There was a supply issue, and all of the sudden compounding pharmacies can't be trusted? give me *a break*.\n\nit's also been linked to heart issues and suicidal thoughts. Also nausea, vomiting, emergency surgery, lump or swelling in your neck, stomach pain, pancreatitis, gall bladder issues, vision problems, heart racing, depression, dehydration and kidney problems.\n\nbut hey, whatever, right? Nevermind you have to take it for life to confer the benefits of it. last i heard, over 15,000,000 people were taking it regularly. That's a lot of extra money for insurance companies and the manufacturers. You all own stock, or what?",
                                                    "score": -7,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SingeHH",
            "body": "I actually started taking it for migraines. Calming inflammation down and for spinal pain etc when many other meds failed. It's gotten rid of my near constant migraines and I'm loosing weight. Win win.",
            "score": 167,
            "replies": [
                {
                    "author": "Butterflyelle",
                    "body": "I'm taking it for idiopathic intercranial hypertension that causes extreme headaches. There's some major trials showing it helps far beyond just the weight loss. I've only been on it 6 weeks and it's already making a difference.",
                    "score": 37,
                    "replies": [
                        {
                            "author": "SingeHH",
                            "body": "That's awesome to hear! My PCP is the one who recommended we try it for my migraines. I get really bad aura with mine. Last August it got to the point where I would have constant 24/7 migraines that went on for weeks. Within a couple weeks of starting sema that've all but gone away. I've had maybe 2 full blown migraines Since Oct. Its a game changer.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "coldcoffeethrowaway",
                                    "body": "Wow that’s awesome! I have migraines and I’m on the Ajovy shot. I went from having 1-2 migraines a week to have one every 3-4 months on it. I wonder if a GLP-1 medication would work similarly for me. I want to lose about 8 lbs but after I lose that, I don’t need to lose more so I wouldn’t want it to totally get rid of my appetite.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "SingeHH",
                                            "body": "I've stayed in fairly low doses of the glp1s as it wasn't my intent to lose weight originally but it's helped me control my diet to and I've lost close to 40 lbs already.  I had plenty to lose though so eventually it will level out I think if I stay on these small doses. As long as the migraines don't come back I'm going to stick with it long as I can.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "beewight",
                            "body": "I’m taking it for the same reason! I haven’t noticed a correlation with fewer headaches myself, but I’ve read others noting the same as you and I’m so glad it’s providing you and others with relief!! It’s so hard for some people to really understand just how debilitating the headaches/migraines from IIH are.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Butterflyelle",
                                    "body": "It's kind of awesome to find someone else taking it for iih too! Yeah no one really gets it. I really hope it helps you too with time. I'm on monjuaro so not the one specifically mentioned here but my neurologist has been trying to get me on any of the glp-1s since I was diagnosed a few years ago because it really is looking like an actual iih treatment which is so exciting!",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "beewight",
                                            "body": "It is very exciting!! I had a couple family members try to talk me out of starting on Wegovy after my neurologist prescribed it, but if Wegovy will allow me to get off diamox (which my neurologist just gave me the go ahead last week to begin weaning off diamox!!) then that alone is worth it for me! I’m really glad monjauro is working so well for you and may it continue to bring you relief! Wishing you the absolute best on your IIH journey!",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "astern83",
                            "body": "Tell me more",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "essjay2009",
                    "body": "You just made me realise I haven’t had a single migraine since I started taking it. And only one headache. That’s incredibly unusual for me. I wasn’t aware there was any evidence it was effective at preventing them.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Johnnygunnz",
            "body": "I remember a study a few years ago where they were calling Dementia/Alzheiner's \"type 3 diabetes\" because there was some evidence that the plaques and tangles in the brain could be caused by some people's inability to process sugars properly.\n\nOzempic helping with that gives a bit more validity to that theory.",
            "score": 285,
            "replies": [
                {
                    "author": "whatdidyousay509",
                    "body": "This makes a lot of sense. My grandfather started having issues with his pancreas, no signs of dementia at the time. A couple of years later, full blown diagnosis. I’m probably oversimplifying things, but it was hard not to notice his cognitive decline relative to that",
                    "score": 43,
                    "replies": []
                },
                {
                    "author": "JHMfield",
                    "body": "That might also explain why Keto diets have been noted to have some beneficial effects with the condition. Reducing the brain's reliance on sugars and having it utilize keto bodies for some of its energy needs instead could be helping. IF it is the issue with sugar processing that is the root cause, anyway.\n\nThe brain always needs some sugars, though, so it would also make sense why the beneficial effect would only go so far. Even in complete sugar absence from the diet, the body would produce its own from amino acids anyway.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "FamilyFunAccount420",
                            "body": "The keto diet was developed as a treatment for epileptic children to stop their seizures. I wouldn't be surprised if it could be a treatment for other neurological conditions.",
                            "score": 14,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Zebeydra",
                    "body": "I think some of the medications they take have dementia as a side effect as well. My dad is a type 2 that developed dementia after about 30 years on meds and we found out about the side effect after his diagnosis.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "demonslayercorpp",
            "body": "What if I’m already skinny tho will I get more skinny but at least my brain works",
            "score": 53,
            "replies": [
                {
                    "author": "fredlllll",
                    "body": "you will have to make a conscious effort to eat enough. these drugs work as weightloss drugs cause they lower the cravings for food (and evidently other things). so people automatically eat less.",
                    "score": 40,
                    "replies": [
                        {
                            "author": "Fuddle",
                            "body": "Hmm, wonder if it would help with Reddit addiction",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "fredlllll",
                                    "body": "i think ive read that it also lowers social media consumption, and impulse buying. basically all cravings. i wonder how it will affect relationships longterm, if it has the same effect on \"urges\"",
                                    "score": 32,
                                    "replies": [
                                        {
                                            "author": "cci605",
                                            "body": "Ohh so interesting. Would it affect dopamine levels then?",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "theVoidWatches",
                                            "body": "Apparently people have reported both increased and reduced libido. My uneducated guess would be that it reduces sexual cravings as well, but increased health can *boost* libido, and that ends up balancing in different ways for different people.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ostrichfart",
                            "body": "I'm hearing take it with cannabis.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Telemere125",
                    "body": "Ozempic tends to plateau with the weight loss at a certain point. I’m on it for type 2 diabetes and while I was losing weight at very high doses originally (because I need to do that too) I went down to a maintenance dose and I’m not losing any more, just keeping my glucose levels balanced. For me it was less about stopping cravings and more that it caused stomach paralysis and made me feel full longer. Now that I’m on a maintenance dose I eat what most people would probably call a normal sized meal and feel full.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "mvea",
            "body": "I’ve linked to the news release in the post above. In this comment, for those interested, here’s the link to the peer reviewed journal article:\n\nhttps://www.ibroneuroscience.org/article/S0306-4522(24)00604-3/abstract\n\nAbstract\n\nA growing number of studies show that the diabetes drug Semaglutide is neuroprotective in Alzheimer’s disease (AD) animal models, but its mode of action is not fully understood. In order to explore the mechanism of Semaglutide, 7-month-old APP/PS1/tau transgenic (3xTg) mice and wild-type (WT) mice were randomly divided into four groups: control group (WT + PBS), AD model group (3xTg + PBS), Semaglutide control group (WT + Semaglutide) and Semaglutide treatment group (3xTg + Semaglutide). Semaglutide (25 nmol/kg) or PBS was administered intraperitoneally once every two days for 30 days, followed by behavioral and molecular experiments. The results show that Semaglutide can improve working memory and spatial reference memory of 3xTg-AD mice, promote the release of anti-inflammatory factors and inhibit the production of pro-inflammatory factors in the cortex and hippocampus, and reduce Aβ deposition in the hippocampal CA1 region of 3xTg mice. Semaglutide can inhibit the apoptosis of BV2 cells induced by Aβ1-42 in a dose-dependent manner and promote the transformation of microglia from M1 to M2, thereby exerting anti-inflammatory and neuroprotective effects. Therefore, we speculate that Semaglutide shows an anti-inflammatory effect by promoting the transformation of microglia from M1 to M2 type in the brain of 3xTg mice, and thus exerts a neuroprotective effect.\n\nFrom the linked article: \n\nA new study suggests that semaglutide, a drug commonly used to treat diabetes, may help protect the brain from the effects of Alzheimer’s disease. Researchers found that semaglutide reduced inflammation in the brains of genetically modified mice that mimic Alzheimer’s disease and improved their memory performance. The findings, published in the journal Neuroscience, add to growing evidence that diabetes medications may offer benefits for neurodegenerative diseases, though more research is needed to understand how these drugs exert their effects.\n\nThe results showed that semaglutide improved both short-term and long-term memory in the Alzheimer’s model mice. In a test called the Y-maze, which measures spatial working memory, untreated Alzheimer’s model mice performed significantly worse than normal mice. However, those treated with semaglutide showed improved memory performance, nearly matching the healthy control mice. Similarly, in the Morris water maze, a test that assesses long-term spatial memory, semaglutide-treated mice found the hidden platform more quickly than untreated Alzheimer’s model mice.\n\nOn a biological level, semaglutide reduced the amount of amyloid plaque in the hippocampus, a brain region crucial for memory. The researchers also found that semaglutide lowered levels of inflammatory molecules such as interleukin-1 beta and tumor necrosis factor-alpha, which are known to contribute to brain cell damage. At the same time, semaglutide increased levels of anti-inflammatory molecules such as interleukin-4 and interleukin-10, which help protect brain cells.\n\nOne of the key findings was that semaglutide appeared to change the behavior of microglia, the brain’s immune cells. In Alzheimer’s disease, microglia become overly activated and release harmful inflammatory substances. Semaglutide encouraged microglia to shift from a pro-inflammatory state, known as the M1 type, to an anti-inflammatory state, known as the M2 type. This transformation is thought to reduce brain damage and promote healing.\n\nTo further investigate how semaglutide affects inflammation, the researchers conducted additional experiments using cultured microglial cells. When these cells were exposed to amyloid beta, a toxic protein linked to Alzheimer’s, they became inflamed and started releasing harmful substances. However, when the cells were pretreated with semaglutide, they produced fewer inflammatory molecules and were less likely to undergo cell death.",
            "score": 35,
            "replies": []
        },
        {
            "author": "Battlepuppy",
            "body": "Insulin resistance in the brain  is connected to alzheimers,  so this makes a lot of sense.",
            "score": 33,
            "replies": []
        },
        {
            "author": "troelsy",
            "body": "My gran died of Alzheimer's. Danish. She was put on some experimental drug and certainly saw some improvement at the beginning. But very short lived. Maybe 2 months of it being effective and then RABBIT decline. How are things 15 years later?",
            "score": 22,
            "replies": [
                {
                    "author": "Jewnadian",
                    "body": "Honestly that's the best case scenario for Alzheimer's. Slow it down nothing for as long as possible then crash out. That's the same as not having Alzheimer's in a way.",
                    "score": 25,
                    "replies": []
                },
                {
                    "author": "DeepSea_Dreamer",
                    "body": "> How are things 15 years later?\n\nI had a family member die of Alzheimer's a year ago. Not much better.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "callmejeremy0",
            "body": "More evidence that Alzheimer's is  type 3 diabetes.",
            "score": 13,
            "replies": []
        },
        {
            "author": "thewildbeej",
            "body": "The problem is many people with alzheimers tend to have already lost some weight. How do you keep it from wrecking a body of someone with it already suffering from weight loss.",
            "score": 5,
            "replies": [
                {
                    "author": "MDPROBIFE",
                    "body": "You eat more calories",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ugh_please_just_no",
            "body": "I mean, obesity causes inflammation too so it’s kind of a double whammy in reduction of inflammation.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Extension_Support_22",
            "body": "I read a lot of good things about semaglutides even outside the weight loss effects, does someone know why it looks so good on paper ? Or is it just me ?",
            "score": 6,
            "replies": []
        },
        {
            "author": "Inqusitive_dad",
            "body": "Someone needs to research if it helps with adhd",
            "score": 6,
            "replies": []
        },
        {
            "author": "pm-me-ur-beagle",
            "body": "My mother in law was on a double blind trial for this medication, which she had to stop because of certain issues. While we cannot know for sure if she received the actual medication, her cognition 100% took an absolute nose dive after leaving the study. Of course the disease progressed, but it was catastrophic. We strongly suspect she was on semaglutide and that it bought a couple of additional quality years with her.",
            "score": 5,
            "replies": []
        },
        {
            "author": "platinumarks",
            "body": "Technically, it's a diabetes drug also used for weight loss.",
            "score": 25,
            "replies": [
                {
                    "author": "koos_die_doos",
                    "body": "Soon to be alzheimers drug also used for weight loss and diabetes…\n\n(Hopefully)",
                    "score": 34,
                    "replies": [
                        {
                            "author": "Far-Ring743",
                            "body": "And also being studied for its ability to reduce cravings and addictions to alcohol, drugs, gambling, and shopping. I have very much enjoyed my access to compounded semaglutide and am sad that compounding is being cut off next month. I can’t afford the brand name.",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "ItsDrGoodWood",
                                    "body": "Don’t know what you’re paying for compounded but Wegovy is 400/month cash pay if you can get your doctor to prescribe it.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Far-Ring743",
                                            "body": "Kaiser won’t allow me to have it so I go through a tele health. They think they are going to be able to fight the cut off day but I am resigned that I only have a few more months. Not sure the price of the branded stuff but I’m only a few pounds from goal and am beginning the taper anyway. I’m a little worried about the food noise coming back but I have added some healthy habits that should help me maintain my loss on my own. We will see.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ArtODealio",
                            "body": "It is supposed to also have cardiovascular benefits.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "UnlikelyAssassin",
                    "body": "It’s as much of a diabetes drug as it is a weight loss drug at this point. It’s FDA approved for both conditions.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "HotSauceRainfall",
                    "body": "It’s a neuroendocrine modulating drug. Diabetes control was only the first use case. ",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "2wice",
            "body": "I used to take a handful of pills every day, gout, pain and BP pills. My gout is gone, BP is fine, lost 15kg and can swim 2km in 80min, stopped drinking. Only one pill left.",
            "score": 4,
            "replies": []
        },
        {
            "author": "CutLow8166",
            "body": "Honest question, I usually see these articles and their trials on mice. How long normally (if there is a average amount of time) do these trials start with humans?",
            "score": 3,
            "replies": [
                {
                    "author": "GapTerrible2179",
                    "body": "Typically it takes several years. Where semaglutide has been used for other conditions and we already have safety data on it it will be quicker to move to human trials than a new drug would be, but it’ll likely take at least a few years before it could be prescribed for Alzheimer’s treatment assuming all goes well. If I remember correctly a new drug usually takes around 7 years from the first human trials to becoming publicly available (assuming there aren’t any major problems), so I’d estimate maybe 3-5 in this situation but I’m not an expert and there could be more variables at play here",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Jewnadian",
                    "body": "This data will be coming out of the population studies regardless though, if 1-8 adults in America has tried a GLP the trends will appear on their own.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "PunkyTay",
            "body": "Do we know if we’re seeing any similar benefits with trizepatides?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Schan122",
            "body": "Yet we still refuse to call it diabetes type III. Someday the US will catch up.",
            "score": 3,
            "replies": []
        },
        {
            "author": "waxisfun",
            "body": "Would this mean that there is a link between excessive sugar consumption and alzheimers?",
            "score": 2,
            "replies": [
                {
                    "author": "UnlikelyAssassin",
                    "body": "No, that doesn’t follow whatsoever",
                    "score": 4,
                    "replies": [
                        {
                            "author": "waxisfun",
                            "body": "Why not? A drug that helps manage diabetes also seems to have an impact on alzeihmers. It's just conjecture, but I wouldn't be surprised if there was buried research out there about a link between sugar and diabetes.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "National-Friend777",
                                    "body": "Here's a journal in PubMed on this: [https://pmc.ncbi.nlm.nih.gov/articles/PMC7246646/](https://pmc.ncbi.nlm.nih.gov/articles/PMC7246646/)",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "impacted_bowel",
            "body": "How could this one drug be so good for so many things?",
            "score": 1,
            "replies": [
                {
                    "author": "PM_ME_BOYSHORTS",
                    "body": "Because many of them are likely related, we just don't know exactly why.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "CalicoValkyrie",
            "body": "Semaglutide is suspiciously becoming the magical miracle drug that cures everything way to hard. If it really does help with all of these issues, someone needs to figure out why so we can work on prevention and not create a $1k subscription service for good health.",
            "score": 1,
            "replies": []
        },
        {
            "author": "grahampositive",
            "body": "Encouraging but not surprising. Metformin has been proposed for this decades ago \n\n[https://pmc.ncbi.nlm.nih.gov/articles/PMC4772077/#:\\~:text=2013)%2C%20and%20it%20was%20recently,and%20dementia%20(Ng%20et%20al](https://pmc.ncbi.nlm.nih.gov/articles/PMC4772077/#:~:text=2013)\n\n>Moreover, diabetic and cardiovascular disease patients who are prescribed metformin have increased rates of survival ([Scarpello 2003](https://pmc.ncbi.nlm.nih.gov/articles/PMC4772077/#A025932C91); [Yin et al. 2013](https://pmc.ncbi.nlm.nih.gov/articles/PMC4772077/#A025932C105)), and it was recently proposed that metformin might promote longevity by preventing frailty in older adults with T2DM ([Wang et al. 2014](https://pmc.ncbi.nlm.nih.gov/articles/PMC4772077/#A025932C103)). Chronic treatment with metformin among patients with diabetes might reduce the risk of cognitive decline and dementia ([Ng et al. 2014](https://pmc.ncbi.nlm.nih.gov/articles/PMC4772077/#A025932C80); [Patrone et al. 2014](https://pmc.ncbi.nlm.nih.gov/articles/PMC4772077/#A025932C84)) and improve survival in several types of cancer ([Greenhill 2015](https://pmc.ncbi.nlm.nih.gov/articles/PMC4772077/#A025932C43); [Ko et al. 2015](https://pmc.ncbi.nlm.nih.gov/articles/PMC4772077/#A025932C58); [Lin et al. 2015](https://pmc.ncbi.nlm.nih.gov/articles/PMC4772077/#A025932C66); [Rego et al. 2015](https://pmc.ncbi.nlm.nih.gov/articles/PMC4772077/#A025932C89)).",
            "score": 1,
            "replies": []
        },
        {
            "author": "ninjastampe",
            "body": "It's most likely because people sleep better when they're less/not overweight. Apnea gets better, overall health improves. Alzheimers and neurodegenerative diseases like it are strongly associated with poor sleep quality.",
            "score": 1,
            "replies": []
        },
        {
            "author": "remic_0726",
            "body": "I'm taking bets, a study commissioned by a laboratory that manufactures the molecule. Soon the super molecule will make you lose weight, rejuvenate, fight baldness, fight impotence...",
            "score": 0,
            "replies": [
                {
                    "author": "boooooooooo_cowboys",
                    "body": "You don’t need to take bets, you can just look at the authors/affiliations on the paper. \n\nAlso, tons of labs manufacture semaglutide and it’s pretty damn cheap to get the research grade stuff. No sponsorship necessary. ",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "epia343",
            "body": "It just might make you go blind or paralyze your stomach.",
            "score": 0,
            "replies": []
        },
        {
            "author": "diablol3",
            "body": "We're those the transgendered mice I've heard so much about?",
            "score": -1,
            "replies": []
        },
        {
            "author": "Mundane_Range3787",
            "body": "if ya just don't let the brain have any sugar to activate with, then it can't misfire due to the missing pieces it can't see !",
            "score": -1,
            "replies": []
        },
        {
            "author": "head_opener",
            "body": "Probably because people on semaglutide are eating less processed/junk foods and are inadvertently healing their enteric nervous system",
            "score": -25,
            "replies": [
                {
                    "author": "FitDontQuit",
                    "body": "This is in mice. Nothing to do with junk food",
                    "score": 22,
                    "replies": []
                }
            ]
        },
        {
            "author": "Snug007",
            "body": "Being constantly ill and feeling like your throat will close all the time but other than that",
            "score": -13,
            "replies": []
        },
        {
            "author": "dan23pg",
            "body": "Too bad it will only be used to slim down white suburban moms.",
            "score": -27,
            "replies": []
        }
    ]
}