{
    "title": "Around one in four women with breast cancer undergo an armpit lymph node removal surgery and some of them develop lymphedema, swelling in the arm, even years after the surgery. Lymph node transfer from the groin area is a viable treatment for lymphedema and can significantly improve quality of life.",
    "author": "universityofturku",
    "subreddit": "science",
    "rank": 11,
    "score": 465,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 27,
    "url": "https://www.utu.fi/en/news/press-release/lymph-node-transfer-reduces-arm-swelling-after-breast-cancer-surgery",
    "id": "1je2nqf",
    "selftext": "",
    "comments": [
        {
            "author": "universityofturku",
            "body": "Read the research article: [https://journals.lww.com/plasreconsurg/abstract/2025/02000/phase\\_ii\\_study\\_shows\\_the\\_effect\\_of\\_adenoviral.4.aspx](https://journals.lww.com/plasreconsurg/abstract/2025/02000/phase_ii_study_shows_the_effect_of_adenoviral.4.aspx)",
            "score": 15,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) apply to all other comments.\n\n---\n\n**Do you have an academic degree?** We can verify your credentials in order to assign user flair indicating your area of expertise. [Click here to apply](https://www.reddit.com/r/science/wiki/flair/).\n\n---\n\nUser: u/universityofturku  \nPermalink: https://www.utu.fi/en/news/press-release/lymph-node-transfer-reduces-arm-swelling-after-breast-cancer-surgery\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "score": 0,
            "replies": []
        },
        {
            "author": "-Mediocrates-",
            "body": "What if deodorant is the cause of breast cancer because of all the chemicals in deodorant",
            "score": -117,
            "replies": [
                {
                    "author": "leahlisbeth",
                    "body": "I would leave the hypothesising to someone else if I were you",
                    "score": 86,
                    "replies": [
                        {
                            "author": "-Mediocrates-",
                            "body": "Why is that? Through USA history all sorts of popular pruducrs were shown to cause cancer years later. This concept is nothing new and has a track record of occurring many times. \n\n.\n\nSure is weird how breast cancer is non existent in countries that don’t wear deodorants as part of their culture",
                            "score": -81,
                            "replies": [
                                {
                                    "author": "Pkyr",
                                    "body": "Where is breast cancer non existent?",
                                    "score": 51,
                                    "replies": [
                                        {
                                            "author": "No_Temperature8234",
                                            "body": "In countries with very high birthrates it almost doesnt exist. Africa has very low breast cancer rates.\n\nEdit. https://www.nih.gov/news-events/news-releases/nih-scientists-find-breast-cancer-protection-pregnancy-starts-decades-later\nTheres tons of info on this for anyone interested.",
                                            "score": -31,
                                            "replies": [
                                                {
                                                    "author": "raspberrih",
                                                    "body": "You don't think it has anything to do with how many people get checked for breast cancer?",
                                                    "score": 49,
                                                    "replies": [
                                                        {
                                                            "author": "No_Temperature8234",
                                                            "body": "Ofc but it's also proven that having more children lowers risk of breast cancer significantly.",
                                                            "score": -8,
                                                            "replies": [
                                                                {
                                                                    "author": "rowrowfightthepandas",
                                                                    "body": "Okay and that has what to do with deodorant..?",
                                                                    "score": 10,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "greyghibli",
                                                                    "body": "What is your source for that? I feel like if anything, it would be the opposite: estrogen and progesterone levels spike during pregnancy and higher levels of each are linked to breast cancer. Pregnancy can also make the breast tissue permanently larger, larger breasts are also related to breast cancer risk.",
                                                                    "score": 8,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Pkyr",
                                                    "body": "Can you provide a source?",
                                                    "score": 7,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Anon28301",
                                                    "body": "You do know breastfeeding can reduce the likeliness of getting breast cancer, maybe that’s the correlation. Reduce mind you, it’s doesn’t completely eliminate the chance. A low cancer rate is not the same as no cancer rate.",
                                                    "score": 10,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "PlacatedPlatypus",
                                    "body": "China and Japan still have relatively high BC incidence despite both countries also rarely using deodorant. \n\nBC is known to be highly hereditary, so the more convincing explanation of national incidence rate is ethnic hereditary factors rather than anything environmental.",
                                    "score": 36,
                                    "replies": []
                                },
                                {
                                    "author": "rich1051414",
                                    "body": "There are too many real things to worry about, your energy would be better served thinking about those things rather than making up new things to worry about, on speculation alone.",
                                    "score": 13,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Threlyn",
                    "body": "Seems like some studies have looked at it and have found it to be unlikely\n\nhttps://www.cancer.org/cancer/risk-prevention/chemicals/antiperspirants-and-breast-cancer-risk.html",
                    "score": 49,
                    "replies": [
                        {
                            "author": "-Mediocrates-",
                            "body": "Were the studies paid for by deodorant companies? That’s a serious problem in the USA as it undermines the integrity of many “scientific” studies. \n\n.\n\nDon’t get the grant money if you don’t provide the results that the givers of he grant money wanted in the first place",
                            "score": -59,
                            "replies": [
                                {
                                    "author": "visceralintricacy",
                                    "body": "Surely if that was the case at least one deodorant company would identify this, though, and be like, we're the one deodorant that *doesn't* give you cancer!",
                                    "score": 24,
                                    "replies": [
                                        {
                                            "author": "facelessfriendnet",
                                            "body": "Exactly, if I'm farming lemons I'd like to fund studies on the risks and benefits of lemons. Plenty of studies have changed products formulas, marketing claims and made things SAFER by grants from industry. \n\nOf course, there's room for skepticism.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Anon28301",
                                    "body": "No not all the studies on if deodorant causes breast cancer are paid by the deodorant companies. Do you really think this hasn’t been questioned before? Also I’ve seen studies from other countries on this, countries where it’s illegal for companies to publish research on behalf of private companies.\n\n\nYou’re just showing everyone here that you have no idea what you’re talking about. I’m genuinely embarrassed for you, please show this comment to a researcher and they’ll laugh at you in your face.",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "tapo",
                    "body": "The lymph node isn't the origin of the cancer, it's typically ductal cells in the breast. The lymph node is where those cells first spread beyond the breast.",
                    "score": 37,
                    "replies": [
                        {
                            "author": "canvanman69",
                            "body": "Exactly so.\n\nThey're also the part of your body responsible for dealing with pathogens and infections. Anything your body thinks is odd gets trapped there.",
                            "score": 9,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}