{
    "title": "A new way of estimating rural populations has found that we may be undercounting people who live in these areas, potentially inflating the global population beyond the official count of 8.2 billion",
    "author": "New_Scientist_Mag",
    "subreddit": "science",
    "rank": 8,
    "score": 507,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 14,
    "url": "https://www.newscientist.com/article/2472604-have-we-vastly-underestimated-the-total-number-of-people-on-earth/",
    "id": "1je7znp",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) apply to all other comments.\n\n---\n\n**Do you have an academic degree?** We can verify your credentials in order to assign user flair indicating your area of expertise. [Click here to apply](https://www.reddit.com/r/science/wiki/flair/).\n\n---\n\nUser: u/New_Scientist_Mag  \nPermalink: https://www.newscientist.com/article/2472604-have-we-vastly-underestimated-the-total-number-of-people-on-earth/\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "RyanSrGold",
            "body": "Yes, the math just wasn't mathing with these mammals.",
            "score": 32,
            "replies": []
        },
        {
            "author": "AllanfromWales1",
            "body": "Any chance it's lots of people fraudulently claiming to live in areas to be dammed in order to claim resettlement grants? Or even deliberately moving into these areas for the grants?",
            "score": 15,
            "replies": [
                {
                    "author": "BrowntownJ",
                    "body": "Take the dumbest person you know. \n\nNow realize that half the world is either as stupid or more stupid as them. \n\nNever assign to malice what can be attributed to incompetence",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "OfSpock",
                    "body": "Rural Chinese have been lying about the existence of daughters for years. One article I read, the guy had five daughters and only confessed to one and his son.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Ratnix",
                    "body": "I think it's more likely people just not filling out the census form,  or not filling them out correctly.  \n\nI almost threw it away when i got it, like i do with like 95% of what i get in my mailbox. \n\nAnd I'm letting a friend crash with me so he can lick his wounds and get back on his feet.  I don't remember if i included him on it or not.  \n\nI can imagine a lot of them just not getting filled out or excluding people who \"live\" with you.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "KubiJakka",
            "body": "Not the most dumbest but the most average person you know.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Lonely_Refuse4988",
            "body": "Ooof! Just what we needed to hear! Now rural areas are more crowded than thought!!",
            "score": 1,
            "replies": []
        }
    ]
}