{
    "title": "New research led by U-Michigan is believed to be the first to evaluate the link between heavy and prolonged menstrual bleeding and fatigue and lack of pep as women approach menopause. The study follows 2,329 midlife women who kept menstrual diaries and completed annual surveys from 1996 to 2005.",
    "author": "umichnews",
    "subreddit": "science",
    "rank": 9,
    "score": 325,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 32,
    "url": "https://news.umich.edu/abnormal-menstrual-bleeding-a-likely-culprit-in-menopausal-fatigue-rarely-discussed-as-cause/",
    "id": "1je8wd3",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) apply to all other comments.\n\n---\n\n**Do you have an academic degree?** We can verify your credentials in order to assign user flair indicating your area of expertise. [Click here to apply](https://www.reddit.com/r/science/wiki/flair/).\n\n---\n\nUser: u/umichnews  \nPermalink: https://news.umich.edu/abnormal-menstrual-bleeding-a-likely-culprit-in-menopausal-fatigue-rarely-discussed-as-cause/\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Vexed_Violet",
            "body": ".... lack of pep. What an infuriating title. I think anyone would have a lack of pep with prolonged, heavy bleeding. Ugh",
            "score": 369,
            "replies": [
                {
                    "author": "BAD4SSET",
                    "body": "It’s so egregious that I auto assumed “pep” was a nickname for some peptide or medical term I didn’t know. ",
                    "score": 71,
                    "replies": []
                },
                {
                    "author": "Fast_Adeptness_9825",
                    "body": "Why are some of these studies so dang obvious?  Let's see, if you bleed out of your crotch for over a week, are you gonna feel peppy?",
                    "score": 67,
                    "replies": [
                        {
                            "author": "hananobira",
                            "body": "To be fair, this is something that needed studying. The problem is, it should have been studied somewhere around 100 years ago. It’s embarrassing that it’s happening in 2025.",
                            "score": 79,
                            "replies": [
                                {
                                    "author": "migs647",
                                    "body": "I was hoping “pep” was a new word I wasn’t familiar with. Sadly it wasn’t. ",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DocumentExternal6240",
                    "body": "Exactly, you LITERALLY. loose blood. Every month until menopause.",
                    "score": 20,
                    "replies": []
                }
            ]
        },
        {
            "author": "dreamingrain",
            "body": "Subjectively I know when my fibroids made themselves known and I bled heavily for an entire month I was exhausted. Even with multivitamins etc to keep up the lost necessaries all I could do was crawl into bed at the end of the day. I'm not shocked at all to hear this.",
            "score": 62,
            "replies": []
        },
        {
            "author": "LEANiscrack",
            "body": "Always blows my mind how far behind womens healthcare is from men.\nIts like women are not the norm but something special. ",
            "score": 222,
            "replies": [
                {
                    "author": "Altruistic_Sun_1663",
                    "body": "Not even special, but an aberration. \n\nYou can even be a woman seeing a female doctor and share all these difficult symptoms, and the doc will just shrug their shoulders and dismiss it as normal aging stuff. So many of us end up with anemia that could have been prevented.",
                    "score": 121,
                    "replies": [
                        {
                            "author": "lolamongolia",
                            "body": "My bff was bleeding heavily for months at a time, was severely fatigued, and was generally miserable. She saw her PCP about it. Her doc told her to lose weight and didn't offer any sort of testing, treatment, or referral options.  At her annual gyno appointment, she explained what was going on and upon testing they discovered she had a uterine condition and she was so anemic they admitted her to the hospital for iron infusions. Her condition required a hysterectomy. She was sick for almost a year because her doctor wouldn't take her seriously.",
                            "score": 19,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "snowglobes4peace",
                    "body": "It's actually wild. Breasts change throughout the lifespan and there isn't a single medical specialty that deals with them.",
                    "score": 38,
                    "replies": []
                },
                {
                    "author": "Phoenyx_Rose",
                    "body": "We weren’t the norm for a long time in research. Lots of researchers excluded women from studies under the guise that our hormonal fluctuations would affect data too much and be too hard to normalize for. So white men were the research “normal”. ",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "epigenie_986",
            "body": "Well good job!  They've finally tackled a problem we've had since.... \n\n\n\noh, um.. the beginning of humanity.",
            "score": 67,
            "replies": []
        },
        {
            "author": "umichnews",
            "body": "I've linked to the press release in the above post. For those interested, here's the study: [Abnormal uterine bleeding is associated with fatigue during the menopause transition](https://journals.lww.com/menopausejournal/fulltext/9900/abnormal_uterine_bleeding_is_associated_with.438.aspx) (DOI: 10.1097/GME.0000000000002525)",
            "score": 35,
            "replies": [
                {
                    "author": "Rhywden",
                    "body": "Thank you for sharing that. My partner is currently going through perimenopause and had to consult several gynaecologists until she finally found one who told her that her frequent bleeding was not abnormal during this phase.\n\nUntil then they basically shrugged their shoulders and recommended either the pill or an IUD (both of which she had bad experiences with).",
                    "score": 20,
                    "replies": [
                        {
                            "author": "garbagegoat",
                            "body": "I had similar issues and went with an nova-sure ablation. Highly recommend it if possible for your partner. Recovery was fairly mild and I've been period free for a decade now.",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "cantcountnoaccount",
                            "body": "Shortened cycles are both a normal symptom of perimenopause and also the only noticeable symptom of uterine cancer. \n\nYou can choose between an invasive transvaginal ultrasound and a horrifying uterine biopsy, to learn if you’re totally normal or about to die.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Battlepuppy",
            "body": "I'm glad that women's health is being  studied at all.\n\nWe will take what we can get, and ask for more.",
            "score": 12,
            "replies": []
        },
        {
            "author": "Tricky-Juggernaut141",
            "body": "The stigma and distrust for birth control pills needs to be addressed, too.  Women will often try one pill, have a horrible experience, and write them off altogether.  The right pill can be the difference between a miserable Perimenopause experience, and one that's at least bearable.  \n\nMy personal anecdotal experience was that I had to try different progesterones until I found one that worked.  \n\nDesogestrel made me emotionally flat and completely eliminated my libido, along with reducing any pleasure from physical contact.  I was physically numb in my clitoris.  \n\nDrospirenone reversed those issues completely.  I am happy again and want to be physical (and can enjoy it).  \n\nLastly, the type and amount of estrogen in the pill varies and can also make a difference.  I found Nextstellis (new form of Estrogen) to control my constant bleeding more than Yaz or Yasmin (which had my preferred progesterone.)  Unfortunately, my periods are still incredibly heavy and painful.  \n\nShould the pill be an altogether wrong move, there are weaker forms of HRT like estradiol patches, gels/creams, progesterone in various forms, etc.  \n\nIf all else fails, a uterine ablation can be effective, which is my next step.",
            "score": 32,
            "replies": [
                {
                    "author": "CutieBoBootie",
                    "body": "I think the issue with that is multifold. \n\n\n1. Many pharmacies will just substitute one pill for another wothout telling the patient. (I had an adverse reaction this way)\n2. Birth control pills take MONTHS for their full range of side effects to be realized. The BC pill I am on now gave me uncontrollable insomnia and sleepiness at random times for the first 2 months I took it before settling down. (I have period hormone induced insomnia and the pill triggered it until my body got used to the new hormones)\n3. The negative side effects can be life altering. That makes it scary for most women who already lack control in this area. I personally know a woman who lost the ability to walk at the age of 32 because her BC gave her a stroke. I know another woman whose BC gave her near homicidal rage that went away as soon as she ended treatment.\n\n\n\nI think medicine that it based around feminine hormones is genuinely lacking on what it can do to the human body and as a result women are left behind.",
                    "score": 33,
                    "replies": []
                }
            ]
        },
        {
            "author": "jyar1811",
            "body": "Pep? Is there Benzedrine somewhere I don’t know about ??",
            "score": 11,
            "replies": []
        }
    ]
}