{
    "title": "I’m almost positive that Rockstar drew inspiration from this game when developing the first Redemption.",
    "author": "eineehpoB",
    "subreddit": "reddeadredemption",
    "rank": 17,
    "score": 103,
    "upvote_ratio": 0.84,
    "num_comments (reported by reddit)": 49,
    "url": "https://i.redd.it/8kkr9wtpugpe1.jpeg",
    "id": "1je7kf1",
    "selftext": "",
    "comments": [
        {
            "author": "Honorsheets",
            "body": "I think it was the other way around, Gun drew inspiration from Red Dead Revolver and tried to market it as a better one.\n\nI wasn't impressed when it came out though, but it wasn't a bad game. I applauded Neversoft for making something that wasn't a Tony Hawk game.",
            "score": 84,
            "replies": [
                {
                    "author": "Lanky-Fish6827",
                    "body": "I was totally impressed and found gun waaaay better than Revolver. Such a nice open world on PS2.",
                    "score": 58,
                    "replies": [
                        {
                            "author": "Honorsheets",
                            "body": "I'm sure. It was 20 years ago so I don't quite remember everything. I just remember all the hype in every game publication and just not being that impressed from the hype. I didn't think Revolver was better or worse, just a different experience.\n\nThen Redemption came out and kind of blew everything out of the water 5 years later.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "AdministrativeEmu855",
                            "body": "Yeah, it wasnt even close, Gun was great.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "slintslut",
                    "body": ">applauded Neversoft for making something that wasn't a Tony Hawk game\n\nApocalypse, Spider-Man and MDK were all awesome games",
                    "score": 14,
                    "replies": [
                        {
                            "author": "Honorsheets",
                            "body": "You're 100% right and have true gamer taste.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "MOOshooooo",
                            "body": "MDK was awesome for a 12 year old me. It was dark and funny. Never beat it though.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "OrickJagstone",
                            "body": "They were a great company people are just so opinionated about games these days. \n\nSo frequently I find myself asking all the time \"what would 12 year old me say\" like I wouldn't be complaining about what gender the main character was, how it looked, \"inspired\" a game was, I would just be like, \"whoa, I can shoot stuff this is awesome!\" While I'm older and I am sure that I have some larger expectations than I did then, I always try and keep that in mind. \n\nTo me, I think a lot of people, the only thing that truly matters is gameplay. I don't care if Im a trans rainbow unicorn in the Trump galaxy. If I have fun playing it it's a win",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "smrtfxelc",
                    "body": "Maaaate I loved this game, for its time it was pretty fleshed out and the story was really good. I actually bought a PS2 to play it again a few months,, ago & enjoyed it even more than the first time I played when I was a kid.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "ericypoo",
                    "body": "Gun and Red Dead Revolver are nothing alike. Other than being in a western setting and that you’re a cowboy. They play nothing alike and have no similar mechanics.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "ShakeMistake_",
            "body": "Red Dead Revolver came out in 2004, Gun came out in 2005 and had better ratings and was better received. It's completely likely that Gun looked to improve Red Dead Revolver, and that R\\* took notes from Gun when making Red Dead Redemption 1.",
            "score": 29,
            "replies": []
        },
        {
            "author": "Slopadopoulos",
            "body": "Great game. I still have my copy.",
            "score": 7,
            "replies": []
        },
        {
            "author": "TakeItUpA_Nacho",
            "body": "Fucking \"Honest\" Tom",
            "score": 6,
            "replies": []
        },
        {
            "author": "honkymotherfucker1",
            "body": "I loved this game",
            "score": 3,
            "replies": []
        },
        {
            "author": "RagnawFiregemMobile",
            "body": "Whos gonna tell him about Red Dead Revolver?",
            "score": 8,
            "replies": [
                {
                    "author": "PSFredo",
                    "body": "Revolver isn't open world",
                    "score": 1,
                    "replies": [
                        {
                            "author": "RagnawFiregemMobile",
                            "body": "It's not?",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MunkSWE94",
            "body": "Love Gun, it has this early 00's angst/edgy vide that I miss.\n\nRDR i think took more inspiration from post 60's revisionist westerns like The Wild Bunch (the whole Mexico chapter is basically that movie) and a style that was popular in the early 10's.",
            "score": 3,
            "replies": []
        },
        {
            "author": "wassinderr",
            "body": "Little 10 yo me was just scalping every body I could get my hands on",
            "score": 3,
            "replies": [
                {
                    "author": "The_Wolf_Shapiro",
                    "body": "Maybe I’m too much of a BLOOD MERIDIAN fan, but I always thought you should be able to scalp people for money (at the cost of honor) in the RDR series.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "wassinderr",
                            "body": "Could be a period thing. At least with RDR2. Might feel forced in a game set <10 years from the 1900s. \n\nScalping also has a strong racial connotation to it. So today's climate might not have much room for doing it for funsies in a game leaning towards realism.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "The_Wolf_Shapiro",
                                    "body": "Yeah, 1899 was well past the scalp-hunting era, but it was also well past the large scale Indian warfare era and between incarnations of the Klan, so historical realism probably wasn’t as big a concern as the association of scalping with Native groups (despite the fact that everyone did it).",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "wassinderr",
                                            "body": "I think they crunched the historical timeline to help paint their narrative of changing times. Scalping just wouldn't have fit in with it as something the playable character can do. \n\nIf it happened in game by someone else's hand, it could fit right in. Actually, it would have contributed to a more bleak and heavy atmosphere imo",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "The_Wolf_Shapiro",
                                                    "body": "It’s kinda sorta implied with the Skinners. I got the sense R* took some inspiration from the Glanton gang for them.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "wassinderr",
                                                            "body": "I think you're onto something there. But yeah, forgot about the skinners.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheFlaccidChode",
            "body": "Didn't it begin with a botched paddle boat heist?",
            "score": 3,
            "replies": []
        },
        {
            "author": "GentlmanSkeleton",
            "body": "That final boss tho. \"UUAAARRRGGHHH, WHATTA YA DONE TA MEH?!\"",
            "score": 3,
            "replies": []
        },
        {
            "author": "RedPaladin26",
            "body": "It’s a good game",
            "score": 5,
            "replies": []
        },
        {
            "author": "Judoka229",
            "body": "I loved that game. It was pretty dark. I remember going into first person with double peace makers and blowing natives apart. I also remember scalping people and maybe using scalps to pay for upgrades or something.\n\nEdit: I should note that I am not for massacring natives nor am I for scalping. It was a fun game to play, despite the dark subject matter.",
            "score": 5,
            "replies": [
                {
                    "author": "SmilingSunBlackMoon",
                    "body": "Yo I forgot scalping! That shit was crazy, definitely wanna see that in RDR3.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "cutterdeblanc",
            "body": "I remember you got a gun that shoots cannonballs if you beat the game",
            "score": 2,
            "replies": []
        },
        {
            "author": "Plane_Example9817",
            "body": "I loved Gun great game.",
            "score": 2,
            "replies": []
        },
        {
            "author": "JunkerMethod",
            "body": "I actually just played through this for the first time a couple of years ago. Obviously a mess compared to the polish of Red Dead, but I was quite surprised how good it was and how much fun I had playing it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "mateorayo",
            "body": "You could absolutely fuck people up with your horse in this game. I also seem to remember a giant Kodiak grizzly being involved at some point.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Foppish_Sloth",
            "body": "Will never forget saving the Alhambra saloon at the beginning of that game. Or the boss guy at the end. Fun times.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sr_darkzinho",
            "body": "amazing game",
            "score": 1,
            "replies": []
        },
        {
            "author": "Random_Monstrosities",
            "body": "My biggest problems with Gun is that I 100%ed it in less than 24 hours and that horse armor you get for beating the game. What's the point of getting that armor when you have no missions left to use it for?",
            "score": 1,
            "replies": []
        },
        {
            "author": "hraycroft95",
            "body": "Wtf happened here ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Saltyfriez123",
            "body": "I couldn’t beat the final boss when I was a kid so I went and grinded the game and got the best guns you could get. Turns out you were supposed to throw dynamite at the floor when there was like steam? Melted the boss after that. Oops",
            "score": 1,
            "replies": []
        },
        {
            "author": "DullKnifeDub",
            "body": "I definitely bought this game. The open world was way ahead of its time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mbgriff12",
            "body": "“I’m Hoodoo Brown!!!!”",
            "score": 1,
            "replies": []
        },
        {
            "author": "Straight-Dot-3106",
            "body": "Was a great game",
            "score": 1,
            "replies": []
        },
        {
            "author": "SpecialIcy5356",
            "body": "What I wouldn't give for a GUN remaster with modern graphics...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Substantial-Bug-8611",
            "body": "Immpostibe it is",
            "score": 1,
            "replies": []
        },
        {
            "author": "AshyWhiteGuy",
            "body": "Revolver came out a year before but both were clearly in production at the same time. Both great games. It was like movie studios competing on the same subject. Remember when Deep Impact and Armageddon hit theaters the same summer?",
            "score": 1,
            "replies": []
        },
        {
            "author": "GareththeJackal",
            "body": "Red Dead Redemption 0.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ObligationSome905",
            "body": "I can’t remember which came out first but I loved gun and didn’t like rdr1 at all. Naturally RDR2 became one of my favorite games of all time.",
            "score": -1,
            "replies": [
                {
                    "author": "Dagger_323",
                    "body": "By \"RDR1\" are you referring to Red Dead Revolver or Red Dead Redemption 1? Because \"RDR1\" refers to the latter. Red Dead Revolver is not \"RDR1\".\n\n  \nAlso, Red Dead Revolver came out first in 2004 before Gun did the following year in 2005. RDR1 didn't release until 2010.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}