{
    "title": "\"I can't see a single square of skin from my character.\" \"No I will not disable helmet in setting.\"",
    "author": "GeneralHenry",
    "subreddit": "MonsterHunter",
    "rank": 6,
    "score": 2173,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 94,
    "url": "https://i.redd.it/pl0wrfyxvgpe1.jpeg",
    "id": "1je7q5z",
    "selftext": "",
    "comments": [
        {
            "author": "Darthplagueis13",
            "body": "Would be kind of neat if helmet designs with visors had an option to open those visors during cutscenes only.",
            "score": 383,
            "replies": [
                {
                    "author": "GeneralHenry",
                    "body": "They had this in Dragon's Dogma 2. Definitely possible to implement.",
                    "score": 123,
                    "replies": [
                        {
                            "author": "QX403",
                            "body": "Dragons Dogma does a lot of little things that are mechanically cool, like being able to kill anybody in the game and being able to revive them if needed at the morgue, not having invincible characters is so nice.",
                            "score": 62,
                            "replies": [
                                {
                                    "author": "TapeIsMagical",
                                    "body": "it’s cool until you accidentally Dragonsplague Vernworth and kill all the quest NPCs there lmao\n\neternal wakestone time",
                                    "score": 28,
                                    "replies": [
                                        {
                                            "author": "QX403",
                                            "body": "They’ll revive by themselves after a certain amount of time, I think lore wise it’s because other people have wakestones also, I’ve thrown Queen Disa off the top of the watch tower a couple of times and she eventually revives by herself.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "Shameless_Catslut",
                                                    "body": "The actual lore is that none of it is real, and critical people are revived by the simulation so they can play their part.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Professional-You5754",
                            "body": "Mass effect also",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Hephaistos_Invictus",
                            "body": "The original dragons dogma already did this when you entered towns :)",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "AZzalor",
                            "body": "Well, first they'd have to implement armor that has visors and their two states. So far, not a single armor ever in monster hunter history had that.\n\nBut ofc, as this is a new gen, it could also have new stuff. Let's pray for them to implement that eventually.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Armored_Warrior",
                            "body": "I still hate that they removed layered armor",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 33,
                    "replies": [
                        {
                            "author": "JustSaltyPigeon",
                            "body": "Not to mention NOT lowering your visor may ends with stab in your face that instantly kill your sorry arse.",
                            "score": 29,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -21,
                            "replies": [
                                {
                                    "author": "vaporizer012",
                                    "body": "If you don't want to be that guy... then why the FUCK did you comment it.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "hedge2dahog",
                                            "body": "Hey there is THAT guy *points*",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "icedragonair",
                    "body": "That can kinda mess with designs though, and mh armor is deff all in on rule of cool more than anything.\n\nIt was kinda funny though because for most of the story I was wearing some really cool helmets but for all the cutscenes they basically hid either the top or bottom of my face and you couldn't see her emote and it made her all mysterious and shit and it was interesting watching her be all intense at Nata.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Darthplagueis13",
                            "body": "It could be made optional. I'd just like to have that option.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "icedragonair",
                                    "body": "No its not really what i meant. In order for it to be optional, it has to be fractured into the design process at the very beginning, what considerations you start with will obviously greatly affect how you design a thing. \n\nIts not that I don't like the idea, I don't even think it would be inappropriate for mh. Mh has a lot of little details added in with the mentality of \"what would would be practically needed in real life\". Its one of its biggest charms I think, stuff like every Hunter having a carving knife, and endemic life living their lives in the background and the hyperfocus on a banal thing like cooking.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Unlikely-Peaceseeker",
                    "body": "Oh that’s a good idea",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Neep-Tune",
            "body": "I love the option they did to disable helmet only during cinematic",
            "score": 133,
            "replies": [
                {
                    "author": "SpaceballsTheReply",
                    "body": "Though it is hilarious when it puts the helmet back on for the end of the cutscene when it's about to transition to gameplay. Quite unexpected sometimes.\n\n*Hunter looks at Alma, making eye contact, an alert and determined expression on their face*  \nAlma: \"Right. The guild authorizes you to commence the hunt.\"  \n*cut back to a close-up of the Hunter's face, already completely hidden under a massive steel helm, before the camera zooms out behind them to begin gameplay*",
                    "score": 128,
                    "replies": [
                        {
                            "author": "kittyPowersupply",
                            "body": "Alma: The guild authorizes you to...\n\nHunter: Say less fam",
                            "score": 49,
                            "replies": [
                                {
                                    "author": "GreatRolmops",
                                    "body": "The Hunter whenever Alma opens her mouth:\n\nhttps://preview.redd.it/gp0se3b87ipe1.jpeg?width=736&format=pjpg&auto=webp&s=13153347e558daff74a5105e6cc3cab06b9bab38",
                                    "score": 29,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Death_Dragon975",
                            "body": "It was funnier in world, you would literally see your helmet pop into existence right when the cutscene ends and combat combat ends",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Quigs4494",
            "body": "A big thing in Goblin Slayer is that no one from the guild ever saw his face and people questioned what he looked like. Eventually he ones people a favor for help and at the guild party one guy says \"for my favor i want you take off your helmet and show us your face\"\n\nHe takes it off non chalantly bc he never really saw it as a big deal and no one asked. He just preferred always having it to be ready",
            "score": 123,
            "replies": [
                {
                    "author": "Zjoee",
                    "body": "\"Oh god, he's so handsome!\"",
                    "score": 53,
                    "replies": [
                        {
                            "author": "rebels-rage",
                            "body": "https://i.redd.it/qg4qhxyknhpe1.gif",
                            "score": 22,
                            "replies": []
                        },
                        {
                            "author": "Big_Priority_9329",
                            "body": "Bro rizzed up the whole tavern",
                            "score": 14,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "UnNumbFool",
                    "body": "Yeah exactly, plus he wasn't particularly hiding his face as cow girl and her uncle knew exactly what he looks like under the helmet",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "GarboseGooseberry",
            "body": "https://preview.redd.it/xzifuhujxhpe1.png?width=767&format=png&auto=webp&s=ec89776b877242c0df9ec08dd41cb07e2f99670c\n\nCorrect",
            "score": 38,
            "replies": [
                {
                    "author": "innovativesolsoh",
                    "body": "Imagine trying to clean food stains off that",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "CrownofMischief",
            "body": "Compromise between the two and only wear armor sets with a hat. I'm rocking the Quematrice and Lala Barina layered sets",
            "score": 24,
            "replies": []
        },
        {
            "author": "CallSign_Fjor",
            "body": "Leather Helmet b - My beloved.",
            "score": 11,
            "replies": []
        },
        {
            "author": "Ragna126",
            "body": "THE HELMET STAYS ON!!!",
            "score": 9,
            "replies": [
                {
                    "author": "NesuneNyx",
                    "body": "If you lose this match, I'll tell you what you did wrong: YOU. DIDN'T. THROW. ENOUGH. GRENADES! You should be throwing a grenade as I say this!",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "The_Pleasant_Orange",
            "body": "Correct!! We are hunting monsters, armor is a necessity! :D",
            "score": 5,
            "replies": []
        },
        {
            "author": "ParsnipSlayer",
            "body": "If you can see skin, you're livin' in sin",
            "score": 6,
            "replies": []
        },
        {
            "author": "that4znkid",
            "body": "Having flashbacks to a certain doujin rn",
            "score": 4,
            "replies": [
                {
                    "author": "Overlord_Orange",
                    "body": "Name?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "that4znkid",
                            "body": "If you know how to use the number site, it's 67650. It was so long ago that we were still in the five digit era.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "wakkiau",
                    "body": "I miss udon-ya",
                    "score": 0,
                    "replies": [
                        {
                            "author": "that4znkid",
                            "body": "Me too buddy",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "zekrom42",
                    "body": "Is it the one with the girl in the Zinogre armor?",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dragon054",
            "body": "Reminds me of Serana with daedric armour. But we all know Serana rocks that armour",
            "score": 2,
            "replies": []
        },
        {
            "author": "ThatOneFurry666",
            "body": "Hell yeah",
            "score": 2,
            "replies": []
        },
        {
            "author": "Flaky-Fact4885",
            "body": "I can only imagine myself with buff body with funny hat 🗿",
            "score": 2,
            "replies": []
        },
        {
            "author": "Shikabane_Sumi-me",
            "body": "Wearing the Gore Magala set cause of this.",
            "score": 2,
            "replies": [
                {
                    "author": "ZephyrFluous",
                    "body": "If only it looked that cool",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheArtVampire",
            "body": "I’m trying to get the Bullfango mask for this reason, barring the fact I’m a bit of a cosplayer at heart, because Inosuke Hashibira",
            "score": 2,
            "replies": []
        },
        {
            "author": "Zjoee",
            "body": "This comic always reminds me of the Black Night in The Wrong Way to Use Healing Magic haha.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DeadSkullMonkey",
            "body": "My character in wilds😅😂",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lord_NOX75",
            "body": "I only disable helmet during cutscenes, because i do like how character looks, but during gameplay that shit stays on",
            "score": 1,
            "replies": []
        },
        {
            "author": "MasterEgg7",
            "body": "Goals",
            "score": 1,
            "replies": []
        },
        {
            "author": "_Tidalwaves_",
            "body": "Is this a real armor set?",
            "score": 1,
            "replies": []
        },
        {
            "author": "NichS144",
            "body": "This is why I spent minimal time in the character creator.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Routine-Delay-893",
            "body": "This is like going to the food court at a comic convention.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gravijah",
            "body": "it’s nice to have helmets that obscure the face for women, they were extremely rare in old games. because for some reason if you’re a woman you have to show your face I guess.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JEverok",
            "body": "Hour and a half spent on character creation only to shove them into full plate armour that stops me from seeing any part of them",
            "score": 1,
            "replies": []
        },
        {
            "author": "KABOOMBYTCH",
            "body": "Helmet is part of the drip",
            "score": 1,
            "replies": []
        },
        {
            "author": "Vanguard-Is-A-Lie",
            "body": "Full death stench with gore weapons. All I’m gonna say.",
            "score": 1,
            "replies": []
        },
        {
            "author": "simplemindedblue",
            "body": "Id fold",
            "score": 1,
            "replies": []
        },
        {
            "author": "PerspectivePale8216",
            "body": "\"Oh no she's hot!\" Everyone in the pub right there",
            "score": 0,
            "replies": []
        },
        {
            "author": "coelacanth_of_regret",
            "body": "Some people spend 3-5 hours in the character creator crafting their perfect hunter doll. I dont understand them, as that is time that could have been spent hunting monsters, but thats their deal. The helmets and armors look way cooler than pretending my character is Geralt or Ronald McDonald or whatever.",
            "score": -65,
            "replies": [
                {
                    "author": "Dylangillian",
                    "body": "I mean, those 3-5 hours mean very little when you'll have for hundreds of hours of hunting.",
                    "score": 44,
                    "replies": [
                        {
                            "author": "GreyAstajho-24",
                            "body": "Overall, yes, but especially at the beginning when you just want to get started, it's very annoying.",
                            "score": -27,
                            "replies": [
                                {
                                    "author": "gollum80",
                                    "body": "Probably not annoying to the people who enjoy it, so why worry about it when you can get through it pretty quick if you want?",
                                    "score": 24,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "coelacanth_of_regret",
                            "body": "Based on the vote ratio it seems those 3-5 hours mean everything to some. To each their own, I just dont subscribe to it.",
                            "score": -21,
                            "replies": [
                                {
                                    "author": "Poopybutt36000",
                                    "body": "The vote ratio is probably just because you type like a weirdo and you're annoying.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "coelacanth_of_regret",
                                            "body": "Better than a nerd that needs to play with the perfect doll. Go back to the character creator you tourist.",
                                            "score": -25,
                                            "replies": [
                                                {
                                                    "author": "Poopybutt36000",
                                                    "body": "You're trying too hard",
                                                    "score": 10,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "flamestorm16",
                    "body": "I'm always torn between showing my cool looking armor or my cute hunter's face",
                    "score": 22,
                    "replies": [
                        {
                            "author": "Lukthar123",
                            "body": "The duality of hunter",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Iosis",
                    "body": "Can't really agree given how excellent the character creator is in Wilds. It's one of the best character creators I've ever used--why wouldn't you want to play around with it and make your perfect character?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "GreyAstajho-24",
                            "body": "No matter what I changed, it just kept getting worse and uglier. I don't think anyone can help me. 😂 I didnt cope at all",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "coelacanth_of_regret",
                            "body": "Because I am here to kill monsters and make parts out of them. I dont watch cutscenes. I dont care about the human side of the story. Give me fights and weapons, keep everything else.",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "BigTroubleMan80",
                                    "body": "![gif](giphy|F3G8ymQkOkbII)",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "coelacanth_of_regret",
                                            "body": "Yes, and I am not saying the other way is bad. I just dont understand the need for pretty hunters when the cool armor is right there. You dont even need to spend any time outside of hunting monsters to get the cool armor. Makes me think a lot of people were not here in the PS2 days.",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "author": "jormugandr",
                                                    "body": "You've repeatedly said it's like playing with dolls, pointless, a waste of time. You are belittling the way others choose to engage with the game. \n\nThere's nothing wrong with wanting to play your way, but people are reacting negatively to your posts because you're being a dick.\n\nIt's OK to have autism and be not able to relate to others. It's not ok to use that as an excuse to be a prick.",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "author": "Poopybutt36000",
                                                            "body": ">It's OK to have autism and be not able to relate to others. It's not ok to use that as an excuse to be a prick.\n\nI genuinely don't think I have ever seen a person on this site that I am more sure has crippling autism than this guy.",
                                                            "score": 2,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "coelacanth_of_regret",
                                                            "body": "Not autsitic. Just not interested or excited for more dev time spent on character creation. Its Monster Hunter, not Waifu maker. You do you tho, Im sure spending all that time to look at the back of your chars head is well worth it.",
                                                            "score": -3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Illuminey",
                    "body": "I find most of the helmets pretty ugly, so I have no remorse hiding them to show my hunter's face. 🤷🏻‍♂️\n\nBut I can understand people thinking the other way.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "coelacanth_of_regret",
                            "body": "I dont care at all about the hunters face or voice or anything really. I am here for the hunt.",
                            "score": -6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "junkrat147",
                    "body": "Okay? And stating this matters because...?\n\nYou don't engage with the option.\n\nThe people who do engage with it certainly wants nothing to do with you.\n\nYou just sound pretentious.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "coelacanth_of_regret",
                            "body": "Its an open forum, I dont see your \"Im allowed to comment\" chitty either. \n\nYou sound like you play with dolls more than you hunt monsters.",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "junkrat147",
                                    "body": "Yeah, definitely pretentious.\n\nHope you get better, good luck.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "BigBadBeaver1",
                                            "body": "Nah I’m with bro. Y’all are nerds playing with dolls",
                                            "score": -8,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ScreamingLabia",
                    "body": "Why? I think helmets are ugly so i only wear gear that shows my face",
                    "score": 2,
                    "replies": [
                        {
                            "author": "GeneralHenry",
                            "body": "Metal helmets that cover your whole head are peak regardless of design to me.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "Iosis",
                                    "body": "I'm begging Capcom for a knightly helmet with a closed visor but without the blue-purple Guardian glow. Basically the G. Fulgur Anja helm but all metal instead of having the brown stripes and Guardian glow. A couple of my layered sets would look so sick with something like that...\n\nThere are other full helms but none in that shape, unfortunately.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "GeneralHenry",
                                            "body": "Yeah it's weird they don't even put the old original Fulgur Anja despite having made a guardian version of it.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "GreyAstajho-24",
                                    "body": "definitely 👌. but actually I think Doshaguma's helmet is really cool even though you can see a bit of the face because it's a 1 to 1 Uruk Hai helmet 😆.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "coelacanth_of_regret",
                            "body": "Why? I think helmets are awesome so I never wear gear that shows my face. \n\nWe are both correct here.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "ScreamingLabia",
                                    "body": "Yeah its just a matter of taste.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "GreyAstajho-24",
                            "body": "Helmets/ Armor that fully cover your whole Body are the best. Like in the meme of the post. perfect 👌",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ValkyrianRabecca",
                    "body": "I spend 3-5 hours in the character creator perfecting my character to look exactly like me, because that's what I do for every character creator, some have better options than others, Nioh,DD2 and MHWilds all let my have my scar, which is always a plus",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}