{
    "title": "god they need to rework hammer offset",
    "author": "No-Telephone730",
    "subreddit": "MonsterHunter",
    "rank": 15,
    "score": 240,
    "upvote_ratio": 0.9,
    "num_comments (reported by reddit)": 98,
    "url": "https://i.redd.it/2whv2g90qipe1.png",
    "id": "1jegtbm",
    "selftext": "",
    "comments": [
        {
            "author": "UkemiBoomerang",
            "body": "Water Strike + Courage Hammer, my beloved.",
            "score": 78,
            "replies": [
                {
                    "author": "erty3125",
                    "body": "The loss of courage hammer is tragic, hammer charge swapping should have stayed and just toggles you between having access to mighty charge playstyle with looping combos and courage hammer.",
                    "score": 31,
                    "replies": [
                        {
                            "author": "narok_kurai",
                            "body": "It also came at a really unfortunate time, right as other weapons got moveset tweaks that made them feel more fluid, Hammer got a revert that makes it feel more sluggish (while ironically diminishing its role as the *slugger* of the roster).",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "WatLightyear",
                    "body": "Courage was the purple mode right? That’s the only way I played hammer in Rise, and I now realise it’s the only way I enjoy playing hammer at all. Spamming those right trigger swings was easy and fun as hell, and Water Strike was great (even though I only landed it at a rate of about 1 in 100).",
                    "score": 8,
                    "replies": [
                        {
                            "author": "TheOldDrunkGoat",
                            "body": "Courage was a switch skill. Your purple mode was either strength (default) or courage.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "WatLightyear",
                                    "body": "Yeah I know it was a switch skill, but it was the purple mode, not yellow (yellow was basically normal hammer charge mode).",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "TheOldDrunkGoat",
                                            "body": "Yeah you had three modes. Yellow mode which had no purpose and you never wanted to be in. Default purple mode (strength) which gave you the charged brutal big bang & step smash. And courage mode could replace strength to give you the chaining charges.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "EleanorGreywolfe",
                    "body": "Seriously trying Valor hammer in MHGU absolutely ruined me. Then they brought it back kinda with Courage, and i can't go back. It feels so good having the charge states be a combo.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "BearFromTheNet",
                    "body": "I really don't know why they didn't change anything from the beta. Feedbacks must have been negative right? Like they even have given IG  spin back AND an offset after feedback whereas nothing to hammer?  Like what were they smoking 😭",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Chubbzillax",
            "body": "I dunno I’m not great at the timing but bring able to hold that last hit on the triangle combo is kinda fun (unless that’s not an off set and just happen to get flinches lol.)",
            "score": 78,
            "replies": [
                {
                    "author": "aggroware",
                    "body": "That last swing is an offset yes",
                    "score": 37,
                    "replies": []
                },
                {
                    "author": "PetMeFucker",
                    "body": "Yeah I don’t want it to be free. Timing it out to a monster’s huge attack is incredibly satisfying. Not gonna be angry if they buff it but I’m not mad about its current state.",
                    "score": 24,
                    "replies": [
                        {
                            "author": "PM_me_your_skis",
                            "body": "Agreed! Its like people expect to be able to easily offset every attack",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "TurtleRanAway",
                                    "body": "Me offsetting like 10+ attacks on swa every hunt. It is kinda stupid easy on other weapons. They don't all need to be stupid easy, but when only 1 is significantly harder than others, it does feel sorta lame hammer got no real defensive option",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "No-Telephone730",
                                    "body": "well the problem is it's easier to offset on other weapon compare to hammer because they simply have dedicate offset buttons meanwhile hammer have the setup everything correctly just to pull 1 offset",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "_-Lucas-_",
                                            "body": "Yeah this is the big one for me, greatswords is SO easy to pull off on top of having guard and tackle, makes it way more fun for me to play as a hammer main. Switch axe and insect glaive are also much easier imo but not as much.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "elibly77",
                                                    "body": "Glaive offset has the least amount of frames and also requires a set up. It’s known as the hardest parry currently. Maybe you meant horn its super easy to hit.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Unfair_Constant7466",
                                                            "body": "im pretty sure its airborne version has a generous amount of frames tho",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "elibly77",
                                                                    "body": "I wasn’t aware it had another offset on that attack that changes a bit.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Zxar99",
                                            "body": "Its not that hard to set up honestly but then again I’ve been playing Hammer for years. You don’t flinch or get knocked back when you do it either even though you still take damage. You can offset any attack as well.\n\nI like it where it is, but the charged uppercut could be one as well. Was disappointed it wasn’t",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "CatBox_uwu_",
                                            "body": "Im sure its because theyre trying to balance around hammer’s mobility and stun power. though i do wish the offset was a little more accessible.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "YuriMasterRace",
                                                    "body": "It's funny how one of the producer is a hammer main, yet his weapon is the most gutted by far.\n\nFocus mode basically magnetizing every weapon to the monster even when you're fairly distant, kinda did made the hammer's point of being a mobility focused heavy weapon, moot.\n\nHammer's stun power is also overshadowed when every weapon in the game can now stagger/stunlock the monster with ease due to wound popping, or para being an equally better CC to stun as of right now.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "CatBox_uwu_",
                                                            "body": "Yeah i agree, im hopeful hammer gets some love in a balance patch soon 😭",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "No-Telephone730",
                                                    "body": "hammer is the 2nd weakest weapon after HH compare to every other weapon\n\nHH and Hammer speedrun community almost non exist thanks to that",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "CatBox_uwu_",
                                                            "body": "im not disagreeing, im just stating where the balance decisions may be coming from.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Gas_Sn4ke",
            "body": "If they made Lv2 Charge an offset attack in addition to what we have now Hammer would be so peak.\n\nI see the vision behind the offset attack but I don't fully agree with the execution. In theory it incentives non-stop assaults with the occasional pausable offset especially now that Spinning Bludgeon is now the combo extender.\n\nIt's just in reality waiting for 5 revolutions of Spinning Bludgeon before the golf swing offset feels so sluggish. I kinda wish triangle + circle after a combo ender did Spinning Bludgeon: Charged from Rise/Sunbreak instead of just Spinning Bludgeon.",
            "score": 39,
            "replies": [
                {
                    "author": "No-Telephone730",
                    "body": "in your theory with level 2 charge or simply uppercut then mighty swing level 1 should also able to offset attack too right ?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Gas_Sn4ke",
                            "body": "Might Charge Lv1 being an offset is a really good idea too.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PacMoron",
                    "body": "That was exactly my thought the entire time playing hammer. Level 2 charge looks, feels, and would flow so well as an offset attack. It’s still strict timing considering level 2 charge is a brief window, but you’ll get so many accidentally clutch moments when you realize you’re about to be attacked while charging. It’ll feel organic rather than having to plan soooo far ahead with the triple swing combo.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Soithman",
                    "body": "You don't need to wait for five revolutions for the spinning bludgeon. If you end it as soon as possible you go directly into the side smash. Way faster than waiting.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "ToonTooby",
            "body": "Me when I try to set up offset but Arkveld chooses to do the pin or Rey Dau chooses to railgun instead 🤡\n\nThat said, despite being a Water Strike enthusiast, I can get used to using the Offset here in Wilds. What the Hammer really needs is just some more damage right now, outside of just Mighty Charge Slam.",
            "score": 9,
            "replies": []
        },
        {
            "author": "immastillthere",
            "body": "I kinda miss having the two different charge move sets that Rise/Sunbreak had. The weird wind up of Wilds throws me off so badly.",
            "score": 17,
            "replies": [
                {
                    "author": "jwhudexnls",
                    "body": "I loved the blue style level 3 charge attack in Rise. That being missing in Wilds has me feeling a little disappointed in hammer.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "KaraArcadia",
            "body": "Hammer’s offset is probably the hardest to pull off simply because it has the longest set up compared to all the other weapons. There are no instant offset button like the rest so I do think water strike being brought back could benefit from acting as a parry to make offset setups easier.",
            "score": 10,
            "replies": [
                {
                    "author": "VeryBottist",
                    "body": "Hunting horn entered the chat",
                    "score": 9,
                    "replies": [
                        {
                            "author": "SteelPokeNinja",
                            "body": "Horn offset technically has a longer set up, but it's effectively negated by the fact that once you play the song you have it stored up, and then it just becomes the short backstep as setup before the tackle.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Thin_Fault5093",
                            "body": "HBG entered the chat.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "SFWxMadHatter",
                            "body": "GS with its slow ass uppercut has appeared.",
                            "score": -17,
                            "replies": [
                                {
                                    "author": "BeefSandwichWithHam",
                                    "body": "You can literally charge it for several seconds, it's by far the easiest offset to land",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "SFWxMadHatter",
                                            "body": "If you just want to jerk off and wait while doing nothing, yeah, it's easy. If you are actively fighting you won't get it ready in time.",
                                            "score": -7,
                                            "replies": [
                                                {
                                                    "author": "BeefSandwichWithHam",
                                                    "body": "Very few attacks come out so fast that you can't react to it even with a 1 second windup, kinda seems like a skill issue to me. And if you get caught out mid combo thats 100% on you.",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "SFWxMadHatter",
                                                            "body": "![gif](giphy|H4ssaej9EYB9KF8qca|downsized)",
                                                            "score": -8,
                                                            "replies": [
                                                                {
                                                                    "author": "BeefSandwichWithHam",
                                                                    "body": "No, I did it...\n\n(•_•)\n\n( •_•)>⌐■-■\n\n(⌐■_■)\n\nBy my own order.",
                                                                    "score": 6,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "EatMyScamrock",
                                    "body": "Greatsword is the easiest offset attack in the game imo, although tbf I haven't dabbled with IG too much.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "SFWxMadHatter",
                                            "body": "It's easy to hit only if you're ready. It's so fucking slow to start you have to be waiting, they'll just charge through you if you try and respond with it while attacking.",
                                            "score": -7,
                                            "replies": [
                                                {
                                                    "author": "EatMyScamrock",
                                                    "body": "OK well its a good thing I use offsets pre-emptively then. You can obviously use it reactively too, you just need to be aware of the startup animation commitment so it's not really the ideal way to use the GS offset imo.\n\nAgain, just my opinion. I can hit the GS offset far more reliably than HBG or Hammer, maybe it's just a playstyle thing idk.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "No-Telephone730",
                                    "body": "skill issue also GS have the best offset simply because they have a follow up that close the distance to monster after pulling offset",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "sarampioso",
            "body": "It gets easier the more you do it !",
            "score": 14,
            "replies": [
                {
                    "author": "Business_Pangolin801",
                    "body": "Yet it never gets good. Clunky till death do us part.",
                    "score": 17,
                    "replies": []
                }
            ]
        },
        {
            "author": "elendil667",
            "body": "i use the offset waaay more often than i ever did water strike",
            "score": 5,
            "replies": [
                {
                    "author": "escapevelocitykoala",
                    "body": "That's probably because Rise/SB's hammer still centered around charge attacks, which meant you were almost never in a position to do a standing A input. In Wilds you're doing the standard 3-hit much more often to get to Mighty Charge as fast as possible, which means the offset golfswing is much more naturally embedded in your routine. \n\n...which is probably why the devs went \"eh good enough\" for hammer's offset, without considering how shitty it still is.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "elendil667",
                            "body": "yep. i did drop sunbreak after a couple title updates before courage hammer overtook strength (not to say i disliked sunbreak, was just too grindy for me to want to keep up) so maybe it was more useful in courage style, but the need to not be charging at all to use water strike unironically made it require as much or more forethought than the offset, and it's not like you got a good punish off it.  felt like a meme.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Kubrix1080",
            "body": "I'm entirely with you and give me the step smash back pls. Rise hammer was best hammer",
            "score": 2,
            "replies": []
        },
        {
            "author": "Skeletonparty101",
            "body": "Off set is way better, knocking a charging monster down feels way better plus you can hold the move to time it better",
            "score": 5,
            "replies": []
        },
        {
            "author": "Ahmadv-1",
            "body": "nah the new offset >water strike\n\nit feels SO good to pull off but its hard to do once u get the hang of it, its pure dopamine",
            "score": 5,
            "replies": [
                {
                    "author": "No-Telephone730",
                    "body": "until you realize not every move can be offset so you still get hit even when you offset the monster but you take damage while not getting knocked",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "Skeletonparty101",
                    "body": "We gamble with off set just to farm dopamine \n\n\"don't care if I cart I wanna hit a home run with this one ⚾ \"",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "bisschenmikzn",
            "body": "It feels so good to pull it of, its perfect",
            "score": 2,
            "replies": []
        },
        {
            "author": "Maverick_Reznor",
            "body": "Master the hammer and everything else becomes easy.",
            "score": 2,
            "replies": [
                {
                    "author": "No-Telephone730",
                    "body": "or just play SnS and you didn't need to master SnS to beat people who mastered Hammer hunt time",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "AnonymePerson",
            "body": "Personally, I view hammers offset as perfect. It's not as much intended as an offensive tool as say GS offset. More similar in use to a guard point. Definitely has a learning curve to it, but i hit it regularly enough that I don't actually need them to change much.",
            "score": 3,
            "replies": [
                {
                    "author": "No-Telephone730",
                    "body": "CB have multiple guard point why hammer only allowed to have 1 guard point and that is on the end of main combo ?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Tenant1",
                            "body": "Well calling it a \"guard point\" isn't a completely accurate descriptor for it neither. They might sound similar described like this, but CB guard points and Offsets are way different in execution.\n\nThe golfswing is a powerful hit that can double toward powering through attacks and getting a brief topple on a monster; the fact you can delay the swing and time it means it's entirely meant as a deliberate tool. CB's guard points weren't ever super-powerful attacks by themselves, it was some of the options you can follow them up with that are. And unlike most Offset attacks, the guard points have the benefit of protecting you; a lot of CB's guard points are the ones that end in the sword roundslash, which makes them decent at protecting you at the end of those combos.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Chance_Strategy_1675",
            "body": "Water Strike, we need you",
            "score": 1,
            "replies": []
        },
        {
            "author": "DegenerateCrocodile",
            "body": "It’s unreliable at best, but I still find it more useful than trying to time SwAxe’s offset.",
            "score": 1,
            "replies": [
                {
                    "author": "Zxar99",
                    "body": "Whaaaa, I can offset consistently with it. But I have always used the axe more than the sword so maybe that has a lot to do with it",
                    "score": 1,
                    "replies": [
                        {
                            "author": "DegenerateCrocodile",
                            "body": "The windup just feels too long to be useful without being able to hold it like Hammer’s.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Yournextlineis103",
            "body": "I used hammer for the entire game till Hunter level 70 I’ve landed like 6 offset attacks with it that entire time",
            "score": 1,
            "replies": [
                {
                    "author": "HornedMaiden",
                    "body": "How?\nI'm able to pull off 2-3 off set per hunt",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "KABOOMBYTCH",
            "body": "The double charge upswing should have been the offset attack",
            "score": 1,
            "replies": []
        },
        {
            "author": "Incompetentpharma",
            "body": "They should bring back switch skills in general. Being able to customize weapon combos was amazing",
            "score": 1,
            "replies": []
        },
        {
            "author": "retrojoe69",
            "body": "I liked the vault switch skill where you could do the sliding jump on demand tbh.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RedLimes",
            "body": "I feel like they wouldn't have nerfed the Hammer Offset on launch if they felt like the current state of it was a problem. Personally I like that you have the ability to hold the upswing because it is an offset. It feels very satisfying to land, and you have Charged Step to play defense, although it needs at least one rank of evade extender to feel good imo",
            "score": 1,
            "replies": [
                {
                    "author": "No-Telephone730",
                    "body": "always afraid to slot evade extender simply i don't want my clumsy side charge step into monster attack because i always forgot the distance if i have evade extender",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "jenos45",
            "body": "tbh I don't mind them not changing the 3rd Strike for Off-set. But atleast make it deal more damage if you held it long enough or give it HyperArmor.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TinyPidgenofDOOM",
            "body": "I didn't think it was possible for them to make me not like hammer enough to fully swap to another weapon but they did in Wilds. I miss rise hammer.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Great_Employment_560",
            "body": "I’m gonna miss Arial aim. It was a genuine extension of the World and Iceborne bow. Just a couple more shots but in air too.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dark_Dragon117",
            "body": "Hard disagree.\n\nGolfswing was already the go to dps combo of Hammer and now there is even more incentive to use it. Knowing how or when to set up the golfswing combo adds another layer of depth to Hammer that I personally really appreciate.\n\nI don't want to come of as entitled or anything but imo they made the right choice and I really hope they don't change it based on what I consider bad feedback. If anything the right approach should be to add something instead of change what works perfectly fine. \n\nBut ultimately the devs decide which feedback to listen too, so it's not up to me. \n\nAlso offsets aren't \"true counters\" so comparing it to waterstrike is pointless imo. Watetstrike was a nice addition tho so maybe it could return with the expansion in a slightly changed form.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Antedelopean",
            "body": "Nah. All the reactive damage mitigation for both hunting horn and hammer is good enough with dodge, as is. If you want better, invest in either evade window or evade distance. What offset offers for hammer and hunting horn is the opportunity to punish more heavily than just jabbing, via immediately being able to use the damage mitigation and parry from the offset frames to immediately cancel into a transition 1-2 punch to heavily punish combo enders.",
            "score": 1,
            "replies": [
                {
                    "author": "No-Telephone730",
                    "body": "then why SnS,GS,and Gunlance allowed to have lance perfect block while hammer and HH being told to only roll as their defensive option ?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Antedelopean",
                            "body": "Because we're what remains of what monster hunter used to be and the barometer that the game's balance and pacing haven't gone too far off the deep end. And if we ever get to the point where plain dodging, good positioning, and proactive gameplay no longer suffices to properly mitigate damage for proactive gameplay in a mainline game, then we have a problem with the actual game's balance and design.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "escapevelocitykoala",
                                    "body": "I think the general consensus is that we are, in fact, at that stage. Most hammer hunt times are considerably longer than other weapons because its \"classic MH moveset\" has been completely left behind by everything else. I hated how Courage hammer in SB took away the weighty heft of the hammer, but I understand why people miss it - it at least somewhat kept up with the game pace/balancing.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Antedelopean",
                                            "body": "Being at that stage would be at stages only reached really, by either end game gu, 4u, the collab quests in world, and / or sunbreak, solo, where you would regularly either time out or be completely 1 shot in a 20 minute hunt by the end game tier monsters with 0 recourse or ability to react to. Wilds is still at the stage that every weapon can literally clear all the content comfortably, and I doubt we'll reach that point until either an alatreon tier foe in g rank expac or at soonest, another collab quest in the title update that's balanced around 4 people with extra-monster-hunter mechanics.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "escapevelocitykoala",
                                                    "body": "Lol my guy, I get what you're trying to say, but at that point it would not be \"bad balancing.\" It'd be \"unplayable.\" The point is that hammer is at a point where the majority agree that it's falling way far behind the other weapons, and needs a major rework/buff. That is already at the stage of bad balancing.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Antedelopean",
                                                            "body": "Until weapons literally get phased out to unplayable states, there's no real urgency to rebalance, as it's just a pointless  dick measuring contest between folk who don't need the rebalancing to begin with.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Dyzzen_Grimspawn",
            "body": "I do miss Water Strike.  Having a move with I-frames that leads into offset, now that would be something.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wheezeh_toast",
            "body": "I just miss courage hammer :(",
            "score": 1,
            "replies": []
        },
        {
            "author": "Careful-Lecture-9846",
            "body": "Nah it’s fine",
            "score": 0,
            "replies": []
        },
        {
            "author": "Fyuira",
            "body": "I just want courage hammer to come back.",
            "score": 0,
            "replies": []
        },
        {
            "author": "MeathirBoy",
            "body": "I must be the only person happy with Hammer moveset in this game because I don't want this at all. I will say the motion values suck relative to other weapons, but eh, who cares, I'm only using Hammer anyways.",
            "score": 0,
            "replies": []
        },
        {
            "author": "ShivanAngel",
            "body": "I dunno. I kind of like that every single weapon doesnt have a counter anymore. Rise weapons felt way to homogenized. \n\nAnd like many have said, hitting an offset attack is so incredibly satisfying.",
            "score": -4,
            "replies": [
                {
                    "author": "Jstar338",
                    "body": "Ah yes, the *extra move options* were homogenized. No one made you use a counter.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "KUM0IWA",
                    "body": "Truth nuke, I don't get the downvotes",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "dankzero1337",
            "body": "Every single offset is better than IG offset, I don't even know why that shit is there, low frame timing, high animation delay, and this shit locks you into the entire charged attack animation, also, nobody uses IG to stand their ground, they literally fly away from the danger",
            "score": 0,
            "replies": [
                {
                    "author": "No-Telephone730",
                    "body": "soo how to pull IG offset what button you need to press ?",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ragnatoa",
            "body": "I don't think it should  be changed. There's already weapons that have easily accessible offsets already. Gs and Swax have access when ever they want, and it's cool, but not much learning to it. Mainly just getting the timing right. I like hunting horn offset because it has more thought needed. There's a longer wind up time, you need to play the song before hand, and you need to get the timing right, otherwise you'll waste the Song. Hammer has similar commitment where other weapons don't.",
            "score": -2,
            "replies": []
        },
        {
            "author": "Cattleist",
            "body": "If we are in agreement that Wilds is a Mainline title, then keep your Weapon Arts away from my Mainline titles! 🔪",
            "score": -2,
            "replies": []
        }
    ]
}