{
    "title": "Federal Judge just ruled the Secretary of the Treasury cannot access Treasury Dept. Records",
    "author": "BrooklynRedLeg",
    "subreddit": "Anarcho_Capitalism",
    "rank": 407,
    "score": 220,
    "upvote_ratio": 0.83,
    "num_comments (reported by reddit)": 49,
    "url": "https://i.redd.it/ew7uzx5e1zhe1.jpeg",
    "id": "1ikw816",
    "selftext": "",
    "comments": [
        {
            "author": "wgm4444",
            "body": "How dare you uncover our unlimited corruption.",
            "score": 158,
            "replies": [
                {
                    "author": "thermionicvalve2020",
                    "body": "Muh government of the people",
                    "score": 50,
                    "replies": []
                }
            ]
        },
        {
            "author": "Aggravating-Tea6042",
            "body": "Nope",
            "score": 22,
            "replies": []
        },
        {
            "author": "Kimura-Sensei",
            "body": "My understanding is that two of the Doge group ARE treasury employees.",
            "score": 78,
            "replies": [
                {
                    "author": "GeorgeOrwellRS",
                    "body": "That doesn't really matter. Access like what they want would require a TS/SCI clearance, which not even Musk has (because he failed eligibility in December). Their requests also make no sense. Why do they NEED access to SSNs, Home Addresses, etc., as part of an audit?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Kimura-Sensei",
                            "body": "“That doesn't really matter. Access like what they want would require a TS/SCI clearance, which not even Musk has (because he failed eligibility in December). Their requests also make no sense. Why do they NEED access to SSNs, Home Addresses, etc., as part of an audit?”\n\n\n\nhttps://www.investing.com/news/stock-market-news/treasury-secretary-personally-vetted-musks-treasury-employees-93CH-3854641",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "GeorgeOrwellRS",
                                    "body": "That isn't equivalent to a TS/SCI clearance. And it gives off the same vibes as \"we have investigated ourselves and found no wrongdoing.\" They could've said that simply for the sake of convenience.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "lone_jackyl",
            "body": "This won't fly.",
            "score": 42,
            "replies": []
        },
        {
            "author": "LDL2",
            "body": "volunteering for impeachment",
            "score": 12,
            "replies": []
        },
        {
            "author": "Muandi",
            "body": "Always surprises me that some people apparently think that the bureaucracy will just give in, recognize the error of their ways and humbly accept the wisdom of smaller government.",
            "score": 14,
            "replies": []
        },
        {
            "author": "Driftmichael01",
            "body": "Sounds like treason?",
            "score": 25,
            "replies": [
                {
                    "author": "BrooklynRedLeg",
                    "body": "No, but its certainly Judicial overreach. Plus the suit was brought by the AGs of several States....not sure what f'cking standing THEY had to do this....",
                    "score": 53,
                    "replies": [
                        {
                            "author": "Driftmichael01",
                            "body": "Kinda bummed Vivek* *spelling*. Didn’t  get in. Had a good strategy of getting rid of a lot of “laws” that were falsely passed",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "BrooklynRedLeg",
                                    "body": "His problem was not understanding the scamming going on with H1B Visas at both ends. He ended up insulting Americans and got torched for it.",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "Driftmichael01",
                                            "body": "Totally missed that. Was he backing India?",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "BrooklynRedLeg",
                                                    "body": "Basically.",
                                                    "score": 7,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "loonygecko",
                            "body": "When I read about this yesterday, I believe there was just an injunction until the matter can be seen in court which I think was next week, so basically this is just a short delay and we'll soon get the actual answer.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Unusual_Minute_182",
                            "body": "They are being blackmailed",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "mechanab",
            "body": "Ignore him. Make him throw someone in prison.",
            "score": 29,
            "replies": []
        },
        {
            "author": "heresyforfunnprofit",
            "body": "No linked source, just a jpg. I'm sure EVERYTHING on this pic is factually correct and doesn't contain any misleading or fabricated information.\n\n  \nHere's an actual story on it, btw: [https://fortune.com/2025/02/08/elon-musk-doge-sensitive-us-treasury-payment-system-records-lawsuit/](https://fortune.com/2025/02/08/elon-musk-doge-sensitive-us-treasury-payment-system-records-lawsuit/)\n\nAnd here's the actual order: [https://fingfx.thomsonreuters.com/gfx/legaldocs/myvmbzdenpr/02082025doge\\_order.pdf](https://fingfx.thomsonreuters.com/gfx/legaldocs/myvmbzdenpr/02082025doge_order.pdf)\n\n  \nHere's the money quote from the order:\n\n>preliminarily enjoining the defendants during the pendency of this action from granting to political appointees, special government employees, **and any government employee detailed from an agency outside the Treasury Department** access to Treasury Department payment systems or any other data maintained by the Treasury Department containing personally identifiable information;\n\n  \nSo it only bars NON Treasury Department employees from accessing Treasury Department systems.\n\nIn short: OP is a dirty fucking liar.",
            "score": 37,
            "replies": [
                {
                    "author": "Secretsfrombeyond79",
                    "body": "From your own article\n\n>It also accuses Treasury Secretary Scott Bessent of changing the department’s longstanding policy for protecting sensitive personally identifiable information and financial information to allow Musk’s DOGE team access to its payment systems.\n\nSo the Judge falling in favor of the lawsuit means Scott Bessent cannot give that data to others either.\n\nAlso on a sidenote, I hate when democrats larp as ancaps or libertarians in general.\n\nAll your talking points are literally \"anything Elon Musk does = Bad \" even with his own PRIVATE companny. From other of your posts you are advocating for higher spending, more government employees and for Elon to not fire people.\n\n>What you’re describing does not work in areas where skills and output are highly interchangeable. You cannot get the DMV running twice as fast by firing all but the fastest workers, because even the best ones are only a few percentage points above average. You just cause more and more backlog.Hell… look at Twitter/X. Elon took that over, purged the staff, cut costs, has engineering working burnout hours… and it’s hemorrhaging money. His last all hands email was leaked and said that revenue is way below a sustainable level (aka: they’re going broke). Being more efficient isn’t shit if you can’t get the job done.\n\nYou are a democrat, down to the \"everyone I don't like it's a nazi\" :\n\n>Fuck off. This isn’t a place for fascists cowardly hiding behind the tolerance and protection of others.",
                    "score": 83,
                    "replies": [
                        {
                            "author": "Fibbs",
                            "body": ">Also on a sidenote, I hate when democrats larp as ancaps or libertarians in general.\n\nMe too.",
                            "score": 38,
                            "replies": []
                        },
                        {
                            "author": "Midnight-Bake",
                            "body": "Surely you see the difference between Bessent accessing his data (as the .jpg accuses) and not allowing him to freely give that data to certain people (as the linked article implies)",
                            "score": -8,
                            "replies": [
                                {
                                    "author": "ExcitementBetter5485",
                                    "body": ">Surely you see the difference between Bessent accessing his data (as the .jpg accuses) and not allowing him to freely give that data to certain people (as the linked article implies)\n\nIt also lists the US Department of the Treasury as a defendant and prohibits defendants from granting access to their systems to political appointees. So technically the US Department of the Treasury(defendant) would be prohibited from granting access to Bessent(political appointee), right? The wording in the order is very problematic.",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "Midnight-Bake",
                                            "body": "I'm going to give you three hypotheses you can look into on your own:\n\nBessent had access and has had it stripped but nobody cares because Bessent is a nobody in the administration.\n\nBessent had access and this order doesn't strip his access and everyone understands that.\n\nBessent has never had access and it is totally normal for the treasury secretary to not have direct access to the payment database itself because the database is need to know and Bessent doesn't need to know your name, social security number, address and banking information on a whim (assuming you've been paid a tax return). As such this order doesn't strip Bessent of a privilege because he never had it.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "WedSquib",
                            "body": "Op is a liar though? In like 2nd or 3rd paragraph it says that the judge banned DOGE employees from treasury info, not treasury employees from treasury info. \nI’m not saying I agree because treasury info should be public information for us all to scrutinize but that is clearly not what the article reads",
                            "score": -5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "EntireButton879",
                    "body": "Do you not know what a political appointee is?",
                    "score": 14,
                    "replies": [
                        {
                            "author": "heresyforfunnprofit",
                            "body": "Do you not know what \"outside the Treasury Department\" means?",
                            "score": -23,
                            "replies": [
                                {
                                    "author": "different_option101",
                                    "body": "Oh man, all of a sudden, someone in the government cares about our privacy. Lol. Ask Snowden how the government cares about our privacy.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "BrooklynRedLeg",
                                            "body": "Was gonna say these same stupid fuckers didn't seem concerned when the ChiComms broke into US servers last year. Seems its all of a sudden 'concerning' that Musk has access to this information...",
                                            "score": 10,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "EntireButton879",
                                    "body": "But access cannot be granted to political appointees meaning he doesn’t have access.",
                                    "score": 22,
                                    "replies": [
                                        {
                                            "author": "heresyforfunnprofit",
                                            "body": "Read the full fucking order if you want to be this pedantic over a single line you insist on purposely misreading or misunderstanding. It **does not bar** Treasury Secretary Bessent from accessing Treasury information - it DOES block him from granting access to Elon (a political appointee) or his DOGE crew.\n\nBessent can access whatever he wants - he just isn't allowed to hand that information to a third party (aka, Elon), and the judge is requiring him to order any information already exfiltrated to be destroyed.\n\nRead the full order if you want to debate this. Don't take one line out of context.\n\n  \nedit: here's a good non-hysterical summary if you want [https://www.politico.com/news/2025/02/08/judge-blocks-doge-team-treasury-department-elon-musk-00203248](https://www.politico.com/news/2025/02/08/judge-blocks-doge-team-treasury-department-elon-musk-00203248)",
                                            "score": -15,
                                            "replies": [
                                                {
                                                    "author": "EntireButton879",
                                                    "body": "I did buddy and it makes no difference. It still says political appointees and he’s one so it applies to him.",
                                                    "score": 16,
                                                    "replies": [
                                                        {
                                                            "author": "EconGuy82",
                                                            "body": "The order says “political appointees, special government employees, and any government employee detailed from an agency outside the Treasury Department.” Bessent is a political appointee but not from an agency outside the Treasury Department.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Character_Dirt159",
                                    "body": "You seem to be confused by what the word “and” means",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "GreyGreatAuk",
                                    "body": ">I have a large number of personal flaws. Honesty isn’t one of them.\n\n\nWhat a stupid thing to say. Even if you *were* honest, honesty isn't a flaw anyway.\n\n\n\"I have bad qualities, but having a  good one isn't one of them.\"\n\n\n\"I have many red things but having a green thing isn't one of them.\"\n\n\n\n\"One of my weaknesses is I'm always punctual and finish all is my work.\"\n\n\n🤦‍♂️\n\n\nWhat a waste of space a creature like you is; devoid of integrity; lacking in critical thought; masquerading as an intellectual",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "heresyforfunnprofit",
                                            "body": "[Forget it GreyGreatAuk, it's Internettown](https://www.youtube.com/watch?v=9cWnubJ9CEw).",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ExcitementBetter5485",
                    "body": "The US Department of the Treasury is listed as a defendant. The order prohibits the defendants from granting access to their systems. Bessent is, by definition, a political appointee. \n\n>preliminarily enjoining the defendants during the pendency of this action from granting to political appointees\n\nSo, this would technically prohibit the Department of the Treasury(defendant) from granting access to Bessent(political appointee). \n\nWhether it will be interpreted that way and subsequently implemented that way, I doubt it, but it's undoubtedly a very poorly worded order.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "icantgiveyou",
            "body": "There is no need to audit anything, all the money is gone, there is nothing left but the debt. Just saying.",
            "score": 2,
            "replies": [
                {
                    "author": "BrooklynRedLeg",
                    "body": "Its nice to know which assholes left the dusty IOU's for Hookers & Blow. If nothing else, feeding them to the crocodiles might make for an entertaining way to raise money by making it a PPV event....",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "denzien",
            "body": "![gif](giphy|uWzS6ZLs0AaVOJlgRd)",
            "score": 2,
            "replies": []
        },
        {
            "author": "Gamestar63",
            "body": "What does this mean",
            "score": 2,
            "replies": [
                {
                    "author": "MaelstromFL",
                    "body": "This means that they appeal and a superior court tells the judge he is an imbecile...",
                    "score": 15,
                    "replies": [
                        {
                            "author": "paranoid_giraffe",
                            "body": "Treasury is under the executive so the judge can get fucked tbh",
                            "score": 9,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "StedeBonnet1",
            "body": "The definition of a Deep State Operative.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Anxious-Educator617",
            "body": "Part of the tribe, always",
            "score": 0,
            "replies": []
        },
        {
            "author": "myadsound",
            "body": "Boo hoo, the arm of the law told the statists \"no\".\n\nThis has 0% to do with ancaps",
            "score": -10,
            "replies": [
                {
                    "author": "Anxious-Educator617",
                    "body": "You should probably think before you type",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}