{
    "title": "I think this sums up where I have ended up politically",
    "author": "Great_Opinion3138",
    "subreddit": "Anarcho_Capitalism",
    "rank": 322,
    "score": 673,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 124,
    "url": "https://i.redd.it/qb8js24n7vie1.jpeg",
    "id": "1ioeetq",
    "selftext": "Original post: https://x.com/nickjfreitas/status/1889837182556447004?s=46",
    "comments": [
        {
            "author": "None",
            "body": "[deleted]",
            "score": 127,
            "replies": [
                {
                    "author": "Yodin92",
                    "body": "Elaborate please",
                    "score": 4,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "helpmesleuths",
                                    "body": "If you can't distill your thoughts then you don't understand it yourself.  Being able to do a TLDR or ELIA5 is the test of whether you really know something",
                                    "score": 33,
                                    "replies": [
                                        {
                                            "author": "SnooBananas6775",
                                            "body": "No this is Reddit where you come to tell someone you’ve read 176 books and get karma 🤣",
                                            "score": 21,
                                            "replies": [
                                                {
                                                    "author": "helpmesleuths",
                                                    "body": "Fair",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "icantgiveyou",
                                            "body": "He doesn’t want to tell you what he thinks, he wants you to come to your own conclusions, thus he is offering advice on how to go about it, not just take his word for it. If you leave out the 176 books brag, it’s a good advice.",
                                            "score": 15,
                                            "replies": [
                                                {
                                                    "author": "helpmesleuths",
                                                    "body": "Agree with that. Just not the idea that  there is knowledge that can't be summarised.  That's just shamanistic waffle to me.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "old_guy_AnCap",
                                                            "body": "All of existence should be able to be condensed to a sound bite.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Opening-Wasabi-9018",
                                            "body": "What a fucking stupid response",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Yodin92",
                                    "body": "Sure",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "BolterGoBrrr",
                                    "body": "That reads as a Navy Seal copypasta.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Bastyboys",
                                            "body": "Gravy seal more like?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "rumblemcskurmish",
            "body": "Then you realize the more you advocate for big gov the less they will leave you alone so you have to cut gov and eliminate funding.\n\nNo gov without funding is going to care too much about you.  Slash the spending.",
            "score": 96,
            "replies": [
                {
                    "author": "Great_Opinion3138",
                    "body": "Where did I advocate for big government? I was advocating to fight big government  to keep shrinking it. But just look around they don’t want that to happen and will violently resist even common sense measures like DOGE. It’s going to take a long time fighting within the current system was my message from this.",
                    "score": 55,
                    "replies": [
                        {
                            "author": "Consistent-Dream-873",
                            "body": "It is ridiculous how many \"libertarians\" popped up out of nowhere to bitch about what an abuse of power auditing the government is 😂",
                            "score": 67,
                            "replies": [
                                {
                                    "author": "meandthemissus",
                                    "body": "The backwards \"Audits cost money so we shouldn't do them.\"\n\nWell, yeah I guess if you're a moron.",
                                    "score": 34,
                                    "replies": [
                                        {
                                            "author": "Consistent-Dream-873",
                                            "body": "I do wish Trump would go way further like Argentina's president but it's still a step in the right direction.  Hopefully the big rebound by the end of the 2nd or 3rd year in the economy wont be propagandized into a Joe Biden win and will embolden even bigger cuts and more importantly potential cuts into future spending which is the real horror.",
                                            "score": 15,
                                            "replies": [
                                                {
                                                    "author": "meandthemissus",
                                                    "body": "My pipe dream was that he walked in and dissolved the FBI and CIA, but I realize that there probably are some additional steps to doing that, and mass firings is certainly a step in the right direction.\n\nIt's funny I was talking to a friend who is rather left leaning, and she asked me if I really thought cutting all these programs was a good thing. I asked her what govt (tax) funded things did she interact with in her daily life. She replied with a handful of things that were state-funded, not federally. \n\nI was like, now how much do you pay in state taxes vs federal?\n\nIt was a wakeup moment for her.",
                                                    "score": 17,
                                                    "replies": [
                                                        {
                                                            "author": "me_too_999",
                                                            "body": "I had that wake-up with my first minimum wage part time job.\n\nSo I did some research and found progressive income tax on the 5th plank of Marxism in the Communist Manifesto. \n\nAnd I wondered, \"how is a free country following Communist principles?\"",
                                                            "score": 4,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Great_Opinion3138",
                                    "body": "They’re as bad as Marxists imo.",
                                    "score": 37,
                                    "replies": [
                                        {
                                            "author": "Consistent-Dream-873",
                                            "body": "They probably ARE Marxists lmao",
                                            "score": 41,
                                            "replies": [
                                                {
                                                    "author": "kurtu5",
                                                    "body": "Marxists would never infiltrate and try to corrupt another political organization!  That would neve happen.  There is no pattern of that at all in history.  Don't look at history.  There is nothing to see there...",
                                                    "score": 24,
                                                    "replies": [
                                                        {
                                                            "author": "Consistent-Dream-873",
                                                            "body": "I've been listening to this book which kind of has a goofy title it's called lies is my liberal teacher told me.  I checked it out first because I've seen this guy in a couple of documentaries and he really seemed like a rational person so I wanted to see what he had to say more.  \n\nOne of his major points is talking about how the red scare is taught as a hysterical movement that had no basis in reality. The truth is there were many spies caught by McCarthyism and there was many communists as well that were actively working for undermine the government.  If I'm remembering correctly he specifically points out that there are people in the President's cabinet and specifically advising the president at the time that were actual communists appointed by Russian powers.",
                                                            "score": 14,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Great_Opinion3138",
                                                    "body": "Yeah good point this is reddit after all 😂",
                                                    "score": 16,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Opening-Wasabi-9018",
                    "body": "What about abolishing the government?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "orwll",
            "body": "Yeah I think the last five years were a wake-up call for some people in libertarian politics, thankfully.\n\nThe US/EU governments were building a digital censorship machine that seriously threatened to stamp out non-government-aligned viewpoints for the foreseeable future. Elon buying Twitter and Trump winning the US election were turning points for maintaining freedom of speech in the Western world. I don't trust any libertarian who was counter-signaling them in the last year.\n\nTariffs, Middle East conflicts -- I do not give a fuck about these things on the level of preserving a free Internet.",
            "score": 44,
            "replies": [
                {
                    "author": "meandthemissus",
                    "body": "Agreed. I've been called a statist for supporting Trump and Elon's recent actions. Like, yeah I get it they're not perfect but did you see the trajectory we were on recently?\n\nWe were looking down the barrel of a WHO treaty that would create a one-world govt with emergency powers in the scenario of a pandemic. And guess what always seems to happen when people give themselves emergency powers?\n\nThe lockdowns should have been terrifying for anybody who understands personal liberty and freedom. It wasn't \"just a few weeks\" as many dimwits liked to parrot. It was the idea, *the concept* that any of these governors had unilateral power to shutter private businesses.\n\nIt wasn't about whether masks worked. It was about whether or not we'd ever have personal autonomy again. \n\nHow many inches into liberty do you allow them to encroach before you realize you don't have it anymore?\n\nThe online censorship was probably the most terrifying. People want to bicker about whether private businesses had the right to remove comments from facebook but they were missing the bigger picture all along. Internet backbone providers were aligning to develop a massive censorship machine that *by the way* is still there and pieces are still being put into place.\n\nICANN was given away by Obama so now there's no 1A arguments to be made against domain seizure. The entire DNS system is effectively a censorship mechanism now. Major companies such as godaddy, google, cloudflare, amazon and others have been involved in upstream censorship, killing access to basic infrastructure to smaller companies unless they commit to censorship.\n\nWe've seen it with domain seizures, DNS denials, DDOS attacks (which, let's face it, cost money to operate and aren't just script kiddies in basements), internet connection denial to smaller  companies, cloud server denial to smaller companies. All of this on ideological lines, *not a legal basis*.\n\nAnd the best part is, the masses are welcoming every move into our lives because they're couching it all under the guise of fighting nazis or fascists. Who cares if content is removed from the internet *if they're nazis they deserve it!*\n\nAnd there you go. Can't have free speech if there's a subject that's summarily prohibited, no matter how much you might disagree with it. \n\nUsed to be a saying \"The internet treats censorship as damage and routes around it,\" but nowadays people are cheering for the censorship.\n\nI could go on, but my point is, anything that shrinks govt is good in my eyes. Anybody who thinks Elon bought Twitter to turn a profit is a fucking moron. The dude obviously took a huge hit and won't likely regain those losses any time soon. He's got fuck-you money and is clearly taking a lot of flak for pursuing what I believe are pretty nobel causes. Is he perfect? Hell no. But I appreciate that he opened Twitter to opposing viewpoints during a time in which all the social media companies were in lockstep against any right-leaning views. Is Trump perfect? Hell, no. In fact, I think he makes a ton of unforced errors that really hold him back. But when you compare him to the status quo of presidents during my lifetime, he's a breath of fresh air. Even if he accomplishes nothing, the fact that he's even willing to discuss shrinking govt... those words have never even been spoken by the old guard.",
                    "score": 39,
                    "replies": [
                        {
                            "author": "orwll",
                            "body": "> It was the idea, the concept that any of these governors had unilateral power to shutter private businesses.\n\nRight. There were so many things in the last five years that were incredibly dangerous precedents. \n\nThe lockdowns; the vaccine mandates; banning discussion of Covid origins and vax injuries. Those were the big ones, then you can go on listing stuff like banning Trump from all social media, seizing the bank accounts of the Canadian truck protesters. \n\nMaybe the scariest thing was seeing the mainstream press and even stalwart civil liberties groups like the ACLU completely disgrace themselves and support most or all of these things. \n\nCovid and the 2017-2022 \"misinformation\" crackdown were a double four-alarm fire for freedom advocates. And none of the people responsible have ever even apologized, much less been held responsible. Those people HAD to be stopped.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "meandthemissus",
                                    "body": "> The lockdowns; the vaccine mandates; banning discussion of Covid origins and vax injuries. Those were the big ones, then you can go on listing stuff like banning Trump from all social media, seizing the bank accounts of the Canadian truck protesters. \n\nMy friends are annoyed that I still talk about those things. They say \"it's in the past, why are you still on about this?\"\n\nIt's like the boiled frog. I like to ask them if in 2010 I told them that governors would shutter their businesses and force them to take an experimental drug to get a job, if they believed the govt had enough political capital to pull that off without a massive revolt. 2010 me would have said you're crazy. 2025 me is kicking myself for not being *more extreme* in my doomsday predictions. Not only did they completely pull off massive crimes against humanity, the masses cheered for it. There are people **today** who have used this cultural divide as the basis for their entire personality. The NPC meme could not be more apt.\n\nCanada has gone even further than I ever expected. I love visiting Canada, or I should say I used to, but recently I've added it to the list of places I dare not go, lest I find myself a political prisoner. Hell, just the things I've written on reddit are enough against the overton window I worry if I ever travelled to the UK, Australia, or Canada, if I would remain free. Their speech laws have slid so far into authoritarianism that every-day speech *including jokes* are crimes in those countries.\n\nI can't get over.. *won't get over* the fact that all of these things occurred and the entire system I believed existed to protect our rights caved and became part of the problem itself. \n\nEven our basic right to defend ourselves was being challenged. I'm sure you heard the message loud and clear during the past 5 years. We are allowed to burn your cities to the ground, but if you defend yourself, we're going to throw the entire weight of the govt against you. There were so many cases of self defense that were *directly related to govt endorsed mobs in our cities* that ended in lengthy, biased court cases. I'm semi-relieved that some of the high profile cases did eventually rule in favor of self defense (I'm sure you know of the ones I'm talking about), but the message was still clear: If you have to exercise your right to self defense, you're entire future hangs in the balance and you can't really trust the courts to do the right thing anymore.\n\nThe \"misinformation\" campaigns are the closest you can get to a real life example of doublespeak in my opinion. Every time I see the word \"misinformation\" I assume the person using it is lying and I pay attention to whatever they're labelling as wrong.\n\nIt's frustrating that the dystopian futures that were well known as cautionary tales a few decades ago have become a reality today. I remember the common sentiment not too long ago was that censorship is universally bad and that authoritarian rule was bad. Now the general public cheers for it. I just can't even understand what happened.",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "ILikeBumblebees",
                                            "body": "> They say \"it's in the past, why are you still on about this?\"\n\nI've never understood this mentality.  Everything we understand about reality is an understanding of the past.  We plan for the future solely based on what we experienced in the past.  WTF else do we have to go on?",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "ILikeBumblebees",
                                    "body": "> Covid and the 2017-2022 \"misinformation\" crackdown were a double four-alarm fire for freedom advocates.\n\nAnd voting for Trump to stop this stuff happening in 2025 is definitely sensible -- imagine if he'd been president in 2017!",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "orwll",
                                            "body": "Get informed, brother: https://www.youtube.com/watch?v=XPPc8OVNngg&msockid=d7b67477ea6c11ef9c999684b4b5ca89",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "ILikeBumblebees",
                                                    "body": "Dude, I'm not watching a three hour video as a response to a one-sentence sarcastic comment.  You got a point, make it yourself.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "orwll",
                                                            "body": "I don't care about you. Link is for people who want to know.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "ILikeBumblebees",
                                                                    "body": "Literally no one is going to watch a three hour video with zero context for what point you're trying to make.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "orwll",
                                                                            "body": ">Literally no one\n\n>1,456,486 views",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "47sams",
                            "body": "It’s fun to live in theories online, but in real life, you have to play the real game.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ILikeBumblebees",
                            "body": "> Agreed. I've been called a statist for supporting Trump and Elon's recent actions. Like, yeah I get it they're not perfect but did you see the trajectory we were on recently?\n\nSo you fell for it, then.  Fabricating or exaggerating the threat of one side in order to get you to support the other is the oldest trick in the book.\n\nAnd in this scenario, none of the issues you're complaining about are going to be solved by Trump or any other politician -- the danger of overreliance on centralized platforms, domain seizures, censorship and the like aren't going to be solved by any set of politicians, because by looking for a political solution, you're inherently yielding to political *control* in the first place.  \n\nThe only solution is to adopt decentralized alternatives -- use FOSS, use obscure protocols, get off of Twitter and onto ActivityHub platforms, use older tech like NNTP and IRC, use alternative DNS solutions, etc. Tor, ncdns.  No, the vast majority of people will never use any of these, but so what?  We're not influencing them sufficiently on mainstream platforms anyway.  Can't have your cake and eat it to.  Decentralization is there for those who want it, and keeping them separate from the mainstream internet, we're safeguarding the alternatives against censorship, against Eternal September, and against being co-opted.  \n\nTurning to politics to solve the problem it created in the first place is a fool's errand.\n\nAnd in the meantime, thanks to the delusion that Trump and Musk are going to keep the internet open and free, we're going to end up with tariffs, out of control consumer prices, and all manner of economic intervention that no one sane ever asked for.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "420Migo",
                                    "body": ">Fabricating or exaggerating the threat of one side in order to get you to support the other is the oldest trick in the book.\n\nExcept that's not what happened. We seen the Cheneys and Bush era Republicans endorse Kamala over Trump. We seen left leaning libertarians and even some progressives shift to the right recently. His cabinet has democrats treated like shit by their own party. Hell, Trump was a Clinton supporting democrat.\n\n>And in this scenario, none of the issues you're complaining about are going to be solved by Trump or any other politician\n\nPlenty of things have already been solved and many other things are being looked into.\n\n>Turning to politics to solve the problem it created in the first place is a fool's errand.\n\nNot always, the gop has been hijacked and influential Republicans like Mitch McConnell have lost their power. This is a win, imo because Trump is actually doing the things people voted him for.\n\n>we're going to end up with tariffs, out of control consumer prices, and all manner of economic intervention that no one sane ever asked for.\n\nBut people did ask for these things. It's people like you that don't understand that we can't have jobs and sectors coming back while at the same time have low prices. It just cannot happen. There has to be a massive shift in the way things happen and tariffs are the least damaging option we have.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ILikeBumblebees",
                                            "body": "> Except that's not what happened. We seen the Cheneys and Bush era Republicans endorse Kamala over Trump. We seen left leaning libertarians and even some progressives shift to the right recently. His cabinet has democrats treated like shit by their own party. Hell, Trump was a Clinton supporting democrat.\n\nAnd this doesn't seem to demonstrate *even more strongly* that the politicians are all part of the same club, positioning themselves on opposing sides in whatever way maximizes their power the most in the moment?\n\n> Plenty of things have already been solved and many other things are being looked into.\n\nWhat has been solved?\n\n> This is a win, imo because Trump is actually doing the things people voted him for.\n\nYeah, tariffs and mass deportations.  That's some great stuff right there.   You think I want Trump, or any other politician, acting on whatever crackpot ideas were in voters' heads when they cast their ballots?\n\n> But people did ask for these things.\n\nYou're right -- nationalists, socialists, and other assorted morons asked for these things.   The politicians I want in office are the ones who'll tell them to go pound sand.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "buckeye-jh",
            "body": "I landed on I want as many Thomas Massies as possible because I dont see any Libertarians getting elected on a Federal level. I came to become a Libertarian because of Ron Paul. Well Ron Paul decided he was going to run(and actually get elected) as a Republican and if it made sense for him, well it makes sense for me. That doesn't mean I am a Republican as I disagree with many things from the Swamp Based Republican regime but until either \n\nA. Libertarian candidates don't suck and/or can get elected\n\nB. Democrats run someone similar to Thomas Massie\n\nThen I don't have much of a choice. Usually I just abstain from a vote if I don't agree with either candidate but I am not going to hate on a candidate who is a lower case Libertarian because they decide to run as a Republican.",
            "score": 6,
            "replies": [
                {
                    "author": "Spe3dGoat",
                    "body": "The \"Thomas Massie\"s being so rare in elected positions is depressing.\n\nRespectful, thoughtful, intelligent and calm. I don't have to agree with him on everything to know he is a decent person surrounded by parasites.\n\nHe is the closest we have and it won't be enough.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 24,
            "replies": [
                {
                    "author": "seenthevagrant",
                    "body": "Yall into some freaky fan fic",
                    "score": -18,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "seenthevagrant",
                                    "body": "“You know the type: loud as a motorbike but wouldn’t bust a grape in a fruit fight.”",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "author": "Wu-Tang_Killa_Bees",
                                            "body": "There's a hov bar for every situation",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Wandering_Wand",
            "body": "A lot of people’s “libertarianism” was put “on pause” with the eye opening charade that we call the covid pandemic. \n\nWe witnessed a large portion of our population become wannabe tyrants overnight. These people were majority left-leaning or full bore commies that finally emerged from their pig pens. \n\nWhen I realized so many of us have neighbors that wanted me confined to my home or wanted me to lose my job over the jab, I saw that most people are sheep and want to be controlled by something. \n\nThat something is the new god of government that democrats and neocons worship. \n\nThe GOP is kind of turning into an actual second party under Trump after decades of being fully merged with the Dems as the uniparty.\n\nEdit: and to summarize, it became hard to see a libertarian future with so many people forsaking the live and let live mantra and trampling all over the NAP. I’m still a libertarian at my core, but there’s been a need for some level of law and order lately. The west was cast away to some weird demonic crap the last several years and people are waking up to it.",
            "score": 7,
            "replies": [
                {
                    "author": "Great_Opinion3138",
                    "body": "Thank you for saying it so well. So many comments here seem to completely miss the point of this post for some reason.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Wandering_Wand",
                            "body": "Yep, I knew exactly where you were going. ",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "selfmadetrader",
                    "body": "This was well put, good writing. I agree.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "yadius",
            "body": "Not possible for everyone, and states are making it harder and harder, but a growing number of people are doing full national exits.\n\nI noticed the YT channel \"Nomad Capitalist\" recently hit 1 million subscribers.",
            "score": 8,
            "replies": [
                {
                    "author": "Sea_Journalist_3615",
                    "body": "Lol there is no where to go.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Undying4n42k1",
                            "body": "I bet if you set up on the moon, governments would complain that it shouldn't be owned by anyone, and would go arrest you.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Friedrich_der_Klein",
                                    "body": "This isn't even a joke, look up paris convention or how it's called. Countries like france think only the state should own the moon.",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "Mikenator762",
                                    "body": "Ik this is a joke, but if you think the moon is a place that can be gone to, I have a few videos for you to watch.",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "Undying4n42k1",
                                            "body": "I've exited the conspiracy theory phase of my life. If there was one, though, Trump's administration will expose it soon enough.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "Mikenator762",
                                                    "body": "😂😂😂😂😂😂",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "757packerfan",
            "body": "If you became a libertarian because you wanted to be left alone then you missed the point. You don't need to read any books before you come to the conclusion you want to be left alone. You simply feel that way after living in the world.\n\nBut once you read books like those you become libertarian if you truly understand the role government should or should not play in a society. It's about right and wrong, not just wanting to be left alone.",
            "score": 29,
            "replies": [
                {
                    "author": "Great_Opinion3138",
                    "body": "lol it’s someone elses tweet dude I think your reading way too much into my world view here. I was simply saying it is going to take a lot of fighting within the current system to get to the Libertarian utopia of that’s even possible in my lifetime.",
                    "score": 19,
                    "replies": [
                        {
                            "author": "757packerfan",
                            "body": "Yeah, I'm not arguing with you. Just the Tweeter.",
                            "score": 17,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "YardChair456",
            "body": "That actually makes a lot of sense, I had never thought about it that way.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Solomon044",
            "body": "This is all our journeys man.  You are not alone.",
            "score": 6,
            "replies": []
        },
        {
            "author": "SAMBO10794",
            "body": "Yeah me too.\n\nI believe in the NAP, I believe the government is best when it governs not at all. I believe that voting is a form of violence, fundamentally. \n\nThese principles are true.\n\nBut this rigid adherence to these true principles does the same things other failed ideologies have all done: it ignores human nature. Humans are destructive. You created a free paradise without a government? Give it a week, a committee forms, give it a month, they have rule enforcement. Give it a year, you’re at square one.\n\nEven in the Bible, when the Israelites were ruled by the creator of the universe, they complained that they wanted a king to rule over them, like other nations.\n\nGovernment isn’t going away. It’s not going away because it’s just an extension of our own nature. Until you change human nature, we are working within a system of rules that we create in our hearts.",
            "score": 3,
            "replies": [
                {
                    "author": "Great_Opinion3138",
                    "body": "I agree with you but not sure how voting is violence. Isn’t it more of a service/obligation to at least try and help shape the outcomes in the most libertarian way until we reach ancapistan?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SAMBO10794",
                            "body": "Fundamentally, it’s outsourcing your opinion to the government, who has the ability to enforce laws, taxes etc that you as an individual can’t. If you can’t, why then can you vote for it?\n\nSee Lysander Spooner for information about this perspective.\n\nAgain, the concept that voting is akin to violence isn’t a useful concept in reality. Even if it’s true.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Great_Opinion3138",
                                    "body": "Ok I get it but I just don’t see a way without totalitarian violence to implement libertarian ideas without voting currently.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "SAMBO10794",
                                            "body": "I agree.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "dp25x",
                                            "body": "Hypothetically, what if you and other like-minded folks built a parallel system. Think along the lines of how a small startup company comes along and displaces a large, old, established company in the marketplace. Setting aside for the moment the difficulty involved, if you built a parallel system that eventually became impervious to predation by the existing system, wouldn't that accomplish your goals without either voting or totalitarian violence?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "DeyCallMeWade",
            "body": "Wish Nick would run for more than just a representative of his county. I believe he could do truly good things for Virginia.",
            "score": 3,
            "replies": []
        },
        {
            "author": "dp25x",
            "body": "Here's the thing.... if you \"become a libertarian\" because you hope to change someone else's behavior, you're setting yourself up to be disillusioned. Being a libertarian is about your behavior. The kind of world you want to live in should be a consequence of you choosing libertarianism, not the cause of it. The kind of person you want to be should be the cause.\n\nThat said, I definitely think that libertarian strategies are usually misguided.  They usually require some giant change to how most people think.  It's a boil-the-ocean problem. I think better solutions will come in increments.  I think the best solutions are the kinds that make what other people are doing be of no consequence to your own aims.",
            "score": 3,
            "replies": [
                {
                    "author": "Great_Opinion3138",
                    "body": "I think the utopian takes are childish and absolutely you nail it that requiring others to magically change is a fools errand. The only way to implement change is with great effort and trying to bring others with you by attraction rather than by force.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "MjolnirTheThunderer",
            "body": "Yep… watching the events of Covid unfold did this to me.\n\nI still think of myself as a libertarian and ancap, but I have realized we will never convince most people, so am I doing what I feel like I need to do.",
            "score": 3,
            "replies": []
        },
        {
            "author": "RProgrammerMan",
            "body": "I think we need an all of the above strategy. Use and create technology that limits government power. Educate people so they don't enable government. Finally have enough right-leaning politicians to gum up the works. If there is no one representing capitalist views in government they can outlaw technology and shut down freedom of speech. Ultimately I think technology shapes how people live which shapes culture which then determines political outcomes.",
            "score": 3,
            "replies": [
                {
                    "author": "Great_Opinion3138",
                    "body": "Agree 👍.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mike__O",
            "body": "I like the IDEA of Libertarianism and AnCap, but the reality of it actually working falls far short.  The real test of any kind of ideology is what to do about people who don't want to participate in good faith.  That's where the NAP, Libertarianism, or AnCap falls short.  Either they sacrifice the ideals of the philosophy, or the entire system breaks down promptly.",
            "score": 5,
            "replies": [
                {
                    "author": "jaejaeok",
                    "body": "Not sure why this is down voted. It’s a good point and I’d love to hear widely accepted povs.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "catshitthree",
            "body": "Yes.",
            "score": 2,
            "replies": []
        },
        {
            "author": "livinlizard",
            "body": "Excellent quote.",
            "score": 2,
            "replies": []
        },
        {
            "author": "bobroberts1954",
            "body": "I am in favor of reducing the government down to nothing, but this isn't the way to do it. A lot of lives depend on the institutions we have, it is indecent to just yank that away. The rich would be fine, they can buy whatever service they need, but the poor would/will be devastated.\n\nIt's like a game of pickup sticks, the pile has to be dismantled carefully and just a bit at a time. People need time for new institutions to develop and they need to become wealthy enough that they don't need charity just to survive. Then we need to grow institutions to take care of the disabled, from age or injury or from birth. I remember when blind men sold pencils on the street, rattling their cups for a penny. We need institutions that keep wealth from collecting in the eddies of our economy and to keep information honest and available. The rich aren't going to do these things, they will take every advantage their money can buy. These institutions will have to come bottom up  not top down. Until these problems are solved we are compelled to maintain the structures that exist; it is easy to tear them down, it is difficult to build them.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ill-Income-2567",
            "body": "Exactamundo.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Wll25",
            "body": "Can we make a new subreddit for this ideology? Like a \"minarchocapitalism\" sub?",
            "score": 2,
            "replies": []
        },
        {
            "author": "DragonOzwald",
            "body": "Just because you are libertarian doesn't mean you can't do something about what the government, corporations, organizations or individuals are doing to you. \n\nWhere do people get this idea that libertarians are pacifists?\n\nThe NAP followed its logical conclusion could justify something as extreme as violent revolution and executions...although that's probably not preferable lol \n\nInterfering with the violation of someone's rights is consistent with natural law.",
            "score": 2,
            "replies": [
                {
                    "author": "Great_Opinion3138",
                    "body": "Thanks. For some strange reason many comments act like if you have the sufficient moral purity of libertarianism in your head then magically that’s all that’s required and to do anything else is statist. Other comments seem to go further and claim to even think that to even talk of needing to\napply pressure in the current system like this tweet suggest is fascism. Kind of bizarre people on this sub have such deranged ideas but I guess this is Reddit and the mind virus is over represented.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Palidor206",
            "body": "This feels like the average colonial early founders sentiment and why they advocated such strict \"guardrails\" against their own Fed government.",
            "score": 2,
            "replies": [
                {
                    "author": "Great_Opinion3138",
                    "body": "We need more of that spirit. Sadly once there’s free stuff it increasingly looks to be borderline impossible to roll back.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "here we r",
            "score": 1,
            "replies": [
                {
                    "author": "WaitingToBeTriggered",
                    "body": "BREAKING THEIR LINES",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "thebosstiat",
            "body": "A focus on local action is what's missing. Mises and Hayek are great, but you have to actually enact their principles for them to matter. You can't do that at the federal level. Even Trump is really just a proxy for Wall St interests who have made a career of stealing money from Americans, and we're actually getting some consideration out of him.\n\nStarting a covenant community is completely legal in America. We should be focusing on stuff like that. While the Free State Project tends to attract a bunch of people who think the most pressing thing facing America is legalizing fentanyl, that's a great idea.",
            "score": 1,
            "replies": []
        },
        {
            "author": "True_Kapernicus",
            "body": "I never became a libertarian because I wanted to be left alone. I \\*was\\* effectively being left alone when I became a libertarian.",
            "score": 1,
            "replies": [
                {
                    "author": "Great_Opinion3138",
                    "body": "So Covid you were magically left alone by the draconian restrictions globally by wearing an “I’m a libertarian” t shirt? Are you retarded or just stoned?",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "stubrocks",
            "body": "Time to move on to Hoppe...",
            "score": 1,
            "replies": []
        },
        {
            "author": "s3r3ng",
            "body": "Where is that exactly?   Being some kind of Statist?  If so go to some other subreddit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "axiomata",
            "body": "Good thing Mises did not become something else when the Nazis wouldn't leave him alone.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SoylentJeremy",
            "body": "I didn't become a libertarian (ancap) because I want to be left alone, but because it is the only moral option. \nI'm not changing to something else because I seek to be a moral person. \n\nThat's where Nick, and others like him, go wrong. They are abandoning morality for political expediency.",
            "score": 1,
            "replies": [
                {
                    "author": "Great_Opinion3138",
                    "body": "You’ll never achieve anything then unless you are advocating violence. Peaceful change requires pragmatism.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "SoylentJeremy",
                            "body": "Sounds like you and Nick would get along swimmingly.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Great_Opinion3138",
                                    "body": "Ok humour me. How do you plan to move society toward your political ideas peacefully and without force?what do you do of the left keeps winning and it becomes increasingly impossible to live your morals in peace? [It’s worth watching this speech today about what is happening in Europe in regards to free speech and arresting people for silently praying.](https://x.com/charliekirk11/status/1890409547916861621?s=46). I’d argue once that sort of thing takes off it’ll become virtually impossible to get freedoms back just look at Venezuela.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "SoylentJeremy",
                                            "body": "I know the philosophy, I live it, and I spread it. \nIt is only moral to use violence in defense, so that's the only way that I use it or advocate for its use.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SoylentJeremy",
                            "body": "I'd be curious as to whether you are actually willing to put your philosophy into words:\n\n\"I will do things that I know to be evil in order to accomplish my goals.\" \n\nAre you willing to say that out loud?",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Great_Opinion3138",
                                    "body": "What a weird twisting of what I’m talking about. I’m talking about peacefully voting and pushing for libertarian ideas through the current political system so that government reduces in size and power. It means to fight hard to make sure it happens by helping attract others to the cause. What are you even hinting at here? Is this some sort of religious political purity test that is unattainable by anyone but you?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "SoylentJeremy",
                                            "body": "If you truly are talking about implementing only libertarian policies that increase freedom and decrease the power of government, I'm not going to fight you over it. \n\nThat isn't what Nick is advocating for. Not even in the slightest.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Great_Opinion3138",
                                                    "body": "How do you know that from this tweet? Is there some context I’m missing?",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "SoylentJeremy",
                                                            "body": "I just know that from knowing about what Nick believes. He's been pretty forthright about his views.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Great_Opinion3138",
                                                                    "body": "I don’t really know him. I[asked grok to summarise his politics in regards to libertarianism and it looks pretty good to me](https://grok.com/share/bGVnYWN5_47734267-0503-4415-9b1b-cee42e356f02)\n\nNick Freitas, a member of the Virginia House of Delegates, is often described as having a “conservative voting record with a libertarian streak.” His approach to politics can be characterized by several key points when viewed through the lens of libertarianism:\n\n- **Individual Liberty and Limited Government:** Freitas advocates for individual liberty, which is a central tenet of libertarianism. He has expressed support for reducing government intervention in the economy, promoting free-market economics, and opposing what he sees as excessive government control over personal choices. His stance on issues like opposing Obamacare, advocating for the repeal of federal income tax in favor of a national sales tax, and his criticism of government mandates, such as those related to transgender restroom use, align with libertarian principles of minimal government interference in personal and economic life.\n\n- **Fiscal Conservatism:** Freitas has shown concern for deficit spending, which resonates with libertarian views on fiscal responsibility. He has criticized congressional Republicans for not controlling deficits, emphasizing the need for unpopular but necessary votes to manage the country’s fiscal health.\n\n- **Gun Rights and Criminal Justice:** While not strictly a libertarian position, his support for gun rights aligns with the general libertarian advocacy for the right to bear arms. However, his stance on criminal justice reform shows a more nuanced approach; he supports moderate reforms like rolling back qualified immunity and “no-knock” warrants, indicating a willingness to adapt libertarian ideas of reducing government power to practical policy changes.\n\n- **Cultural and Social Issues:** Freitas’s positions on social issues sometimes diverge from pure libertarianism. For instance, he supports building a wall on the US-Mexico border and has taken conservative stances on issues like abortion. These positions reflect a blending of conservative and libertarian ideologies, where cultural conservatism intersects with libertarian economic and personal freedom principles.\n\n- **Endorsements and Affiliations:** Freitas has been endorsed by notable libertarian-leaning figures like Senators Rand Paul and Mike Lee, suggesting a recognition within libertarian circles of his commitment to some libertarian principles. However, his endorsements from groups like the NRA and his association with conservative funding also highlight his broader conservative appeal rather than a strictly libertarian one.\n\n- **Public Perception and Criticism:** While some view Freitas as a libertarian hero, especially in the context of his speeches against socialism and his advocacy for individual rights, others criticize his libertarian credentials due to his more conservative social positions and his association with far-right donors, suggesting that his libertarianism might be more tactical than ideological in certain contexts.\n\nOverall, Nick Freitas embodies a blend of libertarianism with traditional Republican conservatism, particularly in how he navigates cultural issues alongside his advocacy for economic freedom and limited government. His political stance is seen by some as a promising sign for the GOP’s libertarian wing, though it’s clear his politics are not purely libertarian but rather a fusion of libertarian philosophy with conservative values.\n\n[I drilled down further by aging about his most controversial political tweets and then to summarise the main ones that are non-libertarian to help](https://x.com/i/grok/share/hhVHegU8crjKFclOBPMLSIPZ8). (Reddit really needs something like grok, I’m surprised they don’t have anything yet even only for premium members. )\n\nHere are some non-libertarian elements or takes that can be observed in Nick Freitas’ controversial tweets:\n\n1. **Support for Certain Government Interventions**: While Freitas often champions libertarian ideals like minimal government involvement, his critiques of voting rights, especially in relation to felons or certain crimes, could be seen as advocating for government oversight in areas where libertarians typically oppose intervention. This can be interpreted as non-libertarian because it involves the state determining who has the right to vote, which isn’t aligned with a pure libertarian stance of maximizing individual freedom with minimal government interference.\n\n2. **Selective Criticism of Government Spending**: His criticism of government funding for abortions or certain health mandates might align with libertarian principles of limiting government expenditure and scope, but his selective focus on these issues while not addressing others (like military spending or corporate subsidies) might suggest a non-libertarian inconsistency. Libertarianism would typically critique all forms of government spending or regulation that aren’t absolutely necessary for protecting individual rights.\n\n3. **Education and Indoctrination**: Freitas’ comments on education often focus on what he perceives as ideological teaching, suggesting some form of government oversight or reform in education to prevent this. While advocating for education free from ideological bias can resonate with libertarian ideals, the implication that government should actively intervene to achieve this contradicts the libertarian preference for private or parental control over education without government dictating curriculum or ethos.\n\n4. **Election Integrity**: His questioning of election processes might lean towards skepticism of government efficacy or corruption, which could resonate with libertarian distrust of government. However, if these views lead to support for policies or actions that increase government control over elections (like voter ID laws that might disproportionately affect certain groups), it could be seen as non-libertarian. Libertarians generally advocate for minimal barriers to voting to ensure maximum individual liberty.\n\n5. **Mask Mandates Critique**: While opposing mask mandates can be seen as a libertarian stance against government overreach into personal health choices, the manner of critique, especially if it involves advocating for laws or policies that would limit the government’s ability to implement public health measures during crises, might not fully align with libertarian principles if they lead to broader restrictions on government action in other areas.\n\n6. **Criticism of Political Figures**: When critiquing other politicians, especially with a partisan lens, it can sometimes veer into territory where the critique is less about policy and more about political opposition, which might suggest a focus on party politics over principle, something less emphasized in libertarian thought which prioritizes individual freedoms over party lines.\n\nThese points highlight where Freitas’ public stances might not strictly adhere to traditional libertarian views, particularly when his criticisms or proposed solutions involve government action or imply a selective application of libertarian principles. However, political discourse often involves compromise or strategic focus, which can explain these deviations from a purist libertarian stance.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "SoylentJeremy",
                                                                            "body": "He is very pro government control over who can enter private property. \nThat's a serious negative, for me.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Taintraker",
            "body": "AnCaps are and will always be LARPers.\nBeing right or wrong doesn't matter. People will always look for authority figures to tell them what to do.",
            "score": -3,
            "replies": [
                {
                    "author": "finetune137",
                    "body": "women will always have r!pe fantasies!",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Great_Opinion3138",
                    "body": "Congratulations on the most retarded take today on Reddit.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "kurtu5",
            "body": "I realized that slave masters were going to keep slaves, so I became a slave master?",
            "score": -1,
            "replies": [
                {
                    "author": "Great_Opinion3138",
                    "body": "It’s idiotic takes like this that will mean things only get worse and never better. It’ll also become ever harder to borderline impossible to fix eg Venezuela.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "trufin2038",
            "body": "Freitas is a bit of a sellout. Certainly something else. He chose power and privileges over his principles.",
            "score": -1,
            "replies": [
                {
                    "author": "Great_Opinion3138",
                    "body": "Rather than moralising everyone to be a perfect human or not in every aspect of their lives which is impossible. Can we not have a simple discussion about simple quote?",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Will-Forget-Password",
            "body": "Who did you vote for? That is who you are.",
            "score": -1,
            "replies": [
                {
                    "author": "Palidor206",
                    "body": "I wrote in my dog.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Will-Forget-Password",
                            "body": "Spirit animals!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Spe3dGoat",
                    "body": "I wrote in Thomas Massie.\n\nWho did you vote for ? \n\nChoices are limited and the game is rigged.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sixxy-Nikki",
            "body": "Good to see you folks are keeping the Libertarian to Fascist pipeline alive and well. I beg one of you to actually give a fuck about obvious and BASIC civil liberties being stripped away by right wing statists and Christian Nationalists, instead of circlejerking about doge.",
            "score": -2,
            "replies": [
                {
                    "author": "dp25x",
                    "body": "Can you provide a couple examples of what you mean?  There are lots of different views on what is a \"basic civil right\" so it would help to focus the conversation",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Great_Opinion3138",
                    "body": "How the fuck do you conclude such a stupid take from this post?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Sixxy-Nikki",
                            "body": "Read the comments on this post and tell me they aren’t hungry to use the power of the state to crush leftists orgs and individuals.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "gruetzhaxe",
            "body": "Fascist..?",
            "score": -4,
            "replies": []
        }
    ]
}