{
    "title": "I am a Marxist, Convince me my ideology is stupid",
    "author": "Mindless-Worth7049",
    "subreddit": "Anarcho_Capitalism",
    "rank": 364,
    "score": 0,
    "upvote_ratio": 0.39,
    "num_comments (reported by reddit)": 196,
    "url": "https://www.reddit.com/r/Anarcho_Capitalism/comments/1iofqcv/i_am_a_marxist_convince_me_my_ideology_is_stupid/",
    "id": "1iofqcv",
    "selftext": "title basically explains it, feel free to ask questions to clarify my positions on things before you get to criticisng if you feel you need to",
    "comments": [
        {
            "author": "jazdi_86",
            "body": "Marx says the plebs will rise up and topple the Elite. In reality whenever they get power, in history, they start behaving like the Elite. Veblen's Theory of the Leisure Class provides the answers for why that pattern keeps happening. Its a hard job once a marxist gets into power to get everyone (given all our differences and goals) to row in the same direction based on just ideology. Its much easier with Veblen style Conspicuous consumption/leisure where the message is - hey man look at me, look where i live, look who i hang out with, look what i eat, look what i wear, look what toys I have, if you want to gain access to all that - do what i say.",
            "score": 14,
            "replies": [
                {
                    "author": "Fit_District7223",
                    "body": "You’re not wrong that power has a tendency to corrupt, and Veblen’s Theory of the Leisure Class makes solid points about status, consumption, and hierarchy. But this doesn’t actually refute Marx—it just explains why socialist revolutions have often been co-opted by opportunists who recreate the same class structures they claimed to fight against. That’s not a failure of Marxism as an analysis of capitalism—it’s a failure of implementing socialism in a way that prevents power from consolidating in the hands of a new ruling class.\n\nAnd sure, conspicuous consumption is an easy way to maintain control—capitalism thrives on it. But that doesn’t mean it’s the only way to organize society. If anything, Veblen’s theory helps explain why capitalism is so effective at keeping people invested in a system that exploits them—by making wealth aspirational rather than something to challenge. Just because something works to maintain power doesn’t mean it’s desirable or just.\n\nThe real issue isn’t whether people in power start acting like elites—it’s how to build systems that prevent that consolidation in the first place. Saying “power corrupts” isn’t a defense of capitalism; it’s an argument for better checks and balances in any system, whether socialist or capitalist.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "jazdi_86",
                            "body": "yeah..the checks and balances stuff is the hardest part to pull off I guess...probably why people end up defaulting to veblen tricks eventually. Sometimes through frustration and sometimes cause they just enjoy all the perks.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Fit_District7223",
                                    "body": "Yeah, totally. It’s hard to make sure things stay fair in any system. And yeah, sometimes people just fall into those tricks because it’s easier or more rewarding, even if they know it’s not great for the bigger picture.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "WishCapable3131",
                    "body": "Could you provide an example of when the plebs toppled the elites and then started to act like elites themselves?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Mindless-Worth7049",
                    "body": "Ill look into what veblen said. This seems a little based of when one guy or a few get power. The idea of marxism is to spread its ideas among the working class and have a mass movement not just a couple of rebels. Besides you referring to poor as \"plebs\" though, thanks for being civil",
                    "score": -4,
                    "replies": [
                        {
                            "author": "jazdi_86",
                            "body": "By Plebs I meant common people - people who don't have power (which includes the poor). Didn't say Marx has no value. It helped me see how we get exploited. But what to do about it. is were it has a long way to go.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Mindless-Worth7049",
                                    "body": "I understand what you mean by plebs, but its a derogatory term that implies that it is their own fault which is in the majority of cases false, and even when it is true it does not disqualify them (in  my opinion) from a second chance. Id like to hear which of marx's ideas specifically you agreed with and what you propose we do about the exploitation you acknowledge, and again thanks for your (Difficult to find in this sub) civility",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "author": "k-xo",
                                            "body": "It does not imply that it’s our own fault, it’s literally how the elite see us. Though some of the them refer to us as “the vulgar herd” or “the vile multitude”",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "Horror_Tourist_5451",
                                            "body": "Pleb comes from the Roman Plebeian, the two primary classes of freemen in Rome were Plebeian and Patrician. They had no more say in their standing than a Middle Ages peasant would.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "myholycoffee",
            "body": "If all value comes from labor, why are there objects that accrue in value over time without the need for extra labor?\n\nWhat is the point of Marx’s definition of exchange value if the same items can be exchanged in completely different ratios by other people?\n\nWhy Marx ignores the fact that the same object can be valued in different ways by different people? Or even by the same person given different circumstances?\n\nWhy Marx insists in starting his analysis from the commodity given that he himself admits commodities first must satisfy a human need?\n\nWhy Marx talks like value is alchemy? E.g.: he says value gets “crystallized” into the commodity lol",
            "score": 10,
            "replies": []
        },
        {
            "author": "eico3",
            "body": "What are your positions on things?",
            "score": 10,
            "replies": [
                {
                    "author": "Mindless-Worth7049",
                    "body": "abolish private property, money, the state, class. got more but theres the key ones",
                    "score": -14,
                    "replies": [
                        {
                            "author": "eico3",
                            "body": "How do you propose to do those things?",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "different_option101",
                                    "body": "Got ‘em",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "DifferentPirate69",
                                    "body": "Ending slavery had a lot of resistance and civil wars, this too would be violent.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Doublespeo",
                                            "body": ">Ending slavery had a lot of resistance and civil wars, this too would be violent.\n\nMarxist revolution were deadly and killed millions, hundred of millions.. actually killed more people that the two wolrd war combined.\n\nI pass, I prefer peaceful economic freedom.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "DifferentPirate69",
                                                    "body": "You're very ignorant about economic violence and everyone who dies legally for profit, it's actually real unlike the misinformation you spread.\n\n\nIt was not much, the only one's who were \"taken out\" were a few problematic bourgeoisies who caused problems and actively engaged in sabotage. Hoarding is a disease, parasitic even if it relies on appropriating wealth produced by collective labor.",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "different_option101",
                                                            "body": "Most people in this sub are well aware about economic wars. However, Marxists and socialists fail to realize that economic wars brought by capitalistic states are driven by the governments that ignore the will of the people. Communist China and Soviet Russia weren’t much different from western counties with their imperialist foreign policies. China and Russia both usurped the power over territories that were either fully independent or somewhat independent before the rise of communism and socialism. They’ve robbed their appendages of resources in a worse way than capitalist western countries, and they’ve sold off the resources to capitalist countries, causing famines and killing millions of people of their own citizens, while taking foreign aid from the same capitalist countries. No ancap is against some Marxists city states or communes, as long as you guys don’t force people to work and let them leave your territory if they want to. It’s only the Marxists and socialist that are against ancaps.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "DifferentPirate69",
                                                                    "body": "I disagree, governments are driven by capitalist bribes. There's no mechanism to stop corruption, it's exponentially more in capitalism and will continue to grow with the massive wealth inequalities. Especially worse if it's by unelected corporations who only care about maximizing profits. The corruption in communist countries is negligible compared to this.\n\n\\>They’ve robbed their appendages of resources in a worse way than capitalist western countries, and they’ve sold off the resources to capitalist countries, causing famines and killing millions of people of their own citizens, while taking foreign aid from the same capitalist countries.\n\nI don't know what you're talking about. Who sold off resources while taking foreign aid causing famines? The era in which USSR had famines was in periods of war and turmoil, had nothing to do with the economic system. China too was a famine ridden country before Mao, the single one during Mao's time was the last. The causes are bad weather, droughts and bad crop science by a certain someone who I forgot their name.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "different_option101",
                                                                            "body": "“I disagree, governments are driven by capitalist bribes.”\n\nAnd I agree with you for the most part. But here’s the thing- only the governments are able to conscript hundreds of thousands of people, or hire mercenaries that will get impunity from war crimes, and throw them in a meat grinder on the other side of the world. So all the corrupt capitalists are almost powerless without the backing of the government. I already feel there’s going to be a rebuttal- but what if corporations hire their own armies?!!! Impossible and doesn’t make any sense. Impossible because we live in the era of instant communication, high awareness, and disdain towards corrupt behavior. Good luck finding enough idiots that would voluntarily go to war today. Doesn’t make sense - Walmart will have their employees round up people in camps and force them to work… so they can provide them with shelter and food? Do you think someone is going to do business with Walmart if they do that? Please explain to me your fears, as I can’t even imagine such problem today. \n\n“The corruption in communist countries is negligible compared to this.”\n\nThis is hilarious to me. I was born in the USSR and I’ve learned what corruption is before I learned how to read. You must have learned history from soviet textbooks if you think corruption in communist/socialist regimes was negligible. The audacity of capturing territories and use them as farm fields with force labor while the center decides which cities get all the money is enough to understand how fucked up that system was. You can also check mixed systems that exist today, like Vietnam, and compare their corruption to the level of corruption in western democracies. \n\n“Who sold off resources while taking foreign aid causing famines? The era in which USSR had famines was in periods of war and turmoil, had nothing to do with the economic system.”\n\nThe scientist’s name you can’t remember is Trofim Lysenko who also caused soviet famine of 1933-1933. There war that Soviets were involved at the time is the war against their own population.\n\nFamines caused by natural disasters- all natural disasters were local. China and Soviet Russia are/were massive countries, that could easily pull enough resources together to help the people of affected regions. Yet it’s the capitalist countries that sent aid. Why? Because communist/socialist economies were in abysmal condition, otherwise they would have food or money to buy food from other countries. And the Soviets where selling wheat, which ended up in what’s recorded in history as Holodomor. \n\nIt’s funny that you completely ignored the part about China’s and Russia’s expansionism, and all repressions, like it’s not related to this argument at all. \n\n“But it wasn’t real communism!” Fuck that. Just like “it’s not real democracy”, fuck that too. \n\n\nSerious question, I’d appreciate if you answer this. You can even ignore the rest of my reply if you want to. \n\n“There's no mechanism to stop corruption, it's exponentially more in capitalism and will continue to grow with the massive wealth inequalities.”\n\nWould you care for wealth inequality if people that are willing to work car have a very comfortable living? Meaning there will be some ultra wealthy people, but anybody who’s willing and able to work can have a good apartment/house, good reliable vehicle, savings, etc.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Doublespeo",
                                                            "body": ">You’re very ignorant about economic violence and everyone who dies legally for profit, it’s actually real unlike the misinformation you spread.\n\nif I am very ignorant please provide me with evidences and please be specific and precise.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "DifferentPirate69",
                                                                    "body": "Google economic violence, paste each category, and go through the news or count statistics. There are no propaganda hit pieces like the \"black book of communism\" because, you know, it's not productive, and its only aim was, duh, a propaganda hit piece. They even added nazi deaths, people that could have been born, and finally wanted to round off the number. \n\nDo the work.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Doublespeo",
                                                                            "body": ">Google economic violence, paste each category, and go through the news or count statistics. There are no propaganda hit pieces like the “black book of communism” because, you know, it’s not productive, and its only aim was, duh, a propaganda hit piece. They even added nazi deaths, people that could have been born, and finally wanted to round off the number.\n\n>Do the work.\n\nSo you make a claim and I have to prove it?\n\nlol thats not how it works:)",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "DifferentPirate69",
                                                                                    "body": "Scroll back and see who made the claim of this being something something \"peaceful\".",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Doublespeo",
                                                                                            "body": ">Scroll back and see who made the claim of this being something something “peaceful”.\n\nSure I provide evidence for that once you back up yours.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "DifferentPirate69",
                                                                                                    "body": "Circle back with your research, you made the claim. Mine is already backed up, just google terms of economic violence and count the stats. There's no hit piece actually pushed around, because capitalism depends on people being fools.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "thermionicvalve2020",
                                            "body": "The state trying to fix a problem the state created.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "myholycoffee",
                            "body": "The beauty of anarcho-capitalism is that it allows you to have a group operating under these exact rules, but for some reason you want everyone to follow these rules as well…",
                            "score": 18,
                            "replies": []
                        },
                        {
                            "author": "Gemini_Of_Wallstreet",
                            "body": "Ok i want to play on the  xbox of the commons for 10 hours, you want to play on the xbox of the commons for 10 hours\n\nHow do we solve this conundrum ?",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "DifferentPirate69",
                                    "body": "Communism is not sharing toothbrushes, it's about meeting needs through collective effort. If someone needs something, they take the initiative to create it. If more people require the same item, they come together to produce it.\n\n\nIn this case an xbox would be produced as per demand.",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "author": "inanimate_animation",
                                            "body": "How is it decided that an Xbox should be produced instead of a defibrillator? How would people know how many resources should go into  the creation of Xboxes vs defibrillators?",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "DifferentPirate69",
                                                    "body": "It's decided based on needs?\n\n\nThrough planning?",
                                                    "score": -9,
                                                    "replies": [
                                                        {
                                                            "author": "Official_Gameoholics",
                                                            "body": "Ok, now how do you solve the economic calculation problem?",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "DifferentPirate69",
                                                                    "body": "Are you insinuating everyone has their needs met in a capitalist system?\n\n\nEconomics don't take into account inequality, it's also impossible to know what everyone in a country needs, yet USSR delivered with it's 5 year plan, it's best to leave that to communities.",
                                                                    "score": -1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Official_Gameoholics",
                                                                            "body": ">Are you insinuating everyone has their needs met in a capitalist system?\n\nNo, but everyone can have their needs met, unlike communism, which has no way of knowing what the needs are, how to get them fulfilled, and where resources are most efficiently used.    \n\nAlso the USSR starved millions of people and drastically lowered the standard of living. That's a failure.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "DifferentPirate69",
                                                                                    "body": "If everyone can magically have their needs met, why are they struggling? The contradictions in capitalism are that it advocates for infinite growth but also claims scarcity and allows people to hoard.\n\n\nYou're misunderstanding what communism is - it's based on needs, and everyone contributes with labor. If you go buy groceries, you take what you want even though you might be rich, a similar logic applies to resources. There's no profit motive to hoard, everyone does their thing.\n\n\nI don't like comparisons based on death, but the only system that ensures there's always inequality and deprivation for a class is capitalism.\n\n\nYou might be surprised to find out how many people starved under British capitalism, and how many still die today due to economic violence stemming from inequalities that you're unaware of.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Official_Gameoholics",
                                                                                            "body": ">If everyone can magically have their needs met, why are they struggling?\n\nThe state is stealing from the productive class.\n\n>The contradictions in capitalism are that it advocates for infinite growth but also claims scarcity and allows people to hoard.\n\nThere's no contradiction there. Production is limitless. We can always make more. Humanity is scarce. Therefore, if everyone produces at the efficiency required to satisfy everyone, then everyone will be satisfied. \n\n>You're misunderstanding what communism is - it's based on needs, and everyone contributes with labor.\n\nWithout prices you can't efficiently distribute goods most efficiently, or even without a loss. You can't measure \"needs.\" Prices are the only way to get around this economic calculation problem. \n\n>If you go buy groceries, you take what you want even though you might be rich, a similar logic applies to resources. There's no profit motive to hoard, everyone does their thing.\n\nIgnoring the fact that this would cause production to completely stop due to not needing to work, this only works if you anniahlate scarcity. That's impossible. Everything physical is scarce.\n\n>the only system that ensures there's always inequality and deprivation for a class is capitalism.\n\nCollectives don't exist. They can't have power. They're abstractions and nothing more.   \n\nWho gives a shit about inequality? Nobody is equal. Stop trying to force them to be. Everyone has subjective values and goals, and it is a disservice to deprive them of what they want for some misguided attempt at \"equality.\"\n\n>You might be surprised to find out how many people starved under British capitalism\n\nThere has never been an era of British Capitalism. \n\n>how many still die today due to economic violence stemming from inequalities that you're unaware of.\n\nCapitalism currently has no place in the world to call home at the moment. So I fail to see where you're referencing it at.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "DifferentPirate69",
                                                                                                    "body": "Lol the state exists to protect the capitalist class interests and private property. Without the state many rich people restricting resources would be taken out by mobs.\n\n\n\nProduction is not infinite, what are you even on about. The problem isn’t a lack of people to produce goods - it’s because production under capitalism is based on profit, not need. We produce enough food to feed 10 billion people, yet millions starve because food is treated as a commodity, not a right. Millions of the humanity you call scarce die each year because of it.\n\n\n\nWith prices, goods are not efficiently distributed. We wouldn't be having this discussion if it worked. Needs are determined in communities. There are basic needs like food, water, shelter, healthcare which is prioritized with no debate, rest needs are determined democratically. Prices and inequalities out-price you to access essentials.\n\n\n\nPeople are not inherently lazy or solely motivated by profit. Under communism, work is reorganized to serve collective needs. Individuals are motivated to contribute to society, not just by profits. The only ones who need to be rehabilitated are the ones working in finance.\n\n\n\nResources are finite but scarcity is artificially created in capitalism to keep up sales. Communism seeks to eliminate artificial scarcity and enable equitable distribution. It also emphasizes sustainable use of resources, because it prioritizes needs over profits and wastage, so it's more long term without eating up the planet’s finite resources.\n\n\n\nCollectives do exist - labor unions, cooperatives, collective farms and mutual aid networks. Communism seeks to extend this collective power to all aspects of society, all decisions are made democratically and in the interest of the many, not the few. End authoritarianism in the workplace.\n\n\n\nCool strawman comparing inequality to \"being equal\", it isn't. Communism is not making everyone identical, but eliminating systemic inequalities that deprive people of basic needs and opportunities. A level playing field for everyone regardless of your ambitions and goals.\n\n\n\nThere's no british capitalism? lmao ahistorical nonsense. Das Kapital was a critique of britsih capitalism, which was the dominant economic system of its time. To deny this is to ignore history.\n\n\n\nYou fail to see capitalism anywhere because you seem delusional. Capitalism, as it exists today, is defined by exploitation, inequality, and environmental destruction. If you want to argue that this isn’t \"real capitalism,\" then you’re admitting that the system you defend has never actually worked as intended. Communism, on the other hand, offers a clear alternative - a system based on collective ownership, democratic planning, and equitable distribution. It’s stifled everywhere not because it doesn’t work, but because it threatens the ability of capitalists to exploit resources for personal profit. The growth and potential of communist systems are actively suppressed to maintain the status quo of inequality and exploitation.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Official_Gameoholics",
                                                                                                            "body": ">Lol the state exists to protect the capitalist class interests and private property\n\nThe state, by definition, is a violation of private property. It claims legal authority. In so doing, it denies the existence of property. \n\n>Without the state, many rich people restricting resources would be taken out by mobs.\n\n\"Rich people restricting resources.\" You mean the state? The state. That which claims the legal authority to regulate. Capitalism is anarchy. The state is a public sector abstraction. \n\n>Production is not infinite. What are you even on about.\n\nYes, it is. We can always produce more. There is no fixed pie. That is a fallacy. \n\n>it’s because production under capitalism is based on profit, not need.\n\nYou can only profit by fulfilling the needs of others.\n\n>We produce enough food to feed 10 billion people, yet millions starve because food is treated as a commodity, not a right\n\nFood is not a right. There is no conflict that occurs when you are starving by refusing to procure food. \n\n>Millions of the humanity you call scarce die each year because of it.\n\nThey may be able to survive had states not stolen all of their wealth and restricted access to food. People must work in order to eat. It is required by nature. Food does not just appear out of nowhere. It must be produced. \n\n>With prices, goods are not efficiently distributed\n\nYes, they are. They take into account every factor that goes into production and then distribute it to the person that would make the greatest use of it. We know they will make the greatest use of it due to them being able to outbid other people. \n\n>Needs are determined in communities\n\nNo, they aren't. You can't measure needs, as I have previously stated.   \n\nYou have a tortured, broken epistemology. \n\n>There are basic needs like food, water, shelter, and healthcare, which is prioritized with no debate\n\nYes, and people are not entitled to them. That would be slavery. It would violate the rights of those who produce those goods to claim that you should enslave them. \n\n>democratically\n\nDemocracy sucks. 10 people vote to rape the 11th guy. Suddenly, that's good, according to you. They \"need\" to do it, after all. Otherwise, they wouldn't have voted for it. \n\n>Prices and inequalities out-price you to access essentials.\n\nThey'd be a lot cheaper if the state didn't enslave everyone. \n\n>People are not inherently lazy or solely motivated by profit.\n\nPeople want to do as little work as possible so that they can live a life of leisure. Implying that people enjoy doing hard work instead of leisure activities is an odd take. \n\n>Under communism, work is reorganized to serve collective needs\n\nThe collective is an abstraction. It does not \"need\" anything. This is an epistemological failure on your part. \n\n>Individuals are motivated to contribute to society, not just by profits.\n\nThat would be altruism, the most evil system of morality ever devised by humanity. You demand that man kill himself in the name of some collective. You condemn him for living for himself and attempting to improve his quality of life. \n\n>Resources are finite, but scarcity is artificially created in capitalism to keep up sales\n\nContradiction in terms. \"Resources are scarce, but scarcity is artificial.\"\n\n>Communism seeks to eliminate artificial scarcity and enable equitable distribution.\n\nEconomic calculation problem demolishes this argument. \n\n>It also emphasizes sustainable use of resources, because it prioritizes needs over profits and wastage, so it's more long term without eating up the planet’s finite resources.\n\nOh yeah, like the Aral Sea!   \n\nCapitalism is the lowest time preference ideology possible, which is the opposite of democracy, the highest time preference possible.   \n\nIn practice, it is Capitalism that preserves resources for the future. That's called an investment. Democracy, however, demands that the rulers spend as much resources as possible to make themselves look good. \n\n>Collectives do exist - labor unions, cooperatives, collective farms and mutual aid networks.\n\nNope, those are abstractions. They don't exist. \n\n>Communism seeks to extend this collective power to all aspects of society, all decisions are made democratically and in the interest of the many, not the few. End authoritarianism in the workplace.\n\nCollectives can't hold power. They have no rights to hold it with. They have no consciousness. They have no physical body. They don't exist. They're abstractions. Only identifyable in the purpose of action for an individual. \n\n>Communism is not making everyone identical, but eliminating systemic inequalities that deprive people of basic needs and opportunities. A level playing field for everyone regardless of your ambitions and goals.\n\nThat's what capitalism does. Demolishes the state and leaves every man equal under natural law. Legal anarchism is the only just, logically consistent, and equal legal system, unlike the legal authoritarianism you advocate for. \n\n>lmao ahistorical nonsense. Das Kapital was a critique of britsih capitalism, which was the dominant economic system of its time. To deny this is to ignore history.\n\nMarx's big book of bullshit defines capitalism as so broad as to include \"worker ownership of the means of production.\"   \n\nCorporations are socialist. The state is socialist.    \n\nCapitalism is private ownership of property. Socialism is public control of property.   \n\nCorporations are public, the state is public. \n\n>Capitalism, as it exists today, is defined by exploitation, inequality, and environmental destruction.\n\nCapitalism is defined as private ownership of property. Historically, states have been the most exploitative, being big extortion rackets. The states have caused the most devastation to people, and it's not even close.    \n\nYour definition is wrong because it is an epistemological failure. Your methodology of concept formation is arbitrary and false. \n\n>If you want to argue that this isn’t \"real capitalism,\" then you’re admitting that the system you defend has never actually worked as intended.\n\nNobody has ever tried to manifest capitalism. They always try to place everything into the hands of the state. They give the state legal authority.   \n\nThat is not capitalism. Capitalism is legal anarchy. \n\n>collective ownership\n\nCollective ownership is a contradiction, floating abstraction, and stolen concept fallacy. It is not real. \n\n>democratic planning, and equitable distribution\n\nThe economic calculation problem ensures that this is a terrible argument to make. \n\n>It’s stifled everywhere not because it doesn’t work, but because it threatens the ability of capitalists to exploit resources for personal profit. \n\nYour system is everywhere. The whole world is controlled by states. It just doesn't work because your system contradicts itself and denies reality entirely due to being a derivative of that scum Hegel. \n\n>The growth and potential of communist systems are actively suppressed to maintain the status quo of inequality and exploitation.\n\nYour solution to the problem of states extorting people is to give more power to the states. That is why it does not work.",
                                                                                                            "score": 1,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Doublespeo",
                                                            "body": ">It’s decided based on needs?\n\n>Through planning?\n\nWithout price signal this is an impossible task.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "DifferentPirate69",
                                                                    "body": "https://www.reddit.com/r/Anarcho_Capitalism/comments/1iofqcv/comment/mcjdc1p/\n\n\nPrice signals are needed to make decisions from the POV of accumulating money, has nothing to do with meeting actual needs. Profit motive doesn't exist in a marxist economy.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Doublespeo",
                                                                            "body": ">Profit motive doesn’t exist in a marxist economy.\n\nProfit motive exist in all society.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "DifferentPirate69",
                                                                                    "body": "Capital accumulation (profits) doesn't exist in communist society. Your work is measured like tokens or vouchers and you exchange it for other services you need.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Doublespeo",
                                                                                            "body": ">Your work is measured like tokens or vouchers and you exchange it for other services you need.\n\nlol this is the same thing..",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "DifferentPirate69",
                                                                                                    "body": "There's no profits, i.e., surplus value of labor of many going to a few. No billionaires. You get the full value of the work you do which in turn improves community services and reduces wealth inequalities.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Doublespeo",
                                                                                                            "body": ">There’s no profits, i.e., \n\nThere is, just in form of voucher (which os a shitier version of currency).\n\n>No billionaires. \n\nI see no proof such system would prevent super-rich?\n\n>You get the full value of the work you do which in turn improves community services and reduces wealth inequalities.\n\nBut what if the community/company give you no work? you get paid zero? wtf\n\nDo you realize that is the capitalist wet-dream here? a wage is a far more safe/secure form of income than being totally dependent on your boss for income.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "DifferentPirate69",
                                                                                                                    "body": "It is a better version of currency, 1 whatever is equal to 1 whatever in any part of the world. This inequality is necessary in capitalism to keep people down and for the speculative market.\n\nNo one's stopping you from becoming rich with your labor, after a complete elimination of the idea of capitalist wealth inequalities. What is the basis of capitalism? Conquering, slavery, overt violence, and using those basis to exploit wealth inequalities. These are wrongs that need to be corrected.\n\nGives you no work? There's always work, you choose what you want to do. Even today it's the same, just the dynamics of employer-employee would change and there would be no exploitation suppressing wages.\n\nYour entire life you are thought you need money to survive, this indoctrination needs time to change. Communism replaces this with collective responsibility, where resources are democratically allocated to meet needs rather than generate profits. The more we dismantle these structures, the less friction there will be.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Doublespeo",
                                                                                                                            "body": ">It is a better version of currency, 1 whatever is equal to 1 whatever in any part of the world. This inequality is necessary in capitalism to keep people down and for the speculative market.\n\nNot really no, your system doesnt prevent fluctuating exchange rate.\n\n>No one’s stopping you from becoming rich with your labor, after a complete elimination of the idea of capitalist wealth inequalities. What is the basis of capitalism? Conquering, slavery, overt violence, and using those basis to exploit wealth inequalities. These are wrongs that need to be corrected.\n\nYou describe government action here.\n\nViolence/slavery/destruction is illegal under capitalism because it violate property right.\n\n>Gives you no work? There’s always work, you choose what you want to do.\n\nIf you manager pay you according to the work you produce he/she will have strong incentive to give you the least work possible.\n\nAt the first sign of financial difficulty, your income will go to zero.\n\nCommunist dont understand incenitves.\n\n>Your entire life you are thought you need money to survive, this indoctrination needs time to change. Communism replaces this with collective responsibility, where resources are democratically allocated to meet needs rather than generate profits. The more we dismantle these structures, the less friction there will be.\n\nDistributing ressource democraticaly is not possible.\n\nBecause voters will collude to take advantage of the system.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "DifferentPirate69",
                                                                                                                                    "body": "There's no fluctuating currency, the work you do anywhere around the world has the same currency. You're paid according to your labor time. This is still a socialist state, where currency still exists. There's no currency in communism. Just labor debt and credit.\n\n\nYeah, which is my other basic point, anarcho capitalism is an oxymoron, the fruits of today's economy is because of of a government - capitalist collab. You still need them to ensure property rights and take care of the economy.\n\n\nYou just proved Marx's concept of exploitation of surplus value lol. The incentives are surviving and community, people have always done it.\n\n\nIt is, we are intelligent beings, people act like they are not, because of capitalist brainrot. There's no taking advantage, you contribute according to your abilities and take according to your needs, keeping in mind others exist.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "inanimate_animation",
                                                            "body": "LMAO Who decides? Literally which people or person is making the decision? How do they decide what is a need or not? Is it put to a vote? What if the majority votes that you don’t need an Xbox? Why would anyone need an Xbox? What if too many Xboxes are created and not enough defibrillators? What if the planning resulted in a shortage? What then? How is it determined which resources and in what quantities are allocated to anything? Through planning? LMAO",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "DifferentPirate69",
                                                                    "body": "\\>LMAO Who decides? Literally which people or person is making the decision?\n\nIt's democratic and in community driven - they decide what is produced and how resources are allocated. Eg - If a community has a need for defibrillators, they would propose this in local or regional assemblies. Production plans are then adjusted based on collective input, reflecting the needs of the people, not based on profits of a few. People are shitty today, because they are indoctrinated with a capitalist system where survival is tied to competition and exploitation.\n\n\\>How do they decide what is a need or not? Is it put to a vote?\n\nYes, needs are determined democratically. Communism operates on meeting human needs first. Basic needs like food, water, shelter, education, healthcare is universally recognized and prioritized without debate. Socially necessary needs like public transport and services are voted on by communities. Luxuries like xboxes are considered only after essential needs are met. Unlike capitalism, where market forces prioritize luxury goods for the wealthy in a speculative market run by wealthy neglecting basic needs.\n\n\\>What if the majority votes that you don’t need an Xbox?\n\nIf the majority decides that xboxes are not a priority, that’s a feature, not a bug. Communism is about meeting collective needs, not indulging individual greed at the expense of others. You do realize this is what that's happening right or are you completely oblivious? Luxuries are not banned, but their production is secondary to essential goods. If communities determine that xboxes are needed, they allocate surplus resources to produce them.\n\n\\>What if too many Xboxes are created and not enough defibrillators?\n\nProduction in planned economies is based on needs, planning and data, not based on market speculation like it exists today. This case especially wouldn't happen, if there are people in need of defibrillators, resources are prioritized to them.\n\n\\>What if the planning resulted in a shortage? What then?\n\nShortages can occur in any system, but communism is equipped to address them. Without private property, there's no need to create artificial scarcity, resources are moved around and allocated rapidly to address shortages. Shortages are also addressed democratically and transparently, there's no corporation or government trying to protect profits.\n\n\\>How is it determined which resources and in what quantities are allocated to anything? Through planning? LMAO\n\nDemocratic planning. The idea that planning is flawed is a capitalist myth. Planning eliminates waste and ensures that everyone’s basic needs are met, creating a society where no one is forced to choose between survival and luxury. In reality, capitalist markets are very inefficient, producing useless goods, advertising to create demand, planned obsolesces to keep up sales - while leaving millions without basic necessities.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "inanimate_animation",
                                                                            "body": "I respect you for your thoughtful response, even though I absolutely disagree with essentially everything you are saying. What about the following: what if people were allowed to separate? Take an American centric POV for a second. Hypothetically the US breaks up into 50 countries. Some people in some of the new countries want to try more communism and live that way, and some other people in different ones want to try more capitalism. People preferring communism move to communist countries, and people preferring capitalism move to the capitalist countries. They self sort. Under your world view, is this allowed? Do you have any issues with this type of scenario?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "DifferentPirate69",
                                                                                    "body": "I have no issues with that scenario, even Stalin didn't. Trotsky did, he wanted a continuous revolution and was exiled and assassinated.\n\nThe problem is this already happened, and the US rabidly went after the communist countries.\n\n[https://archive.org/details/WilliamBlumKillingHopeUSMilitaryAndCIAInterventionsSinceWorldWarII2003](https://archive.org/details/WilliamBlumKillingHopeUSMilitaryAndCIAInterventionsSinceWorldWarII2003)",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "inanimate_animation",
                                                                                            "body": "Well I’m against war and the US interfering in other countries’ internal politics and affairs, so we might agree on some things partially. I would hope for a society where people can self sort and groups wouldn’t attack each other or try to force their way of life onto each other. Let the communists be communists and the capitalists be capitalists.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "DifferentPirate69",
                                                                                                    "body": "I agree on the intervention part, but there’s also the reality that the current standard of living in western imperialist countries, is built on a history of interventions, including past atrocities, and the imposition of neoliberal economic policies on other countries which directly and indirectly benefit western powers by maintaining the global status quo.\n\nOn principle, I'm against capitalism, the state, and nationalism. A cat from Congo is still a regular cat if it lives in US, there's nothing special about it. Tying that national identity to worth and currency is nationalism and justifies inequality, exploitation and the discrimination that comes with it, all of which are essential for capitalism.\n\nSelf sorting is like saying, \"We'll preserve our particular system of exploitation here, and you lot can do your thing\". The hope that even Stalin had was that we would build socialism in the USSR, and others would look at us as an example, rise up, and follow in time, which *did* happen, with an eventual withering away of the state and the rise of a needs based economy devoid of profits. But the illegal dissolution in 1991 (77% of all people voted to preserve it), was a huge blow, which is misrepresented as a failure of socialism, but was a result of cold war dynamics, sanctions and the economic troubles that came about due wars because of US intervention.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Doublespeo",
                                            "body": ">In this case an xbox would be produced as per demand.\n\nHow you establish demand?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "DifferentPirate69",
                                                    "body": "Based on needs?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Doublespeo",
                                                            "body": ">Based on needs?\n\nWho decide what are my need?\n\nWho decide what are my capabilities?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "DifferentPirate69",
                                                                    "body": "You do, for both of them.\n\nFor each according to their needs and each according to their abilities.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Doublespeo",
                                                                            "body": ">You do, for both of them.\n\n>For each according to their needs and each according to their abilities.\n\nOk so what are your needs and and what are your abilities?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "DifferentPirate69",
                                                                                    "body": "The cognitive dissonance is worrying. How according to you do you think jobs are different in a communist economy?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Doublespeo",
                                                                                            "body": ">The cognitive dissonance is worrying. How according to you do you think jobs are different in a communist economy?\n\nYou didnt answer my question?\n\nI wonder why? perhaps you cannot? didnt yoy say you knew and decide what is your needs and abilities?",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "DifferentPirate69",
                                                                                                    "body": "I did not, because it's a stupid question. You study, do co-curricular activities and identify your ambitions and hone your abilities.\n\nYour needs keep going up, for instance the maslows needs pyramid, you work to achieve them.\n\nHow according to YOU do you think jobs are different in a communist economy?",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Doublespeo",
                                                                                                            "body": ">I did not, because it’s a stupid question. \n\n\nIt is not.\n\nyou say you only decide what are your abilities and what are your needed.. yet you are unable to me what they are?\n\nThis is not a good start.\n\n>You study, do co-curricular activities and identify your ambitions and hone your abilities.\n\n>Your needs keep going up, for instance the maslows needs pyramid, you work to achieve them.\n\nSo what are your needs and capabilites?\n\nand what prevent you to say you have zero capabilities and large need?\n\n>How according to YOU do you think jobs are different in a communist economy?\n\nyes because the incentive are deeply different.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "DifferentPirate69",
                                                                                                                    "body": "It hasn't started? I'm pretty bored, you don't make good arguments.\n\n\nYou do realize people existed before capitalism right? Again, what an unintelligent question.. Your needs are survival and whatever makes it easier. Education helps us find what we are into and improve our productive capabilities.\n\n\nThe incentives are indeed different, you don't have to ensure people live in austerity by paywalling natural resources.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "BullyMcBullishson",
                            "body": "That sounds like it would be a really productive society. With these incentives, why wouldn't everyone want this utopia?\n\nNow, to enforce it, you'll just have to murder all those like myself, who stand for liberty and will literally die on this hill.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "thermionicvalve2020",
                            "body": "If it's not voluntary, it's a state.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "ur_a_jerk",
                            "body": "why did marx them argue for a totalitarian state? (the fact that he said it's indefinitely temporary until the end of history doesn't change the fact that he was in favour of total control of the state)",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "ILikeBumblebees",
                            "body": "How do you abolish private property and the state at the same time, given that you need the state to forcibly suppress people from establishing exclusive claims to rival goods?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "NoTie2370",
            "body": "No. I will not try to convince you no matter how hard you want me too. No matter how hard society needs me too. No matter how consequential my skill set in doing so is to the community. Because it is not subjectively worth my time and efforts.",
            "score": 7,
            "replies": []
        },
        {
            "author": "bananabastard",
            "body": "What do you mean by Marxist? Because capitalism hasn't collapsed, and a proletarian revolution hasn't happened. Do you still expect this to happen?\n\nAnd whenever it has been forced into being, it doesn't work, and instead turns into a dictatorship. \n\nDo you support authoritarian dictatorships? Or do you just think nobody else has done it right, and next time will be the time it doesn't turn to shit?\n\nI can't help but think that if Marx was around today, he would not be a Marxist, because it has already been disproven.",
            "score": 12,
            "replies": [
                {
                    "author": "Fit_District7223",
                    "body": "You’re looking at Marxism like it’s a checklist of predictions instead of a way to analyze capitalism. Marx never said capitalism would collapse overnight—he argued that its contradictions would create crises over time. And looking at skyrocketing wealth inequality, economic crashes, and exploitation, it’s hard to say he was wrong. The fact that a worldwide revolution hasn’t happened doesn’t “disprove” anything, just like the fact that diseases still exist doesn’t disprove medicine.\n\nAs for failed socialist states turning into dictatorships, that’s not proof that socialism itself is doomed—it’s proof that authoritarianism is a problem. Plenty of leftists are anti-authoritarian and push for democratic socialism, where economic power is actually shared rather than controlled by a dictator. Capitalism has had plenty of failures too, but no one argues that means we should abandon markets entirely. If capitalism can evolve, why shouldn’t socialism?\n\nAnd if Marx were alive today? He’d still be a Marxist—just one analyzing modern capitalism instead of the industrial age. The idea that history has “disproven” him is just wishful thinking from people who don’t want to deal with the fact that his critiques still hit way too close to home.",
                    "score": -12,
                    "replies": [
                        {
                            "author": "Doublespeo",
                            "body": ">You’re looking at Marxism like it’s a checklist of predictions instead of a way to analyze capitalism.\n\nYou would expect any economy theory to be able to make reliable predictions.\n\nOtherwise it is pointless.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Fit_District7223",
                                    "body": "it's reasonable to expect economic theories to make reliable predictions. It's important to recognize that economics deals with human behavior, which is inherently unpredictable. Unlike physical sciences, economic models are subject to the complexity of societal variables and can’t always predict with perfect accuracy. Theories may provide useful frameworks or trends, but predicting the future in economics is far more uncertain due to these variables.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Doublespeo",
                                            "body": ">it’s reasonable to expect economic theories to make reliable predictions. \n\nIt is not reasonable, it is a fundamental condition for being a theory at all.\n\n>It’s important to recognize that economics deals with human behavior, which is inherently unpredictable. Unlike physical sciences, economic models are subject to the complexity of societal variables and can’t always predict with perfect accuracy. \n\nI am not talking of perfect acuracy.\n\nObvioulsy.\n\nBut total misprediction should totally discredit your theory.\n\n>Theories may provide useful frameworks or trends, but predicting the future in economics is far more uncertain due to these variables.\n\nPredicting trend is a very good indication of a strong economic theory.\n\nMarx prediction were not only inaccurate but totally opposite of what reality showed us.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Mindless-Worth7049",
                    "body": "but corporations cant possibly be authoritarian? even if that is what i believe on its rich from an ancap. also did you know marx didnt set a time frame? capitalism hasnt been around as long as feudalism was, so i think its safe to say were a few hundred years from marx being \"debunked\".",
                    "score": -12,
                    "replies": [
                        {
                            "author": "smore-phine",
                            "body": "Just wanted to say, don’t let the downvotes keep you from seeing how good a thing you’re doing. Going to a community of people with opposing opinions, looking for a civil discussion and understanding? Yeah, the world needs more of that. ",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Mindless-Worth7049",
                                    "body": "Thanks! i was under no illusion there would be friendly reception when i posted this, particularly considering how bad it already was on r/centrism. As of writing there are 48 comments on the post, and 1 upvote lol, and i can count on one hand how many honest criticisms, free of ad hominem ive gotten. Honestly though, id hoped people who were so critical of marx would have at least put in the effort to read one of his texts but i really havent found that. Thanks though",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Tolkien-Faithful",
                            "body": ">but corporations cant possibly be authoritarian? \n\nThey can within their own companies when it comes to their own rules, to a point. But authoritarian when it comes to government? Corporations don't have any authoritarian control over anyone in a free society. What in your life is controlled by a corporation in an authoritarian manner?",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "ur_a_jerk",
                            "body": "yes he did lmao. He said the history will end with communism and that he already \"scientifically\" proved it",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Doublespeo",
                            "body": ">but corporations cant possibly be authoritarian? even if that is what i believe on its rich from an ancap. \n\nThen such coporation should face the justice system.\n\n>so i think its safe to say were a few hundred years from marx being “debunked”.\n\nThe dude predicted the working class will get poorer and poorer yet the opposite happened? his all economic worldview is simply wrong.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "HairyTough4489",
            "body": "If the Labor Theory of Value is true and all profits companies make come from exploiting employees, why are companies supposedly trying to replace workers by AI rather than hiring as many people as possible to make more profits?",
            "score": 8,
            "replies": [
                {
                    "author": "PuffFishybruh",
                    "body": "[Chapter 12 of Capital.](https://www.marxists.org/archive/marx/works/1867-c1/ch12.htm)",
                    "score": 1,
                    "replies": [
                        {
                            "author": "HairyTough4489",
                            "body": "This doesn't explain why you should replace your workers by an AI. According to this you should get your AI and still preserve your workers.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Fit_District7223",
                    "body": "The labor theory of value says that the value of a product comes from the labor put into making it, and profit exists because companies pay workers less than the value they create. More workers don’t mean more profit. What matters is the gap between what workers produce and what they’re paid.\n\nHiring and training employees is one of the most expensive parts of running a business. Companies don’t want more workers; they want the cheapest production possible. If AI reduces labor costs and increases that profit gap, they’ll use it. That doesn’t disprove exploitation—it just shows they’ll replace workers the moment it’s profitable to do so.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "stereoagnostic",
                            "body": "Value of a product is very clearly proven to come from the consumer demand for it. You can spend an entire lifetime creating a product that no one wants and it's market value is zero. This is easily observable and labor theory of value has been objectively disproven without any shadow of doubt.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Fit_District7223",
                                    "body": "You're right that the value of a product often comes from consumer demand—if no one wants it, it's worth nothing, no matter how much time and labor went into making it. That’s a key point in capitalism: things are priced based on what people are willing to pay.\n\nThe labor theory of value, which was mainly pushed by Marx, said that value comes from the labor used to make something. While it’s true that demand plays a big role, Marx's point was more about how workers don’t get paid the full value of what they produce. Capitalists take a profit by paying workers less than what the product is worth.\n\nSo, while demand drives prices, the idea behind the labor theory is that workers are often exploited in the process.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Doublespeo",
                            "body": ">The labor theory of value says that the value of a product comes from the labor put into making it, and profit exists because companies pay workers less than the value they create. More workers don’t mean more profit. What matters is the gap between what workers produce and what they’re paid.\n\nBut why people get paid even if a company dont make profit?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Fit_District7223",
                                    "body": "You do know profit is something calculated after all expenses are paid, including payroll, right? Tell me you're trolling rn. Profitability is the difference in the value the workers create and what that value is sold for. So they get paid for the supposed value they contribute, not whether or not a company is profitable.\n\nJohn Zimmer is a co-founder of lyft, who is worth 800 million. Founded in 2012 and just now recently reporting its first quarter of profit last year in 2024, do you take issue with that or just poor people getting paid when businesses don't make money?",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Pavickling",
                                            "body": "Payroll is maintained even during unprofitable quarters.  The risk profile of an employee is intrinsically not the same as a business owner.  Maybe it would make more sense to criticize the culture of employment and the statutory aspects of corporations such as limited liability.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Doublespeo",
                                            "body": ">You do know profit is something calculated after all expenses are paid, including payroll, right? Tell me you’re trolling rn. Profitability is the difference in the value the workers create and what that value is sold for. So they get paid for the supposed value they contribute, not whether or not a company is profitable.\n\nSome sort of variable wage?\n\nwhy it is superior to a stable wage then?\n\nAnd there is some many problem with that (for the workers, CEO would love it).. because if a company struggle to make any profit they will just ask you to stop producing anything so they dont have to pay you during time of struggle.\n\nwtf.. I would never accept to work under those conditions. You are basically offloading most of your employer financial risk onto the workers..\n\n>John Zimmer is a co-founder of lyft, who is worth 800 million. Founded in 2012 and just now recently reporting its first quarter of profit last year in 2024, do you take issue with that or just poor people getting paid when businesses don’t make money?\n\nNo I think people should be allowed to choose if they want to get a stable wage or being paid on profit.\n\nI am for economic freedom after all.\n\nI fail to see why imposing some variable income be the superior choice for every one. It seems extremly risky and in my experience most people dont want that.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "HairyTough4489",
                            "body": "But according to Marxist theory, profit rates tend to diminish over time, so we've solved the contradiction by creating a new one.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Fit_District7223",
                                    "body": "The falling rate of profit doesn’t ‘solve’ the contradiction; it’s a manifestation of it. The exploitation of labor, where companies pay workers less than the value they create, doesn’t disappear with technological advancement. It simply changes form. As companies adopt AI and other technologies, they still seek to maximize profits by reducing labor costs—exploiting workers while reducing the labor component. The profit rate might fall, but the system still depends on exploiting the labor force.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "HairyTough4489",
                                            "body": "So... Are business owners deliberately trying to make less and less money?  I thought the 0.000001% were all becoming quadrillionaires!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Nihiliatis9",
                    "body": "AI is an employee that you can exploit endlessly without consequence..... well until skynet goes online. Lol",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Doublespeo",
                            "body": ">AI is an employee that you can exploit endlessly without consequence.....\n\nIf work is exploitation then isnt AI freeing peoples?",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Nihiliatis9",
                                    "body": "It could be used that way.... it won't.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Doublespeo",
                                            "body": ">It could be used that way.... it won’t.\n\nIf work is exploitation, taking away people job is reducing exploitation?\n\nUnless maybe people are not exploited and want to work because they are paid for it.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Mindless-Worth7049",
                    "body": "Not what the labor theory of value posits. It posits all value is created by workers not profits. also as a anarchocapitalist you should know that market forces guide whether or not a business can expand or not. (also AI is created by people and powered by electricity generated by people and trained on text written by people)",
                    "score": -2,
                    "replies": [
                        {
                            "author": "Doublespeo",
                            "body": ">(also AI is created by people and powered by electricity generated by people and trained on text written by people)\n\nwhat is the value of AI then?",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "HairyTough4489",
                            "body": "If value is created by workers and profit comes from paying workers less than their work's value then how am I wrong in saying that profits come from the workers?\n\nYes, of course I know Marxism is bullshit and profits don't come from exploitation. My logic is \"If Marxism is true then we reach an absurd conclusion. Therefore Marxism must be false\".",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Tichy",
            "body": "Does it bother you that your ideology has murdered 100 million people, and counting?\n\nDo you really want to live your life according to \"democratic votes\"? What kind of work you do, what kind of accommodation you live in, what you get to eat?\n\nDo you realize that people have different preferences, they are individuals, not a collective?",
            "score": 9,
            "replies": [
                {
                    "author": "Fit_District7223",
                    "body": "That “100 million deaths” claim is a wildly misleading talking point. It comes from The Black Book of Communism, which has been widely criticized for lumping together famines, wartime casualties, and misattributed deaths to inflate numbers. If we’re measuring ideology by body count, capitalism has racked up an even higher toll through imperialism, colonialism, poverty, and preventable disease. But playing this numbers game ignores the real conversation: no system is perfect, and historical failures don’t invalidate entire ideas.\n\nNo one is arguing that your daily life should be dictated by “democratic votes.” That’s a strawman. The argument for socialism isn’t about micromanaging personal choices—it’s about democratizing the economy so that wealth and decision-making aren’t concentrated in the hands of a tiny elite. Right now, a few billionaires have more power over your job, your rent, and your wages than any vote ever could. Giving workers more say in their workplaces doesn’t eliminate individual freedom—it actually expands it by making sure people aren’t just subject to the whims of the ultra-rich.\n\nAnd yes, people are individuals. No one is denying that. But pretending that capitalism respects individuality while socialism supposedly treats everyone like drones is nonsense. Under capitalism, your choices are already limited—by what you can afford, where you’re born, and whether you have the right connections. The real issue isn’t “collectivism vs. individualism,” it’s whether we want a system where a handful of people dictate the conditions of everyone else’s lives just because they own everything.",
                    "score": -4,
                    "replies": [
                        {
                            "author": "Gemini_Of_Wallstreet",
                            "body": "Not comparable\n\nAll famines under communism have been manufactured for submission.\n\nYou’re probably gonna argue that the Holomor was just a natural famine not a deliberately manufactured famine by straling farmer’s tools and produce in order to systematically starve ukranians to death.\n\nSame thing happened in all communist famines, especially china.\n\nAs for imperialism and colonialism.\n\nThey are not inherently capitalist elements.\n\nThe Roman Empire was Imperialist and Colonialist.\n\nThe Soviet Union was Imperialist and Colonialist.\n\nChina with the exception of Ming has always been was Imperialist and Colonialist.\n\nImperialism is merely the expansion of the state into a foreign territory \n\nColonialism is merely the expansion of the primary culture into a foreign territory.\n\nCapitalism is an economic theory of exchange.\n\nStop confusing terms.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Fit_District7223",
                                    "body": "You’re right that famines under some communist regimes, like the Holodomor in Ukraine or China’s Great Leap Forward, were catastrophic. In many cases, the policies were directly responsible for mass starvation. The Holodomor, for example, was partly caused by Stalin’s decision to confiscate tools and food from Ukrainian farmers, which was a deliberate action aimed at punishing them. That said, the issue here isn’t with communism itself—it’s with how authoritarian regimes twisted those ideas for control. When central authority is given too much power, bad things can happen, regardless of the political system in place.\n\nBut let’s not ignore that famines and genocides have also occurred under capitalist systems. Take the Irish Potato Famine, for example. British policies, which prioritized profit over the welfare of the Irish people, led to the death of millions. Famines aren’t just a communist problem—they’re a consequence of economic systems that value profit over human lives. It’s not so much about the theory behind a system, but about how it’s used by those in power.\n\nNow, regarding imperialism and colonialism—you're right that they’ve existed under various political systems, including Rome, the Soviet Union, and China. But imperialism and colonialism are often driven by the need to expand and control territory, and under capitalism, that expansion is often motivated by the desire for resources and profit. The British Empire didn’t colonize places like India or Africa just to control land—it was about extracting resources to feed the growth of capitalist industries. So, while imperialism and colonialism can happen under any regime, capitalism has often been a driving force behind those actions, with economic gain fueling colonial expansion.\n\nThe problem with capitalism isn’t just the exchange of goods—it’s the inequality it creates. It thrives on exploiting people and resources, and that inequality often leads to colonial practices or economic domination. So, while imperialism is a political move, capitalism is the economic engine that often makes those moves possible.\n\nIt’s important not to confuse terms, but when we talk about these systems, we need to think about how the economic system and political power play off each other. Both authoritarian socialism and unchecked capitalism concentrate power in the hands of a few, and that’s where the problem lies. Whether under a communist regime or a capitalist one, power imbalance leads to exploitation and suffering.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "k-xo",
                                            "body": "Don’t forget about the killing fields",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Fit_District7223",
                                                    "body": "True, the killing fields are tragic, but capitalism also fuels violence. General Smedley Butler, one of the most decorated Marines in history, said, 'I was a gangster for capitalism. I helped make Mexico safe for American oil interests, helped make Haiti and Cuba safe for American sugar interests.' Every time we send troops to war, it’s to protect corporate interests, turning foreign lands into killing fields. Capitalism has no moral imperative",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "k-xo",
                                                            "body": "No system has a moral imperative. That’s an issue that comes down to the condition of the human heart, and any system can be exploited. Absolute power corrupts absolutely which is why decentralization and individual autonomy is so important",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Fit_District7223",
                                                                    "body": "I agree that no system inherently has a moral imperative—morality that comes down to the values of the people who implement and sustain the system. But your single retort of \"Don’t forget about the killing fields\" is implied to only be making a moral argument, especially when you addressed nothing I said.\n\n It's important to distinguish between true decentralization and the current state of capitalism, especially in the U.S. While capitalism is often defended as promoting individual autonomy, in practice, it often leads to the concentration of power in the hands of a few large corporations and wealthy elites. This concentration undermines the very autonomy it claims to protect, as economic power shapes policy and limits the ability of individuals to make decisions in their best interest.\n\nDecentralization, in its true sense, involves spreading power out to local communities, individuals, and workers, rather than allowing a few to control the majority of resources. In the U.S., the capitalist structure, with its corporate monopolies and wealth concentration, doesn't provide this kind of autonomy for most people. It often leaves individuals at the mercy of market forces and corporate decisions.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "k-xo",
                                                                            "body": "That’s called crony capitalism or corporatism which is not real capitalism",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Fit_District7223",
                                                                                    "body": "So when capitalism deviates from its ideals and stated goals, and moves in a direction contrary to them, the negative outcomes are dismissed as 'not real capitalism.' But when socialist or communist countries deviate from their ideals, the outcomes suddenly matter in judging the entire system?\n\nI might also add that the global hegemony is largely made up of entities that heavily engage in capitalist practices and have a vested interest in maintaining its success—unlike socialism or communism, which have been actively undermined. Capitalism isn’t facing the same external pressures; when it fails, it does so on its own merit. No one is overthrowing the U.S. government the way democratically elected socialist or communist leaders have been removed. No one is imposing devastating embargos on us like the ones we placed on Cuba. No one is destabilizing American regions the way we've done to Latin American countries exploring socialism or communism. No one is invading us to protect corporate interests like we invaded Vietnam. Capitalism has every structural advantage, yet its failures are still apparent.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "k-xo",
                                                                                            "body": "Those ideals are utopian and cannot exist in this world, which is why they sounds great on paper, but when put into practice, they becomes dystopian",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Fit_District7223",
                                                                                                    "body": "You're relying on buzzwords to evoke negative emotions rather than making a substantive argument. Marxist thought isn't utopian—Marx himself was a well-documented anti-utopian. Calling it a utopian philosophy demonstrates a fundamental misunderstanding of its core principles. Have you actually read any Marxist literature, or are you just repeating common misconceptions\n\nThe Communist Manifesto was written as a clear, accessible pamphlet for the working class, many of whom had limited formal education, so it should be easily digested by us today that read it. Marx explicitly critiques utopian socialism, rejecting idealistic visions in favor of a materialist analysis of history and economics. He emphasizes class struggle and economic forces as the primary drivers of societal change",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "k-xo",
                                                                                                            "body": "If you can’t discern manipulation, that’s on you",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Fit_District7223",
                                                                                                                    "body": "Once again, you're resorting to buzzwords like 'manipulation' without addressing the substance of the argument. Instead of discussing ideas or evidence, you're deflecting with emotional triggers. If you're unable to engage with the core points and critique the ideas themselves, it becomes hard to have a productive conversation.\n\nHave a good one bro",
                                                                                                                    "score": 1,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Gemini_Of_Wallstreet",
                                            "body": "I guess I just look at history and find that although there is inequality in capitalism it generally has the least inequality amongst the same “culture groups” (there’s a whole other discussion in multicultural societies).\n\nI mean look at communist regimes where Party Elites get preferential treatment and dine on luxury foods while the population starves.\n\nOr autocratic/ authoritarian monarchies.\n\nOr liberal democracies where the political class instantly becomes multi millionaires and entrenches itself in the system.\n\nAt least in capitalism you know exactly who the “elite” is and they fight to keep themselves there because when the coal industry is corrupt and opressive a new kid on the block will start using oil.\n\nIdk, but i think it’s good not to forget the origin of capitalism lies in Dutch Peasants putting their money (capital) together to compete against their Spanish Aristocratic Opressors.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Fit_District7223",
                                                    "body": "I'm hearing your points and i can see why you think that way but I think it's important to remember that capitalism, while it may seem more transparent in its elites, inherently creates and sustains inequality, often through exploitation. The ‘new kid on the block’ may disrupt one industry, but capitalism just shifts exploitation to another, like the transition from coal to oil.\n\nYou mention Dutch peasants, but the origins of capitalism, as we know today, are more tied to colonialism, slavery, and the global exploitation of labor than a simple conflict between peasants and aristocrats. Even in that earlier period, peasants were often still subject to the same systemic oppression. And as for democracies and monarchies, it's not about whether corruption exists—it's about who’s allowed to access the system. Under capitalism, it's still the wealthy few who ultimately hold power, while the working class remains stuck in a system that ensures they stay in that position, no matter how many industries change hands",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Tichy",
                            "body": "ItÄs fair to count the deaths, if the famines were caused by communism, like murdering all the farmers or shooting all the birds and then having food root. Likewise the wars and murders when they were caused by communism.\n\nAnd of course Socialism micromanages personal choices, too. Who gets a nice flat to live in? Not the person who pays the most, but the one who sucks up to the party the most.\n\nFunny that you claim it is about preventing the power to be in the hands of a tiny elite, as that is exactly what ended up happing everytime socialism has been tried.\n\nThe dirty secret is that people who don't comply and vote for the wrong things get punished and executed.\n\nAnd planning economies don't work, but instead of acknowledging it, people will be blamed as traitors and executed, too.\n\n  \nBillionaires like Musk dictate exactly zero of how I want to live. I don't have to use any of his products. The same can't be said for the socialists in my government.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Fit_District7223",
                                    "body": "I'll give you that, you’re right that in cases where communism has been implemented, disastrous policies like forced collectivization or government-induced famines have led to tragedy. But to say communism itself caused those events is a bit simplistic—it’s more accurate to say that authoritarian regimes, whether under communism, fascism, or otherwise, often wield power in corrupt and brutal ways That’s a failure of authoritarianism, not the ideology itself. Marxism, in theory, is not about dictating people’s lives or hoarding power—it’s about collective ownership and the dismantling of class structures that perpetuate inequality. The problem arises when these ideals are hijacked by leaders who prioritize control over collective benefit.\n\nLet’s not forget that the global capitalist hegemony has historically been invested in crushing any attempt to implement socialism or communism. Take, for instance, the CIA’s involvement in the overthrow of democratically elected socialist governments, like in Chile with the coup against Salvador Allende in 1973. Or consider how the U.S. supported brutal dictatorships in places like Iran and Indonesia, not because they were anti-communist but because they were willing to maintain capitalist interests. One of the clearest examples of this is the U.S. embargo against Cuba. When the Cuban government nationalized American-owned businesses that were extremely profitable, the U.S. responded with severe sanctions, aimed at economically suffocating the country and undermining its socialist policies. These sanctions, which have lasted for decades, severely impacted Cuba’s ability to build a functional economy and have contributed to the difficulties the country has faced in achieving its goals. The political and economic sabotage of countries attempting socialism played a huge role in their failure to build stable systems—foreign intervention, economic blockades, and sanctions, which made it nearly impossible for these countries to function as intended.\n\nAs for your claim that socialism micromanages personal choices—sure, we can point to cases where authoritarian socialist governments have controlled housing or resources. But that’s not what socialism, in its ideal form, is supposed to be. It’s about redistributing wealth and power more equally, not rewarding loyalty to a party. Capitalism, on the other hand, rewards those who already have wealth and power, regardless of their contributions to society.\n\nAnd the idea that socialism always leads to an elite in power? That’s exactly what capitalism does as well—just look at the concentration of wealth in the hands of a few billionaires. Sure, Musk doesn’t “dictate” how you live, but his wealth and influence shape the political landscape, economic systems, and labor conditions. Do you really think he’s not using his power to shape the world around him in ways that benefit him, regardless of your desires?\n\nThe truth is, whether it’s communism, socialism, or capitalism, power is still concentrated in the hands of a few. The difference is, in capitalist societies, it’s often hidden behind the veil of \"free markets\" and individualism. Just because you’re not \"forced\" to use Musk’s products doesn’t mean the system isn’t working to his benefit and your detriment. And let’s not pretend that billionaires like him aren’t using their power to influence governments, lobby for favorable policies, or build monopolies. In the end, both systems concentrate power—it’s just a matter of who gets to hold it and how it's justified.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Tichy",
                                            "body": "No, communism caused those events, and the totalitarian results are entirely inherent in the ideology. Simply because not all people will usually comply with the ideals of communism, so they will have to be forced.\n\nAlso, again, planning economies don't work, so all socialist or communist regimes will inevitably be struggling economicalolly, making the government double down on totalitarian control to suppress unrest in the population.\n\nI don't think sanctions against socialist countries are sufficient to explain their failures. There are plenty of socialist countries they could have traded with.\n\nCapitalism just means free markets and private ownership of things. If there have been private armies murdering millions, it would be of interest to hear. Actions of the US are more than just \"capitalism\", a lot was going on in the world, cold war and so on, it's not simply isolated sabotage of socialist regimes.\n\nRedistributing wealth - who, in socialism, decides who deserves what? You don't have a market. You have an elite who decides what is \"fair\" and who deserves what. Even if you were to vote democratically, that wouldn't make it better. Even in democracies, you have to protect the population from the tyranny of the masses and the government. Also people are not all equal, why do they all deserve an equal share, even though some contribute more than others?\n\nAnd no, Musk doesn't harm me in any way. I can understand people crying about the leftist totalitarian control and censorship on Twitter, but at least they have lots of alternatives to choose from, thanks to capitalism.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Doublespeo",
                            "body": ">for lumping together famines\n\nCommunism famines were the largest humanity has ever experienced yet happened in some of the most fertile land on earth..\n\n>by body count, capitalism has racked up an even higher toll through imperialism, colonialism, poverty, and preventable disease. \n\nColonialism and imperialism are not capitalism, but government action. Proof is even communist countries engaged heavily in it.\n\nAnd poverty and preventable disease capitalism has been the best economical system humanity has ever found to solve those problems.\n\n\n>no system is perfect, and historical failures don’t invalidate entire ideas.\n\nWhen tried repeatedly and failed everytime it kinda does.\n\n>Under capitalism, your choices are already limited—by what you can afford,\n\nUnder communism, you choice are already limited— by how well you are connected to the political class",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Fit_District7223",
                                    "body": "\n\nWhile communism did contribute to famines under authoritarian regimes, these were largely the result of mismanagement and forced central planning, not the inherent nature of communism itself. Capitalism, too, has seen its own famines and food insecurity, driven by unequal distribution and market forces. \n\nThe link between colonialism and capitalism is clear—colonial powers exploited colonies for profit, and imperialism was often driven by capitalist interests. \n\nAs for poverty and disease, capitalism hasn't been the best at solving these problems. While it has spurred technological progress, it often concentrates wealth, leaving large portions of the population without access to basic needs. Countries with mixed economies tend to fare better in addressing inequality and healthcare. \n\nLastly, the repeated failures of communism are often due to authoritarianism and corruption based on government action, not a flaw in the theory itself. Capitalism has also repeatedly failed, as evidenced by its crises and inequality. For example, the Confederate States of America (which collapsed after the Civil War), the Weimar Republic (which collapsed due to economic instability and contributed to the rise of Nazism), and Yugoslavia (which dissolved due to economic issues and conflict in the 1990s). Both systems can be improved, and each has shown the dangers of concentrated power, whether economic or political.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Mindless-Worth7049",
                    "body": "The black book of communism has been debunked hundreds of times. Also does it bother you about the death toll of capitalism? i dont think its fair to just cite a death number (and a bullshit one at that) and go ideology debunked job done. As for the democratic votes thing, fuck yes way better than some trillionare deciding that ogloxyshmoxytosin is probably safe and not worth safety testing. Finally, im pretty sure everyone has a \"preference\" for their basic human needs being met",
                    "score": -5,
                    "replies": [
                        {
                            "author": "Tichy",
                            "body": "What is the death toll of capitalism?\n\nI don't know the black book of communism. But you can't deny millions were murdered and starved to death in the Soviet Union and China alone. Holodomor was in the discussions only recently because of the Ukraine war.\n\nAnd those deaths are just the top of the ice berg, all experiments with socialism/communism ended the same so far, hunger, squalor, executions...\n\nHow do you propose to deal with people who don't want to voluntarily join the communist society? That's already were the whole ideology falls apart. It inherently needs totalitarian control, exploitation and oppression.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "LadyAnarki",
                            "body": "Everyone does have a preference for their need. And all those preferences are different. My needs and your needs are different. What will meet my needs is different than what will meet your needs. \n\nSo how do you expect for both of our needs to be met under communism?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Flexu23",
                                    "body": "Not OP, but \n\n\"From each according to his ability, to each according to his needs\" Marx\n\nIts an essential part of marxist ideologie.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "LadyAnarki",
                                            "body": "That just devolves into everyone with abilities feeding the ones with needs. Not very free and equal.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "THEUSSY",
            "body": "aight will do but go clean my toilet first hurry up and make sure its pearl white (its my need but not my ability) ((im entitled to your labor))",
            "score": 4,
            "replies": [
                {
                    "author": "Mindless-Worth7049",
                    "body": "Mature.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "THEUSSY",
                            "body": "sounds stupid and childish doesnt it?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "EGarrett",
            "body": "Marx's fundamental mistake was that he thought organizing labor wasn't a skilled activity that needed expertise and payment. He was wrong.",
            "score": 3,
            "replies": [
                {
                    "author": "Mindless-Worth7049",
                    "body": "Thats not what he thought at all. I work at a supermarket. Above me, i have a boss, they do rostering and organize cleaning and manage who does what task. That isnt what marx was referring to. There is Probably somebody in the Maldives right now sipping margeritas watching the stock price number tick up. Thats what he was talking about",
                    "score": 1,
                    "replies": [
                        {
                            "author": "EGarrett",
                            "body": "Investment is part of organizing labor. It seems you may also have the same blind spots that Marx did.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "Ladzilla",
                            "body": "Correct, but how did they get that money to invest into the organisation. Likely excess \"productivity\" they completed within society and they spent that \"productivity\" in investment. If excess productivity is distributed, then they will not work more productive than necessary.\n\nOne argument I really hate, and I do hear it at my workplace; everything we do is for investor profits. I work for a company on a public stock exchange, it's like, well if the investor profits are so good, why aren't you invested like I am?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ILikeBumblebees",
                            "body": "> There is Probably somebody in the Maldives right now sipping margeritas watching the stock price number tick up.\n\nYou mean the guy who paid all the upfront costs to open the supermarket out of his own pocket, and is closely watching the stock price because if it doesn't go up, his life savings gets wiped out?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SkillGuilty355",
            "body": "What should the price of milk be today?",
            "score": 3,
            "replies": []
        },
        {
            "author": "Ladzilla",
            "body": "It's funny really. We hear Capitalism vs Marxism debate all the time, yet both systems suffer from the EXACT same control inequalities as each other. But hear me out...\n\nTheoretically, let's say the average functioning person is \"a good person\" which I hope is usually the case. With capitalism, people vote with how hard they work and with money. I get 1 for 1 for my time, and my time is not worth anything, then I must find something else productive. If I think your product or service is crap, I will buy elsewhere. If \"society\" deems you as a problem, people stop giving you money. At a high level, as the majority of people are \"good\", the bad is dealt with accordingly within the society.\n\nWith communism or even socialism, you must trust an established organisation to do the right thing, which has never worked. You must trust ALL your peers will work the same as you or want to work the same as you. You must trust that your peers all want the same result as you. You must trust the central organisation to distribute your wealth fairly. IE, one person may want to work 84 hours a week, while the other wants to work 37.5 hours. Yet, one is disadvantaged by working harder as the goods are distributed evenly at the end of the day and conclusively the incentive to work harder is lost. What's to say the philosopher's time is worth more than an oil rig worker who works more and harder hours?\n\nEveryone thinks they deserve to earn more, relax more, have more... The only true way to evaluate how much you deserve is capitalism. I say I work hard and someone else says they work hard, but hard for them may be they made a painting while I farm the land.\n\nCapitalism only disadvantages the disadvantaged as they will not be as productive, however in capitalism you only have to trust the average person as a good person. This means, it's most likely that the average good person would put a small portion of their money to private organisation to help the disadvantaged that the individual deems productive.\n\nCapitalism allows 1 person to work 80 hours, and the other to work 37.5 hours and both will be happy. Compensation will be based on skill demand multiplied by hours worked.\n\nCONCLUSIVELY, I think communism is a great idea if we lived in an absolute utopia where everyone agrees the same way on everything, but we do not. It's like assuming no friction or air resistance on an engineering problem.",
            "score": 2,
            "replies": [
                {
                    "author": "Fit_District7223",
                    "body": "First off, Marx, as an anti-utopian, wasn’t about a utopia where everyone agreed on everything—he was focused on the real problems of capitalism: class struggle, inequality, and exploitation. If we lived in a utopia, we wouldn’t even need any socio-economic system because everyone would have what they needed.\n\nNow, the whole \"capitalism rewards hard work\" idea sounds good, but it ignores the fact that most people don’t start from the same place. Capitalism loves to point out the rare success stories, but the truth is most people stay in the socio-economic class they were born into because the system is rigged to maintain that. And when you look at marginalized groups, like Black people in the U.S., studies show that a significant portion—about 50%—are likely to remain in poverty, no matter how hard they work. So, if capitalism really rewards hard work, why do these systemic injustices persist? It’s not just about effort—it’s about how the system is designed to concentrate wealth and power in the hands of a few. Capitalism is especially invested in keeping minorities from holding equity in society—particularly wealth—because in a capitalist system, wealth is the most powerful means of affecting change. If we lack the capital to make any real changes, whether social or monetary, we’re essentially at the mercy of the few. Things don’t change just because the majority thinks they should; they change when an exceedingly small group of obscenely wealthy people decide they should. Just look at Elon Musk, who recently bought one of the most influential offices in global politics with a couple hundred million, and is now making decisions that impact your livelihood, the economy, and society at large—simply because he’s rich\n\nAnd sure, charity can help, but why should we have to rely on the generosity of a few when the system itself creates these inequalities? If the rich can afford to give millions or billions to charity each year, why can’t they just pay their workers fairly to begin with? Charity becomes an unnecessary middleman when the real solution is fair wages. And if we’re talking about the generosity of regular people, why should they be expected to make up the difference? It’s like how restaurants don’t pay workers enough and expect customers to cover the gap with tips. \n\nMarxism isn’t about trusting everyone to work the same—it’s about collective action to fix the systemic issues. Capitalism doesn’t reward hard work—it rewards those who already have the power and resources. Capitalists expect people to survive on the charity of others doing slightly better, when pooling even a small fraction of resources could help create lasting solutions. The system is rigged to keep people from getting ahead without relying on the generosity of others, and that’s a problem.\n\nSo, Marx didn’t want a perfect world, he wanted a system where people could organize together to fight inequality and exploitation—things that are built into capitalism from the start.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Impressive-Door3726",
            "body": "\"The Jewish n*gger Lassalle who, I’m glad to say, is leaving at the end of this week, has happily lost another 5,000 talers in an ill-judged speculation. The chap would sooner throw money down the drain than lend it to a ‘friend’, even though his interest and capital were guaranteed.\"\n\n-Antisemitic quote by Karl Marx, in a letter to Engels in 1842.",
            "score": 2,
            "replies": [
                {
                    "author": "Mindless-Worth7049",
                    "body": "Marx is not a religious figure. i can agree with his politics and economics without agreeing with every word he ever said",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Impressive-Door3726",
                            "body": "His politics killed 110 million people. His economics caused famines.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ILikeBumblebees",
                    "body": "That letter is slightly antisemitic and *massively* racist against black people.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Impressive-Door3726",
                            "body": "Correct. Send it to any socialist and their beliefs will crumble.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Skogbeorn",
            "body": "I think you'd get a lot more out of reading Bakunin and Rothbard than talking to redditors. Cheers to you for challenging your own views, ain't nearly enough people willing to do that in any ideology.",
            "score": 2,
            "replies": []
        },
        {
            "author": "DrGarbinsky",
            "body": "Why would any bother talking to a Marxist?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Standard_Nose4969",
            "body": "Primacy of Consciousness, contradictions in colective property, at best a reductionist view of history/historical determinism and an end of history is very gnosticistic",
            "score": 1,
            "replies": [
                {
                    "author": "Fit_District7223",
                    "body": "Ah yes, the classic “Marxism is just historical determinism and spooky Gnostic nonsense” argument. Look, Marx wasn’t saying history was on some inevitable conveyor belt toward communism—he was saying economic systems shape society and that people, through struggle, can change them. That’s not mystical prophecy, that’s just looking at history and noticing patterns. Feudalism gave way to capitalism, not because of divine fate, but because economic conditions and class struggles made it happen.\n\nAs for contradictions in collective property—yeah, managing resources fairly at scale is hard. But pretending private ownership doesn’t have its own contradictions is hilarious. Capitalism creates artificial scarcity, lets a handful of billionaires hoard enough wealth to end world hunger multiple times over, and still somehow convinces people that this is the natural order of things. Collective ownership has challenges, but at least it's trying to solve the problem of wealth and power being concentrated in the hands of a few instead of just accepting it as inevitable.\n\nAnd primacy of consciousness? Come on. Marxism doesn’t say material conditions don’t shape thought—it literally argues the opposite. Capitalism warps people’s consciousness every day, convincing them they’re just temporarily embarrassed millionaires instead of exploited workers. If anyone’s guilty of magical thinking, it’s the people who believe the system that keeps screwing them over is the best one possible.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ILikeBumblebees",
                            "body": "> Ah yes, the classic “Marxism is just historical determinism and spooky Gnostic nonsense” argument.\n\nOne of many classic arguments. Collect them all!  Here are a few more:\n\n* What goes up must come down.\n* a^2 + b^2 = c^2\n* Roses are red; violets are blue.\n* The area of a circle is equal to pi multiplied by the square of its radius.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Fit_District7223",
                                    "body": "a² + b² = c² is a theorem, meaning it's a proven mathematical fact, not an argument.\n\nWhat goes up must come down is a statement of physical law (gravity), not an argument.\n\nRoses are red; violets are blue is a poetic phrase, not an argument.\n\nThe area of a circle is equal to πr²\" is a mathematical formula, not an argument \n\nYou don’t even know what an argument is, and yet I’m supposed to believe you actually understand Marxism? Aw, shucks, you anarcho-capitalists are adorable. I can point you to a dictionary if need be—don’t confuse it for an argument, though.\n\nI wouldn’t trust your simple mind with an even simpler task, so I’ll do it for you: An argument involves premises leading to a conclusion. None of what you listed fits that definition, which makes your response just an attempt at deflection rather than actual engagement with the topic. Try again sport.\n\nEdit: At least everyone else I’ve interacted with tried defending their positions before resorting to deflection tactics. You jumped to it immediately. If you’ve got nothing of substance to add, sit down and let the big boys talk, kid",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "ILikeBumblebees",
                                            "body": "And yet all of those bullet points describe things that are true, just like the quoted description of Marxism.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "WadeWaterWalker",
                                    "body": "This is the most “I skim Wikipedia and ignore the big words” style responses I’ve seen in a while.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Standard_Nose4969",
                            "body": "So, do you believe the revolution is inevitable or not?\n\nYou say Marx was just observing patterns in history, but then you turn around and say capitalism must lead to socialism. Which is it? If history is just a collection of economic conditions shaping society, why did feudalism end in completely different ways across Europe?\n\nGermany – The state co-opted landowners by giving them military titles.\n\nFrance – The Revolution wasn’t really driven by the bourgeoisie.\n\nNetherlands – The move away from feudalism was more about religion than capitalism.\n\nEngland – Being an island nation with naval dominance shaped its development more than class struggle.\n\nRussia – Skipped capitalism entirely, contradicting the supposed \"necessary\" order of history.\n\n\nIf history follows a dialectical pattern, why is it so inconsistent?\n\nAnd about collective property—I don’t mean \"contradiction\" as in \"it's difficult to manage,\" I mean it literally violates logic. Ownership means exclusive control, so if a collective owns something, every member has equal rights over it.\n\nBut what happens when A wants to trade X, B wants to consume X, and C wants to preserve X? If X is traded, then B and C weren’t really owners. If B eats it, then A and C weren’t really owners. Collective ownership leads to an impossible situation where something is both owned and not owned at the same time, violating the law of non-contradiction.\n\nThen there's the primacy of consciousness issue. You say material conditions shape people’s beliefs, but if that’s true, how can you know socialism is true? If beliefs are determined by class, then your belief in socialism is just a product of your material conditions, not truth.\n\nAnd what about Marx and Engels? By your logic, Engels—being a capitalist—should have been completely blind to socialism. Yet he was one of its main architects. If material conditions determine belief, how could he escape his class interest? Either:\n\n1. Truth is objective, and we can know reality beyond class influence (which refutes Marxist epistemology).\n\n\n2. Truth is class-based, in which case Marxism isn’t \"true\", just convenient for its believers.\n\n\n\nEither way, Marxist epistemology collapses. So, what’s your take?\"",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Mr-no-one",
            "body": "No.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PrevekrMK2",
            "body": "What will you do with people who oppose your ideology? In ancap, you can have your commune based on Marxism. If it is voluntary, of course. Therefore, there is no conflict. Can Marxism do the same, or is it coercive?",
            "score": 1,
            "replies": [
                {
                    "author": "Mindless-Worth7049",
                    "body": "Good question. firstly as for your point about communes, it misunderstands marxism. marxism, as a critique of capitalism seeks to abolish it entirely and therefore cannot accept (and believes the people will not accept) small scale communism. I reccomend you look into dialectical materialism for more about this. FInally as for coersion, it depends. For the ruling class? yes coercive force will have to be used. but for the ruling class, marxism seeks to gain their support by explaining why there interests are diametrically opposed to those of the ruling class. overall, im not in some fairy tale where the revolution will be bloodless",
                    "score": 1,
                    "replies": [
                        {
                            "author": "PrevekrMK2",
                            "body": "So you are ok with forcing people? Sorry, but that is not only wrong. That is evil. How can you support the ideology that is coercive and violent? That is, as you have said in your question, stupid. On one hand, you have ideology based on willing consent. On the other hand, you have ideology based on violence, be it physically or psychological. It's fascist. You join, or you die. Yea authoritarian and fascist.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Mindless-Worth7049",
                                    "body": "It is based on the consent of the oppressed and the coercion of the oppressors. Were the abolitionists not violent? i fairly sure they didnt walk up to slave openers and deliver a speech about the moral evils of slavery. No, they waged wars.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "PrevekrMK2",
                                            "body": "What if those you call oppressed oppose you?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "ILikeBumblebees",
                                                    "body": "Must be false consciousness!",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "PuffFishybruh",
                                    "body": "Who are you to determine what is good and what is evil?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "PrevekrMK2",
                                            "body": "Coercion. If you need to use force on people, especially at scale, what you're doing is evil.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "PuffFishybruh",
                                                    "body": "Why?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "PrevekrMK2",
                                                            "body": "I dont understand your question.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "PuffFishybruh",
                                                                    "body": "How is that evil? How would you even define evil and why should anyone accept that definition?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Intelligent-End7336",
                                                                            "body": "Evil is any action that violates free will",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "PrevekrMK2",
                                                                                    "body": "Exactly.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "PrevekrMK2",
                                                                            "body": "Anything you do against will of someone else is evil. Rape for example. No matter who does it, be it poor, rich or god, it makes them evil. If you dont consider consent to be a base of goodness,  then I have nothing to tell you.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "PuffFishybruh",
                                                                                    "body": "Historically, that is just not the used definition. The definution of evil was different in different cultures and religions and I don't understand why anyone should be accepting your definition, instead of any other.\n\nI could say that evil is the exact opposite from what you claim it is, and it would hold the same amount of value - none.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "PrevekrMK2",
                                                                                            "body": "Sex is ok. Rape isn't. It's doing the same thing. What makes rape evil is a lack of consent. It's forcing the other side. Do you agree, and if you dont, why?",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "PuffFishybruh",
                                                                                                    "body": "What if rape is evil not because of the lack of consent itself, but because god commanded us against it and whatever god commands us not to do is evil?\n\nHistorically, this would have been a much more relevant claim.\n\nIn my eyes, morality (which is a part of an ideology) is a reflection of the existing material reality, it changes together with the changes in that material reality. There is thas no spiritual evil, its a mere construct.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "PrevekrMK2",
                                                                                                            "body": "God also commanded against non procreating sex making sex and rape same in the eyes of god. And it's moot debate as god itself, if it exists,  isn't friend of humanity by any means. And argument from historical is nonsense as a lot of the things done and thought in the past were wrong. Every argument ,,it's been done like this forever\" is wrong. \n\n\nNo, only difference between rape and sex is consent.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "PuffFishybruh",
                                                                                                                    "body": "History is still yet to be solved, our society is still changing and our sence of morality is not set in stone. It would take a prophet to preach about morality.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "PrevekrMK2",
                                                                                                                            "body": "You seriously overcomplicate extremely simple things. No prophet is needed.  Nor god of any stripe. Let alone government. Simple ,,don't do to others what you don't want done to you\" is sufficient.  Again, consent is the base.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "soonPE",
            "body": " No need, obviously you do not know economics and history, yet you call yourself a  Marxist….\n\nWhy would i want to convince anybody so intellectually lazy?",
            "score": 1,
            "replies": [
                {
                    "author": "Mindless-Worth7049",
                    "body": "This comment clearly demonstrates intellectual superiority.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "soonPE",
                            "body": "Nahh",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Southernboiiiiii",
            "body": "marxism is a purely theoretical concept, there hasn't been a real marxist community, I mean I support you having a commune based on mutual aid if you want, I just think that free trade is very important for individual liberties",
            "score": 1,
            "replies": [
                {
                    "author": "Mindless-Worth7049",
                    "body": "i think thats a reductive view of liberty, reducing it just down to \"negative liberty\"",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ur_a_jerk",
            "body": ">\"communism therefore as the complete return of man to himself as a social (i.e., human) being – a return accomplished consciously and embracing the entire wealth of previous development. This communism, as fully developed naturalism, equals humanism, and as fully developed humanism equals naturalism; it is the genuine resolution of the conflict between man and nature and between man and man – the true resolution of the strife between existence and essence, between objectification and self-confirmation, between freedom and necessity, between the individual and the species. Communism is the riddle of history solved, and it knows itself to be this solution\" - Karl Marx\n\nThis dude is a gnostic who believes the history will end with humans becoming the pure form of self, becoming one with the species and no individual and believes literally everything will be perfect (heaven)\n\ndudes insane mysticist materialist gnostic",
            "score": 1,
            "replies": []
        },
        {
            "author": "ToolsOfIgnorance27",
            "body": "Nope. Can't.\n\nYou're an adult and believe in fairy tales. And ignore all evidence to the contrary.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AcanthocephalaNo1344",
            "body": "That's easy. Look at history.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GingerCookies0",
            "body": "The whole point of Marxism is based on the \"exploitation\" that the working class supposedly suffer from.\n\nThe exploitation according to Marx happens because of the surplus value that the Capitalist steals from them.  \nWithout this supposedly exploitation, all the corollaries of Marxism fall apart. \n\nThe theory of Subjective Value and Diminishing Marginal Utility proves how flawed the Surplus value theory is.  \nThere is no such thing as labour value because the value of something doesn't depend on the amount of labour applied (and even if it did, it would be impossible to calculate labour). The value depends on supply and demand.  \n  \nMoreover, the surplus value according to Marx is always conditioned by the profit which only happens after the goods have already been sold. Which means that Marx assumes the sale of goods as a given thing. He ignores that the Capitalist has to look for clients, build network, work on marketing and etc. and takes all the risk in case the sale doesn't happen. The sale is not a given thing. It doesn't just happen magically.   \nThat being said, it's not logical to base the surplus value on the profit. \n\nAlso, when the worker signs a contract to work on a factory or something, they are deliberately agreeing to sell their service in exchange of a fixed salary. They are not agreeing on having a percentage of the profit.  \nSo Marx ignores the legal value of the contract , which makes sense cuz he was a Materialist and thus didn't believe in Justice. But materialism is a flawed methodology. One cannot prove Materialism by using Materialism. \n\nLast but not least, much of what Marx wrote about the interaction of Capitalists and Workers and Means of Production is something that just applies to his time (industrial revolution era).  \nThe market has changed a lot and it's impossible to apply many of his concepts in todays world.   \nNowadays, you have Onlyfans models who become millionaire just by using a camera.   \nThey are the Capitalist and the Worker at the same time. So who are they exploiting?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Official_Gameoholics",
            "body": "Economic Calculation Problem, for one.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bonsi-rtw",
            "body": "Marx wrote “women are means of reproduction and a way for men to let off their frustrations, a perfect example of socialism”, he wrote various letters to Engels when they both make fun of homosexuals and insulted jews and people of color, he raped his housekeeper, had a son with her and then proceeded to refuse to acknowledge him. He was in fact everything that he condemned, by marxist definition a capitalist is “someone how owns the means of production” so he was a capitalist because he “owned” an housekeeper. not only that, following this narrative your butcher is a capitalist (so he needs to be eliminated) but a CEO paid millions is just another oppressed worker that needs to be helped. don’t you see how stupid this is?",
            "score": 1,
            "replies": []
        },
        {
            "author": "livinglife_part2",
            "body": "Read the book \"Animal Farm.\" I'm not sure if it's still required reading, but it gives a good view of what happens in 100% of the times communism has been tried. \n\nYou might have to wait for an intelligent AI overlord or an Alien invasion to take over the world before you will create a successful attempt at Communism because the inherent nature of mankind is that someone will want to be in charge and the rest of us will be lined up against a wall for disagreeing with the state.",
            "score": 1,
            "replies": [
                {
                    "author": "MindOverManner69",
                    "body": "Animal farm is not specifically about communism so I think you missed the fucking point dude. It's about people in power co-opting movements. When it came out, pretty much everyone thought it was targeting them, which is funny in itself.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "livinglife_part2",
                            "body": "Oh, did I rub you wrong with that comment? It is what is in the eye of the beholder. If everyone thinks it is that which they think it is, then the moral is the same at the end of the day.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "MindOverManner69",
                                    "body": "Well, the moral isn't specifically communism bad like you said, so you had an opinion, but it's trash.\n\n  \nIt gives a good view on what happens when power is abused.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "livinglife_part2",
                                            "body": "Yeah I really touched a nerve. You can probably go back to your communist sub and complain to them about how someone had an idea other than your groupthink.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Doublespeo",
            "body": "Marxist economist philosophy been disproven during its lifetime.\n\nIt is basically an utopia. Whatever you think it is great or not doesnt really matter as it is connected to reality.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ILikeBumblebees",
            "body": "I don't know your own specific positions, but to respond to Marxism in general:\n\n* LTV is false.\n* \"Means of production\" is an arbitrary contrivance...\n* ...but if workers seize it, where does it come from in the first place?  Other workers?  How do *they* get paid?\n* Personal vs. private property dichotomy is also an arbitrary contrivance.\n* SNLT is yet another arbitrary contrivance.  All of these things are based on categories and analytical models constructed to shoehorn interpretation of economic behavior into Marxist conclusions.\n* Marx himself admitted to prioritizing polemic utility of ideas over their descriptive accuracy, consistent with all of the above contrivances.\n* False consciousness theory is a layer of epicycles to hand-wave away obvious falsification of class theory predicting workers' interests (and you have to be insufferably arrogant to argue it).\n* Every attempt to implement Marxist economics at scale has been an utter failure.\n* Groucho was way funnier and cooler.",
            "score": 1,
            "replies": []
        },
        {
            "author": "upchuk13",
            "body": "Have you read any Kevin Carson?",
            "score": 1,
            "replies": []
        }
    ]
}