{
    "title": "How to debunk claim most of the world is working in sweatshops for the west to enjoy its goods?",
    "author": "Valuable-Junket9617",
    "subreddit": "Anarcho_Capitalism",
    "rank": 286,
    "score": 22,
    "upvote_ratio": 0.61,
    "num_comments (reported by reddit)": 88,
    "url": "https://i.redd.it/d57xc8zdilje1.jpeg",
    "id": "1ir7awl",
    "selftext": "",
    "comments": [
        {
            "author": "AgainstSlavers",
            "body": "If they are forced into the sweatshops at gunpoint, then that is de facto government and slavery. If the workers show up voluntarily, it's because that option is better than subsistence farming.",
            "score": 113,
            "replies": [
                {
                    "author": "Valuable-Junket9617",
                    "body": "This exactly. I always tell socialists like nothing's stopping you from getting wood and building your own home in the woods. \n\nBut if they were willing to work, they wouldn't be socialists 🤣",
                    "score": 47,
                    "replies": [
                        {
                            "author": "MathiasThomasII",
                            "body": "The city planner would like to speak with you about code violations…..",
                            "score": 30,
                            "replies": [
                                {
                                    "author": "Cr4bc0re_F4n",
                                    "body": "It's actually illegal to live in a trailer in YOUR OWN land in most of the US! Zoning laws really don't get enough hate in libertarian circles.",
                                    "score": 41,
                                    "replies": [
                                        {
                                            "author": "Valuable-Junket9617",
                                            "body": "Exactly being allowed to live in a trailer or RV or some mobile home of some kind will allow so many people to be financially free a lot sooner.\n\nAlso why society and the media shames people for \"living in a box\" or smth, they need people working 50 years to pay off a mortgage to big banks 🫠",
                                            "score": 19,
                                            "replies": [
                                                {
                                                    "author": "Silder_Hazelshade",
                                                    "body": "Heaven forfend people in 300k debt have to look at the trailer of a family 2k in the black ☹️",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "ATCorvus",
                                                            "body": "Not just that, the devaluation that said property could face thanks to that trailer right next to it.\nThat’s the real worry.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "ATCorvus",
                                                    "body": "I’m not even gonna touch NIMBY. Oops, I did. \nWith houses being a financial asset and investment no one would want a trailer next to their $1/2 mil house.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "ATCorvus",
                                            "body": "Exactly. I agree.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Business-Self-3412",
                            "body": "Yeaahh the government is definitely stopping you from getting wood and building your own home in the woods",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "SorbP",
                                    "body": "Living there, on someone else's land or most probably the government's land, yeah for sure.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "MaelstromFL",
                                            "body": "The US Government owns 80%+ of the land in most of the western states!",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Turban_Legend8985",
                            "body": "There are lots of things that are stopping you from doing that, like lack of money.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ATCorvus",
                            "body": "The government is.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ATCorvus",
                    "body": "What about government policies or corporate competition driving people out of farm land? The first happened in China the 2nd is happening here. \nJust think for a second that a lot of small farms benefit from small government grants and lower taxes to survive and they still struggle and that’s here in USA. Other (3rd world countries) don’t enjoy necessarily of the same tax cuts or incentives.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "AgainstSlavers",
                            "body": "Government is evil",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Emergency_Accident36",
                    "body": "so by that logic taxes are voluntary because if you choose not to make income you don't have to pay them",
                    "score": -9,
                    "replies": [
                        {
                            "author": "AgainstSlavers",
                            "body": "Sweatshops are voluntary. Taxes are not.  That's the point.  \n\nYour logic is so stupid that it says getting mugged is voluntary because you could choose to get shot.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "Emergency_Accident36",
                                    "body": "how are sweat shops anymore voluntary than not working?  The other option of a sweat shop is to not work, people who 'voluntarily'  work in sweat shops do it because there is no other choice to make money. Not because they mistook it for a sauna that payed.\n\nSimilarily that same option of not working when applied to taxes means no taxes..  ergo taxes are equally as voluntary as not working the only job available",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "ForFreedomLovers",
                                            "body": "if you can't work somewhere else, then you're dealing with a government, by definition, and then you agree with me to abolish the government.",
                                            "score": 9,
                                            "replies": []
                                        },
                                        {
                                            "author": "ForFreedomLovers",
                                            "body": "The other option of a sweat shop is work somewhere else.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Emergency_Accident36",
                                                    "body": "if that were an option they obviously wouldn't work in a sweat shop..",
                                                    "score": -6,
                                                    "replies": [
                                                        {
                                                            "author": "ForFreedomLovers",
                                                            "body": "it's obvious you've never tried subsistence farming.  get back to me when you become an adult.",
                                                            "score": 6,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "AgainstSlavers",
                            "body": "I choose to make income and not pay taxes. That is voluntary. You put a gun in my face for not giving you my money, then that is not voluntary.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "VatticZero",
            "body": "You can’t really argue with delusion.",
            "score": 91,
            "replies": []
        },
        {
            "author": "CaptTheFool",
            "body": "Without capitalist, everywhere is poor as fuck, better to keep companies fighting for customers than a busy body just deciding what should be produced and who gets a piece.",
            "score": 13,
            "replies": []
        },
        {
            "author": "Valuable-Junket9617",
            "body": "Guys, I'm just tryna see arguments when debating socialists myself. Not a \"gotcha\" for this reddit lmao.",
            "score": 23,
            "replies": [
                {
                    "author": "prometheus_winced",
                    "body": "Usually countries with sweatshops are due to socialist / communist governments with a historical lack of property rights.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Winky0609",
                            "body": "So obviously true but I’ve never thought of that, this is a new talking point for me when I argue in the staff room at work",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Phonoi",
                            "body": "Right, the first question should be: where are those two places that are being compared?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "HaveAtItBub",
                    "body": "everytime i get caught up in a comment section debate, i think fuck. got me again. then divert my attention elsewhere. they're so pointless bub. exert your energy somewhere more conducive, though it can be fun sometimes.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "jacknestor89",
            "body": "Capitalism is amoral and will do whatever is most efficient.\n\nWithout totalitarian slave driver governments this wouldn't be a problem, and clearly you (being the person you're debating) do not care enough to use alternative products which are not produced in this manner.",
            "score": 15,
            "replies": [
                {
                    "author": "Metrolinkvania",
                    "body": "An amoral people will be amoral in whatever economic style, but the one that gives least power to the baddies is straight capitalism and the worst might be mixed capitalism where they (politicians and bureaucrats) have the power without the responsibility.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "jacknestor89",
                            "body": "Completely agree",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Wild-Ad-4230",
            "body": "[https://blogs.worldbank.org/en/opendata/estimates-global-poverty-wwii-fall-berlin-wall](https://blogs.worldbank.org/en/opendata/estimates-global-poverty-wwii-fall-berlin-wall) Start here, next find out life-expectancy changes for countries before/after the fall of Soviet Union.",
            "score": 10,
            "replies": []
        },
        {
            "author": "DeeImmortalMan",
            "body": "Yes there is poverty but the poor enjoy much more luxury today than any other royalty did in history. \n\nThe poor today have:\n\nSmartphones, internet, books, movies, clothes, water, good food, etc.\n\nThe main issue lies in the administration and the infrastructure of each nation.\n\n(Also: according to their logic, where do we draw the line between the haves and the have-nots? Many of them live in first world countries but yet I don't see any of them donating their salaries to struggling nations?)",
            "score": 18,
            "replies": [
                {
                    "author": "I_Never_Use_Slash_S",
                    "body": "You’re talking about ‘poor’ people in wealthy western countries, not the global poor who live on a dollar a day.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Valuable-Junket9617",
                    "body": "True, after basic housing, maybe a couple cars, reliable groceries, and enough space to live, there isn't much difference in quality of life between middle class and super rich",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "Turban_Legend8985",
                    "body": "That's absolute nonsense. You know nothing about poor people.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mistagater97",
            "body": "There is a spectrum of how Capitalist a country is. The US is more Capitalist than France. Africa and latin America are less economically free then France. In Argentina, the labor unions dominate the economy.",
            "score": 3,
            "replies": []
        },
        {
            "author": "GenericHam",
            "body": "If you think some countries are poor when we are paying them to manufacture our goods, you should see what happens when we stop.   \n  \nI will admit that having to pick bananas for $1 a day would suck, but its not like if the banana job went away suddenly $50k a year office jobs would pop up. You instead would just be out your banana job and just have shittier options to pick from.",
            "score": 3,
            "replies": [
                {
                    "author": "zm1216",
                    "body": "Exactly\\^\\^\\^ Black markets emerge anywhere a free market is outlawed. Not only will working on a black market be illegal, its also more dangerous because you can't go to the police if you're being abused (i.e. sex trafficking in the prostitution industry) and you're also very likely to be paid less as the business owner needs a bigger cut for the risk/bribery of law enforcement to operate.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Metrolinkvania",
            "body": "I wish these people would read Enlightenment Now or Basic Economics.",
            "score": 6,
            "replies": []
        },
        {
            "author": "ajomojo",
            "body": "It’s the defensiveness that prevent people from taking personal responsibility, if I’m holding power at an underdeveloped country it is a lot easier to to blame someone else than confronting my own assumptions and distortions",
            "score": 2,
            "replies": []
        },
        {
            "author": "19_Cornelius_19",
            "body": "That's the thing, though, people can not seem to grasp the role of consumers and human nature.\n\nDoes another person owe you anything? No. Another human being does not owe another human being anything in life. Ex: not owed kindness, gratitude, empathy, friendships, labor, money, etc...\n\nWith that said, people may be as corrupt or immoral as they wish so long as it does not harm another's or infringes on another's individual rights. \n\nThere is also nothing stopping anyone from being the complete opposite of corrupt and immoral. Again, so long as that individual does not harm another or infringes on another's individual rights. \n\nSo when a corrupt and immoral individual starts a business, then what would you expect consumers to do? You would expect them to boycott that business. \n\nWhen a non-corrupt and ethical individual starts a business, then what would you expect consumers to do? You would expect them to patronize that business.\n\nAfter all, in a capitalistic free market, only the business that consumers allow to survive will survive. \n\nBut do people live up to those ideals? So they boycott the immoral and patronize the ethical businesses? No, instead, they patronize both and complain that the government should do something about the immoral business.\n\nBeing a conscious consumer is a very large part of what those type of people are missing in their own arguments. They are not against capitalism. They are against self-responsibility when it comes to where their earnings go to support.",
            "score": 2,
            "replies": [
                {
                    "author": "SorbP",
                    "body": "\"They are not against capitalism. They are against self-responsibility when it comes to where their earnings go to support.\"\n\n  \nBro, this was brilliant! Thank you!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ihiwszkpseb",
            "body": "Keynesian mindset. Production builds wealth, not consumption. How did rich countries get rich? By producing more efficiently. Poor countries need property rights, stable currency, contract enforcement, rule of law, etc.",
            "score": 2,
            "replies": []
        },
        {
            "author": "McMagneto",
            "body": "They need to see the picture of the bottom before capitalism.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Character_Dirt159",
            "body": "With property rights, “sweatshops” are a healthy stage in economic development. They represent the best available opportunity for their workers whose alternative is usually slowly starting to death on an overpopulated subsistence farm. With property rights the sweatshop stage lasts less than a generation. Places like Hong Kong and the lower East Side of Manhattan were “sweatshop” economies in the last 100 years and have transformed from extremely poor immigrant communities into some of the wealthiest on earth. Without property rights “sweatshops” are a never ending socialist hell.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Baalenlil7",
            "body": "Debunk? This is flatly true. The problem is an attribution error. The West is living lavishly on the backs of exported poverty, but this is not a feature of free trade. What this meme condemns as 'Capitalism' is actually a product of corporatism (that unholy union of extremely large conglomerates and statism).",
            "score": 2,
            "replies": []
        },
        {
            "author": "Duckdodger89",
            "body": "There was a great documentary I watched from 2014 called Poverty Inc., the conclusion was that what creates this inequality isn’t capitalism but lack thereof in impoverished countries. Developed countries like the US send “foreign aid” to these which floods these countries with cheap/free products which absolutely kills their market economies, discourages entrepreneurism, and doesn’t allow for economic mobility.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Will-Forget-Password",
            "body": "False dichotomy. Both pictures are capitalism.",
            "score": 1,
            "replies": []
        },
        {
            "author": "kendoka-x",
            "body": "you just point out that they are 100% correct and that had it not been for capitalism both of those pictures would be grass or mud huts.",
            "score": 1,
            "replies": [
                {
                    "author": "Emergency_Accident36",
                    "body": "if only we could build mudhuts...",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "I_Never_Use_Slash_S",
            "body": "If that were true all our goods would be made in countries that use slave labor, so just show them where all their stuff is made. They’ll be so debunked.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ToxicRedditMod",
            "body": "If it’s made in a communist country, don’t the workers own the means of production??!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Official_Gameoholics",
            "body": "Sweatshops are one of the greatest inventions of the 21st century.    \n\nWhy would people work there if they had access to something better?",
            "score": 1,
            "replies": [
                {
                    "author": "Emergency_Accident36",
                    "body": "they have no options, all the land has been claimed.  In their society some people even pay taxes to hire a government with militaries to have a greater claim to the land.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Official_Gameoholics",
                            "body": ">In their society some people even pay taxes to hire a government with militaries to have a greater claim to the land.\n\nThat's the fault of the state, not the property owners.   \n\nYou can always get land for yourself provided that the illegal extortion racket is no longer around. Work for it.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Emergency_Accident36",
                                    "body": "they do it by choice, so theu don't have to have their own military to defend a .25 acre plot. \n\nThere's only 1 way to get land for yourself without \"government\", that is to take and defend it.  \n\n(by the actual definition of government)",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Official_Gameoholics",
                                            "body": ">so theu don't have to have their own military to defend a .25 acre plot. \n\nWould be cheaper without states. \n\n>There's only 1 way to get land for yourself without \"government\", that is to take and defend it.  \n\nYou can easily purchase it for yourself and hire an RPA to defend it for you. \n\n>by the actual definition of government\n\nI am using the word \"state\" deliberately here.    \n\nThis is the objective definition of the word state:   \n\n\"An organization which claims legal authority over a given territory.\"",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Emergency_Accident36",
                                                    "body": "\"Would be cheaper without states.\"  \n\"You can easily purchase it for yourself and hire an RPA to defend it for you.\"  \n\nNo shot, you can't make enough GDP for that on even 100 acres.  And neighbors will create clans, which will become independent states, which will have bigger armies and governments. It's the natural law of civilization. \"Consolidation\" \n\nI have no objection to that definition of state besides \"legal\" as with no government, there is no definition of \"legal\".  It's do what thou wilt and that is the whole of the law. So really it's \"An organization which claims authority over a given territory\" including shipping vessels and fleets.\n\n\nLong story short is sweat shops are no more voluntary than taxes",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Official_Gameoholics",
                                                            "body": ">No shot. You can't make enough GDP for that on even 100 acres.\n\nLmao GDP.    \n\nYou can easily hire an RPA. They're a lot cheaper and more efficient to operate than a public army. Plus, they kill public armies in any confrontation due to being richer due to not suffering the ECP and more technologically advanced.\n\n>And neighbors will create clans, which will become independent states, which will have bigger armies and governments. It's the natural law of civilization. \"Consolidation\" \n\nThey'd immediately die to the RPAs the second they aggress.    \n\nAnd it isn't a natural law of civilization. Anarchist principles have always outlasted statist ones. \n\n>as with no government, there is no definition of \"legal\"\n\nLegal authoritarianism is a false legal code, and it is a fatal error to abide by it. You are committing a frozen abstraction fallacy by freezing legal authoritarianism as all legal theories. \n\n>It's do what thou wilt and that is the whole of the law.\n\nNo, that's Stirnerism, a form of legal authoritarianism, and legal authoritarianism is incoherent.\n\n>An organization which claims authority over a given territory\n\nUnder your definition, every single business is now a state. Clearly, your definition is wrong. It does not identify the differentia of the concept.\n\n>Long story short is sweat shops are no more voluntary than taxes\n\nLmao. Nobody is threatening these people to get them to work in a sweatshop. There are farms in China. They could easily choose to become a subsistence farmer.    \n\nPeople need to work to live. That is a fact of life. It is not extortion to give people a job. In fact, the best job they could possibly choose to have in the area they live in.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Turban_Legend8985",
                    "body": "Sweatshops are legalized slavery.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Official_Gameoholics",
                            "body": "Nope, they can go work somewhere else anytime they want.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "takeshyperbolelitera",
            "body": "They should include a 3rd picture showing the world without capitalism which is substance farmer living in a mud hut on barely farmable land.",
            "score": 1,
            "replies": []
        },
        {
            "author": "hblok",
            "body": "To start with, the number is way off. North America (Canada 41 M, US 335 M) and Europe (\\~500 M) makes up some 11% of the 8.025 billion world population.\n\nFurthermore, going to South America, shacks like that is far between. You might see them in sub-Sahara, India or Asia, but there is also large middle classes. A quick search suggest 700 million people, or 8.7% lives in extreme poverty, with less than $2.15 per day.\n\nIn other words, the headlines for the pictures are wrong. Some 90% of the world population live in some version of the first picture. And that is *not* thanks to communism.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mountain_Employee_11",
            "body": "they kinda are lmao, but sweatshops clearly beats farm labor so 🤷‍♂️",
            "score": 1,
            "replies": []
        },
        {
            "author": "dont_tread_on_me_777",
            "body": "Everyone under those conditions is living in commie countries.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OldAge6093",
            "body": "You can’t debunk it as it is true. It is natural for markets to create inequalities if private properties are allowed these inequalities become generational and national. Eventually becoming rigidly so. But is there really a problem? I mean libertarian capitalism is all about pure competition.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Quantum_Pineapple",
            "body": "You can't reason people out of a position they didn't reason themselves into in the first place, kids.\n\nSaid demographic exemplifies the Dunning-Kruger principle, and social media has only amplified it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Consistent-Dream-873",
            "body": "The alternative is subsistence living and working in a field either freezing their ass off or burning their ass off.  There isn't a better option but the factory will bring their communities money which will open more opportunities.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BastiatF",
            "body": "Nirvana fallacy",
            "score": 1,
            "replies": []
        },
        {
            "author": "agentofdallas",
            "body": "Sweatshops are an upgrade from what existed before in those countries as a result of economic liberalization",
            "score": 1,
            "replies": []
        },
        {
            "author": "AcanthocephalaNo1344",
            "body": "the key of the problem is their misunderstanding of capitalism (willfully or otherwise)\n\nall the countries with sweatshops are shitholes because of the government(s) in that country\n\ncorporations buying politicians has nothing to do with capitalism",
            "score": 1,
            "replies": []
        },
        {
            "author": "zm1216",
            "body": "The bottom image is what the top image used to look like. Comparing modern first world living standards with third world living standards is delusional, because it ignores this fact.\n\nThe natural human condition is poverty. We have no food, water, shelter, and certainly none of the modern conveniences that I'm enjoying right now and that you are too as you read this. Why? because our economy was allowed to develop from the bottom stage to the top.\n\nEconomies start with agriculture, civilization starts with agriculture. You can't settle in one location without a stable, predictable food supply, so thats what everyone does for work- subsistence farming. Development of technology (if it is allowed by the government/not stopped for whatever reason) makes this farming more efficient, cutting down on the labor required. Given that there is no lump of labor and that there is always more to do (same reason why AI won't put the entire human race out of work) people go into new industries. Where markets are allowed to operate, capitalists in wealthy countries will invest and hire low skilled labor in developing nations.\n\nIf these jobs are taken voluntarily, there is no problem. Is the pay bad? Yes. Are the hours long? Yes. Are the conditions bad? Yes. But...is the work better than what they were doing before? Absolutely.\n\nWhat people don't consider is:\n\nThe ills of the gilded age in America were ended by allowing the gilded age to run its course. Pay went up dramatically before the government stepped in with a minimum wage. Hours went down dramatically before the government stepped in with laws regarding hours worked in a day. Child labor was almost gone before it was outlawed. Workplace fatalities fell dramatically before OSHA came around, and so on. Why? Economic development and competition in labor markets. Okay, factory A will only pay $4 an hour to an unskilled worker. Factory B can manage to slice its profits thin enough to attract the unskilled worker by paying $4.50. And so on. Same thing applies to hours worked. As workers gain human capital in heavy industry, textiles, etc. (skills they never had at all as subsistence farmers) they become more productive, can demand more money for their time, and come out of the drudgery of sweatshop work, IF THEY ARE ALLOWED TO. In situations where government imposes minimum wages, outlaws child labor, puts in onerous regulation on business, they are merely condemning these nations to poverty.\n\nSouth Korea kept these practices legal. The work was awful by our first world standards. But you let these workers gain skills and become wealthier, and soon enough they'll work less, have easier jobs, have safer and more comfortable jobs, and have enough money that their kids can go to school instead of working. A common Ancap meme is that we love child labor and want kids to work. Its funny but not accurate- I want VOLUNTARY child labor to be legal in these developing nations because I understand that letting them work for their families is the fastest way to get them out of the factories and into the schools.\n\nPassing a law banning this practice is not going to fix this. An extremely disturbing anecdote from Rainer Zitelmann's book In Defense of Capitalism discusses how a consumer boycott to Walmart left thousands of kids unemployed in the third world, so what did they do? Did they just start going to school because now the evil capitalist wasn't \"forcing\" them to work anymore? No, they worked at more dangerous, worse paying, and harder jobs. Some just became prostitutes. Is that what socialists want? Probably, as NAMBLA was founded by a marxist.",
            "score": 1,
            "replies": []
        },
        {
            "author": "old_guy_AnCap",
            "body": "The question isn't why there is so much poverty in the world. Poverty is the default. The real question is why is there so much wealth. And how would one best create more.",
            "score": 1,
            "replies": []
        },
        {
            "author": "nastyclock",
            "body": "impossible to debunk because true",
            "score": 1,
            "replies": [
                {
                    "author": "Valuable-Junket9617",
                    "body": "How so",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "upchuk13",
            "body": "This isn't something you debunk. Learn about the subject and realise if it's the case or not.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Prestigious_Bite_314",
            "body": "Just show them the skyscrappers in the capital cities. They mention how everyone wants to rlock to the city, instead of enjoying their care free life on the farm.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KlassinenLiberaali",
            "body": "Arguing is often pointless. Commies tend to be societal outcasts and trying to change their minds is usually futile. Personally, I find it easier to shift conservatives or centrists toward a more libertarian mindset since there are some shared goals that unify us. They also tend to be more pragmatic, making them more open to logic rather than dismissing every diffrent opinion outright. I thinl it's better to teach people not argue with them. Most people don’t understand Austrian economics, so debating them is like trying to discuss math with someone who can't solve a simple equation.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Turban_Legend8985",
            "body": "You can't debunk it because it is true. If your only options are either to work for company that exploits you or end up starving in the streets, there is no real freedom.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lescuer97",
            "body": "First is recognize to them that there is debt slavery that was created by the US government and other countries.\n\nThen show them that capitalism is not that capitalism is voluntary trade and private ownership a lot of those shantty town people see happen because people don't have property rights and the little money they make is inflated away by those country so they can pay their debts",
            "score": 1,
            "replies": []
        },
        {
            "author": "LudwigNeverMises",
            "body": "Go there and ask them if they’d rather be born in the developing world during the 70’s or now",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rarc1111",
            "body": "The delusion here is that you are Anarcho-Capitalists. \n\nMost of you people are completely oblivious of true cost of production and how pecuniary externalities work. You say you believe in freedom, while in fact you want the freedom to exploit and extract without any responsibility to the damage caused. \n\nIf you believe you can keep draining from the world without footing the bill, you are a parasite, a mockery of the values of true freedom and a voluntary society. There is no \"voluntary\" if the choice is between death by hunger or exploitation. The freedom is about economic independence, about not being subject to these forces that have been robbing us for so long. \n\nTrue Anarcho-Capitalists understand that the system must be balanced, that it must account for long term returns to all parts involved in order to be resilient and based on fair exchange of value. It's about using Capital to achieve economic independence, not about using Capital to lord over miserable people. If your idea is using Capital to perpetuate the oppression and destruction, you are no Anarchist, you are simply another robber, another criminal that should find it's place somewhere else.",
            "score": -3,
            "replies": [
                {
                    "author": "Mountain_Employee_11",
                    "body": "this makes a lot of sense if you don’t really understand economics",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Official_Gameoholics",
                    "body": "The \"freedom\" you advocate for is slavery, hypocrite. The dirt and bugs have no rights to the land. It is only for humanity.",
                    "score": -1,
                    "replies": []
                }
            ]
        }
    ]
}