{
    "title": "An Aussie Story",
    "author": "The_Business_Maestro",
    "subreddit": "Anarcho_Capitalism",
    "rank": 253,
    "score": 11,
    "upvote_ratio": 0.76,
    "num_comments (reported by reddit)": 13,
    "url": "https://www.reddit.com/r/Anarcho_Capitalism/comments/1isxxpx/an_aussie_story/",
    "id": "1isxxpx",
    "selftext": "I just read something that truly boggled my mind. A 15 year old male had someone send a doctored message saying he was going to kill himself to the police, and under the 2009 mental health act they were allowed to forcefully take him from his home to a mental institution. Now this sounded horrific to me, and a few people also pointed out how horrible it was. But most people defended it, and stated how it wasn’t that bad and that the act saves lives whilst downvoting people talking about it being an abuse of freedom.\n\nWhen are we going to stop them? When are we going to stand up and make our world free? \n\nI’m still a young adult. So I have plenty of time ahead of me to work towards a freer world, and I have my own plans. But I’m curious what all of your ideas are for helping bring this into reality? What are you doing to help",
    "comments": [
        {
            "author": "GoogleFiDelio",
            "body": "Sorry bro but Australia was the worst place to be during COVID. Don't give up your guns.",
            "score": 12,
            "replies": [
                {
                    "author": "The_Business_Maestro",
                    "body": "Pain in the ass to get guns here. I have to go through a whole process to get my Licence and then be a part of a club",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "jbbest666",
            "body": "I have one sister try to put the other sister into the mental health ward and lock her up..under the same act.  it's nutso. \n\nonly when my father intervened .. he is a doctor... they stopped....\n\nonce committed..you are screwed.",
            "score": 6,
            "replies": []
        },
        {
            "author": "0hip",
            "body": "How are we going to stop people from sending doctored messages to police? Probably with good punishments for offenders",
            "score": 5,
            "replies": [
                {
                    "author": "The_Business_Maestro",
                    "body": "Doctored messages aren’t the problem. It’s the police being able to come into your home and take you against your will based off of a message",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Fluffy-Feeling4828",
                            "body": "Based",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BrooklynRedLeg",
                    "body": "I think a few years at hard labor on a chain gang might do the trick....",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Emergency_Accident36",
            "body": "72 hour psych hold?  We have that in the states.  I don't think wellness checks should be done, they certainly shouldn't go as far as detaining people unless that person has the equivilent of a living will dictating it.  \n\nAs far as the false reporter I'd hope they could be sued intensely and those calls like SWATTING shouldn't be anonymous. There could still be anonymous tips, just not with such actions, maybe a little investigation first.",
            "score": 1,
            "replies": [
                {
                    "author": "The_Business_Maestro",
                    "body": "Yeah 72 hour hold. \n\nThey should alert the family and let them handle it. The state has no place taking out kids to a psyche ward because they think it’s good for them. I know people that have been to the wards here in Australia, it can be a horrible environment",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Emergency_Accident36",
                            "body": "I agree with everything except for the family handling it blanket statement.  Some families don't want to handle it, and a patient should be able to grant explicit permission for intervention if they want to. Common examples would be schizo disorders who do fear theu may harm themselves or other during an episode. And I mean explicit permission, a clear voluntary contract, no implied or coerced cases like seeing a mental health provider often includes. ( I personally think suicide is the most inalienable right that exists, but it should be considered in sound body and mind. )\n\nFunny quote applicable to the last part: \"Anyone who goes to a psychiatrist ought to have his head examined\" - popularized by Alan Watts.  Chew on it, implied consent..",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "The_Business_Maestro",
                                    "body": "I was referring to stuff like the scenario I talked about.\n\nIf someone voluntarily contacts support and asks them to take them to a psyche ward because they are having issues thats fine. At the very least information given for situations like these should have to come from a vetted source. I’m okay with a wellness check and even them insisting on seeing the child to ensure safety. But not brute force and certainly not taking someone away who doesn’t want to.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Emergency_Accident36",
                                            "body": "I agree, I fear this happening to me honestly.  I use my words carefully to my therapists and record everything. The 72 hour hold should be replaced with an intake on the record, ideally on site too. A cop can never be trained enough for it, so it should be a social worker role but higher degree.  72 hours is a long time to deprive somone of freedom for nothing.\n\nAnother issue with just referring to the family is the family can be the ones doing the false reporting.  Then what?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Intelligent-End7336",
            "body": ">But most people defended it, and stated how it wasn’t that bad and that the act saves lives whilst downvoting people talking about it being an abuse of freedom.\n\nI'd challenge you to define the ethical system that allowed this, and then propose an ethical system that wouldn't, and then explain how you are going to convince and spread the correct ethical system.  Do that and you'll be able to stop them.",
            "score": 1,
            "replies": []
        }
    ]
}