{
    "title": "Centrist",
    "author": "Great_Opinion3138",
    "subreddit": "Anarcho_Capitalism",
    "rank": 223,
    "score": 799,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 84,
    "url": "https://i.redd.it/5a856hk948ke1.jpeg",
    "id": "1itqbnb",
    "selftext": "",
    "comments": [
        {
            "author": "yadius",
            "body": "I consider myself a radical. \n\nAnd I know exactly who radicalized me.\n\nIt was the state during 'Covid'.",
            "score": 80,
            "replies": [
                {
                    "author": "GoogleFiDelio",
                    "body": "In case your [blood pressure is low](https://nypost.com/2023/06/02/bidens-new-cdc-director-laughed-off-covid-lockdowns/):\n\n>After reports of Cohen’s appointment surfaced, posts on social media showed her gloating about implementing COVID lockdowns, inconsistently following her own mitigation guidelines and forcing public schools to have students masked indoors regardless of vaccination status.\n\n>The ex-health secretary recalled at one point advising Massachusetts Health Secretary Marylou Sudders to shutter football stadiums to fall in line with North Carolina’s COVID mandates.\n\n>“She was like, ‘Are you gonna let them have professional football?’ And I was like, ‘No.’ And she’s like, ‘OK neither are we,’” Cohen said with a chuckle.\n\nDictatorship by idiot girlbosses was a low point of our civilization and science.",
                    "score": 47,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "Watching those who claimed to be \"anti authoratarian\" all of a sudden telling you to do what the Government and billion dollar pharma companies tell you to by force of police action was really a game changer.",
                    "score": 35,
                    "replies": [
                        {
                            "author": "meandthemissus",
                            "body": "Not to mention watching Australia make *actual concentration camps for the healthy people, not the sick.* Seeing video of USA cops arresting people sitting alone on a beach or jogging in a park.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "I've seen so many videos of cops rolling in to shut down small businesses. I've personally seen them called to remove people from buildings for not masking or showing their vax papers. All the while the big corporations and politicians profited.\n\n\nI was what was considered \"left lib\" etc. at the time and lost friends because I said \"Hey, 'the science' doesn't ACTUALLY say that. I have a science degree and read the research, that was poorly done OR you simply don't understand what it's saying!\" I was called \"QANON\" for literally pointing out how certain politicians profited from COVID via stocks in testing companies and shipping companies (bringing in masks etc from China.) For pointing out how they made money by shuttering small businesses while the giant ones stayed open thanks to government, and even received funding. \n\n\nI will never, for my whole ass life, forget the shit I read and saw from 2020-2022 (fucking mandates were still in place in large cities until the Ukraine conflict finally kicked in.) And then people had the balls to say \"WHY DO YOU CARE, IT'S OVER?!?!\" Like, fuck that authoritarian shit I will ALWAYS care.",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "meandthemissus",
                                            "body": "The internet is trying to memory hole a lot of what happened. I've been keeping an ongoing note on my computer with various articles and research papers so that I can show what happened. \n\nRight now, when you try to google search specific actions or general sentiments you know happened during that time, it's like it never happened. Half the stuff I saw during 2020-2021 I can't seem to find anymore.\n\nBut yeah, having just a basic understanding of science really drove a wedge between me and family members, friends, and society. When I said, no that piece of paper or cloth isn't stopping an aerosolized virus from getting into the air I would get dog piled.\n\nHaving a natural skepticism of a drug brought to the public under emergency conditions without anywhere close to the amount of testing *every other drug undergoes*, and having people tell me I'm a conspiracy theorist.... it was fucking nuts. They hid tons of the trial data. They lied about the vaccine efficacy and then tried to pretend that the lack of efficacy was *always known* or *it's just a new strain that's why*. \n\n\"It was never meant to stop you from getting covid.\"\n\n\"It was never intended to prevent transmission of covid.\"\n\nBull. Fucking. Shit. Both claims were made and then memory holed after they got out with billions in cash.\n\nMeanwhile the govt forced people to get the **still experimental** drug or lose your job, and we had the mini-autocrats in our society yelling in unison \"It's not mandatory you have a choice to just not work!\" \n\nIt was then that I realized that my countrymen wanted to see me dead and we were not fellows to the same cause.",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "At the time I was screen shotting and saving as much as possible. Glad I'm not the only one.",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "meandthemissus",
                                                            "body": "I have the original trial data before the experimental vaccine was approved for emergency use that showed no reduction in deaths at all between the two cohorts.\n\nThe original clinical trial data for the Pfizer covid vax didn't even reduce death.  They couched this problem by saying two things: 1. of course we tested it on people less susceptible of dying from covid instead of the infirm, and 2. we were primarily testing in preventing symptomatic cases, not necessarily death.\n\nThey say \"not statistically significant\" but the raw numbers actually showed more deaths in the vaccine group:\n\n15 deaths occurred in the vaccine group.\n14 deaths occurred in the placebo group.\n\nThen after it was pretty much common knowledge that it neither stopped you from getting covid, nor stopped transmission the lie became \"well it prevents death though.\"\n\nI have a PDF of some of the data that showed that with omicron, taking the vax increased your changes of getting covid over the unvaxxed.\n\nALL OF THIS WAS IGNORED, AND WE WERE CALLED ANTI-SCIENCE.",
                                                            "score": 6,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "GoogleFiDelio",
                                                            "body": "I really wanted to make a digital archive of what everyone said and did so they  could be mocked and discredited for eternity. I was going to call it WikiQuack. \n\nBut I lack followthrough.",
                                                            "score": 5,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "GoogleFiDelio",
                                            "body": ">(fucking mandates were still in place in large cities until the Ukraine conflict finally kicked in.)\n\nI still think Putin deserves the Nobel Prize in medicine for stopping COVID.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Big-Hairy-Bowls",
                            "body": "Slowly, I began to hate them.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Smacpats111111",
                                    "body": "It wasn't all that slow for me",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "manupan",
                    "body": "In my case was the feminist speeches on the schools,\n\n telling all of us how bad we were for being men, with 15 years old...\n\nEdit: after that I discovered the liberty ideas and started hating the state, at that time in high school in my country, everybody should be a commie, to be cool",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "lone_jackyl",
                    "body": "This.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "meandthemissus",
                    "body": "Covid woke up so many people.\n\nWait, the governor just unilaterally declared restaurants are now closed and [you don't have a right to do business, even online](https://newjersey.news12.com/police-interrupt-business-owner-as-she-was-selling-items-on-facebook-live-42155935)? WHAT THE F",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "NOIRQUANTUM",
            "body": "I remember being called a far right extremist because I disagreed with gender transition surgeries on minors, kids being in lgbt pride parades(my mom ,who is very left leaning, agrees with this statement) and being pro gun. Imagine being so bigoted that you label everything you disagree with as \"far right extremism\" and \"nazi\"\n\nOn r/politicaldiscussion , I was accused of spreading propaganda when I criticized both Biden and Trump. They were ok with me criticizing Trump but when I did the same to Biden, it is propaganda. And they call MAGA a cult.",
            "score": 45,
            "replies": [
                {
                    "author": "Great_Opinion3138",
                    "body": "I mean you can watch videos of Obama and Clinton a decade ago and they said a lot of what trump is saying about immigration and government waste etc",
                    "score": 27,
                    "replies": [
                        {
                            "author": "NOIRQUANTUM",
                            "body": "Facts. It was ok when Obama mass deports illegals. But when Trump does it, it's racist and fascist. Wait until they hear about what Joe Biden said about guns or gay marriage. \"Marriage is between man and a woman\"",
                            "score": 9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "GoogleFiDelio",
                    "body": "The funny thing is that due to the absolute control they have over culture they have no idea why their hateful little coalition is constantly shrinking as more people nope out. \n\nThey have no theory of mind of anyone who disagrees with them on anything since they're never exposed to competing worldviews.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "NOIRQUANTUM",
                            "body": "Very true indeed. Reddit's reaction after the 2024 election proves it all. They banned/villainized/targeted anyone that slightly disagreed with them on anything (including minorities, young people, etc.); they made an echo chamber, and then they based the overall worldview on the echo chamber that they created, effectively disconnecting themselves from reality. Then when reality bursts their delusion bubble, they wonder why most people, including the demographics that once supported them, are abandoning them in droves.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "thesauciest-tea",
                    "body": "I was saying Russia invaded Ukraine due to NATO expansion and got called a MAGA imbecile. So I posted a wikileak cable from 2008 saying that Russia was concerned about NATO expansion into Ukraine. Got told wikileaks is a Russian puppet and that I'm projecting when I said they can't accept evidence in front of their face.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "NOIRQUANTUM",
                            "body": "At this point, even if Trump cures cancer and ends world hunger, people here are gonna be talking about how cancer and world hunger are beneficial for the world.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "sedtamenveniunt",
                            "body": "Why aren’t they concerned about NATO expanding into Finland?",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "dutchman76",
                                    "body": "What makes you think they aren't ?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "sedtamenveniunt",
                                            "body": "They did nothing about it.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Peyton12999",
                    "body": "It's all just a way for them to feel righteous about their hatred. If you label those who disagree with you as evil people, then you have no reason to believe you're wrong in your views or your hatred towards them.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "ned_rod",
                    "body": "Isn't MAGA a cult?",
                    "score": -1,
                    "replies": [
                        {
                            "author": "NOIRQUANTUM",
                            "body": "It's a political movement just like gay rights, feminism, metoo etc. The term \"Make America Great Again\" was originally used as a slogan in Ronald Reagan's campaign. Trump revived it for his 2016 presidential campaign which then eventually became a movement thanks to his popularity",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "GoogleFiDelio",
                            "body": "Nah, they're just a political movement. Trump fans aren't burning themselves to death outside the Israeli embassy for TikTok likes.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "HairyTough4489",
            "body": "I am indeed a radical anti-statist.\n\nFirst it was the government forcing my dad to tear the home he had built for some bullshit reason. Then a decade later Covid finished the job.",
            "score": 5,
            "replies": []
        },
        {
            "author": "DeltaSolana",
            "body": "Nah, lol. I am radicalized. \n\nI'm further right than any Republican could ever hope to be. I see them as basically socialists with a boring conservative coat of paint.",
            "score": 5,
            "replies": [
                {
                    "author": "SuperMarioMiner",
                    "body": "Based",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "JohanMarce",
            "body": "Let’s not act like anarcho capitalism isn’t radical",
            "score": 10,
            "replies": []
        },
        {
            "author": "vegancaptain",
            "body": "Yeah, I'm getting so many \"you're an ancap?? The you must believe \\[insert insane take on any topic\\]\". As if they're being fed what other people believe and have never actually talked to one. \n\nI guess this is what Hassan and Vaush types are doing, feeding, constantly, what to think and reinforce their narrow world view.",
            "score": 3,
            "replies": []
        },
        {
            "author": "TightestLibRightist",
            "body": "Uvalde PD radicalized me",
            "score": 3,
            "replies": []
        },
        {
            "author": "Zealousideal-Skin655",
            "body": "ANCAP has been around for a while.",
            "score": 2,
            "replies": []
        },
        {
            "author": "SmokeyJoeReddit",
            "body": "Ironically that's me but the otherway around, I used to be called a conservative but now I get called a radical leftist and literally none of my opinions on government changed",
            "score": 2,
            "replies": []
        },
        {
            "author": "boredsomadereddit",
            "body": "Last doesn't work as they just don't believe it and double down.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Chr1st_1s_K1ng",
            "body": "Leftists radicalized me",
            "score": 1,
            "replies": []
        },
        {
            "author": "LookAtMyUsernamePlz",
            "body": "Uh, is anarcho-capitalism not a radical ideology?",
            "score": 1,
            "replies": [
                {
                    "author": "ExcitementBetter5485",
                    "body": "No, individual freedom to voluntarily choose how to live your life is anything but radical.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "xSparkShark",
            "body": "This sub is cooked, just low effort conservative memes nowadays.",
            "score": 1,
            "replies": [
                {
                    "author": "General-Priority-757",
                    "body": "fr",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ncdad1",
            "body": "Nazis used to be bad",
            "score": -1,
            "replies": [
                {
                    "author": "majoroutage",
                    "body": "Nazis are still bad.\n\nBeing brainwashed into calling anyone you disagree with a \"Nazi\" does not make it true, though.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "ncdad1",
                            "body": "I think the swastika gives them away.\n\nhttps://preview.redd.it/wkpd6gkn3fke1.jpeg?width=1359&format=pjpg&auto=webp&s=c1208705ca66b3dafaa4b1e6d493b16010d3392b\n\n,",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "majoroutage",
                                    "body": "Who is \"them\" though? Are the Nazis in the room with us right now?\n\nIf you actually think we're defending Nazis here, you can loop right back to my statement about brainwashing. Authoritarianism can suck my left nut.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "ncdad1",
                                            "body": "Let's start with \"them\" being the guys in the picture. or this one.  \n\nhttps://preview.redd.it/r1vwcjrn6fke1.jpeg?width=1800&format=pjpg&auto=webp&s=b7d071cc16d93c9c8a3464c71a765dc76ce10b19",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Great_Opinion3138",
                    "body": "Nazis are bad. But they seem to be 99.9% Muslim immigrants on the left not the right and being openly supported by the left. Also the left labelling everyone a Nazi really undermines our ability to deal with actual Nazis.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "ncdad1",
                            "body": "I have no idea.  I posted people marching with Swastikas above, and they appear to be the standard white guy, but I don't know what religion they profess when the photo was taken.  I think people who fly Swastikas and call themselves Nazis should be categorized as Nazis.  It is that simple.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "majoroutage",
                                    "body": "Your disingenuous bait posts are funny. Nobody is believing your act that you really only meant people waving Swastikas.\n\nAlso, Islam is huge in the Caucasus regions. You know, where the term \"Caucasian\" come from. Now you know.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "mikeewhat",
            "body": "Yeah, but you guys are just wrong unfortunately. Do you think you can afford to pay for an ambulance or roads or anything like that?",
            "score": -16,
            "replies": [
                {
                    "author": "ExcitementBetter5485",
                    "body": "> Do you think you can afford to pay for an ambulance or roads or anything like that?\n\nWell yea, who do you think pays for those things in the current system?",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "manupan",
                    "body": "Pizza Hut will do, nobody want their pizza ruined because of holes in the road",
                    "score": 6,
                    "replies": [
                        {
                            "author": "mikeewhat",
                            "body": "It's interesting that no one has bothered to actually debate me on the crux of my argument which is an anacho capitalism provides no means for people to access the public services that we take for granted. I'm interested in the idea but I don't see any way that it could possibly work unless you are Elon Musk. One day for us maybe but I could never accept being the only one that has a firefighting service and ambulance and a personal police force",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "Toxcito",
                                    "body": "No one wants to debate you because your criticism is very unoriginal and has been answered a gorillion times before, you took zero effort at acquiring a basic understanding of the theories or tools. Hell, your question can be answered in a dozen different beginner level books, some of which aren't even anarchist, just common sense. There is absolutely no reason for anyone to debate you here, you don't even have a basic understanding of the subject, it would be like talking to a baby about physics. \n\nJust go read a few books, and when you want to debate *why* or *how* theories will be implemented, then people will debate you. Start off with something easy like Economics in One Lesson by Henry Hazlitt, then try something like Market for Liberty by Linda and Morris Tannehill to get some theoretical examples of how a free market could be implemented to handle complex infrastructure. From there, a good place to go would be Machinery of Freedom by David Friedman, son of Milton Friedman, to get more answers to more common criticisms.\n\nUntil you do that, it's just a waste of time to answer your questions. Do your own research first.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "mikeewhat",
                                            "body": "This sounds like trying to ask questions of a Marxist about their worldview. Horseshoe theory",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "Toxcito",
                                                    "body": "You should read Marxist and other Anarchist theories too, I highly recommend reading Bakunin, Camus, Tolstoy, and Kropotkin. \n\nIf you are too ignorant to expand your knowledge beyond your tiny peanut brain box, people will never take you seriously. This is why people ignore your questions or just call you names. Put on your big boy pants, pick up some books, start learning and stop being a dumb ignorant fool.",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "mikeewhat",
                                                            "body": "Well, thanks Man. Seems like those books really worked for you then! I definitely would like to be more learned like you are",
                                                            "score": 2,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "mikeewhat",
                                                            "body": "I'm not American bro",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Toxcito",
                                                                    "body": "I wasn't born in the US either, so what",
                                                                    "score": 6,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Banned_in_CA",
                                                                    "body": "Bad faith arguments and AmericaBad, name a more iconic duo.",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "mikeewhat",
                                                                            "body": "Anachocapitalism and thinking you are smart, without actually having an ideology that makes any sense, name a more annoying duo. i'm sure you will be great after the world collapses and everyone is in their little commune Doing whatever you think that is gonna happen, but you will realise that you can no longer rely on the Third World to provide your goods and you're going to have to make it all yourself.",
                                                                            "score": -1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "mikeewhat",
                                                            "body": "This guy is assuming I don't read",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "Toxcito",
                                                                    "body": "Im assuming you havent read any of these political theories based on your very bad, very boring, very unoriginal questions that have already been answered by entry level books.\n\nIf you criticise something without even reading the most basic entry level literature, then you are probably a moron.",
                                                                    "score": 6,
                                                                    "replies": [
                                                                        {
                                                                            "author": "mikeewhat",
                                                                            "body": "I think anarchism in itself is inherently flawed. I think the idea of communism is flawed. I think the idea of capitalism is definitely flawed. I don't see how any of these ideas can come together to something that we all agree on without someone imposing it on us. \ni've read sufficiently to have an educated opinion and I don't need to read the exact books that some unnamed person from some unnamed country has decided that is the gatekeeper of a conversation about these concepts. \nKeep schooling everyone with your smartness and you definitely will do well in the world. You seem to be making friends everywhere you go.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Toxcito",
                                                                                    "body": ">I think anarchism in itself is inherently flawed. I think the idea of communism is flawed. I think the idea of capitalism is definitely flawed. I don't see how any of these ideas can come together to something that we all agree on without someone imposing it on us. \n\nWell, if you would actually read the books, you would find out that most of us agree with you. Empirical data is inherently flawed, which is why ancaps favor praxeology, a sort of logic based system at the margins of every individuals actions. There is absolutely no such thing as a perfect system, there are only trade offs, so we generally aim to put those decisions of what trade offs should be made to the individual.\n\n>i've read sufficiently to have an educated opinion and I don't need to read the exact books that some unnamed person from some unnamed country has decided that is the gatekeeper of a conversation about these concepts. \nKeep schooling everyone with your smartness and you definitely will do well in the world. You seem to be making friends everywhere you go.\n\nIf you refuse to read certain ideas, you can never be fully informed - this is what we call ignorance. You are not sufficiently informed, you are ignorant to most of the opinions which are available in favor of the ones you have been programmed and forced to choke down.",
                                                                                    "score": 5,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "mikeewhat",
                                                                                            "body": "I will do my best to look into some of those books that you suggested. I have a giant reading list already as I imagine you do as well but I will try and prioritise at least some of the ones that you suggested. Thank you for engaging in good faith and all the best for the future, I may come back to continue to test ideas with you.",
                                                                                            "score": 2,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "LibertyFive3000",
                                    "body": "Because it was such a low effort pseudo question that nobody is going to give your bad faith troll post the time of day. Continue being smug and ignorant elsewhere or engage in a genuine way. ",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "mikeewhat",
                                            "body": "I kinda see your point, though. Don't ban me cause I want to hear what you guys think. I genuinely want to understand how our views could be so different and I take your point. I probably went about it the wrong way if that is what I was looking to do which I genuinely am.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "mikeewhat",
                                            "body": "Still no response though? It's all good. I didn't expect anything more from you guys. I never see any actual discussion here just Memes.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "LibertyFive3000",
                                                    "body": "Lmao, no, I was unable to respond in the four minutes between your posts. I am not chronically online and I work. Post in the marxist or anit-work subs if you want immediate responses from people with literally nothing going on in their lives. \n\nPeople here routinely engage in discussions with dissenters and take time to explain things. Though, if you show up with a completely bastardized straw man version of the views and parade how little you've tried to understand it by learning on your own, don't feel entitled to having your hand held while someone explains it all to you. Reddit is astroturfed beyond reason and the 2% of subs not overrun with psychotic leftist bullshit get overrun by psychotic conservative bullshit. This is one of like 2 subs where liberty focused people can congregate and discuss stuff without it getting socially nuked by hysterical people who haven't had an original thought in their life. \n\nThe issue is that you haven't properly defined anarchism. It is not abject lawlessness and every man for himself - though some here may prefer that flavor of anarchism I think it's a bit naive. Most would define it as a system that eliminates institutionalized coercion or authority. This doesn't mean institutions cannot exist, it means they'll cease to exist once they stop serving the people who make them up and they'll never come into existence through the use of force. As one person responded: there is an incentive for private companies to develop and maintain things like roads. People organize without government direction all the damn time. When your capital cannot be raised through theft (taxes) but instead has to be earned through delivering a product or service people voluntarily support or use, you will out perform the institution running on theft 100% of the time. \n\nFor what its worth, I'd wager most folks here would happily accept concessions short of privatizing all the roads. Whats bewildering is that people who desperately want to reject an-caps, libertarians, minarchists, etc. all jump to what they perceive to be the most painful part of the switch as if they were irreplaceable by a more efficient private sector (mind you, the private sector is contracted to build the roads) or as if we'd have to give up 100% of those things. Lets keep your dream of still letting some small government inefficiently build the roads... can you see how there are other parts of the government we absolutely do not need?",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "mikeewhat",
                                                            "body": "Thank you for your response. I do appreciate it. My snarky response was based on my perception of where your one was coming from.\nI am interested to learn more. \n\nWhat I can't get past is The truth that you seem to hold dear, that it appears that a lot of the capitalism part of this way of thinking is built upon, is the concept that the private sector is more efficient. I don't believe that that's the case. I would argue that the private sector works towards Monopoly, and the conditions of a free market has never really been experienced as it's not A level Playing Field.\n\nEven if we were remove all sorts of reasons why one person or group of people might have a advantage of others, even the concept of something like a Saudi Arabia finding a vast natural resource that happens to fall within their area of control, would give them an unnatural Advantage, making it very difficult to maintain a flat hierarchy",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "LibertyFive3000",
                                                                    "body": "So, remember \"the private sector\" includes all sized businesses. The dramatic majority of which absolutely do not pursue a monopoly of any sorts. The huge corporations which do are generally achieving that via special interest policy which is written on their behalf after they lobby our politicians. So for the sake of the thought experiment lets pretend they were all nefarious and driving toward regulatory capture that allowed their monopolies... how do they achieve that without government intervention barring competition from entering the field?  \n\nI don't think people here will say we've had any semblance of the free market we want for a long time if ever. \n\nWhere did this notion of fairness and equality come into the discussion? Friend I think you're making the common mistake of confusing the definition of \"equality.\" Equality means equal rights and equal value of a life. That is equality everyone here agrees with and supports. \n\nNot the bastardized and politically weaponized childish notion of equality which has come to mean \"equal opportunities\" or even more asinine \"equal outcomes.\" I'll give you the benefit of the doubt you're not 14 years old and thinking the government can provide equal outcomes for people who are making unequal decisions and taking unequal actions... but lets say you fell for the first bait and think \"equal opportunities\" is something we achieve through regulation... Who is the arbiter of what's equal? Our government which is made up of the same type of people who work at the DMV? How well have the police applied equality in their actions? How exactly do we quantify or qualify the equalness of opportunities? If I come from a household with a single mother how do we (the government) ameliorate the advantage you have coming from a two parent household and should we? Where does it stop? What if I'm ugly and unpleasant while you're handsome and charming? You'll have far more opportunities than I will. What laws should we write to fix that? \n\nHopefully you get the point. Meanwhile the folks here think the system they endorse provides the greatest opportunities to the widest spectrum of people and it doesn't discriminate in anyway. \n\nEthically it's a great social goal to help lift people up in severely disadvantaged positions, but nobody should be forced to do that, especially not through law. And the government will be wholly ineffective in executing on that no matter how much of our money they waste trying to do so. \n\nBasically it's a propagandistic tool to have folks like you convinced that folks like us don't care about less advantaged people having opportunity. We do. We just think the system you want is exactly the wrong way to get there and it fucks over everyone else along the way. \n\nIf Saudi Arabia has oil and (pretend) we don't, then we buy oil from them or someone else who will sell it to us, we develop other energy sources, we don't inhabit parts of the world with no resources to sustain life, and we get good at producing something else to create value we can trade with. But Saudi Arabia didn't get their oil through theft so why the hell would anyone else have a right to it? Otherwise, what? We go and \"liberate\" those nations who have things we want so we can disseminate them as we see fit? Ya I'm not keen on being world police or being the global hegemony invading other countries.",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Ladzilla",
                                    "body": "I have answered this a bazillion times.\n\nPeople pay for the services privately and people do not realize how much money is caught up in the public government system.\n\nAs a community, a highway being built may be deemed beneficial. Assuming a private company owns the road(s), you must pay to use the roads. If you use the roads and do not pay, that will be enforced by the private company that is employed by the road company.\n\nIf I or you disagree with something that a private company is doing, it is simple as withdrawal of payments and using an alternative service.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "mikeewhat",
                                            "body": "So there will be many roads beside each other going to the same destination will there?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Ladzilla",
                                                    "body": "In this ideology, I understand that public systems can be complicated for substitution. \n\nNo, 1 private company will likely maintain the roads for a certain amount of time or in the case you said, someone owns the road. There are many right ways to go about this.\n\nLet's say that company A begins to drop the ball on road maintenance over their fixed term 1 year contract. The following year, company B wins the contract by the people paying for using the roads as they have more confidence in their abilities. A community contract system is most likely the way residential roadways will be maintained. People who paid for road use, will elect the company to maintain their roads. People within the community may use the road under a yearly payment, however people outside that community may be tolled to enter. There is large incentive for the company to do a job conclusively, as it is potentially lucrative. Yet, as there is such great competition, they have to be quick to resolve any problems.\n\nLarge highways are likely privately owned privately. For example, a cross country highway is built privately. The highway company owns the land the highway is built on also.  The highway is tolled as such. If this company starts to increase prices and demand goes up. An alternative route may be constructed by a different company with a lower price. The original company adjusts their price as they lose some business.\n\nThe point is, there is extreme competition to produce a good service or product. The people are given large power to influence who is in control of what, not the government.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "mikeewhat",
                                            "body": "What happens if I'm the Tonga of the community? If you don't know Tonga used to dominate all the neighbouring islands and rock up in their war boats, and even intimidating wall like communities like Fiji were completely at their whim. In your utopia, the strongest military force would dominate the world completely",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "kurtu5",
                                                    "body": "> What happens if I'm the \n\nstate",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "mikeewhat",
                                                            "body": "Exactly",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "kurtu5",
                                                                    "body": "so the worst case is the status quo?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "mikeewhat",
                                                                            "body": "No I’m saying that there needs to be an enforcement mechanism, to combat tyranny if it’s going to be possible to achieve a flat non-hierarchical system.\nMaybe AI powered robots enforcing laws agreed by everyone but that seems a way off still and a wouldn’t trust it not be hacked or start making paper clips or something ",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "kurtu5",
                                                                                    "body": "> enforcement mechanism, to combat tyranny\n\nand your idea is a monopoly on force is the only way.  we beg to differ.",
                                                                                    "score": 2,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Ladzilla",
                                                    "body": "The military and protection system is funded by the will of the people, unlike today where it is decided by the government.\n\nIf the tonga community is throwing money at private military company A because they are warmongering, then so be it. That is the will of the people.\n\nIf the tonga community see private military company A warmongering and are unhappy with what they're doing. They instantly pull funding and opt for company B, which aims to only provide invest in protections and defense to the community.\n\nJust like today's contracting, even if company A provides a great service, it does not make sense to fund them 100%. You may provide 70% to company A and then 30% to company B in case company A screws up.\n\nI guarantee you, most wars are started by higher ups, not by the will of the people. Politicians don't go to war, the people do.\n\nYou are correct in saying the military with the most strength will have the most control. However, without money they will have no control. Imagine if Lockheed Martin was receiving $2 million per day and all of a sudden they decide to invade Germany. Then the next day, everyone who disapproves, pulls funding from Lockheed Martin. Maybe they only receive, $100,000 per day, not enough to keep a war moving that's for sure. How does Lockheed pay their employees? They can't, the employees stop working for Lockheed.\n\nFURTHERMORE...\n\nLet's say I live in a different country and disapprove of the actions taken by the Tonga people. Contract company A determines an internal survey to the people funding it whether they should intervene. If the answer is overwhelming yes, then they will perform those operations.\n\nThis is the only ABSOLUTE way to determine what people want. People need absolute control of their money to vote with what they want in their society.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}