{
    "title": "Red Pilling",
    "author": "None",
    "subreddit": "Anarcho_Capitalism",
    "rank": 183,
    "score": 264,
    "upvote_ratio": 0.78,
    "num_comments (reported by reddit)": 131,
    "url": "https://v.redd.it/xhznphczypke1",
    "id": "1ivmy2t",
    "selftext": "",
    "comments": [
        {
            "author": "Scipio_Columbia",
            "body": "Didn’t mention taking Crimea…",
            "score": 61,
            "replies": [
                {
                    "author": "IncomprehensibleAnil",
                    "body": "Sevastopol in Crimea was Russia’s only warm water port. The only port that wasn’t frozen over in winter.\n\nRussia had taken Crimea from Turkey before the US gained independence from Britain, and the Soviets had given it to Ukraine in the ‘50s to quell internal tensions. After the dissolution of the USSR in the ‘90s, Russia leased the port from Ukraine.\n\nAfter the US-backed coup in 2014 that installed a NATO friendly government in Ukraine over the Russian friendly one, Ukraine terminated Russia’s lease on the port. So Russia took Crimea in 2014 to maintain the strategic port. Bloodlessly, as it happens. Or almost. One person may have been killed. It’s not clear.\n\nAlso at the time, the Donbas region sesceded from Ukraine and tried to join Russia. Russia said no, and the resulting war of independence killed about 50,000 people before Russia invaded.\n\nEdit:\n\nRussia invaded because Ukraine announced its intention to take back Crimea and Russia needed to shore up its position in Crimea.",
                    "score": 23,
                    "replies": [
                        {
                            "author": "serious_sarcasm",
                            "body": "Wow, breaking fucking news. Russia commits atrocities to gain and maintain access to a warm water port. \n\nCongratulations, you’ve made it through an Intro to Western Civ II class.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "IncomprehensibleAnil",
                                    "body": "Yes.\n\nThe interesting part is the US motive for trying to take away that port.\n\nYou can look that up for yourself, though. You’re boring to talk to.",
                                    "score": 20,
                                    "replies": [
                                        {
                                            "author": "ParticularAioli8798",
                                            "body": "They support Ukraine. Maybe they don't quite understand Anarcho Capitalism.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Scipio_Columbia",
                            "body": "\n Port=/=  all of Crimea",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "IncomprehensibleAnil",
                                    "body": "Look at a map. It’s a lot easier to hold the entire peninsula than just the port.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Scipio_Columbia",
                                            "body": "Comrade, my response demonstrates that I know the map. Your response demonstrates where your sympathies lie.",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "IncomprehensibleAnil",
                                                    "body": "Enlighten me.",
                                                    "score": 0,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "WindChimesAreCool",
                                                    "body": "Crimea is Russian and it will continue to be Russian. Cry about it.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Cixin97",
                                                    "body": "Okay wait I know nothing about this topic but how does your comment demonstrate that? I’m looking at the map and can see what the other person is saying (not that what Russia is doing is right)",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Scipio_Columbia",
                                                            "body": "Russia seeks more easily defensible borders, look at Google maps on terrain setting in this part of the world. In orders to do this it must move its border westward by several hundred miles. If all it wanted was a port, it would negotiate/take the port. It wants all of Ukraine, as would any rational actor.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Adonisbb",
                                    "body": "Crimea has no fresh water. Water has always been diverted from the Dnieper to supply Crimea and Ukraine was slowly throttling the flow. Ultimately that is what forced Russia to officially invade. Crimea is barren without fresh water.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Scipio_Columbia",
                                            "body": "Maybe P-baby should have thought of that before sending in his little green men.\n\nIn seriousness- you are claiming that Russia, after illegally invading another country, found it frustrating that the country they invaded denied them fresh water. This frustration/expense of procuring fresh water in the illegally invaded territory of Crimea was such that Russia was forced to invade Ukraine?",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "denimdan1776",
                            "body": "You just said it was given to Ukraine in the 50’s. Russia doesn’t get to go oh wait that’s actually mine 60 years later. Yes there have been some internal tension since then but that doesn’t justify a unilateral take over of an area. We should have kicked Russias ass in 2014. “Oh no the anti Russian government took over” yeah probably bc Russians have been ethnically cleansing the Urkraine since before WW2. Oh no an anti British government took over the colonies. No shit",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Cixin97",
                            "body": "Why did they say no and then fight Donbas? How does something like that even work? How does a region try to join a country that doesn’t want them?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "FoxtrotMikeLema",
                            "body": "\"Oil, gas, oil, gas nahm nahm nahm let Russia take all the land with oil and gas\" that's what you sound like.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "IncomprehensibleAnil",
                                    "body": "Where did I say anyone was right or wrong?",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "FoxtrotMikeLema",
                                            "body": "You technically didn't.  If you truly aren't writing justifications for Russia to take and fight over land with oil and natural gas in it then I'm sorry.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Mr-no-one",
                    "body": "The US has the opportunity to do the funniest thing ever if the UK gives that little island to Mauritius and they tell us that Diego-Garcia’s lease is terminated.\n\nI give 10:1 odds the US does whatever it thinks is necessary to keep that base.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Creative-Leading7167",
                    "body": "Yes, he didn't mention the russia took over land that 90% of the people wanted to be taken over by russia, even according to western media. How terrible!",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Scipio_Columbia",
                            "body": "You are right. No one has any reason to doubt the results of that election, nor any Russian elections.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Creative-Leading7167",
                                    "body": "Did you miss the part about \"even according to western media\"? Are you literate?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Scipio_Columbia",
                                            "body": "I’m not. I’ve been typing off of vibes only",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Lode_Star",
            "body": "Didn't Russia also promise not to invade Ukraine in exchange for their nuclear arsenal?\n\nOr perhaps there's a convenient excuse for Russia breaking its promises.\n\nAlso, are the countries around Russia sovereign or not? Are they only allowed defense pacts if Russia permits them? \n\nWouldn't it be too convenient to claim that every country that wants to join NATO is because of CIA interference?\n\nI'm guessing I'm not supposed to ask these questions.",
            "score": 75,
            "replies": [
                {
                    "author": "mesarthim_2",
                    "body": "Well, let me explain it to you.\n\nSo. When US does things, that's bad, because US is bad.\n\nAnd when Russia does things, that's good and perfectly justifiable, because US is bad, ok?\n\nAre we clear here?",
                    "score": 33,
                    "replies": [
                        {
                            "author": "CallMeCasual",
                            "body": "What if… both US and Russia do bad things? The key to good propaganda to push any side of an issue is that there is some truth present and the other side(s) are not presented or presented as a straw man.\n\n“Even in Stalin’s time there was collective leadership. The Western Idea of a dictator within the Communist setup is exaggerated. Misunderstandings on that subject are caused by lack of comprehension of the real nature and organization of the communist power structure” - The fucking CIA [source](https://www.cia.gov/readingroom/docs/CIA-RDP80-00810A006000360009-0.pdf)\n\nThat is certainly not what our government publicly said about the Soviets lol\n\nWe all already know how violent and aggressive Russia can be and they did start the war, not including more details for sake of length of comment.\n\nThe US and Russia can be aggressive and underhanded to each other. It’s more the reality of the situation. Aggressive empire vs aggressive empire",
                            "score": 14,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "forever2100yearsold",
                    "body": "A nation's \"sovereignty\" only exists to the extent that the state can wield power to defend its territory. Sovereignty isn't a mystical moral force that lingers over a section of land. Individuals are sovereign and states lay claim to that by virtue of ruling over individuals by force.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "serious_sarcasm",
                            "body": "Fuck, you’re supposed to lick the boot, not deep throat it till it’s kicking your ass.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Lode_Star",
                            "body": ">A nation's \"sovereignty\" only exists to the extent that the state can wield power to defend its territory.\n\nSo nations would join NATO to safeguard their sovereignty? That makes sense.\n\n>Sovereignty isn't a mystical moral force that lingers over a section of land.\n\nI appreciate that you'd let me know this little bit of wisdom, but can I ask if it's related to something I said?\n\n>Individuals are sovereign and states lay claim to that by virtue of ruling over individuals by force.\n\nYes.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ParticularAioli8798",
                    "body": "How does any of this address the points made in the video?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Lode_Star",
                            "body": ">posts a video about \"NATO expansion\"\n\n>gets a question about \"NATO expansion\"\n\n>\"but how does this relate to the video?\"\n\nYou must be highly regarded.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "ParticularAioli8798",
                                    "body": "You're asking plainly rhetorical questions. You don't seem to be stupid. Maybe you are. I don't know.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Lode_Star",
                                            "body": ">You're asking plainly rhetorical questions.\n\nSo they did relate to your video? You just needed a little more thinking time? \n\nAlso, it's not all rhetorical. If you state that the nations surrounding Russia need Russian permission to join defense pacts, it is reasonable to ask if they are sovereign, no?\n\nWhy would you say it doesn't address the video?\n\n>You don't seem to be stupid. Maybe you are. I don't know.\n\nEvery accusation is a confession. Maybe do your thinking time before you post?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "ParticularAioli8798",
                                                    "body": "\"relate to\" is not the same as \"address\". \n\n>Why would you say it doesn't address the video?\n\nBecause it doesn't. You know what you're doing and you still won't admit it. Why you waste time here is anyone's guess. Just put it out there already. What's your point? Out with it! \n\n>Every accusation is a confession. Maybe do your thinking time before you post?\n\n\"Accusation\". That's not what happened here. You should follow your own advice.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Lode_Star",
                                                            "body": ">\"relate to\" is not the same as \"address\". \n\nBut they do adress the question of sovereign nations.\n\n>Because it doesn't. You know what you're doing and you still won't admit it.\n\nIncredible ability to dodge criticism. Just say \"no\", is that your rebuttal?\n\n>Why you waste time here is anyone's guess. Just put it out there already. What's your point? Out with it! \n\nYou accuse me of wasting time, then pretend you don't know my point. Every accusation is a confession.\n\n>\"Accusation\". That's not what happened here. You should follow your own advice.\n\nYou claimed I may be stupid. Is this not an accusation? How disingenuous.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "ParticularAioli8798",
                                                                    "body": ">You accuse me of wasting time, then pretend you don't know my point.\n\nYou still can't actually get to the point. Just go away already. Bye! It's over. Fuck man do you do this with everyone?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Lode_Star",
                                                                            "body": ">You still can't actually get to the point.\n\nBecause I already stated it. The video claims that nations surrounding Russia are its vassels and can not independently create defense pacts. I questioned the validity of this statement, and you refuse to acknowledge it.\n\n>Just go away already. Bye! It's over. Fuck man do you do this with everyone?\n\nYou need to calm down man, you're having a reddit moment.  There's no need to get angry it's just a conversation.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "ParticularAioli8798",
                                                                                    "body": ">I questioned the validity of this statement, and you refuse to acknowledge it.\n\nWas that it? Your question is a point? Do I have to acknowledge a... question? You expect me to regard your measley question as anything other than a question? \n\n>You need to calm down man, you're having a reddit moment.  There's no need to get angry it's just a conversation.\n\nDo. You. Do. This. To. Everyone?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Lode_Star",
                                                                                            "body": ">Was that it? Your question is a point? Do I have to acknowledge a... question? You expect me to regard your measley question as anything other than a question? \n\nYou seem offended at the most basic functions of a conversation. Yes, usually people talking will ask questions in conversation, and they will be answered.\n\nIs this not how you talk?\n\n>Do. You. Do. This. To. Everyone?\n\nWhy. The. Period. After. Every. Word.\n\nPlease calm down. It was not my intention to upset you.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "ParticularAioli8798",
                                                                                                    "body": "Do you generally talk endlessly about nothing? Is this going to go anywhere anytime soon or are you going to continue to break down everything I say towards no real end?",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Lode_Star",
                                                                                                            "body": ">Do you generally talk endlessly about nothing?\n\nAnother accusation. It's interesting how I just ask you questions, and you dodge them with accusations.\n\n>Is this going to go anywhere anytime soon or are you going to continue to break down everything I say towards no real end?\n\nYou originally responded to me, and I successfully refuted your claim that my comment didn't have a point. I posed a question to you which you couldn't answer.\n\nThen you lost your temper, made multiple accusations, and claimed I was talking about nothing, which you were actually guilty of doing.\n\nEvery accusation you make is a confession.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "ParticularAioli8798",
                                                                                                                    "body": "No real end, then.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Lode_Star",
                                                                                                                            "body": "No accountability, can't say I'm surprised.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "adelie42",
                    "body": "Those are great questions. That video is just basic bitch history that requires living under a rock to ignore. You want to do a full audit of the receipts, check out Provoked or Martyr Made podcast. Have them both, fine, just check their sources.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Lode_Star",
                            "body": ">That video is just basic bitch history that requires living under a rock to ignore.\n\nI'd really like to know what you mean by this?\n\n>You want to do a full audit of the receipts, check out Provoked or Martyr Made podcast. Have them both, fine, just check their sources.\n\nPersonally, how does it feel to defer to podcasts rather than being able to answer the questions yourself? \n\nI'm curious because I would feel like if I couldn't articulate answers myself that I would have nothing of value to add to the discussion.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "adelie42",
                                    "body": "How does it feel knowing people that actually do high quality research and provide sources to their claims to give a comprehensive  view of issues, even if I don't necessarily agree with their policy recommendations? Feels like a necessary foundation thinking about issues in a comprehensive way rather than just trying to keep up on the approved opinion of the day with less depth than a bumper sticker.\n\nTaking an example of something that isn't the outrage of the day, the approved narrative is \"bin Laden bad man attack America kill people. Must get bad man save America. Something something Sudan Hussain\" the TV people repeat over and over, a little understanding of bin Ladens integral role, on the side of the US in the foreign policy ambitions under Carter bring a lot of depth to the situation WITHOUT justifying or excusing anything bin Laden did.\n\nNow coming back to the present situation, I have never been to Ukraine, and I didn't participate in the Orange Revolition or the Revolution of Dignity. It also isn't my area of expertise where I am going to write a textbook personalized to you on Reddit. But I do know people who have done that work and I have read some of their books and know there is more to it than \"Ukraine great democracy and Putin bad\". Having some depth of understanding and the humility to know what the good sources are to inform yourself is humble. Talking as though I wrote the books would be absurd.\n\nIf this is completely new information and looking for motivation to look a little deeper, that's a great reason to be having this conversation. But when people say, \"but the TV man said...\", I know with respect to effort/reward, you or I can only point people in the right direction.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Lode_Star",
                                            "body": ">How does it feel knowing people that actually do high quality research and provide sources to their claims to give a comprehensive  view of issues, even if I don't necessarily agree with their policy recommendations?\n\nDid you read this before hitting send? It doesn't make much sense when you read it out loud...\n\n>Feels like a necessary foundation thinking about issues in a comprehensive way rather than just trying to keep up on the approved opinion of the day with less depth than a bumper sticker.\n\nJust like how recommending podcasts is a vapid response rather than writing your own opinions. If you honestly \"thought about issues in a comprehensive way\" wouldn't you be able to speak for yourself?\n\n>Taking an example of something that isn't the outrage of the day, the approved narrative is \"bin Laden bad man attack America kill people. Must get bad man save America. Something something Sudan Hussain\" the TV people repeat over and over, a little understanding of bin Ladens integral role, on the side of the US in the foreign policy ambitions under Carter bring a lot of depth to the situation WITHOUT justifying or excusing anything bin Laden did.\n\nUh okay.\n\n>Now coming back to the present situation, I have never been to Ukraine, and I didn't participate in the Orange Revolition or the Revolution of Dignity. It also isn't my area of expertise where I am going to write a textbook personalized to you on Reddit. But I do know people who have done that work and I have read some of their books and know there is more to it than \"Ukraine great democracy and Putin bad\". Having some depth of understanding and the humility to know what the good sources are to inform yourself is humble. Talking as though I wrote the books would be absurd.\n\nYou don't need a PhD to write a reddit comment, and deferring to others in such a low-level conversation only shows you're not confident with the subject in discussion.\n\nYes, others probably are more knowledgeable about this than us, but what is the point of saying that in a conversation if not to terminate further debate?\n\nLike, even if you had regurgitated something from one of these podcasts and made it your own, it would've had more value for discussion rather than just pointing to a source you deem to be an authority.\n\n>If this is completely new information and looking for motivation to look a little deeper, that's a great reason to be having this conversation. But when people say, \"but the TV man said...\", I know with respect to effort/reward, you or I can only point people in the right direction.\n\nBut how is pointing people in what you feel is the right direction any different from saying \"but the TV man said\"?\n\nIt's a non-argument.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "adelie42",
                                                    "body": "Take the recommendation or don't. I needed to take a big shit, so that's why you got a longer response. You're trying to spend currency you don't have.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Lode_Star",
                                                            "body": "I was honestly hoping for more paragraphs, but I can still get off to this.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "adelie42",
                                                                    "body": "I think we just came together ❤️",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "lostcause412",
                    "body": "https://a.co/d/eFzzC08",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "old_guy_AnCap",
                    "body": "If Ukrainian sovereignty is so absolute how can Britain and the US basically tell them not to negotiate terms for peace?",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Lode_Star",
                            "body": ">If Ukrainian sovereignty is so absolute\n\nPart one: You claim Ukrainian sovereignty is absolute. This has to be your claim as I wouldn't claim complete sovereignty to a nation with some of its territory occupied.\n\n>how can Britain and the US basically tell them not to negotiate terms for peace?\n\nPart two: You question your own claim.\n\nI'm unsure as to why you would do this.\n\nIf you want my opinion, efforts that require teamwork often require consensus.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "old_guy_AnCap",
                                    "body": "You question the level of sovereignty by asking \n\n\"Also, are the countries around Russia sovereign or not? Are they only allowed defense pacts if Russia permits them?\"\n\nWhile it is obvious they aren't truly sovereign when the US and Britain are dictating to them when and how they can negotiate.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Lode_Star",
                                            "body": ">You question the level of sovereignty by asking \n\n>\"Also, are the countries around Russia sovereign or not? Are they only allowed defense pacts if Russia permits them?\"\n\nThe video asserts that the nations surrounding (and other European nations) Russia joining NATO is a provocation to Russia, this implies that Russia does not see them as sovereign nations but as vassel states. This warrants the question. \n\nYou were the one who said Ukraine was completely sovereign, then you attacked your own strawman. \n\nCongratulations.\n\n>While it is obvious they aren't truly sovereign when the US and Britain are dictating to them when and how they can negotiate.\n\nSo Finland joining NATO was dictated by the US and Britain? Let me guess, you only want to discuss the context of Ukraine wishing to join NATO but not the membership of other nations, which the video claims as NATO expansion?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "BlueTeamMember",
            "body": "We kept our promise, we have not moved one inch toward Moscow. \n\nIt was all done in meters.",
            "score": 40,
            "replies": [
                {
                    "author": "adelie42",
                    "body": "It was all done in blood.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "BlueTeamMember",
                            "body": "Someone else's'",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "StuntsMonkey",
                    "body": "So that's what they mean when they say American imperialism?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Jester388",
                            "body": "Yes, sovereign nations exercising their sovereignty by joining a defensive pact against an actual imperialist country is what they mean by American Imperialism.\n\nWeird amount of Russia simps in here lately.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "StuntsMonkey",
                                    "body": "I was making a joke about English standard vs imperial measuring systems",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "BlueTeamMember",
                                            "body": "Subtle humor is not the wheelhouse for Reddit. Better off at a Wendy's",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "denimdan1776",
                                    "body": "The same shills for trump. They like dictators here",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "lostcause412",
                                    "body": "Just against US proxy wars and waistfull spending of taxpayers money. I don't give a shit about Russia or Ukraine",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ooofisa4letterword",
            "body": "The honest truth, I don’t care. Russia has always been a problem. Never trust a communist and always be ready to defend against them.",
            "score": 25,
            "replies": [
                {
                    "author": "Fortypayload883",
                    "body": "Agreed. And to add, joining NATO is voluntary. There is a reason Eastern Europe joined.",
                    "score": 23,
                    "replies": [
                        {
                            "author": "Ooofisa4letterword",
                            "body": "Right there. That’s why this “it’s Americas fault” is complete BS.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "mesarthim_2",
                                    "body": "But have you considered that America bad? Doesn't that change things completely?",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Ooofisa4letterword",
                                            "body": "Well, since you put it that way…",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Background_Maybe_402",
                    "body": "Agreed but our rulers created that beast so calling them the good guys doesn’t work either",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Will-Forget-Password",
            "body": "If my neighbor buys a gun, am I allowed to invade?",
            "score": 18,
            "replies": [
                {
                    "author": "MatiasUK",
                    "body": "Are you crazy!? They have a gun..",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "SopwithStrutter",
                    "body": "According to some of our elected officials, yes.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "adelie42",
                    "body": "These shallow analogies ignoring the historical details is the whole point of the video.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Will-Forget-Password",
                            "body": "I am pretty sure the whole point of the video is to spread pro-russia propaganda.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "adelie42",
                                    "body": "Good citizen. Have a cookie 🍪",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Will-Forget-Password",
                                            "body": "Yoink!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "jamesbeil",
            "body": "And *why* did the eastern european countries want to join NATO? \n\nThese people *never* address that question.",
            "score": 3,
            "replies": []
        },
        {
            "author": "TinyTLB",
            "body": "Keyboard warriors giving their opinions on geopolitics\n\n![gif](giphy|7ziO8WTeXJCGZlq4mm)",
            "score": 3,
            "replies": []
        },
        {
            "author": "wiseknob",
            "body": "Well isn’t this cherry picked to the limbs. So this is sympathizing Russia but includes none of Russia’s contributions since the Cold War? Let’s not pull wool over here.",
            "score": 3,
            "replies": []
        },
        {
            "author": "jbbest666",
            "body": "yeah. agree with this alot but never forget putin is a horrible dictator.   assshole of the world.  never has a right to invade a sovereign country.",
            "score": 7,
            "replies": [
                {
                    "author": "gatornatortater",
                    "body": "No more than the US did.  \n\nHowever...  NATO countries and Russia are at war and it has been a hot war since 2022.  It was a cold war before then.    I think the next level would be nuclear.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Fortypayload883",
                            "body": "Its not though. This is a proxy war. A hot war between Russia and NATO would look so much different.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "gatornatortater",
                                    "body": "Fair enough... I guess a *warm* war, then.  Since there are many NATO soldiers in Ukraine under the pretense of being mercenaries in their free time.  And a hot war between those parties would become nuclear very very quickly.\n\nIn the past most of the proxy wars haven't been on any of the 2 major participant's borders and occasionally crossing over.  In my opinion, that is when it isn't all that \"proxy\" any more.  While it may be \"proxy\" for the USA, it certainly isn't for Russia.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Lagkiller",
                            "body": "> I think the next level would be nuclear.\n\nEven the maddest dictator wouldn't be able to pull off a nuclear launch.  They may give the order, but there are enough people that realize nuking a country only a few hundred miles from their border will kill them too.  It's why we've not had a nuclear war already.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "gatornatortater",
                                    "body": "They got the worlds biggest military funding and supporting a war that directly affects their sovereignty... not to mention the massive amount of their citizenry that have been killed by this.  It makes sense that they would think this is all about attacking them.  Its not like this is all about Ukraine.  They're just the latest \"proxy\".  I hope we're not forgetting all that Serbia/Kosovo craziness, NATO encroachment into eastern europe and especially Georgia where US \"trainers\" helped push them into actually invading Russia.\n\nI'd argue Georgia is what put them on edge and to be more proactive when NATO/USA pushed into Ukraine, although they did wait several years before reacting then.  They certainly seemed to have been caught off guard when the Georgia thing happened.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Lagkiller",
                                            "body": "> They got the worlds biggest military funding and supporting a war that directly affects their sovereignty\n\nWhich hasn't changed in 80 years.  And we didn't see nukes flying then either.  Also, Russia isnt the biggest, they're 3rd after the US and then China.  And that's a distant third, not a close one.\n\n>I hope we're not forgetting all that Serbia/Kosovo craziness\n\nAh yes, when Russia nuked the world....oh wait.\n\n>especially Georgia where US \"trainers\" helped push them into actually invading Russia.\n\nAnd where Russia nuked the world....oh, nope.\n\n>I'd argue Georgia is what put them on edge and to be more proactive when NATO/USA pushed into Ukraine, although they did wait several years before reacting then. They certainly seemed to have been caught off guard when the Georgia thing happened.\n\nGreat, they can be on edge all they want.  There is literally zero chance at nuclear bombs being sent off offensively.  There were much crazier people before Putin and they didn't push the button.  These people arent suicidal, and the people that work for them aren't either.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "gatornatortater",
                                                    "body": "> Also, Russia isnt the biggest\n\nThe USA is the biggest.  I think you misread.\n\n>  These people arent suicidal\n\nNo they aren't.  But when the other option is to be taken over, don't you think they will start feeling like they have a whole lot less to lose? Government people always seem to think it won't affect them, just look at all the things we have discussed that US government people have done.  Government attracts the kind of people that have more ego than good sense.\n\nWe've come extremely close before.  More than once.\n\nWhile \"those\" people may not be suicidal,  you have done a decent job of convincing me that you are suicidal, considering that you're denying this significant and obvious risk.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "Lagkiller",
                                                            "body": "> The USA is the biggest.\n\nYes, that is what I said.\n\n>No they aren't. But when the other option is to be taken over\n\nThat's not on the table.  No one is attacking them.  What you're saying is that they're going to launch nukes when not a single person has stepped foot on their soil.  The same argument was made during the cold war, and look, no nukes!\n\n>Government attracts the kind of people that have more ego than good sense.\n\nIndeed.  But governments don't launch nukes.  People do.  The order was received to launch nukes more than once during the cold war in error, and the commanders in charge refused.  The people in Russia are already against this war, their military is against this war, and you think that without a single soldier in their land those same people are going to launch nukes?  Come on man.\n\n>We've come extremely close before. More than once.\n\nNo, we really haven't.\n\n>While \"those\" people may not be suicidal, you have done a decent job of convincing me that you are suicidal, considering that you're denying this significant and obvious risk.\n\nNo, I'm denying your delusions and lack of historical literacy.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "gatornatortater",
                                                                    "body": ">  No, we really haven't.\n\nyet I'm the one with the delusions and lack of \"historical literacy\"?\n\nI guess you just don't see any of those close calls as being serious or that there is significant risk because you don't think Russia will defend themselves with all of their weaponry whenever someone over there with access decides they \"need\" to.\n\nPersonally... I don't see how the destruction of the world can not be seen as the biggest risk of all.  I don't think NATO should be playing this game.  Too many people have died as a result... and way way way too many more will likely die if they continue down this route.",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "mhx64",
                    "body": "No no, it's just a special military operation. Not an invasion.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "grizfiz",
            "body": "Bad op",
            "score": 7,
            "replies": []
        },
        {
            "author": "mesarthim_2",
            "body": "My rule of the tumb is that if someone is presenting a complex international relationship to you as if you're a child, you're being treated as a child.",
            "score": 9,
            "replies": [
                {
                    "author": "Bagain",
                    "body": "Sometimes it’s wise to listen like a child when your understanding is as limited as a child’s. If your ability to hear reason is limited by your ego, the only thing that equals your ego is your ignorance.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "mesarthim_2",
                            "body": "There's no reason being employed in that video.\n\nBut feel free to listen to daddy Vova explaining this to you. \n\nAdults normally listen to multiple perspectives and then make up their own damn mind.",
                            "score": -4,
                            "replies": []
                        },
                        {
                            "author": "Consistent-Dream-873",
                            "body": "If your metric for politics is I'm going to listen like a child and accept the simple black and white explanation, then you are already a useful tool and should back out of the discussion while you still have some grace left.",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "Bagain",
                                    "body": "If your going to assume your always the smartest person in the room, you’re chances of being so are slim. “Sometimes” is the heavy lifter here, let it do the work intended instead of making wild assumption to, not surprisingly, try to prove your right.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Consistent-Dream-873",
                                            "body": "Have you spent a lot of time around children?  They aren't very good at listening or critical thinking.  I think your point is just dumb in general.  You are assuming I think I'm smarter than I am but the reality is critical thinking and paying attention to details and being skeptical is a pretty basic thing to do and actual admits that I know I'm not as smart as a lot of people and that I need to pay attention to make sure I'm not being hoodwinked or manipulated.",
                                            "score": -5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "This_Caterpillar_747",
            "body": "The main Soviet Apologist",
            "score": 11,
            "replies": [
                {
                    "author": "SnooChipmunks8506",
                    "body": "Absolutely he is. \n\nThis is a very Russian skewed point of view. Nothing is mentioned about Russia putting missile in former Soviet bloc countries, threatening Western Europe, the GRU actions all over the world. \n\nBot countries suck, this games is about the biggest and meanest assholes getting the upper hand",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Glum-Championship794",
            "body": "Small problem, nato doesn't expand, nato is joined.",
            "score": 2,
            "replies": []
        },
        {
            "author": "DefaultWhitePerson",
            "body": "Oooh, now do Chechnya!  And Transnistria!  And Georgia!  I bet they're America's fault, too!",
            "score": 5,
            "replies": [
                {
                    "author": "Agitated-Can-3588",
                    "body": "There was a color revolution in Georgia.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "pointsouturhypocrisy",
                            "body": "And in Belarus, and 3 in Ukraine between 2008 and 2014 - all run out of the US state dept. Nevermind all of the other USAID/state dept coups/lawfare regimes that have destabilized the world over the last 50 years, keeping everything on the edge of chaos throughout our entire lives.\n\nIt's probably worth noting that less than a decade after the USSR fell, the US was in talks with Russia about joining NATO. Clinton then bent the knee to all of the cold war holdovers at the CIA and state dept, and told Russia to get fucked. Those cold war holdovers will never let their rivalry with Russia go (I'm sure there are plenty of holdovers in Russia that view the US just the same). \n\nIt's wild how people can simultaneously recognize all of the communist regimes that were toppled by the CIA/state dept/USAID all these years, and then ignore the ones they want to blindly support - even when they happen here at home. The hallmarks are all the same, but apparently the political theater team sports agenda is too deeply engrained for some people to admit it.\n\nI'll never understand how some people can complain about the US being the police of the world, and then complain when there are active steps being taken to reduce that influence. Aggressive NATO expansion is what got the eastern bloc to where it is. Biden let the cat out of the bag two years ago when he said \"regime change in Russia is the goal.\" The US hates any country and leader that doesn't bend the knee to the IMF, USAID, NATO, and all of the *other* unelected self-appointed globocuck agencies - and makes it their goal to remove them from power.\n\nAt some point this shit has to stop. Now seems like a good opportunity.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Agitated-Can-3588",
                                    "body": "It's like the people who said the terrorists hate our freedoms. No they hate what we do to their countries so they commit acts of evil in response. Now it's Putin is a madman trying to take over the world. No he's playing the same game we are.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "gatornatortater",
                            "body": "And before that we provoked Georgia into attacking Russia along their border.  US just happened to have some \"trainers\" on the ground there.\n\nYou know they'll try to make something else happen along that border soon if they can.",
                            "score": -3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "phantomsteel",
            "body": "This still doesn't hit the root of the issue, geography and resources guide decisions at this level of government. US, Russia and, China have been fighting over resources since WW2. Access to oil, gas, rare earth elements; these are the only things that matter. \n\nThe US left gov and Europe sided with Ukraine for that and US right gov sided with Russia. It's the same outcome; millions sent through a meat grinder for what's under the dirt.",
            "score": 6,
            "replies": []
        },
        {
            "author": "mhx64",
            "body": "So this \"tremendous shelling\" both sides did, which \\*checks notes\\* caused a few thousand deaths, mostly military, is worse than destroying an entire \"brotherly nation\", killing hundreds of thousands of them and yours, and also stealing Crimea, Donbass, and Donetsk, is better than the former?\n\n...Sounds about right.\n\nAlso, what does this have to do with ancap? Russia is a mixed economy practically owned by Putin, why would an anarcho capitalist support this?",
            "score": 3,
            "replies": []
        },
        {
            "author": "namethatsavailable",
            "body": "Oh look it’s Jeffrey Sachs, noted Soviet apologist.\n\nCan someone explain to me how Russia (a dictatorship) is supposed to be looked favorably upon by “anarcho capitalists”?\n\nHas this sub completely lost the plot?  Are we supposed to pretend like Russia isn’t a very shitty dictatorship, because we so badly want America to be isolationist?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Cosmic_Spud",
            "body": "That is beautiful man. Where did you get this?",
            "score": 3,
            "replies": []
        },
        {
            "author": "Jeftowitzen",
            "body": "Are your Kremlin handlers pressed by this one,  comrade?",
            "score": 1,
            "replies": []
        },
        {
            "author": "JumpySimple7793",
            "body": "The statists are allowed to invade because other statists were mean?\n\nIf you're in Russias side here you're in the side of authoritarianism\n\nThe war in Ukraine has set Ancapism back and that's Russias fault",
            "score": 2,
            "replies": []
        },
        {
            "author": "TieTheStick",
            "body": "Jeffrey Sachs has been one of my go to people for many years when it comes to understanding geopolitics. \n\nIt is time that top American officials listen to him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Primary_Variation",
            "body": "This man is full of s**t.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Futanari-Farmer",
            "body": "Haha, good stuff comrade.",
            "score": 0,
            "replies": []
        },
        {
            "author": "FoxtrotMikeLema",
            "body": "> do people really think this started in february 2022?\n\nNo, but lets not be naive and think this began in the 90s.\nUkraine has been a victim to Russian aggression in a similar capacity to what the jews experienced in WW2.  They were victims of genocide by the Soviet Union, the governmentPutin proudly served in.  Don't forget this\n  https://en.m.wikipedia.org/wiki/Holodomor\n\n\n> It's crazy to have missle stations and military bases a couple of countries away from Russia.  It's like putting missle silos in Mexico or Canada\n\nThe Soviet Union secretly installed nuclear missiles in Cuba in 1962.  This boomer is conveniently forgetting that.  Plus there's the reach Russia has over Alaska, to North America. https://en.m.wikipedia.org/wiki/Cuban_Missile_Crisis\n\n>\"B-but b-but the 2014 coup\" \n\n that came after a 2011 deal for shell and exon to help develop the natural gas and oil.  Shortly after this, crimea was seized forcefully by Russia.  Russia isn't afraid of nato expansion, they're afraid of western expansion plus competitors to the fuel industry.  Crimea and Eastern Ukraine is full of a shit tone of oil and natural gas.  I can't tell you if the US was involved in the coup at all (likely they were, ngl.  If a foreign government seizes land from another country after your country made a deal with the victimized country fair and square, I'd whisper to the victimized country to play ball with me, and it seemed like the best thing for them to do at the time.  Homeboy is just pissed the russian installed government was couped),but Ukraine clearly loses a shit ton of value when they lose a chunk of eastern Ukraine. \n\nhttps://www.reuters.com/article/business/ukraine-signs-shale-gas-deal-with-exxonmobil-idUSL5E7KU0UP/\n\n They're like a middle east that hasn't developed yet because Russia wants it all to theirselves.\n\nGET THESE \"NON-AGRESSION PRINCIPLE VIOLATION\" JUSTIFIERS OFF OF THE ANCAP SUBREDDIT!!!!  Delete your account OP. REEEEEEEEEEEEEEEEEEEEEEEEE!",
            "score": -5,
            "replies": [
                {
                    "author": "Lagkiller",
                    "body": "> The Soviet Union secretly installed nuclear missiles in Cuba in 1962. This boomer is conveniently forgetting that.\n\nAnd the US did nothing and simply said \"OK cool, nothing to see here\" then proceeded to do nothing about it?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "FoxtrotMikeLema",
                            "body": "That's incorrect.  After 13 days, Russia withdrew their missiles from Cuba.\n\nAlso, if you were correct; you're making an argument that Russia shouldn't care that NATO missile Silos are near their country.  \n\nGo to sleep, everyone can tell you're sleep deprived in inebriated.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Lagkiller",
                                    "body": "> That's incorrect. After 13 days, Russia withdrew their missiles from Cuba.\n\nApparently you don't understand what sarcasm is.\n\n>Also, if you were correct; you're making an argument that Russia shouldn't care that NATO missile Silos are near their country.\n\nI wasn't.  I was pointing out that you made that argument and it was wrong.  Which is hilarious.\n\n>Go to sleep, everyone can tell you're sleep deprived in inebriated.\n\nNah, you're just incredibly unable to understand dynamics of a conversation.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "FoxtrotMikeLema",
                                            "body": "use /s next time.  \n\n>  wasn't. I was pointing out that you made that argument and it was wrong. Which is hilarious.\n\nGuess what?  I relistened to the video and this man is talking about anti-missile systems in Poland and Romania, while Putin does a false equivalency to actual missile systems in Mexico and Canada.  The video was being disingenuous with a false equivalency.  I can't tell if this guy is directly making a quote from Putin or pulling a false equivalency out of his ass.  I retract my argument here and say you're right with your logic, only because I paraphrased his shitty argument incorrectly.  \n\n > Nah, you're just incredibly unable to understand dynamics of a conversation. \n\nGo back to reddit school for /s",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Lagkiller",
                                                    "body": "> use /s next time.\n\nNo, I don't think I will.\n\n>Go back to reddit school for /s\n\nProjection is a terrible color on you.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "FoxtrotMikeLema",
                                                            "body": "How do you feel that the man in this video made a false equivalency to anti-missle systems amd missile silos?  Do you think it was purposefully disingenuous?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Lagkiller",
                                                                    "body": "> How do you feel that the man in this video made a false equivalency to anti-missle systems amd missile silos?\n\nI don't.  Military installations are military installations.  \n\n>Do you think it was purposefully disingenuous?\n\nNo, I think you are.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "gatornatortater",
                    "body": "None of that makes any since.  It reads like a Lindsey Graham interview.\n\nThe video is very clearly discussing what the US and UK (loosely speaking NATO) have instigated.  Not all of history's battles and wars that have happened in the area now called Ukraine.\n\nThe \"boomer\" was making a point by saying Mexico and Canada.  Those would be a much bigger deal than Cuba, and everyone knows how big of a deal that was.  It almost started nuclear armageddon.\n\n> that came after a 2011 deal \n\nYou really do sound like Lindsey Graham.  As if a big oil deal excuses taking over another country's government....  only inside of a neocon's warped little brain.  This paragraph here looks to be your real reasons for your opinion.  Nuff' said.\n\n>  GET THESE\n\nI agree with you there.  This doesn't really belong on this sub.  It is a geopolitical post. Doesn't make sense here.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "FoxtrotMikeLema",
                            "body": "> The \"boomer\" was making a point by saying Mexico and Canada. Those would be a much bigger deal than Cuba, and everyone knows how big of a deal that was. It almost started nuclear armageddon.\n\nThere are no missile silos in Mexico or Canada, like how there are no NATO missile silos in Scandinavia or Ukraine...  Hey, I just realized something...  This man is referencing anti-ballistic missile systems in Poland and Romania and then references how Putin made a false comparison that this is similar to missile systems in Canada and Mexico.  Anti-ballistic missile systems destroy missiles while missile systems do much worse... This is a false equivalency made by Putin (Thank you for forcing me to listen to this again.  The word play is disingenuous from this paid Russian actor.  I don't even care who this man is, he's clearly being paid in Rubles)\n\n> You really do sound like Lindsey Graham. As if a big oil deal excuses taking over another country's government.... only inside of a neocon's warped little brain. This paragraph here looks to be your real reasons for your opinion. Nuff' said\n\nOk i'm ngl I abandoned ancap principles with this argument.  to be quite frank though it was a democrat administration that did this.  Yeah, there's arguments that democrat administrations tend to act neocon, but you need to understand that there was a reason why the natural gas company Burisma had 3 out of 5 board members be American (And one of them was Hunter Biden)...  Democrats were manually driving the development of Ukraine's fuel industry, because they couldn't be trusted to do it themselves.  They were going to be victims to being gobbled up like a pacman pellet unless we stepped in.  This will be the most necon position I will ever say in my life.  Russia fucking genocided them less than 100 years ago.  If you wave an alternative team at them, they'll salivate and take the chance immediately (especially against a country that seized one of the most expensive pieces of land on the planet due to the natural gas and oil, Crimea)\n\nUkraine is the abused wife of Russia.  If you saw an abused wife not seek help, would you offer it?  ( sorry if this sounds unhinged lol)",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "gatornatortater",
                                    "body": "That is actually a good analogy.  I think often we see an abused wife go and seek other abusive relationships after leaving the original one because they are now so fucked in the head.\n\nI think we're getting too meta, though.  The fact remains that Ukraine was (is?) deep into a civil war with an eastern section (like Crimea) that didn't want to be a part of the same country as the western half.  From the outside looking in, it appeared to me that American involvement aggravated that side of this as well as the Russians. Referring to Ukraine as a singular entity doesn't seem particularly honest either.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "FoxtrotMikeLema",
                                            "body": "> That is actually a good analogy. I think often we see an abused wife go and seek other abusive relationships after leaving the original one because they are now so fucked in the head. \n\n\"Cmere baby, I won't genocide you\"\n*Puts oil and nat gas pumps on your nipples*  \n\n> The fact remains that Ukraine was (is?) deep into a civil war with an eastern section (like Crimea) that didn't want to be a part of the same country as the western half\n\nNot going to lie, I've heard this argument before and respect it.  There's just one problem:  Most Ukrainian infighting, Crimea land grabbing and civil war (2014) happened after 2011:  https://www.reuters.com/article/business/ukraine-signs-shale-gas-deal-with-exxonmobil-idUSL5E7KU0UP/\n\n> Referring to Ukraine as a singular entity doesn't seem particularly honest either.\n\nThey're a people who were invaded by Russia and fought back.  What ever resistance exists in the Donbas region was likely installed by Russian intelligence agencies due to the value of eastern Ukraine being realized. \n\n Russia gave Crimea away to Ukraine in 1954.  I've heard some people make the argument \"Hey Russia had so many of their citizens in Crimea at the time so it was practically Russian\".  Can the US do that to Canada or Mexico?  Tijuana is a spectacle for US tourists.  We can seize it.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "EndSmugnorance",
            "body": "Isn’t the quiet one that guy who won a Lamborghini on MrBeast?\n\nhttps://youtu.be/qIsgdOVGA04?si=QiXPTPRzZoSh82pd",
            "score": -1,
            "replies": []
        }
    ]
}