{
    "title": "This does not make sense",
    "author": "ncdad1",
    "subreddit": "Anarcho_Capitalism",
    "rank": 172,
    "score": 301,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 113,
    "url": "https://i.redd.it/d5zhta8qmrke1.png",
    "id": "1ivuq3u",
    "selftext": "",
    "comments": [
        {
            "author": "StuntsMonkey",
            "body": "Have you considered \"because fuck you\"?",
            "score": 55,
            "replies": [
                {
                    "author": "TrueNova332",
                    "body": "Reasonable response",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "denzien",
                    "body": "That had not occurred to us, Dude",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Barbados_slim12",
            "body": "They want to spend more money than what's being saved. If you save $1 trillion but want to spend $2 trillion, you're still spending $1 trillion that you don't have.",
            "score": 45,
            "replies": [
                {
                    "author": "BIGJake111",
                    "body": "Lower taxes* debt ceiling is to fund tax cuts, not added spending.\n\nDeficit still sucks but I’ll take the immediate relief.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Renkij",
                            "body": "The true taxes ARE government spending FFS. You will pay it one way or another.",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "porky11",
                                    "body": "Not if you don't save your money by keeping dollars.\n\nI'm not opposed to inflation of government money.\nThis way, more people will flee to better money and the monetary monopole of governments might end sooner than later.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Yveskleinsky",
                                            "body": "Ding. Ding. I think this is the plan. People would be wise to start learning about, and buying, bitcoin. r/bitcoinbeginners",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "International_Lie485",
                            "body": "\"Funding tax cuts\"\n\nJust insane bootlicker logic.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "International_Lie485",
                                            "body": "Not semantics, state propaganda.\n\nThey intentionally obfuscate what they are doing with nonsense word salad.\n\nInflation = expanding (inflating) money supply.\n\n> a lot more than seeing them spend (which causes inflation)\n\nThe government spending money does not cause inflation, inflation is when the government increases the money supply. Rising prices are a consequence of inflation.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[deleted]",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "International_Lie485",
                                                            "body": "\"hedge against inflation\", my guy the government doesn't give a fuck about inflation, politicians spend money on random bullshit to get funding from their donors and to get re-elected.\n\nThe politicians are so fucking cheap, they can convinced to kill millions of people for USD 50,000 in campaign donations.\n\nThey literally don't give a fuck about economics or inflation.\n\nMy point is to stop using their propaganda terms.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "MaineHippo83",
                                                    "body": "Inflation is the rate of rising prices.\n\n\nDeficit spending and borrowing literally is increasing the money supply that is why it is said the government spending causes inflation. \n\n\nYou also don't need to necessarily increase the money supply to have inflation.  If the same amount of dollars are chasing fewer goods those goods will go up if those goods are integral to the economy like say fuel or housing that is driving up prices that filter through everything.\n\nThe federal budget is already a trillion dollars underwater every year and you give a 1 trillion dollar tax cut you have now expanded the money supply and extra trillion dollars.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "International_Lie485",
                                                            "body": ">Inflation is the rate of rising prices.\n\nInflation is the expanding (inflating) of the money supply.\n\nFuck off bootlicker, we don't want to hear your government bullshit economics.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "MaineHippo83",
                                                                    "body": "How is being accurate bootlicking.... Is being ignorant now liberty? Liberty from facts?\n\nInflation is the rate at which the general level of prices for goods and services rises over time, leading to a decrease in the purchasing power of money. It is typically measured by indices such as the Consumer Price Index (CPI) or the Producer Price Index (PPI). Inflation can be caused by various factors, including increased demand (demand-pull inflation), rising production costs (cost-push inflation), and excessive money supply growth. Moderate inflation is considered normal in a growing economy, but excessive inflation or deflation can have negative economic consequences.\n\nMoney supply growth is one cause of inflation. There are others",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "International_Lie485",
                                                                            "body": "I don't speak government propaganda.\n\nThe government has been doing this bullshit since ancient rome when they mixed random elements in gold.\n\nRising prices are a consequence of government inflating the currency. Of course they want to obfuscate that fact.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "MaineHippo83",
                                                                                    "body": "its not obfuscated. What you are saying is you don't think multiplication can increase a number because you don't like addition and want to blame it on addition.\n\nYou are closing your eyes to all the economic truths because you oppose one thing, which I oppose too. \n\nBut thats absurd, you can't just ignore facts and truth because it suits you.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "International_Lie485",
                                                                                            "body": "What I'm saying is that I've read historical records, like this one written in 1896:\n\n[Fiat money inflation in France - Andrew Dickson White](https://mises.org/library/book/fiat-money-inflation-france?d7_alias_migrate=1)\n\nThe governments in history and around the world causes prices to rise when they inflate the money supply and OBVIOUSLY they want to obfuscate this, because why the fuck would they accept responsibility for their actions?",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "MaineHippo83",
                                                                                                    "body": "these aren't mutually exclusive concepts. Of course government printing money and expanding the money supply causes inflation, I'm not denying nor debating that. That doesn't mean there can't be other way you can cause inflation too.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "International_Lie485",
                                                                                                            "body": "Inflation is the expansion of the money supply.\n\nWhat other method is there to \"cause\" inflation, if we ignore expanding the money supply.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "MaineHippo83",
                                                                                                                    "body": "It isn't. It the rate of prices increasing.  You are literally trying to redefine a word by taking one of its causes and calling that the definition \n\nEven if you believe an increasing money supply is the most important cause of inflation and the primary cause inflation that doesn't make it the definition of inflation",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "International_Lie485",
                                                                                                                            "body": "The government is redefining the word to obfuscate their thievery.\n\nInflation is the expansion (inflating) of the money supply.\n\nRising prices are a consequence of inflation.\n\nYou are just a government bootlicker.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "MaineHippo83",
                                                                                                                                    "body": "You are objectively wrong. I don't have to virtue signal my opposition to the government by being wrong about economics.\n\n\nI know how to fight money supply expansion without lying about it.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "International_Lie485",
                                                                                                                                            "body": "https://mises.org/library/book/fiat-money-inflation-france?d7_alias_migrate=1",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": []
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "MaineHippo83",
                            "body": "You don't save any money with a tax cut if it's being deficit-funded because the inflation will eat away what you got back",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "BIGJake111",
                                    "body": "Inflation is regressive and avoidable, income taxes isn’t. But in general, yeah.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "isthatsuperman",
            "body": "Republicans spend just as much, if not more than democrats. 2 sides of the same coin.",
            "score": 81,
            "replies": [
                {
                    "author": "denzien",
                    "body": "tax and spend or borrow and spend ... pick your poison",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Theyshotmydog01",
                    "body": "Two sides of the same shekel",
                    "score": 13,
                    "replies": [
                        {
                            "author": "AngelsRangers",
                            "body": "Underrated comment",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Komprimus",
                            "body": "How do you mean that?",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DRKMSTR",
            "body": "They only saved $55 billion so far, they need to get to over $500 billion for it to affect the budget.",
            "score": 36,
            "replies": [
                {
                    "author": "zippy9002",
                    "body": "That 55B is just a propaganda number. It includes cancelled contracts that have already been paid in full with no hope of ever recovering that money.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "DRKMSTR",
                            "body": "That is incorrect, it doesn't include actual savings, they show that in their reporting: [https://doge.gov/savings](https://doge.gov/savings)",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "zippy9002",
                                    "body": "Summing up these figures, the total itemized savings from the website are significantly less than $55B, aligning more by other reports from Bloomberg and Fortune which cite around $16.6B in verifiable savings.\n\nSignificant errors have been found in doge methodology, for example, a FPDS contract worth $8M was logged as being $8B, inflating the saving figure. Although this error as been fixed it cast doubts on the basic competency of the agency.\n\nFurthermore, Doge counts the full value of contracts even if the money has already been spent. For example, if you have a $1M/year contract for 10 years and we are on year 9 with the previous years already paid in full, Doge will list the cancelled contract value as being $10M instead of the real saving of $1M. This dramatically inflated the amount of “savings” and is blatantly dishonest.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Darmin",
            "body": "Because it's not about the savings. \n\n\nIt's about removing agencies. \n\n\nI don't believe we will have less government over reach, or meddling. ",
            "score": 49,
            "replies": [
                {
                    "author": "MattAU05",
                    "body": "It’s about consolidating power to agencies and leaders of those agencies who are loyal to Trump. We won’t get small government or lower taxes.",
                    "score": 33,
                    "replies": [
                        {
                            "author": "Darmin",
                            "body": "I love the idea of doge. \n\n\nI love that federal employees are being fired. \n\n\nI love that agencies are being reduced or removed. \n\n\nI don't believe any of this will actually lessen government. Or better my life. \nIt feels like a waste. \n\n\nTaxes aren't going to go down. Law enforcement isn't going to lessen, laws aren't going to lessen. So what benefit is this to me?  \n\n\nIf the ATF or IRS are removed, sure. My many federally illegal guns are now legal. Cool I guess. And maybe I'll be less likely to get caught for tax evasion/fraud. So that would be nice. Less stress. \n\n\nBut I don't see either of those happening. ",
                            "score": 25,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "vvfella",
            "body": "Smoke, mirrors, and political theater to keep your attention while the state only entrenches itself deeper in the background",
            "score": 8,
            "replies": []
        },
        {
            "author": "abinferno",
            "body": "Even if we took at face value that everything DOGE identified should be cut and they have the authority to cut it, it's less than 3% of the 2024 deficit and the probected 2025 deficit ($1.9 trillion). Only Congress can authorize cuts large enough to actually impact the deficit. The only ways to directly affect the deficit to a meaningful magnitude are to cut defense, Medicaid, medicare, or social security.\n\nThe FICA categories have their own revenue streams. SS is not a significant net contributor to the deficit. For most years since 1957, it has been net positive for revenue. Only in 2021 did it become consistently net negative contributing ~$50 billion per year to the deficit on average (https://www.ssa.gov/oact/STATS/table4a3.html). This should be addressed, but it's nowhere near the largest contributor to the deficit. Medicare does pull somewhat from the general fund (~$300-$400 billion recently) as its expenditures outpace its revenue. Of course, Republicans refuse to allow Medicare to negotiate prescription drug prices, which could help fight the overspending. Medicaid is a contributor as it comes from the general fund.\n\nMedicaid and defense are around $900 billion and $850 billion, respectively. And, if you want to find fraud and waste, the DoD is a good place to start as we're actually talking about numbers that move the needle ($trillions - https://coloradonewsline.com/2023/12/06/pentagon-cant-pass-audit/).",
            "score": 8,
            "replies": []
        },
        {
            "author": "IncomprehensibleAnil",
            "body": "Because they lying.\n\nDOGE is about putting gas money in your pocket (a billion dollars saved is about $3 back to you). Gov’t spending is about taking a car out of your annual salary ($6.5T is about $20k from you).",
            "score": 15,
            "replies": [
                {
                    "author": "EconGuy82",
                    "body": "I often see these memes from leftists who complain about billionaires, pointing out (correctly, to be honest) how difficult it is for people to understand how big a billion really is. \n\nBut if that’s true, imagine how much more difficult it is to conceptualize the scope of the federal budget, which is like 6,000 times larger.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "db8db4",
                    "body": "What is the lie?\n\nDeficit is $838 billion, DOGE savings is $51 billion. Until the savings reach deficit, the debt will keep rising. Simple math.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "WishCapable3131",
                            "body": "DOGE has been lying big time about the amount they are \"saving\".",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "buffalo_pete",
                                    "body": "So you'd rather the government spend *more* money? That's a take.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "WishCapable3131",
                                            "body": "That is a take that you just made up and i did not say.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "db8db4",
                                    "body": "Cope harder. It's funny how quickly you all turn into conspiracy theorists.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "IncomprehensibleAnil",
                            "body": "So no need to raise the debt ceiling?",
                            "score": -4,
                            "replies": [
                                {
                                    "author": "db8db4",
                                    "body": "I am so sorry for you that failed math this bad.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "IncomprehensibleAnil",
                                            "body": "Do please enlighten me. How is the DOGE nickel and dime shit not a distraction from the multi-trillion dollar fire hose of spending?\n\nTrust the process? God Emperor Trump is going to save us all from the mean girls?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "db8db4",
                                                    "body": "By the very simple fact that it's just the beginning. This is the first time in decades that something is actually being done.\n\nYou sound like one of those losers who give up because they can't fix everything in one day.",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "IncomprehensibleAnil",
                                                            "body": "So just ignore the promises to increase military spending and protect social security and medicare/medicaid benefits, and all the trade wars he’s already started, and the largest wealth transfer ever from the poor to the rich during his first term, and all the people he’s been continuing to kill overseas, because some dick rider on Reddit is sure he’s definitely trustworthy this time? \n\nK",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "author": "db8db4",
                                                                    "body": "Your tone and astounding ignorance leave me no option but to laugh at you.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "IncomprehensibleAnil",
                                                                            "body": "K\n\nHope it works out. And if it doesn’t, that you have the integrity to admit it. Unlike the Obama supporters before you.",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "db8db4",
                                                                                    "body": "Sure. As long as you hold him to the platform he ran on and not some libertarian pipe dream.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "IncomprehensibleAnil",
                                                                                            "body": "The platform he ran on is what I’m condemning. Do you not know where you are?",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "db8db4",
                                                                                                    "body": "Remember, Trump went to the libertarian convention and promised to implement about a third of the platform they wanted. The Libertarian party said no and elected an authoritarian fruit to represent them. That‘s not the first time they decided to run as a joke.\n\nEven then, I am getting more libertarian goodies from him in just one month  than from the whole Libertarian party. At the same time, I do respect the wishes of his other voters who do not share my views.\n\nIf you (yes, you) can't compromise to move closer to to libertarian goals, then you're just a LARPer.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "buffalo_pete",
                                                                    "body": "> So just ignore the promises to increase military spending\n\nWrong. Hegseth wants to cut 8% a year from the DoD budget.\n\n> and protect social security and medicare/medicaid benefits\n\nWrong. DOGE has found more than *a fucking trillion dollars* in Medicare/Medicaid fraud.\n\n> and all the trade wars he’s already started\n\nWrong. Not a single \"trade war\" has been started. Every single country that's been threatened with tariffs has folded.\n\n> the largest wealth transfer ever from the poor to the rich\n\nWrong. 2020. Also, what money has been transferred from the poor to the rich this year? I'll wait.\n\nDo you realize what a fucking idiot you sound like?",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Affectionate_Cat_197",
            "body": "The truth is that the savings we’re seeing from doge still only constitutes a fractional percent of what we’d need to save in order to just balance the budget. We probably won’t get there with waste alone. At the end of the day we’ll probably need to cut social security, Medicare, and defense in order to balance. \n\nAlso, politicians want a blank check to spend as much as they want, so they’ll always vote to raise the debt ceiling no matter what.",
            "score": 2,
            "replies": [
                {
                    "author": "ncdad1",
                    "body": "No saving in SS.  SS pays for itself through its own tax.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Affectionate_Cat_197",
                            "body": "It’s supposed to work that way, but it gets rolled into federal revenue and it gets spent along with everything else.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ncdad1",
                                    "body": "That would be illegal.  SS has its own account and trust fund.  While they might report it all together for convenience, the money is separate.  You know that because in 2023 when SS defaults unlike the Military, everyone gets a 30% haircut",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Affectionate_Cat_197",
                                            "body": "First of all, the trust fund is not an actual fund. \n\nhttps://www.cato.org/policy-analysis/social-security-trust-fund-myth",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Affectionate_Cat_197",
                                                    "body": "Secondly, the government can borrow from social security to fund other things.\n\nhttps://preview.redd.it/nul35mbugxke1.jpeg?width=1284&format=pjpg&auto=webp&s=b67910e0e7edbb399923a9331580494ee90fce8b",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Affectionate_Cat_197",
                                                            "body": "Full article. \n\nhttps://www.cbpp.org/research/social-security/understanding-the-social-security-trust-funds-0#:~:text=Money%20that%20the%20federal%20government,drawing%20down%20their%20accumulated%20reserves.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "AgainstSlavers",
            "body": "Congress is not DOGE.  It's full of RINOs.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Talkless",
            "body": "They are allegedly saving billions, but government expenses are in trillions...",
            "score": 2,
            "replies": []
        },
        {
            "author": "NoTie2370",
            "body": "These aren't savings yet. They are \"oh we can spend more\" type savings.",
            "score": 2,
            "replies": []
        },
        {
            "author": "drunkandslurred",
            "body": "The actual answer is mostly because they want to give tax breaks in the amount that exceeds the government cuts.\n\nIf they cut all these agencies, I want the debt to go down before tax breaks.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Hidolfr",
            "body": "There is an extreme assumption being made at the beginning of that statement that savings are being made...",
            "score": 4,
            "replies": [
                {
                    "author": "ncdad1",
                    "body": "Let’s trust and verify until we discover they are lying",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ToxicRedditMod",
            "body": "At least include a link instead of a generic graphic",
            "score": 3,
            "replies": [
                {
                    "author": "ncdad1",
                    "body": "??? I created it in WORD.  Do you want my DOC file?",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Wrathofsteel",
            "body": "Because it's fiat currency, and it doesn't matter. As long as we're the world superpower, which will be difficult to maintain with all of this, turning on allies that's been going down. The plan is to turn us into a third world sh*thole and make way for China to lead the world. They're all on the same side with the same plan. One party just gets the plan done faster than the other.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Vegetaman916",
            "body": "It for the war. WW3 is going to be expensive, and anything saved now will be spent on that, and then some.",
            "score": 1,
            "replies": [
                {
                    "author": "ncdad1",
                    "body": "Well WW2 was a huge boon for the US, and when were great.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Vegetaman916",
                            "body": "Also when we were the only ones with nukes... otherwise, we would either be speaking Japanese or German now, *arigato.*\n\nHowever, this time everyone who is anyone has them... and that makes it interesting.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ncdad1",
                                    "body": "Well the nukes were in the last hours of WWII, so not sure they were that much of an influence.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Vegetaman916",
                                            "body": "They were a massive influence. Thus the cold war with the Soviet Union afterwards, rather than a hot one.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "ncdad1",
                                                    "body": "WWII was almost over when the nuke was unveiled.  \n\nGermany's SurrenderMay 7, 1945                \n\n**Atomic Bomb Dropped on Hiroshima  August 6, 1945**      \n\nJapan's SurrenderAugust 15, 1945\n\nAfterward, I would agree, but we were talking about WWII",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Vegetaman916",
                                                            "body": "I realize that, but again, ww2 only ended because of that display. Otherwise, it would have continued rather than drawing the lines down the middle of Germany.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "ncdad1",
                                                                    "body": "WWII with Japan, ye,s but not with Germany",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Vegetaman916",
                                                                            "body": "Certainly not with Germany, but I am mostly referring to how the conflict would have continued directly with the soviets.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheFortnutter",
            "body": "because doge has basically only found about 8 billion in savings.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Shoot_2_Thrill",
            "body": "Because of budget reconciliation. Basically all spending must be accounted for on paper when cutting taxes.\n\nSo if they cut 2 trillion in taxes, then on paper they must either\n\n1) cut 2 trillion in spending, or\n\n2) add 2 trillion to the deficit\n\nI would love it if they would cut the 2T, but I think because so many people are so dependent on the state it would be too much of a shock to the system. Thousands would literally die before the market adjusted\n\nTherefore, we have to cut taxes and on paper justify it by adding to the deficit. Why do I say on paper? Because the tax cuts should increase revenue. Business will expand. Sales will improve. More people will have jobs, there will be more investment, both foreign and domestic. Laffer curve basically\n\nSo the only way to get the tax cuts is to justify it with a deficit. Then we can grow out of this mess. Get people better jobs. They depends less on the state, and you can continue making cuts safely. That’s the plan at least",
            "score": 1,
            "replies": [
                {
                    "author": "ncdad1",
                    "body": "We hear that all the time if you give the rich a $1b tax cut it will generate $2b in revenue in five years and when five years pass,we are just $1b more in debt.  We have waited 50 years for the Reagan tax cuts to trickle  down",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "GnomeAwayFromGnome",
            "body": "Because they're assholes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Emergency_Accident36",
            "body": "DOGE isn't saving money, it's reallocating it in to futuristic military 'owned' by Elon Musk himself\n\nAlso >95% of DOGEs claimed  savings have been proven to be lies thus far",
            "score": -2,
            "replies": [
                {
                    "author": "buffalo_pete",
                    "body": "> it's reallocating it in to futuristic military 'owned' by Elon Musk himself\n\nSource?\n\n> Also >95% of DOGEs claimed savings have been proven to be lies thus far\n\nSource?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Emergency_Accident36",
                            "body": "1)can't provide a source for a future event.  Equally applicable to any of MAGAs claims of purpose for these alleged funds\n\n2)See sources of DOGEs claims..",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "NotARealAncap",
            "body": "Checkout ilovechipotle1301, they're not saving anything",
            "score": 0,
            "replies": [
                {
                    "author": "ncdad1",
                    "body": "Smart gal",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Zealousideal-Skin655",
            "body": "How can you be so gullible?",
            "score": 0,
            "replies": [
                {
                    "author": "ncdad1",
                    "body": "Trust but verify",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Komprimus",
            "body": "Also, when will they lower taxes?",
            "score": 0,
            "replies": [
                {
                    "author": "ncdad1",
                    "body": "Probably after they pay off the debt. We have to get out of this hole first.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Komprimus",
                            "body": "Is this something they said or something you like to believe?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ncdad1",
                                    "body": "I would like to believe we could pay off the debt and not worry about that anymore.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Komprimus",
                                            "body": "But I never heard anyone from the Trump administration say anything like this. Is their stated plan to first pay off the debt and then start lowering taxes? Because that means they won't lower taxes for decades and they will be long gone by then.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "ncdad1",
                                                    "body": "Trump's plan is to dismantle the Federal government.  The savings and debt are for show. But if the debt is an issue, then it needs to be dealt with first.  We have been underpaying taxes for years, and now that has to be reversed.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Komprimus",
                                                            "body": "There is no such thing as underpaying taxes, there is only government overspending.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "ncdad1",
                                                                    "body": "Well, they only bill for the services you vote for.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Komprimus",
                                                                            "body": "What if I don't vote?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "ncdad1",
                                                                                    "body": "Not voting is a vote for the Status Quo.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Komprimus",
                                                                                            "body": "Regardless, I'm not voting for any services. And also, the government provides many \"services\" that nobody voted for. My guess would be that the majority of government programs are never mentioned or promised during elections.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "ncdad1",
                                                                                                    "body": "By remaining a citizen, you are getting services like the military, courts, FBI, roads, bridges, etc., that are part of the package and for which you owe taxes.  You are always free to denounce your citizenship, which is the ultimate vote that you are refusing all services.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Komprimus",
                                                                                                            "body": "I can remain on American soil and denounce my citizenship? \n\nAlso, do you agree that nobody voted for the majority of government programs and thus I'm billed for way more than for what I've voted for?",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "ncdad1",
                                                                                                                    "body": "Yes, many people in the US are not citizens, but if you are caught, you will be deported.  Well, that is the way democracy works.  You cast your single vote, and if everyone else does not agree with you, you lose and need to consider moving on to a place that shares your beliefs.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Komprimus",
                                                                                                                            "body": "Exactly, so the state definitely doesn't bill me only for the services I vote for, because even if I vote, my party can lose and I will be forced to pay for services I actively voted against. I can then leave my home, my friends, my family and most of my property and find a place that perhaps is more aligned with how I want to live, and I have no guarantee that it's not gonna all change in the next election. \n\nI agree, this IS how democracy works, and it's suboptimal, to say the least.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "ncdad1",
                                                                                                                                    "body": "It is what it is, just like Cable.  They charge $100 for 100 channels, and if you only want 50, you need to find a new Cable company since that is the package they offer.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "Komprimus",
                                                                                                                                            "body": "Monarchy also was what it was, what I'm saying is there might be better ways of organizing society than democracy.\n\nI don't have to use any cable company. That is the difference.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "ncdad1",
                                                                                                                                                    "body": "Probably a more efficient way would be like the Chinese Communist Party, which decides everything. You have the same problem with a job that has a dress code, and you can either dress like they want or find another job.",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "Komprimus",
                                                                                                                                                            "body": "Central planning seems to be the problem, not the solution. All of the problems with democracy stem from the fact that in the end there is a centralized body of power that usually most people didn't vote for. Also, central planning is less efficient than a free market economy.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": []
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}