{
    "title": "IRS",
    "author": "MercyAkura",
    "subreddit": "Anarcho_Capitalism",
    "rank": 99,
    "score": 628,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 7,
    "url": "https://i.redd.it/t5jcw5zvrhle1.png",
    "id": "1iyogtb",
    "selftext": "",
    "comments": [
        {
            "author": "MercyAkura",
            "body": "U.S. — The Internal Revenue Service (IRS) is the most recent government agency affected by the rule of DOGE, with layoff numbers reported in excess of 6,000 persons. Now, bands of former IRS agents are roaming the country, forced to go door to door to rob people directly.\n\n\"It's just so sad,\" MSNBC's Rachel Maddow said. \"Elon Musk is quashing the dreams of real people who devoted their lives to stealing for the federal government. But some heroes remain, choosing to spend their own private time going door to door to rob people without government compensation. And I applaud them for it.\"\n\nReports are coming in around the country that former IRS agents are wearing bandanas and going door to door to commit violent home invasion robberies on their own time.\n\n\"It's like the Wild West out there,\" warned New York Police Chief Lou Bilgins. \"Do not open the door for any unsolicited visitors, or you could be killed during an attempted robbery or, worse, audited.\"\n\nAt publishing time, a gang of former IRS agents were seen looting the ruins of the Palisades.\n\n[https://babylonbee.com/news/laid-off-irs-agents-now-forced-to-go-door-to-door-robbing-people-directly](https://babylonbee.com/news/laid-off-irs-agents-now-forced-to-go-door-to-door-robbing-people-directly)",
            "score": 15,
            "replies": [
                {
                    "author": "AlienDelarge",
                    "body": "Its nice to see a return to organic artisinal nano-robbery. The faceless government minions just never quite gave it that personal touch.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "CakeOnSight",
            "body": "work at the IRS for 40 years, get benefits and social security for a lifetime of stealing. What a world.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Rinoremover1",
            "body": "❤️",
            "score": 5,
            "replies": []
        },
        {
            "author": "DontTreadOnMe96",
            "body": "IRS is the new IRA.",
            "score": 3,
            "replies": [
                {
                    "author": "onecrystalcave",
                    "body": "They should get a team name. like maybe Queen Anne's Revenge.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "s3r3ng",
            "body": "Honest government - at last!",
            "score": 2,
            "replies": []
        }
    ]
}