{
    "title": "Questions about Private cities",
    "author": "Western_Rabbit_8106",
    "subreddit": "Anarcho_Capitalism",
    "rank": 26,
    "score": 2,
    "upvote_ratio": 0.67,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/Anarcho_Capitalism/comments/1j3v0xz/questions_about_private_cities/",
    "id": "1j3v0xz",
    "selftext": "How exactly would ownership work? Would a ceo own everyone’s land and dictate the rules because you are technically in their private city?\n\nHow would this be different from feudalism?\n\nHow would the owner of the ceo make money? I think making people pay to live there forcefully would just be taxes but i might be wrong.\n\nAre private cities more like hoa’s and i just have the wrong idea?\n\nPlease i am not trying to attack anarcho capitalism in fact i believe i am turning into one (I’ve considered myself a minarchist for probably almost a decade) I just genuinely have a lot of questions.\n\n\nNot sure why im being downvoted these are genuine questions ",
    "comments": [
        {
            "author": "Guischneke",
            "body": "The key difference between private cities and feudalism is contract. Under feudalism, people were born into a system where they owed obligations to a lord, often without consent. A private city, in contrast, operates on voluntary association—if you don’t like the rules, you can leave and take your business elsewhere.\n\nOwnership in a private city could take different forms. One model is that a company owns the land and sells or leases property, much like a real estate developer. Another model is a collection of private landowners forming a contractual association (like a Homeowners Association but voluntary). The rules of the city would be defined by contracts, not arbitrary decree.\n\nAs for making money, it’s not through coercion (like taxation) but through service. Think of how shopping malls or Disney World operate—people willingly pay for security, infrastructure, and amenities because they see value in them. If a private city’s management is oppressive or inefficient, people will leave, and the project will fail.\n\nThe main takeaway: a private city isn’t about a CEO owning everyone like a feudal lord, but about competing governance models offering the best services at the best price. If it doesn’t work, it fails. Unlike the state, which forces you to pay up no matter how badly it functions.\n\nHope that helps!",
            "score": 6,
            "replies": [
                {
                    "author": "Western_Rabbit_8106",
                    "body": "That makes much more sense thank you!",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "TorturedChaos",
                    "body": ">If it doesn’t work, it fails. Unlike the state, which forces you to pay up no matter how badly it functions.\n\nI think that right there is the important takeaway when comparing any private organizations to a State run.  It Is much hard, and sometimes neigh impossible for State run organizations to fail - regardless of how terrible they are run.",
                    "score": 3,
                    "replies": []
                }
            ]
        }
    ]
}