{
    "title": "This site is legitimately unusable.",
    "author": "Rogue-Telvanni",
    "subreddit": "Anarcho_Capitalism",
    "rank": 0,
    "score": 363,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 155,
    "url": "https://www.reddit.com/r/Anarcho_Capitalism/comments/1j47d39/this_site_is_legitimately_unusable/",
    "id": "1j47d39",
    "selftext": "I'm pretty sick of it. I'm not a big Trump guy, but HOLY FUCK do I not need to see a billion blatantly astroturfed \"TRUMP BAD\" posts in every single sub I follow. Actual, unironic communists are allowed to take over whole subs, some communities are allowed to brigade while others get banned for fake shit, there were 2 separate reports over the last 6 months about active astroturfing campaigns for Kamala and *literal terrorist propaganda,* and nothing was done about it.\n\n\n\nI'm just tired of EVERY. SINGLE. SUBREDDIT. being spammed constantly with blatant propaganda, then getting in trouble for \"abusing the report function,\" when I report them. It's just no fun anymore. Even the subs I used to really like, like PCM, are practically unusable.\n\n\n\n\nIs there anywhere else that I can go to where I can talk with like minded Ancap/Libertarian types that isn't an astroturfed hell hole? Hell, I'm considering going back to Facebook at this point. This place is just miserable.",
    "comments": [
        {
            "author": "yungminimoog",
            "body": "It’s gotten so bad since the inauguration, especially in local place and state subreddits",
            "score": 138,
            "replies": [
                {
                    "author": "willghammer",
                    "body": "Funny you say that. Those are all I get suggested by the algorithm. I don’t live anywhere near fucking New Jersey, have not posted about it, and have not upvoted or engaged with anything involving it.",
                    "score": 52,
                    "replies": [
                        {
                            "author": "According_Gazelle472",
                            "body": "I get LA,El Paso and New York subs .I don't live in any of those states !That are constantly  talking about the delusional boycotts  online .",
                            "score": 21,
                            "replies": []
                        },
                        {
                            "author": "mildlyinfiriating",
                            "body": "You can turn off those suggestions. I did that shortly after it started.",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "Spinocus",
                            "body": "NJ and NY libs (outside NYC) must be particularly salty since many of their suburban 'safe spaces' have been flipping red over the last 4-6 years. Hell, look what happened to Florida!\n\nThe stream of NYC residents moving to NJ since the pandemic hasn't stopped (the real estate market in northern NJ is a dumpster fire for buyers). I'll wager a fair share of those refugees are conservative voters.\n\nFYI I'm a NYC resident and many of my liberal neighbors and co-workers are in a delusion filled haze of denial and shock.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "HozzM",
                    "body": "Yes the state and city subs are insane now.",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "20thsieclefox",
                    "body": "Yeah with all the where do I protest or we stand with Ukraine. What in the heck.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "TrueNova332",
                    "body": "I got down voted in the Massachusetts subreddit for telling them that they were not in the majority because the picture they showed was of a small protest",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "BStothepowerof2",
                    "body": "This. My city's page was actually wholesome and useful. Then it  got steamrolled by political profiles. Just had to unjoin and move on.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "SIB_Tesla",
                    "body": "The city subs are insane, it doesn’t feel organic at all. Very weird. I agree with the comments speculating it’s a bot / troll farm",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "flenlips",
                    "body": "Yep. Every subreddit now. Even wallstreebets.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "joker_with_a_g",
            "body": "Even most of the hyperlocal subs are infested with \"owner of restaurant x supports trump- boycott!\" type posts. Get a life.",
            "score": 59,
            "replies": [
                {
                    "author": "LibertyFive3000",
                    "body": "The witch hunting in the r/JoshuaTree r/denverfood subreddits is wild. Not to mention relentless sobbing over the cost of food right after aggressively petitioning for higher worker wages. \n\nAngry and profoundly confused is such a terrible combo.",
                    "score": 25,
                    "replies": [
                        {
                            "author": "swampjester",
                            "body": "Commies can never connect cause and effect. They simply don’t understand how to reason about economics.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Parkwaydrive777",
                    "body": "I live in a very red state, yet the state and city subs are nonstop \"protest today for the hundredth time in a row\" or \"calling our senator everyday and VM is somehow full\" kinda crap\n\nI just... don't care. It's such virtue signaling BS that does nothing but pretend their doing something that matters. Idc if someone protests or makes calls or whatever, thats a good liberty to do so, but it's the pretending that it'll do anything outside of trying to get social media karma that makes it stupid.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "According_Gazelle472",
                    "body": "And the \"I just deleted anything that supports Trump \"The Anticonsumption sub has gone crazy with talking about endless boycotts and sticking it to the man!I got banned from there but I still read their nonsense.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "PG2009",
                    "body": "Yeah, that is so, so common, it must be by design.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Free_Mixture_682",
                    "body": "Yes, I have seen a lot of those boycott posts in my local city sub. I cannot figure out if they are real or bots.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "ILikeBumblebees",
                    "body": "Wait, is there a way to boycott the executive branch of the federal government?!",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "youoldsmoothie",
                    "body": "Isn't this a desired feature in anarcho capitalism? We all have access to as much information as possible and are able to do what we will with said information?\n\n Why would you care if people are boycotting a business? It's free folk doing as they please.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "joker_with_a_g",
                            "body": "I can not want a state authority to stop them and still find their posting to be performative bullshit.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "bananabastard",
            "body": "I was about to give up using reddit for the same reason. The \"bots\" are out in force, filling every single sub with political bullshit. \n\nThen I read this advice from someone else, followed it, and it's been working. \n\nEvery time you see a political post where it doesn't belong, go to the users profile and click on their posts, if it's all political posts, block that user. \n\nThere's a relatively small number of accounts spamming non-political subs with political content over and over. \n\nOnce I had blocked 5-7 of them, my feed was a lot better, now I've blocked maybe 10+, I don't see much political content anymore.",
            "score": 20,
            "replies": [
                {
                    "author": "CakeOnSight",
                    "body": "I've been doing the same, big difference",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "deefop",
                    "body": "I actually did that on this very sub, because for a while it was being absolutely bombarded with generic conservative bots that would post the same clickbait threads on like 50 subs at a time. It's annoying as fuck and I'm not really sure why reddit doesn't auto ban obvious bot accounts in the first place.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "AgainstSlavers",
                            "body": "I find the commie bots are far more prolific than conservative bots, even here.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "ILikeBumblebees",
                                    "body": "I haven't seen any conservative bots, just socialist bots and pro-Trump bots.  Conservatism itself seems to be flying under the radar entirely these days.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "AgainstSlavers",
                                            "body": "Agreed",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ArdentCapitalist",
            "body": "This is the exact reason why I deleted my old account. Reddit is still good for keeping up with what is going on in the world of your hobbies and non-political interests. \n\nSTAY AWAY FROM GENERAL NON-INTEREST SPECIFIC SUBS. That is what I have learned. Every sub that is not specific to a hobby or interest is bombarded with left-wing propaganda(r/facepalm and r/clevercomeback are great examples)\n\nSubs that are centered around a certain topic whether it be sports, vehicles or tech don't have this problem(nowhere near the same extent, at least). Of course the political subs are going to be filled with leftist brainrot.",
            "score": 57,
            "replies": [
                {
                    "author": "LoneHelldiver",
                    "body": "Look at the Warhammer subs...  Completely infected.  Mods and all.",
                    "score": 25,
                    "replies": [
                        {
                            "author": "LoneHelldiver",
                            "body": "...and gaming subs in general",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "LoneHelldiver",
                                    "body": "AI subs too.\n\nBasically anything I am interested in is political on Reddit but nothing else in the same format all in one feed.",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "Life_Carry9714",
                                            "body": "Yeah cause politics impacts us all 😭",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "BrooklynRedLeg",
                                    "body": "I mean, I had been a member of the OSR subreddit almost since I joined and had to leave it the other day because slime were celebrating Ernie Gygax's (E. Gary Gygax's son) death with false accusations of racism, sexism, homophobia (basically everything but being a human being). Same shit was posted on the Dungeons & Dragons sub. People on Reddit have lost their minds.",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "deefop",
                            "body": "that is beyond pathetic, considering warhammer lol\n\nAlthough a part of me does think it's hilarious watching leftists brigade anything popular and run it into the ground.\n\nIt's why I think eric july is onto something when he talks about gatekeeping being a good thing.",
                            "score": 9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Rogue-Telvanni",
                    "body": ">STAY AWAY FROM GENERAL NON-INTEREST SPECIFIC SUBS.\n\n\nExcept for that doesn't work anymore. They're all getting spammed. Look at the top post in every Sports and team sub right now.",
                    "score": 40,
                    "replies": [
                        {
                            "author": "According_Gazelle472",
                            "body": "Yes , people are bringing politics into every sub and if you disagree with them then they will either call you a bot or a nazi !It's getting obnoxious and annoying .",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "HelpRespawnedAsDee",
                            "body": "I've just been blocking people who are clearly trying to poison subs with political BS. And some of them are incredibly obvious, in the ioniq5 sub, a comment about selling their tesla and getting a n i5 getting 1k upvotes in a sub where the norm is 200 tops. Another \"i just traded my tesla for an i5\" post from an account that was dormant for about 5 years. \n\nAnd mods don't care. So just block and move on. This is how this site dies, that's on the admins, not on us. We have other places to discuss politics.",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "LiberalAspergers",
                                    "body": "So a sub for people that loves the ioniq5 upvotes someone saying they traded their car for an ioniq5? Shocking /s",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "author": "HelpRespawnedAsDee",
                                            "body": "that's not the point bro. Those posts are 3 or 4 times a day. BUT, the ones were upvote ratios are completely off track with the rest of the sub and especially those from dormant accounts are incredibly suspect.\n\nBesides, yeah, despite what reddit likes to claim, this site is full of corporate dick suckers.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "LiberalAspergers",
                                                    "body": "There certainly is a overall liberal slant to redditt, but that is nothing new. Its user base tends to be younger, more educated, and it is heavily text based. \n\n(I dont know why conservstives love audio-based media and liberals love text, but it has been a trend for decades. Newspapers and maagzines were liberal when talk radio was conservative, now reddit is liberal while podcasts lean conservative.)",
                                                    "score": -7,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "kwanijml",
                            "body": "You're doing the spamming right now, mate.\n\nWhat are you bringing to the discussion here about anarcho-capitalism (replacing the state with market-based institutions)?",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "Rogue-Telvanni",
                                    "body": ">Is there anywhere else that I can go to where I can talk with like minded Ancap/Libertarian types that isn't an astroturfed hell hole?\n\n\n\nReading comprehension is hard.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "kwanijml",
                                            "body": "You're still doing the spamming right now, mate.\n\nWhat are you bringing to the discussion here about anarcho-capitalism (replacing the state with market-based institutions)?\n\nHere's some suggested studying to learn what anarcho-capitalism is about-\n\n1. [The Problem of Political Authority](https://archive.org/details/problem-of-political-authority-the-michael-huemer/page/n1/mode/1up) by Michael Huemer\n\n2. [Machinery of Freedom](http://www.daviddfriedman.com/Machinery%203rd%20Edn.pdf) by David Friedman\n\n3. [Price Theory](http://www.daviddfriedman.com/Academic/Price_Theory/PThy_ToC.html) by David Friedman\n\n4. Any other mainstream econ textbooks as far into the subject as you can handle with as much of the math as you can handle; but I do recommend starting with Modern Principles of Economics by Alex Tabbarok and Tyler Cowan.\n\n5. [The Calculus of Consent](http://files.libertyfund.org/files/1063/Buchanan_0102-03_EBk_v6.0.pdf) by James Buchanan and Gordon Tullock\n\n6. Any other mainstream political economy texts or works, but I recommend Governing the Commons by Elinor Ostrom, and though not a book, [Mike Munger's intro to political economy course](https://youtube.com/playlist?list=PLEJy2f_EWBqX1yIF-VP1MJsgnYy8OLK7t&si=LEgVKe5rGO9-Qz4-) available on YouTube.\n\n7. Rothbard's [Man, Economy, and State](https://mises.org/library/man-economy-and-state-power-and-market).",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "HozzM",
                    "body": "It seems to be a problem in very specific subs too now.\n\nWhen the Elon “Nazi salute”thing happened, many very subject matter specific subs I’m in started banning twitter links.  The only ones immune to it were subs that were created explicitly to get away from that sort of thing previously.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Ryyyhn",
                    "body": "Unless your hobbies and non political interest include EVs, Solar, Self driving cars or Tesla. Which are now somehow political",
                    "score": 6,
                    "replies": [
                        {
                            "author": "BrizerorBrian",
                            "body": "Because they support a man who is an authoritarian that wants to rule the country? Have you heard of  [Yarvin?](https://youtu.be/NcSil8NeQq8?si=3RKRbkxaSpVnWDSs)\n\nFiefdoms are not anarchy.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "WBigly-Reddit",
                    "body": "r/pic will ban you remotely for posting on Trump sites.  You don’t have to visit it.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Terrible_Penn11",
                    "body": "r/pics and r/bumperstickers are absolutely brutal",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "flashmob321",
                    "body": "The model tank and airplane subs are infected also you can get banned from the main subs for posting a model tank or plane with a swastika on it and be labeled a nazi just cus you built a historically accurate model lol",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "bongobutt",
                    "body": "Specific interest subs aren't even remotely safe. Comics, gaming, art - you name it, and you'll find subs that are banning for overtly political reasons or culture war crap.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "BlackMouth_Cur",
            "body": "Bro Reddit has been like for what feels like a decade. Its the biggest echo chamber on the internet.\n\nNo good alternatives have sprung up so this is what we get until that happens.",
            "score": 47,
            "replies": [
                {
                    "author": "ILikeBumblebees",
                    "body": "It's been this way since about 2016.  Before that time, there was actual substantive discussion here.  Then we got flooded first by a flood of 'alt-right' bridgaders, followed by socialist brigaders, all pretending to be libertarians, who then started arguing with each other about which form of collectivist authoritarianism is the most consistent with ancap.  Then we started getting LLM bots arguing these same positions.  That's basically what's been happening here for the past 8-9 years.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ToxicRedditMod",
            "body": "Children raised without discipline tend to throw tantrums when they don't always get their way.",
            "score": 49,
            "replies": [
                {
                    "author": "Johnny_blueballs6969",
                    "body": "Yes, to many that is a good description of Trump and Vance. The reaction to that is not equivalent to the initial actions. You may not agree with this, but that is what many millions feel.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "JamesMattDillon",
            "body": "I am beyond tired of every sub being about Trump.  For people that don't like him, they sure post about him more than his supporters do.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Daysleeper1234",
            "body": "Dude, I organize my feed and it still seeps in. It's incredible. Totally unrelated topic, like 3rd - 4th comment: Trump or Elon. And if you comment something, they start sarcastically answering well sorry that we are concerned with future of this planet. You had 4 years of him, media thrashing was even worse than now, and we are still here. Chill the fuck out.",
            "score": 7,
            "replies": []
        },
        {
            "author": "sic_parvis_magna_",
            "body": "It's hilarious. When I point it out they deflect HARD.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Level82",
            "body": "I have a secondary hobby of getting banned from random subreddits that have been taken over....\n\nLatest one: in Texas I got banned for asking about sailing options in the Gulf of America",
            "score": 5,
            "replies": [
                {
                    "author": "flashmob321",
                    "body": "It's like a sport to me lol I love getting banned from these subreddits",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "seedman",
            "body": "I use reddit as my liberal bias news source.  If I wanna see the legitimately craziest take on something, I come here.  \n\nI wish it wasn't the case.  I happen to like the concept of Reddit a lot.  Been here for like 14 years. I wish there was an even distribution of political views, and I wish moderators were fair and stopped just banning people they don't like.  But that will almost certainly never happen.",
            "score": 5,
            "replies": []
        },
        {
            "author": "youoldsmoothie",
            "body": "This site- like Twitter, Facebook, Instagram, literally every social media- is overrun with bots trying to sew discord and discontent. Some bots are Russian, some are Chinese, probably most are USA. They're all trying to play with our heads, sway our vote. Generate anger first, then direct that anger toward whoever they please. Palestine, Israel, Russia, Ukraine. Man they own our brains.\n\nOnly solution is to use the internet sparingly, remember that anyone you interact with online has high likelihood of being a bot. I might be a bot, you'll never know.\n\nAnd vote to get us (USA) out of these dumb fucking international proxy wars",
            "score": 14,
            "replies": [
                {
                    "author": "liquorbaron",
                    "body": "Unfortunately, Dead Internet Theory is real especially on this website.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "AgainstSlavers",
                    "body": "> probably most are USA.\n\nDefinitely most are.  They have the biggest funding by far.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "PacoBedejo",
            "body": "You're seeing the results of the daycare generations. When the only way to get attention from a \"caregiver\" is to make the biggest scene... well... that shit doesn't end for some and they stay that way as adults.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Ok-Section-7172",
            "body": "Facebook is worse now too. 1 out of 10 posts are people I know, the rest are suggestions of political accounts and memes from both sides. I am staying off there.",
            "score": 4,
            "replies": []
        },
        {
            "author": "PsychologyPure7824",
            "body": "I mean, Ghislane Maxwell was a supermod and they killed off the founder. I think this site is designed to control discourse in the internet age.\n\nYou have to understand that there are no forums online to meaningfully discuss things and then get that information widely viewed and responded to. They have been systematically shut down over the last two decades. Warfare tier money and operations to do so.",
            "score": 5,
            "replies": []
        },
        {
            "author": "myadsound",
            "body": "The more anti-state you are the more you enjoy seeing trump get dragged.\n\nAncaps = anti-state\n\nTrump = the state",
            "score": 7,
            "replies": []
        },
        {
            "author": "jonnydrangus",
            "body": "TDS is a real problem",
            "score": 8,
            "replies": []
        },
        {
            "author": "Leading_Air_3498",
            "body": "You can rarely have a conversation with an ideologue, which you've clearly noticed. People aren't generally taught how to think, they think in terms of language and not outside of it, so they're often limited to patterns of thought revolving around general perceptions of words not realizing that dictionary definitions are commonly circular and self-defining.\n\nI'm often surprised that the lights turn on every day, to be frank. How us monkeys managed to even get this far without exterminating everyone and everything because of their delusions is beyond me.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ghazzie",
            "body": "It really has gotten bad. I keep saying I need to stop wasting my time here. I thought the bots would go away after the election but since the inauguration it’s gotten way worse.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Grouchy_Competition5",
            "body": "Yeah, brigading is in full swing. I only joined a few years ago - what was this sub like during Trump 1.0?",
            "score": 3,
            "replies": [
                {
                    "author": "ILikeBumblebees",
                    "body": "From about 2016 forward, it was filled to the brim with nationalists and communists posing as libertarians.\n\nBefore then, it was actually a good forum for discussing economics and political philosophy.  So was /r/libertarian, which has been taken over by... well, I don't exactly know who, but someone who is banning libertarians for posts that make libertarian arguments.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "ILikeBumblebees",
            "body": "Honestly, sometimes I wonder if the anti-Trump bots are arguing with the pro-Trump bots, with no actual users involved in the mix.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Ok-Perspective87",
            "body": "Dude PCM used to be great and ever since Jan 20th has been completely astroturfed",
            "score": 3,
            "replies": []
        },
        {
            "author": "yadius",
            "body": "I noticed for the first time yesterday in a Youtube comments thread that 'redditor' is now being used as a synonym for 'retard'.\n\nie. \"Only a redditor would think that was a good idea\"",
            "score": 3,
            "replies": []
        },
        {
            "author": "NeedScienceProof",
            "body": "It's as if Reddit is CCCP owned and Democrat controlled - well, maybe that's the same thing.",
            "score": 7,
            "replies": []
        },
        {
            "author": "HKatzOnline",
            "body": "They lost control in Twitter so they are trying to push messages here that Google / the media can somehow reference as \"overwhelming populace support\" of an idea, etc...",
            "score": 5,
            "replies": []
        },
        {
            "author": "kwanijml",
            "body": "We're against trump here too. And we're tired of being inundated by both pro/anti-whatever-politician spam, and posts complaining about being banned from some other site...like this post.\n\nThis is not your personal refuge from vaguely political nonsense.\n\nThis is a sub to specifically discuss anarcho-capitalism, which is the replacing of the state with market-based institutions.\n\nHere's some suggested studying to learn what anarcho-capitalism is about-\n\n1. [The Problem of Political Authority](https://archive.org/details/problem-of-political-authority-the-michael-huemer/page/n1/mode/1up) by Michael Huemer\n\n2. [Machinery of Freedom](http://www.daviddfriedman.com/Machinery%203rd%20Edn.pdf) by David Friedman\n\n3. [Price Theory](http://www.daviddfriedman.com/Academic/Price_Theory/PThy_ToC.html) by David Friedman\n\n4. Any other mainstream econ textbooks as far into the subject as you can handle with as much of the math as you can handle; but I do recommend starting with Modern Principles of Economics by Alex Tabbarok and Tyler Cowan.\n\n5. [The Calculus of Consent](http://files.libertyfund.org/files/1063/Buchanan_0102-03_EBk_v6.0.pdf) by James Buchanan and Gordon Tullock\n\n6. Any other mainstream political economy texts or works, but I recommend Governing the Commons by Elinor Ostrom, and though not a book, [Mike Munger's intro to political economy course](https://youtube.com/playlist?list=PLEJy2f_EWBqX1yIF-VP1MJsgnYy8OLK7t&si=LEgVKe5rGO9-Qz4-) available on YouTube.\n\n7. Rothbard's [Man, Economy, and State](https://mises.org/library/man-economy-and-state-power-and-market).",
            "score": 7,
            "replies": [
                {
                    "author": "Vinylware",
                    "body": "Bro is spitting facts.\n\nAll there is now is statist and MAGA propaganda on this sub. It is unfortunate, not saying that discussing and conversing other ideals is wrong, but when it is clearly one-sided it defeats the purpose of actually having a well in-formed conversation.\n\nSay something negative about Trump or show concerns over his proposals and his supporter screech and deem it \"Trump Derangement Syndrome\". It’s usually the same talking points and when asked the answers are vague on what constitutes TDS.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "liquorbaron",
            "body": "Again, as a reminder, Jizzlane Maxwell was a head global moderator for r news the biggest sub on the site. That's right... Jizzlane Maxwell curated the news there. Jizzlane Maxwell is the daughter of famed spy chief of Mossad Robert Maxwell. She is also now in jail for being the handler to Jeffrey Epstein. \n\nThe ENTIRETY of this site is to dictate narratives pushed by intel agencies and foreign intel agencies via their agents and mass bot use. Even subreddits that have ZERO to do with politics inevitably end up with some person posting something political. My advice would be to barely use this shithole site ONLY for non political things like needing advice on buying a new camping tent.\n\nEDIT: Also I will add that intel agencies and their NGOs are going nuts right now spamming sites because Trump may actually end the war in Ukraine. So they know their funding is going to go so they're bombarding websites right now.",
            "score": 4,
            "replies": [
                {
                    "author": "mrbgz",
                    "body": "This is the answer. It's been common knowledge in the \"theorist\" communities that reddit has been a corporate/military astroturfing machine since almost the beginning. I found [this video](https://www.youtube.com/watch?v=V7GtYaruTys) on the topic quite interesting.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "almondreaper",
            "body": "Stay away from \"mainstream\" subs there's like 20 subs on reddit that aren't hive mind garbage",
            "score": 2,
            "replies": []
        },
        {
            "author": "shibbster",
            "body": "My favorite are the \"apolitical\" subreddits like military and army that are allowing blatant \"Slavi Ukraini, FUCK TRUMP/HEGSETH\" posts.",
            "score": 2,
            "replies": [
                {
                    "author": "Rogue-Telvanni",
                    "body": "Yeah, I'm an Army vet and follow those subs, too. They're insufferable.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "OJ241",
            "body": "There’s always 4chan but seriously I just scroll past. People don’t communicate online how they do in person so no serious discussion where view points can be changed or properly understood can ever be had.",
            "score": 2,
            "replies": []
        },
        {
            "author": "WhiteSquarez",
            "body": "You're also seeing a different kind of propaganda, in which someone asks a very specific question as a set-up for someone in the thread to post the narrative.\n\nFor instance, both the r/ask and the r/outoftheloop subs do this exact thing.\n\nNotice how specific the question is, and then check out the answers.\n\nThese are not just curious redditors.",
            "score": 2,
            "replies": []
        },
        {
            "author": "nomosolo",
            "body": "We know why, the DNC got caught red handed before the election deliberately taking over subs and filling them with propaganda and talking points and manipulating the front page. Reddit didn’t address it or do anything about it, because of course they didn’t. \n\nSo now we are left with basically every mod of any fun sub being either forced to not take down political posts or just being complicit in it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Inspectorpeck",
            "body": "I mean a sub about pics has AIDS. This is the only fresh sub that hasn’t been ruined.",
            "score": 2,
            "replies": [
                {
                    "author": "Rogue-Telvanni",
                    "body": "They're trying, man. Look through the comments and see how many just come here to sling insults and call me a Trump supporter.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "randyfloyd37",
            "body": "Top down control strategy. Big Tech using algorithms to foment division and maintain/recruit the young social media users.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Agitated-Can-3588",
            "body": "There's a reason why Democrats always distance themselves from progressives during any election. Because they have no ability to bring others on board and only drive people away with condescension. \n\nIt's a constant throughout history. Vietnam war protesters didn't say Vietnam is a quagmire and it serves no purpose. They spit on soldiers, called them baby killers, and even supported the other side of the war. \n\nIt's impossible to get through to them that telling the people who voted for Trump that we hear your concerns and here's how we can address them better than Trump might be a better idea than telling them their concerns are not legitimate and they are stupid, racist, misogynistic, Nazis. You need to convince these people to vote for you not just insult them.",
            "score": 2,
            "replies": []
        },
        {
            "author": "2humpchump420",
            "body": "Ya im banned from all these libtard subs and that's all the dumb crap I see",
            "score": 2,
            "replies": []
        },
        {
            "author": "neutralpoliticsbot",
            "body": "Use RES extension and just filter out all the idiotic subs",
            "score": 2,
            "replies": []
        },
        {
            "author": "lordstickmax",
            "body": "seriously. /grimdank and other 40k reddits are insufferable at times.",
            "score": 2,
            "replies": []
        },
        {
            "author": "anna_lynn_fection",
            "body": "Yeah. I can't count the number of subs I unsubbed from because I'm so sick of the popularity of people showing off their TDS, and EDS.\n\nIt's really funny with Elon, because it wasn't long ago, Elon was their hero, and now if Elon gets a sliver it's all about hating on Elon and gloating that something bad happened to him.",
            "score": 2,
            "replies": []
        },
        {
            "author": "bonerland11",
            "body": "They banned r/the_Donald for 1% of what's showing up on r/pics daily.",
            "score": 2,
            "replies": []
        },
        {
            "author": "2strokeYardSale",
            "body": "If you create a place to discuss free markets, individual freedom, self-determination, etc., they will find it and undermine it. That's part of their playbook.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Skym3jp",
            "body": "Communists can be more boring and stupid than \"fake libertarians\"",
            "score": 6,
            "replies": []
        },
        {
            "author": "RemarkableKey3622",
            "body": "I need karma. orange man bad. there, did that work?",
            "score": 3,
            "replies": []
        },
        {
            "author": "Sythriox",
            "body": "I've just been trying to use X communities more.",
            "score": 3,
            "replies": []
        },
        {
            "author": "YardChair456",
            "body": "What is most annoying to me is that they take obviously false ideas and they all pretend it is real.  Like Musk being a Nazi or Trump being a russian agent are so obnoxious because they are such silly ideas, but they just pretend like tat is reality.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Kinglink",
            "body": "I mean if you only want people who say trump good... you're not exactly a ancap libertarian either. \n\nSpoiler, we're not trump bad, or trump good, this subreddit gets astroturfed enough in trump spam as it is.\n\nAnd before anyone tries to say \"he's not so bad\" Take it down act will violate the first amendment and harm the encrypted and private internet for decades to come.  That's just one act.  He's not as bad as I expected, I'll say that, but he's VERY far from a liberatarian and a number of his actions are questionable at best. \n\nPeople will jump to Elon, but even what DOGE has found... I mean most of it was on usaspending.gov... so we could have started there. Epstein list is being redacted (It hopefully will come out but not in a meaningful way.) and this idea of transparancy isn't there. \n\nThere are stuff he's being blamed for (AP not being allowed into signing events) which aren't even what they claim to be, but overall he's better than many but still heavily problematic as a president.",
            "score": 2,
            "replies": [
                {
                    "author": "Rogue-Telvanni",
                    "body": "> I'm not a big Trump guy\n\n\n\n\nReading comprehension is hard. If it were getting blasted with pro Trump shit, I'd be just as annoyed.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Kinglink",
                            "body": "Yeah you know, you say you're not but then spend the entire time bitching about anti-trump posts... \n\nWhich sounds quite a bit like someone who wants to see more positive trump posts. \n\nIf you really hated it, just say you're against politics being pushed into every corner of reddit, but you're not going to find a solution almost anywhere else on the internet, and you're in an inherently political subreddit as well. so...  not sure what you're point is.. since you're not a big trump guy?",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Rogue-Telvanni",
                                    "body": "Sick Kafka trap there, bro.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Kinglink",
                                            "body": "You're the one looking like a duck and quacking like a duck.  I'm just ignoring the \"not a duck\" sign you hung around your next. \n\nAnd your downvotes really help sell your argument.  Hope you find your echo chamber.  Truth social is that way.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "BendOverGrandpa",
                                                    "body": "It's always funny to me when I have someone previously tagged in res as a \"Trump shill\" that comes in with \"I'm not even a big Trump fan\" lol\n\nThese dishonest motherfuckers.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "kurtu5",
                    "body": "> Take it down act\n\nSCOTUS will shoot that down.  Which I am looking forward too.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Kinglink",
                            "body": "I hope so, but I always think it's better to stop that type of shit at it's inception, rather than relying on SCOTUS, because humans are fallible, and while there's 9 people there... well they've made some lovely decisions, (it's over used but Kobayashi is a perfect example)\n\nAnd that's one of those things that if it ever gets in place it'll never be removed and only grow the power of the government.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SkillGuilty355",
            "body": "I feel the same way. People are so obsessed with Trump and Musk.\n\nEvery single problem in their life is projected onto them.",
            "score": 2,
            "replies": []
        },
        {
            "author": "PG2009",
            "body": "Part of the problem is that a few crazy commie mods run numerous popular subreddits and collude with each other to ban users based on the fact that they also post in \"evil, forbidden, science-denying subs\".\n\nYou can actually use this to your advantage:\nOccasionally post something (stay on-topic) in an **evil, forbidden, possibly pro-Trump sub** and then when you post something in a generic, commie-statist run sub, their bots will automatically ban you.  Block that sub from your account and you will never see propaganda from it again!\n\nI started doing this during the NoNewNormal days, and my front page has never looked so clean!",
            "score": 2,
            "replies": []
        },
        {
            "author": "CakeOnSight",
            "body": "just block them, its a few accounts for the most part",
            "score": 2,
            "replies": []
        },
        {
            "author": "greyduk",
            "body": "Go take a walk. Worry about the things you can control. Actually practice stoicism, as your flair claims. ",
            "score": 3,
            "replies": [
                {
                    "author": "Rogue-Telvanni",
                    "body": "So, as a stoic, I should just accept constant propaganda and not look for an alternative?",
                    "score": 8,
                    "replies": [
                        {
                            "author": "ILikeBumblebees",
                            "body": "*Is* there an alternative?  For the last 10 years or so, every site on the internet seems to have been bombarded by propaganda, and online communities of every kind have been filled with entryists.  I'd love to go back to where we were 15-20 years ago, but how do we get there?",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "greyduk",
                            "body": "I just feel like if what you were looking for existed, you'd already know. Claiming you'd rather go back to Facebook makes you sound desperate for dopamine, which isn't very stoic.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "OnePastafarian",
            "body": "You know you can just make your feed only subs that you follow lol",
            "score": 2,
            "replies": [
                {
                    "author": "Rogue-Telvanni",
                    "body": "> I'm not a big Trump guy, but HOLY FUCK do I not need to see a billion blatantly astroturfed \"TRUMP BAD\" posts in *every single sub I follow.*\n\n\n\n\nReading comprehension is hard.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "bananosecond",
            "body": "I hate Trump, and I'm even sick of /r/pics or whatever.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MFrancisWrites",
            "body": "Communism is when Trump bad\n\nHell of a tirade for a guy who calls anyone left of shooting the homeless for sport a communist lol\n\n![gif](giphy|xUA7b0RgJ296MVY6C4|downsized)",
            "score": 1,
            "replies": [
                {
                    "author": "Rogue-Telvanni",
                    "body": "Bro.... what?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "MFrancisWrites",
                            "body": "Communism is when Trump bad\n\nHell of a tirade for a guy who calls anyone left of shooting the homeless for sport a communist lol\n\n![gif](giphy|xUA7b0RgJ296MVY6C4|downsized)",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Rogue-Telvanni",
                                    "body": "This is the definition of a strawman, but congratulations on beating me in the argument you were having in your head.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "kurtu5",
                                            "body": "You lost!  Now you have to sit in the corner until I tell you the floor is no longer hot lava.  I will make up some other rules soon!",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "MFrancisWrites",
                                            "body": "It's a fallacy to point out your absurd use of the word communism? Rich. \n\nI swear y'all memorized a book of fallacies to prevent you from having to think critically too often.\n\nPerhaps, now hear me out, the reason reddit is ablaze is that there's some really unprecedented shit related to executive powers going on? No? Well enjoy those art of the deal tariffs I suppose.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Rogue-Telvanni",
                                                    "body": "You're retarded. I'm specifically talking about subs like vexilologycirclejerk. Once again, reading comprehension is hard.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "MFrancisWrites",
                                                            "body": "Ah yes, a great bastion of literal communists. Funny thing about flags, communists love them more than anyone. Each comment is more absurd than the last. Idk if you can top that one. \n\nAlso least stoic dude I've ever seen use the stoic tag for sure lol",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "kurtu5",
                                                                    "body": "> Also\n\ni had to creep into your profile to find something to argue against because I had nothing otherwise.",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "kurtu5",
                    "body": "Your meds.  Take them.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "hazael10",
            "body": "aw does whitey snowflake need somewhere to run with his maga buddies to share Qanon theories lol",
            "score": -3,
            "replies": [
                {
                    "author": "3c0nD4d",
                    "body": "Pretty much.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "HipHopLibertarian",
            "body": "Trump is objectively bad on a number of issues.  It is Trump Derangement Syndrome to not realize Trump's faults.",
            "score": -3,
            "replies": [
                {
                    "author": "Rogue-Telvanni",
                    "body": "Ok? That doesn't mean I should be seeing posts about him on baseball and music subs.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "ILikeBumblebees",
                            "body": "What's scary is that I don't think it's all bots, and I don't think it's just on Reddit.  Modern society is seeing polarized politics seep into everyday life at an unprecedented level.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "3c0nD4d",
                            "body": "You're posting about him on a sub that's not about him that is overrun with posts about trump.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "HipHopLibertarian",
                            "body": "Maybe if the post was about the Village People",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "kurtu5",
                    "body": "Typical leftie behavior.  Redefine things so as to make them meaningless.",
                    "score": -3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Hoochnoob69",
            "body": "Old man mad at different world views, more at 11",
            "score": -6,
            "replies": []
        },
        {
            "author": "BrizerorBrian",
            "body": "What's your evidence for astroturfing? Do you have receipts? Maybe, just maybe, he's a terrible person.",
            "score": -16,
            "replies": [
                {
                    "author": "Rogue-Telvanni",
                    "body": "https://www.piratewires.com/p/the-terrorist-propaganda-to-reddit-pipeline\n\n\n\nhttps://thefederalist.com/2024/10/29/busted-the-inside-story-of-how-the-kamala-harris-campaign-manipulates-reddit-and-breaks-the-rules-to-control-the-platform/\n\n\n\n\nNot to mention the super organic, totally not astroturfing \"Should we ban X links?\"\n\n\n\n\nBut you keep burying your head in the sand.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "BrizerorBrian",
                            "body": "Oh your right! That's way worse than Musk banning people from the platform he overpaid for and reinstating the accounts of avowed white nationalitists and neo nazis is way different. No manipulation there. Go ahead and defend giving David Duke a platform. It's a choice. \n\nhttps://www.forbes.com/sites/roberthart/2022/11/25/elon-musk-is-restoring-banned-twitter-accounts-heres-why-the-most-controversial-users-were-suspended-and-whos-already-back/",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "WBigly-Reddit",
                                    "body": "BLM & Antifa?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "BrizerorBrian",
                                            "body": "How are they related to the topic at hand?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Rogue-Telvanni",
                                    "body": "Please try and form a single thought without a whataboutism.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "BrizerorBrian",
                                            "body": "You can't say one thing is good and another is bad when they have the same effect just because you agree with one. I never said that, if true, what the Harris campaign did was ok.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "LibertyFive3000",
                                    "body": "You betray the emotional basis of your argument when you can't stop yourself from trying to connect irrelevant points especially those which are random character judgements. As called out already, the \"whataboutism\" is palpable. \n\nTrump being awful and reddit being astroturfed are not related points. He could be an insufferable piece of shit and that doesn't make the astroturfing on reddit you seem hellbent to deny or dismiss any less real? \n\nYou then defend your first awful argument with a second false equivalence and suggest that astroturfing is no worse than: \n\n\\>\"Musk banning people from the platform he overpaid for and reinstating the accounts of avowed white nationalitists and neo nazis\"\n\nYou just had to inject your judgement of the deal's value? Who fucking cares if you or anyone else thinks he overpaid for it? Stop being so insecure that other people have lots of money they can spend how they see fit. \n\nThen you provide a link that mentions zero bans made by musk, instead just him unbanning people. People who mostly seem like shitbirds with awful takes, sure. Lucky for you, most of us are against banning people for having awful takes. \n\nI went ahead and tried to steal-man your argument and looked into bans he has made. From an ancillary skimming it looks like people get banned if they dox someone else. \n\nEither way, why are you here? There are so many other subs (re: echo chambers) you can go cry about this stuff to and your emotionally formed argument will be welcomed with open arms and bot generated upvotes.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "BrizerorBrian",
                                            "body": "You talk about echo chambers but don't admit that that is what Twitter has become. This whole thread stems from the idea that Harris would trade over rights and be terrible for Americans. Exactly HOW was Harris worse for this country than Trump?\n\nAgain, defend David Duke having a platform. Not free speech, but what you, as a private entity, chose to platform, and by doing so is a tacit endorsement of that hatred.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "LoneHelldiver",
                    "body": "[https://thefederalist.com/2024/10/29/busted-the-inside-story-of-how-the-kamala-harris-campaign-manipulates-reddit-and-breaks-the-rules-to-control-the-platform/](https://thefederalist.com/2024/10/29/busted-the-inside-story-of-how-the-kamala-harris-campaign-manipulates-reddit-and-breaks-the-rules-to-control-the-platform/)\n\n  \nBut why are you pretending you aren't in that Discord right now?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "BrizerorBrian",
                            "body": "I don't even have a discord account. Go touch some grass for fucks sake.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "Rogue-Telvanni",
                                    "body": "So you just defend astroturfing and propaganda out of the goodness of your own heart?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "BrizerorBrian",
                                            "body": "Did I defend it? We are talking cross points here. Also, again, this is not \"oh well they do it too\".  ALL campaigns have a social media team. This ain't the gotcha you think it is.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "BendOverGrandpa",
            "body": "Oh look, the little fascist reporting speech he doesn't like cause people were really mean to Twumpy!\n\nFuck off to facebook, no one cares.",
            "score": -2,
            "replies": []
        }
    ]
}