{
    "title": "My pinned post is not being pinned on my profile.",
    "author": "ArtisticRiskNew1212",
    "subreddit": "help",
    "rank": 13,
    "score": 6,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.reddit.com/r/help/comments/1je7hkm/my_pinned_post_is_not_being_pinned_on_my_profile/",
    "id": "1je7hkm",
    "selftext": "I have tried the website and the app, and it shows my pinned post as just another post in my feed, about four days worth of posts down. \n\nI’ve tried re-pinning and un-pinning on both the website and the app. ",
    "comments": [
        {
            "author": "pinkyshark",
            "body": "I'm having the same problem. My guess is there was an update and now some things don't seem to work anymore. Hopefully they're working on it.",
            "score": 3,
            "replies": [
                {
                    "author": "ArtisticRiskNew1212",
                    "body": "I hope so.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ziggiesmallss",
            "body": "Just chiming in to say I’m having the same issue.  Pinned posts are still marked as such but they are not appearing at the top of my profile. Glad to know it’s not me just forgetting how Reddit works",
            "score": 3,
            "replies": []
        },
        {
            "author": "ChimpyChompies",
            "body": "Check now, this looks to be resolved? At least, your pinned post is there when looking at your profile page from here.",
            "score": 2,
            "replies": [
                {
                    "author": "ArtisticRiskNew1212",
                    "body": "Thanks!! It seems to be flip flopping between “resolved” and “still broken”",
                    "score": 2,
                    "replies": [
                        {
                            "author": "ChimpyChompies",
                            "body": "There's been quite a few weird things being reported in the last couple of hours, pinned posts being one of those.\n\nNo doubt it will settle down in a while.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AutoModerator",
            "body": "\nYou seem to be asking about [home feed recommendations](https://reddithelp.com/hc/en-us/articles/4402284777364) appearing in your home feed. Home feed recommendations are recommendations for posts that use machine learning (ML). They’re part of a new effort to improve the “Best” sort on Home feeds by personalizing and ranking the content to create the best feed for redditors.\n\nHome feed recommendations are available on the iOS & Android apps, as well as www.reddit.com. If you’d like to turn off these recommendations, visit your profile settings on iOS or Android and turn off the toggle next to Enable home feed recommendations: Allow us to introduce recommended posts in your home feed. On www.reddit.com, you can disable them within the [Feed Settings tab](https://new.reddit.com/settings/feed). Check out [this help center article](https://reddit.zendesk.com/hc/en-us/articles/4402284777364-What-are-home-feed-recommendations-) for more information on this setting.\n\n\nIf this automatic message has not resolved your issue, please wait for a human helper to come along and help you. You may also remove the 'Answered' flair from your post if you wish. **This post has NOT been removed.** \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/help) if you have any questions or concerns.*",
            "score": 0,
            "replies": []
        }
    ]
}