{
    "title": "Season of Discovery Phase 8 Coming April 8th - Scarlet Enclave Raid, Legendary Weapon Questline",
    "author": "Old-Soft5276",
    "subreddit": "classicwow",
    "rank": 8,
    "score": 62,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 58,
    "url": "https://www.reddit.com/r/classicwow/comments/1jea9t7/season_of_discovery_phase_8_coming_april_8th/",
    "id": "1jea9t7",
    "selftext": "https://www.wowhead.com/classic/news/season-of-discovery-phase-8-coming-april-8th-scarlet-enclave-raid-legendary-375969?utm_source=discord-webhook ",
    "comments": [
        {
            "author": "Mddcat04",
            "body": "Hunter weapon Ashbringer. As the prophecy foretold.",
            "score": 1,
            "replies": [
                {
                    "author": "WilmAntagonist",
                    "body": "And in the eeeeeeeeeeeeend",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Nipless-Cage",
            "body": "Gonna be so sad when SoD ends - most fun I've had with WoW since Legion.  I really hope they continue something after Phase 8, even doing BC content, but I doubt it.  Either way, excited for the last phase and I hope the new raid is a truly fitting end to this great game mode.",
            "score": 1,
            "replies": []
        },
        {
            "author": "pupmaster",
            "body": "Culminates :'(",
            "score": 1,
            "replies": [
                {
                    "author": "Arlune890",
                    "body": "F",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "-_earthbound",
                    "body": "I have hope & cope that it means Classic+ is actually coming soon",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Dahns",
                            "body": "It does but there will very probably be another \"test season\" before actual Classic+\n\nHere they added as much as they could, see what works. They announced they want a #FewerChanges so I assume they will remove as many bonus they can without undercutting the Classic+ feeling, we'll see\n\nSo Classic+ Confirmed, yes. But definitely not before long. Until then... SoD is our Classic+",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Dahns",
                            "body": "It does but there will very probably be another \"test season\" before actual Classic+\n\nHere they added as much as they could, see what works. They announced they want a #FewerChanges so I assume they will remove as many bonus they can without undercutting the Classic+ feeling, we'll see\n\nSo Classic+ Confirmed, yes. But definitely not before long. Until then... SoD is our Classic+",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "D4RTHV3DA",
                            "body": "SoD is Classic+\n\nIt might not be the changes and additions some folks specifically wanted, but how can people view it any differently?  It's revamped and added content to Classic.\n\nUnless SoD was blowing the doors down with new subscribers, SoD is going to be the extent of the classic+ content Blizzard is going to commit to.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Its-a-me-DankeyKang",
                                    "body": "SoD is SoD. A mix of both new things and things from other versions. They've (aggrend twice i believe) since its release that this was testing for something... whether that's Classic+ or just other iterations / seasons is the question.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "LerntLesen",
                                    "body": "Because aggrend said it’s a testing ground for a true classic+ experience later on I guess.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "CDMzLegend",
                                            "body": "aggrend has said a lot of lies aswell so why cling to cope on this one",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "pupmaster",
                                    "body": "They have straight up said it's not so why do we keep parroting this?",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "-_earthbound",
                                    "body": "SoD is not classic+",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "cryfive1",
                                    "body": "Aggrend has said many times that SoD is not Classic+ but rather a testing ground before they attempt it, keep perpetuating this lie.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "saluko",
                                    "body": "🤡",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Quigonwindrunner",
                    "body": "I wonder if there is some mixed messaging going on because that flies in the face of what Aggrend recently posted.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Quigonwindrunner",
                    "body": "I wonder if there is some mixed messaging going on because that flies in the face of what Aggrend recently posted.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "throwawayasdf1338",
            "body": "I hope they touch up on the loot, my main raid hasnt seen a single Blade of Inquisition or Gressil...",
            "score": 1,
            "replies": [
                {
                    "author": "jjester7777",
                    "body": "We're giving away the hunter/mage tokens but we still have like 4 priests and rogues in 4/8... Sucks",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "FierceDuncan",
                    "body": "My guild yas yet to see restrained essence of sapphiron or slayer crest",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Man_under_Bridge420",
                    "body": "People would hate it but for a seasonal mode they should as something like\n\nDisenchanting gear gives you 1 token dust. Spend like 20 dust tokens to reforge a gressil 40 for a inquisition blade \n\nMaybe also crush 5 tier tokens into a other token ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Ent3rpris3",
                            "body": "I've recently found myself advocating for a \"no, not that item\" loot idea.\n\nAdd some kind of orb thingy before each wing or set of bosses; Say you get an item nobody wants - next week, you can put that item and some dust into this orb, and it guarantees that item will *not* drop, instead upping the drop rate of everything else that could instead drop accordingly.  So instead of getting those random bracers nobody wants 3 weeks in a row, you can keep it, 'surrender' it the next week, and up the drop rate on everything else that boss drops.  Doesn't outright bypass the rng, but makes it feel a little more forgiving and makes those low-drop-rate items a little more accessible while sparing you the wasted effort of getting an item you already know you won't use.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Man_under_Bridge420",
                                    "body": "Pretty good idea but might be hard to implement with raid id’s would have to maybe be like a series of quests?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Ent3rpris3",
                                            "body": "Yeah, and it has the potential to be pretty griefable in the wrong hands",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "notsingsing",
                            "body": "<shatters after 10 repairs>",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "DashKT",
                            "body": "Hard pass",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Man_under_Bridge420",
                                    "body": "Why. Void crystals are less than a gold. Most loot is dead drops",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "DashKT",
                                            "body": "I definitely understand why some people would like a system like that, but I personally don’t believe that every player deserves every piece of loot. An item’s rarity is part of what makes it special in my opinion. I donno, maybe I’m the minority",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Man_under_Bridge420",
                                                    "body": "My guild has more atieshes than hungering cold by 3-0\n\nThe warriors and mages have 5 sets of tier while the druids pallys shamans are fighting over scraps\n\nSo the rare stuff isn’t really that rare for some classes",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "DashKT",
                                                            "body": "Yeah, I can definitely see both arguments",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "davechacho",
            "body": "Does this mean no Undead Paladins/Dwarf Shaman? I know Aggrend said something like that would come with obvious signs and announcements, seems like something they'd post about to generate hype",
            "score": 1,
            "replies": [
                {
                    "author": "DryFile9",
                    "body": "Aggrend has said there are going to be more updates but that its more a series of smaller updates.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Tad0422",
                    "body": "My gut tells me this is a Classic+ thing.  They are probably using this codebase for Classic+ and the Shaman/Pally things leaked over.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "pupmaster",
                            "body": "Come on now dude lol",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "frou6",
                                    "body": "High level of copium in his blood",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Nice-Entertainer-922",
                    "body": "There were no indications of those coming in the first place aside of a single NPC that can be added during a coffee break just to throw out a red herring.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "DiarrheaRadio",
                            "body": "But some guy made a half dozen clickbait videos talking about it!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "TuffManJoens",
            "body": "Oh fuck SoD hype",
            "score": 1,
            "replies": []
        },
        {
            "author": "The-Only-Razor",
            "body": "Do we know how many people Scarlet Enclave is for? 5, 10, 20+?",
            "score": 1,
            "replies": [
                {
                    "author": "Nipless-Cage",
                    "body": "If I had to guess, tuned up to 20 but can invite more similar to Naxx",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Nystalis",
                    "body": "If it’s not 10 I swear to god I’m going to piss and shit myself!!!!!!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "davechacho",
                            "body": "When I'm in a bad faith contest and my opponent is a classicwow reddit poster:",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Siujade",
            "body": "/play The Doors - The End",
            "score": 1,
            "replies": []
        },
        {
            "author": "NewAdhesiveness6007",
            "body": "Does it stay that this is the last phase?! NOOO! Best version of wow by a mile!\n\nPs. When patch notes?",
            "score": 1,
            "replies": [
                {
                    "author": "Sc4r4byte",
                    "body": "Just based on dates, the approximate time that a theoretical phase 9 would release... would probably be around the same time as mop pre-patch release.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "NewAdhesiveness6007",
                            "body": "You think that theres gonna be phase 9 also? I dont understand if the want to stop SoD developement. That best opportunity try something wild in vanilla world!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "kl0wny",
            "body": "So I wonder what this means. Will servers stay up for a long time at phase 8 or will they reset at some point back to phase 1 or does it just end?",
            "score": 1,
            "replies": [
                {
                    "author": "DELUXExSUPREME",
                    "body": "Aggrend said just two weeks ago that they have \"many, many, many months of content\" still planned.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "DryFile9",
                            "body": "Yeah thinking about it that probably means smaller updates and not new raids..which I kinda get. Power creep is a real issue and at this point you can argue the game has more than enough raid content to offer.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DiarrheaRadio",
                    "body": "Blizzard has repeatedly said SoD servers will be left up, like era servers.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "AshenEdict_",
                    "body": "I’m normally not a “F R E S H” guy, but if they did restart from P1 I’d definitely go. I quit at the start of P3 because my group of 10 didn’t want to find 10 others to raid with… but I think I’d just treat SoD as a more casual thing this time and find an entirely new group to run with, just be a face in the crowd instead of raid leading.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "K0rupcija",
            "body": "was raid tested on ptr or everyone goes first time?",
            "score": 1,
            "replies": []
        },
        {
            "author": "FalconGK81",
            "body": "Why are they speedrunning the content!?  Naxx is gonna be like 8 weeks, and most guilds took at least 3 lockouts to even sniff HM4.  So you take all the time to put in these sweet fucking mounts, and then you give like 4 weeks to get them?  I do not understand this at all.  Naxx is a fun raid.  People would be happy to do it for at least another month longer.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Low-Basket670",
            "body": "Sorry no time for SoD need to grind r14",
            "score": 1,
            "replies": []
        },
        {
            "author": "DryFile9",
            "body": "Interesting that its framed as a questline. Aggrend has also said they are doing more but that it might be like P8.1 etc. rather than a full P9...which I kinda get. Power creep is a real issue and at this point you can argue the game really doesnt need more raids.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GetBuckets13182",
            "body": "It’s happening ",
            "score": 1,
            "replies": []
        },
        {
            "author": "KalleKallsup",
            "body": "SCARLET ENCLAVE HYYYYYYYPE",
            "score": 1,
            "replies": []
        }
    ]
}