{
    "title": "Is the market closed for new grads? Should I shift career?",
    "author": "iAhMedZz",
    "subreddit": "cscareerquestions",
    "rank": 8,
    "score": 161,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 103,
    "url": "https://www.reddit.com/r/cscareerquestions/comments/1jdv8bx/is_the_market_closed_for_new_grads_should_i_shift/",
    "id": "1jdv8bx",
    "selftext": "I'm a Computer Engineering grad, graduated in 2023. My colleagues got jobs back then but I had obligatory military service and just finished in 3 months ago.\n\nI have applied to countless amount of jobs, all of them are entry level or require > 2 experience (more on that at the end).\n\nI'm getting either one of the following:\n\n1- No response at all.\n\n2- \"Unfortunately, we decided not to move forward with your application\".\n\n3- I get a coding challenge, I pass it, then I get no response or rejection.\n\n\nAnd, for the rejections, I haven't got a single feedback on the rejection reason.\n\n\nThe vast majority of the job postings I see are either seniors or unpaid internships at startup companies with 2-4 employees (sometimes they will pay for full-time jobs, but about half the price of the market prices that I may herd cattle instead). Few junior positions I see and that's the ones I apply for, only to find out every listing has +200 application at the very minimum, and about 15-25% of them are seniors applying for junior positions (stat shown by LinkedIn premium).\n\n\nI apply for entry/junior web positions (full stack, backend, or frontend), and I have experience on some certain full stack languages/frameworks but that's only coming from my personal projects, since I can't get a real job that will count as work experience. I do get the job done, and made some few gigs on freelancing before, but never worked under a senior before within a \"company\".\n\n\nI have been seriously thinking about shifting careers. I honestly don't know what to do at this stage. \nI keep thinking that I should dive deeper and learn more languages/frameworks, but then I see most job postings require minimum +5 years experience and the problem is not about languages or frameworks rather experience and there is a great chance that I'd be just wasting time. If I shift career, I honestly regret the amount of effort and time I have wasted on getting my degree. Why this is a lose-lose situation?",
    "comments": [
        {
            "author": "Plat_A_Puss",
            "body": "I ussually fail the coding challanges so, theres that 😂",
            "score": 70,
            "replies": []
        },
        {
            "author": "svix_ftw",
            "body": "yes closed for repairs and renovations",
            "score": 201,
            "replies": [
                {
                    "author": "NoDryHands",
                    "body": "Except nothing is getting repaired or renovated while it's closed, just disintegrating even more",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "morg8nfr8nz",
                    "body": "I like this metaphor a lot",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "Moleculor",
            "body": "I looked for two years. Eventually gave up and went back to my old retail job I quit to return to school. At basically the same rate of pay I was earning when I quit six years prior.",
            "score": 37,
            "replies": []
        },
        {
            "author": "fake-bird-123",
            "body": "Pretty common these days. The job market is as dead as a door knob. It's not coming back for awhile. Do with that info what you will.",
            "score": 189,
            "replies": [
                {
                    "author": "Acrobatic-Macaron-81",
                    "body": "Well that’s depressing ig tech is dead for the states. Might have a whole pilot situation in a generation or so.",
                    "score": 19,
                    "replies": [
                        {
                            "author": "DesperateAdvantage76",
                            "body": "During Covid, the number of devs being hired was insanely overinflated, to the point where a lot of people from bootcamps were also joining the workforce. Companies to this day are still shedding that workforce, leaving little room for inexperienced new hires. Tech is thriving, but still bloated with hires.",
                            "score": 46,
                            "replies": [
                                {
                                    "author": "svix_ftw",
                                    "body": "yeah companies are still desperate for senior engineers. \n\nIts mostly the junior programmer job market thats dead.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Clueless_Otter",
                            "body": "OP is some sort of Middle Eastern, not in the US.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "Tom1380",
                            "body": "What's the pilot situation?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "FreshPrinceOfIndia",
                    "body": "My only question is, people who say yeah its over (for now) what are young people supposed to do. I left cs for i.t., but that doesnt seem to be very smart either. \n\nMy passion is art...dgaf about cs or it. But i do like eating and having a roof over my head. No that doesn't mean i should just work at my local supermarket forever. People like me also deserve a chance to climb the ladder to a better life",
                    "score": 34,
                    "replies": [
                        {
                            "author": "fake-bird-123",
                            "body": "It means the world has failed your generation.",
                            "score": 76,
                            "replies": []
                        },
                        {
                            "author": "WorstPapaGamer",
                            "body": "I graduated with an accounting degree in 09. Very similar to this market. I couldn’t get a job in the field. I didn’t do an internship and wasn’t great at school.\n\nCouldn’t find a job for a year but after that I got a job working at a front desk of a hotel. I worked my way up to director of sales over 7 years. I was offered GM shortly after that (I left the hotel to go back to school for CS when the owners offered me the GM position). \n\nGrowing up everyone wants to be lawyers and doctors (or maybe SWE?) but the cold truth is that most will not.\n\nSometimes you have to start in the bottom and work your way up. It sucks working low wage jobs.",
                            "score": 23,
                            "replies": [
                                {
                                    "author": "csanon212",
                                    "body": "Thank you. You were reasonable. I see people on here that are 18 months post graduation, unemployed, still trying to get a tech job, and haven't pivoted. A pivot doesn't mean homelessness and burger flipping.",
                                    "score": 16,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "pugRescuer",
                            "body": "I interview new college grads regularly. Life’s not all doom and gloom.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "Comfortable-Insect-7",
                                    "body": "Doubt you hire them though",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "pugRescuer",
                                            "body": "I hire the good ones and those who show potential. The sour attitude in here is sort of comical. If you want help interviewing message me, over a decade in FAANG.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "Easy-Yam2931",
                                                    "body": "I messaged",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Comfortable-Insect-7",
                                                    "body": "Theres no point im 10 months from graduating with no job my life is over",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "author": "pugRescuer",
                                                            "body": "Is the best use of some portion of your finite time alive to be complaining on a cs career advice subreddit when you're convinced your life is over and you have no future in CS?",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "author": "Comfortable-Insect-7",
                                                                    "body": "I think its good to help people avoid CS so they dont ruin their career.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "hidethemop",
                                                                            "body": "Honestly u have a fair point",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Ok-Obligation-7998",
                            "body": "You will need to embrace poverty",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "FreshPrinceOfIndia",
                                    "body": "Its joever",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Clueless_Otter",
                            "body": "For one, it is certainly possible to get a CS job still. Don't listen to anyone who claims otherwise. Difficult, especially relative to the past 15 years or so? Yes, definitely. But still very possible. \n\nBut secondly, it's not like tech jobs and minimum wage jobs are the only jobs in the economy. There are plenty of other jobs out there.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "Comfortable-Insect-7",
                                    "body": "Its also possible to win the lottery but thats not viable for most people",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Aceboogie0314",
                            "body": "This is my question as well, what do we do now?",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "PhysicalLurker",
                            "body": "Likely controversial, but once everyone who came to CS without an interest in CS moves to something else, I believe the supply of engineers will stabilize and it'll be good for CS folks. \n\nThis idea that everyone deserves a chance to climb the ladder is a beautiful concept that politicians peddle. But how exactly would that work in practice? If everyone can climb then the highest unoccupied rung becomes the floor. This argument of \"everyone deserves\" taken to its logical conclusion quite simply reaches socialism. There's literally a propaganda poster showing how a violinist would thrive in a socialist society whereas he won't in a capitalist one.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "FreshPrinceOfIndia",
                                    "body": "I see this reasoning often but I dont think incompetent students are getting through cs. It stems from this idea that after too many tech influencers posted about this very chill visual of a day in the life of an swe, millions flooded cs. \n\nBut CS has always had a notorious drop out rate, long before influencers came around. I do not believe even 10% of those starry eyed doomscrollers made it through the first semester.",
                                    "score": 10,
                                    "replies": []
                                },
                                {
                                    "author": "blessed_goose",
                                    "body": "The problem is that CS became The Major for academically talented kids who otherwise had no idea what to do after high school. People are going into this degree with learning skills, natural intelligence, etc. but no real direction or reason",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "csanon212",
                                    "body": "I'd say about 1/3 of people who have jobs upon graduating totally leave the industry in the first 2 years",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "zobee",
                            "body": "It's still possible to get a CS job, it will just look much harder for most folks. I think if you have the ability to live low-cost and maintain your continuing education (not just coding but product) as a Jr. you can find an entry point via start-up, however you would need to keep at it for maybe a year+ for the opportunity while the market adjusts to new realities. \n\nEventually this down period will have filtered out enough folks (who probably could have broke through a few years ago) that there will be a need for low salary Jr engineers, but you will need the privilege of not having to support a family or already be well resourced to have the staying power to both gain marketable skills and be prepared for when the market thaws out. \n\nThat is, if the economy doesn't collapse and VC funding doesn't dry up. It's an important time to be creative right now.\n\nEdit: Also, my dude, your passion can be art but you can have more than one passion. I would recommend getting passionate about coding if you want to make a living off of it. It won't be the same passion but you can't make it for long enough if you convince yourself you're not doing something you aren't interested/fascinated by. Try not to box in your passion, find passion in \"craft\" because software is not devoid of art if you think imaginative.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "gnivriboy",
                            "body": "> My only question is, people who say yeah its over (for now) what are young people supposed to do. \n\nIgnore cscareerquestions and figure out where you are failing in the interview cycle. Then improve there. For most people, it is going to be \"grind 200-500 leetcode questions.\"",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "dijkstras_revenge",
                    "body": "I think the phrase you meant to say is “dead as a door nail”. It comes from a time when nails were hand forged and were generally reused, but because of the way door nails were bent when nailing doors together they were no longer fit for reuse.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "fake-bird-123",
                            "body": "Nope, this is a local version of the same saying.",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "dijkstras_revenge",
                                    "body": "https://en.m.wiktionary.org/wiki/dead_as_a_doorknob\n\n> Possibly from a misinterpretation or misunderstanding of the expression dead as a doornail. See usage notes below.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "fake-bird-123",
                                            "body": "That's great, this is my locales version of the saying. This may come as a shock to you, but different regions on the planet may speak differently from you. For example, in Spain, they speak Spanish. In the UK, they speak English. I know this is a foreign concept to you, but its an important lesson to learn as you wrap up middle school.",
                                            "score": -8,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Head-Wave6105",
                    "body": "I'm curious what makes you say that?  Not saying I disagree or anything.  Do you think this applies ONLY to entry level positions or would you loop management/at level positions in as well?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "fake-bird-123",
                            "body": "So, we are in a period of contraction for companies due to the uncertainty in the world (tariffs, strong possibility of more war). The stock market and economy hate uncertainty. So companies will want to weather the storm. This is done by simply not spending money and/or cutting costs (layoffs). \n\nI don't think this applies to only entry-level roles, but it will likely disproportionately impact them. All levels will suffer as the already thin number of jobs starts to evaporate.\n\nThis gets quite a bit deeper and there's more to say, but this is reddit so I'm not gonna write a thesis on global economics.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "CTProper",
            "body": "If you’re passionate stick with it. If not maybe look at the trades but don’t give up on your dreams if you really want it!\n\nNow that I’ve been a dev for a few years I actually wish I chose a different career and just did dev on the side.\n\nI would love to be in an industry, notice a deficiency, then code and sell a solution for it",
            "score": 80,
            "replies": [
                {
                    "author": "iAhMedZz",
                    "body": "I'm passionate about it that I never thought myself doing anything else in my life other than software-related stuff. It's just, you know, you gotta pay rent and food and stuff, these things get in the way and you need a job to get past them :)",
                    "score": 16,
                    "replies": [
                        {
                            "author": "productive_monkey",
                            "body": "FYI software engineering is not like what they sell it as in college. Not saying you aren’t passionate but it’s a job at the end of the day, and you haven’t experienced it yet, and it’s more about who deals well with doing the job stuff.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "pugRescuer",
                                    "body": "In other news, jobs are jobs.",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "yellajaket",
                                    "body": "This. The amount of complex things I built and studied in college is nothing compared to working in software. It’s like making a college student retake the 1st grade again and again until you get that new job or promotion where you’re now retaking the 2nd grade. You climb up the ladder but the ceiling for most people is 4-5th grade. Getting in middle school is where managerial careers start and getting into high school is where C-exec careers take off. Less than that ever get into the college level and getting into that college is less about hard skill and more about networking and luck",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "denkleberry",
                            "body": "I heard plumbing has great prospects",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ChiDeveloperML",
                            "body": "Post your resume, get referrals. If you really want it, you can get it",
                            "score": -4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Mundane-Fox-1669",
            "body": "if you were to shift careers, which one would you shift to",
            "score": 15,
            "replies": []
        },
        {
            "author": "Greedy_Principle_342",
            "body": "Almost no industry is doing well these days. If you pivot your career, you’ll likely run into the same things. Unless, of course, you want to go into a trade like truck driving or some healthcare fields. Most corporate jobs are dead right now, but they’ll come back. Everything is a cycle. Don’t give up if you’re passionate about it!",
            "score": 62,
            "replies": [
                {
                    "author": "TrueSgtMonkey",
                    "body": "Yeah, I was hearing about multi step interviews for fucking fast food jobs. Shit is abysmal right now",
                    "score": 25,
                    "replies": []
                },
                {
                    "author": "Comfortable-Insect-7",
                    "body": "The job market will keep getting worse",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "OkLychee9800",
            "body": "Apply to mid-tier semiconductor (read: not HPC) companies - they are looking for new grads to write firmware drivers and middleware. Most of them just cleaned house on older employees and are backfilling with some cheap new grads. Pay probably isn’t same as what you are expecting from a SaaS but it’s not bad for a first job - probably like $60K-$80K depending on the city/employer.",
            "score": 20,
            "replies": [
                {
                    "author": "tehMoerz",
                    "body": "Any companies you have in mind? Actively working as a full stack but want to pivot to embedded anyway.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "FamiliarEnthusiasm87",
                    "body": "interesting",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "FamiliarEnthusiasm87",
                    "body": "do you have any firms in mind to look at? I",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "cashfile",
            "body": "It been 3 months, just keep applying. In this market 3 month unfortunately isn't a long wait. If you give up, someone else won't and they will land that job.",
            "score": 16,
            "replies": []
        },
        {
            "author": "jack_the_gunn",
            "body": "I work in QA making 60k and I can't find a 75k job for the life of me..I'm not even aiming for 6 figures right now. Over the weekend, I basically said fuck it and decided I want learn as much backend development as possible and see where the market pivots.",
            "score": 22,
            "replies": [
                {
                    "author": "csanon212",
                    "body": "That's brutal. We pay our QA folks $90k min",
                    "score": 3,
                    "replies": [
                        {
                            "author": "jack_the_gunn",
                            "body": "Any of your QA guys ever pivot to Development? I am the only QA guy on the team and I highly doubt management will ever allow me to go into development. Problem is, I am basically squeezed out of entry level development due to being 7 years out of college and already having 3 years of QA experience. I feel like I am better off joining a more tech centric company and seeing if I can transition to development there.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "csanon212",
                                    "body": "Never seen it happen. QA transitioning to Dev is recommended all the time but the issue is that QA is always short staffed. They don't want to lose people.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Double-justdo5986",
                    "body": "How are you going about the learning?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "According-Emu-8721",
            "body": "Why don’t you do hardware",
            "score": 6,
            "replies": [
                {
                    "author": "whossked",
                    "body": "As a freshman in college is it worth the pivot from computer science to computer engineering?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok-Attention2882",
            "body": "I don't see a world where new grads would be a better option over an existing employee replacing your role via ChatGPT calls.",
            "score": 6,
            "replies": []
        },
        {
            "author": "EitherAd5892",
            "body": "I quit swe to pursue electrician. Union now making almost the same as swe salary",
            "score": 16,
            "replies": [
                {
                    "author": "Elctsuptb",
                    "body": "How long ago did you switch?",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "MrDrSirWalrusBacon",
                    "body": "Im in IBEW while doing my CS masters. Its okay money at entry/good money at journeyman. My journeyman buddy is making like 3600 a week in the Midwest off 6 12s. The hours get tiring though. I know Boston IBEW is $63/hr for journeyman which is kinda crazy to think about.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "BananaFPS",
            "body": "If you have a secret clearance (which you probably do if you’re military), apply to defense companies. Think Raytheon, BAE, Lockheed, etc.",
            "score": 13,
            "replies": [
                {
                    "author": "Clueless_Otter",
                    "body": "OP isn't American. The US doesn't have mandatory military service.",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "Teach-Code-78",
                    "body": "This. They can use this to their advantage.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "disapointingAsianSon",
                    "body": "also not true for american students either. Secret clearance and relevant military service has not helped one bit with defense companies",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "in-den-wolken",
            "body": "> I had obligatory military service and just finished in 3 months ago.\n\nIf you're not in the US, you'll get a more helpful answer by telling us where you are.\n\nAlso, people are getting jobs every day. Some get jobs through cold applications - more get them through networking.",
            "score": 4,
            "replies": []
        },
        {
            "author": "globalaf",
            "body": "Actual seniors worth hiring aren’t applying for junior positions. Never happens, whoever they are they are probably plebs from India or somewhere.",
            "score": 13,
            "replies": [
                {
                    "author": "Smurph269",
                    "body": "HR/management worth their salt probably won't let you hire a well qualified senior into an entry level role either. You're just adding a perosn who will leave if the market recovers.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "globalaf",
                            "body": "Yeah like the OP’s problem is they are psyching themselves out of a job they are qualified for. The market sucks but there’s always been slow periods, I even once went 6 months without a job in 2017 and people generally regard that as an unremarkable year. Shit happens, just need to be persistent.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "pineapplejuniors",
            "body": "Yep market is closed :(\n\nNoone is getting a job anytime soon",
            "score": 5,
            "replies": []
        },
        {
            "author": "cs_broke_dude",
            "body": "Yes it's dead for new grads. Go switch fields asap.",
            "score": 2,
            "replies": []
        },
        {
            "author": "oakinmypants",
            "body": "Enter healthcare and hope Trump doesn’t gut Medicaid and Medicare before you graduate.",
            "score": 2,
            "replies": []
        },
        {
            "author": "CodingInTheClouds",
            "body": "That long gap probably didn't help. You no longer qualify for new grad roles. On paper, it looks like you'd be a lot of work to get up to speed because new grads already don't know as much as they think they do, but years without using the fundamentals is even harder. Id say your best bet is to look for something small in a non tech area. Get a few years doing that before trying to go for a software heavy company. Less competition and generally not as aggressive of timelines. I did that for years before moving into big tech.",
            "score": 2,
            "replies": []
        },
        {
            "author": "XL_Jockstrap",
            "body": "Yes it is closed, well almost closed. If you're going to MIT or Stanford, maybe you might have a chance at the handful of internships in existence. \n\nBut otherwise, there are a number of other fields that pay well and have more stability. Look into medical professions, trades, law enforcement, etc. Heck therapists are in good demand these days.",
            "score": 3,
            "replies": []
        },
        {
            "author": "aquermulti2",
            "body": "If I were in this position as a new graduate, I would learn how to build websites, some payment api like stripe or paddle, and build a payment gated platform, then find customers on like producthunt or do some marketing for it. You can really build anything that you think will have a niche and provide value in some way. You'll be surprised at how many people will pay for a tool that provides some sort of value. \n\nWould be doing this while also constantly applying for jobs of course, and living in my parents basement. Maybe getting good enough to churn out like 2 products a week and try to farm all the ideas I can think of.\n\nIt's good experience. I was fortunate to be able to find a job graduating into the pandemic, but I do a little bit of this right now and it can be quite lucrative if you can find the customers.",
            "score": 2,
            "replies": []
        },
        {
            "author": "FlyingDumplingTrader",
            "body": "Most companies looking for seniors now…",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Sorry, you do not meet the minimum sitewide comment karma requirement of **10** to post a comment. This is comment karma exclusively, not post or overall karma nor karma on this subreddit alone. Please try again after you have acquired more karma. Please look at the [rules page](https://old.reddit.com/r/cscareerquestions/w/posting_rules) for more information.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "theprotaco",
            "body": "P",
            "score": 1,
            "replies": []
        },
        {
            "author": "lewibs",
            "body": "yes",
            "score": 1,
            "replies": []
        },
        {
            "author": "Eastern-Date-6901",
            "body": "Is it really that bad out there? I would learn a trade to be honest.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sml930711",
            "body": "I actually feel a sense of survivors guilt for having started my career in early 2022, not long before the tech market crashed\n\nI have a younger brother about to graduate in CS soon and I get worried about him",
            "score": 1,
            "replies": []
        },
        {
            "author": "pacman2081",
            "body": "Which country are you from ? Where are you located ? It makes all the difference",
            "score": 1,
            "replies": []
        },
        {
            "author": "lucasvandongen",
            "body": "Don't expect any company to bail you out. Be your own company, perhaps?",
            "score": 1,
            "replies": []
        },
        {
            "author": "mohawk56",
            "body": "No",
            "score": 1,
            "replies": []
        },
        {
            "author": "the_bagu",
            "body": "It’s not closed. Just a less then ideal time",
            "score": 1,
            "replies": []
        },
        {
            "author": "Latenighredditor",
            "body": "If no company takes in new hires then there will be a cliff in the tech industry like the population cliff thst Japan and South Korea will face",
            "score": 1,
            "replies": []
        },
        {
            "author": "Desperate_Day_2537",
            "body": "Question: Are CE grads applying for the same jobs as CS? Does CE qualify for any positions that CS doesn't, or vice versa? Or are the two degrees treated interchangeably in the job market?",
            "score": 1,
            "replies": [
                {
                    "author": "iAhMedZz",
                    "body": "In Egypt, at least, CE includes the entire CS curriculum plus other topics, including but not limited to generic engineering topics like calculus, chemistry, physics, electricity, etc. This was the case for my bylaws in 2017, I think they ran changes to that but I'm not sure to what extent.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "HustleWestbrook94",
            "body": "Honestly, the job market has always been kind of “closed” for new grads. I graduated in 2019 and couldn’t find anything for almost a year.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok_Practice_6702",
            "body": "It's closed for new grads and anyone with else than a decade experience, and I've shifted careers too many times.\n\nI honestly just wanna die, and I have my date set for that",
            "score": 0,
            "replies": []
        },
        {
            "author": "KevinCarbonara",
            "body": "Of course it's not closed for new grads. But this is about computer science, not computer engineering, which is pretty significantly different. If you want to get into software, it's gonna take a lot of extra learning on the side.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Titoswap",
            "body": "Its closed for everyone in this sub reddit. This is where the failures come to complain.",
            "score": -1,
            "replies": []
        }
    ]
}