{
    "title": "How are you productive all day?",
    "author": "KratomDemon",
    "subreddit": "cscareerquestions",
    "rank": 5,
    "score": 52,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 80,
    "url": "https://www.reddit.com/r/cscareerquestions/comments/1je8nso/how_are_you_productive_all_day/",
    "id": "1je8nso",
    "selftext": "Admittedly I’m an early riser and I’m most productive between 7 and 11 AM. After lunch my motivation plummets and have a hard time focusing to get much done. \n\nSome days I’m good with this and will just “chill out” but others are frustrating when I know I have work I need to get working on. \n\nAnyone else struggle with something similar and how do you go about structuring your day to maximize productivity?",
    "comments": [
        {
            "author": "Jennsterzen",
            "body": "Lately I've struggled more with productivity being very pregnant. The simple thing that has helped me the most is writing out a to do list of smaller tasks on a post it and crossing them out as I go.",
            "score": 48,
            "replies": [
                {
                    "author": "Altruistic-Cattle761",
                    "body": "\\> struggled more with productivity\n\nCmon, you're being more productive than anyone in this thread. I'm fairly certain if dudes could get pregnant, you'd very quickly see \"pregnancy leave\" added as a constitutional amendment.",
                    "score": 29,
                    "replies": [
                        {
                            "author": "ObstinateHarlequin",
                            "body": "Ah yes, that's why we currently give men tons of legally mandated paternity leave. \n\nOh wait, no, we do literally the opposite of that.",
                            "score": -10,
                            "replies": [
                                {
                                    "author": "stephable",
                                    "body": "Babygirl, the only federal safe guards we have in place after pregnancy is that we can’t get fired due to having a kid. FMLA is a federal law but does not apply for women who haven’t worked for a company for at least 12 months. Leave regulations vary by state.\n\n[**Men are legally entitled to the exact medical leave that pregnant women are under FMLA.**](https://www.dol.gov/general/topic/benefits-leave/fmla) Don’t worry, you’re still getting put first.",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "KratomDemon",
                                    "body": "We don’t but my company gives paid paternity leave. Didn’t used to be the case at all 20 years ago when I started",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "ObstinateHarlequin",
                                            "body": "Yes, individual companies may do so (mine does as well), but there is no legal requirement for them to provide that benefit.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "kendinggon_dubai",
                    "body": "This is the way.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "cabbage-soup",
                    "body": "You are literally me. The moment my baby implanted itself I think my motivation plummeted. Small lists definitely help- but my motivation to write them out has gotten worse 🙈 I just give people a little bit longer deadlines that I need and just accept that I’m going to be slower for a bit. I was a high performer before so in the grand scheme I think it’s fine if my work is slacking a little bit for a year.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "KratomDemon",
                    "body": "Ya I usually construct a list in my head of the things I want to get done for the day but really hit the wall come afternoon",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "KeeperOfTheChips",
                    "body": "Sorry for side tracking the convo but does“Being very pregnant” means you could also be moderately pregnant or slightly pregnant?",
                    "score": -3,
                    "replies": [
                        {
                            "author": "KING_OF_DUSTERS",
                            "body": "This one was for the drafts bro",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "sm0ol",
                            "body": "1st trimester: slightly pregnant\n\n2nd trimester: moderately pregnant\n\n3rd trimester: very pregnant",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "KING_OF_DUSTERS",
                            "body": "This one was for the drafts bro",
                            "score": -2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "UrbanPandaChef",
            "body": "I'm not productive all day and I make it so I don't have to be. I do 2-3 tickets simultaneously and finish ahead of schedule. Then hold it back and control when I open pull requests. All my work appears consistent and is done at regular intervals where possible. Work when you have motivation and space the results out to cover for the time you don't.\n\nMaximizing productivity is kind of pointless when your boss tells you they have 2+ years of work planned out for the team. There's no way to get ahead of it all and there's no reward for finishing any work early. Just more work.",
            "score": 20,
            "replies": [
                {
                    "author": "KratomDemon",
                    "body": "Great perspective. The work is really endless and after 20+ years in the field I am aware there is no end to the backlog - ever. \n\nI do a lot of what you list out here with working ahead and then putting out PRs, etc over the course of the sprint. Perhaps it’s just me being too demanding of myself",
                    "score": 2,
                    "replies": [
                        {
                            "author": "GeneralPITA",
                            "body": "My goal is to give them what they pay for.  I'm paid market rates and I do market rate work.  I used to think it was worth the effort to be a rock star 10x type, but it just isn't.  Some days I get a lot done, and other days, not so much.  Like another commenter noted, I down play the good days and use it to fluff the not as good days.  \n\nIf they paid start up type wages, I'd worry about adding 20 hours of work to my week, but I make the same whether I work 40 or 60, so I work 40.  I'll use the time I'm not working for personal interest projects, exercise or hobbies.  \n\nIn the end, work life balance keeps me from burning out, and makes it easier to stay motivated.  It's a lot like running.  How fast would you run, if you were told to run and I'll let you know when you can stop?  Keep in mind, there is no end.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "EasyLowHangingFruit",
                    "body": ">Then hold it back and control when I open pull requests. \n\nCould you please expand on this idea? How do you manage to have 3 PRs opened and having to context switch when you want to address suggestions on your PR?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "UrbanPandaChef",
                            "body": "You finish 2-3 tickets but open the PRs one at a time. Basically I make sure the code is completed ASAP just in case. But the reviews are dealt with slowly in sequence and one at a time.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "EasyLowHangingFruit",
                                    "body": "Oh ok. And how do you regulate the workload based on the expected story points? Say you're expected to deliver 8 story point per sprint minimum, do you do the 8, or you do a bit more, say 10, or do you go the extra mile and do 12? Or maybe you do the eight and make them look more dificult?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "UrbanPandaChef",
                                            "body": "Story points are subjective, but I assign points based on how I think the average person on my team would, even if I think it would be less. If it turns out to be less difficult than expected I just work on another ticket and tell no one. I let the over-estimated ticket take as long as people would expect it to, there's no reward for being done early. \n\nI'm not bullshitting the points, I'm exploiting the gaps that happen when there's an over-estimation.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Altruistic-Cattle761",
            "body": "I basically do my entire workday before \"lunch\". I start at 6am, work straight through til 1pm, grab a light lunch, and my last 90 minutes from 1:30 til about 3:00 are usually more lightweight work like answering emails or replying to Slack messages or commenting on Google docs. Once I eat my mid-day meal I also observe, as you do, my energy flagging.\n\n(Also, I feel compelled to point out, this is not an aggro Productivity Bro schedule, this is 99% because I have to pick up my kids when school's out, and this is the only way to orient my workday to make that possible. The fact that this is also the schedule I've found most productive for me over my lifetime is probably coincidence.)",
            "score": 12,
            "replies": [
                {
                    "author": "KratomDemon",
                    "body": "Yep - this has been my experience most my career. Most critical thinking, coding tasks need to be done in the AM for me and the afternoon is admittedly a slackfest with regards to personal productivity (enjoy helping out teammates and having discussions though)",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "hummus69",
            "body": "Yeah I’m like you. Useless after 1pm really. Usually I accept this and take a nap. Then Sometimes at like 6pm I can do another hour or so. \n\nTaking a walk / gym or something helps",
            "score": 25,
            "replies": [
                {
                    "author": "KratomDemon",
                    "body": "Agreed. I too will get a second win in the evenings some days - post gym. This means neglecting the family though so I try to minimize this",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "jvans",
            "body": "Exercising is a good reset and usually gives me a second wind. I try to exercise around lunch most days for this reason. I would also not sweat too much about maximizing productivity every day. In my experience engineering productivity is highly non linear. Most days you make small steady progress, occasionally you take giant steps forward",
            "score": 19,
            "replies": [
                {
                    "author": "AlterTableUsernames",
                    "body": "Also maximizing productivity is a recipe for burnout.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Internal_Research_72",
                            "body": "What do you do if this is the company culture you’ve found yourself in? Asking for a friend who can’t seem to find a job that isn’t this.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "AlterTableUsernames",
                                    "body": "I see mostly two options: Looking for a new job or letting yourself getting burnt out. Unionizing could also be a viable option.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "BackToWorkEdward",
                            "body": "Lol. Not doing so is a recipe for being replaced with any of the 100 other devs desperately vying for your job right now and more than willing to be worked to their own burnout point, a year or two of quarterly profits from now.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "AlterTableUsernames",
                                    "body": "And if you let yourself being burned out, you will get thrown away like a cigarette butt anyways. So, yaeh. Corporate definitely wants you to do that, because it doesn't has to pay the bill and can just light up the next smoke.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "BackToWorkEdward",
                                            "body": "In my experience, you last about twice as long by working to the point of burnout before setting boundaries on productivity/availability, than by trying to set those boundaries in advance. Our job niche is, unfortunately, a 26-mile sprint, not a marathon.\n\nSo it's basically up to you to do the calculation on whether you'd rather be PIP'd/outright laid off now, or later. Usually making more money up front and getting more YOE on your resume is the top priority, even if yes, you have to work to the point of burnout to get as much of both as you can.\n\nAlso, you know what can *really* burn you out? Jobhunting in the current market. Filling out 400 increasingly-elaborate job applications every month, getting nowhere, seeing no money go into your account for any of them, and getting told by this sub that the trouble is that you should've been doing 500/month instead. Or 700 if you were already doing 500. And so on.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "relddot",
                    "body": "Yes, our company hires a sport hall and we play sports every Tuesday at lunch. You get a big boost in concentration after.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Schedule_Left",
            "body": "You can't be productive all day everyday. That's how you burn out. I've been productive all day a few times and it's a huge mental drain. Just understand that some days are busier than others. Or that some times you work harder than at other times.",
            "score": 9,
            "replies": []
        },
        {
            "author": "pySerialKiller",
            "body": "I can’t be productive unless a deadline is about to bite me in the ass. ",
            "score": 7,
            "replies": []
        },
        {
            "author": "Easy_Aioli9376",
            "body": "One super important thing no one mentioned:\n\nBe very cognizant of what you're eating. The timing of when you're no longer productive (after lunch) is highly sus. You could be eating something your body doesn't agree with, or you could be eating too much and it makes you sluggish.\n\nI found whenever I am fasted or when I eat but not to the point of being full, I'm extremely energized and focused. I usually eat larger meals later in the evening when I'm done work and want to chill.",
            "score": 4,
            "replies": [
                {
                    "author": "grumpy_chameleon",
                    "body": "This! Whenever I feel tired and sluggish in the afternoon I can usually attribute it to a high carb lunch. Lean protein and lots of veggies with minimal carbs is the way to go",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "KratomDemon",
                    "body": "I used to fall in this trap when we were in the office. Going out for group lunches and coming back with a full belly made for a miserable, sleepy afternoon",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "riplikash",
            "body": "Very few people are. Everyone has different work cycles. Find what works best for you and then see if you can optimize.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Firm_Bit",
            "body": "Endurance is a skill like any other. I use to be productive for maybe 4 hours a day. But you learn to manage your energy and to go longer distances. \n\nI have time off this week cuz I needed it. But when working im up at 6 and it’s often non stop until 10pm. Quite often (though less than it used to be) that includes ~10 hours of diligent work in office. \n\nPart of what helps (if you consider this a desirable skill) is to be in a high stakes/pressure but well structured environment. I work a lot because what I do has a lot of immediate impact at my company. I can’t hide because the stuff I do has very real world deadlines and consequences. I don’t burn out cuz I get an immediate return on my effort and energy though. The demands are high but I also enjoy actually having an impact. \n\nIf you work in an environment where you can easily push back deadlines or “hide” in some other way then you will probably train yourself to take as much slack as you can get away with. \n\nThe biggest benefit to developing some endurance here is that I waste less of my personal time now. I need less veg time than I used to. \n\nNote that I’m not advocating for this sort of work life balance. That’s up to you. Just answering the question.",
            "score": 3,
            "replies": [
                {
                    "author": "KratomDemon",
                    "body": "Good points. I work in healthcare so our products and solutions are 24/7 uptime and timelines can be tight. I find I strive in those higher pressure situations where things are needed NOW but in the less time sensitive and unstructured day to day the focus is hard to keep some days.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "HTMLMasterRace",
            "body": "Productivity is just an acclimation of so many factors. \n\nYour mental health, distractions from your personal life, your sleep, diet… how interesting the project is, how excited you’re about the work… hell even if you drank enough water. \n\nI find it useful to identify how and why you’re motivated by anything else, and use that to learn more about yourself.",
            "score": 3,
            "replies": []
        },
        {
            "author": "SeniorPeligro",
            "body": "All day? Mate, I'm productive maybe for 3-4 hours top xD Unless I have something interesting to do - then I can get in the flow and work 10-12 hours with full focus. But on a daily basis, with multiple meetings, groomings etc. breaking my workflow, 3-4 hours of focused work is pretty much my average.",
            "score": 3,
            "replies": [
                {
                    "author": "KratomDemon",
                    "body": "Ya it’s the constant context switching - especially as a senior dev that really puts a drain on personal productivity",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "brianofblades",
            "body": "I average about 3-4 hours a day. If i get up early then maybe 5 or 6. But once lunch hits im cooked. I might squeeze an extra hour in but im fried. The idea that anyone can do this job for 8 hours straight without using any drug (caffeine included) baffles me.",
            "score": 3,
            "replies": [
                {
                    "author": "KratomDemon",
                    "body": "I’m 100% with ya on this take",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "bluegrassclimber",
            "body": "Work at coffee shop. Work at library. Work at office. Don't work at home. I'm a \"return to office\" guy. Feel free to hate me",
            "score": 2,
            "replies": [
                {
                    "author": "KratomDemon",
                    "body": "This has crossed my mind many times. How do you reconcile working on public wifi that may not be that secured",
                    "score": 1,
                    "replies": [
                        {
                            "author": "bluegrassclimber",
                            "body": "My work does offer a VPN.... but, I don't usually turn my vpn on. My work stuff isn't super high clearance or anything. But I do avoid online banking and entering my social just in case someone is trying to sniff my packets lol.\n\nVPN is the solution tho if you are concerned. I just got done working at the coffee shop all morning, and got subway. And now I'm working from the library.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "bluegrassclimber",
                            "body": "Here's my setup: [https://imgur.com/a/Fp5slmN](https://imgur.com/a/Fp5slmN) I'm a avid extrovert and work best in airport type settings with tons of people around me. So this is how i live my life",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "bluegrassclimber",
                            "body": "oh lastly you can use most modern phones as a hotspot and set your own password then. I've worked from qdobas and such this way",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "KratomDemon",
                                    "body": "Appreciate all the tips!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Dymatizeee",
            "body": "I found delaying lunch worked best. I then schedule some of the easy /mundane tasks after lunch",
            "score": 2,
            "replies": []
        },
        {
            "author": "Servebotfrank",
            "body": "Some sprints I can feel pretty productive, others the work has a lot of downtime associated with it for some reason or another and in those instances no I'm not productive all day.\n\nIf it's an in-office day then I feel really bored. If it's a WFH day I just find something to occupy my time until that downtime is finished. \n\nAlso if I'm too productive then I get done too quickly, and I've learned a long time ago to not get done with my work too quickly.",
            "score": 2,
            "replies": []
        },
        {
            "author": "PhishPhox",
            "body": "PRs in the morning while house is busy, I get back from waking kid to school at 820, daily at 830, then 9-1130 or so is my main chunk of coding time. I get probably 80% of my code written during this chunk. After lunch it’s back to PRs for a bit and then I’ll usually call it early. Evenings once kids are in bed it’s sports/music while I write tests or try different approaches to a problem or debug… usually with a glass of wine (in the old days it was 20 natty lites)",
            "score": 2,
            "replies": []
        },
        {
            "author": "Creativator",
            "body": "I have about 5 hours of productive work energy a day, so I just figured out how to shove four hours of restorative contemplation into it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "a_line_at_45",
            "body": "There is research that suggests you get about 4-5 hours of good focus in a day. You can get other things done after, of course, but it's pretty normal to feel drained after focusing on work for that long.",
            "score": 2,
            "replies": [
                {
                    "author": "KratomDemon",
                    "body": "This is good to know. A lot of the responses here make me feel better about my focused time each day",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "travelinzac",
            "body": "Productive all day? That's how you burn out sir.",
            "score": 2,
            "replies": []
        },
        {
            "author": "stephable",
            "body": "I think being an internet gremlin from an early age warped my development because for some reason i can only be hyper productive between the hours of specifically 12-4AM. I get more done in those 4 hours than I do during an entire day. I have successfully tried to force myself into the business hour routine multiple times, but it tanked my productivity so I’m just leaning in to it now. I feel much more energized and motivated this way. Weird",
            "score": 2,
            "replies": []
        },
        {
            "author": "zakyhafmy",
            "body": "Eat less carbs during lunch. Stick to protein and veggies. Your energy levels should stay about the same",
            "score": 2,
            "replies": []
        },
        {
            "author": "TopNo6605",
            "body": "I find my productivity skyrockets when there's nothing to get FOMO about. AKA, middle of winter, if I get up at 5am, is my most productive. Summer at 2 pm, seeing pictures of people drinking on sunny patios, boats going by, I'm at my least.",
            "score": 2,
            "replies": []
        },
        {
            "author": "iheartanimorphs",
            "body": "I’m only really productive from 10am-4pm (not counting lunch) but I’m available and responding to messages from like 8:30-5:30. I usually reserve my mornings for discussions with teammates and do anything that requires concentration in the afternoon. Also, I always go for a walk after I eat lunch so I don’t have the mid-afternoon slump.",
            "score": 2,
            "replies": [
                {
                    "author": "KratomDemon",
                    "body": "I need to get back to the post lunch walk. Winter made it hard here in the northeast but spring is around the corner",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "thisisjustascreename",
            "body": "Nobody is. Try to schedule meetings for your unproductive hours. I mean, try not to schedule meetings, but the ones you have to have, schedule them for the bad hours.",
            "score": 2,
            "replies": []
        },
        {
            "author": "txiao007",
            "body": "How I get things done is not important.  We have a Sprint Board to review daily on standup.",
            "score": 1,
            "replies": []
        },
        {
            "author": "diablo1128",
            "body": "I'm productive all work day, but productive doesn't mean I'm coding all day. Generally coding happens after lunch and mornings are for emails, meetings, code reviews, etc....\n\nRegardless of what people like to think all the other stuff you need to do at work outside of fingers to keyboard coding is still work and being productive.  Companies that expect 8 hours of coding in addition to doing all the other stuff is are crazy and one should find a new job and leave those places.",
            "score": 1,
            "replies": []
        },
        {
            "author": "salamazmlekom",
            "body": "4h of being productive is more than enough for the shitty salaries companies are paying and layoffs happening everyday.",
            "score": 1,
            "replies": []
        },
        {
            "author": "slapstick_software",
            "body": "I’m not, I do my job and then mess around the rest of the time",
            "score": 1,
            "replies": []
        },
        {
            "author": "Free_Charity_6007",
            "body": "Nope.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Sorry, you do not meet the minimum sitewide comment karma requirement of **10** to post a comment. This is comment karma exclusively, not post or overall karma nor karma on this subreddit alone. Please try again after you have acquired more karma. Please look at the [rules page](https://old.reddit.com/r/cscareerquestions/w/posting_rules) for more information.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/cscareerquestions) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "double-happiness",
            "body": "8:30am - 9:30am wake up, read email etc.\n\n9:30am - 9:50am brekkie\n\n9:50am - 12:30pm BASH BASH BASH\n\n12:30pm - 1pm lunch\n\n1pm - 3:00pm BASH BASH BASH\n\n3:00pm - 3:20pm snack & tea\n\n3:20pm - 4:30pm BASH BASH BASH\n\n4:30pm - leave",
            "score": 0,
            "replies": []
        },
        {
            "author": "Bangoga",
            "body": "You get paid multiple 6 figures to be productive, if you can't be productive then what's the point. I just remind myself of the money and work 9-5 and then a 5-9 after. AI will take my job if I don't.\n\nI would have been more productive if Soylent weren't discontinued, now I have to buy feeding tubes every few days.",
            "score": -6,
            "replies": [
                {
                    "author": "Internal_Research_72",
                    "body": "Uh, Soylent is 100% still available dude. You can even get it with prime shipping. Drinking some now.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Bangoga",
                            "body": "Thank God, now I can code day and night for projects that will never ship",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "KratomDemon",
                    "body": "First off most devs are not getting multiple 6 figures and those with families are not interested in burning themselves out just to make a buck.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Bangoga",
                            "body": "If your family isn't helping you be more productive why have one?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "KratomDemon",
                                    "body": "If not having children to further your bloodline what’s the point in living anyways. \n\nStupid take 🙃",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "grumpy_chameleon",
                    "body": "Is this satire? 😭",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Bangoga",
                            "body": "no its patrick. Now please let me get back to work, I need to add LLM to pytests so I can run inference on every commit.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}