{
    "title": "Are Canadian companies offshorers like American companies?",
    "author": "uj7895",
    "subreddit": "cscareerquestions",
    "rank": 9,
    "score": 5,
    "upvote_ratio": 0.67,
    "num_comments (reported by reddit)": 12,
    "url": "https://www.reddit.com/r/cscareerquestions/comments/1jeep3e/are_canadian_companies_offshorers_like_american/",
    "id": "1jeep3e",
    "selftext": "American companies grow off excellent customer service until they get big enough their customers will tolerate going cheap. ",
    "comments": [
        {
            "author": "qwerti1952",
            "body": "We skip the \"grow off excellent customer service\" part generally and skip straight to the offshoring.",
            "score": 26,
            "replies": [
                {
                    "author": "berlin_rationale",
                    "body": "Yikes",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "I-AM-NOT-THAT-DUCK",
            "body": "American companies offshore to Canada.",
            "score": 11,
            "replies": [
                {
                    "author": "TGrumms",
                    "body": "Yeah, I had a recruiter tell me yesterday that they’re doing a lot more hiring in Canada to take advantage of the weaker dollar.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "VersaillesViii",
                            "body": "My friends in Vancouver area sure don't notice it. Maybe they are all in Toronto?...",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "TGrumms",
                                    "body": "Yeah, could be, I’m moving from Vancouver back home to Toronto and getting a much better response rate",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MundaneValuable7",
                    "body": "My current and previous job combined had 12 Americans and 2 Canadians.  After 3 years there are now 8 Americans and 12 Canadians.\n\nI make half what my American coworkers make while doing the same work.  On the other hand it pays better than 95% of Canadian companies.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "qiekwksj",
            "body": "Tbh I don’t think we have half as many tech or big companies as USA in the first place so in terms of off shoring for tech not so much",
            "score": 8,
            "replies": []
        },
        {
            "author": "Heroicdeath",
            "body": "FreshBooks started to offshore, primarily to Europe.",
            "score": 3,
            "replies": []
        },
        {
            "author": "HackVT",
            "body": "Yes. It’s a global tactic. \n\nIt’s called near shoring to Mexico and Canada when in the US.",
            "score": 3,
            "replies": []
        },
        {
            "author": "VersaillesViii",
            "body": "Bitch Canada doesn't even have jobs to offshore",
            "score": 2,
            "replies": []
        },
        {
            "author": "bonbon367",
            "body": "US companies “near shore” to Canada, and Canada “brings the off shore to our shores” to keep local labor prices low.",
            "score": 1,
            "replies": []
        }
    ]
}