{
    "title": "Is using ChatGPT to learn Azure & Python for projects a bad approach?",
    "author": "s1brzy",
    "subreddit": "cscareerquestions",
    "rank": 12,
    "score": 2,
    "upvote_ratio": 0.75,
    "num_comments (reported by reddit)": 11,
    "url": "https://www.reddit.com/r/cscareerquestions/comments/1jehnwf/is_using_chatgpt_to_learn_azure_python_for/",
    "id": "1jehnwf",
    "selftext": "I've been working in proprietary SaaS tech support for 3 years and am now looking to transition into a cloud-adjacent role. To gain hands-on experience, I’m currently building an Azure project to prototype a real-world solution. My background is fairly basic, I passed the AZ-900 and have very basic Python knowledge from 5 years ago.\n\nTo build this project, I've been using ChatGPT. I rely on it for Python scripts and guidance on setting up Azure resources, but I make sure to ask for detailed, line-by-line explanations of the code and instructions to fully understand why each step is necessary and I document it in the md files. I also cross-reference official Azure and Python documentation, though they can be complex to grasp at times.\n\nThis method has helped me learn a lot, but I’m concerned about how it might be perceived in an interview. Would hiring managers see this as a legitimate way to gain hands-on experience, or does it come off as a shortcut rather than real learning? Would you be transparent about it in interviews (if I land any ofc)?\n\nI’m also unsure what other beginner-friendly approaches I could take to build Azure projects that would better prepare me for applying to roles. Any advice would be greatly appreciated!\n\nTLDR: I'm transitioning from SaaS tech support to a cloud role, using ChatGPT to build an Azure project while ensuring I understand each step. Is this a valid way to learn, or does it seem like a shortcut? Any beginner-friendly project advice?",
    "comments": [
        {
            "author": "boobka",
            "body": "Is using Google and Stack-overflow to learn stuff bad? No\n\nUse the tools as tools and not a replacement for your mind, and you'll be fine.",
            "score": 9,
            "replies": [
                {
                    "author": "Historical_Flow4296",
                    "body": "You still have to read the documents. That’s exactly what we done before ChatGPT. People think this step is skippable because of an AI. But the AI hallucinates and gives outdated practices /apis. Which is very similar to coming across a stackoverflow solutions that was written 5 years ago.\n\nBasically, you should do your due diligence to understand what the AI is coding for you",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "s1brzy",
                    "body": "Yeah, I found it to be a really useful tool for understanding the code I used in this project. However, since all of it was generated by ChatGPT, I feel like I should be transparent if a hiring manager asks where it came from. I do understand the code now, but I still feel like I shouldn’t exaggerate my skills. What do you think?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "bnffn",
            "body": "Instead of having it write the script and then explain it to you, I would try doing it yourself first and then asking it specific questions when you are stuck.\n\nOn a side note, why would you even tell a hiring manager that you’re using ChatGPT?",
            "score": 2,
            "replies": [
                {
                    "author": "s1brzy",
                    "body": "That’s a good shout. \n\nI was just thinking, if they review the code and see that I don’t have any prior work experience in coding or Azure, they’d probably figure it out anyway that I used ChatGPT, no?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "bnffn",
                            "body": "Just say you researched and learned to do it yourself. And technically you would be telling the truth. But if you frame it as “ChatGPT did it” it comes off as vibe coding.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AlexanderKotevski",
            "body": "Yup",
            "score": 1,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "R0b0tJesus",
                            "body": "Yup",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "DustinCoughman",
                                    "body": "mmhmmm",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "vi_sucks",
            "body": "Think of it like this.\n\n\nWould it be bad to learn Python by asking someone else to write a Python project for you? That's basically what you are doing when you give ChatGPT a prompt. You can just imagine that instead of an AI, it's some dude in India behind the screen.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Yapnog2",
            "body": "Yes",
            "score": -1,
            "replies": []
        }
    ]
}