{
    "title": "Did the time turner make Hermione older? ",
    "author": "acomputerquestion",
    "subreddit": "harrypotter",
    "rank": 3,
    "score": 375,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 62,
    "url": "https://www.reddit.com/r/harrypotter/comments/1heyt2z/did_the_time_turner_make_hermione_older/",
    "id": "1heyt2z",
    "selftext": "If she was constantly going back in time wouldn't she have aged faster in that 3rd year. Like if every day she was adding on a minimum of 2 hours that's like an extra 2 days a month. And she probably added more than 2 hours a day.",
    "comments": [
        {
            "author": "Ok-Profession2383",
            "body": "If she was petrified in her second year, would she stop aging? Maybe it balanced things out?",
            "score": 1279,
            "replies": [
                {
                    "author": "Key_Future5778",
                    "body": "Nice thinking",
                    "score": 260,
                    "replies": [
                        {
                            "author": "Ok-Profession2383",
                            "body": "It's annoying that the books never talk about the aftermath of being petrified. I'm surprised that Dumbledore doesn't have his own time turner.",
                            "score": 205,
                            "replies": [
                                {
                                    "author": "DracoRubi",
                                    "body": "Oh, I'm pretty sure Dumbledore has his own time turner... And the Ministry doesn't know about it.",
                                    "score": 181,
                                    "replies": [
                                        {
                                            "author": "calvinbsf",
                                            "body": "If he has his own time turner it’s drastically underused\n\n\nJust off the top of my head in the climax of book 6 he could’ve used it when approaching the school. He’d seen the dark mark in the sky so presumably he thought a student had died while he was gone.\n\n\nI’m sure you could come up with examples for every single book\n\nHe could have prevented Sirius death, Voldemort return, etc etc etx",
                                            "score": 75,
                                            "replies": [
                                                {
                                                    "author": "goldthread4568",
                                                    "body": "I think the big limitation with the time turners is you can't actually go back with the intention to change stuff, you can just buy yourself more time.    \n\n\n If you go back to stop a bad thing happening, then it doesn't happen, so you don't go back, so it happens... Etc forever. The only times we see it used are specific circumstances. Usually it's planned out before the thing they're trying to impact happens (Hermione's classes), and therefore exempt from that paradox because she doesn't only decide to do it after seeing the results of not doing it. That's why when Hermione forgets to go to class, she doesn't just use the time turner to fix it, because she knows it won't work.    \n\n\nIn the case of Sirius, it's to give them more time to fix a future problem (Sirius is going to be handed to the dementors very soon). Again, they're not trying to fix something bad that already happened. Even when they end up trying to do just that (saving buckbeak), it's a byproduct of the original goal, so they still leave their past selves with motive to do it again. That's why nothing actually changes the second time around, they just understand it better.     \n\n\nIf they'd gone back in time just to save buckbeak, or waited until it was too late to save Sirius, it wouldn't have worked because whatever you do can't remove the incentive for the next \"you\" to go back and do it too. \n \nIt's still an underutilized tool, there are other instances where extra time would be helpful, but most of those happen after the time turners are destroyed, so at least there's a reason they didn't use one (excluding the theory of Dumbledore having his own).",
                                                    "score": 144,
                                                    "replies": [
                                                        {
                                                            "author": "cattastrophiccc",
                                                            "body": "This is a wonderful explanation. Even very high me could follow this thought process. Thank you.",
                                                            "score": 49,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "TopHatGirlInATuxedo",
                                                            "body": "There is no altered timeline. They were always there in the past. They just weren't aware of it until later in their personal timelines.",
                                                            "score": 28,
                                                            "replies": [
                                                                {
                                                                    "author": "goldthread4568",
                                                                    "body": "My bad, that part wasn't clear. I didn't mean actually altered, just altered from harry's point of view, since he didn't originally know buckbeak survived.\n\n\nEta: just changed my original comment slightly, hopefully it makes more sense now",
                                                                    "score": 12,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Xygnux",
                                                                    "body": "Yes.  So as soon as they saw the altered results there's nothing they can do to change it.  At least not without causing a paradox that is implied to be a very bad thing that can cause whole days to completely disappear.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Bwunt",
                                                            "body": "Just the sheer amount of information gathering you could do with a time turner (especially under a strict rule to not interfere) would make them insanely strong.",
                                                            "score": 11,
                                                            "replies": [
                                                                {
                                                                    "author": "Xygnux",
                                                                    "body": "The thing is though it's implied that if you accidentally cause a paradox, then it can cause massive destabilization of the time period like causing whole days to disappear.  \n\nWhat's more of a plot hole isn't why Time Turners aren't used more often, it's why they are even allowed to exist at all, let alone given to a teenager so that she can attend classes.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "MCrafter_Hi",
                                                            "body": "!redditgalleon             beautiful explanation",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "ww-currency-bot",
                                                                    "body": "You have given u/goldthread4568 a Reddit Galleon.\n\nu/goldthread4568 has a total of 2 galleons, 0 sickles, and 0 knuts.\n\n____________\n\nI am a bot. See [this post](https://www.reddit.com/r/harrypotter/comments/jnbo49/hi_i_created_the_bot_youve_been_using_to_give/) to learn how to use me.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Keanu_Bones",
                                                            "body": "I love this reading of it, and makes perfect sense.\n\nUnfortunately cursed child really mucks with that theory, but thankfully cursed child wasn’t canon anyway so it doesn’t matter 🤷",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "MadameLee20",
                                                                    "body": "anyway those CC ones were new protypes",
                                                                    "score": 4,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Chocko23",
                                                            "body": "!redditgalleon",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "ww-currency-bot",
                                                                    "body": "You have given u/goldthread4568 a Reddit Galleon.\n\nu/goldthread4568 has a total of 1 galleon, 0 sickles, and 0 knuts.\n\n____________\n\nI am a bot. See [this post](https://www.reddit.com/r/harrypotter/comments/jnbo49/hi_i_created_the_bot_youve_been_using_to_give/) to learn how to use me.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "jack0071",
                                                            "body": "Also, to add, Dumbledore knew that Buckbeak wasn't killed, because it had already happened for him, which is why he suggested it to them. He realized at that moment, they must have rescued Buckbeak",
                                                            "score": 2,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Broccoli--Enthusiast",
                                                            "body": "Using the time turner to go to a missed class would still work (unless she is reminded by someone who asked why she was missing) but if she remembers on her own, she can use it, because the original version of her still misses the class, remembers and goes back.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "goldthread4568",
                                                                    "body": "She only realized she missed it because Harry asked why she didn't go",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Justaredditor85",
                                    "body": "My headcanon is actually that Hermione's time turner was never from the ministry. Instead if belonged to Dumbledore. I mean, you've got Fudge a minister that would like nothing more than to look as the good guy so why not use them to stop things before they happen.\n\nNot to mention the fact that I seriously doubt the ministry would really give a timeturner to a student just so she could take a few extra lessons. ESPECIALLY a muggleborn. No, the classism/racism in the organisation is just too great.\n\nThat timeturner belonged to Dumbledore and he gave it to Hermione because he's been using it in an avengers: endgame dr. Strange kind of way to get to the best outcome and therefore knew how it should be used.",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "MadameLee20",
                                            "body": "Mcongally had to write a \"lot of letters to the minstery\" to let Hermione get one.   and Hermione 'returned\" the TT to the minstry at the end of 3rd year",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "Xygnux",
                                                    "body": "That's just what McGonagall told Hermione and by extension Harry.  \n\nHermione is a sticker for THE RULES.  Dumbledore might have thought it's better to tell her the Ministry approved it all, instead of Dumbledore being Dumbledore.",
                                                    "score": -1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Completely_Batshit",
            "body": "Yes, she's roughly 21 days older overall- I did the math some time ago, making a number of measured assumptions.",
            "score": 295,
            "replies": [
                {
                    "author": "dixpourcentmerci",
                    "body": "Is that taking into account the time spent petrified?",
                    "score": 50,
                    "replies": [
                        {
                            "author": "Completely_Batshit",
                            "body": "No, it's specifically accounting for her time travel shenanigans.",
                            "score": 59,
                            "replies": [
                                {
                                    "author": "Alcarinque88",
                                    "body": "I guess 21 days isn't much at all. She was petrified for longer, I think.\n\nDid you post your calculations and assumptions somewhere?",
                                    "score": 26,
                                    "replies": [
                                        {
                                            "author": "Completely_Batshit",
                                            "body": "I did.  Copypaste from a year ago:\n\n>*Okay, so I sat down and did the math. Someone correct me if I fucked up somewhere- I'm terrible with numbers.*\n\n>*There's 10 months in the school term, or about 40 weeks. We take 2 weeks off for Christmas break and another 2 off for Easter. That's 36 weeks. We know that Hermione drops 2 classes at the end of 3rd Year, giving her a normal schedule, so we can guess that's 2 classes a week she was Turning for (ignoring Divination for the moment). Let's assume that each of those classes amounted to 5 hours a week. That's 10 hours she was Turning back every week. 10 hrs x 36 weeks = 360 hrs. 360 hrs / 24 = 15 days.*\n\n>*Now let's add Divination to the pot. Hermione dropped it right before Easter holiday, which is around late March/early April. That gives us roughly 7 months of her attending the class, minus 2 weeks for Christmas, leaving us with 26 weeks. Let's assume again that Divination was 5 hours a week. 5 hrs x 26 weeks = 130 hrs. 130 hrs / 24 = 5.4166 repeating.*\n\n>*This leaves us with a rough estimate of 20.5-ish days of total extra life lived during Hermione's 3rd Year. Even if we double it, that's only 41-ish days, which falls well short of a year.*",
                                            "score": 24,
                                            "replies": [
                                                {
                                                    "author": "DebateObjective2787",
                                                    "body": "r/theydidthemath",
                                                    "score": 7,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Sere1",
                                                    "body": "Respect for doing the math and breaking everything down as well as remembering doing it a year back. Good breakdown and even if you're off on something, it only being an additional month-ish is a logical conclusion.",
                                                    "score": 6,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "MythicalSplash",
                                                    "body": "There’s also the exams she has at the same time, but that probably wouldn’t change this calculation too much.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Serena_Sers",
            "body": "She was only allowed to use it for exactly the hours she had a conflicting timetable, not a single hour more. That's the reason she could use it to save Sirius: she overslept one day (when she missed Flitwicks class). \n\nShe had 2 additional classes (and even dropped one at easter), so thats about 4-5 hours a week if we are generous. Seeing a school-year has about 39 weeks in the UK, we are at 156-195 hours, or 6-8 days. So yes, the time turner probably did make Hermione older, but not much more than a week. Depending on how the petrification works on the human body, she's still younger than she should be, but it's all a matter of weeks, not years.",
            "score": 49,
            "replies": []
        },
        {
            "author": "goldthread4568",
            "body": "Ive always wondered this too. I'm guessing she used it very sparingly, and the end of the book is the only time it's not used specifically for class. She was nearing a total breakdown over the stress of school, which makes me think she wasn't using it for extra sleep or study time (probably not allowed and she likes to follow rules when she can). So your 2 days a month is probably close. Assuming a 10 month school year and some days not using it (weekends and school breaks), it's only 15-20 days total, but I'd imagine she did technically age those extra days.   \n\n\nOr it's part of the magic that you don't age, but I like it better if there are more real world implications to overusing one.",
            "score": 80,
            "replies": []
        },
        {
            "author": "ImReverse_Giraffe",
            "body": "SuperCarlinBrothers did a thing on it. It aged her by a weeks at most. She only used it for a few hours per week, not per day. They didn't go to every class every day.",
            "score": 22,
            "replies": []
        },
        {
            "author": "historyandwanderlust",
            "body": "A lot of people use this to justify her being a legal adult earlier for Snamione fics.",
            "score": 47,
            "replies": [
                {
                    "author": "ErasureT",
                    "body": "you did not need to divulge this information",
                    "score": 166,
                    "replies": [
                        {
                            "author": "watanabelover69",
                            "body": "I wish I had a timeturner so I could go back 30 seconds to before I read that comment",
                            "score": 50,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Completely_Batshit",
                    "body": "I swear, the worst thing about this fandom is the fandom.",
                    "score": 40,
                    "replies": []
                },
                {
                    "author": "killereverdeen",
                    "body": "ew",
                    "score": 42,
                    "replies": []
                },
                {
                    "author": "Basilisk1667",
                    "body": "… this fandom, I swear to god.",
                    "score": 25,
                    "replies": []
                },
                {
                    "author": "DeDevilLettuce",
                    "body": "Just looked it up... Why the fuck are people writing fanfiction about Hermione and Snape? Why?",
                    "score": 19,
                    "replies": [
                        {
                            "author": "PenguinZombie321",
                            "body": "We need a new plague",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "holdingahumanhead",
                                    "body": "Didn’t we just have one?",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "PenguinZombie321",
                                            "body": "Obviously one wasn’t enough",
                                            "score": 15,
                                            "replies": []
                                        },
                                        {
                                            "author": "DeDevilLettuce",
                                            "body": "Tbf I'd love another epidemic",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "WrittenInTheStars",
                    "body": "I miss the person I was ten seconds ago before I read this comment",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Lasadon",
                    "body": "Yeah but she only repeats a few classes, i have seen someone doing the math for that, she is about a month older or 2 trough it at most. So... not really... a lot. She didn't repeat the whole day, only a class or two.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Bwunt",
                            "body": "Assuming 39 weeks of school year and assuming that the electives are 2 hours per week each and she has to roll back time for two of them (she drops divination and muggle studies afer Y3 and can handle the rest without time travel), that would lead us to 39 x 2 x 2, which is 156 hours or 6 and a half days.\n\nEffectively, she was older a week.\n\nRealistically however, her circadian rhythm would wreak havoc on her (and in my headcanon, that is what caused most of wear and tear) since she is effectively living two 26 hour days a week for entire year.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Silvernine0S",
                    "body": "Ah! Now where is my bottle of bleach...",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "indrubone",
            "body": "Yeah maybe she was older but not like a year older I don't think. Maybe a few weeks or months at best.",
            "score": 8,
            "replies": [
                {
                    "author": "Bwunt",
                    "body": "Depending on how many hours per week she rolled back.\n\nMy calculation is just under a week.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "indrubone",
                    "body": "Also, she probably used the time turner to kiss ron at one point and then turned back time to talk her other self out of it. Her other self wouldn't think she was mad.",
                    "score": -15,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mahaloth",
            "body": "School: No going to Hogsmeade without a signed permission slip.\n\nSchool: Here, Hermione, use this EXTREMELY dangerous device so you can get more classes in.\n\nI swear, Dumbledore is a mad-man. Maybe the board is right to consider forcing him out at times.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Ambitious_Calendar29",
            "body": "She would've only aged a couple of weeks at most",
            "score": 3,
            "replies": []
        },
        {
            "author": "Warcraft_Fan",
            "body": "Assume 5 days a week for school, oh about 9 months (school is off 2 months for summer plus 2 weeks winter and maybe a few other days off), she would have aged maybe 6 extra hours a day x 5 a week x 9 school months = extra 11 or 12 days of her life before she gave up on Time Turner and went back to sensible schedule.\n\nSo yeah she aged more than any other peopel but relative to witch and wizard's total life, it's a mere drop.",
            "score": 2,
            "replies": []
        },
        {
            "author": "General_Scene_7661",
            "body": "this is actually interesting since going back in time they were in the same bodies as in the present but time wasnt actually going by in the present. depends on what how u think abt it. maybe since they were in the past their bodies didnt age. but they were in the same bodies as always so why wouldnt they. with all her classes summed up she would have gotten a year older and a whole lot taller so i guess she didnt age",
            "score": 2,
            "replies": []
        },
        {
            "author": "EmilyAnne1170",
            "body": "unpopular opinion, but what if that’s not how it works. What if she isn’t living the same hour twice, one after the other, she’s experiencing two things simultaneously.  \n\nWhen H & H use the time-turner to save Sirius and Buckbeak…  how to explain… the first time through, they see the effects of the things that they did the second time through, like warning themselves to leave Hagrid’s hut, howling to attract Lupin’s attention, and casting the stag patronus. \n\n  \nTheir first set of selves couldn’t have witnessed those things if they weren’t happening simultaneously, therefore that hour (or hours) worth of time only passed once. No extra aging necessary!",
            "score": 2,
            "replies": []
        },
        {
            "author": "KiroLV",
            "body": "Possibly, although I'm confident it wasn't nearly enough to be noticeable",
            "score": 1,
            "replies": []
        },
        {
            "author": "MightyMightyMag",
            "body": "Let me look for my phone and see what’s up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AmandaBeth4",
            "body": "No",
            "score": 1,
            "replies": []
        },
        {
            "author": "Naive_Yam4416",
            "body": "Probably, but not noticeable.",
            "score": 1,
            "replies": []
        }
    ]
}