{
    "title": "Ganito na ba talaga ka delusional and out of touch ang mga DDS?",
    "author": "cemeteryhipster",
    "subreddit": "Philippines",
    "rank": 15,
    "score": 898,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 135,
    "url": "https://i.redd.it/co9ogkuhhepe1.jpeg",
    "id": "1jdzhly",
    "selftext": "",
    "comments": [
        {
            "author": "ha_ie",
            "body": "Watched this last night. Sya yung kid na nalista ng ipon pra sa birthday nya sana. May araw na 3 pesos lang ipon nya pero sinulat nya parin. He was 9 noong nadamay sya sa tokhang, 3 days bago ang birthday nya. May Duterte and his kind rot in hell! Justice for Lenin!! 😢\n\nhttps://preview.redd.it/8dzq6yywkepe1.jpeg?width=1242&format=pjpg&auto=webp&s=862a6abbfe8caa6eaee847e786002d16608c0449",
            "score": 1,
            "replies": [
                {
                    "author": "Albus_Reklamadore",
                    "body": "Napakainosente pa nung bata.. 😢",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "MacorWindows",
                    "body": "Puta. Naluha nalang ako.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Sufficient_Code_1538",
                    "body": "Naiiyak ako. No kid deserves this. If heaven is real, please huwag papasukin ang mga DDS.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "_Nasheed_",
                            "body": "And never think that Allah is unaware of what the wrongdoers do. He only delays them for a Day when eyes will stare [in horror]\n\n- Surah Ibrahim",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "LegalAccess89",
                            "body": "if hell is real wag rin papasukin mga nyan maging ispiritu n lng sila tutal mahal nila si dds i spread word nila habang namumutol sila sa buhay",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Bulky_Soft6875",
                    "body": "Napanood ko din to. Nandun daw sya sa kapitbahay nya tumutulong daw siguro pandagdag sa ipon nya ng magkaputukan dahil may police operation. Grabe ang nilagay sa death cert nya na cause of death dahil sa sakit daw hindi gunshot wounds. After 6 years saka lang daw na grant ng korte na icorrect yung cause of death nya. Gusto pang pagtakpan yung ginawa nila. Mga hayop yang mga yan.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ha_ie",
                    "body": "https://www.youtube.com/live/91JGuXjnbVs?si=AklVPJLVUcokzr5y\n\n1:08:22 timestamp",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "jclqc12",
                    "body": "Hayup kasi yang pamilya nila at ang mga fans nila.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Cheese_Grater101",
                    "body": "baka sabihin ng mga ddstarsa: drug user yang batang yan!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "skelliii",
                    "body": "Tumutulong daw sa kapitbahay nung time na nabaril siya para makaipon ng panghanda  sa school sa birthday  niya 😢",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Konan94",
                    "body": "He would have been 18 this year. This is fucked up",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "No_Classic9015",
                    "body": "😥😥😥",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "This-Literature",
                    "body": "huyyyyy 😭😭",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Apprehensive_Bet_526",
                    "body": "grabe naman tapos nagrarally sa daan mga tao para ano para balewalain yang batang yan? kung maka duterte man ako diko kakayanin mag rally magguilty siguro ako sa gagawin ko",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "dourob",
                    "body": "so innocent 😢😢😭😭",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "HopelessRomantic0302",
                    "body": "😭😭😭",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "rhenmaru",
                    "body": "Fuck and knowing people supported this policy. Nung kainitan nitong patayan nag away kami ng mama ko dahil she supported this policy a church goer every si day lugar ah may Bible studies pa every Middle of the week. Tapus supported this Monster.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "dekomorii",
                    "body": "Used to do this to buy me my consoles, hope justice for the kid",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "bazinga-3000",
                    "body": "Tangina. Ang sakit sa puso",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Runnerist69",
                    "body": "Gagi ang lungkot naman nito :(",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "aKie_613",
                    "body": "hoyyy T\\_T",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "taponaway0430",
            "body": "di kasi maprocess ng utak nila ang issue na iyan. sa kanila, kapag walang war on drugs, maghahari ang drug addicts at maraming marerape or mapapatay.\n\nAkala nila droga ang pinakamalaking problema kaya ang lala ng bansa natin eh.",
            "score": 1,
            "replies": [
                {
                    "author": "liquidus910",
                    "body": "I remember this one interview with Leni. Sinabi nya na her stance is to help rehabilitate the users and prosecute the dealers. taena, galit na galit ang mga ungas. Bakit daw kelangan gastusan ng gobyerno ang mga adik. \n\nSamantalang ngayon, tahimik sila kay Kitty the baker. mga ungas talaga.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "taponaway0430",
                            "body": "that approach has been proven to be effective. it also lowered the cost of drugs so pati mga drug lord, nawalan ng negosyo and humina ang supply.\n\nang pagkaadik sa droga ay mas sakit kesa krimen.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "bangus_sisig",
                                    "body": "Decriminalize the users. Mga successful sa war on drugs na bansa ganyan ang ginawa. ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "liquidus910",
                                            "body": "Ironically, yan ang stand ng EU. Dahil nga the best in the multiverse si Prisoner Duterte mas pinili nya na pumatay ng walang habas kesa padaanin sa korte. Kaya anjan sya sa gulong yan",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "xxmeowmmeowxx",
                                                    "body": "Yung mga dds sa EU wala gusto pa rin pumatay habang nakikinabang sa magandang sistema including this. O db, shunga e.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "liquidus910",
                                                            "body": "Andaming ganan na OFW. Mga out of touch sa realidad. Tuwang tuwa sila nung si Duterte kesyo antahimik na daw sa Pinas, mababa na daw ang krimen, ang ganda na daw ng buhay at kung anu-ano pang yawyaw nila. Pero tanungin mo kung uuwi sila, ayaw naman.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "xxmeowmmeowxx",
                                                                    "body": "Hinahype kasi nila tatay nila, feeling ko kasi nakikita nila sarili nila sa kanya.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "taponaway0430",
                                            "body": "yes. exactly. sinabihan naman na si Digz diyan eh. di nakinig ahaha.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "bangus_sisig",
                                                    "body": "Sinabi mismo ni leni actually pero pinagtawanan sya, sinabihan syang bobo",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "nikewalks",
                                            "body": "Tingin ng mga ungas, pag sinabing decriminalize the users eh kasama yung mga r@pist na sabog.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "--Dolorem--",
                            "body": "fake news nga daw kase yung kay kitty tangina pag may source fake news tapos pag fb post ng nobody paniwalang paniwala hahaha",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Earl_sete",
                    "body": "Pinalabas kasi ni Duterte at ng mga DDS na kung hindi naging presidente si Digong ay lunod na sa droga ang Pilipinas. At saka anong sinasabi nilang naging safe daw noon dahil diyan? Ang dami pa ring snatcher at holdaper noon at kumakana sila kahit may araw pa.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "taponaway0430",
                            "body": "kasi nga raw, kung wala ka naman daw ginagawang masama, bakit ka matatakot?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "xxmeowmmeowxx",
                            "body": "Yun sa isang subreddit marami nagsasabi na sobrang peaceful daw during his time eh. Tsk.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "bibi_dadi",
                                    "body": "Malamang peaceful kasi pandemic, hahaha mga hindi nag iisip eh",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "xxmeowmmeowxx",
                                            "body": "That and takot din mga tao gumalaw in general.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Bulky_Soft6875",
                    "body": "Kung effective yang letseng war on drugs na yan edi sana wala ng drugs ngayon. Sinong niloko nila 🙄",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Cheese_Grater101",
                    "body": "galit sila sa mga drug user pero chill lang mga drug lord",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Kameha_meha",
                            "body": "Ang sabi nya hindi drugs ang pinakamalaking problema ng bansa. Isa yun pero hindi pinakamalaki. Kung tamang paraan ang ginawa sa pag puksa ng drugs, di kagaya nitong EJK, sa tingin mo magiging okay na ang bansa? Masosolusyunan ba ng pagkapuksa ng drugs ang korapsyon?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "taponaway0430",
                            "body": "pinakita mo kung gaano ka katanga.\n\nkung tingin mo droga ang problema, sobrang tanga mo na. Kung problema dulot ng korapsyon, mababang kalidad ng edukasyon, kakulangan ng mationg trabaho, at mababang pasahod ang pag-uusapan, gamunggo lang ang problemang dulot ng droga.  \n  \nwag tanga",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "AdmiralFeelsBadman",
                            "body": "Putang ina mong zombie account. Nuknukan ka ng bobo. Samahan mo ung timang na tatay mo sa The Hague. Droga pa tanga. Ung anak ng ulaga mong tatay sabog palagi. Bat buhay pa ung gagang un? Tang ina mong palamuning salot",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "MommyJhy1228",
                            "body": "Kung dapat matokhang ang mga drug addicts, mas lalong dapat matokhang ang mga gambling addicts kasi ninanakawan nila ng kinabukasan ang mga anak nila",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Aeriveluv",
                            "body": "Tingin mo bakit may mga nagdadrugs? Dahil trip lang nila?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Aeriveluv",
                                    "body": "Quoting what u/Johnnyztrike messaged me\n\n“oo gago, kaya may nag ddrugs kasi trip nila. wala kang alam sa kalye gago”\n\nAh lahat ba sila trip nila? Galing naman. Saan mo nakuha yang stats mo?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "smoothartichoke27",
            "body": "Worse. Far. Far. Far. Worse.\n\nSabi ko nga dati, kahit magsunog ng watawat ng Pilipinas yang mga Duterte live on cam habang nagmumura, hahanapan pa rin nila ng dahilan yan na pabor sa imahe nila.\n\nKulto eh.",
            "score": 1,
            "replies": [
                {
                    "author": "Significant_Bunch322",
                    "body": "Yup kahit na mag jak*l pa sa harap nila Yung poon nila.. they will say Duts Forever pa rin",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Morningwoody5289",
                            "body": "Mag uunahan silang makalapit para matalsikan ng tamod",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "AutoModerator",
                                            "body": "Hi u/Responsible_Regret83, your [comment](https://www.reddit.com/r/Philippines/comments/1jdzhly/ganito_na_ba_talaga_ka_delusional_and_out_of/mif0158/?context=3) was removed due to the following:  \n    - Your account did not meet the minimum karma requirements and wont be able to post and comment. We will not disclose the Karma threshold. This is to limit potential trolls and bad actors on the subreddit. If you use a throwaway account and need help, please let the mods know.   \n\nPlease consider participating in other [Filipino related subs](https://www.reddit.com/r/Philippines/s/1rdCniBOBw) and increase your Karma before contributing in r/Philippines\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Philippines) if you have any questions or concerns.*",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "The_Voidger",
                                    "body": "Username checks out",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "ottoresnars",
                                    "body": "Iinumin nga nila yun, holy water daw nila eh",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "pendrellMists",
            "body": "..parang almost lahat yata ng collateral damage eh galing sa nde mayaman na pamilya.\n\n\n..ibig sabihin lahat ng operations eh nandoon sa mga mahirap na lugar..\n\n\n.. meron bang namang mga druglord na nakatira sa mga mahirap na lugar..\n\n\n..wala talagang utak itong mga bugok na supporter ni dugyutiti..",
            "score": 1,
            "replies": [
                {
                    "author": "jclqc12",
                    "body": "Exactly! The mere fact puro mahihirap, kasi lam nilang di kayang lumaban. Alam nilang di kayang maghabol. Pero if you think about it, biktima yan sila. Ginawa lang silang band aid para kunwari may ginagawa. Bat di nila habulin yung drug lords? Porket mahirap, madali lang iitsapwera ang buhay?\n\nGusto ko talaga ng sandamakmak na karma sa pamilya ni Digong at ng mga galamay nya pati ng mga pulis na pumatay sa mga inosente.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "avocado1952",
                    "body": "Yan din ang sinabi ni Motabato. Lahat ng pinapatay nila mahihirap. May mga iilang magaganda ang kutis pero may duda sya kung drug related ba.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Eastern_Basket_6971",
            "body": "Yung nag la laigh reacts  di tao yan demonyo yan",
            "score": 1,
            "replies": []
        },
        {
            "author": "Suweldo_Is_Life",
            "body": "Mga future apologists yan intayin niyo after 20 years nasa Senado na si Kitty Duterte.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Far-Ice-6686",
            "body": "PUTANG INA NUNG MGA NAG 'HAHA' REACT. PUTANG INA NYO AT SAMPU NG PAMILYA NYO. PUTANG INA NYO TALAGA.",
            "score": 1,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Far-Ice-6686",
                            "body": "Nope.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Apprehensive_Bet_526",
            "body": "maling mali na wala man lang parusa sa pumatay ng bata, ganun na lang ba yoon? colateral damage? wala lang go free pa din kahit palo sa kamay wala? grabe naman, kahit man lang sana si duterte na mismo mag sisi or malunkot at namatay ang bata pero wala rin",
            "score": 1,
            "replies": []
        },
        {
            "author": "im_rouge",
            "body": "While watching Edgar Matobato's confessions kanina naaiyak ako, grabe yung mga ginawa ng mga Duterte. Putangina ninyong lahat na nag Haha react puta kayo 😡",
            "score": 1,
            "replies": []
        },
        {
            "author": "sumayawshimenetka1",
            "body": "Majority ng nakikita mo Online are paid trolls. That's their job. Tapos Yung ibang marurupok at uto-uto, nahihikayat. Kaya ayun. Echo chamber. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ecstatic_Dot688",
            "body": "out of touch talaga kasi nga they felt \"safe\" during his term. not knowing na swerte lang sila at tayong lahat ng nakakawitness neto kasi hindi tayo napagkamalang adik :(",
            "score": 1,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "AutoModerator",
                            "body": "Hi u/Taposig, your [comment](https://www.reddit.com/r/Philippines/comments/1jdzhly/ganito_na_ba_talaga_ka_delusional_and_out_of/mif8w52/?context=3) was removed due to the following:  \n    - Your account did not meet the minimum karma requirements and wont be able to post and comment. We will not disclose the Karma threshold. This is to limit potential trolls and bad actors on the subreddit. If you use a throwaway account and need help, please let the mods know.   \n\nPlease consider participating in other [Filipino related subs](https://www.reddit.com/r/Philippines/s/1rdCniBOBw) and increase your Karma before contributing in r/Philippines\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Philippines) if you have any questions or concerns.*",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Lightsupinthesky29",
            "body": "Small time lang naman kasi talaga mga nakuha diyan, users. Hindi yung mga supplier at drug lord. Bobo lang talaga yung mga panatiko na mahirap na bigyan ng rason",
            "score": 1,
            "replies": []
        },
        {
            "author": "SeigiNoTenshi",
            "body": "I understand collateral damage, but there were way too many that died to justify this.",
            "score": 1,
            "replies": [
                {
                    "author": "RainyEuphoria",
                    "body": "The general public don't know the numbers of the dead, how many are collateral damage? how many are direct consumers and suppliers?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SeigiNoTenshi",
                            "body": "Exactly. Even then, if they ARE suppliers, they still need fue process",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "xxmeowmmeowxx",
                            "body": "Even if we knew the exact numbers, the DDS will find a way to say its a lie.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "bangus_sisig",
                    "body": "Understand? Bro wtf ano hinithit mo bago ka mag comment? So okay lng pag konti? Gago kb",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SeigiNoTenshi",
                            "body": "Aaannddd you missed the point",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "bangus_sisig",
                                    "body": "How? Basahin mo nga sinabi mo. So pag isa lng namatay sa collateral damage okay lng?pede i justify? ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "SeigiNoTenshi",
                                            "body": "Alam mo ba meaning ng collateral damage?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "bangus_sisig",
                                                    "body": "alam ko syempre. ikaw alam mo ba?  basahin mo nga sinabi mo.  or sagutin mo nlang tanong ko, so pag isa lng namatay sa collateral damage pwede i justify???",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "SeigiNoTenshi",
                                                            "body": "Yes? That is EXACTLY THE DEFINITION OF COLLATERAL DAMAGE. \n\naccidental deaths happen ALL THE TIME and completely inevitable at certain threshols. Napaka optimistic at bobo na iassume na hindi sya EVER mangyayare. Kaya lagi sa operasyon, kasama ang investigation Kung avoidable nga ba sya o hindi. \n\nKala ko ba alam mo ibig sabihin nito?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "iamjohnedwardc",
                                                                    "body": "Pakisagot na lang, ilang deaths ang acceptable na collateral damage for you?\n\nI think one innocent death is one death too many. Lalo na kung pinaiiral ng sistemang walang due process at inenourage pumatay lang nang pumatay.\n\nHypothetical question: kung isang collateral damage lang pero ikaw o kamag anak mo ang pinatay, katanggap tanggap kaya?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "SeigiNoTenshi",
                                                                            "body": "Wala, 0. Walang acceptable. PERO katangahan nalang iassume na walang collateral damage AT ALL in a given year. Much more so 6 years.\n\nI agree, 100 percent. Dapat May due process'. Before AND after operations. Dapat May hustisya parin ang namatay dahile sa collateral damage.\n\nObviously hindi mo talaga ako naintindihan.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "bangus_sisig",
                                                                    "body": "eh ang point ko is parang okay lng sayo if may namtay na isa sa collateral damage. kaya nga mali ang approach nila eh ano yan gagawing shootout lahat ng bahay sa squatter area??  ambobo ng statement mo eh pota \"there were way too many that died to justify this\" WOW hahahaha",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "SeigiNoTenshi",
                                                                            "body": "Tama ang sinabi ko. \n\nMasyadong madaming collateral damage para sabihing tama ang ginawa nila. \n\nSa ibang salita, hindi tama ang ginawa nila. Hindi magandang May ni isang mamamatay, pero hindi realistic na iassume na wala.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Jim2tolive",
                                                                                    "body": "Alam niya yung term na collateral damage, pero in denial siya in a sense.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "bangus_sisig",
                                                                                    "body": "\"Masyadong madaming collateral damage para sabihing tama ang ginawa nila\".  ikaw na mismo nag sabi. hahahahaha",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Jim2tolive",
                                                                                            "body": "Copium much?",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "MisssAntidote",
            "body": "Hindi out of touch tawag dyan. Demonyo tawag dyan. Diretso impyerno",
            "score": 1,
            "replies": []
        },
        {
            "author": "Feisty_Goose_4915",
            "body": "Yung mga DDS ngayon puro Aling Shiela",
            "score": 1,
            "replies": []
        },
        {
            "author": "MickeyDMahome",
            "body": "What a rough country...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hpezlin",
            "body": "Never under underestimate the power of stupid.",
            "score": 1,
            "replies": []
        },
        {
            "author": "staryuuuu",
            "body": "Maganda sana kung mapuno ng ganitong story mga timeline sa fb pero mabubully lang sila ng mga die hard DDS. Di bale, nililitis na siya. Sana lang di na makalusot.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Positive-Situation43",
            "body": "Nasan yung mga pulis na involved dito? Im all for duts to rot in hell pero sana mapanagot yung mga local pulis.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KulangSaSarsa",
            "body": "Just think about it, they all have the same voting rights as you. The decline of democracy lies in the provision that even stupid people have the right to vote. It's a tragedy of the free world.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jeuwii",
            "body": "Pls po pakibigay na sa kanila ang hustisya na matagal na nilang hinahanap. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dry_Seat_6448",
            "body": "I have this workmate na lagi niyang sigaw. \"Ikaw ba pre, payag kang marape babae mong anak/kapatid\". Lagi kong sagot sa kanya, ikaw payag ka bang patayin kita, pero sabihin kong adik ka kahit hindi?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fit_Feature8037",
            "body": "There’s so much more ahead of those kids. Nakakaawa sila. \n\nPero putangina talaga ng mga dds na kesyo kaya nadamay dahil anak/kamag anak daw ng mga adik. Anong klaseng utak meron sila, kung may utak nga sila.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wineklek",
            "body": "PUTANGINA MO DUTERTE, DI MO DESERVE SA NETHERLANDS I-DETAIN. SANA MAKANTOT SA PWET PUKINANG INA MO",
            "score": 1,
            "replies": []
        },
        {
            "author": "min134340",
            "body": "Naiyak naman ako. Tangina mo duterte",
            "score": 1,
            "replies": []
        },
        {
            "author": "Key_Upstairs5238",
            "body": "Bakit mas marami \"HAHA\" reacts?. Pag sila kaya namatayan/namatay tapos tawanan lang den.",
            "score": 1,
            "replies": []
        },
        {
            "author": "The_Voidger",
            "body": "Sabihin na nating \"collateral damage\", eh mali pa rin. Hindi naman nagbago na may napatay na mga inosente dahil incentivized ang mga pulis at kung sinu-sino na pumatay ng kahit sinong makita nilang \"adik\" kuno. Hindi pa rin mawawala ang katotohanang wala namang paglilitis na nangyari, hindi dumaan sa tamang proseso ng batas, walang rehabilitasyon, hindi nahuli ang mga dealer at pusher, at marami pa ring user hanggang ngayon. \n\nKung sila, o kapamilya nila ang nadamay, hindi nila masasabi 'yan. Pero siguro 'yon 'yong problema: walang *empathy* sa kanila.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ottoresnars",
            "body": "Patay na yung bata pero i-rered tag pa nila",
            "score": 1,
            "replies": []
        },
        {
            "author": "jpierrerico",
            "body": "It's because they saw Duterte used his position to bully others he outranked in privilege, power and the capacity to fight back and this instinct to humiliate when it's modeled by someone seating in the most powerful seat in our country, it trickles down into everybody's life cause it kinda give permission for others to do the same. Disrespect invites disrespect. Violence incites violence.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hi u/muthafukin_tired, your [comment](https://www.reddit.com/r/Philippines/comments/1jdzhly/ganito_na_ba_talaga_ka_delusional_and_out_of/mieih2c/) was removed due to the following:  \n    - Your account did not meet the minimum karma requirements and wont be able to post and comment. We will not disclose the Karma threshold. This is to limit potential trolls and bad actors on the subreddit. If you use a throwaway account and need help, please let the mods know.   \n\nPlease consider participating in other [Filipino related subs](https://www.reddit.com/r/Philippines/s/1rdCniBOBw) and increase your Karma before contributing in r/Philippines\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Philippines) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hi u/byesiu, your [comment](https://www.reddit.com/r/Philippines/comments/1jdzhly/ganito_na_ba_talaga_ka_delusional_and_out_of/mieoanl/) was removed due to the following:  \n    - Your account did not meet the minimum karma requirements and wont be able to post and comment. We will not disclose the Karma threshold. This is to limit potential trolls and bad actors on the subreddit. If you use a throwaway account and need help, please let the mods know.   \n\nPlease consider participating in other [Filipino related subs](https://www.reddit.com/r/Philippines/s/1rdCniBOBw) and increase your Karma before contributing in r/Philippines\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Philippines) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Stunning-Day-356",
            "body": "These families need more love and support from others. Sana mabigyan pa sila ng lakas at pagasa despite na may kapamilya silang nasawi nang dahil sa ejk.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hi u/aterudane, your [comment](https://www.reddit.com/r/Philippines/comments/1jdzhly/ganito_na_ba_talaga_ka_delusional_and_out_of/miesz46/) was removed due to the following:  \n    - Your account did not meet the minimum karma requirements and wont be able to post and comment. We will not disclose the Karma threshold. This is to limit potential trolls and bad actors on the subreddit. If you use a throwaway account and need help, please let the mods know.   \n\nPlease consider participating in other [Filipino related subs](https://www.reddit.com/r/Philippines/s/1rdCniBOBw) and increase your Karma before contributing in r/Philippines\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Philippines) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "metap0br3ngNerD",
            "body": "Pero ung mga rich kid na nagrerecreational drugs wala naman nabalita na natokhang. Meron pa ngang gwapings na artista at isang apo ng ex president na nahulihan ng tsongke sa pampanga na tumakbo pa sa checkpoint pero di naman “nanlaban”.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SelectionFree7033",
            "body": "The answer is 100% yes and kung pwde lang tumaas pa sa 100%, sasabihin kong talagang delusional, deranged, out of touch, bobo, tanga, hangal, at baliw ang mga DDS. Nung namumuno si Duterte, sinabi nya na \"collateral damage\" daw ang pagkamatay ng bata (or mga bata) sa war on drugs. That is complete bullshit. While you can't avoid 100% no collateral damage, at least the PNP should have a concrete plan (ethically and morally) to minimize or zeroed this what so called \"collateral damage\". Bobo lang ang nagtatago sa likod ng salitang \"collateral damage\", meaning, wala talagang konkretong plano sa \"war on drugs\" na yan. Kaya kung ano man ang dinaranas ni tarantadong Digong ngayon, nararapat lang yun sa kanya, at kulang na kulang pa yung dinaranas nya ngayon.",
            "score": 1,
            "replies": []
        },
        {
            "author": "impalaaaa67",
            "body": "Inaalagaan  kasi ni Dutae mga drug lord para paldo pamilya nila🤔",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hi u/Tots032, your [comment](https://www.reddit.com/r/Philippines/comments/1jdzhly/ganito_na_ba_talaga_ka_delusional_and_out_of/mif0sed/) was removed due to the following:  \n    - Your account did not meet the minimum karma requirements and wont be able to post and comment. We will not disclose the Karma threshold. This is to limit potential trolls and bad actors on the subreddit. If you use a throwaway account and need help, please let the mods know.   \n\nPlease consider participating in other [Filipino related subs](https://www.reddit.com/r/Philippines/s/1rdCniBOBw) and increase your Karma before contributing in r/Philippines\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Philippines) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "AutoModerator",
                            "body": "Hi u/Tots032, your [comment](https://www.reddit.com/r/Philippines/comments/1jdzhly/ganito_na_ba_talaga_ka_delusional_and_out_of/mif0uc2/?context=3) was removed due to the following:  \n    - Your account did not meet the minimum karma requirements and wont be able to post and comment. We will not disclose the Karma threshold. This is to limit potential trolls and bad actors on the subreddit. If you use a throwaway account and need help, please let the mods know.   \n\nPlease consider participating in other [Filipino related subs](https://www.reddit.com/r/Philippines/s/1rdCniBOBw) and increase your Karma before contributing in r/Philippines\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Philippines) if you have any questions or concerns.*",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ZeroSick",
            "body": "grabe, parang mga wala talagang pinag-aralan",
            "score": 1,
            "replies": []
        },
        {
            "author": "RizzRizz0000",
            "body": "Partida di pa payat yung bata para pagkamalang adik!! Kaya kahit bochog ka pwede ka paring matokhang",
            "score": 1,
            "replies": [
                {
                    "author": "beyond_dogstyle",
                    "body": "Di mo ba binasa ung tarp?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "FAVABEANS28",
            "body": "The kid didn't deserve this. Hayop yung gumawa nito.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hi u/DisciplineKooky7482, your [comment](https://www.reddit.com/r/Philippines/comments/1jdzhly/ganito_na_ba_talaga_ka_delusional_and_out_of/mifm448/) was removed due to the following:  \n    - Your account did not meet the minimum karma requirements and wont be able to post and comment. We will not disclose the Karma threshold. This is to limit potential trolls and bad actors on the subreddit. If you use a throwaway account and need help, please let the mods know.   \n\nPlease consider participating in other [Filipino related subs](https://www.reddit.com/r/Philippines/s/1rdCniBOBw) and increase your Karma before contributing in r/Philippines\n***\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Philippines) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "andogzxc",
            "body": "Putangina. Dito ako naiyak 🥺 ngayon ko lang to nalaman fuck MABULOK KA SANA DIGONG PUTANGINA MO",
            "score": 1,
            "replies": []
        },
        {
            "author": "greyT08",
            "body": "Lahat ng news outlet sinasabihan bias - ayaw nila ng katotohanan para bang napapaso. Gusto nila fake news - yan lang kase ang good news nila. Sa vlogger na lang daw sila makikinig kesa sa mga established news agency. 😝",
            "score": 1,
            "replies": [
                {
                    "author": "Jim2tolive",
                    "body": "Mas gusto nila yung SMNI or yung channel na run by the \"CIN\", which are oddly run by \"cults\" in a sense",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "6Fert",
            "body": "meron pa silang rebuttal yung kay aling shiela daw",
            "score": 1,
            "replies": []
        },
        {
            "author": "Beautiful-Ad5363",
            "body": "Sana hindi mangyari sa pamilya nila yung naranasan ng nga inosenteng taong nadamay sa war on drugs na yan.\n\nPaiyakiyak pa sila sa TV dahil nakulong ang tatay nila, pero di nila inisip yung mga pamilya ng namatayan.",
            "score": 1,
            "replies": [
                {
                    "author": "Beautiful-Ad5363",
                    "body": "Tapos ang lalakas ng loob na sabihin na ang safe ng Pilipinas nung time ni ex pres pero nasa ibang bansa sila naka base.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "dickielala",
            "body": "Naiyak ako dito. Lalo na yung sinabi nung tatay na at least naabutan niya na may nagkaroon ng unting hustisya. Kasi may edad na raw siya and baka hindi na niya maabutan.",
            "score": 1,
            "replies": []
        },
        {
            "author": "0ZNHJLsxXKPbaRN5MVdc",
            "body": "Nakakainis yang mga nag \"haha\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "SpeedAdvantage_2627",
            "body": "May mga gym friends ako, actually mga kupal kami sa gym pero not in a rude way, medyo rude pero still funny and friendly pa din. One time nagkakilakilala kami bali friends na kami. May  GC kaming lima. Ako lang hindi DDS lahat sila DDS.\n\nKahit araw araw ko silang tinitira and back-and-forth, wala namang pikunan. At the end of the day, friends pa din. Tawag ko nga sakanila DDS. Edukado naman sila and ginagawa ko lahat i=explain sa kanila. I maybe successful or not, i dont really care. \n\nNahihiram ko kotse nila pinapahiram ko sakin. DDS sila pero hindi sila tulad nung iba na nakikipag away. Niyaya ko nga sila, mga DDS anong oras tayo buhat? Natawa lang sila hahaha",
            "score": 1,
            "replies": [
                {
                    "author": "RainyEuphoria",
                    "body": "Based sa observations mo, bakit sila patuloy na nagiging DDS? What convinced them?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SpeedAdvantage_2627",
                            "body": "Yung dalawa INC, yung isa medyo tagilid na kaka explain ko yung isa wala talagang paki. Siguro to answer your question, medyo mahina critical thinking nila lalo na yung wala talagang paki at yung dalawang INC. Yung isa dating solid ngayon parang nagiging neutral na kaka explain ko pero happy kami sa isat isa. Ako lang din atheist samin. \n\nThey still believe war on drugs made the Philippines safer with is load of bullshit. They also believe that LP are the worst. They believe De Lima was they really think she was pero yung isa sakanila yung neutral sabi niya gusto daw niya si Bam at Kiko.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "papa_redhorse",
            "body": "Pasalamat sya di naging collateral damage ang family nya",
            "score": 1,
            "replies": []
        },
        {
            "author": "BeginningAd9773",
            "body": "It’s a dilemma of maraming mapatay na kriminal pero may madadamay na inosente or ok lang konti mapatay na kriminal, wag lang madamay mga inosente.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AccomplishedBeach848",
            "body": "Hati talaga tayong mga pinoy pagdating sa opinion kay duterte, may positive at negative talaga, ang nagustuhan ko lng dati kay duterte is nakakapaglakad ka ng safe sa kalye kahit gabi na, compare mo today di na kami makalabas lalo pag gabi dahil takot na kmi.. di natin mababago pananaw ng mga dds kaya respect na lng ntin opinion ng bawat isa",
            "score": 1,
            "replies": [
                {
                    "author": "xxmeowmmeowxx",
                    "body": "Ang daming factors actually e, ako din mapayapa nakakalakwatsa before his presidency kasi safe sa mga pinupuntahan ko. Nung nagkamdrug war nagkaroon ng barilan dito sa may amin, isa dun sa bakery na malapit sa amin. Kung sakali pala na bumili ako noong gabing yun at nadamay ako e baka tawagin na rin akong adik ngayon ng mga di nag-iisip na DDS na yan. Sometimes you have to think critically e. Maswerte ka safe ka nung time nya.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}