{
    "title": "Why is Organising So Hard?",
    "author": "Faeldar2223",
    "subreddit": "Anarchism",
    "rank": 226,
    "score": 192,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 57,
    "url": "https://www.reddit.com/r/Anarchism/comments/1im9n88/why_is_organising_so_hard/",
    "id": "1im9n88",
    "selftext": "I am definitively anarchist, have been for as long as I could hold a political opinion, and have been active in it. I’ve slept on streets, been kicked out of public spaces by police for sleeping in the open, and put a lot of effort into homeless outreach. I’m not just here to put bricks through windows- even if that is fun- but I genuinely struggle to stay engaged and hopeful when I feel like there is no way to connect now.\n\nI get Op-Sec is important- the most important- but fuck, the right wing with their weird hardline groups like Atomwaffen or Combat-18 can recruit fairly fucking easily- why can’t we? Why would it hurt us to take the risk and sometimes actually organise publicly and hurt our enemies directly? \n\nThis is half a rant and half me asking as to why we seem to be so passive now. I still see the endless fucking “punch Nazi’s” comics and slogans and everyone talking a big game- but most people seem to be just doing nothing. I help those in need and have been those in need, and have been to protests to counter right wing stuff in the UK, and if I could find a group of people willing to help and cover certain things- I would happily burn down a house or two (I even know how to due to having a lawyer in the family). But I can’t, and it pisses me off.",
    "comments": [
        {
            "author": "abandonsminty",
            "body": "Right wing groups have less trouble recruiting/not getting arrested because they're useful to the state, the state considers the left wing it's enemies so we are policed/laws are enforced upon us",
            "score": 167,
            "replies": [
                {
                    "author": "ronnierubick",
                    "body": "The state loves the left .",
                    "score": -117,
                    "replies": [
                        {
                            "author": "Legitimate-Teddy",
                            "body": "what world do you live in and how do i get there",
                            "score": 106,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": -18,
                                    "replies": [
                                        {
                                            "author": "Legitimate-Teddy",
                                            "body": "*I'm* confused? The US government is banning random bullshit for being, and this is a direct quote, \"woke\", while stripping away every half-good thing we've ever managed to get in this shithole country, banging on about how evil leftists are, and this is supposed to demonstrate a love for the left how exactly?\n\nAre you sick in the head? Are you suffering from delusions? Do you need professional help? Because you're clearly disconnected from reality.",
                                            "score": 22,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Head_Bad6766",
                            "body": "They love to have the left as the boogie man that's for sure but I suspect they would prefer to have very little opposition. Or are you trolling?",
                            "score": 44,
                            "replies": []
                        },
                        {
                            "author": "slowwwwdowwwwn",
                            "body": "The state loves liberals*",
                            "score": 24,
                            "replies": []
                        },
                        {
                            "author": "CheapManualLabor",
                            "body": "Democrats are not the left lol",
                            "score": 26,
                            "replies": [
                                {
                                    "author": "ronnierubick",
                                    "body": "What's the left in your view? (downvote me for asking a question)",
                                    "score": -12,
                                    "replies": [
                                        {
                                            "author": "CheapManualLabor",
                                            "body": "Socialists, communists, (most) anarchists, etc. People who want to eliminate class disparity and put an end to capitalism. Your typical Democrat, on the other hand, reinforces existing class structures while hiding behind empty promises of equality and would actually be considered pretty moderate by European standards. It's a big reason why they sabotaged Bernie's campaign in favor of Hillary back in 2016; they aren't actually interested in changing the status quo because the status quo benefits them.",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "AutoModerator",
                                    "body": "Hi u/katieleehaw - Your comment has been automatically removed for containing either a slur or another term that violates the [AOP](https://www.reddit.com/r/Anarchism/wiki/aop). These include gendered slurs (including those referring to genitalia) ***as well as ableist insults which denigrate intelligence, neurodivergence, etc.***\n    \nIf you are confused as to what you've said that may have triggered this response, please see [this article](https://www.autistichoya.com/2014/02/violence-linguistic-ableism.html) and the associated [glossary of ableist phrases](https://www.autistichoya.com/p/ableist-words-and-terms-to-avoid.html) **BEFORE** contacting the moderators.\n\nNo further action has been taken at this time. You're not banned, etc. Your comment will be reviewed by the moderators and handled accordingly. If it was removed by mistake, please reach out to the moderators to have the comment reinstated.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Anarchism) if you have any questions or concerns.*",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheTarquin",
            "body": "Capitalism also  makes large scale social organizing structurally harder. The atomization of society means we spend less time together, trust our fellow community members less, and spend more time exposed to propaganda.",
            "score": 67,
            "replies": [
                {
                    "author": "Head_Bad6766",
                    "body": "That's exactly the issue. Everyone is so wrapped up in survival and scared, scared. I have no one to talk to about radical ideas.",
                    "score": 25,
                    "replies": []
                },
                {
                    "author": "SingSangDaesung",
                    "body": "Between fear, my kid, not being able to take time off work, my car being crap & the exhaustion of working full time, being a single parent & having chronic pain, I just can't do it 98% of the time. The 'want to' is there, it's just the 'how??'. most protests, I can't leave work for or they're too far away for me to drive to, unfortunately.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sargon-of-ACAB",
            "body": "Opsec **is** important but it doesn't mean you can't do public facing organizing\n\nIt just means you need to keep the spicy stuff compartementalized\n\nThere's (for example) legal antifascist stuff you can do. That's important on its own but it also helps you build a network. Same for stuff like food not bombs",
            "score": 73,
            "replies": []
        },
        {
            "author": "comic_moving-36",
            "body": "Some UK based social movement stuff that might be useful to you. Find your people, learn and build trust. Organizing is usually slow and thankless work. Don't post about spicy stuff.\n\n\nafed.org.uk/\n\n\nhttps://libcom.org/article/organise\n\n\nhttps://libcom.org/article/libcomorg-introduction\n\n\nhttps://m.soundcloud.com/12rulesforwhat\n\n\nhttps://freedomnews.org.uk/\n\n\nhttps://iww.org.uk/\n\n\nhttp://solfed.org.uk/\n\n\n\nThis is not an endorsement of any one group or local.",
            "score": 25,
            "replies": [
                {
                    "author": "Head_Bad6766",
                    "body": "Thanks for sharing. Community building is one thing that we can do. But when it comes to action all I ever find is timid libs who are afraid of rocking the boat in any big way. They wig out if you even yell back at counter demonstrators. And they think electing Dems is the answer. And then there's a few tankies that I don't trust",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "Das_Mime",
            "body": "Atomwaffen, though they did and attempted a lot of terrible shit, was never a huge organization, and they were riddled with moles and informants from early on probably because they were just advertising openly \"hey we're revolutionary Nazis and we're going to blow things up\", and while law enforcement habitually gives rightwingers a pass, since OKC they do take threats of killing federal workers seriously.",
            "score": 19,
            "replies": []
        },
        {
            "author": "Competitive_Bat_5831",
            "body": "It’s easier for right wing groups people the people policing the laws(and therefor are why you might need op-sec) don’t apply them evenly.",
            "score": 15,
            "replies": []
        },
        {
            "author": "NoUseForAName2222",
            "body": "I'm planning on writing a post about this later, but the truth is that a lot of us don't know how to organize things, and that's one of the reasons that the fascists are gaining power.\n\n\nLast week I did go to a protest. Unfortunately it was ran by a liberal group that is more interested in getting a Democrat in the White House in four years than they are with the issues they organized a protest for (immigration). \n\n\nA lot of us have tagged along with liberal groups for a long time because they were the ones doing a lot of the organizing. That's why we weren't working nearly as hard as we should have been during the Biden administration. The liberal groups slept, and we didn't know how to organize anything ourselves. \n\n\nWe really need to learn how to do all this ourselves. Liberals have pretty much pissed away what little trust we've had in them the last four years, which hampers organizing efforts. \n\n\nI'm not sure where to start on that, though. ",
            "score": 18,
            "replies": [
                {
                    "author": "LostInIndigo",
                    "body": "I mean this with love, but this is a very online take, and it is bizarre to me how few people on Reddit seem to be aware of the vast amount of organizing currently happening all over the place.\n\nYou probably don’t know what’s going on in your area because you are spending all your time tagging along with liberal groups to protests for the Dems instead of seeking out the more meaningful mutual aid and direct action groups in your area",
                    "score": 11,
                    "replies": [
                        {
                            "author": "NoUseForAName2222",
                            "body": "I'm in a mutual aid group. And we don't how to organize much of anything except food drives and free stores. I wasn't kidding when I said we don't know how to organize. ",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "PairPrestigious7452",
                                    "body": "This, so much of this.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "LostInIndigo",
                                    "body": "Just out of curiosity, how did you get involved in this mutual aid group? What kind of research and reading did you do when you decided to get into leftism? How did you seek to connect with the organizing community?\n\nNot asking this to be a dick-being 100% sincere\n\nI teach a couple organizing and direct action workshops for people new to stuff and I’m genuinely curious what approach people are taking now when they are just getting into things \n\nOften what I find is that folks are seeking out the most accessible/low stakes seeming actions as opposed to finding the groups with the most helpful and radical political education, and that’s a great way to end up in the DSA or PSL or something",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "NoUseForAName2222",
                                            "body": "Well, instead of asking for my life story (which I'm definitely not going to give on the internet), how about you point some of us in the right direction so we can learn. ",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "LostInIndigo",
                                                    "body": "Don’t think I’m asking for a life story here - I think I am asking for “I look for stuff to get involved in via social media ” or “I get most of my political education from events put on by orgs in my town”. \n\nIt’s hard to know what is “helpful” because I feel like it’s definitely *not helpful* to list a bunch of general stuff like “look for mutual aid groups in your area“ because *clearly* you have already done that and it has not been helping. You could Google that advice, so either you haven’t, and I probably can’t help you in that case, or you have and you need more specific feedback on next steps.\n\nKinda like I said to OP though-you’re expressing that you don’t know how to get involved in things you want to get involved with, but maybe interrogate how you show up when you’re looking for those things?",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "NoUseForAName2222",
                                                            "body": "You said you teach workshops, right?\n\n\n>or you have and you need more specific feedback on next steps.\n\n\nYeah, that's exactly what I'm asking for. ",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Head_Bad6766",
                            "body": "Come to a conservative rural area. There is literally nothing going on besides a few liberal protests in the college town county seat. I'm very resourceful and aware of what's going on. I try to get people to see that much more has to happen but they are afraid. There has never been anything more radical in the 40 years that I have lived here. There might be more happening now with the current situation but we shall see. The only mutual aid group is a tiny tankie PS&L group and I have called out their leader for boosting Russia. Ohhh the local militia calls itself Patriots Mutual Assistance Group and they know who I am.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Bake_My_Beans",
            "body": "Because the left overall has a pretty big problem with advertising and marketing. Like you have to actively seek out leftist spaces and groups, but the right is reaching out.\n\nWe need to reach out, to advertise ourselves, and to be approachable and accessible. Opsec isn't the only reason groups are barely known about. Even in countries like mine (NZ) where govt crackdown or right-wing violence against us is pretty damn unlikely, we don't use that opportunity to be loud and recruit.\n\nWe're too busy debating theory, history and in-fighting to actually get out there and get some people together to do shit.",
            "score": 8,
            "replies": [
                {
                    "author": "HotIndependence365",
                    "body": "Agreed. The # of times I've been lectured by an online activist referring to the right way to do things according to the theory.\n\n\n\n\nI've been part of some true anarchist organizing with legit successes by any measure but tell me more about how we're all just socialists and should be focused on the proletariat liberation instead of the organizing we're actively doing...",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Same_Statement1380",
                    "body": "Feel this. We have a [blog](https://midstlabs.substack.com) where we are trying to pull the theory in to create better tools for change. The theory is great but limited in certain ways, don’t fully seem to understand working under capitalism. The tools are also good but could be better through theory. \n\nAnyway, if anyone is interested, we’re trying to build out a collaborative space to make this happen!",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "disorderfeeling",
            "body": "I know a guy who does a few things which seem to work kind of well.  It’s still limited, but he has made a pretty great network.  He has started free markets, prints zines and pamphlets about anarchism, he hosted a weekly dinner which was made from discarded food. That’s the kind of thing that becomes deeper over time; squats, mutual aid projects of many kinds. Probably a good idea to do something like that.  I think it may help if you get involved with a group of people or have a friend who you can organize with, but that’s a start.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Charming-Score7015",
            "body": "It depends. There are places on earth like France,Greece and Chile where anarchists and antifascists really fight and taking risks towards nazis,cops and the state. But thats beacause they have a big number of supporters in their streets. Being risky and clear right wing countries like U.S.A.,Italy,Hungary etc. is more difficult to take the risk.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Anarcho_Humanist",
            "body": "Part of it is likely fascist propaganda, they want to make themselves seem bigger and more popular than they actually are.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Florolling",
            "body": "I’d love to organize. Anarchy needs an official political presence. For utilities sake of course.",
            "score": 3,
            "replies": []
        },
        {
            "author": "autonomommy",
            "body": "Idk I'm finding local harm reduction groups to get involved in. I think anyone can punch fascists, but what else do we do? I can't do much. I have a history of aggression and poor mental health for which I receive disability payments from social security. I have been problematic before in organizing. If I want to be effective, I need to listen, keep my mouth shut and a lid on my ego and stifle all the rage that demands immediate retribution for injustice no matter the fallout. I put energy into trying to advocate for the unhoused where I live right now. I was sitting in city hall with them before, but now I'm about to see a different side of them on the 13th. I don't really have what it takes right now to start anything. If I did, something very stupid would probably still happen right away. 🙃\nRecognize your limitations, consider others, and have a rough idea of what you're comfortable doing as an organizer. I forgot a lot because of trauma, but it's kinda coming back.\n\nThere is one definitive victory I can remember from organizing in the mid '00s. My chapter of ARA organized an action wherein we countered a hate rally in TX using puppets and street theater. We were prepared with literature and had answers for the students walking through from the college in the town where the thing was taking place. Nobody arrested, not even a nazi. We sure made them cry, though. That group of NSM nazis went home and whined on a hate website, proceeding to implode fantastically in front of the whole internet. \n\nI hope to emulate the formula one day but I don't actually know if I can stand other antifascists anymore. Get off my lawn",
            "score": 3,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hi u/autonomommy - Your comment has been automatically removed for containing either a slur or another term that violates the [AOP](https://www.reddit.com/r/Anarchism/wiki/aop). These include gendered slurs (including those referring to genitalia) ***as well as ableist insults which denigrate intelligence, neurodivergence, etc.***\n    \nIf you are confused as to what you've said that may have triggered this response, please see [this article](https://www.autistichoya.com/2014/02/violence-linguistic-ableism.html) and the associated [glossary of ableist phrases](https://www.autistichoya.com/p/ableist-words-and-terms-to-avoid.html) **BEFORE** contacting the moderators.\n\nNo further action has been taken at this time. You're not banned, etc. Your comment will be reviewed by the moderators and handled accordingly. If it was removed by mistake, please reach out to the moderators to have the comment reinstated.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Anarchism) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "methadoneclinicynic",
            "body": "Modern neolberal capitalism is organized around class warfare. That's its entire goal. It does that by atomizing society and channeling activist energy towards useless endeavors. Atomizing society is well known. Channeling activist energy is less so. This includes the non-profit sector, that's designed so that people who want to e.g. help the homeless do so in a way that doesn't challenge capitalism. Also things like the IPCC for climate scientists or shitty craft units like the AFL, and the democrats. \"Controlled opposition\" is another way of stating it. \n\nAnother way of pacifying the working class movements is by basic sabotage. This includes actual saboteurs who bog down meeting, but also hampering the organizing process by e.g. [getting people to care about pronouns, non-gendered language, etc](https://www.youtube.com/watch?v=_NdE9CjkvTY). imagine rosa luxemboug dealing with this shit.",
            "score": 3,
            "replies": []
        },
        {
            "author": "onefourthfran",
            "body": "activism suffers from high turnover and burnout",
            "score": 2,
            "replies": []
        },
        {
            "author": "AloshaChosen",
            "body": "American here and yeah, I think it’s just apathy. We can’t organise properly here either. I think it’s because we are all working class and have to trade our time for money in order to survive. \n\nI am trying to get my coworkers to organise against our company though, so that makes me happy.",
            "score": 2,
            "replies": []
        },
        {
            "author": "theec0ward",
            "body": "I am just now starting to realize facts hate and fear are just not enough to motivate people to resist. I need real connection to community. I need joy and love and learning and fun and trust. And to build that trust i need to love and be loved consistently and unconditionally. Fills me with so much hope because i know i can do that!",
            "score": 2,
            "replies": []
        },
        {
            "author": "PlauntieM",
            "body": "The right wing can be largely summarized as : people wanting to do harm but feel like the hero. They organize to do violence because that's their goal. They take the systems that support them for granted and so focus on destruction instead of creation.\n\nThe left can be summarized as : people who want to problem solve. Many of these folks are organizing things like food, medication, community support networks - you know things necessary to actually live because they understand that they need them to do anything else.\n\nTo get a group of leftists to fight together they need to also be connected through community.\n\nThis isn't a time for the men to go off and start learning to shoot while the women take care of the home front (i.e. everything else including feeding and housing and caring for those men). I gender it on purpose. Every conversation I se eis women trying to figure out how to not die and men trying to figure out how to organize a militia. Bros. Organization IS happening. Go help.\n\nThis is probably going to be less \"Anarchist militia goes out and do a battle\" and moreso \"don't starve and die from disentry\". They control the supply lines. That's what we need to be preparing for.\n\nYes there will be violence, but organization is much more diverse than that. Join the work that is being done to secure the basics for the community. You'll meet folks and create networks through that.",
            "score": 3,
            "replies": []
        },
        {
            "author": "LostInIndigo",
            "body": "If you think that direct organizing is not happening, that’s a you problem and not a problem with the movement\n\nI can tell you right now the reason people actually organizing shit are not organizing *with you* is because you think that the hard work of organizing includes mostly burning shit down. \n\nIf I was organizing something in your area, I can tell you right now from your vibe that I would not fucking tell you about it\n\nETA: Like why do you need a group to tell you to go ahead if you have resources to be planning things in your own pod? Why do you need people to be talking about it on a public forum? Think about the conversation you’re actually having right now.",
            "score": 4,
            "replies": []
        },
        {
            "author": "gabriel01202025",
            "body": "Because most people want to do things their way",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cybin333",
            "body": "It's making friends that's hard",
            "score": 1,
            "replies": []
        },
        {
            "author": "PairPrestigious7452",
            "body": "It's probably easier to organize a cell than a large group. Keep it to yourselves, don't post the theater of the deed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bright-Ad1273",
            "body": "Where I live, organizing is difficult, but perhaps not as difficult as in Western Europe or the US. I can sympathize with this challenge! However, even attending meetings is difficult for me, as life remains busy despite everything—there are overlaps, and I also want to rest. I feel that I wasn’t as atomized before the COVID-19 pandemic, but maybe I’ve just gotten older.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Creative-Flatworm297",
            "body": "I think the greatest weapon of the right wing thugs is stereotyping who opposes them , that's why it is so intimidating for many to oppose them",
            "score": 1,
            "replies": []
        },
        {
            "author": "SnidelyDicklash",
            "body": "It's hard because American society has been manipulated in such a way that we're fundamentally isolated from each other. Our media paints a much more dire picture of others and the danger of others that it literally affects our perceptions.",
            "score": 1,
            "replies": []
        },
        {
            "author": "icantgivecredit",
            "body": "the seat of power is very far away. you cannot just walk to the white house",
            "score": 1,
            "replies": []
        },
        {
            "author": "dashibid",
            "body": "The boring stuff is necessary though- how will people know they can join a general strike if they don’t know where they’ll get food if they’re fired? Why would your neighbor trust you to hide them from deportation if they’ve only ever had one conversation with you? Being willing to F shit up might make you sound cool but sometimes a boring and calm protest or food distribution is a better way to build trust with those around you.\nBoth a necessary. A flashy action that gets ppl arrested prob gets ppl talking about your issue and recruits a certain type of ppl. Def builds a strong bond of trust between ppl taking that risk together, but it’s not the be all end all of making change.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Key_Purchase534",
            "body": "I might be out of line, but the consensus is propaganda, and fear controls the actionable steps needed to organize. Why aren't localized strikes more popular? For instance, if your job and fear of losing security are keeping people from organizing, the first logical step would be to eliminate the job (even if temporarily) and devote time to forming meaningful relationships with others who feel the same way (I'm sure they are out there). \n\nIs it really true that nobody would like to take off work for a week or so? - you can't expect to defeat capitalism by participating in a capitalist structure.\n\nIs it so off base to form a solid group of, say, 10 people who would be willing to strike? Those 10 people surely have a network of 10 others who wouldn't mind skipping out of work; if one person struggles, the network must be willing to support them/share resources. \n\nIs the issue that people averse to capital generally don't have much of it and thus less to share? - I can see that, but the larger the group, the more diverse the skillset and collective resource bank (food/shelter). \n\nOr is the issue that people have difficulty forming meaningful connections with people with similar convictions?\n\nOr is it that said convictions are just an ideal, always to be discussed and agreed upon but never put into practice?",
            "score": 1,
            "replies": []
        },
        {
            "author": "RiveraStanRepublic",
            "body": "because anarchism",
            "score": 1,
            "replies": []
        },
        {
            "author": "SiQSayaDjin23",
            "body": "\"Hi, Kanacke from Germany here. Ironically, in my view, things are failing here too because the broader left-wing scene is full of cowards. My activism focuses on the intersection of anarcho-punk and migrant Islam. For me, this intersection exists because anarchists are the only ones overcoming the bias around the 'Islamic cis-man and patriarch,' thereby cutting the Gordian knot of 'Kanacke vs. punk' or 'Islam vs. rights.' \n\nInshallah, the day will come when we all shout 'Oi!' together.\"",
            "score": 0,
            "replies": []
        }
    ]
}