{
    "title": "Looking for anti-Elon, anti-Capitalist printables",
    "author": "jotundaggers",
    "subreddit": "Anarchism",
    "rank": 139,
    "score": 81,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 22,
    "url": "https://www.reddit.com/r/Anarchism/comments/1islhnj/looking_for_antielon_anticapitalist_printables/",
    "id": "1islhnj",
    "selftext": "Does anyone have links to some posters or fliers I can print out that are anti-capitalist, anti-elon/tesla, and anarchist in general? It would be a huge help for a project I'm going to start working on! ",
    "comments": [
        {
            "author": "twodaywillbedaisy",
            "body": "CrimethInc.'s [They Don't Give a Fuck About You](https://crimethinc.com/posters/they-dont-give-a-fuck-about-you)",
            "score": 20,
            "replies": [
                {
                    "author": "AnthonyRage",
                    "body": "thanks ive added trump and change to 'they dont really care about us' cause m.j. was my childhood hero",
                    "score": 3,
                    "replies": [
                        {
                            "author": "jotundaggers",
                            "body": "can i see this version :0",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "AnthonyRage",
                                    "body": "hope it gets approved\n\n[https://www.reddit.com/r/Anarchism/comments/1iugb40/my\\_version\\_of\\_antielon\\_printable/](https://www.reddit.com/r/Anarchism/comments/1iugb40/my_version_of_antielon_printable/)",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "jotundaggers",
                    "body": "this one is amazing, thank you",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "porkchopleasures",
            "body": "Somebody posted on one of anarchy subreddits a poster from the 80s showing the USSR and US as giant mosquitos sucking the lifeblood out of the worlds but they updated it to have Trump, Putin, and Musk on it.\n\nI can't find it but hopefully somebody else can. It would be pretty cool to post up.",
            "score": 8,
            "replies": [
                {
                    "author": "jotundaggers",
                    "body": "that sounds fucking metal, i'll try to search for it!",
                    "score": 2,
                    "replies": [
                        {
                            "author": "porkchopleasures",
                            "body": "I found [it here](https://www.reddit.com/r/COMPLETEANARCHY/s/AwwD6fzhDm)",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sayyed_saif",
            "body": "Krime_1 on instagram \n\nhttps://www.instagram.com/p/DFFNTW6tUYh/?igsh=MWEwZDR1ZWhybzM0cQ==\n\nhttps://www.instagram.com/p/DF0bJe7t1Md/?igsh=MXM5MGJkdXB4dWloYQ==",
            "score": 5,
            "replies": []
        },
        {
            "author": "am_az_on",
            "body": "I did a mega thread a while ago in this sub where you can find some stuff.\n\nthere's a newer one too, it was added there then disappeared, [archive.org/details/@doge\\_mag](http://archive.org/details/@doge_mag) that is a collection all specific to the new administration regime, including one about the tech-right/ AI fascism.",
            "score": 3,
            "replies": [
                {
                    "author": "jotundaggers",
                    "body": "thanks so much! the zines are amazing <3",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dusty-Ragamuffin",
            "body": "I have several posters I've been working on, if  you don't mind me asking, what's your project?",
            "score": 2,
            "replies": [
                {
                    "author": "jotundaggers",
                    "body": "cough cough *wheatpasting* \\>;)",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Dusty-Ragamuffin",
                            "body": "Yaaaaasss. I've been making stencils but I don't have the physical stamina to actually *make* them. Drawing wise I can make a lot of these as long as I have a quote/sentiment and then an image to pair with it. Friendship will be requested so i can send directly since images are not allowed here. I'd like to make em publicly available but not sure the best way to do that. Submitting them to crimethinc would be cool i think but not sure how to go about that.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "jotundaggers",
                                    "body": "does crimethinc have contact info on their site? maybe an email or a dm to them could do",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Dusty-Ragamuffin",
                                            "body": "hmm they do... i'll see if I can make it happen.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Nastydawgg-god6689",
            "body": "Please be careful. Although I cannot find an entirely credible source on this I’ve heard from multiple sources that colored printers (even home printers) can leave coded metadata (yellow dots left on printed paper that are nearly impossible to see with the naked eye) to help trace printed items back to their source. Again, not positive if this is true but I recommend printing anything in color out at a local library as opposed to doing it directly at home or somewhere that can be traced back to you",
            "score": 2,
            "replies": [
                {
                    "author": "jotundaggers",
                    "body": "holy shit, i factchecked it and it's true; it was originally intended to prevent counterfeiting money but still. thanks 4 the heads up <3",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Nastydawgg-god6689",
                            "body": "No problemo! Stay safe out there man, good luck with your pamphlets and keep fighting for a better future!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "acareeningdirigibug",
            "body": "Hello, i have been sent here for something reminiscent and to do with this. i am not from the states, but i am in North America.\n\nI am in possession of an almost completed book by an anonymous author. They have exhausted themselves writing the first book. a second book will be written where this one ends. It's not a piece of fiction or something, it's practical and very easy and quick to read. It is a graphic piece of literature. \n\nEssentially they need to pass book 1 down to another anonymous author for it to be continued. This anonymous author would highlight themselves as someone else with a differing moniker picking up the torch so to speak. When the next anonymous author exhausts themselves on book 2 they can pass it down to someone else. \n\nThis person lives in solitude, is a hermit. They barely leave their home. Hence why I'm here to pass the book down. \n\nThe next author/illustrator would need to be quite dedicated to protecting the original intentions of the book, it cant be corrupted, but this shouldn't be hard for the anarchist community. \n\nThe part that is being completed right now is essentially the confines for how the proceeding books can be written, essentially some safety's put in place. But the format, everything else is up to the next author.",
            "score": 1,
            "replies": []
        },
        {
            "author": "obiemann",
            "body": "Gasoline, Styrofoam, and PVC glue.",
            "score": 1,
            "replies": []
        },
        {
            "author": "obiemann",
            "body": "Eat your local CEO.",
            "score": 1,
            "replies": []
        }
    ]
}