{
    "title": "Renato Moicano: Democracy is a fallacy, read ‘Democracy: The God That Failed’ by Hans Hermann-Hoppe",
    "author": "AbolishtheDraft",
    "subreddit": "Libertarian",
    "rank": 489,
    "score": 57,
    "upvote_ratio": 0.74,
    "num_comments (reported by reddit)": 20,
    "url": "https://v.redd.it/2673uz7r8che1",
    "id": "1iichah",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Democracy is tyranny of the majority. Read Hoppes [Democracy: The God That Failed](https://www.riosmauricio.com/wp-content/uploads/2013/04/Hoppe_Democracy_The_God_That_Failed.pdf), or other works by libertarians such as [Rothbard](https://mises.org/library/book/anatomy-state), [Spooner](https://oll-resources.s3.us-east-2.amazonaws.com/oll3/store/titles/2194/Spooner_1485_Bk.pdf), or [Hoppe](https://www.youtube.com/watch?v=qrl8YorTa1U) to learn about why so many libertarians [oppose democracy](https://www.youtube.com/watch?v=qrl8YorTa1U). Also check out r/EndDemocracy\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "FrostyArctic47",
            "body": "I don't understand this. So \"libertarians\" think democracy is bad and they want a monarchy or dictatorship or something as such instead? What happened to libertarianism meaning very small government that's not involved in people's lives?",
            "score": 15,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "FrostyArctic47",
                            "body": "No, i didn't",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "thermionicvalve2020",
                    "body": "Anarcho-Capitalism doesn't involve a state.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TheBUNGL3R",
                    "body": "I totally understand where you're coming from. It's not that Libertarians want a monarch or dictator, they just don't want 51% of voters to dictate what happens to the other 49%.They want a whole new structure where nobody has power over another. Imagine if nobody could pass a law restricting what you do as an individual. Libertarians want everyone to do what they want with no restrictions, other than actions that violate the NAP or non aggression principal. Thank you for coming to the subreddit to ask the question, it's an important one to ask, and I'm sorry people are rude here sometimes.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TonySopranbro",
                    "body": "No. Nobody said they want monarchy or dictatorship instead. Where are you getting this? \n\nNot everyone wants a king ruling over them. Is it really that difficult for you to comprehend not living under a king/government of some form?",
                    "score": -2,
                    "replies": [
                        {
                            "author": "Gotta_Gett",
                            "body": ">Hoppe characterizes democracy as \"publicly owned government\", and when he compares it with monarchy—\"privately owned government\"—he concludes that the latter is preferable; however, Hoppe aims to show that both monarchy and democracy are deficient systems compared to his preferred structure for advancing civilization—something he calls the natural order, a system free of both taxation and coercive monopoly in which jurisdictions freely compete for adherents.\n\nBut that is what the book suggests",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "FrostyArctic47",
                            "body": "There are certainly some who want that. Neo reactionaries and the monarchist right. Typically when I hear people say they don't like democracy, they mean they such an even more authoritarian system in place. Thats why I'm asking what people who don't want either want",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -4,
                    "replies": [
                        {
                            "author": "FrostyArctic47",
                            "body": "In the title? So you think democracy is a fallacy but what is it you want instead?",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "CarlsbadWhiskyShop",
                                    "body": "The title of the post",
                                    "score": -2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Swollen-Ostrich",
                    "body": "I haven't read the book and I don't know this guy, but to me it'd mean essentially a wider constitution - like what we can/can't make rules about. Limit the amount of things we can vote to make other people do. For example, I'd think most people would agree it'd be an abuse of power even in democracy to vote what your neighbors can eat for lunch. I feel it'd be good if the things we can vote to force other people into are extremely minimal.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "Anen-o-me",
                    "body": ">I don't understand this. So \"libertarians\" think democracy is bad and they want a monarchy or dictatorship or something as such instead? \n\nYou are leaping to conclusions! We do not want those things at all. We strongly oppose both monarchy and dictatorship. Your confusion comes from not understanding fully our ideology. \n\nWe think people should be deciding for themselves, not being decided for by anyone. That is liberty.\n\nYou are stuck with what you understand, which is various forms of government where someone decides for you.\n\n>What happened to libertarianism meaning very small government that's not involved in people's lives?\n\nHow about no government. Rule of the self by the self, that is libertarian. Form communities of legal agreement. Decentralized governance without monopoly government.\n\nThat rules out monarchy and dictatorship, which are our complete opposites.",
                    "score": -2,
                    "replies": [
                        {
                            "author": "Gotta_Gett",
                            "body": ">Hoppe characterizes democracy as \"publicly owned government\", and when he compares it with monarchy—\"privately owned government\"—he concludes that the latter is preferable; however, Hoppe aims to show that both monarchy and democracy are deficient systems compared to his preferred structure for advancing civilization—something he calls the natural order, a system free of both taxation and coercive monopoly in which jurisdictions freely compete for adherents.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Anen-o-me",
                                    "body": "Yes, Hoppe and I are in the same boat. We both want private covenant communities to be the successors to States.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "andyman171",
            "body": "America can't afford to lose!",
            "score": 5,
            "replies": []
        },
        {
            "author": "RireBaton",
            "body": "Who does he say to fuck after Macron? Oklahomans?",
            "score": 2,
            "replies": [
                {
                    "author": "vegancaptain",
                    "body": "all globalists?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "chechnyah0merdrive",
            "body": "I love this guy [he loves America](https://youtu.be/BnocPkdBwWE)",
            "score": 5,
            "replies": []
        },
        {
            "author": "All_This_Mayhem",
            "body": "...oh shit",
            "score": 1,
            "replies": []
        }
    ]
}