{
    "title": "Most Republicans are not fiscally conservative.",
    "author": "ENVYisEVIL",
    "subreddit": "Libertarian",
    "rank": 302,
    "score": 448,
    "upvote_ratio": 0.83,
    "num_comments (reported by reddit)": 81,
    "url": "https://i.redd.it/uqb37sm2n7je1.jpeg",
    "id": "1ipr49k",
    "selftext": "",
    "comments": [
        {
            "author": "ConfusedScr3aming",
            "body": "Ronald Reagan spent a fortune on our military and research.",
            "score": 83,
            "replies": [
                {
                    "author": "None",
                    "body": "Yeah I always like to remind Republicans that spending INCREASED over the 8 years that fucker was in office.",
                    "score": 44,
                    "replies": [
                        {
                            "author": "theclansman22",
                            "body": "Trump raised spending every year he was in office, republicans haven’t decreased spending since the Eisenhower administration, so people believe they are going to now?",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "Opening-Wasabi-9018",
                                    "body": "Imagine believing in government",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "AlienDelarge",
                            "body": "Do current Republicans still bring him up? I see him brought up all the time but not by Republicans, but I'm not around them as much these days.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Notlinked2me",
                                    "body": "I mean Make America Great Again is his slogan.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "AlienDelarge",
                                            "body": "While the slogan is plagarized, I guess I just don't seem to see Reagan's name brought up.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Notlinked2me",
                                                    "body": "True I mean I agree you don't hear his name but it really seems like project 2025 has a bunch of ties back to him. I do agree though his name has been dropped and replaced with Trump's for the most part.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "AlienDelarge",
                                                            "body": "I may also be missing some of it since I'm not old enough to remember him and live in a very blue area these days so maybe he's brought up more than I realize.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Weary_Anybody3643",
                            "body": "Yeah I don't get the people who try to idealize them he sucked did a bunch of terrible shit with minimal benefit ",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ConsoleDev",
                                    "body": "Its really, really simple. First they decide they're republicans , then they work backwards to justify that. They're in too deep now to think about switching",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "GeorgePapadopoulos",
                    "body": "Do you know who sets the budget for the federal government? It might shock you, but it's not the president. The Democrats controlled the house from 1955 until 1995, and the Senate for 24 out of the 30 years in that period. \n\n\nWhen did the government finances improve for a small period of time? When Gingrich became Speaker of the House with his \"contract with America\". Don't need to cheerlead for the Republicans, but let's not pretend the 2 major parties are the same or equally responsible for the fiscal mess this country is in.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "gewehr44",
                            "body": "Republicans in charge of Congress with a Dem president seems to be the only time growth in govt will be slowed.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "EndDemocracy1",
                    "body": "Yep. You'll find that Republicans who still call themselves \"Reagan Republicans\" are usually the biggest warhawks and simps for Israel and the military industrial complex",
                    "score": 13,
                    "replies": []
                }
            ]
        },
        {
            "author": "jahwls",
            "body": "Considering Trump proposes a $4.5 trillion deficit I think you are barking up the wrong tree.",
            "score": 82,
            "replies": [
                {
                    "author": "EndDemocracy1",
                    "body": "Both parties are owned by the military industrial complex and the Israel lobby",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "tldrthestoryofmylife",
                    "body": "Even if Trump has libertarian ideas (and many of his Cabinet does!), you can't just get rid of the state overnight.\n\nI'll take the firing of thousands, eventually millions of people, and the $2T yearly cost reduction of whatever.\n\nThe idea that this $4.5T number indicates that Trump's actually a showboating hypocrite is just a Woke talking point meant to derail the movement.\n\nIt's literally the first play in the Woke playbook; you get people on the other side to disbelieve their guy telling them that 2+2=4 all while telling those on your own side to \"hold the line\" on some random idiot's proposition that 2+2=5.\n\nYou'll soon realize that you've fallen right into the statists' trap to keep themselves irrelevant. Eventually, they'll have you convinced that the state is needed to censor their own propaganda.",
                    "score": -36,
                    "replies": [
                        {
                            "author": "TheDFactory",
                            "body": "All the while the top companies are getting even more handouts and tax breaks. Meaning even if the state dissolved there wouldn’t be a free market of equal competition. There would be monstrous corporations that already own a shit ton of land, assets, and supplies that would strangle out any newcomers to the market. \n\nTrump’s administration isn’t going to get us closer to any flavor of libertarianism. The “trillions” they’re trying to cut is over a 10 year span as well, coupled with the tax cuts proposed we are still increasing the deficit by effectively the same amount year over year.",
                            "score": 23,
                            "replies": [
                                {
                                    "author": "tldrthestoryofmylife",
                                    "body": "The corps you're talking about have as many liabilities as they do assets, and that goes for the state itself too. In fact, that's part of the problem; there's no actual economic growth, but losses are basically ignored when they get absorbed by a sufficiently large balance sheet.\n\nIf the Wokes stayed in power, it'd have all come crashing down in a Soviet-style collapse, and no private person would've anticipated it b/c it'd have all been kept hush-hush while Pelosi and McConnell were loading the lifeboats with the fine china.\n\nWith Trump, we have an actual chance of economic growth b/c he's deregulating and reducing the enormity of the state.\n\n> Trump's admin isn't gonna get us closer to any flavor of libertarianism\n\nBrother, he's literally firing people, canceling contracts, and dissolving departments. You can be mad that it's not going fast enough, or that it took this long for someone with that agenda to come into office, but you can't say that he's not headed in the right direction.\n\nIf you're a libertarian, I don't think you have any reason to hate Trump. Most people just hate Trump b/c MSM tells them to, but a true libertarian would know that MSM is controlled by the state and thus discount them from their analysis.\n\nYou need to look inside and be honest with yourself. I don't think you hate Trump. I think you're just doing mental gymnastics to find a reason to hate him b/c you don't want the Wokes to catch you liking him.",
                                    "score": -10,
                                    "replies": [
                                        {
                                            "author": "Sea_Journalist_3615",
                                            "body": "Socialist.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Opening-Wasabi-9018",
                                    "body": "Found a lefty",
                                    "score": -5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "threewhitelights",
                            "body": "A yes, basic math, the most of woke of all the high school level courses.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "tldrthestoryofmylife",
                                    "body": "Funnily enough, many HS graduates can't do basic math due to the failure of the Woke school system.",
                                    "score": -11,
                                    "replies": [
                                        {
                                            "author": "threewhitelights",
                                            "body": "Yes, I realized that as I was reading your post. You definitely failed something, probably more than just math.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Dr_Axel_Stoll",
                            "body": "So when the government is saying that 2+2=5, is it woke to point this out?\n\n\\[Because I fail to see why a blood test to detect cerebral aneurysms has been designated woke by the government\\](https://www.usaspending.gov/award/ASST\\_NON\\_2335396\\_4900/)\n\n  \n\\[Or how about this Neo-Marxist NMR spectrometer?\\](https://www.usaspending.gov/award/ASST\\_NON\\_2215258\\_4900/)\n\nFor Mao it was the Rightists, for Trump it's the woke, but this is just another Great Leap Forward.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "tldrthestoryofmylife",
                                    "body": "The things you consider as science aren't actually scientific.\n\nA scientist is as easy to buy as a politician is; easier, in fact, b/c they didn't grow up with money and are therefore cheaper.\n\nDownsize the government and bring back actual science that isn't bought and paid for",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Shiroiken",
            "body": "This is why i like to refer to libertarians as \"socially tolerant, fiscally responsible.\" Conservatives spend money like drunken sailors... they just prioritize different things than liberals.",
            "score": 36,
            "replies": [
                {
                    "author": "harbingerpg",
                    "body": "Republicans spend money like drunken sailors.  To your point, it’s fundamentally not conservative to spend that way.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Opening-Wasabi-9018",
                    "body": "Which not what they're lmao",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "OoklaTheMok1994",
            "body": "But they talk like they are during primary season.",
            "score": 6,
            "replies": []
        },
        {
            "author": "meezethadabber",
            "body": "George Bush came.into office with a budget surplus and said hold my beer.",
            "score": 17,
            "replies": [
                {
                    "author": "gewehr44",
                    "body": "In fairness the tech stock market bubble burst started in March 2000 which then started a short recession. Then there was 9/11 & all bets were off.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Spooky3030",
                    "body": "Yeah,  Democrats took over the Senate after Republicans gave them that \"surplus\",  which was not really a surplus.",
                    "score": -5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Cannoli72",
            "body": "Did everyone forget how much debt Trump put us in, during his last term. He spent more in four years then any other president in history",
            "score": 21,
            "replies": [
                {
                    "author": "ConsoleDev",
                    "body": "That doesn't count, cause he's better than you",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Cannoli72",
                            "body": "The cult of personality is strong with you!",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "ConsoleDev",
                                    "body": "I'm not saying I believe that, I'm saying thats the offical party justification. Conservatives believe in hierarchies:\n\nhttps://www.youtube.com/watch?v=agzNANfNlTs",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ENVYisEVIL",
                    "body": "And then brain-dead Biden [outspent every other president in history](https://www.heritage.org/debt/commentary/the-lefts-7-trillion-lie-biden-far-outpaces-trump-racking-the-national-debt).",
                    "score": -13,
                    "replies": [
                        {
                            "author": "Cannoli72",
                            "body": "Try again! Heritage got it wrong. Trump spent over 8 trillion ",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Spooky3030",
                                    "body": "And Biden added about $8.4 trillion.  He was adding about a trillion every 90 days for the last 2 years.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Agreeable_Cheek_7161",
                                            "body": "Biden had Covid to deal with, though",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Spooky3030",
                                                    "body": "And so did Trump.  Did you forget it started under Trump?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Agreeable_Cheek_7161",
                                                            "body": "Yeah but the PPP loans went out under Biden's budget technically",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Spooky3030",
                                                                    "body": "And?  He has run 1.5 to over 2 trillion deficits every year. Not just the first year in office.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Agreeable_Cheek_7161",
                                                                            "body": "Dude, 80% of our debt has come under Republican presidents",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Spooky3030",
                                                                                    "body": "Dude,  why is it so hard to accept the reality that Biden added the actual debt that he added?  Does your brain just reject reality in this instance or something?",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "Spooky3030",
                                                                                    "body": "Oh and by the way,  Obama gave us 30% of our debt when he was President.  So no,  you are wrong on that as well.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Agreeable_Cheek_7161",
                                                                                            "body": ">Obama gave us 30% of our debt when he was President.  So no,  you are wrong on that as well.\n\nYeah if you ignore that over half of his spending was from Bush pulling us into Afghanistan and Iraq. That's why actual economists don't attribute it to Obama, but Republicans do",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Spooky3030",
                                                                                                    "body": "We get it,  all debt is the responsibility of the Republican party.  No Democrat has ever spent anything more than they have taken in.  How bout you come back to reality at some point?..",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Agreeable_Cheek_7161",
                                                                                                            "body": "Me: acknowledged that Dems added to debt\n\nYou: literally can't acknowledge Republicans add to debt",
                                                                                                            "score": 0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Spooky3030",
                                                                                                                    "body": "You acknowledged dems added debt by saying they needed to do it because of republicans..\nAnd I have never once said republicans added no debt.  \nNice try though..",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Agreeable_Cheek_7161",
                                                                                                                            "body": ">And I have never once said republicans added no debt.  \nNice try though..\n\nYou literally have been trying to blame Democrats when they've objectively contributed less to the debt lol",
                                                                                                                            "score": 0,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "Spooky3030",
                                                                                                                                    "body": "Between Biden and Obama they have contributed $16+ trillion out of the 36 trillion we have.  Trump added $8t,  Bush added $6.5,  Clinton added $1.5,  Bush Sr. $1.5t,  Reagan $1.9t.\nI could go back farther,  but in the last 45 years,  it sure looks to me that Democrats account for literally 1/2 of the deficit.  \nMaybe your reality is different than the one we live in.  But basic math tells us the truth.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "Agreeable_Cheek_7161",
                                                                                                                                            "body": "Dumb dumb, almost 3 trillion of Obama's was Bush military spending and funding the 2008 bailouts that he literally caused. But let's ignore facts because they hurt your feelings :)",
                                                                                                                                            "score": 0,
                                                                                                                                            "replies": []
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "ENVYisEVIL",
                                            "body": "How dare you engage in math.\n\nrAyCiSt!!!\n\n/s",
                                            "score": -4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Opening-Wasabi-9018",
                            "body": "You realize this isn't a Libertarian sub Reddit lol",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Opening-Wasabi-9018",
                    "body": "Found a lefty",
                    "score": -6,
                    "replies": []
                }
            ]
        },
        {
            "author": "CanadaMoose47",
            "body": "\"I left that tea party quicker than a poisoned Russian opposition leader...\nWhen my party took back the white house and I became a cheerleader...\"\n\n\nIf you know, you know",
            "score": 9,
            "replies": []
        },
        {
            "author": "LeavesOfOneTree",
            "body": "Uniparty",
            "score": 6,
            "replies": [
                {
                    "author": "Zaddy_",
                    "body": "\"In the US, there is basically one party - the business party\"",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "legal_opium",
            "body": "Notice how ending the drug war instead being considered by trump and actually he's increasing govt spending on that and almost dis 25 percent tariffs on Canada and Mexico to fund said drug war. \n\nHe called out fentanyl as the reason he was doing the tariffs.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Right_ID",
            "body": "Don't blame Democrats. Don't blame Republicans. Blame voters. They are the ones who vote for this stuff.\n\nIf 90% of voters were Libertarians, none of this would happen.",
            "score": 4,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "True.  The only way that will happen is if voters go through extreme financial hardship.\n\nThe danger is that they could vote libertarian or vote authoritarian.\n\nHence why AnCaps don’t want sheeple to have the ability to vote.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Docile_Doggo",
                    "body": "Voters are essentially robbing from future generations—their own children and grandchildren—to enjoy more stuff now. It’s sick.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Right_ID",
                            "body": "Live today for tomorrow we die.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "zwermp",
            "body": "They all suck.  Clinton ironically was the most fiscally conservative president in recent history.  \n\n\n\nThe last time the national debt decreased was during President Calvin Coolidge's administration (1923-1929). Under Coolidge, the debt was reduced from $22.3 billion to $16.9 billion, a reduction of about $5.4 billion. \n\nSince then, the national debt has increased under every presidential administration, though the rate of increase has varied significantly. The Clinton administration (1993-2001) came close to reducing the total debt by achieving budget surpluses in fiscal years 1998-2001, but while these surpluses slowed the debt's growth, they did not reduce the total outstanding debt.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Predsguy",
            "body": "True, but why are Democrats fighting tooth and nail to stop us from making it right? Seems like a weird hill to die on. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "mmelectronic",
            "body": "Republicans stopped talking about pretending to care about the debt when Bush/Cheney came in and adopted MMT.\n\nBeen downhill ever since, Ironically Slick Willy and Gore had a balanced budget, or were very close.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Siglet84",
            "body": "To be fair, everytime they “tried” to cut spending  the Dems acted like it would be unemployment Armageddon.",
            "score": 0,
            "replies": []
        },
        {
            "author": "CheakyMonkee",
            "body": "Who cares? Truly, who cares?   Get em all!!!   Get your lawyers ready if you scammed the system.   Shit is on!!\n\nNo free passes for thieves!!!",
            "score": 0,
            "replies": []
        },
        {
            "author": "AldruhnHobo",
            "body": "Yes that's true. They're buying hammers for $15k each because momma needs a new cloaking device for the next gen aircraft.",
            "score": 0,
            "replies": [
                {
                    "author": "ConsoleDev",
                    "body": "> hammers for $15k each\n\nThen we should also remove the billions in taxpayer money that gets sent to Elons companies .  And we should do that first. Anything less would be hypocritical",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Puzzleheaded-Task780",
            "body": "Yep. And they are making new departments",
            "score": 0,
            "replies": []
        },
        {
            "author": "Evening_Pizza_9724",
            "body": "Most aren't.  But then again, the republicans apparently are the only one doing anything about it.  The democrats had multiple chances to do something about it and have not.  They failed to act, so now the republicans are.  Good.\n\nI hope they cut 50% of every department that is discretionary or supplemental.",
            "score": -2,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "https://preview.redd.it/cnn8a2r0z8je1.jpeg?width=1200&format=pjpg&auto=webp&s=3244958478f44758eb4289220180a5d8ca867ddb",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Opening-Wasabi-9018",
                            "body": "I'll fix it for you. *libertarian",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}