{
    "title": "No, it’s not in the Constitution.",
    "author": "ENVYisEVIL",
    "subreddit": "Libertarian",
    "rank": 291,
    "score": 268,
    "upvote_ratio": 0.65,
    "num_comments (reported by reddit)": 91,
    "url": "https://i.redd.it/jmv3ijlp8bje1.jpeg",
    "id": "1iq2424",
    "selftext": "",
    "comments": [
        {
            "author": "dystopianr",
            "body": "What is the point of a separate libertarian meme subreddit if you just repost all of them here.",
            "score": 218,
            "replies": [
                {
                    "author": "Shiroiken",
                    "body": "Karma farming. Memes used to be banned here. While I disagreed with the ban on principle (free speech), it did help elevate the overall discourse.",
                    "score": 75,
                    "replies": [
                        {
                            "author": "ENVYisEVIL",
                            "body": "Some people will never understand marketing.",
                            "score": -132,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ENVYisEVIL",
                    "body": "I know this might be difficult for you to understand because you have only posted once ever since joining Reddit.\n\nThis sub has more leftists than libertarians.\n\nThe other sub has more conservatives than libertarians.\n\nBoth subs need more libertarian discussions, posts, and articles.  Mods from multiple subs have asked me to post into their subs.  \n\nThe mission (converting more statists to libertarianism/AnCap) is more important to me than appeasing every single armchair critic that doesn’t add much value to the subs or mission.\n\nArmchair critics don’t help spread the mission.  If my posts offend you then block me…or ask for the manager.",
                    "score": -110,
                    "replies": [
                        {
                            "author": "Kabayev",
                            "body": "Is that the point of this sub? To convince people to be libertarian?\n\nIf so, do you think this method of dunking on people is effective?",
                            "score": 23,
                            "replies": [
                                {
                                    "author": "ENVYisEVIL",
                                    "body": ">”*Is that the point of this sub? To convince people to be libertarian?*”\n\nTo convince people \\[**that are open-minded to be opposing viewpoints**\\] to be libertarian.\n\n>”*If so, do you think this method of dunking on people is effective?*”\n\nWho specifically was dunked on?\n\nDo you mean: is being willing to debate with emotionally-fragile tankies effective?\n\n**Yes.**\n\nhttps://preview.redd.it/ioo3u0v19eje1.jpeg?width=1200&format=pjpg&auto=webp&s=b9df2a1d381045f0c20220060c99ae2a091a8505",
                                    "score": -21,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "RaptorRex787",
                            "body": "Dude this sub is like a maga \"libertarian\" wet dream",
                            "score": 42,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Cubicleism",
            "body": "I mean he isn't cutting waste he is just picking money up and putting it down elsewhere based on the 4 trillion budget increase the Republicans are trying to push through. We tax payers won't see a red cent or a single tax cut from DOGE",
            "score": 189,
            "replies": [
                {
                    "author": "natermer",
                    "body": "Republicans != Elon Musk\n\nOr Trump for that matter. \n\nThe \"debt ceiling' is one of those dumb political footballs that politicians like to trot out because it causes lots of distractions and angst, but has no real effect or meaning. \n\nI would love it if the Republican party actually stood for something meaningful like \"fiscally conservative\".  But it doesn't.  Never was.",
                    "score": 25,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "Competitive_Ad_5134",
                                    "body": "100% agree. When the lying states is when I immediately lose all trust and want you out of office.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "WindBehindTheStars",
                    "body": "*That's* the problem.  I was hoping that Trump had learned his lesson, and that these cuts were evidence that he'd seen that not only did wasteful spending need to be cut, but spending in general. Now the government is going to be like the woman who thinks she can eat an entire cheesecake because she had a Diet Coke with lunch.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Helpful-Formal9214",
                    "body": "Elon and Trump aren't in Congress. Republicans aren't a single monolith. For better or worse conservatives and libertarians are more individualistic. Herding them is like herding cats. The left always falls in line. \n\n\nAlso the debt ceiling isn't the same thing as the actual budget. ",
                    "score": -8,
                    "replies": [
                        {
                            "author": "scooterbeast",
                            "body": "\"The left always falls in line.\" \n\n...\n\nMan, the left fucking WISHES. If that was the case Trump wouldn't be president and we'd have single-payer healthcare. Republicans are known for forming rank and moving in lockstep when it comes to whipping votes and rallying around their candidates, it's why they are so effective at obstructing Dem legislation. The Dems are the ones who eat their own. Hell, leftist infighting is such a trope it's basically a cliche. \n\nI will give you libertarians are also impossible to get to work together, but there are few enough libertarians involved in the Trump Administration that and congress as a whole that I don't think it's a factor: the Republicans own this budget, Trump owns the Republicans, and Elon owns Trump.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "vrschikasanaa",
                                    "body": "Yep. Republicans fall in line no matter what, Democrats have to fall in love no matter what.\n\nDemocrats always have ideological purity tests for candidates that they have to pass to earn their vote, Republicans will vote in whoever has an R by their name without question or scrutiny.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SirBiggusDikkus",
                    "body": "As far as I know, that money isn’t currently being allocated to different new spending so I would call it technically a cut. \n\nOf course, you are right we won’t see a dime. Because we are still in a massive deficit spend. \n\nBut, as I’ve said elsewhere, when have we EVER seen govt actually try and reduce spending?? Maybe the 90’s with Clinton. Like, ffs, take a small win.",
                    "score": -4,
                    "replies": [
                        {
                            "author": "DarthFluttershy_",
                            "body": "Honestly, I'm just happy people are discussing the debt again. It was weirdly absent from the election until super late. It was to the point people were writing reasonable articles about how neither party even pretended to care about the debt anymore.\n\nWe ain't going to solve it with slashes to discretionary spending. This seems more about purging a particular brand of bureaucrat than anything else, tbh.. and though I despise that brand of bureaucrat, I also despise false-premise purges. But keeping debt in the discourse might have knock-on effects that at least slow the downward spiral.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Jsin8601",
                    "body": "Lol you need new sources...or you're a bot.",
                    "score": -7,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheBannedLibertarian",
            "body": "At the risk of being pedantic here but waste doesn’t equal fraud. Fraud is a crime. Every thing DOGE has ‘exposed’ has been public record. Hiding where all this ‘cut’ spending is going is fraud. It damn sure isn’t coming back to me.",
            "score": 72,
            "replies": [
                {
                    "author": "ChampionshipNo5707",
                    "body": "People often use slanderous language when trying to persuade others to agree with them. I’ve learned to be skeptical when I see words like *“scam”* or *“fraud”* because, more often than not, they are used to provoke an emotional reaction rather than present a well-reasoned argument. Taking a step back to analyze the intent behind such language helps in making more informed and independent judgments.",
                    "score": 21,
                    "replies": [
                        {
                            "author": "DarthFluttershy_",
                            "body": "I must admit that I have been curious how so many people continued to exist after I read a headline declaring them DESTROYED (in all caps, to boot).",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "kamadojim",
                    "body": "I agree that not all of it would fall under Fraud, I think there is a fair amount that could be classified as Abuse.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "SirBiggusDikkus",
                    "body": "Ok great, we’ve established it’s not actually fraud. I think most people here can agree. Can we now stay focused on the part where we’re actually seeing government spending get cut!!??\n\nI swear, every post about doge here has an “ackhuallly” top comment and ignores the very real effort (for once!) to do something/anything about massive bloated federal govt.  like, what do y’all want?? Can we not be happy something is happening even if it’s not as big or deep as we’d like???",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Outis7379",
                            "body": "I’ve learned to be skeptical when an unelected technocrat *with government contracts* is in charge of cutting government spending.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ShoulderIllustrious",
                    "body": "When you say public record, do you mean like FOIA request or just publicly published on some gov site?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "ShoulderIllustrious",
                                    "body": "Thanks for the link! I'll take a read. Fwiw I don't buy the bullshit outrage than felon and friends spew. I just wasn't aware it was publicly available already.",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "JackFromTexas74",
            "body": "On the one hand, the left’s pearl clutching is exhausting and silly. \n\nOn the other, I’d prefer someone with a background in forensic accounting be over this process. \n\nThere’s certainly waste, fraud, abuse, and duplicated services in the federal government and we should be tackling all that but I’m not remotely convinced that Musk and the tech bro crew are the best people for the job\n\nTo the contrary, the mass firing of veterans and the nuke debacle show how clumsy and ham-fisted Musk and DOGE are\n\nThis isn’t a job for larpers",
            "score": 92,
            "replies": [
                {
                    "author": "SippinOnHatorade",
                    "body": "Yeah like why is this Elon Musk’s role? Just because he said something that millions of other people have already said? Surely, there’s more qualified people.\n\nEdit: honestly the hypocrisy is that DOGE run by Elon is not efficient government.",
                    "score": 36,
                    "replies": [
                        {
                            "author": "Sir_John_Galt",
                            "body": "Of course you are right.  I mean surely some random government lackey (appointed or elected) is more qualified than a hugely successful businessman/entrepreneur with an almost unprecedented record of running and creating successful companies, right? {sarcasm off/)\n\nHonestly, the amount of hand wringing from alleged libertarians about DOGE cuts is laughable.  Frankly, I don’t give a shit if it is a billionaire businessman making the cuts.   Furthermore, who really cares if it’s a libertarian, democrat, or republican creating and running DOGE as long as some action is FINALLY being taken?  \n\nWill mistakes be made in this effort?  Almost certainly, but spending is a lot easier to add back than it is to cut.\n\nI hope DOGE keeps cutting away……",
                            "score": -10,
                            "replies": [
                                {
                                    "author": "SippinOnHatorade",
                                    "body": "Right, because the Hyperloop is the epitome of success, because the $465 million starter loan from DOE to Tesla doesn’t scream government subsidy and suckling at the golden tit, because SpaceX doesn’t rake in $22 billion from DoD and NASA, he’s so clearly the guy for the job.\n\nYou realize Musk is in actuality a massive fucking statist, right?",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BERLAUR",
                    "body": "Agreed, what we really need is more transparency. The government should be audited on a continuous base by journalists and the people. We've seen some of this in the past (Politico did some good work on this) but it has almost never resulted in cuts.\n\n\nPerhaps a permanent DOGE that would allow us, the people, to vote on what to cut/keep could be an interesting option?",
                    "score": 8,
                    "replies": [
                        {
                            "author": "SnappyDogDays",
                            "body": "That's two wolves and a sheep voting on what's for dinner.   \n\nDo you think journalists have more experience in auditing than the tech bros?",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "globulator",
                    "body": "The value of his ability to deploy capital effectively and efficiently is not really debatable. He is the richest person in the world for a reason.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "natermer",
                    "body": "This is more then anybody has accomplished in the past 200 years of this country in terms of \"rolling things back\" or \"shrinking government\".",
                    "score": -4,
                    "replies": [
                        {
                            "author": "BentGadget",
                            "body": "My car burns so much less fuel ever since I removed the transmission.",
                            "score": 14,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SteemieRayVaughn",
                    "body": "You think Elon is doing all of this himself with no one with history of forensic accounting on his team? Elon gets skilled people around him, kind of why he is who he is.",
                    "score": -15,
                    "replies": []
                }
            ]
        },
        {
            "author": "perfec7paradox",
            "body": "Of course, of course, until they fired majority of the people who overlook our nuclear weapons. \n\nAt what point do Trump dick riders see that they have no idea what the fuck they're doing? When are they gonna get the cum out of their eyes?",
            "score": 30,
            "replies": [
                {
                    "author": "natermer",
                    "body": "You know nothing about the state of USA nuclear weapons and it is obvious.",
                    "score": -6,
                    "replies": [
                        {
                            "author": "CapIcy5838",
                            "body": "Yeaaaah. I was gonna say that, too. Considering my bil was in the military, and that was one his jobs.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Fuck_The_Rocketss",
                    "body": "Keep carrying water for the corrupt federal machine, homie.",
                    "score": -14,
                    "replies": []
                }
            ]
        },
        {
            "author": "ChampionshipNo5707",
            "body": "My sister earned an engineering bachelor's degree through a grant aimed at encouraging women to enter the field. However, she found engineering too challenging and is now pursuing a coding degree instead .  I’m not saying I agree or disagree—just sharing.",
            "score": 3,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "Congrats to your sister.  Engineering is not an easy field of study, and there aren’t a lot of female engineers in the classrooms.\n\nIf the grant was private then it’s fine, but if the grant is public then that’s not fair to the poor and middle class tax payers that were forced to pay for it.\n\nEngineers often make good money; more than the average American.  \n\nShe could have and should have gotten a loan or worked her way through school.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Thencewasit",
            "body": "How do they know they are women?",
            "score": 22,
            "replies": [
                {
                    "author": "Hot_Egg5840",
                    "body": "Because everyone is.",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "Hack874",
                    "body": "Because Tesla man bad",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "cyrusthemarginal",
                    "body": "How does anyone?",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "ENVYisEVIL",
                    "body": "![gif](giphy|SACoDGYTvVNhZYNb5a)",
                    "score": -12,
                    "replies": []
                }
            ]
        },
        {
            "author": "golsol",
            "body": "The federal government shouldn't be awarding those grants in the first place. This is emotional manipulation at its finest.",
            "score": 4,
            "replies": []
        },
        {
            "author": "No_Gray_Area",
            "body": "If fraud has actually happened, and they have evidence that would hold up in court, why haven't they made any arrests or recommended any prosecution or handed down any indictments?",
            "score": 2,
            "replies": []
        },
        {
            "author": "illuminary",
            "body": "ie \"fraud\" & \"waste\".",
            "score": 2,
            "replies": []
        },
        {
            "author": "Poeafoe",
            "body": "Is this guy the only one who posts on this sub now?",
            "score": 2,
            "replies": []
        },
        {
            "author": "defkatatak",
            "body": "This is bullshit. He is cutting most government contracts. I work for a private research firm headed by a white man and we have had a lot of our contracts cut. They have nothing to do with DEI or waste.",
            "score": 8,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": ">”*He is cutting most government contracts.*”\n\nhttps://i.redd.it/2wwftswvubje1.gif",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Interesting_stuff2",
                    "body": "Tell me you don’t know about government contracts with telling me. You obviously have absolutely no idea how many contracts the government has.",
                    "score": -5,
                    "replies": []
                }
            ]
        },
        {
            "author": "amp0880",
            "body": "Everything is racist and misogynistic 🎶🎵",
            "score": 8,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "Everything I don’t like is racist and misogynistic 🎶🎵",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Muandi",
            "body": "Good. I can't think of a single good reason why a grant should be granted to any group based on its race or gender.",
            "score": 3,
            "replies": []
        },
        {
            "author": "fherrl",
            "body": "They always have to make it about race",
            "score": 2,
            "replies": []
        },
        {
            "author": "Unlucky-Pomegranate3",
            "body": "Peak Karen comment.",
            "score": 0,
            "replies": []
        },
        {
            "author": "natermer",
            "body": "Affirmative Action is one of the worst things to happen to Black people in this country.\n\nDEI is far, far far worse.  It destroys minorities chances and amplifies race tensions for the sake of forcing mid-level Marxist bureaucrats into every nook and cranny in our society.  Loved by grifters and parasites.  Hated by all normal people.",
            "score": 4,
            "replies": [
                {
                    "author": "Somhairle77",
                    "body": "[Thomas Sowell warning about DEI.](https://youtu.be/8UZjC1vQDIc?si=SWyV4SSvY31qu_dP)",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "winkman",
            "body": "Ah, pulling out the old classics, I see.\n\n\nIt is just so blatantly obvious that no one finds these wastes of $$ defensinble, otherwise, instead of just speaking in generalities, they would be shouting about \"we CAN'T withhold the $142M for training Guatemalan trans children to bake rice cakes for all the bill-less toucans or they'll all DIE!\"",
            "score": 1,
            "replies": [
                {
                    "author": "GunTotingQuaker",
                    "body": "I was sort of under the impression that a lot of this stuff earmarked for “training carrier pigeons to distinguish authentic vs generic Doritos” was really just slush fund shit not actually going to that, but likely going to some coup or whatever in god knows where.\n\nThe lack of oversight just leads me to believe the money was spent on things we may never know.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "lambo630",
                            "body": "Or just straight money laundering and it funnels back into lobbyist and politician bank accounts. Like in what world do we need to fund studies on ice cream cone structural integrity or bubble wrap therapy?",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Hoppy_Hessian",
                            "body": "I wonder if it's a thing like when you used to write checks to friends and would write something dirty in the memo.  You write a check to your buddy for $40 because he bought all the booze for guys weekend and you write dildos in the check memo.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "Interesting_stuff2",
                            "body": "Even if some of the money gets to the title of the program, there are MANY people passing that money down to the project while keeping a “cut” for themselves.  Hell, that charity manager probably deserves the 30% he’s “earning.”",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "RobertEHotep",
            "body": "Yes he is and I hope he eliminates all the grants awarded to white people too.",
            "score": 1,
            "replies": [
                {
                    "author": "rn15",
                    "body": "You realize they aren’t saving any money right? They plan on spending even more than the democrats, the money is just being moved. Are you supportive of how they are cutting VA employees? Veterans will now have less resources thanks to Elon’s dumb ass. Probationary employees in the VA are automatically being fired, probation period is 1-2 years. There are veterans that have been working for over a year in the system who now don’t have income or health insurance",
                    "score": -2,
                    "replies": [
                        {
                            "author": "RobertEHotep",
                            "body": "If the money cut from USAID and other wasteful govt programs is spent by the Republicans on MIC shit (a bigger military, more wars, whatever), I will be against that too. Just b/c I'm in favor of Musk & Co. cutting government programs doesn't mean I'm a \"fan\" of the Republicans. If you're saying Republicans waste money on nonsense too, I agree. I hate them both. \n\nWhenever the govt cuts any spending, we get sob stories about how this or that poor federal employees are going to suffer. For all I know the VA is just as bloated as any other govt agency.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Interesting_stuff2",
                            "body": "As a veteran who uses the VA, there is plenty of fat to be cut. Don’t get me wrong, there are some great people at the VA, but they are mired in the mud by the “entitled employees” who could care less about us and want the paycheck for as little effort as possible. The establishment has been “reforming” the VA for a long time, and in the 20+ years I’ve dealt with it, not much has changed.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Wirbelfeld",
                                    "body": "They’re balanced out by the overworked doctors and nurses at the VA.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Interesting_stuff2",
                                            "body": "Very much true!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "igortsen",
            "body": "Karen must be a TERF... won't someone think of the transgenders!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "WestFun1693",
            "body": "Lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "saigashooter",
            "body": "Someone needs to inform them that everyone is capable of fraud regardless of your gender or skin color. \n\nThese people will do and say anything to preserve the leviathan they created.",
            "score": -1,
            "replies": []
        },
        {
            "author": "Fuck_The_Rocketss",
            "body": "In b4 the lefties arrive and say “uH aKsHuALLy dOGe iS baD bEcAuSe it dOEsNt foLlOw tHe RuLe oF LaW” \n\nSome motherfucker in here the other day was complaining that social programs might be defunded. Like if you’re gonna pretend to be libertarian, learn the first thing about it.\n\nEdit: hey, there they are.",
            "score": -7,
            "replies": []
        },
        {
            "author": "Toaster_Toastman",
            "body": "Can't wait for the brigading to begin on this one",
            "score": -5,
            "replies": []
        },
        {
            "author": "JScrib325",
            "body": "I really want to know who these people are that are Shocked Pikachu.jpeg that the government spends money on bullshit?",
            "score": 0,
            "replies": []
        }
    ]
}