{
    "title": "There was once a time when the poor & middle class did not get destroyed by inflation.  Bring honest money back!",
    "author": "ENVYisEVIL",
    "subreddit": "Libertarian",
    "rank": 271,
    "score": 616,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 56,
    "url": "https://i.redd.it/fzz7aojmthje1.jpeg",
    "id": "1iqw3lj",
    "selftext": "",
    "comments": [
        {
            "author": "samson_strength",
            "body": "Wait… people still think Knox houses all that gold?\n\nThat shit was “moved” long time ago and the vault mainly houses documents, memorabilia and old ass Guide-Ons.",
            "score": 139,
            "replies": []
        },
        {
            "author": "RobertEHotep",
            "body": "Musk is naive if he thinks Fort Knox is audited every year. The govt believes in auditing you, not itself.",
            "score": 91,
            "replies": [
                {
                    "author": "Ok_Sea_6214",
                    "body": "Pretty sure he's trolling.\n\n\nAnd no way they will him inspect that, or the whole financial ponzi scheme implodes. Maybe that's what Musk is trying to achieve.",
                    "score": 32,
                    "replies": [
                        {
                            "author": "ENVYisEVIL",
                            "body": "Musk is trolling.  It’s a conversation that needs to be had.",
                            "score": -20,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AM-64",
                    "body": "Even when they do audit themselves they can be off trillions and have zero consequences for it.\n\n\nJust look at the Pentagon audits and how badly they fail each time (and it's been happening for decades)",
                    "score": 3,
                    "replies": [
                        {
                            "author": "RobertEHotep",
                            "body": "100% correct. The federal govt can act however it likes and even if a certain number of us get mad and vote hard, it makes no difference. The uniparty continues its reign.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ENVYisEVIL",
                    "body": "Back when I was a communist, I thought that Fort Knox still had gold. They don’t teach us that in high school or college economics 101.\n\nMost Americans still think that we are in a gold standard.\n\nhttps://preview.redd.it/ek1b07lfajje1.jpeg?width=512&format=pjpg&auto=webp&s=991821af8bbafa919d6b7e70825b95959b59b541\n\nWhy else would they keep voting for free shit?",
                    "score": -42,
                    "replies": [
                        {
                            "author": "robtimist",
                            "body": ">Most americans still think that we are in a gold standard\n\nReally? I feel like most people know we’re not",
                            "score": 51,
                            "replies": []
                        },
                        {
                            "author": "thegame2386",
                            "body": "Most people don't even know what the word \"fiat\" means, nor do they understand how money works, nor why a gold or precious metals/resources standard is superior. \n\nThe closest I've ever heard to a breakthrough with this concept in ELI5 terms was when somebody posted the history of using Caps in the Fallout series. Long and short, a single bottle cap was a stand-in/promissory for a bottle of clean, non irradiated water. The cap has no value but was backed by the idea that it would always be worth whatever the value a bottle of water has. In the discussion I head people asking why we didn't have this with gold or oil....at which point everything broke down cause \"oil le bad\", \"gold is for rich, eat the rich\" blah blah blah.",
                            "score": 13,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "narwi",
            "body": "people who think inflation, sometimes quite high inflation did not exist in times of physical precious metal times are so weird and ahistorical.",
            "score": 58,
            "replies": [
                {
                    "author": "Asangkt358",
                    "body": "Not all price increases are due to inflation.",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "FAK3-News",
                    "body": "The corporate greed of big blacksmith.",
                    "score": 14,
                    "replies": []
                }
            ]
        },
        {
            "author": "bob_law_blaw",
            "body": "I just went down a rabbit hole since there is very little official notice of audits. Only secondhand accounts. Apparently, most of the gold reserve was inspected, audited, and sealed sometime in the mid-1980s. They just inspect the seals, and if they are still \"officially sealed,\" the audit seems to consist of checking a box that all the gold is still there. YIKES.",
            "score": 10,
            "replies": []
        },
        {
            "author": "Jack21113",
            "body": "People who want to bring back the gold standard have never taken an introductory economics class.    Japan is still trying to recover since when they tried to revert",
            "score": 13,
            "replies": [
                {
                    "author": "3_Thumbs_Up",
                    "body": "Most of the western world experienced deflation throughout most of the industrial revolution.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AmericanaCrux",
            "body": "Ah yes, zerohedge. Bastion of truth. Clean record there…",
            "score": 33,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "It’s among the best libertarian and investment news sites out there.\n\nNo surprise that offended tankies go into full-blown ostrich mode when presented with any news source that was willing to expose the Hunter Biden Laptop Story.\n\nhttps://preview.redd.it/0maagdeyajje1.jpeg?width=1200&format=pjpg&auto=webp&s=57e61f5505641fb251a53027c6a5c79ea02e2c30",
                    "score": -33,
                    "replies": [
                        {
                            "author": "AmericanaCrux",
                            "body": "Enjoy your moment. But, we see you. Real Libertarians will be patient and not take the bait. Stand firm and stand together. Principled and reasoned. Good luck with your crusade, we shall see how it all plays out. \n\nAnd oh by the way, go touch grass.",
                            "score": 34,
                            "replies": []
                        },
                        {
                            "author": "Own_Palpitation_8477",
                            "body": "I prefer to get my libertarian news directly from Charles Koch.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "AmericanaCrux",
                                    "body": "Hey I tell ya what, you can get a good look at a butcher’s ass by sticking your head up there, but wouldn’t you rather take his word for it? \n\n…no, it’s gotta be your bull…",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "DexterMorganA47",
                                            "body": "Did you eat a lot of paint chips when you were a kid?",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "Own_Palpitation_8477",
                                            "body": "lol, it does seem like most libertarians have their heads stuck up Charles Koch's ass.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "jmark71",
            "body": "Ah, yes, bring the gold standard back 🙄 Never understand why that stupid idea refuses to die.",
            "score": 20,
            "replies": [
                {
                    "author": "Squatch_Zaddy",
                    "body": "I’m not super versed on the subject, so forgive me if I’m wrong, but didn’t the Great Depression happen on the gold standard? And wasn’t that largely due to inflation?",
                    "score": 13,
                    "replies": [
                        {
                            "author": "natermer",
                            "body": "The Federal Reserve system was created in 1913.  The major stock market crash that signaled the beginning of \"the great depression\" was in 1929. \n\nIn 1933 private citizens owning gold was effectively made illegal.  It was up to 10 years in prison unless you surrendered your gold to the Federal Reserve in exchange for paper money. \n\nAs noted other places they immediately began inflating money. \n\nAs a result of \"The New Deal\" corporatist plan and money inflation \"the great depression\" lasted until after WW2 when a lot of the government policies were rolled back. \n\nIt is also worth noting that USA \"General Corporations\" (ie: general business corporations) did not, in fact, exist until after 1899.  This was when Delaware passed their Delaware General Corporation Law.  Prior to that business corporations had a limited life span, had a specific purpose, and required legislation to be passed.  After 1900 business corporations have infinite life span, have no specific purpose other then to make money for investors, and only required filling out the right paper work and constructing the right corporate governance. \n\nSo it wasn't long before publicly traded corporations, widespread use of the stock market, and Federal Reserve and such things actually started existed as a common thing before the whole nonsense collapsed. \n\nWe are talking about 13-29 years here. \n\nEver since then it required continuous legal updates and policy changes and interventions on behalf of the banking cartels (aka Federal Reserve) and Federal regulators to keep the whole thing afloat. \n\nWhich means that when you get beyond small and medium businesses and start getting into higher finance, big national corporations, and such things...  There is very little actual free market involved.  It took massive efforts in government to create and maintain all of this.\n\nBailing the current system out was what happened with in 1933 when they made owning gold illegal.  It is what happened in 2008 with the massive bailouts to the banks for causing the housing crisis.  It happened again in 2020 when they 'printed' trillions of dollars to bail out the stock market and keep prices high. \n\nand if you ever hear somebody say that \"The USA has never defaulted on its debt\"...  They are full of shit.  There has been 3 or 4 times the Federal government defaulted on Debt.  \n\nOne of the major examples of USA defaulting on its debt A; was when Nixon formally abandoned the gold standard in 1971. \n\n\nAll of this shit ties together... The great depression, the rise of the administrative state, the creation of corporatist economic and legal systems, the abandoning of the gold standard.\n\nThis is also why the idea that we need to have the Federal government or big government to counter act the greed and short citedness of big corporations is pure nonsense. \n\nCentral Banking and big Centralized governments don't counter act the greed of these big corporations.  They don't exist to protect the people from greedy billionaires.  They protect the greedy billionaires from the people. Big government exists to help facilitate the creation of big business corporations. \n\n And the curse of modern times isn't corporate influence over government... It is the government working with these corporations to have influence over markets and undermine individual liberty.",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "jmark71",
                            "body": "Yes - regardless of what ENVYisEVIL states.  The gold standard greatly restricted what could have been done with monetary policy to reduce inflation and the effects of the Great Depression.  If we’d have been on the gold standard in 2008 we’d probably still be in a second Great Depression.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "ENVYisEVIL",
                            "body": "No, that’s what Keynesian economist wants you to believe.\n\nI highly recommend reading [Murray Rothbard’s America’s Great Depression](https://mises.org/library/book/americas-great-depression).\n\nFDR’s executive order 6102 made it illegal for Americans to old gold.\n\nhttps://preview.redd.it/pfq71uzlcjje1.jpeg?width=1200&format=pjpg&auto=webp&s=17c09aa347b2893b2ee95c2f30af02859229dd4c\n\nThat socialist president confiscated gold from the American public at $20 an ounce and repriced immediately afterwards at $35 an ounce.\n\nIt wasn’t until 1971 that it finally became legal for Americans to own gold again.\n\nThe massive expansion of government before, during, and after The Great Depression is what exacerbated it.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "EndlessExploration",
                    "body": "The idea that money should have an objective value. How radical.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "AmericanaCrux",
                            "body": "It never had an objective value. How rad is that? Always has been an intersubjective construct, always will be. Always has been intertwined with power and legality, always will be. Gold standard became slow and antiquated, and pinning the value was far messier than seemingly anyone wants to recall, and so the system adapted. \n\nShock Values by Carola Binder is a good read.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "EndlessExploration",
                                    "body": "In a free banking system, the value is the gold. Scotland maintained such a system and saw only one bank failure.\n\nProblems arise when we give the government any power over money.",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "AmericanaCrux",
                                            "body": "Yeah, Scottish free banking gold standard economics, very interesting. Value of gold was completely objective and not tied to power, legality, or intersubjective constructs whatsoever. Got it. Perfect system.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "EndlessExploration",
                                                    "body": "Your argument is that everything has a \"subjective\" value. That's true, but also pointless.\n\nHistorically, when a gold standard was held, markets saw little inflation. When rulers debased their currency, inflation skyrocketed. \n\nYou can argue philosophy all you want. I want to eliminate inflation and stop having my wealth stolen.",
                                                    "score": -1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "jmark71",
                            "body": "It limits what can be done with monetary policy to help with economic instability and recessions, not to mention the inherent general volatility in growth and inflation it causes.  The Great Depression was worse because of the gold standard so yeah, let’s go back to that 🙄",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "Mdj864",
                                    "body": "“Limiting what can be done with monetary policy” is the entire point. Especially when that policy is printing trillions out of thin air to water down the value of our wages. The federal government should not have the power to manipulate the value of debts, exchanges, and contracts between private citizens with the flip of a switch.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "jmark71",
                                            "body": "Monetary policy that stops us from more unemployment, more inflation, more recessions, so yeah, give me more of that over a stupid ‘standard’ that causes all those things to be much worse than they should be.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "Mdj864",
                                                    "body": "We’ve had 14 recessions since the Great Depression… the money printing is leading to the devaluation of our wages and purchasing power, and the increase of the wealth gap. So it’s not exactly doing great for us.\n\nDo you have any substantive reasoning/explanation behind your opinion other than that a standard is “stupid” and causes things to be “so much worse than they should be”?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "AmericanaCrux",
                                                            "body": "Pointing to recessions is a moot point here. Because that argument allows the point that monetary policy can help stabilize from these swings exacerbating. Also, you can easily view recessions as healthy market corrections. Especially if you’re a free market purist. \n\nDevaluation of wages by money printing sure. But that leaves out any burden on the private side to increase wages proportionately. If using inflation metrics as an economic temperature gauge, it can easily be determined that there is ample room for wage growth. But there is a lot of economics there to delve into. \n\nSo, yeah, I’m not seeing much substantive material on your end of the argument either.",
                                                            "score": 4,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "jmark71",
                                                            "body": "I thought I was pretty clear.  But let’s try it in ELI5 terms:\n\nImagine you have a toy box, and you can only trade toys for other toys. Let’s say that your toys are made of gold. You have a rule that to buy anything—like candy or toys—you need to give someone a certain amount of gold.\n\nNow, the problem is, what if there isn’t enough gold? If people want to trade lots of toys but there’s not enough gold to go around, it makes everything harder. Or, what if there’s too much gold, and then everything starts getting too expensive?\n\nEconomists think this rule is “stupid” because it’s like having a toy box that limits how much you can trade, even when the world is always changing. With money today, we don’t have to rely on gold. It’s more flexible, so if there’s a problem, we can fix it faster, like adding more money or adjusting things when needed. It’s easier and lets people trade more freely!",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "zwermp",
                                                                    "body": "Is adding more money really fixing it?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "AmericanaCrux",
                                                                            "body": "Fixing what?",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "EndlessExploration",
                                    "body": "Well, yes. The gold standard says you can't steal people's wealth to pay for government spending. That is limiting.\n\nI'd recommend you read \"The Mystery of Banking\" by Murray Rothbard. There was no free banking before the Great Depression. Instead, there was(and is) a single, central bank that pyramided money on top of the gold. When you print more money than the gold you have, economic bubbles are inevitable.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Zonz4332",
                            "body": "lol do you know what money is",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AldruhnHobo",
            "body": "I don't think it's there anymore.",
            "score": 5,
            "replies": []
        },
        {
            "author": "NoTwoPencil",
            "body": "Your periodic reminder that no one who is serious about studying money thinks the gold standard is a good idea.\nhttps://www.kentclarkcenter.org/surveys/gold-standard/\n Stop expecting your currency to appreciate in value. Do something productive with it. \n\nIt's not necessary to tie the value of your currency to a commodity, and if you think doing so will magically make the government  fiscally responsible then I have a bridge to sell you.",
            "score": 8,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "No, that’s what Keynesian economist wants you to believe.\n\nI highly recommend reading [Murray Rothbard’s America’s Great Depression](https://mises.org/library/book/americas-great-depression).\n\nFDR’s executive order 6102 made it illegal for Americans to own gold.\n\nhttps://preview.redd.it/0vjf779zvjje1.jpeg?width=1200&format=pjpg&auto=webp&s=ca51d51553dab3dd57dec42a2eae5595296bbdd1\n\nThat socialist president confiscated gold from the American public at $20 an ounce and repriced immediately afterwards at $35 an ounce.\n\nIt wasn’t until 1971 that it finally became legal for Americans to own gold again.\n\nThe massive expansion of government before, during, and after The Great Depression is what exacerbated it.",
                    "score": -5,
                    "replies": [
                        {
                            "author": "NoTwoPencil",
                            "body": "I assure you the economists in this poll i linked are familiar with Murray Rothbard, Austrian economics, and all manner of other outdated modes of thought that are out there that keep gold bugs alive and kicking",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ok_Sea_6214",
            "body": "You mean by price gouging.",
            "score": 1,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "Tell us you don’t understand **basic economics** without actually saying it.",
                    "score": -5,
                    "replies": [
                        {
                            "author": "AmericanaCrux",
                            "body": "“I highly recommend reading Murray Rothbard’s…”\n\nTell us you don’t understand basic economics without actually saying it. \n\nYou’re looking at economics like a Newtonian thinker in a post-modern era. For better or worse your framework needs to change. Rothbard wasn’t even a respected economist in his own circle. \n\nMy guy… come on.",
                            "score": 9,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Siglet84",
            "body": "To be fair, the amount of gold in there is essentially worthless to the government.",
            "score": 1,
            "replies": []
        },
        {
            "author": "11Tail",
            "body": "Picturing Donald Rumsfeld's press release of being unable to account for millions of dollars in the US Defense budget and 9/11 happening the day after.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Anen-o-me",
            "body": "Lol, Musk is that naive huh 😂\n\nWow, this is gonna be good! I can't wait to see him show up at motherfucking Ft. Knox and find out they're missing 90% of the gold on their books. \n\nWe already know the British government had gold on the books that it sold claiming it was being loaned out.\n\nThe standard gold scam is that you only need enough gold to show all at one time to your biggest depositor. Let's that I that would be Saudi Arabia.\n\nIf they come and demand to see their gold, here it all is.\n\nIf any other depositor wants to see THEIR gold, you just wheel in some of the Saudi gold. All this is done by appointment after all. \n\nThe rest gets sold off to line your pockets or whatever and no one's the wiser.\n\nGold deposits will always face this trust problem, this is why a gold backed currency isn't good. The gold has to be held by someone. They have to be trusted not only to defend it but not do the above scam and not sell it. \n\nIf their country is invaded by another, your gold backed currency could be suddenly worthless. This can never happen to cryptocurrency.\n\nYou have to have it audited regularly, but then you have to trust the auditor.\n\nSo you can audit the auditor. But then you have to trust him. Etc., etc. Arthur Andersen.",
            "score": 0,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "Excellent points.  I do think that Musk knows the gold isn’t there and wants to expose that.  \n\nThe **libertarian** in me would counter that multiple different private auditing companies could audit the gold reserves.  \n\nThe gold could also be stored in multiple locations.  For example, Switzerland, etc.\n\nThe **anarcho-capitalist** in me doesn’t want government to hold any gold for the reasons you mentioned.\n\nWhile crypto could be a better solution, my concern with that is the rapid development of quantum computers and A.I.\n\nA hostile actor or government would need is to crack the source code, obtain a 51% majority of the cryptocurrency, and rewrite then code/rules.\n\nA few years ago the probability of that happening was extremely low, but it seems like the odds of cracking crypto’s algorithms have increased since then; albeit maybe still years or decades away.\n\nThe ideal solution would be to allow people to use whatever currencies they desire, and not be forced to use a single, manipulated currency.\n\nQuestion: I believe you have a crypto or computer science background, correct?  \n\nWhat are your thoughts on the risk of cracking the source code/algorithms?",
                    "score": -2,
                    "replies": []
                }
            ]
        }
    ]
}