{
    "title": "Abolish the ATF",
    "author": "ENVYisEVIL",
    "subreddit": "Libertarian",
    "rank": 198,
    "score": 264,
    "upvote_ratio": 0.89,
    "num_comments (reported by reddit)": 15,
    "url": "https://i.redd.it/f8nifwlgqeke1.jpeg",
    "id": "1iugr3x",
    "selftext": "",
    "comments": [
        {
            "author": "Chase0288",
            "body": "Don’t abolish the ATF yet. We need to repeal the NFA first. Otherwise you’ll have other organizations trying to fill the gap where the ATF was. \n\nThe enemy you know.",
            "score": 35,
            "replies": [
                {
                    "author": "Wrong_Nose6285",
                    "body": "Nah, abolish. The enemy we know is always working in the direction we're against.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Chase0288",
                            "body": "No ATF means it’s the DOJ enforcing gun laws and they are MUCH better funded.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "Wrong_Nose6285",
                                    "body": "Very likely. And well have to fight them too. Let's be real.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "GuyBannister1",
            "body": "There will just be another cockroach taking her place",
            "score": 7,
            "replies": []
        },
        {
            "author": "MengerianMango",
            "body": "They've been working hard to push out Form 4s FAST for awhile. I feel like they must've seen the writing was on the wall a long time ago, well before the election. Basically all the good suppressors have been on backorder or just plain out of stock for at least a year atp.\n\nNot to defend her. Clearly at best it was just an attempt to ride the tide and stay in power. The service under early Biden admin was deplorable.",
            "score": 7,
            "replies": [
                {
                    "author": "Wtfjushappen",
                    "body": ">They've been working hard to push out Form 4s FAST for awhile\n\nMaybe that's true, but Sept 9th i submitted, got approved just a couple weeks ago. As a clearance holder, 100% law abiding drug free stable person without any social media presence(no x, Facebook, insta,etc),I don't think 120+days is fast, but especially since I'm already a federally cleared individual.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "MengerianMango",
                            "body": "https://www.silencershop.com/atf-wait-times\n\nDid you do eform?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Wtfjushappen",
                                    "body": "Ya, they did the whole thing. Maybe just a one off, maybe because it was my first run through on that form, who knows. But I hated checking my e mail daily just for that, I left work the day i got it.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Jombes_Industries",
            "body": "Remember, y'all, nothing on God's green Earth smells worse than dirty used ATF.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Gobiego",
            "body": "Don't let the door hit your ass on the way out Pam.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gwhh",
            "body": "Why do women liberal bureaucrats all like alike!",
            "score": -8,
            "replies": []
        }
    ]
}