{
    "title": "End the Fed",
    "author": "EndDemocracy1",
    "subreddit": "Libertarian",
    "rank": 169,
    "score": 236,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 4,
    "url": "https://i.redd.it/6cwh3a1uvqke1.jpeg",
    "id": "1ivrbv7",
    "selftext": "",
    "comments": [
        {
            "author": "natermer",
            "body": "Just so you understand how this works. \n\nThe Dollar, a fiat currency, value is determined by the ability of the USA Treasury Department to pay its debts. The US Treasury department operates off of your taxes. \n\nThis credit is then used by the banks that own shares in the Federal reserve to \"print money\" and then lend you this money with interest. \n\nSo you pay taxes so that banks can create money out of thin air and then change you interest for it. It is free for them. For you you have to pay interest.\n\nThat is it. That is how this system currently works in the most simplistic, but meaningful way possible.",
            "score": 14,
            "replies": [
                {
                    "author": "whirlyhurlyburly",
                    "body": "Now consider using any other government currency to make a transaction. Now consider the dollar is currently the global reserve currency.  Then think about the roller coaster of bitcoin and gold.\n\nLastly, consider what power you lose when you no longer are living in the place that is the arbiter of  the global reserve currency.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Pay-Attention007",
                    "body": "You’re misunderstanding how modern monetary policy works and why the Federal Reserve exists in the first place. The idea that banks \"create money out of thin air\" and \"charge you interest for it\" without any economic function ignores the entire reason we have a central banking system.\n\nLet’s break this down properly:\n\n\n---\n\n🏛 I. The Purpose of the Federal Reserve: Stability, Growth, and Liquidity\n\n1. The Fed Prevents Economic Collapse\n\n✔ Before the Fed existed (pre-1913), financial panics and bank runs happened regularly.\n✔ If the Fed didn’t exist, there would be no lender of last resort, meaning any financial crisis could collapse the economy completely.\n✔ The Fed stabilizes banks and ensures liquidity, which prevents catastrophic failures like the Great Depression from happening again.\n\n🚨 You think the system is bad now? Try going back to the 19th century when economic collapses happened every decade (the instability of capitalism that led to the Devil of Communism!!).\n\n2. The Fed Manages Inflation & Interest Rates to Keep the Economy Growing\n\n✔ The money supply must grow with the economy—a static currency leads to deflation and economic contraction.\n✔ The Fed adjusts interest rates to prevent overheating (high inflation) or stagnation (recessions).\n✔ Without these adjustments, economic cycles would be far more extreme and destructive.\n\n🚨 Would you rather have controlled inflation or wild boom-bust cycles that destroy entire industries overnight?\n\n\n---\n\n💰 II. \"Printing Money\" Isn’t a free Handout—It’s a Necessary Economic Tool\n\n📜 1. Banks Don’t Just Print Money for Themselves—They Expand the Economy\n✔ The money banks lend out goes into businesses, homeownership, and investments.\n✔ The economy functions on credit expansion, which enables job creation, infrastructure, and wealth generation.\n✔ Without new money being created, economic growth would be permanently constrained.\n\n📜 2. The \"Money Out of Thin Air\" Myth\n✔ Money creation is backed by real economic activity—loans, investments, and productivity.\n✔ If banks didn’t lend money, most people wouldn’t own homes, start businesses, or invest in education.\n✔ The idea that money should be tied to a finite resource (gold) ignores how economies actually function.\n\n🚨 Economic expansion requires an expanding money supply. A fixed supply would strangle growth.\n\n\n---\n\n⚖️ III. Taxes & Interest: Why They’re Not What You Think\n\n📜 1. Taxes Aren’t \"Funding the Fed\"—They Manage Government Spending\n✔ The Fed operates independently of Congress—it doesn’t use tax revenue to function.\n✔ Taxes fund government programs, infrastructure, and services—not \"printing money.\"\n\n📜 2. Interest Exists Because Money Has Value Over Time\n✔ Borrowing money means you are using resources that could be deployed elsewhere.\n✔ Interest rates are how banks manage risk and ensure capital is used efficiently.\n✔ Without interest, nobody would lend money, and economic growth would grind to a halt.\n\n🚨 Banks aren’t “scamming” you by charging interest—they’re keeping the financial system functional.\n\n\n---\n\n🔥 IV. The Final Thought: Ending the Fed Would Be a Disaster\n\n🏆 A world without the Federal Reserve would be far more volatile, unstable, and prone to financial collapses.\n🏆 The Fed doesn’t “steal” from you—it ensures liquidity, regulates inflation, and supports economic growth.\n🏆 Money creation isn’t a conspiracy—it’s a necessary function of a growing economy.\n\n🚨 Want to see real economic chaos? Try abolishing the Federal Reserve and see what happens. 🚨",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "findabetterusername",
            "body": "10%* if banks couldn't lend out money than the economy would stagnate for decades with no real way to loan large amounts of money to anyone. The fdic already insures all your money",
            "score": 1,
            "replies": []
        }
    ]
}