{
    "title": "How would libertarians handle business permits and other stages of setting up business?",
    "author": "Bubbly-Ad-1427",
    "subreddit": "Libertarian",
    "rank": 172,
    "score": 6,
    "upvote_ratio": 0.8,
    "num_comments (reported by reddit)": 19,
    "url": "https://www.reddit.com/r/Libertarian/comments/1iwbnq6/how_would_libertarians_handle_business_permits/",
    "id": "1iwbnq6",
    "selftext": "I’ve heard from libertarians how things like high healthcare prices are the result of the many obstacles from the government which are mandatory to stay into business in the healthcare industry, but I’ve also heard libertarians make the point there are necessary stages made by the government. That begs the question, which ones should be kept, and which ones should not?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "**New to libertarianism or have questions and want to learn more?** Be sure to check out [the sub Frequently Asked Questions](/r/Libertarian/wiki/faq) and [the massive /r/libertarian information WIKI](/r/Libertarian/wiki/index) from the sidebar, for lots of info and free resources, links, books, videos, and answers to common questions and topics. Want to know if you are a Libertarian?  [Take the worlds shortest political quiz and find out!](http://www.theadvocates.org/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "AlphaTangoFoxtrt",
            "body": "Why do you need permission to open a business?\n\n\n* I have apples\n* I want to sell them\n* You want to buy them\n* We agree on a price\n* We exchange currency for apples\n\nThat's as hard as it need be.",
            "score": 50,
            "replies": [
                {
                    "author": "davester88",
                    "body": "Or I have a certain skill and you have a certain skill. We trade skills. Bartering is awesome.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "AlphaTangoFoxtrt",
                            "body": "That's still voluntary exchange, which is the foundation of capitalism. Social requires force",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Bubbly-Ad-1427",
                    "body": "I’ve seen the point of food safety made before, that’s about it. I see your point, though.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Tomunista",
                            "body": "If his apples give you the shits let me know. I'll spend my apple money elsewhere.",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "LossPreventionGuy",
                                    "body": "note: what he means is that he'll sacrifice you to protect himself. You go get the shits (or ya know, die) and then he won't go there. Thank you for your service!",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "Bubbly-Ad-1427",
                                    "body": "do I have apple insurance?",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "bassjam1",
                            "body": "If food safety is a concern people will stop supporting certain companies and they will change their practices or go out of business.  Or, consumers will demand 3rd party auditing as a seal of approval and they'd take the place of the FDA.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "browni3141",
                                    "body": "In addition to reputational damage, businesses poisoning people can still simply be held liable. Deregulation doesn’t mean there’s no redress for grievances caused by harmful business practices.",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "TManaF2",
                                    "body": "Like the gluten-free, certified organic, and free trade certifications?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Tough_Exercise_5242",
                            "body": "So if an apple vendor has an \"A+\" from the local food inspector but the YELP review is filled with people that said they got sick from the apples, are you eating there?",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Practical_Advice2376",
            "body": "Permits = the government selling your rights back to you.",
            "score": 11,
            "replies": []
        },
        {
            "author": "Silence_1999",
            "body": "It’s a tough balancing act.  Most of the structures we now rage against were created to combat bad actors taking advantage of the people.  It never ends though and the inefficiency becomes as bad or worse than what it was originally created to protect against.",
            "score": 9,
            "replies": [
                {
                    "author": "mikeo2ii",
                    "body": "as they say, \"the road to hell...\"",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "MEGA-WARLORD-BULL",
            "body": "Prospera, the biggest Libertarian island experiment, is likely how things would happen.\n\n\n\n\nThe problem with regulations isn't that they exist - most businesses already use internal regulatory schemes for themselves. It's that they're created by bureaucrats with little connection to the actual industry.\n\n\n\n\nProspera requires that certain industries like agriculture have a regulatory system, but are flexible in allowing companies to choose which schemes they have. I don't have all the details but results seem positive.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Leading_Air_3498",
            "body": "Why do you need a permit to do stuff? Nobody should be able to stop you from doing anything that doesn't initiate a violation of another's will.\n\nIf I am trying to sell something from my own property, everyone else can just choose to buy it or not. I shouldn't need a permit.\n\nThe only time when anyone else even needs to step in is if I'm engaging in fraud. Hell, I can sell poisoned food so long as I clearly outline to my consumer base that it's poisoned, because then I'm not engaging in fraud and if you don't want to buy poisoned food you have the choice.\n\nWe already do this mind you. You can sell cigarettes and alcohol even though both of those things are literal poison and even come with labels telling you they are.\n\nIt's not up to someone else to tell me what I can sell, or you what you can put in your body.\n\nThe only proper rights are negative rights. This basically means that everyone can do whatever they want so long as they're not engaging in things like murder, rape, fraud, theft, arson, enslavement, assault, etc.\n\nIn fact, you could even do that stuff (you can even today in any settlement on earth), but it's incumbent on good people to punish and detur it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "konsyr",
            "body": "There are no businesses, only people.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gazzettinoeconomico",
            "body": "I think the “permits” stuff comes from the assumption that business are bad and will poison you if not controlled by the government who gives them a seal of approval.\nThe truth is that most of them, in my opinion, are bullshit.\nThey restrain the offer and allows those who do have the permit to set higher prices (that’s microeconomics 101).",
            "score": 1,
            "replies": []
        }
    ]
}