{
    "title": "Is libertarian the same as social Darwinism?",
    "author": "ImaginationOk6193",
    "subreddit": "Libertarian",
    "rank": 127,
    "score": 0,
    "upvote_ratio": 0.41,
    "num_comments (reported by reddit)": 36,
    "url": "https://www.reddit.com/r/Libertarian/comments/1iysg52/is_libertarian_the_same_as_social_darwinism/",
    "id": "1iysg52",
    "selftext": "Since libertarians are against tax and government, are we following social Darwinism? In other words, do you think that the weak, unfit, poor, stupid humans should be eliminated by the society as the consequence of natural selection. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "**New to libertarianism or have questions and want to learn more?** Be sure to check out [the sub Frequently Asked Questions](/r/Libertarian/wiki/faq) and [the massive /r/libertarian information WIKI](/r/Libertarian/wiki/index) from the sidebar, for lots of info and free resources, links, books, videos, and answers to common questions and topics. Want to know if you are a Libertarian?  [Take the worlds shortest political quiz and find out!](http://www.theadvocates.org/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "onlyexcellentchoices",
            "body": "No. \n\nBecause libertarians believe in criminal punishments for force and fraud. If someone is harming someone, especially a child or disabled person, libertarians believe in firm criminal punishments. \n\nSocial Darwinism presumably is ok with this \"taking advantage\" of the vulnerable.",
            "score": 18,
            "replies": []
        },
        {
            "author": "djentropyhardcore",
            "body": "No.\n\nWelfare for the needy is best done at the private sector, like it was done in the 150 years before the progressive movement and later FDR's communism.  \n\nPeople have a vested interest in educating and caring for their community.  Churches, social activism groups, and private benefactors have always filled this gap before government started doing it and shut them all down through monopolization.",
            "score": 27,
            "replies": [
                {
                    "author": "No_Temperature_8662",
                    "body": "This. Also it is more moral and efficient to simply have people donate directly to causes they believe in. Much better than having government take money at gun point and then trusting those same corrupt officials to give that money to their own favored causes.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Exciting_Vast7739",
                    "body": "\\*150,000 years before the progressive movement. \n\nBut yes to everything else.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "hoops-mcloops",
                            "body": "There's always been public welfare. Even the Roman Empire had the grain dole, and here in the US our state government used to pay churches for the social programs they offered.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Exciting_Vast7739",
                                    "body": "I would love to hear more about US government paying churches for social programs - do you have any links on that?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "onlyexcellentchoices",
                                            "body": "Forbes ran an article on Feb 3rd which said Catholic Relief Services was the top USAID recipient.\n\nAs a Catholic libertarian, I oppose the tax dollars being fed into Catholic charities. But it seems like that's what's been going on.",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "hoops-mcloops",
                                            "body": "Sure!\n\n[Trinity College](https://www.google.com/url?sa=t&source=web&rct=j&opi=89978449&url=https://www3.trincoll.edu/csrpl/Charitable%2520Choice%2520book/Hall.pdf&ved=2ahUKEwjd6rm97uGLAxXshYkEHUEeL2cQFnoECGsQAQ&usg=AOvVaw1PhorlxsvegIFgGDYt-HZ-)\n\n[Harvard Square Library](https://www.harvardsquarelibrary.org/featured-new/notes-on-the-history-of-congregational-fundraising-unitarian-universalist-and-unitarian-universalist/)\n\n[Pew Research](https://www.pewresearch.org/religion/2009/05/14/shifting-boundaries2/#:~:text=Before%20the%20American%20Revolution%2C%20most,extended%20to%20other%20religious%20groups.)\n\n[Penn State Law](https://www.google.com/url?sa=t&source=web&rct=j&opi=89978449&url=https://elibrary.law.psu.edu/cgi/viewcontent.cgi%3Farticle%3D1403%26context%3Dfac_works&ved=2ahUKEwi22ejL8eGLAxUnvokEHVNnELkQFnoECDQQAQ&usg=AOvVaw0CpXlSwSDwPuMXKRR_rcju)",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "Exciting_Vast7739",
                                                    "body": "Thanks!\n\nI'm skimming through the first one right now - it's fascinating!\n\n\"Proponents also argued that private institutions, especially those for dependent and delinquent children, have a better effect upon the inmates than can public institutions. For one thing, dogmatic religious instruction can be given. For another, the spirit of self-sacrifice that pervades a private institution has a good effect upon the inmates, and is contrasted with the cold and officialized administration of the public institutions. Connected with this, as also with the matter of economy, is the fact that boards of trustees and of lady managers and visitors give freely of their time and energy and sympathy in aid of private undertakings (343).\" \n\nIn every instance, volunteer community organizations pre-dated public bureaucratic institutions, and were providing services before requesting public funding. They also served as the basis of the social fabric of communities, religious and nonreligious (Rotarians, Meese, American Legion, etc) and contributed to building thickly networked communities that had intimate knowledge of their own communities unique capacities and needs. \n\nI see how the pre-existing voluntary social organizations were asking for funds from their local jurisdictions as early at the 1890's - but those institutions pre-dated the local jurisdictions and pre-dated the notion that providing for the general welfare was the job of the state. \n\nPeople have always been meeting their community needs through their social network and community organizations. A state or federal bureaucracy providing for general welfare is a relatively new thing.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "djentropyhardcore",
                            "body": "I was referring to this country only but you are correct.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "claybine",
                    "body": "\"FDR's communism\"\n\nWHAT",
                    "score": 1,
                    "replies": [
                        {
                            "author": "No_Temperature_8662",
                            "body": "He called it socialism, or social welfare but really he was trying to get out in front of communism to keep it from getting roots here. Also he was trying to distance himself from the public perception of a 'do nothing Hoover'.\n\n[Here is an example.](https://en.m.wikipedia.org/wiki/Civilian_Conservation_Corps)\n\nMany of the 'Alphabet Soup' agencies got their start under FDR. The New Deal gave mixed results overall and many contend that it was wartime manufacturing for WWII that really pulled us out of the Great Depression.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "claybine",
                                    "body": "FDR was authoritarian, probably one of our worst presidents when it comes to market intervention, but I wouldn't call him a socialist. \n\n>Many of the 'Alphabet Soup' agencies got their start under FDR. The New Deal gave mixed results overall and many contend that it was wartime manufacturing for WWII that really pulled us out of the Great Depression.\n\nThis I do agree with. Naysayers will of course say otherwise, but there are historians who claim that he prolonged the Great Depression by 7 years with the New Deal. What pulled us out of the depression were those programs dwindling. Hoover started the Great Depression but FDR historically made it worse.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "No_Temperature_8662",
                                            "body": "Agreed on the authoritarian part as well. He was often called out as trying to be the Emperor of America (a title we all know belongs to Emperor Norton, silly aside). \n\nBut no, you are absolutely correct, calling him a central planning, command economy authoritarian is right on the money. His New Deal did make things worse, keeping the market from correcting for almost a decade and, much worse, adding socialism to the landscape of the US economy in a way we are still contending with today.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "EntropyFrame",
            "body": "I believe there are layers to Welfare. And it follows starting from the individual, outwards in physical real distance.\n\nThe first layer is yourself. You save, you spend savvy, you invest, you are your best ally, and the main safety net.\n\nThe second layer is your family: They look like you, live with you, maybe even raised you. They're your blood. They are the closest to natural community.\n\nThe third layer is your neighbors: Your immediate community, the people you see when you walk your dog outside. \n\nThe fourth layer is your city/state - and your charitable allies. \n\nAnd the fifth and last layer is your nation - and your cultural allies.\n\nFrom here out, you should not expect any help.\n\nThis goes to say, one should attempt to minimize the welfare going outwards as much as possible. And if it does, I don't believe it should not exist. \n\nThe fundamental issue here is that, the more collective and outwards the welfare comes from, the more it has to be done via coercion, and we're here in the business of minimizing coercion yes? - can it be reduced entirely? Probably not. But it is a principle that we always strive to make it as little as possible.",
            "score": 6,
            "replies": []
        },
        {
            "author": "s-ro_mojosa",
            "body": "No.\n\nLibertarianism is about voluntary exchange. Voluntary exchange is considered more efficient and more moral than coerced exchange.\n\nThus, it's perfectly Libertarian to set up a benevolent society and help the poor with food or scholarships or whatnot. The people who give donations do so voluntarily, because they see X charity as good for society. A private benevolent society sets its own rules and is subject to market forces. It has to be efficient with its limited funds (donations) and be seen as worth donating to by the community in order to continue to exist.\n\nGovernment programs don't work like that: they can be inefficient and even counter productive. All they have to do is follow the check-list they're given — whether it works or not. They get tax dollars whether or not they're effective and can be difficult to dismantle once they're created, because of political optics that may not match reality.",
            "score": 7,
            "replies": [
                {
                    "author": "PaschalRascal",
                    "body": "^ THIS!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SucculentJuJu",
            "body": "No",
            "score": 2,
            "replies": []
        },
        {
            "author": "Zeroging",
            "body": "No, I think welfare should be done by a federation of voluntary associations. Politicians are nothing but a middle man in the whole welfare system that could be done better without them.",
            "score": 2,
            "replies": []
        },
        {
            "author": "eico3",
            "body": "Before the government monopolized welfare and social safety nets your family and friends took care of you in your old age. \n\nBeing against government charity is not the same as being anti-charity or pro-letting people die alone in the cold. That’s a false choice",
            "score": 2,
            "replies": []
        },
        {
            "author": "GGM8EZ",
            "body": "all darwinists are libertarian but not all libertarians are darwinists. any \"darwinist\" or \"meritorious\" person who's not libertarian is just lying.\n\nme myself i am a darwinist. if you can't make it you don't deserve to. I'm not going to agress apon you to prove that but I will not help you unless I have a personal interest or relationship with you.\n\nOthers want to help the needy and can do so of their own voluntary free will. but i will not",
            "score": 1,
            "replies": []
        },
        {
            "author": "pristine_planet",
            "body": "Natural selection will always prevail, but that’s something libertarians neither want nor decide though, and questioning it may not even make sense.\n\nWelfare for example, may be perceived as intervention, but it ultimately is natural selection as well, as long as it is not mandatory.",
            "score": 1,
            "replies": []
        },
        {
            "author": "zugi",
            "body": "Libertarianism can be good for the weak, unfit, poor and stupid.\n\nWhen anyone is free to start and run a business free from government interference, more of the weak, unfit, poor, and stupid will start businesses and achieve financial success. (Even if it's as a \"YouTube influencer.\")\n\nWhen the weak, unfit, poor, and stupid are free to work for market wages, they can start on the ladder to independence and success. Whereas current government policies keep them off that ladder altogether, instead making them into wards of the state, sure to vote for more big government policies because their existence depends on it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Anen-o-me",
            "body": "Nope",
            "score": 1,
            "replies": []
        },
        {
            "author": "adriens",
            "body": "No, social Darwinism is more the current state of affairs, where people with enough money and power are able to coerce those with less. Under libertarianism, every individual, no matter how small, has the same power and rights. Under 'mob rule' where 'might makes right', there is a Darwinian component that they can oppress the minority for their own personal gain. This becomes impossible in a moral society.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Silent-Set5614",
            "body": "No, far from it. \n\nThe market economy is predicated upon people making mutually beneficial exchanges. It is, in the words of Mises, peaceful social cooperation. The only \"Darwinism\" is the competition between firms, which does eliminate the 'unfit companies', i.e. firms that charge too much or provide too low quality of a product.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kedulus",
            "body": "Should be eliminated? No. Should be left to die if they can't sustain themselves and can't get others to willingly help them? Yes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sbrisbestpart41",
            "body": "I think that there is a problem with the term social darwinism.\n\nAll libertarians are in favor of natural hierarchies.",
            "score": 0,
            "replies": [
                {
                    "author": "Exciting_Vast7739",
                    "body": "We're in favor of hierarchies?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "SCB024",
                            "body": "Yes. It is called reality.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "NeoMoose",
                    "body": "In fairness, every single political / social philosophy will result in hierarchies.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "NeoMoose",
            "body": "No. They should simply be free to be weak, unfit, poor, and stupid.",
            "score": -1,
            "replies": []
        }
    ]
}