{
    "title": "Where should I start my Journey?",
    "author": "Randomsquid32",
    "subreddit": "Libertarian",
    "rank": 91,
    "score": 3,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 15,
    "url": "https://www.reddit.com/r/Libertarian/comments/1izwh0m/where_should_i_start_my_journey/",
    "id": "1izwh0m",
    "selftext": "I know this is a short post but , am wanting to start a career and a path in politics. But before I can jump into anything I want to ask for assistance in acquiring the correct knowledge for being able to form proper educated opinions. What books should I read , who should I listen to , what should I study , where do I start? I genuinely wish to seek change and educate myself. Any help or direction on what to read and where to start would be extremely helpful.\n\n",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "**New to libertarianism or have questions and want to learn more?** Be sure to check out [the sub Frequently Asked Questions](/r/Libertarian/wiki/faq) and [the massive /r/libertarian information WIKI](/r/Libertarian/wiki/index) from the sidebar, for lots of info and free resources, links, books, videos, and answers to common questions and topics. Want to know if you are a Libertarian?  [Take the worlds shortest political quiz and find out!](http://www.theadvocates.org/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "sbrisbestpart41",
            "body": "Read: Ludwig Von Mises, Murray Rothbard, F.A Hayek, Hans-Hermann Hoppe, Henry Hazlitt, and Lew Rockwell to start. \n\nFrom most “libertarian” to least it’d be Hayek, Mises, Rockwell, Rothbard, Hoppe. Hazlitt is more economics based and doesn’t exactly fit on here.\n\nIf you look for these authors you’ll find good books. I personally really like Hoppe and I think his speech called “Getting Libertarianism Right” is the best in-depth explanation of libertarianism and its logical conclusions. But if you want to get a good background I recommend a formal framework with Mises, Hayek, and Rothbard.\n\nWARNING: A great deal of libertarian history reading is opposite of the common narrative pushed. While some people will call it “revisionism” it is highly academic and more than that it is just a part of libertarian academia to challenge some (not all) narratives.",
            "score": 4,
            "replies": [
                {
                    "author": "Randomsquid32",
                    "body": "Thank you",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Imaginary-Win9217",
                            "body": "I also suggest The Evolution Of Cooperation. An excellent example of why decentralized systems account for selfishness.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "fuckthestatemate",
            "body": "Check out the Mises Institute",
            "score": 3,
            "replies": [
                {
                    "author": "sbrisbestpart41",
                    "body": "I didnt know if that was a bad idea to recommend because of all the posts which could be offputting for newer libertarians.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Randomsquid32",
                            "body": "I’ll take anything and everything , the more knowledge the better.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "sbrisbestpart41",
                                    "body": "Yeah, just stay away from the Wanjiru Njoya articles for now. Shes a good author, but writes a lot about the confederacy and you need to understand libertarianism a bit more before understanding her points.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ok-Affect-3852",
            "body": "Ludwig Von Mises “Human Action”, Ron Paul “Liberty Defined”, Milton Friedman “Free to Choose”",
            "score": 3,
            "replies": [
                {
                    "author": "sbrisbestpart41",
                    "body": "Human Action is like 1000 pages in its most recent edition. And it gets really philosophical. Mentiswave teaches praxeology way quicker.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Free_Mixture_682",
            "body": "Are you sure you want to go into politics? That is a slimy business. Almost nobody planning to clean it up comes out of it having cleaned anything or not getting themselves dirty in the attempt.\n\nNot to mention, a libertarian will end up just banging their head against a wall, repeatedly, trying to win office and if they do, they will be up against two parties which will align to destroy libertarians because libertarians are the enemy of the unlimited state which both D and R support, just in different ways.",
            "score": 2,
            "replies": [
                {
                    "author": "Randomsquid32",
                    "body": "I’d rather Educate myself to the festering cancer that is our modernized system and learn what I can do to fight against it rather than back away and leave it for another generation. Nothing changes if no one acts.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Free_Mixture_682",
                            "body": "I get that. I think everyone who enters politics believed as you. I have no idea what happens to them though. \n\nBut there are many people who can explain the problems without having to get in the swamp to learn.\n\nAnd there are many ways change can happen without having to get elected.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "hotdog_terminator",
            "body": "I respect your effort, we need people like this. My one recommendation is Basic Economics by Thomas Sowell, not really a cut and dry libertarian book, but it’s a good read about how economics works, which is important in politics. It’s actually quite entertaining for a book about economics as well",
            "score": 2,
            "replies": []
        },
        {
            "author": "PhilTMerkin",
            "body": "Personally, I was required to buy “The Irony of Democracy” back in college. It shaped the way I think about politics in this country, not in fine detail, but rather the how I look at it in the big picture. The tl:dr of it is that our elected officials are far more polar that the populace and you don’t vote for what you want, rather you vote against what you fear.",
            "score": 1,
            "replies": []
        }
    ]
}