{
    "title": "When Republicans & Democrats increase the national debt, it destroys the purchasing power of the U.S. dollar over time.",
    "author": "ENVYisEVIL",
    "subreddit": "Libertarian",
    "rank": 64,
    "score": 773,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 51,
    "url": "https://i.redd.it/03ww5st7jwle1.jpeg",
    "id": "1j0auf9",
    "selftext": "",
    "comments": [
        {
            "author": "DixieNormas011",
            "body": "It's insane.  Imagine how easy life would be if you could just run everything on credit cards.  Max one out, open the next, rinse and repeat knowing you'll be dead long before you have to deal with the debt.",
            "score": 128,
            "replies": [
                {
                    "author": "Alarmed_Guarantee140",
                    "body": "You actually can do that. You keep rolling credit cards during the grace period to avoid having to pay the debt. It's a massive pain, but it works.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "Werdna629",
                            "body": "Eventually you will not get approved for more credit cards",
                            "score": 26,
                            "replies": [
                                {
                                    "author": "dochoiday",
                                    "body": "Plenty of credit cards offer a year or 15 months of 0% apr. as long as you are paying your balance on other cards you won’t ding your score. (Except for maybe high utilization, but that’s temporary) you then transfer that debt to a new card at the end of the year. There’s several credit cards that offer 0% apr for 1 year plus. You could theoretically do this for the rest of your lift it’s just a dangerous game. The realistic limited factor are these credit cards tend to have $1000-5000 limits.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Werdna629",
                                            "body": "That’s the thing - if you’re just moving from credit card to credit card, the high utilization is not temporary. Eventually your utilization will run too high and lower your score, and that will impact your ability to get approved for a new card.\n\nAlso like you said, the issue would be the credit limit on the individual card. It’s not that they limit you to $1k-$5k, you can definitely get cards with higher limits. But they’re not going to keep giving you higher and higher limits to support your carried debt unless you’re significantly increasing your income, and even then there are limits.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "dochoiday",
                                                    "body": "Not necessarily on the utilization. Typically these 0% Apr cards have no annual fee. So there’s no sense in canceling them once you transfer your balance. So if I’m juggling 5000 and I have 4 cards with a 5000 limit once I open a 5th card my utilization goes from 25% to 20%\n\nCredit card companies don’t look at your available credit when they approve you. They might take into account your debt but so long as you aren’t increasing this you could easily play this game. \n\nAlso in the eyes of these companies you are clearing your balance when you transfer it to another card. And a credit score simply measures your ability to pay back debt. Not how good you are with money.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Werdna629",
                                                            "body": "Not sure which you meant, so I’m going to go over each scenario:\n\n\n**1. You’re juggling the $5000 now and don’t plan to increase that:** In this scenario, you’ve already hit your limit - you can’t spend anymore, and the game is over. If you’re saying you can keep juggling the $5000 for the rest of your life sure, but that doesn’t really match the original point of continuing to spend and never paying the debt.\n\n**2. You’re juggling the $5000 and plan to increase the amount of debt you’re carrying:** Your spending will probably outpace the increases in credit limits you can get, and there are a few other credit scoring factors to consider if you’re constantly getting new cards, like number of inquiries, number of new accounts, average age of accounts, etc. And again lenders _do_ (although I’m sure it varies) look at your other debt when underwriting your CC application, so eventually you’ll hit a stopping point.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Alarmed_Guarantee140",
                                                                    "body": "I just wanna say I appreciate this in depth analysis by you two. I didn’t know any of that.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "-Dakia",
                    "body": "Add to that, spending the past twenty years or so berating everyone else for their credit card usage, then doing this.  It seems that nobody actually stands for anything anymore other than what they are told.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "OniTYME",
            "body": "Massie is literally the \"Gigachad standing in a church\" meme IRL.",
            "score": 16,
            "replies": []
        },
        {
            "author": "Tukarrs",
            "body": "Why are they increasing/extending tax cuts for the rich when they could be paying down the debt? \n\nI thought that was the entire point of DOGE?",
            "score": 15,
            "replies": [
                {
                    "author": "SaltyyDoggg",
                    "body": "Seriously why even fuck around with DOGE if you’re doing this?! I give up.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "jahwls",
            "body": "Republicans always increase the debt. Yet for some reason people think republicans are better at  lean government.",
            "score": 131,
            "replies": [
                {
                    "author": "Zorrgo",
                    "body": "Democrats always increase the debt. Yet for some reason people think democrats are better at (lean) government.",
                    "score": -44,
                    "replies": [
                        {
                            "author": "AmateurOntologist",
                            "body": "Except Clinton. He was the only president to preside over a surplus in the last 50 years. Before that it was LBJ in 1968, also a Democrat.",
                            "score": 51,
                            "replies": [
                                {
                                    "author": "Loose_Entertainment9",
                                    "body": "To be fair. The only reason why we has a surplus those year was because there was so much activity in the market and tax revenue increased exponentially as a result. Then the bubble popped and we went back to normal deficit.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "LogicalConstant",
                                            "body": "They were also divided so they couldn't agree on how to spend extra money. If democrats had controlled both the house and senate too, I'm sure they would have found a way.",
                                            "score": -5,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "DixieNormas011",
                                    "body": "The \"Dot com\" bubble massively inflated what Clinton had to work with though.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "assword_is_taco",
                                    "body": "Clinton increased the debt. They borrowed against Social Security and Medicare every 8 years of his presidency. They didn't need to increase the debt ceiling because the debt was IOUs between government entities.",
                                    "score": -3,
                                    "replies": []
                                },
                                {
                                    "author": "rvaen",
                                    "body": "Congress, who sets the budget, was controlled by Republicans for that budget surplus, if I am not mistaken.",
                                    "score": -7,
                                    "replies": [
                                        {
                                            "author": "AmateurOntologist",
                                            "body": "Maybe a Democratic president with a Republican congress is the best the US can do for fiscal responsibility. That wasn't the case during the surpluses in the 1960s though. In the Obama era, there was a significant drop in deficit with a Republican house but Democratic senate, but it never got to a surplus.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "HotFoxedbuns",
                                    "body": "Partially thanks to what Reagan already set in motion",
                                    "score": -2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "LogicalConstant",
                            "body": "Both always increase the debt. Welcome to america.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "AmateurOntologist",
                                    "body": "Sure you did. Deficits go down all the time. They did from 2009-2016, they also did in 2021 and 2022. But the only time the *debt* has gone down was during Clinton when he ran a surplus, and before that LBJ in 1968.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "jahwls",
                            "body": "Better at lean government means leaner. That was the point of the comment. I assume the point you are trying to make is that both parties have been increasing deficits. This is true. Though one party is better. \n\n[https://www.investopedia.com/democrats-vs-republicans-who-had-more-national-debt-8738104](https://www.investopedia.com/democrats-vs-republicans-who-had-more-national-debt-8738104)\n\n[https://medium.com/towards-data-science/which-party-adds-more-to-deficits-a6422c6b00d7](https://medium.com/towards-data-science/which-party-adds-more-to-deficits-a6422c6b00d7)",
                            "score": -8,
                            "replies": [
                                {
                                    "author": "DixieNormas011",
                                    "body": "2 probably crazy biased websites is not how you prove anything.  Would bet there's at least two sites that 100% contradict whatever these two are saying.\n\nShow some   . gov citations, and make sure you include who had control of the house and senate during those years",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "jahwls",
                                            "body": "[https://fiscaldata.treasury.gov/americas-finance-guide/national-deficit/#us-deficit-by-year](https://fiscaldata.treasury.gov/americas-finance-guide/national-deficit/#us-deficit-by-year)\n\ninvestopedia, biased? LMAO \"ThE mAiNsTreAm mEdIA\"",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "BCK973",
                                            "body": "Those goalposts... they were just here.\n\n![gif](giphy|3o7aTskHEUdgCQAXde|downsized)",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "DixieNormas011",
                                                    "body": "Ah yes, I forgot this was reddit, asking for unbiased political citations isnt welcome around here",
                                                    "score": -1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Short-Exercise-8374",
            "body": "And you know they’re spending to the limit and then asking for more.  \n\nSo they don’t really lover freedom and aren’t fiscal conservative, what exactly is the Republican Party?!",
            "score": 9,
            "replies": [
                {
                    "author": "Jolly_Job_9852",
                    "body": "Democrat Lite",
                    "score": -2,
                    "replies": [
                        {
                            "author": "Short-Exercise-8374",
                            "body": "Lite in what, these guys must went extra heavy on whatever it is",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Jolly_Job_9852",
                                    "body": "Well to an extent the GOP \"protects\" my 2a rights.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Fair_Performance_251",
            "body": "Do you have a job do you get ad revenue from here? wtf do you do that you’re on here 24/7?",
            "score": 9,
            "replies": []
        },
        {
            "author": "Mead_and_You",
            "body": "Funny how the dems are all of the sudden against raising the debt ceiling, and the republicans (except Massie) are suddenly in favor of it....\n\nYou'd almost think these people have no morals or principles or something.",
            "score": 51,
            "replies": [
                {
                    "author": "FredthedwarfDorfman",
                    "body": "The democrats knew it would be passed so they could vote \"no\" and save face. How many of them voted to suspend the ceiling in 2023?  All of them are so corrupt it's insane.",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "stf210",
                    "body": "The bureaucracy is expanding to meet the needs of the expanding bureaucracy.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "Agile_Programmer881",
                    "body": "maybe the 4 1/2 TRILLION gift to the people taxing our nation’s infrastructure the most ?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Pay-Attention007",
            "body": "Crazy how you forgot to mention how 100% of Democrats voted against it",
            "score": 6,
            "replies": [
                {
                    "author": "ENVYisEVIL",
                    "body": "Because Orange Man bad, not because of the same reasons as Thomas Massie.\n\nThat’s the difference between having principles and understanding economics versus being a useful idiot for Big Government.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SaltyyDoggg",
                            "body": "How are you getting downvoted for this",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ENVYisEVIL",
                                    "body": "https://preview.redd.it/x9xmzlrwoeme1.jpeg?width=1200&format=pjpg&auto=webp&s=1783b911f0b52bf620a99551565d5dc99030b592",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Free_Mixture_682",
            "body": "The legislation portrayed does not “increase the debt”. It increases the meaningless limit on debt that is ALWAYS raised when the limit is reached.\n\nAll it does is create drama as the limit is approached but it never results in debt reduction.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Razrwyre",
            "body": "I don't believe that the democrats should be hailed as \"courageous\" here... Massie voted no cuz he understood the bill, however the Dems voted no simply to say they voted against the GOP... there's a difference here...\n\nedit sp...",
            "score": 9,
            "replies": []
        },
        {
            "author": "Alarmed_Guarantee140",
            "body": "Yeah okay, but the Democrats didn't vote no because they're fiscally conservative, it's because they aren't going to vote yes on a Trump budget.",
            "score": 5,
            "replies": []
        },
        {
            "author": "bt4bm01",
            "body": "They republicans are just a sugar free version of the democrat party. Still really bad for you in large doses.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Black777Legit",
            "body": "Does it really matter at this point? It'll get bigger and bigger anyway. It's a lost cause.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jonatkinsps",
            "body": "Give that man a raise",
            "score": 1,
            "replies": []
        },
        {
            "author": "Enough_Wallaby7064",
            "body": "Sure. But if we go bankrupt right now then the US collapses.  We are going to have to fix the entitlement programs if we want to seriously remove the deficit",
            "score": 0,
            "replies": []
        }
    ]
}