{
    "title": "What exactly is an “illegal” protest?",
    "author": "stevovon",
    "subreddit": "Libertarian",
    "rank": 7,
    "score": 1526,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 471,
    "url": "https://i.redd.it/7fffhkto8pme1.jpeg",
    "id": "1j3ensc",
    "selftext": "",
    "comments": [
        {
            "author": "oenomausprime",
            "body": "The amount of so called libertarians agreeing with this is shocking smh",
            "score": 631,
            "replies": [
                {
                    "author": "Bird_law_esq",
                    "body": "Half of the people in here are meme libertarians... They saw a meme that said taxation is theft and now they're experts.",
                    "score": 64,
                    "replies": [
                        {
                            "author": "WinkDoubleguns",
                            "body": "100%",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Malohdek",
                    "body": "I called this out on the ancap sub reddit. I said that I worry about MAGA co-opting the Libertarian movement will have us painted as \"fascists\". They just said that \"they already think we're fascists.\"\n\nThat just shows me that most \"libertarians\" will succumb to team sports if it means one or two of their ideas come to fruition, even if it's for the benefit of an oligarch.",
                    "score": 166,
                    "replies": [
                        {
                            "author": "CognitiveWhatever",
                            "body": "I mean, Tom Woods literally said it out loud in one of his latest newsletters. He’s basically “we cannot change the fact that the federal budget is a shitshow, so we might as well get a few foreign policy wins”. \n\nDoesn’t matter then if trillions of $ of debt get added or if the president starts talking about “illegal protests” - all stuff contrary to libertarian principles - as long as one or two ideas come to fruition. Crazy.\n\n(Yes, I’m still subscribed to his newsletter, mostly to be reminded of the mad state of the US libertarian movement.)",
                            "score": 46,
                            "replies": [
                                {
                                    "author": "guitarer09",
                                    "body": "I’m plugged into some alt-right new sources so I know what all sides are saying. We all should be doing that stuff.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Rvtrance",
                            "body": "I try to fight so hard against us getting grouped in with the fascist. anybody that is politically literate knows the difference, but there are plenty that aren’t on Reddit. I worry about the same thing let’s you and me do our best to be better representatives of our ideology than they want to paint us as. Here’s a stupid example remember Pepe the frog ? they tried to paint him as a white nationalist, racist, blah blah blah, but the world claimed Pepe and now you’ll probably see him more on Hasan Piker’s and Vaush’s stream than you would on a Nick Fuentes one. Don’t give up the fight. Common sense is winning things like the Gadsden Flag need to be stood up for and not confused by the masses for a swastika or the confederate flag. For any lefty who sees this, the fascist, “they not like us”",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "sjeveburger",
                    "body": "Full disclosure I'm not a libertarian, I'm just here to see the viewpoints so take my take with however much salt you think it deserves.\n\nBut from my perspective, the libertarian movement has been almost swallowed whole by MAGA types who parrot freedom for me but not for thee, so it's not surprising to me to see these so called 'libertarians' agreeing with political suppression",
                    "score": 219,
                    "replies": [
                        {
                            "author": "ReidErickson",
                            "body": "Speaking truth.",
                            "score": 43,
                            "replies": []
                        },
                        {
                            "author": "mikerz85",
                            "body": "I used to be a libertarian - joined the party, almost became a delegate — until that happened. Now I want nothing to do with it, and just popped in here for the first time in years to see how It’s going.\n\n  \nfuck maga and fuck the mises caucus",
                            "score": 47,
                            "replies": []
                        },
                        {
                            "author": "Djbonononos",
                            "body": "It's damn true, and it's sad true",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "IsaJuice",
                            "body": "Yo mama",
                            "score": -3,
                            "replies": []
                        },
                        {
                            "author": "djentropyhardcore",
                            "body": "So who does MAGA not want freedom for?  Love to see your answer",
                            "score": -26,
                            "replies": [
                                {
                                    "author": "dubaicurious",
                                    "body": "People who want to protest MAGA judging from that Trump statement.",
                                    "score": 37,
                                    "replies": [
                                        {
                                            "author": "djentropyhardcore",
                                            "body": "How do you know what protests that is aimed towards?  There are many things you can do to break the law during a protest, it doesn't speak to anything political.",
                                            "score": -25,
                                            "replies": [
                                                {
                                                    "author": "FatalCartilage",
                                                    "body": "The timing of this tweet is with sweeping protests against him.  \n\nTo suggest that he plausibly is just coincidentally concerned about other unrelated protests following the law...   You are either ignorant or disingenuous.",
                                                    "score": 22,
                                                    "replies": [
                                                        {
                                                            "author": "djentropyhardcore",
                                                            "body": "So you ARE on the left.  Good to know.  \n\n(You let your mask slip.  Nobody knows about \"sweeping protests against him\".  Nobody watches your media anymore).",
                                                            "score": -6,
                                                            "replies": [
                                                                {
                                                                    "author": "FatalCartilage",
                                                                    "body": "All I need to know you are on the right is your claims that are trivially disproven with trustworthy, unbiased and publicly available empirical data.  \n\nThe protests are on Fox news as well",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "djentropyhardcore",
                                                                            "body": "I never said I wasn't on the right.  I'm a libertarian.   libertarians are on the right.  Nobody watches Fox News either.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "FatalCartilage",
                                                                                    "body": "Well to be honest, I am not a member of this sub I was just searching for this story specifically and didn't even really realize it was a Libertarian sub.  \n\nThat being said, if you are going to call out my views I will share them.  \n\nI am socially liberal and fiscally moderate, giving me a pretty big Libertarian overlap.  Economically I believe the pillars that determine a nation's wealth are stability, infrastructure, free trade, and skill of the workforce, and I support policy that furthers those things.  Left and non-authoritarian as can be on social issues.  My main gripe with libertarians are the ones who want to defund/privatize public education, the highest ROI program of any government.  \n\nThe Trump administration did 2 great things.  Cut taxes (Thank you democrat Gary Cohn who wrote the Tax cuts and jobs act) and end the wars in the middle east.  Everything else is an absolute shitshow disaster of lies and incompetence masked behind extremely performative political theater, complete with gross social liberty violations.  \n\nAlso, calling me someone on the left with the whole \"I see through your mask\".  Lmao I take the label with pride.  \n\nDoesn't really excuse your disingenuousness though.",
                                                                                    "score": 4,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "djentropyhardcore",
                                                                                            "body": "Government has no place in the education industry.  Education is much too important to be left to government.  \n\nAlso, you're just trolling, and that's pretty shitty.  Reddit basically has no community anymore.  \n\nBy the way, nobody would call you a libertarian.  But you do you!",
                                                                                            "score": 2,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "AdCrafty9098",
                                                    "body": "So what is your interpretation? Do you believe trump will act in good faith?\n\nAnd I want context included, because in the context I read this tweet or whatever statement, he has also banned media organizations who are critical of his rule or refuse to use the language he dictates from the white house press corp. Which has aligned to only ban organizations that are not biased right. He has openly lied in public meetings, got called out on the lie, and then threw a hissy fit.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "djentropyhardcore",
                                                            "body": "Fake news should not be allowed in the WHPC.  The AP is a far-left fake news organization that received USAID funds.  It's a propaganda arm supporting the deep state where it gets a lot of it's funding.  \n\nHere in the United States, it's against the law for the government to fund for-profit media organizations.  Government has no place in media.  Usaid was breaking the law, just as it was doing so funding your BBC network.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "jackedup2018",
                                    "body": "The freedom to choose your gender on your passport.\n\nEdit *sex",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "djentropyhardcore",
                                            "body": "Passports only deal with the sex of the person, not gender.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "sjeveburger",
                                    "body": "Well, if I had to make a wild guess I'd say people protesting",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "thebaldfox",
                                    "body": "The Other, of course.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "djentropyhardcore",
                                            "body": "No, that's you.  Those who condemn all only condemn themselves.  You're a socialist so you automatically want a massively large government that silences all opposition to itself.  MAGA isn't that",
                                            "score": -9,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "AutoModerator",
                                                            "body": "\nLibertarian socialism is an oxymoron. The core tenet of libertarianism is private property beginning with the recognition of ownership of self and your own body and extending to ownership of that which is self-acquired and self-produced with that body.\n\nSocialism and communism deny private property rights, and the right of ownership of what is self-acquired and self-produced.\n\nThis means they deny the ownership of self, and someone who does not own themselves is a slave.\n\nSocialism and communism are totally incompatible with libertarianism, and are nothing more than forms of chattel slavery dressed up in pretty words to serve collective masters. Wealth robbery by the collective is just as immoral and unjust as much being robbed at gunpoint by an individual.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "AlphaTangoFoxtrt",
                                                            "body": "\"libertarian\" Socialism.\n\nThe idea that you can somehow forcibly seize, collectivize, and redistribute peoples property, without a central authority, because you call this authority \"society\" instead of \"the state\".\n\nYeah, it's an Oxymoron.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Fletch71011",
                    "body": "Both major parties in the US continue to drift further and further from libertarian values.\n\nIt fucking sucks.",
                    "score": 43,
                    "replies": [
                        {
                            "author": "Reasonable_Truck_588",
                            "body": "Yeah it does, but when the only options are socialism or communism… you choose socialism and continue to fight against the socialists. Because if the communists win, you just starve and soldiers can’t march on empty stomachs.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MarshalThornton",
                    "body": "It would have been shocking eight years ago, sadly the movement has been fully co-opted.",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "KickFlipUp",
                    "body": "A bunch of pro kremlin dick sucking  Christian conservative nationalist -Zionists cosplaying and hijacking libertarian ideology and claiming to be “libertarians” all while wiping their ass with the constitution with gestapo like police state tactics. What happened to “civil liberties”…\n\nYet they want to sick their Gestapo on their political opponents because they don’t like their speech. \n\nFake “libertarians”\n\nTrue libertarians would support any liberals right to free speech no matter how much they disliked it.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "WoodPear",
                            "body": "Blocking access to classes for other students, holding university staff/other students hostage by taking over buildings, intimidation via death threats, which is what the 'illegal protests' refer to if you even paid an ounce of attention, is not 'free speech'.\n\n  \nPro-Hamas protestors FAFO.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "itisnotstupid",
                    "body": "All the libertarions I know are just MAGA dorks or Jordan Peterson/ Joe Rogan bros.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "mrswashbuckler",
                    "body": "Libertarians agreeing with government funded schools now? Colleges should be able to fund themselves. That's what tuition is for",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Memedotma",
                            "body": "Is that why Trump is dangling it like a carrot only if universities comply? You're surely not ignorant enough to know this is about more than just colleges funding themselves.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "mrswashbuckler",
                                    "body": "Any move to defund and stop using tax dollars I can agree with. Perfect is the enemy of the good",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Memedotma",
                                            "body": "You don't think intention should be taken into consideration?",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "mrswashbuckler",
                                                    "body": "No. Not at all. Results are real. Intention is subjective. Grab all steps in the right direction when they come",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Unhappy-Sky4176",
                    "body": "There's a lot of misplaced anger, drama and BS especially coming from the media.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "dhsjabsbsjkans",
                    "body": "Far right republicans started infecting this sub many years ago. I left when that happened. Just poking around the sub and it still looks like that is going on.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Reasonable_Truck_588",
                    "body": "In a world where liberals seek to ban free speech as hate speech, take away the right to bear arms, force medical ‘treatment’ (COVID vaccines) to operate in society, wage wars halfway across the world to protect the borders of other countries while inviting and paying people to immigrate here to live of off this state welfare bullshit system… fuck you guy. Liberals do not deserve for people like me to stand up for their rights, that they would happily take away from me if they were in power. \n\nYou are the very people that roll over and do nothing as your rights a snuffed out, and then you want to protect those who would snuff out your rights… continue sucking that dick like the whore you are. You’re not a libertarian, you’re a liberal in disguise. I don’t like everything Trump does, but he is way better than the alternative.",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "ChitteringCathode",
                    "body": "Just remember that a lot of today's \"libertarians\" are just social conservatives who like pot, guns, and don't want to pay taxes.\n\nAnd even the latter is suspect given the number of people I've seen here or on similar srs who claim tariffs \"aren't that bad\" or don't realize that they're taxes.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "adamant520",
            "body": "\"No masks\" that includes the proud boys right?....Right?",
            "score": 740,
            "replies": [
                {
                    "author": "dubie2003",
                    "body": "Let’s not forget those patriot front larpers….",
                    "score": 240,
                    "replies": [
                        {
                            "author": "MattytheWireGuy",
                            "body": "You mean the Feds?",
                            "score": 34,
                            "replies": [
                                {
                                    "author": "DethNik",
                                    "body": "This is so dumb.",
                                    "score": 11,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "CO_Surfer",
                                    "body": "They disbanded?  Where are you seeing this?",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "dubie2003",
                                    "body": "Just stop being stupid please, we have too much of that in the world right now.\n\nPatriot Front was larping in Boston a week ago or so and Chris stepped down in January…..\n\nIf you are going to make an accusation, support it with evidence……",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "EchoChamberBubblePop",
                            "body": "Feds",
                            "score": -4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "linguist_turned_SAHM",
                    "body": "And the Nazis in Ohio?",
                    "score": 98,
                    "replies": [
                        {
                            "author": "nonsense-noise",
                            "body": "Right!!! They werent arrested bc \"they didnt do anything illegal\" but THEY LITERALLY TOOK OFF IN THE MIDDLE OF A HIGHWAY ON A UHAUL!!!!!",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "Cm_Balkoth",
                            "body": "Let’s not forget the Illinois Nazis. I hate Illinois Nazis.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Jombes_Industries",
                    "body": "No, rules don't apply to feds.",
                    "score": 109,
                    "replies": [
                        {
                            "author": "AlienDelarge",
                            "body": "Always an exception for agents of the state.",
                            "score": 45,
                            "replies": []
                        },
                        {
                            "author": "TheFloridaKraken",
                            "body": "Where are y'all getting this idea from? The Proud Boys have a large presence in my area and they definitely are not feds. They're mostly rednecks and divorced dads with guns. Matt Gaetz used them as security on several occasions that I witnessed first hand.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Jombes_Industries",
                                    "body": "Maybe the fact that their leader was literally outed as a fed.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "TheFloridaKraken",
                                            "body": "Do you mean he was outed as an informant?\n\nedit: Yeah, thats what you mean. For a minute I thought I'd missed something where it turned out Tarrio worked for the government.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Jombes_Industries",
                                                    "body": "In good faith, I don't see much of a distinction.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "TheFloridaKraken",
                                                            "body": "It's pretty misleading to suggest that \"the proud boys are feds\" because \"their leader was used as an informant.\"",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "Jombes_Industries",
                                                                    "body": "I don't feel at all dishonest in saying it or I wouldn't.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "TheFloridaKraken",
                                                                            "body": "But you know informants are not feds, right?",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Jombes_Industries",
                                                                                    "body": "It's rarely that simple when you're dealing with feds.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "TheFloridaKraken",
                                                                                            "body": "Maybe y'all use different slang where you're from. Around here, a fed is a cop or a federal agent. Not their wife, not their neighbor, not informants, not garbage collectors. It seems like you just want to use \"fed\" as an insult.\n\nRegardless, even if Tarrio was a fed, it wouldn't mean The Proud Boys are.",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Jombes_Industries",
                                                                                                    "body": "OK!",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "AspirantVeeVee",
                            "body": "This",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Rude_Hamster123",
                            "body": "Ha",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "oldmanbawa",
                    "body": "Of course not them. They are patriots or something so the rules don’t apply. Just like the other side, if you are on my side you can do no wrong.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Sekreid",
                    "body": "And antifa ??\nThe fbi too",
                    "score": 15,
                    "replies": [
                        {
                            "author": "TheFloridaKraken",
                            "body": "Neither PB or Antifa are feds. That isn't to say that they don't have agents hiding amongst them (because of course they do) but the vast majority are true believers.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Blumpkin_Queen",
                    "body": "Looooooool",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "And transtifa too!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Likestoreadcomments",
                    "body": "Did the proud boys wear masks? I didn’t think they did. The patriot front however (totally not feds 😉) sure did though\n\nEdit: to be clear to those downvoting, I’m definitely not a fan of the proud boys either.",
                    "score": -3,
                    "replies": []
                },
                {
                    "author": "LoneHelldiver",
                    "body": "Proud Boys don't wear masks.  That is exclusively the realm of the left and Feds.",
                    "score": -13,
                    "replies": [
                        {
                            "author": "Beanboi8",
                            "body": "Sure bud",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "TheFloridaKraken",
                            "body": "[https://www.wsj.com/story/proud-boys-see-growth-after-jan-6-attack-despite-criminal-convictions-dea02fa7](https://www.wsj.com/story/proud-boys-see-growth-after-jan-6-attack-despite-criminal-convictions-dea02fa7)\n\n  \nAll you have to do is google \"proud boys in masks\" to get images of.. Proud Boys in masks. I suppose you can just keep saying that they're all feds, but the Proud Boys have a large presence in my area and they do often wear masks. But maybe my area is different from most; Kyle Rittenhouse is a local \"celebrity\" in my region.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AlphaMuggle",
            "body": "What’s an illegal protest? Breaking into a capitol building or no?",
            "score": 108,
            "replies": [
                {
                    "author": "Kokodiablo7",
                    "body": "For real!",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "Soulstyss",
                    "body": "It's okay to do that, you just get pardoned for it",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "PetiteIguana703",
                    "body": "Being let into the capital building*",
                    "score": -3,
                    "replies": []
                }
            ]
        },
        {
            "author": "nom3at",
            "body": "https://www.civicsnation.org/2018/04/02/legal-and-illegal-protests-first-amendment/",
            "score": 177,
            "replies": [
                {
                    "author": "rakedbdrop",
                    "body": "TL;DR: \n\nWhat is Legal in a Protest:\n\n- Free Speech – Expressing opinions, holding signs, chanting slogans.\n- Marching on Public Property – As long as it doesn’t block traffic without a permit.\n- Obtaining Permits When Required – Some protests (e.g., large gatherings, street marches) may require a permit for coordination with law enforcement.\n- Peaceful Assembly – Protesting in public spaces like parks, sidewalks, and streets.\n- Protesting on Private Property – Only with the owner’s permission.\n- Using Public Forums – Traditional public spaces are generally open for protests.\n\nWhat is Illegal in a Protest:\n\n- Blocking Entrances or Roads – Preventing access to buildings or traffic without a permit.\n- Ignoring Police Orders – Disobeying lawful instructions to disperse or move.\n- Obscene or Malicious Speech – Making threats, doxxing, or inciting illegal activity.\n- Obstructing or Harassing Others – Intimidating or preventing others from moving freely.\n- Trespassing – Entering private property without permission.\n- Vandalism & Property Damage – Graffiti, smashing windows, or destroying property.\n- Violence or Inciting Violence – Physical altercations, rioting, or encouraging harm.",
                    "score": 376,
                    "replies": [
                        {
                            "author": "Ysclyth",
                            "body": "How to know if order to disperse is lawful? Seems easily abusable to shut down any protest.",
                            "score": 154,
                            "replies": [
                                {
                                    "author": "bongobutt",
                                    "body": "It essentially comes down to one of the other items on the list. If a police order comes saying that you are obstructing legitimate use of the space or that the property owner is telling you to leave, then the order is lawful. The question can be messy when the space is public property, but again - just refer to the other items on the list.",
                                    "score": 17,
                                    "replies": []
                                },
                                {
                                    "author": "possibleinnuendo",
                                    "body": "It becomes lawful when the property owner decides to call the police.  Pretty straightforward",
                                    "score": 47,
                                    "replies": [
                                        {
                                            "author": "Celebrimbor96",
                                            "body": "What if it’s on public property and the police ask you to disperse?",
                                            "score": 59,
                                            "replies": [
                                                {
                                                    "author": "commandercool86",
                                                    "body": "You kindly and politely tell them to fuck off... as they beanbag, taze and arrest you",
                                                    "score": 107,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "possibleinnuendo",
                                                    "body": "Depends what state you live in.\n\nBut if the government legally has authority over the land, and the government asks the police to make you leave - then I would consider it legal.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Celebrimbor96",
                                                            "body": "So a protest at City Hall can be shut down just because the government says so?\n\nIf that’s true, then there is no first amendment anymore.",
                                                            "score": 53,
                                                            "replies": [
                                                                {
                                                                    "author": "possibleinnuendo",
                                                                    "body": "Depends on the state I imagine.\n\nSomeone else gave a very nice list of legal and illegal actions during a protest.\n\nA state could likely step in, to request that police remove protesters from public land if those protesters are doing illegal things.  And I think that is probably reasonable, and required",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Celebrimbor96",
                                                                            "body": "I’m well aware of the list, it’s farther up in this exact comment chain.\n\nWhat if the only “illegal” part of the protest is ignoring police orders to disperse? If there is no other basis for those orders to be given, then they are not lawful orders and can be rightfully ignored.",
                                                                            "score": 22,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "possibleinnuendo",
                                                                                    "body": "That risk already exists, and is not specific to the post of any recent change.",
                                                                                    "score": 0,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "rakedbdrop",
                                                                                    "body": "What if Martians arrive with vast superpowers? What then?\n\nCheckmate.\n\nBut seriously—I’d say you’re being argumentative, but you’re not even making an argument that isn’t already covered. Just throwing out a bunch of “what ifs”? That’s the move here?",
                                                                                    "score": -2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Celebrimbor96",
                                                                                            "body": "My made up scenario was in response to the other guy’s comments saying the government has a right to throw protestors off government property.\n\nIf they can do so without any justification, then there can never be a protest except that which the government permits, in which case there can never be any true expression of the first amendment.",
                                                                                            "score": 3,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "montblanc87",
                                                                                                    "body": "A lot of these are sorted out in the legal process.\n\nIf a police officer commands you to do something and you refuse, they can arrest you.\n\nIf we later learn the police officer was incorrect, the charges against you are dropped.\n\nUS citizens have important rights when it comes to police interactions, which are important to know. But, if police ask you to do something, it is generally best to comply and keep your mouth shut. If you think what the police did was illegal, contact a lawyer.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "benaugustine",
                                                                            "body": "So a protest is illegal if the government says so? Sounds pretty authoritarian",
                                                                            "score": 7,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "possibleinnuendo",
                                                                                    "body": "It’s illegal if it breaks laws.  Someone provided a nice list further up.  Seems reasonable.  The risk of someone “saying something is illegal” when it is not is already at play.  Anyone could do that at anytime - it’s why there is a court system - that is not a “new” risk",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "benaugustine",
                                                                                            "body": "Are you intentionally missing the point?\n\nYou said this:\n\n>But if the government legally has authority over the land, and the government asks the police to make you leave - then I would consider it legal.\n\nThey have authority over any public property, so someone could be breaking no pre-defined rule. The government says we don't want you here, and only then are they breaking the law.\n\nThat means the government can decide *any* protest is illegal, no matter what the protesters are or aren't doing.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "rakedbdrop",
                                                                                                    "body": "Not really.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                },
                                                                                                {
                                                                                                    "author": "possibleinnuendo",
                                                                                                    "body": "The question should be *why* the government asked the police to step in.  The answer to that is either legally justified, or not.  But that risk already exists in the current system - nothing new has been implemented, other than “you won’t get tax dollars if you allow *illegal* protests”.\n\nIt seems more like you are *intentionally* missing the point from over here.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "gurgle528",
                                                            "body": "The government cannot do that without cause, especially at public forums. Blatant free speech violation. If the assembly gets classed as a riot they are allowed to set curfews and disperse people.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "GrannyLow",
                                    "body": "\"You're being arrested for resisting arrest\"",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "SolenoidsOverGears",
                                    "body": "It definitely can be but that's why the ACLU exists. The only time You can argue with the police outside of the courtroom is if you are so well armed, or they are so outnumbered that they are physically unable to stop you. But, you'll just be arrested for it later. That's what happened to Cliven Bundy and also to the January 6th people, and some of the more egregious perpetrators of looting and vandalism during the 2020 riots. \n\nIn court you can get judgements and settlements against the police and the local/state government for violating your rights. And you stay out of prison. Obey the police, because if they want to and they can, they will make you. The only question is how much it's going to hurt first.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "benaugustine",
                                            "body": "So if a police officer asks you to leave and you comply, you can sue the government for asking you to leave?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "SolenoidsOverGears",
                                                    "body": "Ask? Probably not. You would need to record them saying if you do not leave that you will be arrested. Thereby dispersing a peaceable assembly and depriving you of your first amendment rights.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "curtiss_mac",
                            "body": "The way he (trump) puts this leaves out WAY TOO MUCH CONTEXT that is very needed to have a full discussion behind something as large as this. There are tons of laws/regulations that go with/against this, that of course aren't being looked at/considered.  \n\nSince you laid out the differences between legal/illegal protesting, here is my take.  \n\nIf colleges and universities fail to manage protests ***that begin on their campuses*****—allowing them to escalate into illegal demonstrations that spill into surrounding areas**—then I can understand withholding their funding. If they won’t help maintain peace, but offer a place for the disruption to start and spread, they shouldn’t receive support. \n\nIf these institutions don’t want to risk losing their funding due to protests, they have two options:\n\n1. Allow **peaceful** protests while actively monitoring and preventing them from escalating.\n2. Ban all protests because option 1 proved too difficult, and they prioritize protecting their funding over any issues the people may have.\n\nEveryone has the right to protest, but no one has the right to engage in unlawful or disruptive behavior that harms others, especially to those who are simply trying to live their lives and manage their businesses in the areas that are most effected by these protests. The message behind a protest doesn’t justify harming others, and nothing spreads hate and division faster than people attacking people and businesses who might even agree with them—all in the name of \"change\". \n\nbut something tells me........ someone.........SOMEONE is hoping on option 2.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "marsmedia",
                            "body": "I wonder how a protester could distinguish the *lawfullness* of being told to move?",
                            "score": 29,
                            "replies": [
                                {
                                    "author": "cheeze2005",
                                    "body": "Lawfulness of the order doesn’t really matter the state is gonna beat you with clubs and riot cops if you don’t let your rights be trampled.",
                                    "score": 38,
                                    "replies": [
                                        {
                                            "author": "Impressive-Fortune82",
                                            "body": "They can also prosecute you to the tits afterwards and you can be imprisoned till another party wins",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "9-lives-Fritz",
                                    "body": "If the military stomps on your head or a teenager in his finest tacticool attire shoots you, you were illegal.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "rakedbdrop",
                                    "body": "I laid everything out, and your response was about how a protester can tell if being told to move is lawful?\n\nAlright, here’s the simple version:\n- If the protester is doing anything from the illegal list, the order to move is lawful.\n- If the protester is only doing things from the not illegal list, the order to move isn’t lawful.",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "zack616",
                                            "body": "I don't know if you can hear someone's eyes rolling from the distance I am typing this, but assure they are rolling very hard right now.\n\n  \nTo be kinder, you're missing the point. They can decide whatever the eff they want is illegal and then make you deal with the consequences of those vibes.",
                                            "score": 19,
                                            "replies": [
                                                {
                                                    "author": "Impressive-Fortune82",
                                                    "body": "Can confirm, this is pretty much what Putin's party does to own citizens, they control all branches and decide what they want",
                                                    "score": 6,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "montblanc87",
                                                    "body": "You are rolling your eyes at established laws and saying \"the institution can do what they want anyway.\" \n\nThen why don't the police just arrest who they want all the time?\n\nThese aren't new laws. If you are arrested or assaulted in the process of a lawful protest, you can get the charges expunged and the officer can be charged with a crime if they assaulted you.\n\nMany lawyers live to fuck with police. If you were assaulted during a lawful protest and injured, a lawyer can help you get paid.\n\nKeep in mind that these protest rules apply to everyone. You might find they come in handy when a MAGA protest turns violent and we need to prosecute the offenders (as we did on Jan 6th).",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "ChitteringCathode",
                                                            "body": ">Then why don't the police just arrest who they want all the time?\n\nDoes somebody want to tell him?",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "montblanc87",
                                                                    "body": "Tell me you don't work in law enforcement without saying anything.",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "marsmedia",
                                            "body": "To be clear, I love your list. I agree and it is succinct. I'm just wondering, if a protestor knows their rights and an officer tells them to disburse, what should they do? Obey the unlawful order? Or risk arrest and hope that their interpretation of the law holds up in court. My fear is most people will just disburse. My trust in police is at an all-time low. (As is my trust in the state.)",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "rakedbdrop",
                                                    "body": "Anytime you stand up to authority, just or not, you risk being subdued by that authority. \n\nI think the real question is how do we hold the enforcers accountable for knowing what is lawful or not, and this aspect has nothing to do with freedom of speech, protest, etc. \n\nSadly, yes. You would have to submit under duress, and let the courts handle it.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "9-lives-Fritz",
                                            "body": "Fascist states and police are well known to be unbiased arbitrators",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SideScroller",
                            "body": "This needs to be pinned. Ive seen too many people cry out about the current news while assuming that everything is ok so long as you call it a \"protest.\"",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "to12143",
                                    "body": "The issue is so many of the illegal bullet points can be loosely interpreted. “Obstructing or harassing others” simply being on the sidewalk in a group can be obstructing, even if nothing else is considered illegal. Violence can be easily instigated by opposition as well, and we all know how much cops love to incite violence to use as much force as possible",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "AshingiiAshuaa",
                            "body": "Most of these seem perfectly reasonable.  \n\nI'm lukewarm on \"obtaining permits\" but I understand the intent.  As long as it's a \"shall issue\" thing I'm OK with it.\n\nAlso \"lawful instructions to disperse\" is iffy.  Cops shouldn't be able to tell people to disperse unless they're doing something illegal.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "howdoesEyereddit",
                                    "body": "My local government instituted a policy of requiring permits during the BLM phase. I applied for a permit and listed the reason as protesting the requirement of a permit to exercise my first amendment right. I followed all of their steps and met every requirement they specified.\n\nPermit was denied. \n\nIt’s ok when it’s looked at as making sure there’s a plan in place and they are able to have proper resources, plan traffic, etc. But they can and will use it to deny because they don’t want to deal with it as well.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "tacotongueboxer",
                                            "body": "What was the permit you were requesting specifically outlined for?",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "SideScroller",
                                    "body": "Hence the qualifier \"lawful.\" Youll see that term come up in a lot of Police Auditer videos. To truly defend that point it will usually require it escalating into a court case, which is good if you are willing to put in the work, but sucks because it needs that level of effort.",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "Shoddy_Wrangler693",
                                    "body": "Permits are required in certain circumstances same as if you want to have for example a large party at a state park. If you want to be able to quarter off part of it you need to get the proper permits for it otherwise if people are free to go and rome as they wish you likely don't need a permit. If you're marching down a public road you're going to need a permit for it because you're impeding traffic. If you're standing by the road holding signs that's not necessarily illegal and probably doesn't need a permit depending on your local zoning laws.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "VoxAeternus",
                                    "body": ">Also \"lawful instructions to disperse\" is iffy. Cops shouldn't be able to tell people to disperse unless they're doing something illegal.\n\nIf cops are telling people to disperse when they are not doing something illegal that would be called \"Unlawful instructions to disperse\".\n\nUnfortunately the odds of winning that fight in court is slim due to how \"protests\" are treated as a the entire group, and not a bunch of individuals, so you may be legally protesting, but if enough people start doing illegal things, you can be lumped in by association.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "International_Lie485",
                            "body": "Dear government may I please have permit to speak.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "pile_of_bees",
                                    "body": "The permit isn’t for speaking it’s for shutting down the use of a public space, at least ostensibly",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "Perkiperk",
                                            "body": "Yeah, i always wondered about that when i was younger, but you’re right (at least according to the way the laws are written, though with as nefarious as government always seems to be, there were likely other reasons for it). The government can require permits only in certain occasions (including amplifiers and/or bullhorns and over a certain number of people present), provided the protestors are not blocking roads or entrances. \n\nIt’s all dependent on Time, Place, and Manner of protest. Time, because if the protest was spontaneous and based on breaking news, permit requirements are not valid. Place due to of use of public areas, and manner… if it’s a (especially if it’s a large) street march, there is a lot more coordination required than if it is just people on the lawn of a capitol building or park. Also, if bullhorns or PAs are used, noise ordinances come into play (which are still both facially valid and valid as applied because the noise ordinances don’t only apply to speech). \n\nBut I understand the sentiment of “daddy government, may I please protest if I give you money?” It’s like… “wait, I have to get permission to protest… from the people I’m protesting..?”",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "International_Lie485",
                                            "body": "Abolish public spaces.",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "author": "pile_of_bees",
                                                    "body": "I’m not arguing against that. The reality is in this moment there are public spaces and as that stands, a person or group shouldn’t be allowed to deny them to the public without a permit or whatever",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "MarshalThornton",
                            "body": "Does anyone honestly believe Trump is concerned about blocking traffic?  Given the events of January 6 and the aftermath, is there any doubt that it’s the content of the protests that Trump is angry about?",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "djentropyhardcore",
                                    "body": "Except January 6th was antifa paid for by Nancy pelosi.  Your comment is completely fake, and you know it!",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "taysbeans",
                                            "body": "That’s why Trump pardoned all of them , because they are leftist ?? Is that your argument ?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "djentropyhardcore",
                                                    "body": "Yes, he's a centrist.  We have a right to protest in this country, regardless of what side you're on.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "MuscaMurum",
                            "body": "\"...inciting illegal activity\" such as an insurrection in the Capitol?",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Mean_Cow118",
                            "body": "Okay so...Jan 6th",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Amazing-Variety335",
                            "body": "so everything that went down on Jan. 6th that Trump just pardoned ... got it.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "LOLStud",
                            "body": "I can agree with some of this but the concept of “don’t protest private property” I would much rather people protest at the place of business or residence of politicians (for example) they don’t get to have a break from their work if their decisions have harm towards the people or country. I’m not recommending that violence be used, but occupying their space shouldn’t be regarded as “illegal” .",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "rakedbdrop",
                                    "body": "I disagree. Private property rights are just that. Private. You should have a right to privacy in your own space.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Apache1975",
                            "body": "So essentially, the most effective ways of protesting are illegal.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "rakedbdrop",
                                    "body": "Which one would you like to move up?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "gpcyan3",
                            "body": "Seems straightforward to me.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Mountain_Man_88",
                            "body": "So basically protests that violate the non-aggression principle, violate property rights, or inhibit other people's freedom of movement. Sounds great from a libertarian perspective!",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Soulstyss",
                            "body": "The problem I have with this, is, if you're committing crimes, you're committing crimes. You're not protesting. You can still be charged with vandalism and destruction of property without being at a protest, so the two aren't mutually exclusive.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "rakedbdrop",
                                    "body": "Yes. Crimes are crimes, protest or no protest. I guess the line blurs when people argue ‘the cause justifies it,’ but legally, you’re right, it’s still on the books as vandalism or whatever.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "shiggidyschwag",
                    "body": "Curious about what these restrictions are on “malicious speech about public officials” or the requirement to comply with all “lawful” orders from cops. Is there a law the restrictions come from?  None is cited on that article, it's just text in a paragraph.\n\nDo you have to do anything a cop says as long as it’s not illegal? Can you not protest in opposition of politicians? Where is the line into “maliciousness” crossed?",
                    "score": 19,
                    "replies": [
                        {
                            "author": "montblanc87",
                            "body": "Defamation - basically saying untrue things that have a harmful effect on the individual. \n\nThink Depp v Heard. Her claims that he assaulted her harmed his career and earning power, and the trial was to determine if her claims were true, and if they were untrue, how much they harmed his career and potential earning capacity. \n\nThe damages are critical in these cases. \n\nOne person standing in front of a college chanting \"Nancy Mace has male sex slaves in her basement\" probably isn't going to count as defamation, because it doesn't have a negligible impact on her career. \n\nOne hundred people chanting that probably would, and Nancy Mace could sue wherever the protest was held for defamation (unless she does have sex slaves in her basement). The cops would try to disperse that 'protest' because it's \"malicious speech about public officials\" and most likely untrue and without grounds.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Rude_Hamster123",
                            "body": "Unless I’m mistaken you have to do anything lawful a cop orders you to under most circumstances.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "boozillion151",
                    "body": "They. Don't. Care. What is illegal is whatever they say is illegal.",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "stevovon",
                    "body": "Great share.",
                    "score": 22,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 337,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 84,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 37,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SwigTheRome",
            "body": "This is bull fucking shit. Probably one of the most un-American things he has ever said.",
            "score": 639,
            "replies": [
                {
                    "author": "conro",
                    "body": "Homer Simpson: “One of the most un-American things he has ever said - so far.”",
                    "score": 105,
                    "replies": [
                        {
                            "author": "spectre78",
                            "body": "I mean he was recently “joking” about being the King…",
                            "score": 14,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 189,
                    "replies": [
                        {
                            "author": "SwigTheRome",
                            "body": "![gif](giphy|7YItDIys6EN7CnnVqD)",
                            "score": 45,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "aristotleschild",
                    "body": "There's also [this spectacularly un-American gem](https://x.com/realDonaldTrump/status/1890831570535055759) from DJT:\n\n> He who saves his Country does not violate any Law.\n\nWhat the actual fuck",
                    "score": 35,
                    "replies": []
                },
                {
                    "author": "azsheepdog",
                    "body": "If you are blocking entrances preventing staff and students from getting to classes and offices , going in classrooms and disrupting the classroom, etc... like the ones at Columbia, UCLA , northwestern, etc. then your protest is probably illegal.\n\nIf you are just walking the campus with protest signs, then you are legal.\n\nJust like any protest anywhere else.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "IHSV1855",
                            "body": "This is an utterly empty argument. Harboring Jews was also illegal in ‘44 Germany. Prove that those things *should* be illegal.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "azsheepdog",
                                    "body": "wow what a weird argument, you cant prove anything should be illegal if there is no ultimate infallible moral authority.   Outside of that any rules you make are completely arbitrary. You are equating saving the lives of someone by hiding them is the same as blocking students from attending classes?",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BrokenArrow1283",
                    "body": "So you’re against enforcing the law completely? He said illegal protests. It IS possible to break the law while protesting. You know that, right?\n\nEdit: [Source](https://www.civicsnation.org/2018/04/02/legal-and-illegal-protests-first-amendment/)\n\nFor anyone interested. Please educate yourselves.",
                    "score": -10,
                    "replies": [
                        {
                            "author": "dirtycurt55",
                            "body": "Well sometimes during a protest, a few in the crowd will break the law. By making a statement like this, some people may see it as a way to lump all the protesters in with the few lawbreakers. The statement is to discourage people from protesting America. That’s why I can see why people think this is authoritarian.",
                            "score": 17,
                            "replies": []
                        },
                        {
                            "author": "Flat_Anything_8152",
                            "body": "Like Jan 6?   The one he incited himself as illegal includes breaking glass, graffiti,  etc.  Don't try to gaslight me and say that was peaceful",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "c0horst",
                                    "body": "That was a 100% peaceful protest where nobody was harmed and no laws were broken, and the people just sat around and sang songs until the evil agent provocateur's paid by the deep state made it look like it was violent on the TV.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "taysbeans",
                                            "body": "JFC you can’t be serious . \nThat is a bat shit insane comment , especially knowing what we know now about the people that were pardoned .",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "c0horst",
                                                    "body": "No, I obviously can't be serious. I tried to make the sarcasm obvious, and I have failed.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "RailLife365",
                                    "body": "That's was a legal peaceful protest, protected under amendments to the US Constitution. But yes, that's the type.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "nikkonine",
                    "body": "There is nothing American about protesting and being violent or destroying property. That is the illegal part I believe he is speaking of. You still have to obey the law. Other than that I am glad we have the right to protest illegally. If you disagree then you are a bot or non-american just trying to stir shit up.",
                    "score": -21,
                    "replies": [
                        {
                            "author": "MainType7339",
                            "body": "We did have that tea party in Boston once.",
                            "score": 26,
                            "replies": [
                                {
                                    "author": "RailLife365",
                                    "body": "That was positively a spectacular event. I anxiously await the next one!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "p0tl355",
                            "body": "Lol Boston tea party anyone.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "BrokenArrow1283",
                                    "body": "Nobody said that wasn’t illegal. According to the British, of course it was illegal.",
                                    "score": -3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "zen0lisk",
            "body": "any protest the federal government disagrees with. free speech is a myth if the words \"illegal protests\" are being thrown around by the president",
            "score": 289,
            "replies": [
                {
                    "author": "kmn86",
                    "body": "I think he prob means protests where city traffic is being blocked, houses are set on fire, public property is destroyed, etc. Probably wouldn't impact any peaceful protests. Someone else linked above a useful list of what is considered legal vs illegal protesting.",
                    "score": -14,
                    "replies": [
                        {
                            "author": "somethingwicked",
                            "body": "This is specifically addressing protests on college/university campuses, tho.  It does not make any reference to destruction of property, and I doubt there are many instances where campus protests block city traffic or set houses on fire.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "kmn86",
                                    "body": "Yeah I agree, prob referring to campus protests. But I'm pretty sure there are reports of pro-palestinian protesters blocking students from going to class, harassing Jewish students, beating them up, blocking access to classrooms. College campuses are rampant with antisemitism.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "MarshalThornton",
                            "body": "Do you think that’s what he means? Really?",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "Coballs",
                                    "body": "Lawful protest: protesters with red hats\nUnlawful protests: literally anything close to being in opposition of Trump",
                                    "score": 12,
                                    "replies": []
                                },
                                {
                                    "author": "kmn86",
                                    "body": "I do think this. I follow the conservative and Republican subreddits. the GOP is pretty big on defending free speech. Banning peaceful protests is def a violation of the first amendment. No chance they won't get sued on it anyway.",
                                    "score": -7,
                                    "replies": [
                                        {
                                            "author": "taysbeans",
                                            "body": "Lmao , can’t tell if you’re gaslighting me or yourself .",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "kmn86",
                                                    "body": "What's with the hostility? Why are you so nasty? who shit in your salad?",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "evilhankventure",
                            "body": "Will he pardon them afterwards like the people who broke into the capitol building?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Mecduhall91",
            "body": "King Trump doesn’t like protest you guys",
            "score": 93,
            "replies": []
        },
        {
            "author": "DoubleDumpsterFire",
            "body": "Constitutionalists only when convienent",
            "score": 67,
            "replies": []
        },
        {
            "author": "NationalBank4040",
            "body": "Didn’t Trump just pardon people who were, by definition, illegally protesting?? \n\nHow can people not see this is the exact path the n*zis took is beyond me at this point.",
            "score": 43,
            "replies": [
                {
                    "author": "Unhappy-Sky4176",
                    "body": "No, he pardoned the ones legally protesting that were arrested and wrongly convicted.  There are over 2000 people arrested.  Many are still serving time.",
                    "score": -11,
                    "replies": [
                        {
                            "author": "poneros",
                            "body": "Legally protesting. Get back on your meds",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "BuffaloJayhawk",
            "body": "one that doesn't adhere to the words the elites want you to chant.",
            "score": 119,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -13,
                    "replies": [
                        {
                            "author": "EskimoPrisoner",
                            "body": "Elites are not a monolith. Plenty of elites agree with Trump.",
                            "score": 44,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "author": "EskimoPrisoner",
                                            "body": "You’ve got me confused with the person you originally responded to.  They also seem to be under the illusion that all rich and/or powerful people agree with each other.",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "swannsonite",
            "body": "'the right of the people peaceably to assemble' so not being peacful/calm/ordered?",
            "score": 8,
            "replies": [
                {
                    "author": "kriegmonster",
                    "body": "That's what I was thinking, too. If you become violent and are no longer assembling peacefully, then you no longer have Constitutional protections.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Soulstyss",
                            "body": "But then you're just committing crimes. Not protesting",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "The_Dukes_Of_Hazzard",
            "body": "Lmao this is the same dude who pardoned VIOLENT J6'ers.\n\nFuck me why has every US politician in the last 8 years tried to silence opposition to themselves lol",
            "score": 109,
            "replies": [
                {
                    "author": "p4rc0pr3s1s",
                    "body": "Because each position operates outside of the law and they know this. Once they get power they are unwilling to relinquish it. \n\nAnd because the government essentially operates unchecked now, \"campaign contributions\" and \"gifts\" have never been more profitable. The whole thing is for sale and if you hold a vote you hold wealth.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "bongobutt",
                    "body": "And how many years did those protesters get? I honestly don't know. Because people like you haven't told me yet, and Trump people don't care to. If their sentences were unreasonably long, is commuting their sentences unjust? I don't know if they were commuted or pardoned. Again, no one has told me. If you want me to be upset, I'm happy to oblige. Just give me the information I need to see an injustice.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "VoxAeternus",
                            "body": "I believe some of them never got properly sentenced or were held without sentence for over 2 years, because DC couldn't properly give them all due process in a reasonable time frame. Which was a violation of their 6th amendment rights, and is a valid reason for pardoning them.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Kin-ethra",
            "body": "Protesting is our right",
            "score": 32,
            "replies": []
        },
        {
            "author": "TravisKOP",
            "body": "This dude is straight auth get him the fuck out",
            "score": 64,
            "replies": []
        },
        {
            "author": "Informal_Advantage26",
            "body": "Some of these answers sound nothing like libertarians.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Shrek2onVHS69420",
            "body": "Anything he disagrees with or objects the status quo",
            "score": 6,
            "replies": []
        },
        {
            "author": "FramptonNarvalo",
            "body": "I never went to a protest in college, but I feel like I have to go to a protest at a college now",
            "score": 16,
            "replies": []
        },
        {
            "author": "rushedone",
            "body": "Don’t ask anti-s3mitic questions like that? Thanks.",
            "score": 6,
            "replies": []
        },
        {
            "author": "No-Investment-2465",
            "body": "There’s no such thing as an illegal protest, only people who protest against you. Libertas vel mors!",
            "score": 6,
            "replies": []
        },
        {
            "author": "National-Tiger7919",
            "body": "Imo it’s not even a protest until it’s illegal, if the government gave you permission to do it then you ain’t protesting shit.",
            "score": 39,
            "replies": [
                {
                    "author": "Reverse_Arsonist",
                    "body": "Yeah…that’s not how that works",
                    "score": 3,
                    "replies": [
                        {
                            "author": "National-Tiger7919",
                            "body": "Did I give you permission to disagree with me? ",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ambidextr_us",
                                    "body": "Do you agree with the Constitution's definition of peaceful assembly?",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Reverse_Arsonist",
                                    "body": "Your mother did…your Daddy too",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Coballs",
                    "body": "That’s what I’m saying. If it’s legal, you’re not making your point.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "tacotongueboxer",
                    "body": "Well, you know what they say about opinions...",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "CorruptedLife95",
            "body": "https://www.civicsnation.org/2018/04/02/legal-and-illegal-protests-first-amendment/",
            "score": 14,
            "replies": []
        },
        {
            "author": "Conscious-Key9657",
            "body": "According to the definition, Jan 6 was an illegal protest",
            "score": 4,
            "replies": []
        },
        {
            "author": "Kind_Addendum7354",
            "body": "Illegal protests would likely be the ones that violate the rights of others.  Like obstructing access to public facilities like roads.",
            "score": 23,
            "replies": []
        },
        {
            "author": "troy-phoenix",
            "body": "From Civics Nation:  \"...there are stipulations. One of the biggest has to do with the word “peaceably,” which is the exact term used within the First Amendment. What this means is that while you have the right to free speech, you do not have the right to incite or commit violence.  Other restrictions include trespassing, vandalism, disobeying or interfering with a lawful order given by a police officer, obscene speech, and making malicious statements about public officials. Violating any of the aforementioned may result in legal repercussions.\n\nAlso of note: demonstrators cannot block a building entrance or physically harass others.\"\n\n  \noriginally commented by others:\n\n[https://www.civicsnation.org/2018/04/02/legal-and-illegal-protests-first-amendment/](https://www.civicsnation.org/2018/04/02/legal-and-illegal-protests-first-amendment/)",
            "score": 7,
            "replies": []
        },
        {
            "author": "MishaPepyaka",
            "body": "Haha, you are going to taste Putin's Russia's laws from 2011, when he invented illegal protests.",
            "score": 9,
            "replies": [
                {
                    "author": "Soulstyss",
                    "body": "This",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Vindaloo6363",
            "body": "Violence, vandalism, occupying and denying public use of public property. Pretty much any act of “protest” that harms others or infringes upon their rights.",
            "score": 72,
            "replies": [
                {
                    "author": "Ysclyth",
                    "body": "If I am peacefully protesting and other actors within the vicinity commit these acts, do I suddenly become part of an \"illegal protest\"? If not, then why focus on the act of protesting instead of the property crimes and the individuals who commit them?\n\nHint: the answer is to selectively enforce these rules to chill speech that the administration and its Israeli handlers don't want to hear.",
                    "score": 93,
                    "replies": [
                        {
                            "author": "stevovon",
                            "body": "Agree with this.",
                            "score": 27,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Vindaloo6363",
                            "body": "Yeah, sorry, but when a protest turns into a mob and the police loose the ability to selectively make arrests then the protest/mob needs to be dispersed.",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "FairlyOddParent734",
                                    "body": "This is the same logic cops use for stop and frisk, or random searches/stops in traffic btw",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Vindaloo6363",
                                            "body": "No it’s not.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "FairlyOddParent734",
                                                    "body": "It is:\nBecause of X reason/statistic that only applies to N percent of the population, everyone is losing their  right and/or privacy.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "Vindaloo6363",
                                                            "body": "People simply walking down the street or peacefully protesting are not a mob.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Ysclyth",
                                    "body": "Sorry cops have a difficult job to identify and selectively detain troublemakers. My speech rights are more important than their job being easy.",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Disastrous-Trust-877",
                            "body": "When a protest happens, and violence starts not aiding the police in stopping it, or clearing the area for the police to stop it only means that your protest is protecting these guys.",
                            "score": -19,
                            "replies": [
                                {
                                    "author": "Ysclyth",
                                    "body": "Is your assertion that bystanders have a legal obligation to stop active crime at risk to their own injury or face such consequences as deportation or expulsion? Is this only during exercises of free speech or all the time?",
                                    "score": 30,
                                    "replies": [
                                        {
                                            "author": "Disastrous-Trust-877",
                                            "body": "Bystanders have a legal obligation to not hinder in the stopping of crime at the very least. You're either impeding justice, or actively a collaborator.",
                                            "score": -15,
                                            "replies": [
                                                {
                                                    "author": "Ysclyth",
                                                    "body": "Seems we agree that directly aiding police is not a legal obligation. And certainly there are laws for obstruction.  Should simply existing and speaking in a place where other destructive acts occur be obstruction? Is the expectation that protestors must be hyper vigilant to any potential property or violent crimes and as.soon as they occur, their speech rights are no longer a priority and they must disperse else they are now liable for the actions of the bad actors? What would stop opponents or the state from starting  violence or property crimes within a protest in order to shut it down and label all protestors \"illegal\"?",
                                                    "score": 21,
                                                    "replies": [
                                                        {
                                                            "author": "Disastrous-Trust-877",
                                                            "body": "I'll go the other way then. Why should others be made to suffer for your right to speak? Should buildings be allowed to be burned down while police and rescue workers are unable to help because of your right to speak? Would you argue that you can impose your right to speak over the rights of protection and property of others?",
                                                            "score": -7,
                                                            "replies": [
                                                                {
                                                                    "author": "Ysclyth",
                                                                    "body": "I think we can agree that individuals that start fires should be detained and prosecuted. I fail to see how simply existing in a space and speaking somehow prevents aid workers from doing their job. Is an officers job more difficult when there are crowds of people? Sure,  same with a sporting event for example. But yes, my speech rights are more important than making law enforcement's job easy.\n\nEdit: to provide an example, if I am in a protest,  and there is some emergency behind me, it is reasonable for me to step aside to allow emergency services if asked. What is concerning is that I am expected to suspend my speech rights immediately, disperse,  or face life altering consequences.  If that isn't a direct threat to free speech I don't know what is.",
                                                                    "score": 4,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "hey_dougz0r",
                                                    "body": "I can safely infer your stance on the Jan 6th protests then. *Right*?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Disastrous-Trust-877",
                                                            "body": "Yes, the J6 protesters who fought with cops and broke in were definitely in the wrong. Did you think that was some kind of own?",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "hey_dougz0r",
                                                                    "body": ">Did you think that was some kind of own?\n\nI thought it was a fair question given how the vast majority of people only play by the rules when it benefits their \"team.\" You are aware of this problem and its ubiquity I am sure.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "RailLife365",
                                                            "body": "Do you mean the peaceful, legal protest at the capital building?",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "zuul99",
                    "body": "To add, private property, roads and highways.  I can protest Tesla on a sidewalk I cannot protest Tesla on their lot.",
                    "score": 37,
                    "replies": [
                        {
                            "author": "IsawitinCroc",
                            "body": "That makes sense just wish the tweet wasn't vague",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "robinstud",
                                    "body": "It’s not vague, people are intentionally misunderstanding so they can be mad.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "ChipKellysShoeStore",
                                            "body": "How is it not vague? You’re describing other crimes that happen at a protest, the protest itself isn’t illegal",
                                            "score": 17,
                                            "replies": []
                                        },
                                        {
                                            "author": "IsawitinCroc",
                                            "body": "That too, my apologies.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "robinstud",
                                                    "body": "Nothing to be sorry about.",
                                                    "score": -1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ooolongt",
                    "body": "So definitely NOT J6?",
                    "score": 25,
                    "replies": [
                        {
                            "author": "19610taw3",
                            "body": "I thought that was Antifa? \n\n  \n/S",
                            "score": 15,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Blumpkin_Queen",
                    "body": "Kinda like Jan 6th?",
                    "score": 17,
                    "replies": [
                        {
                            "author": "Vindaloo6363",
                            "body": "Yea, that’s a good example.  Also all of the “Floyd” protests that turned into widespread vandalism and looting.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Blumpkin_Queen",
                                    "body": "I feel like it’s better to call these things what they are: a riot. So is Trump trying to ban riots (no — as he pardoned all the Jan 6thers). So what’s his agenda here?",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "Vindaloo6363",
                                            "body": "Hopefully to avoid the widespread vandalism and looting of 2020 when I literally had nowhere to get groceries for several miles. Jan 6 was a singular event. Happy the vandals and violent people were prosecuted. I also don’t mind that they were pardoned. We have a history of pardoning insurrection from the Whiskey Rebellion to the Civil War.",
                                            "score": -3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "True_Inspector_",
                    "body": "This is understandable. The problem I see is that it would be so easy to make a protest that the government doesn't like \"ilegal\". Just get an undercover agent in the protest and tell him to break private property. Suddenly the whole protest is ilegal. Although I don't see what could be done to avoid this problem",
                    "score": 5,
                    "replies": [
                        {
                            "author": "tacotongueboxer",
                            "body": "The problem you're seeing is not a new one.  Reddit is riddled with eyewitness examples from past protests. He'll, I recall a whole video analysis of how undercover instigators coordinated kicking off shit in Ukraine back around the time they had elections.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "swimbikerun1980",
                    "body": "Obstructing traffic is a big one for me. Not fair for individuals going to work or people on ambulances going hospital.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Soulstyss",
                    "body": "But that's just committing crimes. You don't get arrested and be charged with \"Illegal protesting\" because it's not real. You get charged with vandalism, destruction of property, etc...",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "price1869",
                    "body": "LOL, you mean any protest that Trump and his boot lickers don't like.\n\nDon't answer the questions literally... Answer the question that is actually being asked.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "cringe-expert98",
                    "body": "Didn't American Patriots during the revolution do all of this?",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DialMMM",
            "body": ">What exactly is an “illegal” protest?\n\nSitting down on one of the busiest freeways in the country during rush hour probably lies outside the bounds of legality.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Curious-Chard1786",
            "body": "An \"illegal\" protest generally refers to **a public demonstration or gathering that violates laws or regulations established by governing authorities**. Examples include: Protests involving violence, property damage, or harm to individuals.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Chimp75",
            "body": "First amendment right. It’s protected by the constitution. There’s no such thing as an illegal protest. It’s all about bringing discomfort. \nThe things others are saying are in fact not part of a protest. Destruction and whatnot, are crimes. Gathering and protesting are not.",
            "score": 8,
            "replies": [
                {
                    "author": "stevovon",
                    "body": "Exactly.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "JaneAustenite17",
            "body": "One where students are told to \"stay hidden\" in order to be safe.\n\nhttps://www.reuters.com/legal/cooper-union-nyc-must-face-jewish-students-lawsuit-over-pro-palestinian-rally-2025-02-05/#:\\~:text=NEW%20YORK%2C%20Feb%205%20(Reuters,protection%20from%20pro%2DPalestinian%20demonstrators.",
            "score": 12,
            "replies": []
        },
        {
            "author": "Yonigajt",
            "body": "Vandalism / obstruction of roads",
            "score": 26,
            "replies": [
                {
                    "author": "NottingHillNapolean",
                    "body": "Trespassing (occupying offices, buildings, &c)",
                    "score": 21,
                    "replies": [
                        {
                            "author": "Soulstyss",
                            "body": "All just crimes you can commit without being at a protest tho..",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AdamClaypoole",
            "body": "An illegal protest, as far as I can tell, is defined as having any of the following acts: \n-Vandalism\n-Preventing access to public areas (sidewalks, roads, buildings)\n-Lighting Fires\n-Inciting violence \n-Attempting to silence or harm counter protesters\n-Breaking of civil ordinance laws (such as masks or carrying weapons in places prohibited) \n\nHaving any of these things going on could result in the assembly/protest being declared unlawful. \n\nHere is a resource that discusses some laws that pertain to protest: \nhttps://constitutionalprotestguide.org/relevant-federal-and-state-laws/#anonymous-speech\n\nI would assume the presidents comments relate to the campus protests we seen across 2024 surrounding the Gaza conflict. But I don't know the full context of this story to really be able to comment thoughtfully.",
            "score": 8,
            "replies": [
                {
                    "author": "hstormsteph",
                    "body": "So if I sent a couple people into a protest I didn’t agree with specifically for them to break the law, everyone assumed to be in the group of protesters would be held accountable? \n\nNa that’s not easily exploited or potentially dangerous at all.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "AdamClaypoole",
                            "body": "I would assume it would need to be more than two people for it to be considered a majority of protesters. I think it would also be judged case by case on the individuals with things such as connection to the group protesting. For example, a more spontaneous protest that forms, but isn't organized by a group, would be harder to prosecute/demonize as a whole since it's just several individuals potentially with their own agendas. An organized protest held by a specific group would make it easier to hold the whole group accountable if crime breaks out. If a large number of individuals belonging to a certain group are all committing crimes during a protest then it would be easier to make the claim that the group supports these kinds of actions. \n\nThink Antifa holding a rally that turns into a vandalism filled protest versus a Facebook mom who calls for a march at the school board HQ in a couple of days. Both could potentially harbor criminal acts but the Facebook mom's group would be treated as individuals. Which they most likely would be. While antifa might show up in common dress code, with specific intentions, organized into smaller groups by either singular or collective leadership. \n\nMaybe not the best examples but I'm hopefully explaining my own opinion decently.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "liaminwales",
            "body": "A protest that blocks other peoples rights, once you start blocking people from going to college your infringing on there rights.",
            "score": 40,
            "replies": [
                {
                    "author": "RobbieFD3",
                    "body": "Something tells me that wasn't the meaning behind this tweet.",
                    "score": 34,
                    "replies": [
                        {
                            "author": "VexLaLa",
                            "body": "It was about non citizens participating in political protests like Palestine or Yemen war, which is a clear violation of their student visa.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "RobbieFD3",
                                    "body": "Well, color me surprised",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "VexLaLa",
                                            "body": "Hopefully that’s all there is to it. Protests are a protected right. But they stop being legal when you start blocking roads, vandalizing property, looting stores and all.\n\nAlso deportation of foreign disturbing elements is 100% justified imo. Some of these “students” were cheering on the yemeni rebels that were firing rockets at US vessels, most were cargo (merchant navy, so civilian) vessels and raising slogans like “Yemen Yemen make us proud, turn another ship around”\n\nAlso many harasses Jewish students and blocked them from accessing college for just being Jewish to “support” Palestine. Pure Hamas mentality. 2 wrongs don’t make a right. Harassing American Jews will only reduce their credibility further.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "narwi",
                                    "body": "I don't think a visa restriction limiting your free speech is constitutional in the US.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "I_only_read_trash",
                            "body": "I mean, the protests he's talking about did block buildings, consistently use physical force to expel people, call for the extermination of all Jews in the middle east, and kept jewish college students from campus.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "KimWexlerDeGuzman",
                            "body": "Not to play devil’s advocate but I’m pretty sure it was the meaning. Jewish students are being blocked from going to class…again",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "RobbieFD3",
                                    "body": "Which, I'll agree, is a bad thing",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "WoodPear",
                            "body": "That just tells you don't pay attention.\n\n  \nThe only protest where the threat of deportation being mentioned multiple times throughout the campaign, was college campuses by Pro-Hamas agitators.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "RobbieFD3",
                                    "body": "To be fair, being Pro-hamas still doesn't make it illegal.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "finetune137",
                    "body": "Where",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "StitchesKisses",
                    "body": "*you're* infringing on *their* rights...\n\nSounds like someone was already blocked from going to college.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "licksickprick",
                    "body": "I don’t believe you have a right to go to college",
                    "score": -16,
                    "replies": [
                        {
                            "author": "xr650r_",
                            "body": "You certainly have a right to go to college if you are a student who is paying for it. You don't have a right to be enrolled in college though.",
                            "score": 17,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Callec254",
            "body": "I would assume, one that destroys the property of others, prevents others from accessing a public space, that sort of thing.",
            "score": 13,
            "replies": [
                {
                    "author": "ChipKellysShoeStore",
                    "body": "Those are already illegal, regardless of if they’re done in a protest",
                    "score": 22,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -7,
                            "replies": [
                                {
                                    "author": "ChipKellysShoeStore",
                                    "body": "oh damn I've never encountered a israel shill in the wild\n\nThere's not hamas gangs on campus--there's people protesting the U.S. funding of genocide.",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "nissykayo",
                                    "body": "delusional",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "EskimoPrisoner",
                    "body": "Didn’t he just pardon a bunch of people that did that?",
                    "score": 30,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sargo8",
            "body": "Would these be the protests where they are stopping jewish students from getting to class?",
            "score": 4,
            "replies": [
                {
                    "author": "stevovon",
                    "body": "No.",
                    "score": -3,
                    "replies": [
                        {
                            "author": "Sargo8",
                            "body": "Yes?\n\n[https://www.bbc.com/news/articles/cqly0zrnnv3o](https://www.bbc.com/news/articles/cqly0zrnnv3o)",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "WoodPear",
                            "body": "Literally says 'American students'. And what other protests are associated with deportations, smart guy?\n\nExplain that if it's not about colleges/Gaza protests.\n\n  \nYou can't.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "fridgeus",
            "body": "The only illegal protest is the one that doesn't get a permit. But it is stupid that you need a permit to protest.",
            "score": 3,
            "replies": [
                {
                    "author": "kmn86",
                    "body": "I disagree. I don't think protesters should get to set houses on fire, destroy public property, block traffic, or prevent students from going to class (that they paid for). The freedom to protest shouldn't interfere with someone else's personal freedoms.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "galets",
            "body": "I am not sure what Trump means, but here's the list I would consider illegal, which is widely considered part of \"protesting\":\n\n\\- defacement of streets, buildings, and historical monuments  \n\\- destruction of property and infrastructure  \n\\- intentionally blocking traffic  \n\\- violence, threats, and intimidation of public  \n\\- preventing people from entering the building",
            "score": 4,
            "replies": [
                {
                    "author": "stevovon",
                    "body": "See but that’s all just regular crime. I guess I understand that it does often times become prevalent during some protests but also I think a better less scary way of saying what he said would be something like “America was founded on the belief that our nations citizens should have the freedom of speech and we are proud of our first amendment, please remember to be civil if you choose to protest.” Idfk. I just don’t like the way this was worded. The idea of an “illegal protest” just seems very wrong to me. Just because someone does something illegal doesn’t make the whole protest illegal.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "galets",
                            "body": "We might be talking about semantics here... Lets say, someone you don't like is arriving to campus to hold a speech. You organize a protest. People show up, block entrance, yell at attendants, disrupt an event, the speaker leaves without delivering speech. Is that a protest or a regular crime in your definition?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "stevovon",
                                    "body": "Well you can’t block an entrance legally.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "galets",
                                            "body": "And if you are not blocking per se, just standing around, giving support to the others, who block?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "stevovon",
                                                    "body": "As long as nobody is blocking the entrance or doing anything illegal then should be all good.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "galets",
                                                            "body": "but what if some people do?",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "hokeypokie_",
                                                                    "body": "Then those people (and those people alone) are breaking the law. That doesn't make the entirety of the protest illegal.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "galets",
                                                                            "body": "well, see, there is the problem. You organized a protest, and there are individuals breaking the law. Someone has to address this. If you (AKA organizer and/or participant) are not willing to take those individuals to account, then someone else has to get involved. And that's exactly what is happening, so what are you complaining about.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "hokeypokie_",
                                                                                    "body": "I'm not the police, it's not my job to stop people from breaking the law",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "galets",
                                                                                            "body": "if you don't self-police, then you will be externally-policed, and this is where OP comes into play",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "PetiteIguana703",
                    "body": "I wish we had more people like you. Reading comprehension is at an all time low",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Jelly_Belly321",
            "body": "The \"mostly peaceful protests\" where they burn shit and set up C.H.O.P. zones. Those would be illegal.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Springer0983",
            "body": "Yeah, as a libertarian, that’s bullshit and authoritarian. But then again we shouldn’t be giving funds to universities.",
            "score": 24,
            "replies": [
                {
                    "author": "LostActionFigure",
                    "body": "Seems like you’re equating the two issues. Surely one of them is worse than the other?…Right?",
                    "score": 22,
                    "replies": []
                },
                {
                    "author": "stevovon",
                    "body": "Agreed.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "The_Adm0n",
            "body": "Believe it or not, there are in fact legal and illegal ways to protest.\n\nA protest is illegal if any of the following happen in association with it:\n\n- physical violence, or calls for/threats of physical violence.\n\n- damage to property, or calls for damage to property.\n\n- trespassing\n\n- theft\n\n- detaining any person against their will, or impairing/preventing a person's ability to freely travel (i.e. blocking roads).\n\n- infringing on the constitutional right of others to peaceably assemble.\n\n- preventing the free use of public spaces by others.\n\n\nThere may be more requirements for a legal protest, depending on the state/city you're in (needing to obtain a permit, for example).  But if a protest checks any box on that list, it's an illegal protest.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Hairy_Melon",
            "body": "Anything that doesn't adhere to their idea of \"free speech\".",
            "score": 7,
            "replies": []
        },
        {
            "author": "Evening_Pizza_9724",
            "body": "You know, the ones that are illegal.  Like protesting in the middle of a street.  Gluing your hand to the pavement.  Throwing paint on art.  Destruction of property.\n\nThe protests that infringe on other's rights.",
            "score": 9,
            "replies": [
                {
                    "author": "evilmittens9",
                    "body": "Yeah, he's against destruction of property like on Jan 6. That's why he didn't pardon those people.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "stevovon",
                    "body": "Would be nice to get a clarification from him. If nothing else this was a very poorly thought out tweet. Protesting isn’t illegal and is at the very core of our countries founding principles. As the president you at least need to be mindful of that.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "SatiatedPotatoe",
            "body": "Those ones where they sit in the road come to mind.",
            "score": 7,
            "replies": []
        },
        {
            "author": "awkward-toast-",
            "body": "Protest harder for the sake of protesting...1' off campus.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Heavy-Explorer-1987",
            "body": "I think the standard has been set that as long as it’s nothing worse than what was done on January 6th, you can be pardoned.",
            "score": 2,
            "replies": [
                {
                    "author": "taysbeans",
                    "body": "If you agree with him and are doing it for him . I guarantee it doesn’t go both ways .",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "kotn_",
            "body": "Well, when the ~~president does~~ university allows it that means that it is not illegal.\n\nUnitary University Theory",
            "score": 2,
            "replies": []
        },
        {
            "author": "TangleRED",
            "body": " a protest that trespasses on private property and interferes with the commerce and or enjoyment of the owner?",
            "score": 2,
            "replies": []
        },
        {
            "author": "kagerou_werewolf",
            "body": "probably the kinds that happen where a crime is comitted during protest, like obstruction of traffic, obstruction of police business, damage of property, grand larceny, grand theft, battery, manslaughter, disturbing the peace, indecent exposure, which are very common things that happen in peaceful protests (Stop Oil for example, obstruction of traffic.)\n\nMany protestors lately have made signs excluded by freedom of speech like ones calling for or depicting the harm of administration members or associates like DJT, Kash Patel, Elon Musk, Peter Hegseth... that is going to make the protest illegal.",
            "score": 2,
            "replies": []
        },
        {
            "author": "cavilier210",
            "body": "I'm thinking protests like BLM's where they burn down buildings and attack people on the streets.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Zealousideal_Owl2388",
            "body": "Any protest where people break the law",
            "score": 2,
            "replies": []
        },
        {
            "author": "Stiks-n-Bones",
            "body": "According to Google Assist:\n\nA protest is considered illegal if it involves violence, property damage, or harm to individuals, occurs on private property without permission, ignores police orders to disperse, or advocates for criminal activities. While the First Amendment protects free speech and assembly, the government can impose restrictions on the time, place, and manner of protests.",
            "score": 2,
            "replies": []
        },
        {
            "author": "tee142002",
            "body": "I guess we'll trade the first amendment for some maybe tax cuts.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Rvtrance",
            "body": "Whatever the Government deems illegal. Duh. But seriously as Libertarians we all need to rally behind the right to peaceful protest ESPECIALLY if we don’t agree with the cause (criticism of it is best). Because the two parties certainly won’t.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Annual-Same",
            "body": "I look left, I see authoritarians.\nI look right, I see authoritarians.\n\nAmerica is in a sorry political state at the moment.",
            "score": 6,
            "replies": []
        },
        {
            "author": "speeperr",
            "body": "I think it's pretty obvious he's talking about riots, where people vandalize property. The no mask thing is bs though.",
            "score": 8,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 0,
                    "replies": [
                        {
                            "author": "speeperr",
                            "body": "Not even that, it's deliberate language to trigger people. Something he's done since the Ice Age.\n\nThis is like getting upset that people can't obstruct roads because it's public property. Yeah, abolish public property and the state, but don't pretend laws that are equal to laws against obstructing roads is the most anti free speech thing you've ever heard.\n\nEdit: I just meant \"you\" rhetorically. You didn't have to delete your comment bro :(",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Wtfjushappen",
            "body": "Mostly peaceful protests",
            "score": 3,
            "replies": []
        },
        {
            "author": "steadyachiever",
            "body": "Was January 6th a legal protest?",
            "score": 4,
            "replies": []
        },
        {
            "author": "Nave8",
            "body": "Maybe about the ones that threatened Jewish people?",
            "score": 3,
            "replies": []
        },
        {
            "author": "azsheepdog",
            "body": "If you are blocking entrances preventing staff and students from getting to classes and offices , going in classrooms and disrupting the classroom, etc... like the ones at Columbia, UCLA , northwestern, etc. then your protest is probably illegal.\n\nIf you are just walking the campus with protest signs, then you are legal.\n\nJust like any protest anywhere else.",
            "score": 3,
            "replies": []
        },
        {
            "author": "AWatson89",
            "body": "Protesting in a way that breaks the law. Things like blocking traffic, vandalism, etc.",
            "score": 5,
            "replies": [
                {
                    "author": "ChipKellysShoeStore",
                    "body": "Or trying to overthrow an election",
                    "score": 13,
                    "replies": [
                        {
                            "author": "AWatson89",
                            "body": "Sure",
                            "score": -4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Parmeniscus",
            "body": "Easy - anything he doesn’t like. As he says he is the federal law, and any judge who disagrees is also illegal. Things have become a lot less complicated.",
            "score": 4,
            "replies": []
        },
        {
            "author": "snipman80",
            "body": "He's referring to pro-Hamas protests like the ones at I believe it was Yale where they attacked Jewish and Israeli students and set up checkpoints to see if any students or professors were Jewish and if you were, you would be refused entry. I could be wrong about the university, but this happened on a major East Coast university over the summer of 2024 and is a direct violation of the 1964 Civil Rights Act",
            "score": 10,
            "replies": [
                {
                    "author": "davidj3d",
                    "body": "And we ALL know POTUS is a strong defender of the 1964 Civil Rights Act....",
                    "score": 7,
                    "replies": [
                        {
                            "author": "snipman80",
                            "body": "He did donate to several organizations who supported civil rights throughout the '90s so...",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Going_my_own_way73",
                                    "body": "And said 5 African American boys should be executed for a crime they didn’t commit.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "JonReddit3732",
            "body": "So much for freedom of speech.... or freedom of....well, to wear what you want (on your face).... the pendulum just swings from a left nightmare to a right nightmare....",
            "score": 3,
            "replies": [
                {
                    "author": "WoodPear",
                    "body": "Free speech does not allow you to threaten Jewish students with death threats for the sole reason of being Jewish.\n\n  \nRead the tweet again, use your head for critical thinking when you see the words 'deportations for non citizens', 'american students', to know that this is referring to campus 'protests'.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ConscientiousPath",
            "body": "> illegal protests. no masks\n\nleftist filter: \"he's saying that he's going to lock up anyone who ever wore a mask or just doesn't like him in Guantanamo and torture them to death!\"\n\n---\nconservative filter: \"He's going to arrest people who cause property damage during riots\"\n\n---\n\nlibertarian filter: it sounds wrong and probably there will be continued misuse of force at a similar level to what we've seen historically, but at least we might get federal funding out of a couple universities.",
            "score": 5,
            "replies": []
        },
        {
            "author": "ThaiStick541",
            "body": "Im a registered Libertarian in California and I voted for Trump. If he means protests in which property and people get hurt and damaged I'm all for it. But just protesting on campus should not be infringed upon. We want less government where it doesn't need to be. If there gonna get people in trouble for committing crimes have at it but just protesting? No.",
            "score": 4,
            "replies": [
                {
                    "author": "stevovon",
                    "body": "Agreed.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "doesnotexist2",
            "body": "I’m not trying to defend orange idiot, but thing’s like the BLM riots in 2020 were called protests. And other protests that block access to public spaces are illegal.",
            "score": 5,
            "replies": [
                {
                    "author": "speeperr",
                    "body": "People are deliberately misunderstanding him so they can pretend Trump is as bad as the left. He's framed statements with this type of broad language for years and I don't understand how people still fall for this, unless it's on purpose.",
                    "score": -8,
                    "replies": []
                }
            ]
        },
        {
            "author": "bravehotelfoxtrot",
            "body": "Federal funding for colleges should not be happening in the first place. Just cut it off anyway.",
            "score": 2,
            "replies": []
        },
        {
            "author": "zombielicorice",
            "body": "We have seen plenty of illegal protests in the last decade. Blocking thoroughfares, especially ones used by emergency vehicles, seems to be the nuisance of choice for BLM/Just stop oil/Free Palestine movements these days. Vandalism and harassment are also very common at these protests.",
            "score": 3,
            "replies": []
        },
        {
            "author": "davisriordan",
            "body": "One that conservative news outlets speak negatively about, or which negatively impacts the stock market",
            "score": 4,
            "replies": []
        },
        {
            "author": "WanderingPulsar",
            "body": "Perhaps its about using the idea of protesting to prevent other people from enjoying their right to travel/trade",
            "score": 2,
            "replies": []
        },
        {
            "author": "TheAgentOfOrange",
            "body": "Taking over buildings. Blocking entrances to buildings. Setting up camps. Trapping administrators in their offices. Physically blocking Jewish students from going to class. Being violent. Inciting violence. Setting fires.",
            "score": 2,
            "replies": []
        },
        {
            "author": "rebeldogman2",
            "body": "Whatever trump decided after all he is the president. The smartest person in the whole wide world",
            "score": 2,
            "replies": []
        },
        {
            "author": "Recent-Progress-76",
            "body": "Hated the way this was implemented too. It so incredibly vague. Does this mean he’ll intervene when the protests are no longer peaceful? Or stop just the protests he deems unnecessary?",
            "score": 2,
            "replies": []
        },
        {
            "author": "plebbtard",
            "body": "Any protest of Israel obviously",
            "score": 2,
            "replies": []
        },
        {
            "author": "theekevinbacon",
            "body": "Other post got deleted so I'll share my comment here:  \n\nA way to create fear and discourage people from engaging in any protests in the first place.  \n\nImagine:  Two idiots get into a shoving match at a campus protest and all of a sudden the 3 foreign exchange students that were 400 feet away are getting shipped back home.",
            "score": 2,
            "replies": []
        },
        {
            "author": "LazorusGrimm",
            "body": "Technically the American Revolution was an illegal protest and that kind of worked out in our favor.",
            "score": 2,
            "replies": []
        },
        {
            "author": "SCB024",
            "body": "You might be surprised how many protests are illegal. \n\nThere are a number of factors. \n\nUsually the cops do not enforce unless ordered to or things get out of hand (unless they were told to stand down or are overwhelmed, e.g. BLM riots). \n\nIn many places, simply having more than 5 people without a permit makes it illegal.",
            "score": 2,
            "replies": [
                {
                    "author": "stevovon",
                    "body": "Yeah and that’s communist. Who decided having more than 5 people together was illegal?",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "the-fixxr",
            "body": "Trump,  the Jew's little puppet, just like the rest of them.",
            "score": 2,
            "replies": []
        },
        {
            "author": "sprinjetsu",
            "body": "It’s illegal if it is pro-Palestine or anti-Israel or pro-Ukraine or anti-Russia….. im guessing",
            "score": 2,
            "replies": []
        },
        {
            "author": "FragCook",
            "body": "Protesting with a mask is illegal in some states unless it's for health reasons. And most of the videos I've seen of the college protests I've seen almost all of them have on a mask",
            "score": 2,
            "replies": []
        },
        {
            "author": "Winter-Snowman",
            "body": "I assume he means protests that involve breaking and entering, occupying administrative buildings, etc.",
            "score": 2,
            "replies": []
        },
        {
            "author": "seobrien",
            "body": "Yeah ... This was a misstep on Trump's part. \n\nDon't piss off students who don't know better, and don't infringe on the 1st Amendment at all.\n\nWhat's illegal? Assault, breaking and entering, property damage, and theft, as well as theft on private property.  There is no such thing as illegal protest, there is crime associated with completely legal and always protect from the government protest.",
            "score": 3,
            "replies": [
                {
                    "author": "stevovon",
                    "body": "Agreed. Everything that falls under “illegal protest” is actually just normal crime. The whole protest isn’t deemed illegal if one person in it does something illegal. Right? Not that I even think a bunch of PhD students are really going to be making much of a ruckus anyway. Idk.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "qp0n",
            "body": "This is obviously unconstitutional and exactly why we want to shrink the federal government and its budget so it cant manipulate whatever it wants by using its purse, which comes from us.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Johnnny-z",
            "body": "A bunch of the pro Palestinian protests caused extensive damage to colleges.  Few people if any were arrested.  \n\nIt seems like the universities ignored the agitators and didn't have them arrested or prosecuted. I think this is what Trump is referring to.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Black777Legit",
            "body": "Oh no. Who could have seen this coming.....\nBoth blue and red means will leave you with less rights, lmao.",
            "score": 2,
            "replies": []
        },
        {
            "author": "robinstud",
            "body": "One that breaks laws.",
            "score": 2,
            "replies": []
        },
        {
            "author": "AbolishtheDraft",
            "body": "Any protest that is critical of Israel. Look it up, that's what got Republicans interested in cracking down on campus protesters",
            "score": 3,
            "replies": []
        },
        {
            "author": "VexLaLa",
            "body": "Illegal protests mean foreign students on a study visa that are protesting. Many have been deported over the same. “Sent back” is pretty fair. Why are they even in the US if they disagree with the policies and hate the US so much? They aren’t citizens. These people were cheering on Yemeni terrorists that were attacking and turning away AMERICAN CARGO SHIPS, CIVILIAN VESSELS!!!  Totally unjustifiable. \n\nNon citizens or non permanent residents are not allowed to participate in political protests in most countries as it can be misused by foreign powers to attack the sovereignty or political stability of any country.",
            "score": 1,
            "replies": [
                {
                    "author": "narwi",
                    "body": "You are pretty much wrong on all counts on this, including \"most countries\". Just about the only places where such is are the öikes of Russia, China and Venezuela. You should consider relocating",
                    "score": 3,
                    "replies": [
                        {
                            "author": "VexLaLa",
                            "body": "There are many more, including my birth country of India. Karl rock was banned from India for the same. When I immigrated, I was very mindful of the country I chose, something I could be happy with. I assimilated, respected the local culture and the locals and try my best to be a good resident. Most of these activist type F1 students are a nuisance to many, I’ve seen it first hand. Freedom of speech and protest doesnt come at the cost of others. \n\nAlso F1 visa is at will from the US govt, based solely on enrollment. Enrollment and the visa both can be cancelled at any time and the student will be de poo under the pretense of invalid visa/expired visa.\n\n\nI’m all for showing your disagreement towards the government. But when foreign students enter a country; then protest against the same country, while being a nuisance for the citizens, blocking roads, stopping other students from studying and attending college maybe even vandalizing property and turning colleges into political cesspools instead of a place for study, I think they should stay at home in their origin country. Why did they come to America if they hate the policies so much? Did they come to study or protest?\n\nAlso no country has the obligation to accept terrorist sympathizers and supporters, supporting the Palestinians people is one thing, so is supporting the innocent affected by the Yemeni civil war. But sympathizing with Hamas or supporting the Yemeni aggression towards civilians is another, anyone that does that clearly outlines their biases and character and is probably not a good “guest” to have.\n\nIf they cared so much, they could apply for a visa of the country that they oh so support and fight there. \n\nCuz I am ready to die on the hill of liberty for what I support, but are they ready to give it all up for their cause?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Mountain-Papaya-492",
                    "body": "Well that fundamentally goes against the spirit of the Bill of Rights. They aren't rights granted to us out of the kindness of the government's heart. They're rights that, if you believe in the ideology of our founders and this nation, that everyone has inherently.\n\n\n Like I personally believe that everyone has those unalienable rights from birth, but since America is just one country that doesn't control every nation in the world, some people are deprived of those natural liberties depending on their nations government. \n\n\nBut that also means you don't have to be a citizen, if you're within these borders then as an ideological nation we are supposed to believe that everyone has these rights regardless of nationality and citizenship. \n\n\nI'm pretty sure the Supreme Court not too long ago reinforced that spirit of belief by saying that even if you're an illegal immigrant you still have a right to bear arms. Which is surprisingly keeping more in line with our founders radical ideology of liberty being a birth right and not a gift from government. ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "EngagedInConvexation",
            "body": "One that prevents him from crossing the street to do whatever this is:\n\nhttps://preview.redd.it/03wmc4yrdpme1.jpeg?width=1024&format=pjpg&auto=webp&s=b9d718ee5ca37010c6c278ee92d53f9e54b07d7c",
            "score": 2,
            "replies": []
        },
        {
            "author": "SunnySpot69",
            "body": "Serious question, what is an illegal protests? I've yet to see an answer to this?????",
            "score": 1,
            "replies": []
        },
        {
            "author": "magichronx",
            "body": "\"*Permanently* expelled\", eh? As opposed to ...*temporarily expelled*?",
            "score": 1,
            "replies": []
        },
        {
            "author": "legitSTINKYPINKY",
            "body": "Idk how masks are illegal. Sometimes Trump says fucking dumb things.",
            "score": 1,
            "replies": []
        },
        {
            "author": "pristine_planet",
            "body": "The funding itself is the issue in the first place. Education costs are way too ridiculously high because of that. If everyone had to pay costs would be lower and we’d be able to protest all we wanted.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alantennisplayer",
            "body": "Isn’t that free speech",
            "score": 1,
            "replies": []
        },
        {
            "author": "Myte342",
            "body": "What is an illegal protest you ask? One that doesn't have enough firepower to make the police think twice about storming in to arrest people en masse.\n\nNot even kidding. Think about it, of all the major protests and demonstrations in the last 20-30 years... how many of them have ended is massive police involvement with arrests all over the place and violence galore? And how many of those were Second Amendment protests? Exactly zero if memory serves.\n\nJust have to look at the Don't Comply charity in Texas. Something like 15 years ago their city made it a long and expensive process to get permission from the government to feed and cloth the homeless. The first year the charity fed the homeless the cops showed up and handed out tickets to the volunteers like candy. Thousands in fines racked up in a few short hours. Next year... the charity volunteers came back to do the same thing but did so while openly carrying firearms and ready to defend themselves. Not a ticket was written that day and not a day since then and they ALWAYS run their charity while visibly armed now. https://www.youtube.com/watch?v=9ABSyDOzFz0",
            "score": 1,
            "replies": []
        },
        {
            "author": "somerandomshmo",
            "body": "He's talking about protests like this:\n\n\nhttps://www.nytimes.com/2024/05/23/us/ucla-pro-palestinian-encampment.html",
            "score": 1,
            "replies": []
        },
        {
            "author": "Drycabin1",
            "body": "Political speech likely to cause substantial disruption in a school setting is not protected under the first amendment.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SkeeterYosh",
            "body": "Party of free speech and economic liberty, amiright?!",
            "score": 1,
            "replies": []
        },
        {
            "author": "soupdawg",
            "body": "[The Difference Between Legal and Illegal Protests - Civics Nation](https://www.civicsnation.org/2018/04/02/legal-and-illegal-protests-first-amendment/)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Educational-Bet-8979",
            "body": "One man’s Illegal protest is another man’s free speech.",
            "score": 1,
            "replies": []
        },
        {
            "author": "runway31",
            "body": "Burning cars and looting, for starters",
            "score": 1,
            "replies": []
        },
        {
            "author": "theMezz",
            "body": "A protest is fine but a mob is not. Their is often a point when a protest becomes a mob. Our agency would sometimes make an official declaring that a protest is now a mob. At that point they can be ordered to disperse, cease actvity, etc.\n\n**When Does a Protest Legally Become a Mob?**\n\nA protest is protected under the **First Amendment** in the U.S., but it can legally turn into a **mob** when it crosses the line into unlawful behavior. This typically happens when:\n\n1. **Unlawful Assembly** – A group gathers with intent to commit a crime, disturb the peace, or refuses to disperse when ordered.\n2. **Riot** – Violence, property damage, or threats to public safety occur. Many laws define a riot as involving **three or more people** engaging in violent or disorderly conduct.\n3. **Criminal Acts** – Looting, arson, assault, or vandalism shift a protest into illegal territory.\n4. **Failure to Disperse** – If authorities declare the protest unlawful and order people to leave, refusing to do so can legally classify the gathering as a mob.\n\n# Key Takeaway:\n\n* **Peaceful protest = protected**\n* **Violence or illegal activity = potential criminal charges** (rioting, inciting violence, property destruction, etc.)\n\nLaws vary by location as well as police policy\n\nExamples - a strike line .. when strikers block traffic, damage property, threaten others, disturb the peace  \nor at abortion clinics .. when protesters block people from driving into the parking lot or walking into the bldg, or cut tires on patients cars.\n\nWe would normally determine who is in charge of the protest and have him sit with us and explain what they can and cannot do. When they violate we would go to that person and try to correct it. Sometimes that works, but sometimes not (when windows are broken, things are in fire, bricks are flying)\n\nWhen things get out of hand we would declare an \"unlawful assembly\" and often give then XX minutes to disperse or cease the illegal actions.\n\nThe threshold for any of these things vary based on each case , jurisdiction, local laws, state laws, policy of police, policy of the DA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "robinson217",
            "body": "I was wondering the same thing. I'm not sure what *he* considers an illegal protest, but I would say the line line should be any protest that makes unwilling participants of the surrounding people.  Example: blocking traffic. I guess you could make an argument that blocking people from freely moving about the campus would be illegal.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gazzettinoeconomico",
            "body": "Is this for real?  \nI liked the first sentence, until \"or University\" though.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rtekaaho",
            "body": "Anything that violates local Disorderly conduct laws. The right to protest isn’t absolute and can be regulated through obtaining permits etc. NYC used to require a permit and a designated location to protest until Mayor DeBlasio and it was much better that way. Private institutions can do whatever they want on their property hence why Occupy protest at Zucotti park lasted so long.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Taki32",
            "body": "An illegal protest is one which breaks the law and is not peaceful.  Like when it becomes a riot or folks start adulting others or vandalizing.  Everything is fine until you want to start hurting people to prove your point.  This should be reasonable for everyone but all too often people go crazy, I've seen it first hand",
            "score": 1,
            "replies": []
        },
        {
            "author": "remowilliams75",
            "body": "I asked my wife the same thing last night, then we both laughed, what a fukin moron, his mom really did fuck a orangutan",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok-Nobody-9505",
            "body": "The classical conservative argument of wanting freedom only for themselves.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Objective-Positive89",
            "body": "A protest where a large amount of the protesters are doing illegal things basically a riot when they don't want to call it a riot",
            "score": 1,
            "replies": []
        },
        {
            "author": "Devinslevin",
            "body": "What the hell has our country come to, and how the hell can any of us who call ourselves Libertarian support this garbage.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rofasix",
            "body": "When the “authorities” declare the protest illegal, it is. A totalitarian loves this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "evidica",
            "body": "Like what happened on Jan 6 right?",
            "score": 1,
            "replies": []
        },
        {
            "author": "HurricaneSpencer",
            "body": "MFs who agree with this woulda told them boys in Boston to leave the tea on the boats.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wizard_bonk",
            "body": "Funding stopping to Universities that aid and abet rioters? Not bad. Funding stopping to universities that allow Palestine(anti-Israel) protests? BAAAAAAD. So very bad",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mastiffmory",
            "body": "It’s defined by the jurisdiction. If you block a highway in protest you are illegally protesting.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bbbstep",
            "body": "He’s bringing back FREEDOM OF SPEECH… but posts this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CA_Castaway-",
            "body": "The Constitution guarantees the right to protest peacefully, so I guess an illegal protest would be the opposite of that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Soulstyss",
            "body": "I believe, by definition, protesting cannot be illegal. The point it becomes illegal would be people just committing crimes. If you're committing crimes, you're committing crimes, you're no longer protesting.\n\n He could have just as easily said those who commit crimes, but he didn't. And that was 1000% by design. He knew what he was saying. \n\nYou can be charged for vandalism without protesting. They're not mutually exclusive. This is an attempt to over reach and see the reaction",
            "score": 1,
            "replies": []
        },
        {
            "author": "boozillion151",
            "body": "Any protest or gathering that isn't in support of trump. Isn't that now obvious? He's been working up to this for weeks.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jagjordi",
            "body": "Ilegal protests are any protest that Trump doesn't like",
            "score": 1,
            "replies": []
        },
        {
            "author": "BBRodriguezonthemoon",
            "body": "How very Russian of him",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tracieattimes",
            "body": "Two examples I have seen a lot in the last ten years are:\n\nInterfering\nLike blocking streets, blocking access to buildings, classrooms, loud noise during sleeping hours, occupying buildings, etc. \n\ndestruction of property\nSpray painting, other kinds of defacing, tearing down statues, etc.\n\nHere’s a handy guide on keeping it legal, published by the American Civil Liberties Union. \n\nhttps://www.aclu-wa.org/docs/know-your-rights-guide-protests",
            "score": 1,
            "replies": []
        },
        {
            "author": "awarepaul",
            "body": "People at my university were absolutely harassed by protesters the last few years. Uni allows it to happen for fear of looking authoritarian. \n\nThese people wouldn’t let you walk through certain areas of campus and would block building entrances",
            "score": 1,
            "replies": [
                {
                    "author": "stevovon",
                    "body": "Yeah but this isn’t a Palestinian protest this is them protesting the pausing of grant money and that jazz. I think it’s gonna be a different crowd. I could be wrong though",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "titsmuhgeee",
            "body": "I literally the entire point of this is **incite** protests. \n\nGetting the college kids out and protesting is great for ratings. It's a great diversion.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hench999",
            "body": "If I invite a bunch of people over to my house and  one of then starts mouthing off and saying rude shit I may not be able to have them arrested by I have every damn right to throw their ass out.\n\nBeing in this country and going to school for these foreign students is a privilege, not a right. Why should people not be expected to behave when visiting from other countries? I don't have an issue with them participating in protests, but screaming death to America and genocidal chants should not be something we should tolerate from guests. Yeah, the First Amendment means we can't charge then them with crimes, but we do not have to let people in here who hate us and can't behave.  \n\nBlocking people in, threatening people, blocking roads, and vandalism is a no-brainer, and if you can even accept that should not be tolerated, then there is no discussion or common ground to have. \n\nSo yeah, I do not want some vague law selectively enforced  and used on people who are law-abiding. I am  not for that. However, behavior like some of that seen in this hamas protests we should not have to tolerate from non citizens. If we are so awful, then GTFO and go to school some place else.",
            "score": 1,
            "replies": [
                {
                    "author": "stevovon",
                    "body": "Totally agree. I think trump just worded this poorly (I hope). Somebody doing something illegal at a protest and the protest itself can be in two different circles.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "justsayno_to_biggovt",
            "body": "Donnie misses the days of his youth. \n\nDo you remember Kent State?",
            "score": 1,
            "replies": []
        },
        {
            "author": "swannsonite",
            "body": "Like protesting in a highway stopping traffic it is not peacful people could die and have.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheMachoMustache",
            "body": "Our country is getting scarier by the day…",
            "score": 1,
            "replies": []
        },
        {
            "author": "fidelitysyndrom",
            "body": "Yay, no more blocked roadways and violence!",
            "score": 1,
            "replies": []
        },
        {
            "author": "pizzaguy4378",
            "body": "Christ this guy sucks.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sprinjetsu",
            "body": "We must protest this",
            "score": 1,
            "replies": []
        },
        {
            "author": "Goldenappl27",
            "body": "You’re not a libertarian if you agree with this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "1kingtorulethem",
            "body": "How far many of you “libertarians” have fallen. How long did you screech about how the first amendment doesn’t exist without the second amendment. Then when rights are actually being trampled on, you have to let go of the Trump tit to defend him treading.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Seared_Gibets",
            "body": "I would like to assume violent ones. You know, the kind the mainstream crap-chute media would normally call *\"mostly peaceful.\"*\n\nOr ones that are about openly calling for actual violence against an individual or group.\n\nAside from that, yeah maybe a little concerning if he means otherwise.",
            "score": 0,
            "replies": []
        },
        {
            "author": "RouletteVeteran",
            "body": "Against little hats? Must be getting ready to finally take over Palestine and hit up Iran. Can’t have “protesting”.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Chance_Anon",
            "body": "He’s just going full on facist. What an evil prick I hope he gets that Luigi treatment.",
            "score": 0,
            "replies": []
        },
        {
            "author": "CornPop71T",
            "body": "He may be referring to illegals that are protesting in places like California or Texas.",
            "score": -1,
            "replies": []
        },
        {
            "author": "GGM8EZ",
            "body": "One on private property and that destroys private property, especially ones where an individual hides their face so that their acts are unidenifiable.",
            "score": -3,
            "replies": []
        },
        {
            "author": "CarmeloManning",
            "body": "Why is the federal government giving them money in the first place?  Cut it all.",
            "score": -3,
            "replies": [
                {
                    "author": "CarmeloManning",
                    "body": "Downvoted for saying a Libertarian perspective on the Libertarian subreddit.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "bobbabson",
            "body": "Is he talking about the Israeli boycott that a bunch of states are trying to make illegal?",
            "score": 0,
            "replies": []
        },
        {
            "author": "Loominardy",
            "body": "How about we just stop funding period.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Practical-Ad3362",
            "body": "A protest comprised of illegal immigrants?",
            "score": 0,
            "replies": []
        },
        {
            "author": "I_am_normal_I_swear",
            "body": "Anything that violates the NAP. Full stop.",
            "score": 0,
            "replies": []
        },
        {
            "author": "volatilegx",
            "body": "Only protests that call for violence should be illegal.",
            "score": 0,
            "replies": []
        },
        {
            "author": "kiblick",
            "body": "Didn't you guys buy guns for this problem?",
            "score": 0,
            "replies": []
        },
        {
            "author": "GlryX",
            "body": "Trying to figure this out myself. Disappointed to see such seemingly blatantly anti free speech rhetoric from the admin.",
            "score": 0,
            "replies": []
        },
        {
            "author": "IllegalMiner",
            "body": "Antisemitic protests against Israel and their land development amongst their neighbors",
            "score": 0,
            "replies": []
        },
        {
            "author": "thesepigswillplay",
            "body": "The dude is fully unhinged and in a full trip. Someone seriously needs to do something, if anything can be done.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Helpful_Finger_4854",
            "body": "I think it's a poor choice of words for \"riot\" but who knows 🤷🏻‍♂️",
            "score": -1,
            "replies": []
        },
        {
            "author": "Solgiest",
            "body": "you cannot be a serious libertarian and support Trump.",
            "score": -3,
            "replies": []
        },
        {
            "author": "AshingiiAshuaa",
            "body": "Super based.  You don't get to perform otherwise illegal acts under the cover of \"protesting\".  Non-violent, non-destructive, gatherings and messages on public property while not significantly or unnecessarily blocking the free movement of others is 100% kosher.\n\nI don't like the mask call at all.  You have no right to see someone's face any more than you have the right to see their legs or boobs.",
            "score": -3,
            "replies": []
        },
        {
            "author": "pile_of_bees",
            "body": "I can’t tell if this is just some gotcha post but it should be incredibly obvious that many protests are in fact unlawful in nature…",
            "score": -1,
            "replies": [
                {
                    "author": "stevovon",
                    "body": "How are many protests unlawful? I understand maybe where you’re coming from with the idea that these “mostly peaceful” protests have been anything but, and there’s been a bunch of crime, but the actual act of gathering a protest cannot be illegal unless of course they aren’t on public property or whatever but then again, that’s just regular old crime.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "pile_of_bees",
                            "body": "A protest could be unlawful if, for example, it blocked a major interstate for several hours without a permit. Just an example",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "stevovon",
                                    "body": "Sure but that’s a criminal act. You can tack on protest too but at the end of the day you break the law you get in trouble. A protest should not be illegal just because someone feels like saying it is I guess is my point and trumps tweet is poorly worded or worrying.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "pile_of_bees",
                                            "body": "Sure. A more recent example would be pro Palestine protestors blocking Jewish students from attending class. If the university supports and enables this behavior, the university might now face financial consequences.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "stevovon",
                                                    "body": "I mean yeah I agree the law should be upheld. Just think this was a poor choice of words.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ixxmeyo",
            "body": "“Lawful protesting includes holding signs, talking with others, and staying out of the road (unless the protests organizer has gained permission to march in the road – this frequently involves a police escort). Unlawful protesting includes breaking the law, destruction of property and lighting fires.” - Go Ogle",
            "score": -1,
            "replies": []
        },
        {
            "author": "Helpful_Finger_4854",
            "body": "Bad bot",
            "score": -5,
            "replies": [
                {
                    "author": "stevovon",
                    "body": "Lol",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}