{
    "title": "Do I need to read all three Volumes of Theories of Surplus Value?",
    "author": "Anamazingmate",
    "subreddit": "Marxism",
    "rank": 386,
    "score": 3,
    "upvote_ratio": 0.64,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.reddit.com/r/Marxism/comments/1f4rjv8/do_i_need_to_read_all_three_volumes_of_theories/",
    "id": "1f4rjv8",
    "selftext": "I have read Wealth of Nations, Say’s Treatise on Political Economy, and Ricardo’s Principles of Political Economy. I am currently reading through volume one of capital and plan on finishing all three, and I also plan on reading/ studying Keynes’s General Theory of Employment, Interest, and Money; I have been studying these works closely, taking notes and doing supplementary research.\n\nFor a bit of context, I have been doing all this to prepare for Shaikh’s Capitalism: Competition, Conflicts and Crises. He proposes an alternative perspective on political economy from the mainstream and I want to be prepared to conduct a thorough critical analysis of his rather lengthy tome.\n\nI want to ask if it is worth reading all three volumes of Marx’s Theories of Surplus Value. I have read in certain places that these volumes were meant to be, or at least partly make up, his 4 and/or fifth unfinished volumes of Capital, but I want to know if there is anything novel in these books in regards to Marxian political economy such that they are worth adding to my study.",
    "comments": [
        {
            "author": "C_Plot",
            "body": "Don’t forget the _Grundrisse_. \n\nIt is not so much about how much you have read. More important is what you have gleaned from the reading. The _Grundrisse_ and _Theories of Surplus Value_ are sometimes considered earlier drafts of _Capital_. _Theories of Surplus Value_ also represents a detour into prior theories of surplus value which Marx explores to do further research for _Capital_. It is largely his notes from reading others who came before him (with quoted passages) that delineate the contours of debates in political economy. _Theories of Surplus Value_ Can be read like an encyclopedia, where you read specific sections (articles) on the topic that interests you. Or you can read it linearly like _Capital_. It certainly provides greater insights into _Capital_. \n\nSome (for example, Enrique Dussel) have designated (I believe) four or five drafts of _Capital_  You will find other of those drafts in Marx’s collected works.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Haruspex12",
            "body": "If you are going to read Keynes, you should first read Jevons *A General Mathematical Theory of Political Economy.*. You should also read Irving Fisher’s *The Theory of Interest.* And, you should read *Value and Capital,* by JR Hicks. It is written just after Keynes *General Theory,* but it becomes the dominant microeconomic view of the time as Keynes was for macroeconomics. \n\nJevons splits the world of economic thought along with Menger, Walras and Pareto. It begins the split between the marginalists and classical economics. \n\nBecause Keynes and Hicks are living concurrently with the geneticist Ronald Fisher and the Great Depression is happening, it completes the split and begins true empirical economics. Although numerical economics had already begun, the book on methods by Fisher caused an explosion of testing. \n\nSo once you get past Hicks and Keynes everything gets really complicated because for the first time, people are actually looking at economic ideas and using nature to test them. \n\nYou can actually ask what parts of Ricardo are correct and which parts are wrong. Fisher invented the null hypothesis and the no effect hypothesis. \n\nFisher, in 1929, believes that Darwin’s idea of genetics in *Origin of the Species* is wrong and that an obscure scientist, Mendel, is correct. \n\nSo what Fisher does is apply modus tollens to statistical methods. He assumed that only Mendel is wrong and that some other hypothesis is correct. The null is falsified, implying that Mendel got it correct and the others were wrong. \n\nSo, getting back to your original question, should you read all the volumes, the answer depends on why you are reading them. \n\nIf you are reading them like an historian, and trying to understand the development of thought, then, I would say yes you should. If you want to find out what survives in future thinking, I would find a commentary on it and read the sections important to the commentator. \n\nLots of the 19th century was correct, but Darwin got things wrong. Should someone read his books, yes. Should they treat them as correct, no. Parts are, parts are not. Indeed, much of the work I do comes from the 17th century mathematician, Maria Agnesi. She also invented the first textbook and the field of integral equations. Do I ignore everything after her? No. \n\nSo, if you want to know the history, read it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Techno_Femme",
            "body": "im critical of the Neoricardian interpretations of Marx by Shaikh or Sraffa (Sraffa is where Keynes gets a lot of his stuff) that you're starting from. I think you'll come to a lot of wrong conclusions even going through all 3 volumes of Capital, the Contribution, the Grundrisse, and ToSV. Here's a good article on where different interpretations of Capital come from, what their problem is, and what a better reading is:\n\n http://digamo.free.fr/elson79-.pdf",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 0,
            "replies": [
                {
                    "author": "FluidChameleon",
                    "body": "You seem to have somehow missed the fact that “Theories of Surplus Value” is the title of a major multi-volume book by Marx, and the OP is asking if they should read that book",
                    "score": 4,
                    "replies": []
                }
            ]
        }
    ]
}