{
    "title": "What is the difference between a slave economy and a capitalist economy with slaves?",
    "author": "Lastrevio",
    "subreddit": "Marxism",
    "rank": 353,
    "score": 30,
    "upvote_ratio": 0.85,
    "num_comments (reported by reddit)": 18,
    "url": "https://www.reddit.com/r/Marxism/comments/1fmv09t/what_is_the_difference_between_a_slave_economy/",
    "id": "1fmv09t",
    "selftext": "Karl Marx described the \"slave economies\" of Ancient Rome and Ancient Greece as one specific historical mode of production, preceded by Neolithic economies and succeeded by feudalism. However, slaves existed in other modes of production as well, such as in capitalism. For example, in America in the 1800's it was legal to own slaves, even though the economic system they lived in was capitalism.\n\nGiven this, what is the difference between a slave economy and a capitalist or feudalist economy in which people also hold slaves?",
    "comments": [
        {
            "author": "Techno_Femme",
            "body": "this is about the difference between a mode of production and a specific labor relation. Generally, modes of productions will have a certain type of labor relation associated with them. Ancient society has slavery as the general labor relation, feudalism has serfdom as the general labor relation, and capitalism has wage labor. \n\nHowever, different labor relations can exist and even thrive in different modes of production. As an example, wage labor was very common during periods in ancient greece for seasonal agricultural work. The labor relations alone are not what make up a mode of production. This is a mistake that people who get really into co-ops often make. \n\nInstead, a mode of production is defined by the labor relations (vertical and horizontal), the property relations, and (in the case of capitalism) the law of value. \n\nSo the difference between the ancient mode of production and the slave economies of Brazil and the US South would be\n\n1. in the US and Brazil, property is private and saleable while in ancient greece and rome, it is generally personal inhereted estates.\n\n2. in the US and Brazil, slaves are used to farm cash crops for sale on the market while in ancient greece and rome, they are used for more personal tasks. There is not, in ancient greece and rome, a largescale social need to make more profit to then reinvest and grow a business",
            "score": 35,
            "replies": [
                {
                    "author": "LeftismIsRight",
                    "body": "Thank you for mentioning the law of value. There are so many ML’s these days, as well as coop supporters, market socialists, and the like who seem to think The Law of Value is not an important defining feature of the Capitalist mode of production.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "adjective_noun_umber",
                    "body": ">  The labor relations alone are not what make up a mode of production. This is a mistake that people who get really into co-ops often make.\n\n\nCan you provide more information on the oversights of co ops?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Techno_Femme",
                            "body": "A common mistake people make is to assume that Marx's main problem with capitalism is that workers have surplus value stolen from them and that this is morally wrong. Co-ops would indeed solve this problem since the surplus would be directed by the workers themselves. But Marx doesn't actually think this at all. We can see this in Chapter 10 (The Working Day) of Capital Vol. 1 where he says:\n\n>\"We see then, that, apart from extremely elastic bounds, the nature of the exchange of commodities itself imposes no limit to the working day, no limit to surplus labour. The capitalist maintains his rights as a purchaser when he tries to make the working day as long as possible, and to make, whenever possible, two working days out of one. On the other hand, the peculiar nature of the commodity sold implies a limit to its consumption by the purchaser, and the labourer maintains his right as seller when he wishes to reduce the working day to one of definite normal duration. There is here, therefore, an antinomy, right against right, both equally bearing the seal of the law of exchanges. Between equal rights force decides.\"\n\nFor Marx, both the capitalist and the laborer have a valid claim to surplus-value. The fight over surplus value is just the battlefield on which the structural problems of Capitalism manifest themselves. Co-ops are treating a symptom and not the disease. \n\nFor Marx, the root problem of capitalism is the profit motive and its inability to account for externalities like the environment and its tendency to evade all attempts to limit it by government or convention. An example of this in my own life: I'm a bus driver and pretty regularly work 13-14 hour days. I've even worked a few 15-16 hour days. This is illegal and probably unsafe. But I need the OT money. So do all my coworkers. So we all do it. And we are a unionized workplace that pays decently well. Labor law cannot easily limit the pressure of the market. If the job were a co-op, this problem would still exist. \n\nMarx's rival and co-founder of the SPD, Ferdinand Lassalle, pushed a program of co-ops. Lassalle thought that if workers fought for wage increases, the market would just raise prices and real wages would remain the same. Instead, he wanted to elect officials to office who would fight to make legislation favorable to creating co-ops. Marx vehemently opposed this because he believed the fight for higher wages was necessary for workers developing class consciousness and that the state organizing or subsidizing co-ops would rob them of any class conscioisness.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "pharodae",
                                    "body": "Different commenter here; do you have any examples that proves Marx's class consciousness argument against Lassalle? Because I can definitely see the pros and cons of both sides here, but I think there are plenty of avenues of instilling class consciousness that still work synergetically with using the state (even though I am anti-statist) to create more favorable conditions for cooperatives. Especially if the cooperatives were con/federated and creating circular economies and coordinating with mutual aid and community organizing groups.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Techno_Femme",
                                            "body": "I think the entire post-WWII labor compromise where golden handcuffs were slapped on unions is a good example. The New Deal and WWII effectively welded a lot of unions and independent worker civil society to the state. This has lead to no working class base independent from the bourgeoisie that could form a mass working class organization. Only now that unionized workers have the lowest share of jobs compared to the population since the beginning of the Great Depression does socialism come back into popular lexicon for Americans.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[deleted]",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "spookyjim___",
                                                            "body": "> I definitely see what you’re saying. Legislation that benefits coops and unions without the ball and chain of the state is the sweet spot here. \n\nYou do not see what they’re saying",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Schwerg",
            "body": "I think you might want to check out Engels’ “The Origin of the Family, Private Property and the State” for that. In the book, there are three sections on different early states from the history and their relationship to preceding family structures and one of them discuss the democracy in Ancient Greece and how the slavery system brought an end to the first democracy in history. The slavery system outlined for that era is drastically different than what you see in the States in the 19th century, not only in terms of its scope but also for the societal structures that created it.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Cyclamate",
            "body": "The key difference is whether slaves are producing commodities at mass scale for international trade. This is what made the american slave system so uniquely brutal, yet rational, compared to earlier forms of slavery.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Themotionsickphoton",
            "body": " Surplus value is the main difference. In capitalist economies, firms and society as a whole can accumulate vast surplus value over the course of many years.    \n\n\nIn ancient societies, this was much harder, and the drive for accumulating surplus did not (outside of certain occasions of conquest) define the daily economic activities.       \n\n\nThere were still things to store over time,  but most products for accumulation didn't last long (food), were consumer products and so didn't mean much to accumulate endlessly (textiles and housing) or required massive state invention to create (roads, aquaducts). \n\n\nIf ancient societies had the technological ability to rapidly accumulate material wealth, they likely would have just as rapidly transformed into capitalisms. The specific labor relations aren't too important, since as we know, capitalists have no problem exploiting slaves or serfs.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Specialist_Apricot74",
            "body": "Imagine you're a medieval serf harvesting wheat. The Lord of the Lands rides by to collect his share of your harvest, despite the fact that you alone tilled, sowed, and reaped the crop. His sole claim to your wheat stems from his \"ownership\" of the land on which it grew—a entirely passive relationship.\n\nNow, fast-forward to the present day and picture a factory worker manufacturing car parts. While the boss doesn't directly seize a percentage of the finished products, he does pay the worker a wage. This wage, however, represents only a fraction of the worker's total productivity for the day. Although the worker spends their entire shift producing car parts, the boss feels entitled to a substantial portion of that productivity because he \"owns\" the machinery.\n\nUpon closer examination, these two scenarios bear striking similarities:\n\n1. In both cases, the laborer (serf or factory worker) performs all the actual work.\n2. The authority figure (lord or boss) claims a significant portion of the output based solely on ownership of the means of production (land or machinery).\n3. The laborer is left with just enough to survive: the serf retains barely enough wheat to avoid starvation, while the worker receives a wage that covers basic living expenses.\n\nThis comparison illustrates how modern wage labor, despite its apparent differences, shares fundamental characteristics with feudal economic structures. In both systems, those who control the means of production extract value from the labor of others, while providing only the minimum necessary for the workers' survival and continued productivity.\n\n  \ntldr; we are all living in advanced serfdom.",
            "score": 1,
            "replies": []
        },
        {
            "author": "manulinrocks",
            "body": "Capitalist production is defined by the extraction of relative surplus value from free wage labor. If that's not happening it's a form of non capitalist production. Afaik it's very popular in current US historiography to see the exploitation of slave labor as capitalist but that's a use of the term within a conceptual structure which is completely different from Marx's. Arguably the US South remained partly defined by non capitalist production relations not only prior to Emancipation but long after considering the persistence of bonded labor in various forms. It was part of a social structure dominated by capitalist production but much production was carried out within non capitalist processes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "makhnovite",
            "body": "Wage labour has existed in other modes of production while slavery and landed wealth continue to exist under capitalism. There difference is that under capitalism wage labour is the dominant relation of production, wealth accumulation is expressed in the form of private capital and capitalists hold political power, making this a capitalist mode of production.",
            "score": 1,
            "replies": []
        },
        {
            "author": "coolgobyfish",
            "body": "Slaves are not practical (too expensive) for capitalims. That's why we dont see them being used.  You have to buy them (ver expensive upfront cost),  feed them, cloth them, provide housing, security (so they dont run away).  Worst of all, you have do all that even if you don't use them (days off, off season).  Its always cheaper to rent labor for specific tasks.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Swerzye",
            "body": "A capitalist economy is one where the abstraction of capital is enforced upon the inhabits of a state (whereby the sellers of their labor have the capital character which is representative (through coercion) of the amount of money which was sufficient for them to engage in a process which gives an object rise is appropriated by the owners of the means of production, with this tautological surplus then manifesting as profit). Slavery as a form of economy preceded the abstraction of capital which gives rise to the capitalist states we observe today (even though it’s still a system which has as a necessary precondition the accumulation of definite amounts of surplus labor), and whilst they have been used in conjunction/combination (which would be a capitalist economy with slaves, as the level of development which is presupposed by capitalism in its empirical is that which transcends the material conditions which necessitates the need for slave labor to be occurring at the same level of occurrence as wage-labor) they do not necessarily have to. Also, the difference is something you’re already aware of by virtue of the active division of the terms in the first place, since a disjunction between “slavery” and “(capitalism -> (capitalism • slavery))” only exists in the fact that a properly functioning capitalist nation lays down the foundation which corresponds to the direct, free possibility (due to its contradictions) for slavery to emerge again, while the slave nation specifically limits themselves to just that; slavery (by virtue of what the empirical observation of a strictly slave economy would entail).",
            "score": 1,
            "replies": []
        }
    ]
}