{
    "title": "Baby Marxist",
    "author": "cndtrj",
    "subreddit": "Marxism",
    "rank": 339,
    "score": 53,
    "upvote_ratio": 0.77,
    "num_comments (reported by reddit)": 42,
    "url": "https://www.reddit.com/r/Marxism/comments/1fus051/baby_marxist/",
    "id": "1fus051",
    "selftext": "I am a second-generation immigrant, 20 something year old, woman, in college in the US. I was introduced to marxism through A Revolutionary Life: Che Guevara. I continued through Michael Parenti’s Inventing Reality, and I’m now reading through Jakarta Method. I want to read more into Marxism in order to better understand it and better support my stance on marxism in discourse with my peers. Please help me start my journey into Marxism. ",
    "comments": [
        {
            "author": "ComradeKenten",
            "body": "I would suggest your read:\n\nPrinciples of Communism my Engles as a good primer\n\nSocialism Utopian and Scientific also by\nEngles, will give you a good introduction to diabetical and historical Materialism\n\nWage, Labor and Capital and Value, Price, Profit by Marx, a good basic explanation of a Marxist Economics. Must shorter and easier to understand than capital. So you should probably read this first\n\nState and Revolution by Lenin, it give you a great introduction to the Marxist understanding of the state and it's relation to revolution \n\nImperialism the Highest stage of Capitalism by Lenin, will give you a theoretical understanding of imperialism and it's relation to capitalism, cooperations, and Monopoly. \n\nThis should give you a good foundation for understanding Marxism. Though you will find you will never stop finding more things to read.",
            "score": 26,
            "replies": [
                {
                    "author": "Knarrenheinz666",
                    "body": "Yes, however people without profound knowledge in history, sociology, philosophy and economics should begin with critical editions, otherwise they will misinterpret things based on either missing the context or misunderstanding a lot of terms and thoughts. Like reading Marx without understanding Hegel is pointless.\n\nI always recommend Kolakowski's \"Main Currents of Marxism\". If someone wants to study Marx they should have at least read something like vol. I. While barely one of us agrees with the author's interpretation of later Marxist thinkers vol. I is still a good handbook.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "big8ard86",
            "body": "Princeton University Press just released the first English translation of Marx’s final version of Capital. It’s the last version he personally annotated and updated and is therefore the only authoritative edition.  Edit: this is in regards to English translation. ",
            "score": 15,
            "replies": [
                {
                    "author": "atoolred",
                    "body": "[Here’s the link](https://press.princeton.edu/books/ebook/9780691240466/capital) for anyone else who’s interested! Capital was already next up on my reading list so thanks for mentioning this release",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 7,
            "replies": [
                {
                    "author": "atoolred",
                    "body": "I also recommend S4A’s reading of The Principles of Communism if you choose to go the audiobook route. That was my first reading and I ended up listening twice to make sure I comprehended it. But I also want to start building a physical personal library, I read so chances are I’ll read it again and take notes on my thoughts when I can get a copy",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "millernerd",
            "body": "Something I like to mention is that Marxism is scientific. Marxism is first and foremost an analysis of capital(ism) in large part because capital existed in Marx's time to scientifically analyze. Everything else is an extension from that. Don't cling too heavily about what Marx and Engels (and even Lenin to an extent) said about what socialism/communism could/should/would be because it didn't exist for them to analyze. That doesn't mean those analyses are valueless, but still. \n\nI see too many people (especially online) claim things like \"they didn't do socialism right\" or \"that wasn't even socialism\" because it doesn't match the written word of dead old white men. It's the equivalent of rejecting data in favor of the hypothesis.\n\nWe understand where we are and how we got here so we can work towards the next step. We do not look at where we want to be and work backwards from there. To me, that's the difference between scientific and utopian socialism.",
            "score": 13,
            "replies": [
                {
                    "author": "malershoe",
                    "body": "How stupid to reject Marx and Engels and Lenin because they were white/were born too early! Marx and Engels *did* see socialist revolutions in their own lifetimes, they spent a great deal of effort explaining the failures of these movements and directing the workers' movement in such a way as to avoid those pitfalls. \n\nThe vast majority of socialist organisations in the world, throughout history but especially today, are shamelessly revisionist. This certainly includes the representatives of so-called \"real socialism\". Why do you deny this? Do you think that the failure of real socialism (and it certainly was exactly that: a *failure*) means that the prospects of proletarian revolution have been destroyed for good? The fact that you have to redefine the word \"communism\" to match the existing state of things says less about the regimes you describe and more about your lack of faith in the true, intransigent facts and demands of the communist movement. Rest assured, the socialist parties today have as much to do with socialism as the so-called \"national socialists\" (or, more to the point, the \"social democrats\"). Your \"scientific\" socialism is nothing more than a *rejection of socialism*.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "CriticalFearist",
            "body": "I highly recommend China Mieville’s “A Specter, Haunting.” It’s a really thorough examination of the Communist Manifesto. About all the ways it’s still relevant today, all the various criticisms (good and bad) of it. I really loved it. I read it recently, and I can’t say enough good things about it. You may want to re-read the manifesto first, if it’s been a while.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Techno_Femme",
            "body": "i highly suggest Mute Compulsion by Søren Mau! It has a lot of great citations of other works and if you follow those citations, you'll be set up for a lot!\n\nI also obviously recommend reading Marx and Engels. A good work to start with is Engels' Anti-Dühring. After that, I recommend Poverty of Philosophy. After that, I recommend the 18th Brumaire of Louis Bonaparte. Then Value, Price, and Profit. After that, you should be ready for the 3 volumes of Capital. \n\nIf you're having trouble, Michael Heinrich's *An Introduction to the Three Volumes of Marx's Capital* is solid for beginners. \n\nIf you're interested more on the specifics of modern day capitalism and things more directly relevant to you, I suggest *Hinterland* by Phil A Neel, *The Next Shift* by Gabriel Winant, and *Endnotes Vol 2-3*.",
            "score": 3,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 4,
            "replies": []
        },
        {
            "author": "Mt_Incorporated",
            "body": "Read the basics. Das Kapital  (in your language of course) and the The communist manifesto.  I myself started with the communist manifesto, but was pretty much Marxist my entire life somehow lol. I am now reading Rosa Luxemburg's \"Reform or Revolution\" (which is the ideology most  EU leftist political parties are following) and also the collected works of Karl Marx.\n\nI would also recommend you to read anything by Angela Davis, especially \"Women, Race and Class\".\n\nGramsci is also another classic.\n\nI would also recommend you to read things that are not necessarily theory, you could read up on more history of Marxist groups in the US, The Red Scare, Domino Theory, McCarthyism etc. to reflect on what the US did within and outside of its borders. \n\nYou can also read and reflect works of fiction where the author has been a leftist and or Marxist. \n\nThere are also so many other disciplines and fields of science influenced by Marxism, which however can be difficult if your outside of this study.",
            "score": 5,
            "replies": []
        },
        {
            "author": "None",
            "body": "This is a recommendation I don't hear many people give, but Joseph Stalin's \"Dialectical and Historical Materialism\" perfectly sums up the philosophical method behind all marxist theory. It's written to be easy to pick up for beginners, so I usually tell people to check that out. \n\nAfter that I usually direct people to the Anti-Imperialism Movement's basic study guide (found [here](https://old.reddit.com/r/communism/comments/wisiw/basic_marxismleninism_study_plan/)) Then go from there! Keep studying, or pick up a flag and join a party!",
            "score": 4,
            "replies": []
        },
        {
            "author": "AndNowWinThePeace",
            "body": "Foreign Languages Press have the PDF copy of the Communist Party of India (Maoist)'s basic course online for free (as well as every other book they publish.\n\nIt's a hefty read to jump into, but for a comprehensive understanding of at least mainline anti-revisionist Marxism-Leninism it's a great resource. It spends a lot of time explaining the essential Marxist analysis before moving onto Lenin and Mao.\n\nTheir books are also pretty cheap if you like physical copies.\n\nhttps://foreignlanguages.press/colorful-classics/marxism-leninism-maoism-basic-course-english/",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": []
        },
        {
            "author": "Joventimax",
            "body": "I highly recommend the Spotify playlist by James Ray titled: So You Haven't Radicalized Yet. Great podcast episodes to go over basic theory and jump into historical case studies of different revolutionary projects in different places and time periods. Nice for car rides or while doing chores.\n\nAs far as books go, Frantz Fanon's Wretched of the Earth is very relevant to the Palestinian struggle today in how it dissects neo-colonialism. I believe a few chapters are covered on the Red Menace podcast which are on that playlist I mentioned above.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SuddenXxdeathxx",
            "body": "Provided you are ok with podcasts, I have a suggestion out of left field here if you find that the offered texts are too difficult for a first timer.\n\nEpisodes 10.3 and 10.4 of the Revolutions podcast by Mike Duncan are both weirdly good primers to Marxism from a non-Marxist. Presented in a \"matter of fact\" manner with little commentary.\n\nThe biggest issue I believe most Marxists would have with these episodes, because I took issue with it too, is some of the only commentary Mike makes near the end of 10.3 about Marx's theory of value being \"part wrong\". So if you do listen to it, know that everything he says about the theory of value after \"So, is any of this true?\" Should be ignored. He doesn't even offer a real explanation why so it's of no loss to ignore.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mr_Skeltal64",
            "body": "I recommend only one book, and it's a relatively easy read. \n\nSocialism: Past & Future, by Michael Harrington. \n\nI also suggest you heavily doubt those who supports Leninism, Stalin, or Mao. Lenin was at least well intentioned, imo, but he also genuinely believed that the proletariat is too incompetent to achieve socialism without a benevolent autocracy (a transitional government) to guide them to it. Stalin and Mao were just fascists misusing the name of communism to gaslight the workers into subservience under the pretense of a \"greater cause\". \n\nReading their works is fine, of course. Form your own opinions. Just be careful not to believe everything you read, because a persuasive and intelligent author is, well, very persuasive. And although Marx himself was an important figure in the development and rise of Communism, many would argue that his ideas are antiquated or even fundamentally flawed. \n\n\\[Disclaimer: I'm a democratic socialist and this comment is a psyop to deconvert tankies\\]",
            "score": 1,
            "replies": []
        }
    ]
}