{
    "title": "Communism in Europe post World War 2",
    "author": "cavslee11",
    "subreddit": "Marxism",
    "rank": 330,
    "score": 15,
    "upvote_ratio": 0.82,
    "num_comments (reported by reddit)": 19,
    "url": "https://www.reddit.com/r/Marxism/comments/1g2jvyt/communism_in_europe_post_world_war_2/",
    "id": "1g2jvyt",
    "selftext": "Fair warning, I’m a newbie to Marxism lol. I recently finished The Communist Manifesto and am currently working my way through Engels’s Principles of Communism. I randomly came across an unexpected book, How We Survived Communism and Even Laughed by Slavenka Drakulić, at a bookstore and bought it on a whim shortly after finishing the Manifesto. Drakulić is a decently well known/respected writer, mainly focusing on feminism and post communism, born in Croatia in 1949. I’ve been really engrossed in the book and it illustrates some pretty decent points against the Communist Governments in place at the time.\n\n\nWhat I’ve been trying to figure out is, were these societies truly Communist societies? Did they strictly abide by the principles of Marxism? Any information on the Communist governments/movements at the time or resources I could use to learn about them would be extremely helpful. ",
    "comments": [
        {
            "author": "Techno_Femme",
            "body": "So, Marx does describe what communism would look like vaguely\n\n>\"For as soon as the distribution of labour comes into being, each man has a particular, exclusive sphere of activity, which is forced upon him and from which he cannot escape. He is a hunter, a fisherman, a herdsman, or a critical critic, and must remain so if he does not want to lose his means of livelihood; while in communist society, where nobody has one exclusive sphere of activity but each can become accomplished in any branch he wishes, society regulates the general production and thus makes it possible for me to do one thing today and another tomorrow, to hunt in the morning, fish in the afternoon, rear cattle in the evening, criticise after dinner, just as I have a mind, without ever becoming hunter, fisherman, herdsman or critic.\"\n\n-Marx, The German Ideology\n\nWhat we see here is a breaking down of the division of labor with the breaking down of class. Basically, people have free time to do whatever they want. \n\nMarx moderates this later in his life to say that people would probably need some amount of specialization and might need to work a sort-of \"job\" for a few hours a week. He's very vague on what exactly that would look like, though. \n\nWhy all the vagueness? \n\nWell, Marx believed communism wasn't a set of ideals to he attained. Instead, it was the result of a historical process. Since he couldn't predict all the particulars of the historical process, he didn't want to make too many claims about what communism would look like. \n\nA favorite article of mine that really tries to get at what communism might look like is [Forest and Factory](https://endnotes.org.uk/posts/forest-and-factory) by Phil A. Neel and Nick Chavez. Very beginner friendly IMO. Reads like a sci-fi novel at points. \n\n>\"But, again, it is extremely difficult to predict exactly what even seemingly straightforward activities such as manufacturing a certain good might look like within communist society because the current technical methods for producing any given artifact are inextricably bound to standards of \"efficiency\" (of profit, labor discipline, etc.) that express distinctly capitalist imperatives. These imperatives often seem to take on a sort of malicious agency in our lives. Bordiga describes industrial fixed capital as \"the enemy Monster that hangs over the mass of producers,\" monopolizing the collective knowledge of the human species such that \"this Monster is killing science itself, misgoverning it, criminally exploiting its fruits, squandering the heritage of future generations.\" Even if scientific knowledge is key to the future of communism, then, the forces of production are not a neutral algorithmic apparatus that can be simply seized and run for better ends—they are the literal embodiment of the Monster that stands against us.\"\n\nSo it's hard to predict, basically. We can only speculate, to a certain degree. \n\nSo the USSR was not \"communist\" in the sense that Marx meant. What was it?\n\nThis is a very contentious topic in leftist circles, so let me give you a few different points of view:\n\n**View 1: The USSR was socialism, the early stage of a communist society**\n\nThis is generally a defensist view of the USSR (or believed by anti-socialists). Basically, Marx says that communism will require a transition period. The defensists say that the transition period is socialism and the USSR got stuck in transition because of capitalist countries undermining it. For these people, socialism is essentially synonymous with the Dictatorship of the Proletariat.\n\nFull disclosure, I don't agree with this. The best presentation of it is probably by Dominic Losurdo. \n\n**View 2: The USSR was a lapsed Dictatorship of the Proletariat**\n\nThese people tend to be supportive of the USSR but more critical. They believe that building communism needs a transitional phase but that the transitional phase isn't socialism. Instead, the Dictatorship of the Proletariat is a period where the proletariat controls capitalism as it transitions into socialism. Socialism is the early days of communism and is just called \"communism\" once you get to the higher phase. The difference between the \"lower\" and \"higher\" phases of socialism/communism for these people revolves around \"bourgeois right\" or the expectation for workers to be directly compensated for their work instead of indirectly compensated through the maintenance of society.\n\nSo the USSR was a DotP but the power of the proletariat lapsed and instead a party bureaucracy took control. They thought that if you could kick out some of these bureaucrats that they workers would reexert their power. \n\nThis represents the view of Trotsky. \n\n**View 3: The USSR was State-Capitalist**\n\nThis view isn't exclusive with the previous one but its proponents tend to be equally against the USSR and other capitalist countries, as they perceive it. In this view, the state has taken on the roll of the capitalists, exploiting the workers in the USSR. These people tend to think a new revolution was needed to establish a true DotP in the USSR. Some believe the DotP was defeated in 1921, some in 1928, some in 1936, some think it never existed. \n\nIMO the best version of this theory comes from Raya Dunayevskaya but dozens of other versions exist.\n\n**View 4: The USSR was neither capitalist nor socialist but a secret third thing**\n\nThis is a more niche perspective and also has a lot of different versions. One is the \"bureaucratic despotism\" theory, another the \"non-mode of production\" theory and there are half a dozen \"new class\" theories along this line. \n\nI'm personally sympathetic to the theories of Hillel Ticktin who outlines how the USSR produces an increasing amount of waste throughout its supply chains that would cause shortages of consumer goods. \n\nMy views would probably be a combo of Dunayevskaya, Ticktin, and Bordiga (who compared the USSR to the merchantilist economies of early capitalism).\n\nBut I'm happy to recommend you work on any of these POVs.",
            "score": 9,
            "replies": []
        },
        {
            "author": "PompeyCheezus",
            "body": "As the other commenter pointed out, there are no specific principles of a \"Marxist\" society but I think another thing to keep in mind is that these states had to exist in the real world.\n\nIf Lenin had seized the Tsarist government and immediately dissolved it and declared a classless, stateless society, the Whites or the Germans or the US would have stepped in and immediately put everyone back into serfdom. \n\nIf Stalin hadn't betrayed the workers and destroyed the soviets to industrialize faster, you can't even imagine how many Russians would have died at the hands of the Nazis.\n\nIf China hadn't opened the markets up in the 70s, they would likely be much much farther behind developmentally, perhaps even still a primarily agrarian economy.\n\nNow you can argue any or all of these were the wrong decisions but they were decisions people were forced to make in the real world under less than ideal conditions. Sometimes, standing by that rigid set of principles will take you backwards, not forwards in your goal of liberating the working class. \n\nThat's why people will still, to this day, defend the Soviet Union. The better approach, in my opinion though, is to look at historical attempts at socialism, acknowledge the good and learn from the bad. We shouldn't lionize the USSR and absolve it of the many mistakes it made but neither should we throw the whole thing out and declare it not *real* socialism.",
            "score": 14,
            "replies": [
                {
                    "author": "GeistTransformation1",
                    "body": ">declared a classless, stateless society, the Whites or the Germans or the US would have stepped in and immediately put everyone back into serfdom. \n\nThe problem with declaring such a thing isn't that foreign states would react negatively to it but that it would be an ultra-leftist error to declare the abolition of class division when it hasn't actually been abolished, the problem with ultra-leftism is that it ignores where class struggle is taking place and the level of its development, thus it hinders the ability of communist parties to make interventions in these struggles, causing a regression into rightism which is the actual essence of ultra-leftism.\n\nThe rest of your comment is nonsense that I can't be bothered to explain, the quality of this subreddit is rather poor",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "RantsOLot",
                    "body": "So wait, did Stalin destroy the Soviets? Didn't the Soviets remain a part of the USSR until its dissolution? I can understand that Stalin may have suspended or restricted the Soviets under a State of Emergency in the lead-up to ww2 but did he *destroy* them? ",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "JonnyBadFox",
            "body": "Marx doesn't have principles for a new society. He wrote very little about what communism should be. Actually he was later critizised by some because he didn't invent his own alternative of capitalism. He was a theoretician of capitalism and a philosopher.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Leogis",
            "body": "There is a lazy answer to that: \n\nThese societies didnt fit any of the criteria in the definition of communism:\n\n- it had money \n- it had classes \n- means of production were owned by state owned companies \n\nBut the less lazy answer would be that Marx & Engels mentionned that absolute state power was a Bad idea so you could Say these societies werent even marxist",
            "score": -2,
            "replies": [
                {
                    "author": "None",
                    "body": "Marx and Engels never criticized \"absolute state power\", that was Bakunin's thing. However Marx did value the concept of freedom: \"the free development of each is the condition for the free development of all\".",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Leogis",
                            "body": "Marx and Engels very much did, there is a 40min video on YouTube called \"Marx Wasnt a statist\".\n\nIf you're too lazy to watch it i could go get the quotes myself but that would be very annoying",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "I don't think he was really statist \\*or\\* anti-statist, his views on the state were too complex and varied throughout his career to sum up like that. Fwiw I respect both anarchism and Marxism",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Leogis",
                                            "body": "His view on the state is almost the same as the anarchists, just a little less extreme \n\nThe whole \"we agree on the destination but not on the path to follow\" discourse is nonsense,\n\nI think it's in \"the civil War in France\" that Marx said the \"dictatorship of the proletariat\" should be a \"decentralised group of self managed commune and the army replaced by worker millicia\"\n\nThis is way Closer to (if not the same thing as) anarchism than to statism.\n\nIf he isnt flat out \"anti statist\" he's like 95% against the state",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Independent_Fox4675",
                                                    "body": "Engel's viewed it as necessary ot seize state power in order to achieve socialism, read \"on authority\", he definitely wasn't an anarchist. Marx tmk didn't write much on the issue",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Leogis",
                                                            "body": "I did, this text isnt very interesting. It doesnt prove anything the authority fans think it does.\nEither Engels didnt understand anarchy or it's the ones he was replying to that didnt. Or he simply wasnt talking with anarchists at all.\nEither way, what he replies to isnt the anarchist point of view. (See bakunin's text on authority if you want their actual point of view)\n\nAlso \"Seizing state power\" doesnt mean the state power in question is absolute and also doesnt mean it has to remain that way.\n\nAnyways, this text is out of context and not very useful.\n\nMeanwhile Engels said things like \"given the chances, people in power will Always end up persuing their own interest\". Wich you naturally bring you to the conclusion that he wouldnt be supporting a bureaucracy with absolute state power...\n\nAnd Marx wrote something along the lines of \"the paris commune showed us that the working class cannot seize the state power for it's own purpose and that the state has to be replaced by a group of communes\" in \"civil War in France\"",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}