{
    "title": "About Surplus Value",
    "author": "ScreenageAngst",
    "subreddit": "Marxism",
    "rank": 251,
    "score": 10,
    "upvote_ratio": 0.86,
    "num_comments (reported by reddit)": 14,
    "url": "https://www.reddit.com/r/Marxism/comments/1h29v3u/about_surplus_value/",
    "id": "1h29v3u",
    "selftext": "So, I am trying to better understand the concept of surplus value. Would this example be accurate:\n\nIf: I work at a pizzeria and get paid $16 an hour for my labor yet every hour I make a few $20 pizzas (I'm producing $40-$60 an hour) yet only being compensated $16 an hour. Is that my surplus value?",
    "comments": [
        {
            "author": "GeologistOld1265",
            "body": "Yes and No. If you make 2 pizzas and sold then for 40. Then surplus is 40 - capitalist expenses - your salary.\n\nThat is a surplus your employer get. That is Volume 1 of Capital.\n\nBut there are V2 and V3. Additional surplus will be extracted from you try taxes ( in some cases, some time you get services for that, not in USA) and try market. You will pay rent and interests, some of that become surpluses of other capitalists. You will pay monopoly prices, which is surplus of monopolies. And so on...\n\nIn reality, surplus extracted from you is much higher.",
            "score": 11,
            "replies": []
        },
        {
            "author": "Bolshivik90",
            "body": "No. Other way round. If you get paid $16 in an hour but produce $60 worth of value in that hour, the surplus value is the $44 you produced but which went straight to your boss, not you. You as a worker don't get any surplus value. Surplus value is the value you produce with your labour which you don't get paid for.\n\nEdit: This is why Marx said profit is the unpaid wages of the working class. Because it literally is. As soon as your wages are met with what you produce, you are basically working for free for the rest of the day.",
            "score": 6,
            "replies": []
        },
        {
            "author": "thesameboringperson",
            "body": "As others explained, you're surplus value is extracted from you via different means.\n\nIt boils down to the difference between the hours you worked and the accumulated hours of others' work that you are able to consume.\n\nSo, even if you are paid a \"fair\" amount (i e. leaving no profit for your employer), the prices you pay for many items or services are not and you have to pay taxes. The taxes could be well invested for the public good, so it would arguably come back to you, but not the economic rent (monopoly prices, etc.). Also, your employer needs to pay economic rent too or interests, so even the \"fair\" wage wouldn't be, it's just that the banker or supplier to your employer will be getting your surplus instead of them.",
            "score": 2,
            "replies": []
        },
        {
            "author": "JonnyBadFox",
            "body": "Would be easier to look at your monthly wages. Then you can count how much pizzas you made and for what they sell. Then subtract your wage from the worth of all the pizzas you made and you got the surplus that goes to your boss.",
            "score": 2,
            "replies": []
        },
        {
            "author": "C_Plot",
            "body": "The pizzas also involve constant capital. The laborer then takes the means of production (instruments of labor and raw materials), purchases with a sum of constant capital money. The countertop, the mixing bowl, and the pizza oven are the instruments of labor. Let’s say, all together, they depreciate with each pizza by $1.  Then you make a pizza with raw materials: electrical energy, methane gas energy, … flour, water, salt… tomatoes, cheese…—all together $9 in raw materials per pizza. Many of the centuries neglect this constant capital and misunderstand the capital process.\n\nLet’s say you make only three pizzas per hour, working with basal skill (=1), and with normal exertion intensity (also =1). Each hour you diligently labor and thus conserve the value of the means of production consumed  (productive consumption) and transferring that $10 in value from the means of production to the new pizzas you provide. Simultaneously, while transferring the value from the means of production, you also perform living labor: SNLT equal to 1hr × skill of 1 × exertion intensity of 1 = 1 hour of SNLT which given the measure of value of money in the present conditions (in other words, the exchange-value of money or what contemporary Marxists call the monetary expression of labor time), that one hour of SNLT measures as $30 of value (congealed SNLT). In one hour you transfer $30 in embodied labor from the means of production and add $30 in net value to the finished pizzas. The three pizzas then embody $60 in value. \n\nYour wage is $16 per hour, but you added net value of $30 each hour. Your surplus value each hour is thus $14 (a rate of exploitation, s/v, of 7/8 = 0.875).  32 minutes each hour you work for yourself and 28 minutes each hour you work for your capitalist exploiter—you’re only making three pizzas per hour after all (or if it is a worker coöperative commercial communist enterprise, you work 28 minutes for the collective of workers—who distribute the surplus to secure the conditions of existence for the enterprise: natural resource rents, accumulation, taxes, security, advertising, marketing, legal services, accounting services, insurance for various risks, and so forth). \n\nThe pizzas embody $60 in value regardless of the price for which they sell. Each pizza night sell for $18 or else $22 in money value. Yet that does not change the fact that the pizzas embody $20 in value each. When the value paid (the price) differs from the value embodied, not only do the qualitative use-values exchange (money and pizza), but some value ($2 in this example) is also distributed between seller and buyer (or buyer and seller). The profits of the selling enterprise (and also the buying enterprise, if the buyer is an enterprise) diminish or increase because of this distribution through exchange.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AHDarling",
            "body": "If you get paid $16 an hour and make four $20 pizzas, $16 is the profit and you've just covered the cost of your labor for that hour. If you make any more than four $20 pizzas in that hour, the additional $20 per piece is surplus value and goes to your employer. \n\nHOWEVER, even though your hourly wage is $16 you still have to factor in the cost of insurance, possibly uniforms, taxes, and whatnot which are taken out as deductions. Let's say those deductions add up to $4/hour- one might think that making FIVE $20 pizzas will bring your check back up to $16, but you don't get a share of that fifth pizza. That's why a lot of workers are forced to choose between taking a lower paycheck and having insurance, or a higher paycheck without it. Or, the employer may not offer insurance at all, and you do indeed get the full $16/hr- but then you have to source your own insurance and whatnot. \n\nWhat we want to see is a pizza shop owned by the workers. The pizzas sell for $20, but the workers have collectively agreed to take only $16 an hour for wages. The profit gained is first used to pay the shop's business expenses, and the workers can decide what to do with any funds remaining. They may choose to bank it for any number of reasons, or they may vote to buy new ovens or remodel the shop, etc. The point is, from first to last the workers who own the business are, from first to last, the masters of their fate as far as their pizza shop goes. The workers are still producing a surplus value of $4/per (assuming production is 4 pizzas per worker per hour- production quotas and norms!) but that surplus value is returned to the workers themselves for disposal as they see fit instead of into someone else's pocket as pure profit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -2,
            "replies": [
                {
                    "author": "Bolshivik90",
                    "body": ">Wage in Communism: Value You Produce ($60) = Your Wage ($60)\n\nI hate to be pedantic, but Marxism is a science, and science is pedantic: wages wouldn't exist in communism. What you mean is socialism. A socialist state from a Marxist point of view is the transition period between capitalism and communism. It is the dictatorship of the proletariat, and a workers' state. It is the state Lenin said would eventually \"wither away\". In *that* state there will be by necessity still things like wages. But when the classless, stateless, communist society comes - after the state has withered away - wages wouldn't exist. Money would eventually not exist. But that'll be in the far future after the revolution. But it's worth being accurate. Communism is that far future epoch.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "None",
                            "body": "Marxism is a science? \nAn old Soviet anekdot: Old Babushka white a letter to Breznev: who invented the Communism, communists or scientists? He answers: communists of cause! She writing back: this is what I am saying, cause scientists test on dogs first.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "IntendingNothingness",
                                    "body": "There is more ways to conduct science than the empirical, scientific method so popularised today. Philosophy is a science, or some say. And there certainly are no statistical experiments in philosophy. Marxism is similar: it takes the world as the object of inquiry, it has a clearly defined method with which to examine it. The emphasis on evidence based science is in some ways apologetic for capitalism's sake. When you say \"evidence\" or \"facts\", you summon the impression that the world as it is today is a fact to base your science on, and when you do so, you get objective knowledge. But with this approach, any science you get will be capitalist since it takes a capitalist world as its source of evidence or facts. That's the political economy Marx criticises in... the critique of political economy. You need to go beyond these \"facts\" to go beyond the capitalist world. And for that you by definition cannot do evidence-based science since all the evidence stems from capitalism today.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -2,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}