{
    "title": "Marxist Degrowth / Ecology Recommendations ",
    "author": "utopiamgmt",
    "subreddit": "Marxism",
    "rank": 180,
    "score": 12,
    "upvote_ratio": 0.83,
    "num_comments (reported by reddit)": 14,
    "url": "https://www.reddit.com/r/Marxism/comments/1hsxhtk/marxist_degrowth_ecology_recommendations/",
    "id": "1hsxhtk",
    "selftext": "Hello,\n\nI’m looking for book recommendations on Marxist / Communist Degrowth and ecology. I’ve already read Kohei Saito’s Marx in the Anthropocene, Jason Hickel’s books as well as a few books by Andre Gorz and Ivan Illich. \n\nI know that ecology and Degrowth can be a divisive issue within Marxist circles, but I’m looking to expand my understanding of the topic. Anything is helpful! \n\n",
    "comments": [
        {
            "author": "Techno_Femme",
            "body": "John Bellamy Foster is a good author on the subject. Metabolic Rift Theory is foundational for what Saito is doing. I've heard Jason W. Moore is also good but haven't read him. Andreas Malm's Fossil Capital was also a really solid read.",
            "score": 12,
            "replies": []
        },
        {
            "author": "Oskarkf",
            "body": "I think it is very important to read \"Austerity Ecology\" by Leigh Philips. His work is anti degrowth. I don't agree with all of his points, but it is a must read for those wanting to understand all sides of the debate. Bear in mind that it was written in 2015, so some things are a little outdated - but as Marxists we are used to reading dusty stuff, so I'm sure you'll manage",
            "score": 2,
            "replies": [
                {
                    "author": "utopiamgmt",
                    "body": "I’ll give this a read! 2015 is pretty recent for me haha I agree that it is important to look at these issues from different points of view. Though I see the appeal of eco-modernism, I find most of it very unpersuasive.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "pharodae",
            "body": "Look into Bookchin and Ocalan, while they're not \"\"Marxist\"\" (anymore) but definitely have a materialist and dialectical underpinning to their works and Bookchin's theory of Social Ecology (First/Second/Free Nature dialectic) is super important for understanding society's place in an ecological framework. \n\n[Murray Bookchin - Social Ecology and Communalism](https://theanarchistlibrary.org/library/murray-bookchin-social-ecology-and-communalism)\n\n[Social Ecology and the Right to the City - Various Authors](https://files.libcom.org/files/Social%20Ecology%20and%20the%20Right%20to%20the%20City.pdf)",
            "score": 2,
            "replies": []
        }
    ]
}