{
    "title": "Some questions about Marxism and violence",
    "author": "apat4891",
    "subreddit": "Marxism",
    "rank": 69,
    "score": 23,
    "upvote_ratio": 0.76,
    "num_comments (reported by reddit)": 105,
    "url": "https://www.reddit.com/r/Marxism/comments/1ik1pch/some_questions_about_marxism_and_violence/",
    "id": "1ik1pch",
    "selftext": "I am not a scholar and not someone who is well-read in Marxism, so this post is meant to both learn more but also to ask some questions.\n\nI would like to see a society where there is economic equality, where people receive money according to their genuine needs and not according to other factors like who they were born to, how much profit they can make for their employer, etc. In my own practice as a psychotherapist, I see people who approach me or others for therapy but are unable to pay the fee and one has to say no to them. This is painful. I have gone to a lot of length to accommodate people who are unable to pay.\n\nHowever, from what I have seen among the Marxists I've known, they find that violence is a justified means to the end of economic equality and basic economic rights being granted to all human beings.\n\nTo me this seems difficult to accept on two counts -\n\nTo kill another person is traumatic for the killer, because it exposes him to fear and rage in the interpersonal relationship between the killed and the killer. This fear and rage are then repressed, and are bound to keep haunting the killer, and he is likely to repeat the killings in the future unless he heals himself by integrating this trauma and releasing these painful emotions.\n\nSecond, if a person is successfully violent to another person and takes away his wealth and distributes it among the poor, the act of violence, killing, is validated in his mind, and it is not going to then confine itself to contexts where such acts are for the sake of the well-being of a larger number.\n\nFor both these reasons, I feel that social change that uses violence as its means is going to perpetuate violence. The victorious are then going to find new objects of violence in their colleagues or in anyone who doesn't agree with them.\n\nFrom the little I know of history, this has happened in the USSR and in China, both in their attitude to religion and in their attitude to countries initially outside their political control, for example Tibet in the case of China.\n\nI wonder what people here think about this?\n\nPS: I didn't intend this to be a \"let's debate violence versus non-violence post\". My bad, I should have been clearer. The more precise question is - \n\n\"The experience of violence brings up fear and rage in both the agent and subject of violence. Both people repress this experience. Like all repressed experiences, this is bound to come back. The subject may be dead, but the agent lives in fear and has impulses to express his rage on himself (drug abuse for example) or on others (violence). If violence is a central instrument in bringing about a just society, will this not be a problem? How can we avert it? If it will be a problem, do we take this into account when aligning ourselves with violence?\"\n\n",
    "comments": [
        {
            "author": "orpheusoedipus",
            "body": "Non-violence is fine in many tactics (such as strikes in principle)but unfortunately our given circumstances most likely will require some form of violence to protect the gains of the workers revolution and also to enact it. People are already constantly faced with the violence levelled by the state and corporations against them including killing and torture, just take a look at the prison system, imperialism, and colonialism. People are already facing traumatic violence they are simply fighting back. Which usually ends up being my problem with non-violence preachers, they take the side of the oppressor and the status quo. They stifle liberation movements and denounce them as violent while offering no other alternative to liberation. If you want to look at psychoanalytical perspective on violence and colonialism you can checkout Franz Fanon. \n\n\nAlso I think your connection to prove your point is a very weak one. You’re claiming that acting in violence once will lead to continual violence unless you address what you’ve done in a professional setting. However, that is completely devoid of looking at individual circumstances and also doesn’t seem to be true in general to me. Many people commit violence but not endlessly. We can think of self Defense as an example. Self Defense doesn’t mean the perpetrator isn’t traumatized, but the assertion that being traumatized through your own acts of violence will lead to a never ending cycle is short sighted at best.",
            "score": 32,
            "replies": [
                {
                    "author": "apat4891",
                    "body": "Regarding violence not being perpetuated -   \n  \nEvery client I've worked with long term has experienced violence as a child, verbal, physical or sexual. Every single one of them has perpetuated it either to others, or to themselves in acts of extreme self-hatred, including physically violent ones. I don't see how violence is not perpetuated. \n\nWhen I say violence, I mean even so-called small things like a parent screaming at a child. When I say it is perpetuated, I mean it is perpetuated not just in the form of that child growing up to become a serial killer, but by becoming a parent who traumatises his children by inducing fear, or by becoming a person who curses himself at every small failure and keeps his psyche in a perpetual state of fear. \n\nI completely agree that there is institutional violence that we don't notice. \n\nI am not preaching non-violence, I am simply noting a problem with violence, and that given the intimate work I do with violence day in and day out, I don't see how a violent struggle can actually lead to a peaceful society, psychologically speaking.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "GeologistOld1265",
                            "body": "What you are missing, is that Capitalism inheritable violent. Violence inbuilt in all structure of society.\n\nWhat are police, army, courts, private property - that are all tools of violence. Hungry want to eat? Food is taken form you by all this institutions. Want to have roof on your head? Again, same institution demand that you pay even if you can not. \n\nAll social programs that soften Capitalism are not inbuilt in system. They are external. That why they are always under attack and then come to be out of violence. All workers rights come from violence. Peaceful strikes? Did you ever study history? They are violently suppressed. Even resent railroad workers strike was suppressed by State, by Biden! They were stop by treat of violence by state, stop or you are criminal.\n\nAnd pickets used to stop Scabs by force. That is not an incident that Unions were often connected to mafia. They needed violence in order to enforce strikes.\n\nAnd victims of violence you try to help cope from Capitalism violence. Workers which have to power in workspace, do not have stability, have to follow orders take it out on families, propagate a cycle of violence.\n\nSo, we do need to build society NOT to build on base of violence, but in process violence is inevitable. Important for violence to have a purpose.\n\nFor example, Lenin denounce Anarchist violence, random killing of goverment officials or rich. That does not promote better society. But Lenin promote and supported revolutionary violence.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "apat4891",
                                    "body": "Interesting. Then I wonder if you think China's actions in Tibet are revolutionary violence. Or do you think the suppression of religion in the USSR is revolutionary violence. To me they don't seem to be violence with a just purpose but an abuse of power over those weaker than oneself.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "orpheusoedipus",
                                            "body": "I think the attack on religion in the USSR was two fold. On one hand the church was not just a religious organization but also very political, reactionary and represented the interests of the kulaks and petit-bourgeois, making it necessary to stop counter revolutionary movements within. But on the other hand there was certainly excesses and heavy handedness against religion. Marx mostly spoke of it as something that would disappear as the world became free of the exploitation and pain that caused many to flock towards religious belief, rather than be violently suppressed.",
                                            "score": 12,
                                            "replies": []
                                        },
                                        {
                                            "author": "GeologistOld1265",
                                            "body": "Actually attack on Church in USSR come from self defense. After October revolution Church put all it egg into unti revolution. It preach, provide money to white army.\n\nIf you read Marx, you will find that he does not condemn religion. He understand dialectic of religion. It help people to live in existing society, so, so long as religion does not fight revolution, Socialism happy to live with religion.",
                                            "score": 8,
                                            "replies": []
                                        },
                                        {
                                            "author": "apat4891",
                                            "body": "This of course is different point from what I wanted to talk about. As far as the *ethics* of violence goes, I am ambivalent and *am not preaching non-violence*. \n\nAs far as the psychology of violence goes, I am not able to see how violence is not repeated, given its traumatic nature, experientially, for both agent and subject. \n\nMost people here responded to my question as if it was a question about the ethics of violence. I should have worded it better I suppose. But now that you are responding to the ethical bit, I am trying to engage in that discussion, but I want to clarify that I am not *opposed* to violence in any categorical way.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "orpheusoedipus",
                            "body": "Of course there is a problem with violence it’s not something we like at all and I’m not denying that it causes perpetuation in general but not that it precludes us from having a liberated society with limited violence. In an ideal world we’d require no violence at all.\n\nBut the logic of what you’re saying is leading up to the fact we can never have a liberated society, because there is violence now, violence is perpetuated and will cause violence later. Yes you didn’t say that non-violence is the answer but you are making the claim that with violence nothing can change we will be stuck in a cycle, I am simply pointing out we already are in a cycle of violence so whether or not we take part in violent revolutionary action or not we have already been exposed to violence in many ways and makes the question as a whole a moot point. However, as materialists we see that the material conditions are what direct superstructural changes. In this case, a system like capitalism which is upheld and based on the violent exploitation and oppression of proletarians and colonized will cause people will recreate violence to continue the system itself. However when material conditions change and we are building a system that removes those exploitative underpinnings found in the process of production that form our society we would see a reduction in violent perpetuation because it is no longer necessary as a tool of class oppression for the wants of the bourgeois. \n\nIt is simply an unfortunate fact that we have been left with no other choice. And I think part of this is why we must have a transitional period where the material circumstances are transformed before communism can come to be.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "apat4891",
                                    "body": "Reading your comment, I realise that my point is coming from a non-materialist perspective. I'm saying that violence in the superstructure, or rather violence that is lodged in the psyche, is bound to create a violent material structure. And even when things are outwardly non-violent, there will be violence in the heart waiting to express itself. \n\nMost of the people I work with who repeat their trauma are not doing it because of some kind of direct or institutional violence they are facing. It is simply the fact that the violence they faced is traumatic and trauma repeats itself if not healed.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "h3r3t1cal",
                                    "body": "My personal sticking point is whether violence can *actually* result in better material conditions and a more egalitarian society. I am quite skeptical of this, though I don't deny that people have largely been left with no other choice. \n\nIt's conceivable that, because violence is the only real choice, and violence cannot truly liberate society, then there can be no liberated society. Pessimistic, yes, but conceivable nonetheless.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "apat4891",
                                            "body": "In small ways people create small groups of equal relationships, between friends, colleagues, between human and non-human species. They live in compassion, in attunement with nature, with respect for the universe. \n\nThat is all that I can realistically expect. \n\nOutside these small, often ephemeral oases, human civilisation is hurtling towards collapse, most palpably because of ecological collapse that will stir up collapse in other dimensions - economic, social, psychological. I see class struggle as part of this larger picture, and even where this struggle ends with the working class winning, we will continue towards collapse.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "apat4891",
                            "body": "The response that \"there is institutional violence anyhow and the violence of the oppressed is only a response\" - it is an answer to someone arguing that there is no violence and the oppressed initiate violence, and actually they should have a non-violent protest.\n\nI do not believe any of the above. I am trying to say what I have observed about the mechanics and consequences of violence, that's all.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "GeologistOld1265",
                            "body": "One more think I would add. You job perform the same function as religion.\n\nYou help people to live in existing society, Religion does it too. Religion say it does not matter some of rich in this life, matter is how you live it and god will sort it out in a next one. You do something similar.\n\nSo, on one hand you help people, on other you protect Capitalism, Capitalist violence. With help of religion and you people live with system instead of changing it.\n\nDialectics is a bitch.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "apat4891",
                                    "body": "No.. \n\nA child beaten and bruised by his mother as a 5 year old, now he is 35 years old, deeply anxious, hyperactive, unable to work, his health deteriorating because of his general emotional stress - his problem is not caused simply by capitalism and ending capitalism is not going to remove his anxiety. By helping him learn to work through his trauma, to integrate the anxiety when it emerges rather than repress it - I am not helping capitalism by doing this. If anything, I am helping him be more sensitive to pain rather than repress it where he sees it. \n\nYour comment comes from an intellectual position rather than actually experiencing what the work I and others like me do is like. \n\nI don't deny that there are psychiatrists and psychologists who want to numb suffering, and that much of suffering is not personal and biographical but social and economic, but your broad brush comment is really not in touch with the reality of the profession of psychotherapy as a whole.",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "comradekeyboard123",
            "body": "The problem is that there often is no viable alternative to violence. I think we should focus on the prevention of perpetual violence and its use in situations where alternatives exist, rather than completely rejecting violence in all cases.",
            "score": 13,
            "replies": [
                {
                    "author": "Irapotato",
                    "body": "The other larger issue here is that non violence can play into the hands of a capitalist ruling class gleefully willing to use violence against you. In a world where violence was not the default tool used to quiet voices of dissent, non violence would be a more cogent option. The sad fact of the matter is that the capitalist system will not relinquish its grip on the neck of our people without the threat or act of violence, and even then it is still not guaranteed.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "apat4891",
                            "body": "Yes. Here in India I can see that there has been massive poverty, and the liberal class that was in power did not bring radical changes in the economy, because of which the growing anxiety and tension in the masses is now being harnessed by right-wing politicians who try to turn the Hindu majority against the Muslim minority by blaming the latter for many of the country's ills. If this poverty and its allied experiences had been removed to a larger degree, such as perhaps in China, it would be harder for people to get so swayed by hate and incitement to violence.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "pointlessjihad",
            "body": "When the working class organizes and becomes a threat to capital, I promise you that you will support violence. Not because you’ll have some change of heart or something like that. You will support it because the capitalist will do what they have always done to the organized working class, they will kill us. Either you’ll support their violence or help us fight back. \n\nThe working class has never asked for violence, we have always asked for peace, the capitalist is always the first one to shoot.",
            "score": 10,
            "replies": [
                {
                    "author": "apat4891",
                    "body": "I know, that's basically what Marx said too, violent conflict is inevitable, you can only choose which side of the conflict you are on. \n\nWhich is why I re-iterate - my point is not about the *ethics* of violence but the *psychology* of violence and hence the result of violence, seen from a psychological lens. I am not saying violence is wrong.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "zebtol",
                            "body": "This clashes with your phrase:\n\n> However, from what I have seen among the Marxists I've known, they find that violence is a justified means to the end of economic equality and basic economic rights being granted to all human beings. \n\n> To me this seems difficult to accept on two counts - \n\n> For both these reasons, I feel that social change that uses violence as its means is going to perpetuate violence. The victorious are then going to find new objects of violence in their colleagues or in anyone who doesn't agree with them. \n\nyou say its difficult to accept, because it will perpetuate violence, right? I feel your concern or difficulty with the violence is a bit vague now, am I correct in my understanding that you are saying that violence against an oppressor is difficult to accept because in some way the oppressed will then become the oppressor, or?\n\nI'd really like to see what you're basing this on, it seems to rely on some assumptions and generalizations that could be critiqued or further discussed. from what I know, attachment, conviction, emotional regulation, the difference between fighting for a cause one believes in and gets reflected in society or not, the type of killing and violence one commits, all of these hugely impact if and what kind of trauma someone experiences afterward, and how that will reflect in their behavior right?\n\nif you want to shed some more light on your perspective as a psychotherapist then please do, I'd be happy to listen, share, and discuss. You haven't really gone into any of your claims on the psychological aspects though, so I hope you can understand why you're getting these responses.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "apat4891",
                                    "body": "I can start with one example. There are two brothers, one 12, the other 7. They are both disturbed by the death of their mother recently. The older brother starts to beat the younger one, every day. He throws him to the floor, kicks him, punches him, humiliates him verbally and shouts sexual expletives at him which basically mean he is going to rape him - although he never does that.\n\nThe older brother is experiencing intense anxiety after the trauma of the mother's death. For reasons we don't know, he also has a lot of rage. He decides to act out this rage on the younger brother. The younger brother, already very anxious because of the mother's death, now experiences even more anxiety - to the degree of terror - and also experiences his own rage because he wants to hit back but never does for fear of being beaten even more.\n\nBoth boys are thus experiencing the emotions of anxiety and rage, and neither has the capacity to sit with it, to acknowledge this uncomfortable truth as part of one's consciousness, to allow it to be fully felt - in short, to *contain* and *integrate it*. The older one expels it out by acting, and the younger one represses it by dissociating and growing up to become highly mentally ill - having paranoid delusions, a tendency to burst into spurts of verbal and physical violence, having rape fantasies for colleagues, at times being suicidal, and so on.\n\nI have seen similar ways in which violence brings out both anxiety and rage in both the agent and the subject, in various constellations - mother-son, father-daughter, father-son, friends, partners, both adults and children.\n\nIn my practice have never seen an example of violence being conducted without anxiety and rage being present, and without these emotions then being split off - which means they will come back and be enacted again.\n\nHence, I say that the experience of violence is traumatic. That is, it brings forth such intense human emotions that for 99.9% of human beings alive it is not possible to not split them off. Any emotion that is split off is going to come back, and one will then have problems like wanting to hurt others or hurting oneself, verbally or physically.\n\nThis is what I do for a living - working through this in other's lives and helping them acknowledge their painful truth, to learn to be able to hold the emotion and not act it out or repress it, and seeing that the emotion, if held from a gentle, witnessing position for a prolonged period of time, dissipates. This is the only way to heal the trauma of violence, and it can happen both in and outside therapy.\n\nI don't have any books to refer you to, but I think the majority of practitioners of depth psychotherapy will agree with the above description.\n\nThus I don't see how the leader of a peasants' army can stab a landlord to death and not be traumatised, not traumatise the witnesses, and not lead to an inevitable cycle of anxiety and rage which will be played out in the numerous defence mechanisms human beings have to fight their painful reality.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "pointlessjihad",
                            "body": "And I respect that. Hopefully we don’t have to ever see that violence at all. If we win though we can break that cycle, we can make sure those hurt by that violence get the help they actually need to thrive.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "desiderata1995",
            "body": "After reading through all of this and the comments and your responses, I see you're questioning what happens after a violent revolution, and not necessarily the viability or morality behind using violence to achieve the socialist goal.\n\nAnd your analysis is accurate, as a professional in your field I'd defer to your assessment that violence would perpetuate violence until it is successfully managed in controlled environments, and this is a process that will take generations to dispel it.\n\nHowever I personally don't see much value in the discussion beyond recognizing this would be a future problem post-revolution, and it would be addressed ideally by the society that comes after it. \n\nWhat I'm saying is, as a socialist yes I believe the working class (whose goals of liberation are diametrically opposed to the goals of the ruling class being able to continue to rule over them) will be left with no alternative to achieve their goal other than through acts of violence. How widespread and severe those acts need be is speculation, but it will be necessary, because there will be no alternative.\n\nAlso, yes I believe that perpetrating those acts of violence will result in trauma that perpetuates itself and manifests in myriad ways. \n\nIt is simply something that society will have to grapple with when the primary source of violence is over with, and treated and healed, just as has always been the case throughout history. The light at the end of the tunnel in this situation however is that a post-capitalist society should be better equipped than ever to address the problems with which it will be faced. \n\nWas there any more to it you'd like to expand on or discuss further?",
            "score": 9,
            "replies": [
                {
                    "author": "apat4891",
                    "body": "I was so pleased to read your first paragraph - that someone actually got what I'm struggling to say. \n\nI think the difference between what you are saying and what I am saying is that I don't think I can inflict a trauma on someone even if I know that it will lead to a better tomorrow. Having intimately explored violence, I seem to have an inability to consciously commit it. What you are saying is that weighing all pros and cons it is the least bad option and you are willing that you and society in general pays the price for it. Right?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "desiderata1995",
                            "body": ">I think the difference between what you are saying and what I am saying is that I don't think I can inflict a trauma on someone even if I know that it will lead to a better tomorrow.\n\nAnd I hope you don't develop any kind of shame regarding this feeling that you wouldn't be capable, but also it's not necessary that every person in the working class be ready and able to do violence.\n\nThose that are capable and willing, will do it. Those that aren't, won't. What is being asked of the working class who cannot or will not do premeditated violence, is that they support the general effort in any way they are able to. \n\nStalin didn't just lead direct action groups in violent conflict against their opposition, he began and found himself at various times just distributing propaganda, pamphlets and newspapers, to the working class on street corners.\n\n>Having intimately explored violence, I seem to have an inability to consciously commit it.\n\nI will contend this point briefly, that you may feel you lack any desire to inflict violence, but in a dire situation you would certainly find that ability. \n\nI'm a hunter, I believe it is an intrinsic part of being a human that we all have within us some capacity and propensity for violence even when, especially when, we can reason with the circumstances regarding the need for it and determine for ourselves is it truly necessary. \n\n>What you are saying is that weighing all pros and cons it is the least bad option and you are willing that you and society in general pays the price for it. Right?\n\nI view the conversation less from the perspective of a \"lesser evilism\", and more of an inevitability. \n\nAs I mentioned before, the goals of the working class and ruling class are diametrically opposed. There does not exist any reality where both achieve their fullest desires, it is an antagonism which conflict will naturally arise from, as it already does. \n\nA homeless person is harassed by cops and hostile architecture until they are driven to the darkest recesses of society.\n\nA CEO gets shot in the street. \n\nA single mother gets served an eviction notice on Christmas Eve. \n\nA protest of thousands of people is beaten, gassed, shot with rubber bullets and ran over with patrol vehicles until they submit and disperse. \n\nThese examples and countless others are that inevitable conflict, as the ruling class must inflict violence in all its forms in order to maintain their control, the working class must respond accordingly or continue to suffer.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Conscious-Wolf-6233",
            "body": "I’m no expert, but I think the idea of “not causing violence to address a situation” is just fine if you’re talking about someone asking you to stop playing your music too loudly or they serves the wrong meal. What Marxists are talking about is people who don’t live under a valid social contract because there are a few people with monopoly on the resources & means of production who repeatedly make their lives harder, more intolerable, and more repetitively painful. These few people do this despite knowing better, all while ignoring all attempts made by the masses who are suffering. Keep in mind, this suffering of the masses is violence inflicted upon them (us). Opposing these actions in a way that works is the natural order of things; requesting opposition be done “peacefully” is a luxurious position of people who are not actually suffering.",
            "score": 4,
            "replies": [
                {
                    "author": "apat4891",
                    "body": "Again, I am not saying things should be done peacefully. \n\nI am simply observing the consequences of violence that I see in my work and wondering why the same should not happen on a larger scale, and why the same cannot be used to speculate on the behaviour of what, for example, the Chinese have done in Tibet. \n\nI am not advocating non-violence, I am not advocating anything. I am simply trying to offer a psychological lens on some Marxist ideas. I don't know what the alternative is, at least not as of now.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Conscious-Wolf-6233",
                            "body": "Gotcha. \n\nSidebar: I’ve been wanting to talk to psychiatrists/ologist who listens & views the world with a Marxist lens. Could you be that person? DM me if you are or might have some leads. Thanks.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "aikidharm",
            "body": "These kinds of concerns aren’t invalid, but they are privileges. \n\nThe oppressed who understand that they are oppressed do not have the luxury to worry about things of this nature. Doing so is a gift to fascism- it causes us to hesitate, to press pause, to linger, to give ground. Fascists want you to grapple with your morals so that they can keep themselves safe from you. They want you so committed to never “sinking to their level” that you never lift a finger to free yourself.",
            "score": 6,
            "replies": [
                {
                    "author": "apat4891",
                    "body": "Privilege isn't bad per se, it is bad if you use it to make things worse for someone and aren't conscious that you are privileged. Yes, I'm privileged to have time and space to reflect on violence.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "apat4891",
                            "body": "From a more psychological perspective, it is the fascist who has a severe lack of self-reflection. He is so deeply traumatised - and I can see this seeing the ruling politicians in my country - that he has to find an enemy to demolish and suppress, so he can feel in control and strong. If he had the *privilege* of going through some patient self reflection the world might have been a better place..",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "pydry",
            "body": "I mean, using this argument you could argue that fighting off hordes of Nazis hell bent on racial extermination is immoral too.\n\nIt sounds absurd, and I think it is. Mahatma Gandhi actually advocated this line of thought though - quite literally - for Jews too.\n\n\nIf you think that Gandhi was wrong, the question is more about where to draw the line. The line between defense and offense is so blurry it is almost unusable. So where do you put it?",
            "score": 4,
            "replies": [
                {
                    "author": "apat4891",
                    "body": "Ok, you're helping me refine my point. I am not saying violence is *immoral.* It is not a point about the *ethics* of violence but about the *psychology* of violence which includes predicting the result of violence on the victorious. \n\nTalking of Gandhi, yes, Gandhi advocated what you say, and he also noted what I say. I am not echoing him though, and not advocating offering satyagraha to the Nazis.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "pydry",
                            "body": "This aligns pretty well with the moral dimension I think - in both ways you can conclude that it is a tactic with extraordinarily high costs that should only be used sparingly when other options are unviable or exhausted.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheMicrologus",
            "body": "OP, I’d recommend you consider the distinction between social and personal phenomena. You should also disentangle certain ideas you may be conflating.\n\nMarxists who defend violence believe that at a *social* level, violence is the best way to transform our current society into something better because those who currently run our society will not allow a peaceful transformation. Split this into the *transformation* *question*: should you transform one type of society into another, and the *violence* *question*: is violence justified in certain cases? The revolutionaries who formed the US. believed in the transformation to bourgeois democracy, and they felt England would not allow this transformation without violence. If you are sympathetic to the American Revolution, then you at least agree in principle with Marxists that transformation and violence can sometimes be necessary.\n\nOn a *personal* level, a Marxist can (and I think also should) believe that yes, committing acts of violence is probably very psychologically damaging, and yes, cultivating violent individuals might beget more violence. We’ve seen lots of evidence that soldiers come back from war with psychological damage, and they harm others, themselves, etc. Wars are started for social reasons. They are never started with the main goal of doing personal psychological damage to their own population. So you can believe that the Allies’ participation in World War II was justified socially even if you dislike that a consequence of it was more personal violence/trauma. You may know more about this topic than me, but my impression is that societies writ large, rather than individual soldiers, do not continue to see mass social violence after wars. (E.g., Germany cultivated murderous individuals and a broader culture of violence, but it became peaceful after WWII ended.)\n\nIf that all makes sense, then you should consider 1.) The *social critique* question, e.g., is our society flawed, and 2.) The *socialism* question, e.g., would socialism be better? Marxists believe society has flaws and socialism would be better. I’d say learn more about those two arguments separate from your worries about violence.\n\nIn the end, many Marxists disagree with each other about the violence question, and many would not endorse what China has done in Tibet. However, all of them believe in the Marxist critique of society and that socialism would increase personal flourishing. They think this because it would make violence less common and things like psychotherapy would be more obtainable.",
            "score": 7,
            "replies": [
                {
                    "author": "apat4891",
                    "body": "Once the workers organise, train themselves in violence, overtake the system causing death and destruction, what will happen to that \"cultivation of violence\", to use your phrase? \n\nI don't see how social and personal phenomena can be isolated from each other, although I do see they are not the same thing.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "TheMicrologus",
                            "body": "I don't think personal and social concepts can be isolated. My examples of war show my belief they cannot, actually. You and I might also agree that in our current society, personal violence has a social character, e.g. that some acts of personal violence result from broader social phenomena like poverty. So I only mean to disentangle concepts for ourselves so they can serve explanatory function. Again, Marxists aren't advocating for personal traumas, and using personal situations as an objection to social phenomena is missing a big part of the story.\n\nAs for the question of what happens to the violence: when the social need for violence is obsolete (e.g., fighting is done), violence becomes less necessary and fades. After World War II, German, American, and other soldiers stopped fighting, and civilians stopped hanging up banners. There was no need for those things. We can debate the nuances of how long things hang around in the ether, but kids in Germany or the US don't feel the personal violence of their great grandfathers in any meaningful way.\n\nIf you believe that what is happening right now in Tibet would happen in any socialist society, that's a critique of socialism, not the personal actions of people who fought a civil war in China in the 1930s.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "apat4891",
                                    "body": "If you do the work I do, you will see a few things -\n\nThere is a mental health pandemic. Everyone I know struggles with anxiety, sorrow, aggression in some permutation of these. People are unstable. Marriages are unhappy. Families are deeply flawed. Most people I work with have childhood trauma from their family. This is not normal, but it is normalised. Most people even today, and even more so in my culture in India, will not believe what I just said.\n\nThen some celebrity or some teenager hangs himself or goes on a shooting spree, and we identify that person as disturbed but we don't see that he is just like the rest of us, only more intensely so. It is one consciousness we are dealing with, and that human consciousness is deeply disturbed and traumatised.\n\nTo me this is as visible and as clear as coal is to someone who steps into a coal mine everyday and sees and smells it.\n\nNow is this totally unrelated to WW1 and 2 and to colonialism and partition in my country for example, to caste oppression, to the wars India and Pakistan and China have fought, to the way women have been dominated, raped, straitjacketed? I don't think so. Because the same perpetrators and victims have gone on to become fathers and mothers to children who have become fathers and mothers to people like us. We carry the anxiety and aggression in our consciousness and repeat it. It may not come out in public like somebody committing suicide but in small ways in which the mother is always anxious and neglects the emotional needs of the baby, in ways that the fear of the father makes a child study something he would otherwise not be interested in, in snappy comments, in parents shouting and sometimes hitting children, in violence between parents, there is trauma that is as old as human beings are.\n\nSo I do think that if there is a violent revolution that trauma is going to hang around in the air for many, many generations. We can choose not to acknowledge it though.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "TheMicrologus",
                                            "body": "I don’t dispute that there is a mental health pandemic, and I doubt many people here would. I think you are very sensitive to this fact because of your professional experience, which is noble and makes you seem like a good person. However, I don’t think your experience supplies you with the evidence you seem to think it does.\n\nOne clarification: Marxists probably won’t dispute the idea that people pass down shitty stuff to their kids, including psychical stuff. Certainly, if you says it’s plausible that a patient was affected because their great grandfather was a traumatized WWII vet and beat their grandfather who beat their dad who beat them, I’ll concede the point. Actually, Marxists probably have no reason to dispute many or most things psychology fields say, and I’m happy to defer to you about how to diagnose, treat, etc patients.\n\nHowever, I don’t believe that society as a whole was impacted psychologically by World War II. America as a whole is a violent society because of World War II? And individuals are more directly impacted by their great grandparents than the actual environments they live in? No, and it seems absurd to say so unless you believe in some magical causal mechanism whereby individual experiences get passed onto to strangers. (I doubt it’s very mainstream in your field to lay much or most of the blame on WWII, but correct me if I’m wrong.) \n\nAgain, this is the personal/social distinction.\n\nMarxists would say is that the examples you give persist because of social structures, including institutions/dynamics of capitalism and the state. Simply put, our current society makes it hard to correct these issues you describe. The market/state doesn’t allocate resources to them, and our political systems are not designed to help ordinary people.\n\nMarxists believe this isn’t an accident; our society is set up to ignore things like helping families or treating mental health resources. I am a skeptic that socialism would magically fix our psychology, but Marxists generally believe socialism would mean real needs are prioritized over moneymaking. (E.g., let’s figure out how to address cycles of abuse and then do it, not figure out how to make money off of mental health and hope a secondary effect is some people sometimes get better.)\n\nSo put your cards down:\n\n1. If you think our society is already set up to allow us to fix social psychology en masse, then that is your fundamental disagreement with Marxism. We don’t need social transformation, just to wait or try harder to fix things. Say so.\n\n2. If you do think society is flawed but transformation can happen without violence, then I would invite you to explain how - I don’t believe India or The US will simply let you walk up and take resources from the state or capitalists and just give them away to fix mental health.\n\n3. If you think that society is flawed and can only be changed through violence, BUT that violence will be so traumatic it cancels out all the gains of that transformation, say so.\n\nBut again, I just think you need to read some Marx or ask questions about the critique, alternative, etc. (Marx writes a lot about the social/personal distinction and why society is flawed; a ton of Marxists have written about what socialism might look like.)",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "apat4891",
                                                    "body": "People are traumatised because their parents are traumatised whose parents were also traumatised and so on. People are also traumatised because of the struggle to survive in the current economic order and its inequalities. It's not either this or that, it's both. The first leads people to create and perpetuate the latter, the latter creates more trauma. \n\nOf the three options you gave, I find myself closest to 3, but not entirely there. \n\nMy option 4 is this - \n\nHuman civilisation is leading to a major collapse which will be most visible in ecological collapse. But there will be collapses in the psyche, community, religion, economy and elsewhere too. Class struggle is part of this larger picture. Neither the mental health pandemic nor class struggle are things I will pick out and highlight as *the* main problem with human civilisation. There's a holistic problem, and we are collapsing. I don't think there will be large scale revolution and where there is on a smaller scale it will be too traumatic for it to be clearly worth it - that's my very tentative feeling. \n\nRealistically, I only expect small oases of human connectedness that are able to transcend many of those dimensions of collapse - psychological, communal, economic, etc. - but only ephemerally and on very small scale. The rest of the 8 billion of us - I don't have much hope. \n\nI've tried reading Marx but I don't think I have the intellectual aptitude required to understand him and other Marxists. It is some kind of disability, and I don't mind admitting that I don't have the skills to debate things intellectually. I can write what I deeply feel and witness in my work and see what implications that seems to have for the world.   \n  \nI do watch some podcasts by south Asian Marxists.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "TheMicrologus",
                                                            "body": "It’s bewildering if you believe society is about to have a massive collapse but we should just wait and let it happen.\n\nThat collapse would mean people lose their supplies of food, medicine, etc. If you think the ensuing panic won’t beget unprecedented levels of suffering and violence, I don’t know what to say.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "terribleD03",
                            "body": "You just hit upon one of the inherent flaws of marixst ideology.  At it's very core it's an ideology that focuses on destruction (destroy what exists) and war (class, gender, culture).  The Permanent Revolution.  There is always an enemy somewhere.  Historically, after the 'revolution' one of those \\*enemies\\* becomes the people.\n\nLook at CCP historically and right now.  Tens of millions were killed to gain power.  Millions were starved for the good of the country.  Tens of millions of little baby girls were killed to establish a male dominant strong workforce (One Child policy).  \\*All\\* those people were the Chinese people.  And who knows how many killed or imprisoned up to and currently in their totalitarian social credit surveillance state.  The people become the enemy.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "apat4891",
                                    "body": "This is an issue I haven't found an answer to from Marxists. When I ask about Tibet in the original post there is no answer except from one person who says it is valid, what the Chinese have done in Tibet, without engaging in discussion further. Similarly about violence and repression in the USSR.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "terribleD03",
                                            "body": "I don't think you will get an honest answer from most people - just the one reply you mentioned (a justification).  That's because it makes the party (and ideology) look bad...as in showing it to be totalitarian, imperialist, genocidal, oppressive, etc.  And it's not surprising considering most of that history is re-written or deleted by the party.\n\nUnfortunately, a review of history will show that Marxist regimes overthrow existing systems (governing, economic, etc.) to gain power (the revolution).  During those revolutions and the subsequent period(s) marxists kill masses of their own people.  First, it's their own people who oppose(d) them and then 2) usually a large mass of additional citizenry to achieve the collectivist system/balance.  The most famous being the USSR (as you noted), China (Mao), Cambodia (Pol Pot), and Cuba (Castro).  After those periods (revolution and establishing the system), and what I didn't include in my previous post, comes the eradication of opposing people outside of the country - usually for imperialist objectives (like your case - Tibet; or as we see now in Ukraine).",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "apat4891",
                                                    "body": "Well, Russia isn't Marxist, so does the Ukraine example hold? \n\nI didn't understand what you mean by   \n  \n\\> 2) usually a large mass of additional citizenry to achieve the collectivist system/balance",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "terribleD03",
                                                            "body": "The two of us and plenty of others could easily debate about how to classify modern day Russia.  And, I'm sure there are plenty of Russians who no longer think of their country as Marxist.  But the country is controlled now by the same people that controlled it during the Soviet Union.\n\nPutin said over a decade ago (IIRC) that the dissolution of the USSR was the greatest tragedy in modern human history - indicating who he really was at heart.  He followed that up by writing a paper and then stating that his goal was to reestablish the USSR.  To me, IMHO, it's those three things that makes Russia inherently a Marxist country.  They have complete control of the country, but, yes, they still incorporate some capitalism (because they have to) and religion (to placate the masses)...to a certain degree (as long as it benefits the ruling party).  Much the same way that the U.S. isn't a capitalist country anymore.  \n\nSo, yeah, it's definitely debatable.  Lots of people would say Russia is fascistic and I would support that - but not for some of the same reasons other would.  (The same goes for CCP China.)  It's under that paradigm I assert Russia's invasion of Ukraine is it's Marxist imperialist phase (just like nearly a century ago).  I justify this more rigid stance because things are always evolving but I think anchoring to simple classifications keeps the general discussion on one path.  (I definitely have a tendency for going off topic too easily).",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "terribleD03",
                                                            "body": "We've witnessed that, once a Marxist government has risen to power, there is usually a period of time after that (an adjustment period) where the principles of the collective are put in place.  During that period is usually when genocide occurs (genocide of it's own people).  It's most often attributed, correctly or incorrectly, to famine in the history books.  Outside of the history books it's sometimes also called ethnic cleansing, infanticide, culling, politicide, de-growth, etc.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "windy24",
            "body": "Marxism doesn’t promote violence as a first choice but recognizes it as an inevitable response to the systemic violence of capitalism. The ruling class doesn’t peacefully give up power. History has shown this repeatedly. The police, military, and legal system exist to protect capitalist interests, not to ensure fairness. If the working class tries to peacefully transition to socialism, the bourgeoisie will use violence to stop it. Marxists argue that in such a situation, revolutionaries have no choice but to defend themselves. The violence of the oppressed in self-defense is not the same as the violence of the oppressor. \n\nWar and violence do leave psychological and physical scars, even on those who believe in their cause. But revolutionary violence isn’t the same as senseless killing. In many cases, revolutionaries fight with a strong sense of justice, community, and necessity. This is different from individualistic, nihilistic violence. Moreover, organized revolutionary movements often emphasize discipline and political education to prevent unnecessary brutality.\n\nThe idea that “violence will keep escalating” assumes that revolutions don’t have a goal beyond destruction. But historical socialist movements attempted to build new societies, not just tear down the old ones. After revolutions, socialist states focused on reconstruction, economic development, and reducing the need for further violence. The USSR and China, despite their struggles, uplifted millions from poverty and built societies where workers had far more power than under capitalism.\n\nRegarding Tibet, the Western narrative often portrays China’s actions as pure conquest, but the historical situation is more complex. Tibet was a feudal theocracy where the majority of people were serfs under brutal conditions. The CPC’s intervention abolished slavery and serfdom, redistributed land, and brought infrastructure, education, and healthcare. While the process wasn’t without coercion, it wasn’t a simple case of imperialism either.\n\nIf you want a world where people aren’t left behind due to economic inequality, you’re already aligned with Marxist goals. The question isn’t whether violence is good or bad in the abstract. It’s whether oppressed people have a right to defend themselves against the violence of the system they live under. History suggests that peaceful change is only possible when the ruling class allows it, which so far has rarely been the case.\n\nI highly recommend reading the Wretched of the Earth by Frantz Fanon. VIolence is not just a tactical necessity but also a means of psychological liberation for the oppressed. Revolutionary struggle isn’t just about seizing power. It’s about reclaiming humanity. Years of dehumanization under capitalism and colonialism create deep psychological wounds. Through organized struggle, the oppressed overcome fear, build solidarity, and develop the confidence to shape their own future. This doesn’t mean we romanticize violence, but we see it as a necessary stage in breaking imperialist domination.",
            "score": 3,
            "replies": [
                {
                    "author": "apat4891",
                    "body": "Regarding Tibet -\n\nI wonder if the Tibetan people's opinion should be the best determinant of whether China's actions are justifiable or not?\n\nWill China ever allow a referendum on its right to exist in Tibet?\n\nI live in India and have met quite a few Tibetans and tried to learn about their culture, and at least in my sample size it is clear that the Tibetans do not agree with China's actions, and hence I would consider it imperialism.\n\nOr would you say that the local population's views are irrelevant as long as China or anyone else is bringing in their idea of development (which might not be a disagreeable idea necessarily). \n\nMy information isn't based on western propaganda but on Tibetan people's views, and also on the fact that there seems to be no permission to actually ask people for their views under Chinese rule. If you can be tortured for having a photo of the Dalai Lama in your house, I think it is the Chinese who are equally suppressing the true views of the Tibetans from coming out, even if western propaganda exists.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "apat4891",
                            "body": "Also, my primarily concern around violence is not ethical. Most people's responses here suggest that I ended up asking \"Is violence ethical?\". I take part of the blame for this miscommunication. My question is -   \n  \n\"The experience of violence brings up fear and rage in both the agent and subject of violence. Both people repress this experience. Like all repressed experiences, this is bound to come back. The subject may be dead, but the agent lives in fear and impulses to express his rage on himself (drug abuse for example) or on others (violence). If violence is a central instrument in bringing about a just society, will this not be a problem? How can we avert it? If it will be a problem, do we take this into account when aligning ourselves with violence?\" \n\nI'm not preaching non-violence as I have said earlier, I am simply trying to share what I understand about violence and wondering if others here really see the dynamics of it.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "blinkdog81",
            "body": "Something very helpful, is a deeper historical understanding. I am trying to spread word about a podcast called “Revolutions” by Mike Duncan. They are all important, but 1848 is key.\n\nThere are a lot of problems that still need to be solved within Marxism. For example, the problem of liberal betrayal. Historically, liberals and socialists will team up to push out a conservative government. Then the liberals take control and betray the socialists. Then conservatives retake control of the government.\n\nOne of the reasons Lenin went so far, was because he was expecting liberal betrayal, and he wasn’t going to give them the chance.\n\nSo how do we navigate this? How do we thread the needle between Liberal betrayal and a vanguard dictatorship.\n\nI haven’t found a good answer, that’s why I ask for help. I’m asking people to read Marxism and read history with me.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ghosts-on-the-ohio",
            "body": "We marxists absolutely are not pacifists.  But it should be noted that we do NOT engage in individual terrorism.  Individual terrorism being defined as small scale or locally scaled acts that are isolated in nature and are usually meant to send a message more than actually directly change political structures.  Such as for example, assassinations, industrial sabatage, random bombings, etc.  These do not encourage the working class to participate, do not actually threaten the ruling class's authority in any systemic way, and can backfire politically.\n\nIf there is going to be violence we would prefer it take the form of organized mass action by the working class, which can be sustained for a long time on a wide scale.  Such as for example a people's militia.\n\nThe other thing is that many of the most effective tactics marxists use are not violent.  General strikes can quickly bring the ruling class to its knees and can even overthrow governments.\n\nBut the main thing I want you to consider is how we define violence.  Because while many say they oppose political violence, they do not actually oppose it in practice.\n\nHave you ever told a soldier or police officer \"thank you for your service\"?  Do you think that it is ever acceptable to throw a person in prison if they commit a certain crime?  Do you think its ok for a government to have a police force or standing army even if those institutions are only used in certain circumstances?  Congratulations.  You support political violence.\n\nDo you think its okay for a country to take up arms to defend itself if another country invades it?  Do you think it was okay for the Americans to rebel against the British in 1776?  Do you think it was ok for the US, France, or the USSR to fight the nazis?  Do you think it was ok for the North to fight the South in the US civil war if the result was freeing the slaves?  Congratulations.  You support political violence.\n\nDo you support the existence of a state at all?  Do you think its ok for sovereign governments to even exist? Is it ok for governments to enforce laws or defend their territory?  Congratulations. You support political violence.\n\nAll political systems that have ever existed require violence to come into power, and all political systems require violence to stay in power.  Daily life under capitalism is extremely violent.  If I walk into a grocery store and take an apple without paying for it, the cops are called to threaten and arrest me.  That is violence in the name of private property rights and capitalism could not exist without that very violence taking place on a daily basis.\n\nNot to mention the daily indirect violence of poverty and marginalization.  Every homeless person who dies of exposure because he couldn't afford rent has died a violent death.  Every person who dies of diabetic shock because they couldn't afford insulin died a violent death.  Every child in a poor country who dies of drinking contaminated water has died a violent death.  There is such a thing as social murder.\n\nFor some reason, popular culture has an odd idea that it only counts as \"violence\" if it is people who are not in power taking up arms for their particular goals.  But when the state - especially states we support - take up arms to enforce laws or defend their own sovereignty, that magically does not count as violence.  Think about who may have benefited from such an idea?  Probably the wealthy ruling class who created the state and whom the state protects.\n\nIf we want to ever live in a world that is free from violence, we first have to eliminate the inequalities that make violence inevitable.  We have to get rid of class distinctions, and that can only be achieved through socialism which later transitions into communism.",
            "score": 3,
            "replies": [
                {
                    "author": "ghosts-on-the-ohio",
                    "body": "And another thing to add.  Pacifism is violent too.  If you are willing to watch violent oppression take place around you, and are not willing to do everything necessary to stop that oppression, you are taking the side of the oppressor.  You do not get to say \"actually I don't support ANY violence.\" You are either an opponent of oppression or an accomplice.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "apat4891",
                    "body": "I agree with much of what you say, but none of what you say addresses my question about the psychology of violence. \n\nI've added a postscript to my original post that may help clarify things.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "ghosts-on-the-ohio",
                            "body": "So what I am hearing from you is that you are concerned that revolution is a bad idea because it will require violence in order to impliment.  And that this will be extremely psychologically - and physically - damaging to every person who witnesses this violence, receives or impliments it.\n\nI 100 percent agree with you that violence is inherently harmful to all parties involved.  As you said, you have witnessed this personally through your role as a mental health professional.\n\nBut here is the problem.  We do not have any non violent options.  Whatever choice we make, whatever path we walk, we are going to have to deal with intense levels of violence with all the psychological harm that comes with it.\n\nIf we all abandon Marxism, abandon the concept of revolution, abandon any hope of anything other than mild and temporary reforms, then that isn't going to protect people from violence.  It will only allow the unspeakable violence of the status quo to go on and on forever.  If we chose not to fight back against this oppression, then we are complicit in this oppression and we become perpetrators of status quo violence.  Sure being complicit in the status quo isn't as personally psychologically damaging to YOU as it would be if you held the gun yourself, but SOMEONE SOMEWHERE is holding the gun, and someone somewhere is being shot, starved, disenfranchised, arrested, beaten, etc.\n\nIf we choose the revolution (which is not always violent, by the way) then we may have to deal with civil war or armed conflict, but that could potentially put an end to the violence all together because then we might be able to build a just world where everyone's needs are met.  It may even allow us to eliminate the original source of social violence all together, which are class divisions.\n\nIf you think of this as a trolly problem, and you have to pick the path which has less violence overall, the second path clearly is less violent.\n\nWe do not have a middle path.  We can't provide for everyone's basic needs without overthrowing capitalism because capitalism requires separating a large population of an exploited underclass in order to function.  Private property rights require violence to enforce.  Several socialists have tried to argue that there is a middle way, that we can reform our way to socialism through the existing power structures but that isn't an option in poor countries where any reform will immediately be met with obscene violence from the ruling class of rich countries, and in rich countries, reforms always eventually get pulled back as the ruling class retreats, regathers its strength and goes back on the offensive (Example, how Raegan, clinton, and now trump are peeling back all of the progress made by Roosevelt's new deal.)  We have to chose between revolutionary socialism or barbarism.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "apat4891",
                                    "body": "I was thinking about this billionaire's son's wedding here in India which is ultra luxurious and all over the media. Why does this man and his son want this kind of wedding? They are deeply traumatised, that's what I can say from my experience in my work. A sane, healed human being will not steal money from others and become vulgarly rich while there are people in poverty right around the corner. \n\nThis is where my experience doesn't echo with Marxist thinking. The source of injustice is not class division, class division is itself a symptom of emotional trauma and distorted perceptions of reality that come from it. You can end class division but the trauma will still play out its dramas in other ways. The people I see in my work who are either abused or abusers are well off mostly, that's why they can afford therapy, and many of them have had well off generations behind them. Yet they verbally abuse others, they harm themselves. They aren't victims of capitalism primarily, they are victims of traumatised psyches around them, particularly but not only in early life. \n\nSo I don't think anyone is going to change the whole 8 billion of us. But in small ways, among my friends and community, among people I know, among the animals and plants I engage with, if I am healed, I will not pass on trauma, and if I don't have the impulse to pass on trauma, I will not be greedy for buying a luxury car to show off or to divide people religiously and dominate them or to let animals go hungry. These divisions of power where the powerful exploit the powerless will not be perpetuated by me if I am healed. In this way I can light a small lamp in my little corner of this dark world. \n\nThe other approach - to change whole societies and countries with violent revolution (although you said it need not be violent) will only perpetuate violence, and I have described the mechanism of that as I understand it in the postscript to my original post. One also only needs to read biographies of Tibetan people to know what revolution has led to there. \n\nThere is a fundamental question - why should we not start with ourselves, and make a small change in the world, rather than formulate a mass change? There seems to be a fundamental belief among Marxists that personal healing and transformation is not a necessary precursor to social change, and can be left aside for larger changes that are external.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ghosts-on-the-ohio",
                                            "body": "You do not need to be mentally ill to inflict great suffering on other human beings.  Those wealthy clients of yours, ever ONCE did you convince them, to give up their wealth after they began to heal from their trauma?  Did you ever once convince a factory owner to turn his profits over to his workers.  Did you ever once convince a landlord to stop collecting rent?  I'm going to guess no, even for clients who made amazing progress.\n\nAnd you don't get to talk to the rich people who aren't mentally ill, who greatly outnumber the rich people who are.\n\nAnd yes, we have to think of change on a wide scale because any individual good acts or good will will die with the individual.  Do we want to actually make the world a better place?  Do we actually want to solve problems?  Or do we just want to pat ourselves on the back and make ourselves feel better?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "apat4891",
                                                    "body": "Well, I can't see how you can be a healthy person and still be obscenely rich. I am not talking of mental illness as defined by the Diagnostic Statistical Manual or the International Classification of Diseases. \n\nIn my view, you are not interested in the inner world and what kind of internal dynamics make a person greedy and violent. You want to change things in the outer world. In two sentences that is my entire critique of what you are saying.\n\nFor a practitioner of depth psychology, it is very clear that dictators, obscenely rich people, people who get hundreds or thousands of people killed, oppressive landlords, they are all very unwell people psychologically. It sounds like for the Marxist this reality doesn't exist, they just want to remove all these people and replace them with something else.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "ghosts-on-the-ohio",
                                                            "body": "You're right.  I don't care about people's inner worlds.  Whether someone acts evil because they are psychologically damaged or whether its because they are just a jerk is not important to me.  They still need to be stopped either way, and you can't stop them with therapy because no amount of therapy in the world will convince someone to give up an antisocial behavior that is profiting them.\n\nAnd yes, we marxists do want to remove these antisocial people and replace them with a new system that puts the economy into democratic ownership and control.  This doesn't mean we have to kill those antisocial people, but it certainly will mean forcefully taking their wealth and power.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "apat4891",
                                                                    "body": "So there's a fundamental difference then. You think removing this people with force and violence is what will improve things. I think addressing problems with trauma is needed. You see red, I see blue. Sounds fundamentally irreconcilable.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "palmer_G_civet",
            "body": "Fundamentally liberal question. If you think that the violence in a revolution is not worth it I advise you to consider the incredibly traumatic daily conditions of the modern proletariat. Why is revolutionary violence too much but the daily soul crushing violence of the capitalist system permissible? You seem young so I don't mean for you to take offense but if you truly desire communism you should develop a better understanding of how the world works. For learning more obviously get up to speed on Marx/Engels and I would add Blood in My Eye by George Jackson. He was not a great Marxist but he was a revolutionary who died for his cause, his work might give you a better understanding of why people choose to put themselves through the traumatic violence of being a revolutionary. [https://archive.org/details/george-jackson-blood-in-my-eye](https://archive.org/details/george-jackson-blood-in-my-eye)",
            "score": 2,
            "replies": []
        },
        {
            "author": "Zandroe_",
            "body": "The project of scientific socialism is not of everyone receiving money according to some criterion, but the abolition of money, markets etc. As for the rest, I think you are ignoring the empirical evidence here. People go to war and continue living normal lives. Not all of them, but enough that warfare has been a fairly consistent part of human history since the Neolithic. I'm in my thirties; both of my grandfathers fought in WWII in Yugoslavia and lived perfectly normal lives afterwards, as did most of their peers.",
            "score": 1,
            "replies": [
                {
                    "author": "apat4891",
                    "body": "Most of my clients and their parents are living perfectly normal lives too, nobody sees the mess outwardly. \n\nIn my view there is a mental health pandemic out there, and most people are struggling with their mental health. The authorities and most of society takes notice when a celebrity or someone very young they know hangs themselves, but that's the most extreme manifestation of daily anxiety, loneliness, alienation from their work (sounds Marxist), and such things that cause suffering day in and day out, and as I said in a comment above, can't simply be explained by saying they are the result of capitalism.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Yin_20XX",
            "body": "To answer your precise question at the end, no it is not a problem. My evidence is that revolution has created some of the most morally upright societies in history, namely the USSR.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gold_tiara",
            "body": "Violence is always a justifiable response to violence done against you. It doesn’t make you “the same” as the instigator, nor does it perpetuate an endless cycle of violence. That’s just what the instigators of violence want the victim of violence to believe.\n\nThe alternative is a world where the violent can take from the non-violent in perpetuity. Not responding to violence with violence is incentivising violent people to be violent and is therefore immoral.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OnePunchMister",
            "body": "It's crucial to clarify that violence in a revolutionary context does not necessarily equate to murder. Violence can range from non-lethal actions like physically removing someone from a building to more severe forms, but it doesn't always involve killing. I'm sure you can agree there are justifiable reasons for violence. When you understand the violence done by the capitalist class toward the working class all in the name of profit, you can justify the violence involved in revolution as self-defense.",
            "score": 1,
            "replies": [
                {
                    "author": "apat4891",
                    "body": "I would say the same here as I said to another commentor - [Some questions about Marxism and violence : r/Marxism](https://www.reddit.com/r/Marxism/comments/1ik1pch/comment/mbm5v3u/)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "carrotwax",
            "body": "When i was younger I was a huge admirer of Gandhi.  I read his autobiography and went to India multiple times. \n\nBut when I was younger, I also believed the over simplistic version of history.  Auredhati Roy had a recent interview describing that Gandhi was not the complete saint described by the West.  As with all history, there are so many nuances. \n\nI think we all agree that violence has many lasting negative effects.  But in general, structural violence is almost always undercounted compared to individual violence. \n\nI don't have firm answers, because in all honesty, it's very hard to predict response to resistance.  If the American Revolution resulted in decades of repression and guerrilla warfare that resulted in millions of deaths, we would have a completely different history.  However, my own bias is that  non establishment forces should have more weight than establishment forces by awareness of the power of propaganda. \n\nIt's so easy to not see the years (and millions of deaths) that come from structural violence, and focus on the violence that comes from active resistance.   It takes a clear mind to see past that and be realistic in seeing all effects.",
            "score": 1,
            "replies": [
                {
                    "author": "apat4891",
                    "body": "\\>But when I was younger, I also believed the over simplistic version of history. Auredhati Roy had a recent interview describing that Gandhi was not the complete saint described by the West. As with all history, there are so many nuances.\n\nI like Roy's writings, but her writing on Gandhi is historiographically quite poor, and has been critiqued by some Indian historians quite well. \n\n\\>But in general, structural violence is almost always undercounted compared to individual violence.\n\nI totally agree. \n\nI admire Gandhi and relate to him as a person and what he did in his personal sphere, in the way he inspired people to be selfless and compassionate. Him as a political philosopher and tactician, I am more uncertain about that. I think he himself was uncertain of himself as a philosopher and tactician, and was responding more to what was in the moment present before him. Rajmohan Gandhi, one of his biographers, makes the point that armed revolt in the 1910s in India would have led to brutal repression and failure, similar to the 1857 revolt, and Gandhi's push towards non-violence was partly aimed at averting another such catastrophe for the Indians that would result in mass killings and worse economic exploitation.  The point being that non-violence then was a response to the situation, and it worked to some degree. To displace and implant it in all situations would be quite unthoughtful.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "apat4891",
                            "body": "And of course Gandhi massively failed in a certain way. When the British left Indians started killing each other, causing 1 million deaths, an uncounted number of rapes and arson, and 2 million migrations between India and Pakistan. The so called non-violent freedom movement was seething with hate and violence underneath.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Skybij",
            "body": "Looks like your confusion comes from incorrectly modeled concepts and quite dogmatic argument that violence always breeds violence. First of all, as professional in that particular field, you should be aware of \"professional deformation\" and bias it can cause. You are exposed specifically to cases where violence causes violence, but it doesn't mean that it's only cause and effect scenario that can be possible. For a lot of people, exposure to abuse and violence acts as positive reinforcement, as vacine so to speak, against abuse and violence in their own psyche and behavior. Second point, Marxists don't choose violence, lol. Unresolved contradictions of capitalist systems create crisis and violence of such intensity that only option left to resolve it is through violence. That crisis is created and forced on progressive class(workers) by capitalist systems itself. Think of WW1 that was the last straw for working class and peasants of Russian empire that triggered revolution. In that case, violence was the only option that eventually ended violence and brought peace. And most importantly, created a new system where type of violence and abuse of the previous system is greatly minimized or impossible. It's dialectic logic.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cslyon1992",
            "body": "It is not the proletariat who chooses violence. It is the bourgeoise who leave no choice but violence. This is because they have control over the power dynamic. The proletariat tries every path possible. It is the bourgeoise who inflict violence on the proletariat. You can look at what amazon does to strikers. The capitalist will kill for profit. Examples include round-up, cigarettes, baby formula, baby powder. They bet on stock market crashes. They bet on our lives. They deny our coverage and feed us garbage. They destroy the climate. At some point something has to be done. Something concrete. Something real.",
            "score": 1,
            "replies": [
                {
                    "author": "apat4891",
                    "body": "Despite my postscript, I am curious why so many commentors are responding as if my original post said - \"Please defend violence\". Is there some kind of guilt Marxists feel about their validation of violence that they are unable to see what the question being asked is, that it is about the psychological dynamics of violence and not its morality? \n\nI admit that my original formulation was unclear but I think after the postscript it cannot be more clear!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "cslyon1992",
                            "body": "When you're backed into a corner, especially in the face of a fascist theocracy the last thing you should be thinking about is the psychological dynamics of defending yourself in a class war. That is irrelevant to your short term physical wellbeing which is in immediate danger. It took hitler 64 days to completely dismantle democracy. So while you're contemplating the psychological dynamics of defending yourself against the 4th reich they're going to be building camps, and destroying democracy. Congratulations. \n\nI didnt say violence was the only answer. I clearly stated that the proletariat tries every path available.  It is the bourgeoise that choose violence. The psychological dynamic is irrelevant as ypu do not have a choice in a war. If your opponent is trying to kill you then you have to defend yourself or you die for no reason.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "apat4891",
                                    "body": "Going by that logic Marx should not have written Capital, nobody should be writing, researching, debating, dialoguing, contemplating since we are all being killed by capitalism and the only thing we can do is hit back right now.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "cslyon1992",
                                            "body": ">Going by that logic Marx should not have written Capita\n\nWhat? So dumb.  \n\n>nobody should be writing, researching, debating, dialoguing, contemplating\n\nThis has been done to death.  Look at this sub and the other fifty leftist subs with a bunch of leftists doing this even though its already been done. \n\nPart of being a leftist is communicating period. \n\n>since we are all being killed by capitalism and the only thing we can do is hit back right now.\n\nHow many rallies have you attended? How many meet ups have you done? How much community organization have you done? What steps have you taken period? \n\nWhat are you doing for the cause besides contemplating psychological dynamics of theoretical violence? \n\nI was trying to explain to you that when everything hits the fan its better to be ready to do what you have to do instead of contemplating or reading because that isnt going to do anything.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "apat4891",
                                                    "body": "I am not saying we should be contemplating when everything hits the fan. There seems to be some fundamental miscommunication here! Both you and I are here right now having a discussion, for some reason you think I should not be discussing what I am discussing.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Gertsky63",
            "body": "Is it always wrong to kill? Almost nobody would answer yes to that question. A moment's serious thought and you will be able to think of many examples in which the only moral course of action is to kill.\n\nThis then poses a wider question. What ethical framework does Marxism adopt? \n\nMarxism is not, as it is sometimes described by people commenting in this sub, merely an advanced method and system of analysis of history and geopolitical economics. It is a doctrine: an assembled body of the findings of that method applied with partisanship to the conflict between classes. It is, as Lenin put it, \"the doctrine of the class struggle of the proletariat\". \n\nAny Marxist ethical framework must therefore accord with the goals and desired outcomes of Marxism: which are the victory of the proletariat in the class struggle, the smashing of the bourgeois state, the establishment of a proletarian dictatorship (dictatorship over the bourgeoisie, which can be exercised through advanced forms of proletarian democracy, with a monopoly of force in the hands of the proletariat), the steady assumption of working class ownership and control over the key levers of production, and the progressive planned organisation and reduction of labour culminating in the dissolution of class division and the withering away of the proletarian state so that its forcible functions are no longer required, and its administrative functions are absorbed by society as a whole.\n\nThis goal, communism,  provides the only sustainable future for humanity and the only imaginable basis by which humanity can survive without being thrown back into far more barbaric forms of social organisation and existence, what is more taking place on a planet where deteriorating ecology is ever less able to sustain human life.\n\nTherefore, for the modern Marxist even more than for our antecedents prior to environmental catastrophe beckming imminent, moral questions are indistinguishable from questions concerning the advance or retreat of the working class in its struggle against capital. What advances the class struggle is good, what retards it or throws it backwards is bad.\n\nDoes this mean that the ends justify the means, in Machiavelli's infamous phrase? Yes and no. Yes in the sense that no method is automatically considered morally unacceptable if it can be shown that it advances the class struggle. No in the sense that a method which temporarily advances the class struggle but which fundamentally undermines it in other respects, which undermines the ultimate goal, cannot be said to be good.\n\nIn the days of the Bolsheviks, for example. assassination of an individual local Tsarist official or black hundred organiser could be fitted well within a wider policy of mobilising the Russian proletariat. A general strategy of assassinating officials, however, undermined that goal as it suggested that a terrorist saviour could deliver in place of the mass of the organised working class.\n\nAs the bourgeoisie is an enemy which unleashes the most unbridled violence without the slightest whim, and as it has proved itself so time again, and as it insists on maintaining a monopoly of force in its dealings with the working class, the obvious conclusion is that capitalism cannot be overthrown peacefully and that Marx was right to say that communists aim for the forcible overthrow of existing conditions. To rule out violence as a matter of some kind of general principle is an ipso facto breach of Marxist morality, and is in fact an immoral attempt to delegitimise the force that any slave must use to break their chains.",
            "score": 1,
            "replies": []
        },
        {
            "author": "3corneredvoid",
            "body": "Violence is abundant in capitalism and undergirds the reproduction of capitalist society, but day to day this violence is usually of the speculative, potential kind.\n\nCapitalism is grounded in the struggle of two classes characterised by material conditions that are presumed to be fixed unto violent crisis. There's the proletariat, who must work for a wage so that they don't starve, and the bourgeoisie, who must profit so that they don't have to work for a wage.\n\nHow did the bourgeoisie start off the process that led it to own the means of production? Marx terms that origin point \"primitive accumulation\" and it is presumed to have been violent.\n\nHow does the bourgeoisie prevent the proletariat from seizing the means of production and all its other goods? By ensuring the state's monopoly on violence (discussed by the likes of Hobbes and Weber rather than Marx) is devoted to upholding the law, nine tenths of which aims to guarantee private property rights. \n\nA Marxist might further argue, as Adorno does, that violence inheres in socialisation during childhood development.\n\nUnder capitalism this violence is always already there. Marx's theory doesn't dwell on its necessity to political revolution. That word doesn't appear in CAPITAL, which is not a collection of moral arguments but a compelling critique of capitalist political economy.\n\nOne of the more renowned accounts of the necessity of political violence is Fanon's concerning decolonial violence at the start of THE WRETCHED OF THE EARTH, which I highly recommend. Fanon was also a mental health practitioner which might bring you closer to his standpoints.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Radiant_Music3698",
            "body": "The reasoning is that capitalism causes an immense and constant amount of suffering, that any action, no matter how horrific is justified if done in the service of ending it.",
            "score": 1,
            "replies": [
                {
                    "author": "apat4891",
                    "body": "The end justifies the means, in short.\n\nWhile what I am saying is that the means shape the end. If you kill a person to redistribute his money to poor people the fear and rage of the moments of murder are going to haunt you, wreck your capacity to be calm and compassionate, and make you continue carrying out acts of aggression in some way or another, subtle or overt.\n\nAnd I am asking why communists don't see, for example, that to invade Tibet, to make hundreds of thousands of people flee, to become a threat to their leaders, to kill in mass, to drag monks and nuns out of monasteries and force them to have sex with each other - this can't be driven by compassion for the suffering of people, which I suppose is the original impulse behind Marxism. This can only be explained by something else, and perhaps partly by the fact that the path to power a Marxist takes can brutalise them.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Weary-Performance431",
            "body": "Ever since life first began there has been violence. It started with the first Cyanobacteria eating another organism and gaining chloroplasts. All life that has ever existed evolved from these Cyanobacteria and has built on the fundamental concept of kill to survive. Life evolved over millions of years but one thing never changed. Swim or die. Violence is life and there is no changing that.",
            "score": 1,
            "replies": []
        }
    ]
}