{
    "title": "On a hunt for better news sources",
    "author": "fakegranola",
    "subreddit": "Marxism",
    "rank": 67,
    "score": 31,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 32,
    "url": "https://www.reddit.com/r/Marxism/comments/1ilqd47/on_a_hunt_for_better_news_sources/",
    "id": "1ilqd47",
    "selftext": "I realize there have already been discussions on this and I will absolutely reference those. \n\nFor a while I got a lot of my news from following specific leftist people or accounts that I trusted on instagram since I’d lost faith in most news publications, but obviously that’s not an effective or reliable way to consume news and most of us have done away with Meta anyway post-DEI. Now I mostly read Al Jazeera, Mother Jones, and People’s World. People’s world is clearly a leftist publication so no qualms there, but how to you feel about the first two? I generally trust their reporting but I’m curious to see whether there’s some malpractice I’m not aware of. \n\nIf you have any others you’d recommend I’d love to hear. Thanks!",
    "comments": [
        {
            "author": "stompinpimpin",
            "body": "Al Jazeera is ok on Palestine and horrible on everything else. It is run by gulf monarchs. \n\nJacobin is ok but heavily editorialized, as is People’s world. \n\nI haven't read mother Jones in probably ten years so I'm not sure there.\n\nNo outlet is going to be good on everything, and a lot of leftist outlets just repackage Twitter as journalism or editorialize local news, which again is not journalism. Liberation news and the workers world paper are the worst in this regard. You want to find outlets with actual journalists, whether they're Marxists or not is way less important.\n\nThese days I mainly read the local trade union paper. I don't have as much time to read the news as I used to. When I was able to read more, I subscribed to a bunch of rss feeds and would just read what interests me. I followed org outlets like La via Campesina, Labor notes, cispes, center for food safety, food and water watch, etc; left outlets like counterpunch, People’s world, civil eats, venezuelanalysis, sustainable pulse, corporate crime reporter, covert action, the final call, mint press, San Francisco Bay view, rethinking schools; national and local news outlets (again, ones with actual journalists, a lot of local news actually just republish right wing garbage from other outlets); and foreign socialist party outlets like ang bayan (Philippines), socialist voice (ireland), tribuna popular (Venezuela communist party), etc",
            "score": 10,
            "replies": []
        },
        {
            "author": "F_RankedAdventurer",
            "body": "I've said it before, but Ben Norton's geopolitical economy report should at least be on your radar. He will literally spend an hour just giving you the relevant context with which to receive a current event. Oh, the Niger government just told France to fuck off and the US decided to build a 3 billion dollar base there in response? Guess we're going over the entire political history of Niger 🤷",
            "score": 2,
            "replies": []
        },
        {
            "author": "carrotwax",
            "body": "I like this page as a good start, as it includes not just left/right but how close to establishment a news source is: \n\nhttps://swprs.org/media-navigator/\n\nI sometimes challenge friends to pick a couple sources far from establishment for a couple weeks and see what happens.\n\nAl Jazeera clearly has plenty of establishment ties.  As does Mother Jones, though it's ranked intermediate.  You also may want to check out mronline.org - it's got a long history.",
            "score": 3,
            "replies": [
                {
                    "author": "Gogglez20",
                    "body": "Useful site. Thanks for the information. In podcast world there are some sources on the right not covered like Dan Bongino who I think has the biggest audience. Might be the heir to Rush Limbaugh?? He expresses much traditional conservative pap like free market absolutism but combined with populist MAGA and the expressed vote of Trump as transactional. Steve Bannon who is really the MAGA thought leader also with a large audience where you can be surprised to hear him call for taxing billionaires, abolishing the federal reserve and massive cuts to defence spending. Also called Elon evil and vowed to keep him out of the Whitehouse. So interesting insights into the diversity of views and inner turmoil in MAGA world across these hosts.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "crowdedteeeth",
            "body": "I wanted to add Novara Media to the mix here. They are probably guilty of the same kind of “heavy editorializing” as Jacobin and others. But they do offer a more Eurocentric/English perspective which can be interesting for Americans to get out of their bubble.\n\nhttps://novaramedia.com\n\nDeclassified UK i’ve been looking into more as well. \n\nhttps://www.declassifieduk.org",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bluetooth_Sandwich",
            "body": "* [Grayzone](https://thegrayzone.com/) though some might find it controversial has been pretty straight with it's reporting, although I think Max has an agenda of sorts. \n\n* [Electronic intifada](https://electronicintifada.net/) is another great resource for middle east awareness. \n\n* [TechDirt](https://www.techdirt.com/) is a great resource for tech news from a 'leftest' perspective.\n\n* [Tricontinental](https://thetricontinental.org/) is a solid opinion resource\n\n* [Consortium News](https://consortiumnews.com) founded by Robert Parry who brokered the Contra-Iran story, and a solid reference for US reporting.\n\n* [Current Affairs](https://www.currentaffairs.org/) another opinion outlet from a leftist perspective. They have a physical copy as well.\n\n~~* [Liberation News](https://liberationnews.org/) news outlet, covers around the world.~~ See top comment",
            "score": 1,
            "replies": []
        },
        {
            "author": "AHDarling",
            "body": "For my particular areas of interest (military and geo-political), I have long relied on Antiwar and Moon of Alabama for information. There are a number of IG accounts I follow for Red-specific info, though, as well as keeping an eye on various Party pages.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Electrical-Fig-634",
            "body": "Try https://morningstaronline.co.uk/ there a UK based daily newspaper they work with the trade unions and the British communist party\n\nOtherwise see if your national communist party have any magazines that's where I would start.",
            "score": 1,
            "replies": []
        }
    ]
}