{
    "title": "The DB stands for Didn’t Bounce",
    "author": "EmberSparkling",
    "subreddit": "CuratedTumblr",
    "rank": 5,
    "score": 8902,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 107,
    "url": "https://i.redd.it/n075pgx2uepe1.jpeg",
    "id": "1je0cmk",
    "selftext": "",
    "comments": [
        {
            "author": "YUNoJump",
            "body": "Sudden gust of wind blew him back into the plane and everyone else was distracted so they didn’t see",
            "score": 1142,
            "replies": [
                {
                    "author": "Yarisher512",
                    "body": "he hid in the secret db cooper plane window. nobody knows why planes were manufactured with one.",
                    "score": 479,
                    "replies": [
                        {
                            "author": "Gullible_Promotion_4",
                            "body": "insert Saddam Hussein hiding spot meme here",
                            "score": 197,
                            "replies": [
                                {
                                    "author": "frobscottler",
                                    "body": "Add loss, now we’re cookin",
                                    "score": 62,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "helgihermadur",
                            "body": "He became the CEO of Boeing (under a pseudonym, of course) to create the secret DB Cooper window. It took years of planning and a masters degree in engineering",
                            "score": 57,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Lovingbutdifferent",
                    "body": "BLEW HIM BACK INTO THE PLANE I'm fucking cryingggg",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "PlopCopTopPopMopStop",
            "body": "Jokes aside the most plausible scenario, imo, is that he initially survived the fall with great injuries. He attempted to escape the area to hopefully somewhere where he could seek help for his wounds and died somewhere outside the area where he landed. This at least is the most satisfying explanation for why no remains have been found in the area where he had to have landed, of her died from the fall ",
            "score": 644,
            "replies": [
                {
                    "author": "IronScrub",
                    "body": "I mean that theory still doesn't account for the few stacks of the money that was found a few years after the fact",
                    "score": 281,
                    "replies": [
                        {
                            "author": "PlopCopTopPopMopStop",
                            "body": "I didn't say it's a perfect theory, those don't currently exist. It's just the one I think most satisfying ties together what we can know.\n\n\nUntil we know for a fact what happened, if we ever know, it's unlikely we'll ever come up with a perfect theory",
                            "score": 174,
                            "replies": [
                                {
                                    "author": "Arctic_The_Hunter",
                                    "body": "I mean, “he got away with it and buried the money himself” is a pretty perfect theory. It fits all the evidence. We just don’t tend to enjoy theories that end with “somebody did it and we have no clue who it was.”",
                                    "score": 145,
                                    "replies": [
                                        {
                                            "author": "PlopCopTopPopMopStop",
                                            "body": "Except it isn't a perfect theory? At all\n\n\nFor one...why would he bury the money? For any reason? The bills weren't marked. The only reason we know for certain the bills for the case were bills from this incident is because of after finding the random buried rotting bills people decided to run the serial numbers and traced them back to the DB Cooper incident\n\n\nSomething they never would have done if they had been spent normally or even disposed of at another location. If anything the choice to bury the money made it more likely he'd be caught. Assuming he even did that.\n\n\nAlso have to call bullshit on the idea that people dont enjoy the idea that be survived. People LOVE stories like that. People go nuts for people like the zodiac killer and jack the ripper. There's an entire genre of movies and tv shows about criminal mastermind who challenges the law and get away with anything that pulls in billions \n\n\nThe idea that he died in the forest a bumbling moron who almost managed to get away with the crime of a generation is infinitely more boring than the idea that he survived, ditched the moment for...some reason? Then lived out the rest of his life a free man. That makes for a much better story than he almost succeeded but would up dying like a bumbling moron.\n\n\nIf anything people cling to the idea that he survived for that exact reason. Because that version of the story is cool and intriguing. It's enigmatic. It's the stuff classic films about criminals who mastermind 1 last brilliant scheme to set themselves up for life and never have to do crime again are made up. \n\n\nBut from what we know it just doesn't seem likely. ",
                                            "score": 56,
                                            "replies": [
                                                {
                                                    "author": "TleilaxTheTerrible",
                                                    "body": "> For any reason? The bills weren't marked. The only reason we know for certain the bills for the case were bills from this incident is because of after finding the random buried rotting bills people decided to run the serial numbers and traced them back to the DB Cooper incident\n\nWeren't the serial numbers of the bills published by the fbi within days of the hijacking? Because I'd that's the case, it's not surprising that he (or someone who helped him/found his body) buried the money at a spot where it's not at all suspicious when you're digging holes.",
                                                    "score": 72,
                                                    "replies": [
                                                        {
                                                            "author": "asuperbstarling",
                                                            "body": "If he survived, he would have - as rapidly as was possible at the time, so within a few days - quickly learned that he was the most famous man alive. A man smart enough to get away with the crime DEFINITELY ditches the thing that proves it was him.",
                                                            "score": 38,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "triforce777",
                                                            "body": "The thing is that releasing the serial numbers only matters if someone is checking them, which mostly just means he couldn't use them for large purchases and needed to avoid using them too close to home to draw attention to himself. The banks might notice them but random cashiers are going to stick it in their till and forget about you.",
                                                            "score": 22,
                                                            "replies": [
                                                                {
                                                                    "author": "hauntedSquirrel99",
                                                                    "body": "Surely at least some of them would have ended up in a bank or something by now?",
                                                                    "score": 8,
                                                                    "replies": [
                                                                        {
                                                                            "author": "triforce777",
                                                                            "body": "That's why most people think he died in the jump. If they showed up (because banks were looking, I was only saying he could spend it infrequently) it would mean it survived, but the only cash that had ever been found was a couple of bundles buried on a riverbank near where he would have landed",
                                                                            "score": 22,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "IronScrub",
                                    "body": "Sure, I just meant my comment as a rebuttal to your \"most satisfying conclusion\" since it ignores the evidence that he may have actually survived the drop and made it back to wherever he was from. How can it \"most satisfyingly tie together what we can know\" if it totally ignores one of, like, 6 things we know for sure?\n\nAnd if he *didn't* survive, then with that assumption it would mean someone found the money and, for some reason, buried some of it themsleves instead of announcing the find and collecting the reward. It's possible, some people defy understanding, but it feels like more a stretch to me than just \"DB Cooper buried the money himself.\"",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "PlopCopTopPopMopStop",
                                            "body": "The money could have easily been buried overtime by the ever shifting soil of the river Bank it was found on. Things get buried like that all the time, especially after 9 years. If you wanna believe he buried it you have to have a reason he would do that. Especially right next to the area where authorities would be most likely to search. \n\n\nKeep in mind a key ingredient in this case is the incompetence of the same authorities who lost the most important pieces of evidence to do with the case. Missing a stray bag by a riverbed long enough for it to be buried naturally sounds totally reasonable",
                                            "score": 16,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "avalisk",
                                    "body": "They found DB Cooper.  Someone went to jail for a \"copycat\" crime, and when they went through his inheritors property they found DB cooper's parachute.\n\nEdit:  Richard McCoy Jr. is the name",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "triforce777",
                    "body": "I mean finding remains is pretty hard, it's not uncommon for remains of people lost in the woods to never be found due to them being hidden in foliage, scattered by scavengers, and just decaying.\n\nThat said I think there's 3 possibilities for what happened. Finding his remains if he died during the jump, like from impacting a tree or getting tangled up and dying of exposure, would be easy if his parachute deployed, so either his parachute didn't deploy and he died, he did survive the initial landing but died later on from injuries or exposure, or he survived. I think the chute not deploying also makes sense because in a panic I could see him attempting to deploy the backup before remembering he used it to store the money, and dropping some of the bundles leading to them getting separated from his remains.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "boffer-kit",
                    "body": "Nah, there were five copycats the following year. One of them had even worse conditions and he landed with only a sprained ankle",
                    "score": 34,
                    "replies": [
                        {
                            "author": "PlopCopTopPopMopStop",
                            "body": "That doesn't necessarily mean DB survived. We're talking about controlled tests vs. jumping in the actual moment afterall, any vast number of things could have gone wrong with his parachute assuming it successfully displayed to begin with. \n\n\nWe also assume DB Cooper was an expirriced diver who knows what he was doing, a possibility largely ruled out by investigations at the time that people who want to believe Cooper survived cling to because the theory that he's alive becomes far less likely if you don't think he knew his way around a chute. It's entirely possible DB Cooper wasn't nearly the criminal mastermind people believe he was\n\n\n\nWhat evidence we do have suggests DB Cooper is highly unlikely to have survived. ",
                            "score": 27,
                            "replies": [
                                {
                                    "author": "boffer-kit",
                                    "body": "Okay but there was a copycat hijacker (not a controlled test lmao) who jumped in negative temps, not even a coat, needed to be told how to put on a parachute, and he survived.\n\nDB \"put his parachute on as if he wore one every day\", according to the crew of the airbus, had a bag full of what the FBI theorizes was jumping gear, had relatively tame conditions compared to sprain ankleman, and most importantly was never found.",
                                    "score": 32,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "idiotplatypus",
                    "body": "Sasquatch got him",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "livinglitch",
                    "body": "Knowing where the money was found at the beach, if you follow the river up stream its in a highly populated area and most of the area around it is not to far from a road/high way. I think he could have made it out. If he got caught in a tree, that might be another issue but if that were the case there would have been a skeleton found in a tree by now.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Waity5",
            "body": "[Relevant XKCD](https://xkcd.com/1400)",
            "score": 237,
            "replies": [
                {
                    "author": "DevilDashAFM",
                    "body": "there always is a relevant XKCD",
                    "score": 54,
                    "replies": [
                        {
                            "author": "SocranX",
                            "body": "I mean, this one literally referenced the xkcd in question.  It's kind of cheating to say, \"Man, there's an xkcd for everything, even this post that references xkcd!\"",
                            "score": 53,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "gur40goku",
            "body": "Loki did it",
            "score": 160,
            "replies": [
                {
                    "author": "frankwalsingham",
                    "body": "That last rebolob is what Loki did.",
                    "score": 35,
                    "replies": []
                }
            ]
        },
        {
            "author": "Damian1674",
            "body": "The sky ate him",
            "score": 94,
            "replies": [
                {
                    "author": "MossyAbyss",
                    "body": "Shouldn't have dove out with the Fairchilds.",
                    "score": 32,
                    "replies": [
                        {
                            "author": "NoBizlikeChloeBiz",
                            "body": "\"DB Cooper is a Fairchild\" is my new DB Cooper theory ",
                            "score": 13,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "frobscottler",
                    "body": "Eaten BY the SKY",
                    "score": 11,
                    "replies": [
                        {
                            "author": "SkyGuardianOfTheSky",
                            "body": "🤤",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "msa491",
                    "body": "Flair doesn't check out so much as sends up fireworks and waves giant flags",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Billbert-Billboard",
                    "body": "Enjoy DB Blue?",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "Digitigrade",
                    "body": "Langoliers.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "RoiKK1502",
                    "body": "Flair definitely checks out",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "gulugulufishy",
                    "body": "flair checks out",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dragonfire723",
            "body": "DB Cooper transitioned and is still a missing person case because of it",
            "score": 102,
            "replies": [
                {
                    "author": "Undead_Knave",
                    "body": "I remember seeing someone a couple months ago telling a story about a wealthy older woman in the Family who mentioned that a lot of missing person cases were just people transitioning and moving (and sometimes taking their death) and implying that her missing person cases had been pretty big news back in the day.",
                    "score": 90,
                    "replies": [
                        {
                            "author": "frobscottler",
                            "body": "Taking their death",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "Undead_Knave",
                                    "body": "Yeah, well, typos will happen on mobile.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TruestRepairman27",
                    "body": "Debbie Cooper",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "Leaving_a_Comment",
                    "body": "I watched a doc about DB Cooper and they had a couple on there that insisted their trans neighbors was Cooper because she had pilot knowledge and stuff. Low key it’s my favorite conspiracy theory.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "Vulpecula22",
                    "body": "You joke but there is one suspect (in the sense she claimed to be DB at one point) that was a trans woman, Barbara Dayton. Though she is one of the least likely suspects.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "haikusbot",
                    "body": "*DB Cooper transitioned and*\n\n*Is still a missing person*\n\n*Case because of it*\n\n\\- Dragonfire723\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")",
                    "score": 12,
                    "replies": [
                        {
                            "author": "CreeperDude17",
                            "body": "Good bot",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "B0tRank",
                                    "body": "Thank you, CreeperDude17, for voting on haikusbot.\n\nThis bot wants to find the best and worst bots on Reddit. [You can view results here](https://botrank.pastimes.eu/).\n\n***\n\n^(Even if I don't reply to your comment, I'm still listening for votes. Check the webpage to see if your vote registered!)",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BergenHoney",
                    "body": "That's now my favourite theory",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "thyfles",
            "body": "he transformed into another plane",
            "score": 27,
            "replies": [
                {
                    "author": "PhasmaFelis",
                    "body": "A few years later he started harassing Autobots",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "frobscottler",
                    "body": "Airplane/plane of existence/I’m on the plain…. I can’t complain",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "pretty-as-a-pic",
            "body": "Some say he’s still out there, falling",
            "score": 47,
            "replies": []
        },
        {
            "author": "Dwagons_Fwame",
            "body": "The SCP foundation found and stole his body because he had an SCP for a suitcase. No really there’s an SCP article someone has written lmao",
            "score": 51,
            "replies": [
                {
                    "author": "alexlongfur",
                    "body": "The one that changes into something you’re tempted to stick your hand into?",
                    "score": 12,
                    "replies": [
                        {
                            "author": "Dwagons_Fwame",
                            "body": "Believe so, yes. Gotta be honest I don’t remember lol",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "ManOnTheRun73",
                                    "body": "Yup, that one: [SCP-101](https://scp-wiki.wikidot.com/scp-101)",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Far-Profit-47",
            "body": "I mean, if there’s no proof of the contrary, him going up is a totally plausible scenario we can’t roll off the table and must be treated with just as if not more importance than the ones with scientific calculations and actual logic behind them",
            "score": 86,
            "replies": [
                {
                    "author": "1000LiveEels",
                    "body": "if all of them are plausible then i'm DB cooper",
                    "score": 38,
                    "replies": [
                        {
                            "author": "oddityoughtabe",
                            "body": "GET HIM",
                            "score": 22,
                            "replies": []
                        },
                        {
                            "author": "sharrancleric",
                            "body": "WE GOT YOU, COOPER\n\nTHAT'S RIGHT THIS WHOLE THING WAS A STING OPERATION\n\nBOOK IM, BOYS",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "VendettaSunsetta",
                    "body": "Appeal to ignorance fallacy. I do think he went up though.",
                    "score": 13,
                    "replies": []
                }
            ]
        },
        {
            "author": "bageltoastee",
            "body": "• he went sideways and his body has been blasting through the atmosphere for the past few decades, accounting for over half of the reported UFO sightings in the USA.",
            "score": 18,
            "replies": [
                {
                    "author": "Dracorex_22",
                    "body": "Low orbit",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SocranX",
            "body": "Fun fact:  His pseudonym was actually Dan Cooper, and \"D.B.\" was written in a news article by mistake.",
            "score": 13,
            "replies": []
        },
        {
            "author": "TacoMaster6464",
            "body": "Covered himself in oil and ascended in storm",
            "score": 10,
            "replies": []
        },
        {
            "author": "ghostlyAlchemist",
            "body": "SANS\n\nSDBCOOPER\n\nAFTER\n\nNOT\n\nSURVIVING",
            "score": 10,
            "replies": []
        },
        {
            "author": "aka_Handbag",
            "body": "He said his name was Dan. There was a suspect with the initials DB, a journalist saw that and ran with it.\n\nHe said his name was Dan.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Acceptable_Buy177",
            "body": "He actually fell into a tear in reality and ended up in Mallorca in the 1740s. The clockwork elves told me.",
            "score": 10,
            "replies": []
        },
        {
            "author": "Dingghis_Khaan",
            "body": "Can't be Tommy. Tommy is a unique enigma. DB Cooper was explicitly nondescript.",
            "score": 13,
            "replies": [
                {
                    "author": "KirbyDude25",
                    "body": "That just makes even better, no one would suspect a thing!",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "FourScoreTour",
            "body": "> He went up\n\nEntirely possible with a parachute in a storm.  He might have been dead long before hitting the ground (assuming he came down eventually).",
            "score": 3,
            "replies": []
        },
        {
            "author": "GIRose",
            "body": "I am a big fan of time travel personally",
            "score": 3,
            "replies": []
        },
        {
            "author": "KitsuneEX7622",
            "body": "Are you all forgetting that the god of mischief Loki is DB cooper?",
            "score": 3,
            "replies": []
        },
        {
            "author": "Zariman-10-0",
            "body": "Well, obviously it was Loki after he lost a bet to Thor",
            "score": 3,
            "replies": []
        },
        {
            "author": "moneyh8r_two",
            "body": "Anyone ever seen the movie \"Without a Paddle\"? I think what happened to him there is what happened to him.",
            "score": 2,
            "replies": []
        },
        {
            "author": "OCD-but-dumb",
            "body": "Monument mythos ass post",
            "score": 2,
            "replies": []
        },
        {
            "author": "Vulpecula22",
            "body": "I guess the McCoy kids claims didn't pan out lol.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Jarsky2",
            "body": "Well, if Leverage is to be believed, he survived, gave the cash to his war buddy's family, married the flight attendant he held hostage (who fell in love wuth him on the plane btw), then became friends with the FBI agent hunting him, joined the FBI specifically as the perfect cover, solved hundreds of cold cases, then years later while his former FBI partner (who may or may not have known all along who he was, it's ambiguous) is on his deathbed, a crack team of a Grifter, Thief, Hacker, Hitter, and Mastermind uncover the truth. \n\nGod I love that episode.",
            "score": 2,
            "replies": []
        },
        {
            "author": "stopharmingme",
            "body": "hello TJ Hess PFP",
            "score": 2,
            "replies": [
                {
                    "author": "WolfOfFury",
                    "body": "Glad I'm not the only one who noticed",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ExtremlyFastLinoone",
            "body": "He landed safely and posts on reddit under the username \"extremlyfastlinoone\"",
            "score": 2,
            "replies": []
        },
        {
            "author": "Knightfires",
            "body": "It was Loki all the time. That’s why he is still flying. He never touched the ground.",
            "score": 1,
            "replies": [
                {
                    "author": "GravityBright",
                    "body": "He’s been falling for thirty minutes.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Knightfires",
                            "body": "Some say he’s still falling",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SeaSiSee",
            "body": "He landed in the woods, found a group of twinks who run all day (one of which has jaundice), and fought Bigfoot",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wife_Trash",
            "body": "Jesus it's raining coopers out there.",
            "score": 1,
            "replies": []
        },
        {
            "author": "grabsyour",
            "body": "nah he def survived the fall",
            "score": 1,
            "replies": []
        },
        {
            "author": "Robey0925",
            "body": "Got abducted by aliens mid fall",
            "score": 1,
            "replies": []
        },
        {
            "author": "Educational-Soil7659",
            "body": "Enoch walked with God, and he was not, for God took him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "baldsaiyan",
            "body": "He aimed for the ground but somehow missed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "d_b_cooper",
            "body": "Shh dude be cool",
            "score": 1,
            "replies": []
        },
        {
            "author": "BlindProphet_413",
            "body": "This is the kind of solid gold content I'm in this sub for.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sogiotsa",
            "body": "Pretty sure he fought Bigfoot with a bunch of shirtless young men",
            "score": 1,
            "replies": []
        },
        {
            "author": "livinglitch",
            "body": "But it wasn't raining that night. The rain thing was added for dramatic effect. You can go and look up the weather history for that area. Lots of places have it online. It was roughly 50 degrees that night. The lowest was around the mid to low 40s. Someone in a wool suite could have survived that with an extra hat and gloves in a brief case.",
            "score": 1,
            "replies": []
        },
        {
            "author": "laziestmarxist",
            "body": "https://www.reddit.com/r/oddlysatisfying/s/8AwN7phoog",
            "score": 1,
            "replies": []
        },
        {
            "author": "CenterOfEverything",
            "body": "For a hot second I thought this was about Dale Bartholomew Cooper",
            "score": 1,
            "replies": []
        },
        {
            "author": "CeruleanEidolon",
            "body": "\"I did not hijack that plane, I did naht!  Oh hi Mark.\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "imsmartiswear",
            "body": "The FBI recently found decades-old parachute material on a rooftop near the drop zone, suggesting that it's at least plausible that he survived.",
            "score": 1,
            "replies": []
        },
        {
            "author": "natziel",
            "body": "He did the thing where you pretend to jump out a window but you actually don't, and everyone fell for it cuz their brains were rotted from leaded gasoline",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lovingbutdifferent",
            "body": "Oh my god. \"He went up\" never fails to make me bust a gut laughing. I find this post again every year or two, long enough to make me forget about my favorite joke of all time, and then it slams into me like a fucking train. Here I am again, tears streaming down my face and wheezing as silently as I can into my hand in a quiet office. *He went up.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hyro0o0",
            "body": "\"He's been taken up!\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "tintin4506",
            "body": "I dont know, if I successfully got away with a planejacking even by miracle, the first thing I'd do is convince everyone I died.",
            "score": 1,
            "replies": []
        },
        {
            "author": "americanistmemes",
            "body": "It was Loki",
            "score": 1,
            "replies": []
        },
        {
            "author": "Voltikko",
            "body": "An OVNI abducted after he jump from the plane",
            "score": 1,
            "replies": []
        }
    ]
}