{
    "title": "“Tall, dark, and handsome brooding edgy man who is dangerous to others but nice to you” is the generic anime waifu for straight women",
    "author": "NeonNKnightrider",
    "subreddit": "CuratedTumblr",
    "rank": 2,
    "score": 3611,
    "upvote_ratio": 0.89,
    "num_comments (reported by reddit)": 458,
    "url": "https://i.redd.it/3bzzqk5k3hpe1.jpeg",
    "id": "1je8qts",
    "selftext": "",
    "comments": [
        {
            "author": "Darthplagueis13",
            "body": "“The appearance of this man was, to put it briefly, unlike that of any other man whether Greek or barbarian seen in those days on Roman soil. The sight of him inspired admiration, the mention of his name terror. I will describe in detail the barbarian's characteristics. His stature was such that he towered almost a full cubit over the tallest men. He was slender of waist and flanks, with broad shoulders and chest, strong in the arms; overall he was neither too slender, nor too heavily built and fleshy, but perfectly proportioned - one might say that he conformed to the ideal of Polyklitos. His hands were large, he had a good firm stance, and his neck and back were compact. If to the astute and meticulous observer he appeared to stoop slightly, that was not caused by any weakness of the vertebrae of the lower spine, but presumably there was some malformation there from birth. The skin all over his body was very pale, except for his face which was pale but with some colour to it too. His hair was light-colored and did not go down to his shoulders as it does with other barbarians; in fact, the man had no great predilection for long hair, but cut his short, to the ears. Whether his beard was red or of any other color I cannot say, for the razor had passed over it closely, leaving his chin smoother than any marble. However, it seemed that it would have been red. His eyes were light-blue and gave some hint of the man's spirit and dignity. He breathed freely through nostrils that were broad, worthy of his chest and a fine outlet for the breath that came in gusts from his lungs.\" \n\n  \n\\- Byzantine princess Anna Komnene describing Prince Bohemond of Taranto (one of the key figures in the First Crusade), roughly 1148.",
            "score": 144,
            "replies": [
                {
                    "author": "DoubleBatman",
                    "body": "“I just don’t get what you see in him, Anna.”\n\nAnna:",
                    "score": 26,
                    "replies": []
                },
                {
                    "author": "coffeestealer",
                    "body": "Good for Anna!",
                    "score": 40,
                    "replies": []
                },
                {
                    "author": "ErsatzHaderach",
                    "body": "\"Shut up and kiss me\" — Bohemond",
                    "score": 21,
                    "replies": [
                        {
                            "author": "Darthplagueis13",
                            "body": "If only...",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sir_Insom",
            "body": "Ain't nothing wrong with being sex-obsessed if you're honest about it and still capable of writing a good story. It's only when characterization and narrative suffer that it's a problem.",
            "score": 1405,
            "replies": [
                {
                    "author": "Mr7000000",
                    "body": "Honestly even if characterization and narrative do suffer that's not always a problem. If the sex is good, then the sex is good. If I pick up a copy of _Collared in the Dungeon of Voracious Appetites,_ my #1 priority is that the appetites are voracious— plot and character is a bonus.",
                    "score": 410,
                    "replies": [
                        {
                            "author": "lit-torch",
                            "body": "I honestly have no clue if this is a real title or an excellent joke. I’m like exactly 50/50 on this. ",
                            "score": 58,
                            "replies": [
                                {
                                    "author": "Mr7000000",
                                    "body": "It's a joke, but if you want it to be a real title, I'm open to commissions.",
                                    "score": 66,
                                    "replies": [
                                        {
                                            "author": "lit-torch",
                                            "body": "Not my kink but godspeed, soldier. ",
                                            "score": 27,
                                            "replies": []
                                        },
                                        {
                                            "author": "GrassWaterDirtHorse",
                                            "body": "Damn, I wish I was rich enough to start a grant foundation to pay horny authors to write the kind of stuff they want. \n\nSend an abstract/synopsis, a CV including your AO3 username, and then we'll get back to you in 3-4 days or however long it takes for the staff to read it twice (once during work, and once at home with their pants off).",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "CadenVanV",
                                    "body": "Nah, it would have a different title. *His Dark Appetites* or something",
                                    "score": 15,
                                    "replies": []
                                },
                                {
                                    "author": "MushroomLevel4091",
                                    "body": "It may take changing the order or swapping out some words for adjectives but I can all but guarantee it is, in some format",
                                    "score": 10,
                                    "replies": []
                                },
                                {
                                    "author": "BloodyBurney",
                                    "body": "I work at a library with an adult's paperback section, and its a lot closer than you'd think lmao.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Sir_Insom",
                            "body": "True, but I think the point of *Collared in the Dungeon of Voracious Appetites* is to be smut. Whereas if you're reading something that's not smut and notice that the writing seems to suffer when it gets horny, it's a lot more aggravating. Creators should be free to be horny, but the effectiveness and appropriateness of the horny in their work depends on what the intended purpose of their work is.",
                            "score": 207,
                            "replies": [
                                {
                                    "author": "RiverAffectionate951",
                                    "body": "Me when I'm reading *Fields of Verdun, the Unburied* and the writer keeps making things horny. Smh",
                                    "score": 78,
                                    "replies": []
                                },
                                {
                                    "author": "this_shit",
                                    "body": ">  but I think the point ... is to be smut.\n\nSmut is art, and I like smut.\n\nIt's not the only thing I like, but it's one of them.\n\nPorn can also be art. There are pornographic dance videos, for example. It's expressive, and horny, and porn, and art all rolled into one. Because getting off while also feeling inspired or challenged about how you're getting off is actually nice and fine.",
                                    "score": 45,
                                    "replies": [
                                        {
                                            "author": "lord_baron_von_sarc",
                                            "body": "If I just want to nut off, there's tons of content on the Internet that can help me with that, it takes a real visionary to help me nut in a way that touches my heart like I'm touching myself, y'know?",
                                            "score": 11,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "ZinaSky2",
                                    "body": "That’s exactly what they were saying. Smut doesn’t need plot but if a book is claiming to have a plot then *horny* better not be its main focus and have the plot suffer for it",
                                    "score": 16,
                                    "replies": []
                                },
                                {
                                    "author": "LeftyLu07",
                                    "body": "I can always tell it's a horny male writing when a female character is randomly hyper aware of her breasts and/or nipples outside of a bedroom situation.",
                                    "score": 11,
                                    "replies": []
                                },
                                {
                                    "author": "Luminis_The_Cat",
                                    "body": "Some of my favorite anime are gratuitous ecchi anime that I watched for that explicit purpose, but get that shit out of my sight when I'm trying to watch literally any other genre",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "insomniac7809",
                                    "body": "I mean if they made their work horny presumably they intended for their work to be horny",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Dekarch",
                                            "body": "Look, people can read a laundry list in a horny way.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Caramelthedog",
                            "body": "I mean I would also very much be wanting both dungeons and collaring too. Gotta deliver on the whole promise.",
                            "score": 23,
                            "replies": []
                        },
                        {
                            "author": "ZinaSky2",
                            "body": ">>my #1 priority is that the appetites are voracious \n\nDying 😂",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Lathari",
                                    "body": "So the characters should be “slobbering and ravening with delight.”?  \n\nhttps://www.mcsweeneys.net/articles/arkham-board-of-health-feedback-on-miskatonic-universitys-draft-plan-for-a-safe-campus-reopening",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "LeatherHog",
                    "body": "Or when they try to justify it, like it's so important, ie Quiet or Power Girl",
                    "score": 142,
                    "replies": [
                        {
                            "author": "Bowdensaft",
                            "body": "Tbf Power Girl's entire existence is that very point, her artist kept drawing her with bigger boobs until she was noticed",
                            "score": 65,
                            "replies": [
                                {
                                    "author": "LeatherHog",
                                    "body": "I don't mind that part, it's that memed scene of her acting like the boob window is so deep and and thought out",
                                    "score": 48,
                                    "replies": [
                                        {
                                            "author": "Oturanthesarklord",
                                            "body": "Originally, it was just because she was a bit of an exhibitionist, she liked dressing sexy. Then Geoff Johns happened.",
                                            "score": 39,
                                            "replies": []
                                        },
                                        {
                                            "author": "Bowdensaft",
                                            "body": "Oh yeah, I forgot about that one. Something about it representing a hole in her heart, or something. I prefer her earlier justification where she's just like \"look if you want, idgaf, I'm gonna punch your lights out now\". Much more succinct and badass imo.",
                                            "score": 50,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Jay_R_Kay",
                                    "body": "That's kind of a myth -- there might have been some growth, but she was a fairly buxom character to start, and there was some times where she didn't even have the window, but a pain white unitard. She didn't really get \"Big\" until like a decade or two later.",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Sir_Insom",
                            "body": "Personally, I think having an in-universe reason for horny is a good thing so long as the creator is honest about their horniness. I vaguely recall Kojima being honest that he designed Quiet that way because he wanted to see cosplay of her and then came up with an in universe reason afterwards.",
                            "score": 144,
                            "replies": [
                                {
                                    "author": "MrCapitalismWildRide",
                                    "body": "He may have admitted that at some point, but in the interim he still doubled down with that whole \"you will be ashamed of your words and deeds\" comment.\n\n\nAnd then it turned out that the reason why Quiet needed to dress like that didn't even hold up in universe.\n\n\nNow if Delta comes out and The End is wearing nothing but bikini briefs and pantihose, then I'll have more respect for that explanation. ",
                                    "score": 114,
                                    "replies": [
                                        {
                                            "author": "LeatherHog",
                                            "body": "Yeah, if he just wanted to see a half naked woman? Sure, whatever \n\n\nIt's the 'ShE bReAtHeS tHrOuGh HeR sKiN' crap that gets me\n\n\nC'mon man, no one's buying that",
                                            "score": 53,
                                            "replies": [
                                                {
                                                    "author": "Sir_Insom",
                                                    "body": "Both can be true.\n\nThe Watsonian Explanation: \"She breathes through her skin.\"\n\nThe Doylist Explanation: \"I wanted her to run around in a bikini and pantyhose because that's hot.\"\n\nThe latter caused the former.",
                                                    "score": 63,
                                                    "replies": [
                                                        {
                                                            "author": "AtomDChopper",
                                                            "body": "I know who Watson and Doyle are, Character and Writer. But I never heard this way of categorizing as if this are some philosophical schools",
                                                            "score": 17,
                                                            "replies": [
                                                                {
                                                                    "author": "Septistachefist",
                                                                    "body": "it's a pretty handy thing to know when discussing media honestly. Importantly, it's not just Watson because he's a character, but because he's the one writing down Sherlock Holmes' adventures in-universe, so he as a character must justify any decision in-universe. \"Why did Holmes do that\" must be explained by Watson within the story, even if the reason Sir Arthur Conan Doyle wrote it is because it needed to happen to further the plot. \n\nBasically; how would the answer to a question about the plot differ, if you asked it of *both* Watson and Doyle? \n\nIt's a very fun thing to think about for me, especially when discussing stuff like plot holes - you can attempt to piece together an in-universe narrative to justify the plot hole, even though the very clear answer is the Doylist one (\"the author made a mistake\").",
                                                                    "score": 39,
                                                                    "replies": [
                                                                        {
                                                                            "author": "AtomDChopper",
                                                                            "body": ">Importantly, it's not just Watson because he's a character, but because he's the one writing down Sherlock Holmes' adventures in-universe,\n\nOhh I didn't know that tidbit. That explains it for me, thanks",
                                                                            "score": 11,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Sir_Insom",
                                                                    "body": "They're less philosophical schools and more shorthand for dropping an explanation for why something is the way it is in universe or out of universe.\n\n[https://tvtropes.org/pmwiki/pmwiki.php/Main/WatsonianVersusDoylist](https://tvtropes.org/pmwiki/pmwiki.php/Main/WatsonianVersusDoylist)",
                                                                    "score": 22,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Southern-Wafer-6375",
                                                    "body": "One time I actusly did that of breathing through their skin thing and I relised like a week later oh huh thars prob gonna look like a kink thing to someone then I shrugged and whent back to drawing naked ladies",
                                                    "score": 13,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "maxixs",
                                                    "body": "i feel like with kojima the weird in-universe explanations are also part of the horny",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Sir_Insom",
                                            "body": "I haven't played MGS5 so feel free to correct me, but isn't the issue that Quiet's lungs are damaged so she needs to breath through her skin whereas The End is perfectly fine? Also, something about their symbiotes manifesting differently. Quiet's makes her more directly superhuman while The End's just slows down his aging and bodily functions.",
                                            "score": 14,
                                            "replies": [
                                                {
                                                    "author": "MrCapitalismWildRide",
                                                    "body": "Oh boy, the Death Stranding 2 trailer just came out, so I didn't think I'd get to play another round of \"What's wrong with Hideo Kojima?\" so soon.\n\n\nIt's played like this:\n\n\nPerson 1 tries to remember what happened in the previous franchise entry \n\n\nPerson 2 reminds them of a detail they forgot \n\n\nPerson 1 says \"That's the stupidest thing I've ever heard\"\n\n\nPerson 2 says \"Are you sure? Because all the other stuff you said was stupid too\"\n\n\nAll of that is to say, I haven't played MGSV in a decade so you may be right. ",
                                                    "score": 34,
                                                    "replies": [
                                                        {
                                                            "author": "ErsatzHaderach",
                                                            "body": "i am a huge Kojima fan and this is so accurate",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "HostileReplies",
                                            "body": "People take the \"you will be ashamed of your words and deeds\" comment out of context. People were bashing him as a misogynist because of Quiet's design and only because of Quiet's design, which is a crazy accusation to make outside of the western left-leaning sphere of the internet that demonizes male sexuality. Even if Quiet was literally just meant to be eye candy, it's a big leap to be able to justify calling him a misogynist.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Scorkami",
                                    "body": "It also depends. Theres a scale between \"this person is sexy because x and it makes sense\" and \"this person is sexy and im excusing it with x and we all know it\"\n\nQuiet could survive with a sports bra and short shorts. The tights actually dont make sense, for example\n\nPowergirl just saying \"i got nice legs and nice cleavage, and the window helps a bit with sweat, why should i wear something ugly to fight crime?\" Would be totally fine by me because frankly i know enough girls who learned sewing just so they can buy any skirt and make it shorter, or have the jeans be more form fitting.\n\nThe creator of 2B saying \"i like maids and skirts\" is also fine out of universe but frankly, the question of \"why is the android so well shaped\" is gonna come up anyway",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "Jay_R_Kay",
                                            "body": "Funnily enough, the most recent explanation for the window was attributed to boob sweat.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Scorkami",
                                                    "body": "Frankly, can you imagine how relieving it must be to fly at mach speed and have a cool fan blowing down your chest?",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Jfelt45",
                                    "body": "I always find it funny that there is a functional in universe reason why the androids in nier automata look like that; they revere their human creators so much that it reaches the point of fetishization of them, but when asked about it based Yoro Tako just said he likes pretty girls",
                                    "score": 20,
                                    "replies": [
                                        {
                                            "author": "TwilightVulpine",
                                            "body": "Seems perfect to me that the suspiciously humanoid androids are as horny for humans as humans are to them",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "RechargedFrenchman",
                                                    "body": "At some point if they're *not* weirdly, uncomfortably horny they just aren't that close to \"human\".",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "greg_mca",
                                    "body": "I first read that as Keijo instead of Kojima, cos yeah that tracks",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "thomasp3864",
                            "body": "I find the fact Power Girl uses it to keep her secret identity absolutely hilarious.",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "LeatherHog",
                                    "body": "That is actually pretty funny ",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "thomasp3864",
                                            "body": "I will say also that supposedly the reason for the hole is because the character's creator really didn't want an emblem with a P on her chest since he thought that would look stupid.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Swaxeman",
                            "body": "Did you actually read the comic? The whole “it represents depression” thing was cuz of psycho pirate fucking with her mind",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "LeatherHog",
                                    "body": "Fair enough, did they at least retcon that at least, then?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Swaxeman",
                                            "body": "They never retconned it because it was never an issue, it was a single page of her saying something stupid due to again, being mind controlled by psycho pirate",
                                            "score": 11,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "AwesomeRobot64",
                            "body": "Quiet is fine because the entire game is horny",
                            "score": 12,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "mucklaenthusiast",
                    "body": "I don't even think that is true.\n\nPeople are allowed to enjoy a bad story.\n\nI genuinely don't think it's morally bad to write a bad story that people like and enjoy, even if it's just thinly-veiled slop bordering on porn",
                    "score": 28,
                    "replies": [
                        {
                            "author": "Falling-Apples6742",
                            "body": "I completely agree. But I also think that it's the responsibility of whoever wrote/produced/published/posted/whatever the story to communicate what kind of story it is so the audience can know what they're getting into and adjust expectations. \n\nFor instance, I find it extremely frustrating when I get into a piece of media thinking it's \"historical romance\" or \"political intrigue with romance/smut\" and find out that it's actually \"smut set in the past\" or \"smut between political rivals.\" (I absolutely hated it when I started a historical fantasy trilogy and the writer was like, \"Psych! It was a post-apocalyptic sci-fi fantasy all along!\")\n\nI love a bad story almost as much as I love a good story. But it's hard for me to enjoy a bad story if the wrong expectations have been set.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "Sir_Insom",
                            "body": "The point here is more about how horny writing can affect the quality of the material, not that enjoying subpar material is bad. If the intent is to write a genuinely good story, but the author's horniness is getting in the way, then that seems like a problem. People are free to enjoy whatever they want, regardless of its quality.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "crazynerd9",
                            "body": "I, too, watch a lot of terrible anime",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "mucklaenthusiast",
                                    "body": "I wouldn't say I watch a lot of terrible anime.  \nJust a good amount!",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Graingy",
                    "body": "Until you scale to the existential, but there’s no use arguing over that here.",
                    "score": 52,
                    "replies": [
                        {
                            "author": "wwsaaa",
                            "body": "What do you mean? I feel like I probably agree but I’m not sure what you’re getting at. Let’s argue about it here.",
                            "score": 26,
                            "replies": [
                                {
                                    "author": "StoppableHulk",
                                    "body": "You know, existential sex, like when you fuck a celestial-sized ball of screaming goat heads hurtling through the void, or suck off the manifestation of grief in the despair dimension to try and appease your way out of mourning the loss of a loved one.\n\nRegular existential sex stuff.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Graingy",
                                    "body": "Whether humanity embracing its primitive and bestial drives from the savanna is necessarily a good path to take when the universe awaits.\n\nPersonally, I say overhaul the entire species, this whole sex thing being one of *many* things to go.\n\nOf course, nobody here likes me saying that so I will now place a bet with myself for how badly dogpiled I’m about to get. If I guess within the right range I think I’ll get myself a little something special.",
                                    "score": -40,
                                    "replies": [
                                        {
                                            "author": "tergius",
                                            "body": ">Personally, I say overhaul the entire species, this whole sex thing being one of *many* things to go.\n\njust 'cause you don't like it doesn't mean nobody else gets to have it\n\nit's fine if you're asexual or whatever but c'mon.",
                                            "score": 43,
                                            "replies": [
                                                {
                                                    "author": "Graingy",
                                                    "body": "Oh please go on I want to buy something silly",
                                                    "score": -26,
                                                    "replies": [
                                                        {
                                                            "author": "tergius",
                                                            "body": "i would post a funny image but i can't on this sub",
                                                            "score": 8,
                                                            "replies": [
                                                                {
                                                                    "author": "Graingy",
                                                                    "body": "This is a tragedy beyond all others.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "LenoreEvermore",
                                            "body": "This is... So strange. I'm asexual too but I don't think sex is some primitive urge that needs to be weeded out before we can progress as a race. We just need a better political system and for people to not be rewarded for being selfish and we'd have intergalactic travel in no time.",
                                            "score": 20,
                                            "replies": [
                                                {
                                                    "author": "Graingy",
                                                    "body": "The only path to anywhere is transhumanism. Anything else is like trying to run an ocean line with wooden sailing ships. Cut out some bad, might as well cut out all of it.",
                                                    "score": -12,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "sans_a_name",
                                            "body": "Kryptonian mindset",
                                            "score": 17,
                                            "replies": [
                                                {
                                                    "author": "Graingy",
                                                    "body": "Mars rock, but I’ll take it.",
                                                    "score": -5,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "DareDaDerrida",
                                            "body": "No thanks. You are allowed to do whatever you like in your personal life, but I like sex, as do a bunch of people I like.",
                                            "score": 16,
                                            "replies": [
                                                {
                                                    "author": "Graingy",
                                                    "body": "Keep it entirely to yourself and let the culture around it die, I say. Total abstinence is unrealistic, but excessive indulging? Building entire industries around it? Absolutely not.",
                                                    "score": -4,
                                                    "replies": [
                                                        {
                                                            "author": "DareDaDerrida",
                                                            "body": "Also no.\n\nI very much enjoy many of the cultures built around sex, and I'm quite fond of a few of the industries too.\n\nWhy would I not want society to produce things I like?",
                                                            "score": 11,
                                                            "replies": [
                                                                {
                                                                    "author": "Graingy",
                                                                    "body": "You’re a hedonist in the year 2025, not someone actually going anywhere meaningful. Of course you’re only concerned with what’s directly in front of you.",
                                                                    "score": -2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "DareDaDerrida",
                                                                            "body": "You are a mildly rude person on the internet in the year 2025, not a reasonable discussion-partner (not the transhumanist messiah you play at being either, but that's beside the point). Of course you can't help but turn your personal preferences into an ethos.",
                                                                            "score": 16,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Graingy",
                                                                                    "body": "Everyone’s preference is a worldview. As I started with, it’s existential. You think about the present, I think about the future.\n\nUnlike everyone else, apparently, I realize that maybe, just maybe, it’s pretty uncool to pass down negative traits if you can help it.",
                                                                                    "score": 0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "DareDaDerrida",
                                                                                            "body": "Not every preference needs to be established as a standard for other people's behavior.\n\nThink about the future all you like. Pass down no traits of which you disapprove. Nobody will mind.\n\nIf you chose to harangue others about having sex or enjoying pornography, however, people will periodically say impolite things to you, or otherwise express the desire that you mind your own business.",
                                                                                            "score": 11,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Graingy",
                                                                                                    "body": "And yet every standard is a preference.\n\nAnd for goodness sake, *everyone* takes issue with the actions of others. I am hardly unique in that regard. What is less common is the set of issues which most irk me.",
                                                                                                    "score": -1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "DareDaDerrida",
                                                                                                            "body": "The actions that irk you (or at least the ones you've talked about here) are uncommon but hardly unique.\n\nYour yapping about said irksome actions on the internet while insisting that all who don't share your preferences are less enlightened than you is incredibly common, and what most people seem to be objecting to. \n\nSaying things like \"I don't personally like sex or depictions of sex, but it's fine if you do\" will go a very long way towards preventing you from being \"dogpiled\", and may even make you a few friends.",
                                                                                                            "score": 6,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "Graingy",
                                                                                                                    "body": "My belief that humanity should aspire for greater things aside,\n\n> \"I don't personally like sex or depictions of sex, but it's fine if you do\"\n\nThe second part runs straight into the first part when accounting for the fact that people on the internet *love* to sexualize things without permission. It’s hard to tolerate or ignore something when you can’t get away from it, especially when the chance, however small, exists that it could affect you or something you made.\n\nI said elsewhere, if there were practical legal ways to fight it properly (instead of fighting a spiteful Hydra of disrespectful numbnuts) then maybe I’d have a somewhat more moderate view, but there isn’t. No way to avoid it, so I am forced to confront it in my views.\n\nI mean, fuck, not even *Disney* can stop that! ***DISNEY!!!*** The one case where I’d root for them!\n\nAnd again, it’s yet another case of humanity squabbling. Another turd on the pile.",
                                                                                                                    "score": -1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "DareDaDerrida",
                                                                                                                            "body": "I understand your frustration, or at least I can imagine it. Most humans do spend a lot of time thinking and talking about sex, and I can see how that would be grating for someone who doesn't partake. \n\nThat said, your method of confrontation does not appear to be changing anything, nor winning you support. Consider another.\n\nQuestion, in regards to \"sexualizing things without permission\" (by which I assume you mean porn/smut drawn and written about works of fiction): to what extent do you think an artist controls their work once they have published it for public consumption? How do you think that control ought to be made manifest?",
                                                                                                                            "score": 3,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "Graingy",
                                                                                                                                    "body": "I did come out here with the intention of seeing shit burn, though so far my downvote bet hasn’t been reached. With day maybe will come more? Here’s hoping. Anyways, I wasn’t expecting to change the unchanging minds of this place. I’ve learned that ain’t happening, so why not have some fun with it? Not like people care enough to let it hurt them. Effectively harmless.\n\nAs for the question…\n\nI generally believe the artist should hold control for derived work so long as that derived work is not made in a way that actually says something. Though even in that case, certain methods should be able to be set off-limits if they are gratuitous (e.g. sexualization in an uncharacteristic and graphic manner).\n\nParodying the themes of a work is different than making all the characters screw because a fanfiction author/artist was horny (or worse, paid to, as that involves profiting off another’s ideas). A story about trauma from rape is different to rape porn. One is about the terrible nature of a tragedy, the other is because people want to see a tragedy for their own enjoyment.\n\nI can give a pass to derived work in the case that the creator is a genuinely detestable person. See r/StoneTossingJuice as an example, where the leftist strawman and the MAGA hat character have been getting shipped like mad. Normally I dislike this kind of stuff, but StoneToss is a Nazi so it’s for a good cause.\n\nHow this would be governed legally would be tricky, especially that exception case. I can’t say I have a precise rulebook, only a set of ideals. I’m hardly the only person with their views in such a form. I’m for mass computerization in general (including economic, so you can add socialist ideals (*ideals*) to the list of fringe things I am), so an automatic cease and desist/DMCA-equivalent system to take offending content down, since as mentioned trying to do this manually, even when within legal right, is like facing a horny Hydra that hates your happiness. False flags would be tricky, but I’m banking on improvements in AI making this work, once more important things like actual child pornography and whatnot have been wiped similarly.\n\nThinking where I’d hypothetically draw the line if this issue was towards my own stuff…\n\nRomantically shipping two AroAce characters in a clean manner to poke fun at the fact that basically all my major characters are asexual would make me uncomfortable, but I’d be able to live with it. Adding a sexual component (*especially* where it couldn’t even biologically work), even worse explicit sexual content, would be too far. Graphically crushing a character underneath a giant rock would be unallowable (it says nothing except carnage for carnage’s sake), but looking at how other characters might react to such a violent death (so long as the event itself was not dwelled on to an excessive extent) would be okay.\n\nMind that the difference here between gore/rape and smut is that the former is considered bad by well-adjusted people, while the latter is widely considered  good.",
                                                                                                                                    "score": 2,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "sneakpeekbot",
                                                                                                                                            "body": "Here's a sneak peek of /r/Stonetossingjuice using the [top posts](https://np.reddit.com/r/Stonetossingjuice/top/?sort=top&t=year) of the year!\n\n\\#1: [I'm sure this has already been done, but...](https://i.redd.it/fi3d733lpzae1.png) | [369 comments](https://np.reddit.com/r/Stonetossingjuice/comments/1htfxex/im_sure_this_has_already_been_done_but/)  \n\\#2: [Flat :(](https://i.redd.it/yotz1s9m3g9e1.jpeg) | [581 comments](https://np.reddit.com/r/Stonetossingjuice/comments/1hnn6l1/flat/)  \n\\#3: [elon be like](https://i.redd.it/7iyb3dnuu8nd1.png) | [168 comments](https://np.reddit.com/r/Stonetossingjuice/comments/1faoc63/elon_be_like/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| ^^[Contact](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| ^^[Info](https://np.reddit.com/r/sneakpeekbot/) ^^| ^^[Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/o8wk1r/blacklist_ix/) ^^| ^^[GitHub](https://github.com/ghnr/sneakpeekbot)",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": []
                                                                                                                                        },
                                                                                                                                        {
                                                                                                                                            "author": "DareDaDerrida",
                                                                                                                                            "body": "I see. Thank you for taking the time to lay all that out. I don't agree with your ideals, but I'm happy to respect them, when they are presented in this format.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "Graingy",
                                                                                                                                                    "body": "This format being…?",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "DareDaDerrida",
                                                                                                                                                            "body": "Clear-cut and courteous.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "Graingy",
                                                                                                                                                                    "body": "Ah.\n\nI don’t enter with these because they’re not worth the effort for something that’ll be hated all the same.",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": []
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        },
                                                                                        {
                                                                                            "author": "tergius",
                                                                                            "body": "not just an edgelord but a eugenicist too wow!",
                                                                                            "score": 10,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "teufortSylladex",
                                                                                                    "body": "do you think his heart will go out to us next",
                                                                                                    "score": 10,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Graingy",
                                                                                                            "body": "Don’t have a heart, rock. No organs, really.",
                                                                                                            "score": -2,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                },
                                                                                                {
                                                                                                    "author": "Graingy",
                                                                                                    "body": "Not just an ideological hedonist but unaware of what eugenics actually means, wow!",
                                                                                                    "score": -3,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "GayStraightIsBest",
                                                            "body": "Or, you could keep your extremely unpopular position on sex to yourself and let the vast majority of people on earth do their thing.",
                                                            "score": 8,
                                                            "replies": [
                                                                {
                                                                    "author": "Graingy",
                                                                    "body": "The vast majority of humans on Earth see the world in an extremely backwards way only concerned with how much eggs cost and taking the kids to soccer practice. Computers can manage billions of assets and yet the economy is run by people betting on meaningless deeds. Wars are fought over vague notions of pride and tribal groupings.\n\nIt’s pathetic.",
                                                                    "score": -1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "GayStraightIsBest",
                                                                            "body": "Sure, all except for you who has it all figured out right?",
                                                                            "score": 9,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Graingy",
                                                                                    "body": "“Things should never change” vs. “Maybe things aren’t perfect and should change”\n\nYou don’t need a manifesto to realize that shit sucks ass.",
                                                                                    "score": -1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "GayStraightIsBest",
                                                                                            "body": "I agree, but I'm not the one advocating the removal of sex as a solution lmao",
                                                                                            "score": 12,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Graingy",
                                                                                                    "body": "I never said it’s the only issue, absolutely not. But it is *an* issue, and the reason I make so much noise about it in particular is because *nobody else sees it as an issue.*\n\nTrust me, it is *not* the top item on my list of hates, but the embracing and love of it disgusts me in its own special way.",
                                                                                                    "score": -2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "GayStraightIsBest",
                                                                                                            "body": "And my point is that it's a you problem, not an everyone else problem. The reason that nobody else sees it as an issue is because almost no people have an issue with it. If you don't like sex that's cool, I don't want you to be forced into it, or to be forced to talk about it, or constantly be reminded of it. I can imagine that the constant discussion of and reference to sex that occurs in general society would be frustrating for you, but it's still a you problem.",
                                                                                                            "score": 11,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "NeonNKnightrider",
                                            "body": "bro is a resident evil villain",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "author": "Graingy",
                                                    "body": "I’ll take that as a compliment!",
                                                    "score": -3,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Starwarsfan128",
                                            "body": "I think you misunderstand a lot about sex. In my opinion, sexuality is a form of art, just like many other human things. Casting it as dumb \"make babies\" is just a recast version of puritanism.",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "author": "Graingy",
                                                    "body": "It’s a form of art involving an inhibited state of mind, disregard for others, and sometimes disease.\n\nWhy keep it? Seriously, there are a hundred other things which are more constructive that people can do instead.",
                                                    "score": -6,
                                                    "replies": [
                                                        {
                                                            "author": "Starwarsfan128",
                                                            "body": "Is sadness an inhibited state of mind? Anger? Grief? Joy? Love? Empathy? Our emotions make us human, and the only inhibition sex has on the mind is that it is often used to express other emotions. Even if we removed sex, those emotions would come out another way. \n\nIdk what you're talking about with \"disregard for others\". Good sex is all about making your partner (or partners) feel good. As for diseases, those can be rather easily prevented. There's a million less safe things people do than sex. \n\nWhy keep it? People enjoy it. It can be an avenue for self-expression, expression that would otherwise be hard to do.",
                                                            "score": 14,
                                                            "replies": [
                                                                {
                                                                    "author": "Graingy",
                                                                    "body": "> Our emotions make us human\n\nI don’t know if you haven’t picked up on this or not, but I do ***not*** like humans.\n\nAlso, rape, abuse, blackmail, and even things as comparatively mundane as making porn of another person’s creative works without their consent. \n\nEspecially the last one, in a way, seeing as nobody seems to realize is pretty damn uncool, while the others are (rightly, obviously) condemned. Give a practical legal way to fight that and maybe I’ll slightly loosen my stance. Slightly.",
                                                                    "score": -7,
                                                                    "replies": [
                                                                        {
                                                                            "author": "tergius",
                                                                            "body": "oh so you're just an edgelord, okay.",
                                                                            "score": 11,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Graingy",
                                                                                    "body": "I genuinely believe this, but am also taking the piss because I know everyone here hates my take on this.\n\nI’ll have to check the downvote count on the first comment to see if my bet was right. Might take a bit but I’m holding out hope!",
                                                                                    "score": -2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "ErsatzHaderach",
                                                                                            "body": "You sound wound up about something that has nothing to do with this thread.  Have you eaten today and hydrated recently?",
                                                                                            "score": 11,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "teufortSylladex",
                                                            "body": "why write at all? its a form of art involving an impure state of mind, disregard for others and sometimes disease. \n\nwhy keep it? seriously, there are a hundred other things which are more constructive that people can do instead, like going to their local soapbox and spreading the good word of chastity",
                                                            "score": 10,
                                                            "replies": [
                                                                {
                                                                    "author": "Graingy",
                                                                    "body": "Writing can illustrate ideas of how the world works or should be. It can serve a practical purpose in hypotheticals. How disease would be spread, beyond stupid ideas, I cannot fathom.\n\nDo not seriously try to tell me that screwing like a beast barely crawling onto land for the first time is remotely as developed as communicating complex ideas to others.",
                                                                    "score": -2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Useful_Squirrel6693",
                                            "body": "Eh, I’m personally of a transhumanistic bent myself, but I do think sex doesn’t necessarily have to go, it’s a productive social ritual, but I feel it’s best do decouple reproduction from it, so that no pleasure is innately derived from the process of reproduction that’d replace what we currently have",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "this_shit",
                                            "body": "> dogpiled \n\nI mean if your take is 'deny a fundamental part of our animal nature' bad, yeah lol.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Graingy",
                                                    "body": "Bashing heads with rocks is also pretty fundamental but I doubt you’d be as quick to defend that.\n\nNatural is not instant good. Being the same species that roamed the savanna of Africa in the era of computers and spaceflight is asinine, let alone idealizing remaining the same forever.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "this_shit",
                                                            "body": ">  but I doubt you’d be as quick to defend that.\n\nLol sure, but for *reasons.* Like how random killing has negative consequences for everyone.\n\n>Natural is not instant good\n\nThat's true, but it's also *very difficult* to repress. So what's the *reason* for wanting a difficult thing? All you said was \"I don't like sex, we should get rid of it, and I know that's an unpopular opinion.\"\n\nWhere's the \"why?\"",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TK_Games",
                    "body": "I'll say this, when I was younger I had capital o 'Opinions' about the horny masses and how things like the war between Team Edward and Team Jacob and the rise of the slop-author were contributing to the downfall of western literature\n\nAs I've grown as a person, I've come to understand that every generation since the dawn of man has had it's own version of that, that terribly written trash-rags are a constant throughout history, and we never really hear much about them because they never last. The classics become classics for a reason, because they stand the test of time, and for every Longfellow, Austen, and Wilde there are a thousand horny Penny Dreadful manuscripts stashed under Victorian mattresses that never made publication\n\nBottom line, let horny people be horny, at it's worst it's a fad, and as long as nobody's getting hurt I don't really have any reason to give a shit",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Teagana999",
                    "body": "I was shocked by how unexpectedly steamy one series I was reading a while ago was, but the characters and story and world were still so interesting I couldn't put it down. \n\nIt was good, but now I know I probably don't want to go above 3/5 peppers.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "lynx_and_nutmeg",
                    "body": "Exactly. Way too many people seem to think good writing and smut are mutually exclusive.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Dry-Cartographer-312",
                    "body": "And this is why 2B and Bayonetta are peak.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "TwilightVulpine",
                    "body": "I'm all for horny stories, but it gives me a weird vibe when half the cast is serious and boring, and the other half needs to pause for *arf arf awooga* moments.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Sebaceansinspace",
                    "body": "Thank you. This isn't the fucking 18th century.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "AllMyBeets",
                    "body": "I can't remember the authors name now but he's pretty famous so I figured he'd be a pretty good writer \n\nAll the good guys are unbelievably sexy and cool.  All the bad guys are undeniably gross and ugly.  \n\nI couldn't.  I really couldn't.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "autogyrophilia",
                    "body": "That's the puritans in them\n\nThe problem is not sex obsessed, but more so fantasy obsessed. You know, you are only attracted to this perfect caricature that literally cannot exist.\n\nAnd it's kinda weird because it's more frequent to see the (cishet) female version of  that fantasy as it is considered less pornographic.\n\nBut the male version is soo much dire . Ever head of the game \"Nikke\" ?\n\nIt seems to be getting worse with the people that do not fuck because they are no longer grounded in reality.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "VCreate348",
                    "body": "Agree. People talk shit about Sarah J. Maas (sometimes justifiably so), but the one critique I don't get is that she writes steamy sex scenes. I read ACOTAR last year and while I wasn't a fan, the more steamy scenes I believed to actually be the best part. It was everything else I took issue with.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "crazynerd9",
                    "body": "Creator of Nier on why the female androids are maids and the boys femboys\n\n(Paraphrasing)\n\n\"I just like it like that\"",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "BalefulOfMonkeys",
            "body": ">I mean to be fair, a lot of women’s writing is still cliched as hell, but on a different front entirely, where they write similarly structured characters and\n\n“Ehhh. No. Like this happens in male gaze-y stories too, but in a direction I like less. I should probably try that again.”\n\n>A lot of writing done by women is more emotionally driven, and\n\n“Okay that’s straight up stereotyping. You can definitely find men writing emotional narratives if you go looking. Though it’s pretty rare to see-“\n\n“Oh. Ohhhh. I’ve seen past the Matrix I think.”\n\n>What if most of us suck shit at writing",
            "score": 500,
            "replies": [
                {
                    "author": "IAmASquidInSpace",
                    "body": "> What if most of us suck shit at writing \n\nCongratulations! You are ready to join r/writingcirclejerk now!",
                    "score": 181,
                    "replies": []
                },
                {
                    "author": "GREENadmiral_314159",
                    "body": ">What if most of us suck shit at writing\n\nBy jove, she's got it!",
                    "score": 256,
                    "replies": []
                },
                {
                    "author": "dumbodragon",
                    "body": "I'd rather not suck shit, thanks.\n\n\n~~most of us also have piss poor comprehension skills~~",
                    "score": 76,
                    "replies": [
                        {
                            "author": "TheErodude",
                            "body": "~~how dare you say we piss on the poor~~",
                            "score": 48,
                            "replies": [
                                {
                                    "author": "BalefulOfMonkeys",
                                    "body": "Why are you shucking your own shit?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Sinister_Compliments",
                                            "body": "> sucking\n\nFTFY",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Slarg232",
                    "body": ">What if most of us suck shit at writing\n\nI know what your writing needs.\n\nA LOVE TRIANGLE!",
                    "score": 28,
                    "replies": [
                        {
                            "author": "_Mike-Honcho_",
                            "body": "Do I pick the safe one who is a little dowdy and boring or the sexy dark brooding one who might break my heart?\n\nThe ageless romcom question. It's always the safe choice..... after having fun with the sexy one. Cake and eat it. The ultimate fantasy. Playing the person you love against another lover in some sick three-way winner takes all love competition.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "pomme_de_yeet",
                    "body": "Masterful work lol",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "CommanderPotash",
                    "body": "LMAOOO\n\nI love this format of commenting is too good",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "DoubleBatman",
                    "body": "Arguing with ourselves again, I see.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "almondtreacle",
            "body": "What’s the male version of “She breasted boobily down the stairs”?\n\nEdit: therapy is $200 but you comedians are free ♥️",
            "score": 400,
            "replies": [
                {
                    "author": "Global_Examination_4",
                    "body": "He cocked schlongily down the stares",
                    "score": 477,
                    "replies": [
                        {
                            "author": "Imonlyhereforthelolz",
                            "body": "He looked at her schlongingly",
                            "score": 326,
                            "replies": [
                                {
                                    "author": "jamiethemime",
                                    "body": "It's early but this is probably the funniest reddit comment I'll see today",
                                    "score": 56,
                                    "replies": []
                                },
                                {
                                    "author": "SpiketheFox32",
                                    "body": "This is deserving of a fucking award, but I'm broke as shit, so here's a watermelon 🍉",
                                    "score": 18,
                                    "replies": []
                                },
                                {
                                    "author": "almondtreacle",
                                    "body": "We found a winner, [i award you](https://youtu.be/6bh2ibQX6o8?si=NK27Z5dfrLvlL7yJ)",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "27Rench27",
                            "body": "What, like a banana pool float? Just riding that bad boy down the stairs?",
                            "score": 56,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Sammantixbb",
                    "body": "\"The veins of his forearm pulsed visibly as he checked his watch\", probably.",
                    "score": 61,
                    "replies": []
                },
                {
                    "author": "OnionsHaveLairAction",
                    "body": "Growled growlingly down the stairs that posed no obstacle to his beastial growls. (Booktok is in love with bigfoot)",
                    "score": 88,
                    "replies": []
                },
                {
                    "author": "ProbablyNano",
                    "body": "cocked cockily\n\n\n\npenised powerfully \n\n\nweinered wildly \n\n\nphallused floppily",
                    "score": 37,
                    "replies": [
                        {
                            "author": "ErsatzHaderach",
                            "body": "boioioioioioioing",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "ErsatzHaderach",
                            "body": "boioioioioioioing",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "CadenVanV",
                            "body": "Undulated",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "DoubleBatman",
                            "body": "Ejaculated erectly?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Aspiegirl712",
                    "body": "That's the thing it varies depending on the author.\n\nMaybe he is sexily rolling up his sleeves or chopping wood\n\nMaybe he is brooding in his dark library\n\nMaybe he is burning the candle at booth ends to care for his family/soldiers/orphans\n\nPerhaps its his deranged protectiveness\n\nThere are many more archetypes some of which I know nothing about but if an author can make a sentient door sexy anything is possible",
                    "score": 174,
                    "replies": [
                        {
                            "author": "27Rench27",
                            "body": "Mate, you can’t write that last sentence and then give zero context",
                            "score": 59,
                            "replies": [
                                {
                                    "author": "Kheldarson",
                                    "body": "No, that's the full context. There's a romance book about a sentient door. It's...rather infamous in BookTok circles.\n\nSupposedly decently written too.\n\n  \nEdit: For anyone interested, it's called [Unhinged.](https://www.goodreads.com/book/show/187684551-unhinged)",
                                    "score": 75,
                                    "replies": [
                                        {
                                            "author": "Plane-Mammoth4781",
                                            "body": "So that wasn't a Caves of Qud reference then?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "PepeL3P3w",
                                                    "body": "Caves of Qud mentioned 🤩👯‍♀️🎉🥳🎊🥂",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "crazynerd9",
                                            "body": ".......\n\n\"Unhinged\"\n\n.....\n\nGod dammit",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "satanseedforhire",
                                    "body": "It's called  [Unhinged](https://www.goodreads.com/book/show/187684551-unhinged) \nI have not read it but I kind of want to",
                                    "score": 39,
                                    "replies": [
                                        {
                                            "author": "Background_Falcon953",
                                            "body": "You can be the one who knocks, I believe in you",
                                            "score": 19,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Aspiegirl712",
                                    "body": "I was going to say if you know you know but its too good not to plug.\n\n{Unhinged by Vera Valentine}\n\nIt's fun, sexy and short!",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "DracheTirava",
                                            "body": "Chuck Tingle's evil doppleganger",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "maxixs",
                                                    "body": "i feel like the word evil there is redundant",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Cowplant_Witch",
                                    "body": "I’m pretty sure >!he’s a demigod or a dryad or something who was once bound to a tree, but the tree has been cut down and turned into a door. Now he’s a door shifter. He does have a human form, but also, she does fuck the doorknob. There’s a subplot about a stalker who keeps trying to get into her apartment, but her sexy door protects her.!<",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Martin_Aricov_D",
                            "body": "There's also the good ol' \"knows exactly what you want or need without you ever having to say or express it in any way shape or form and is always completely correct about it despite it always being a random assumption based on nothing from his end\"",
                            "score": 56,
                            "replies": [
                                {
                                    "author": "pbmm1",
                                    "body": "One of the more interesting stereotypes I’ve been made aware of recently. The dream of the perfectly empathetic servant who knows all nuance",
                                    "score": 28,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "8lu-bit",
                            "body": "I know that book. I read it as a dare, and it's just as unhinged (sorry) as the title suggests.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Aspiegirl712",
                                    "body": "The review I read was so full of puns that I just had to read it. I have read several of her books now, and it is still my favorite.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "_The_Green_Witch_",
                    "body": "That would be \"Torolf was gone, escaped out the bedroom window. In the distance, Hilda heard the fading sound of galloping abs.\"\n\nSome other gems of that same book:\n\"He opened the door a crack...and almost had a heart attack...or a dick attack.\"\n\"Torolf was ashamed at being caught, but his shame made him even hotter – hotter for sex.\"",
                    "score": 34,
                    "replies": [
                        {
                            "author": "maxixs",
                            "body": "which fucking book",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Deathangle75",
                    "body": "Funnily enough “he breasted boobily down the stairs” still works if you include well developed pectorals.",
                    "score": 85,
                    "replies": [
                        {
                            "author": "YsengrimusRein",
                            "body": "I'm suddenly envisioning a generic YA female protagonist but her love interest is a massive Austrian bodybuilder on ~~steroids~~ an excellent dietary and fitness program.",
                            "score": 44,
                            "replies": [
                                {
                                    "author": "lesser_panjandrum",
                                    "body": "\"Oh Jörg,\" she sighed, \"what a tragedy it is that we cannot spend every night together, but at least I can see you now and take comfort in you and your massive, meaty pecs.\"\n\n\"Jooo,\" he rumbled, alpinely, \"besser ois a Sta am Schädl, ne?\"",
                                    "score": 19,
                                    "replies": []
                                },
                                {
                                    "author": "nightmare_silhouette",
                                    "body": "Okay but that's me with König (COD) fanfiction lmao.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "CadenVanV",
                            "body": "Some men have bigger muscle tits than women do normal ones",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "DoubleBatman",
                            "body": "I remember an old commercial where the woman had slowmo X-ray vision and was using it to perv on some hot guy using a jackhammer’s jiggle physics. Then his break came and he was replaced by a big fat dude.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Deathangle75",
                                    "body": "What were they advertising? Or was it a car commercial where they don’t really advertise the vehicle at all because most people don’t understand cars and so just show random shit like a lady dumping her toxic boyfriend over a cliff?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "DoubleBatman",
                                            "body": "I wanna say it was some sort of candy bar, or soda maybe? Like a “treat yourself” kinda thing but I really don’t remember, so clearly the ad wasn’t very effective. Kinda wanna see if I can find it now",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "DoubleBatman",
                                            "body": "[Found it.](https://youtu.be/cOEMI8HRhlA) Bud Light, apparently. I guess they had a whole bunch of em with different superpowers.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Deathangle75",
                                                    "body": "She clearly couldn’t handle the raw masculinity of the bossman.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "LonelySpaghetto1",
                            "body": "Zoro canonically has the second largest chest measurement in the main One Piece crew, ahead of multiple women who look like they have a G cup",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BalefulOfMonkeys",
                    "body": "~~He cared emotionally down the stairs~~ I will leave it to cishet women who actually like men consistently to actually give an answer, but this is too funny to not write",
                    "score": 179,
                    "replies": [
                        {
                            "author": "DigitalAmy0426",
                            "body": "But that's it. We love a guy who can pick up on the emotion, or are aware enough to fix our overwhelmed, but they are rare.",
                            "score": 27,
                            "replies": [
                                {
                                    "author": "BalefulOfMonkeys",
                                    "body": "And in turn I can absolutely see how the emotional gaze in fiction can be bad in its own special way. “Oh this guy? We like this guy a lot. Because he cares about us. Why? Dude trust me. What I like is what you like, because it’s a constant of the universe that needs zero explanation. So anyway Bro Hottman blew up an orphanage because he knows what I want,”",
                                    "score": 41,
                                    "replies": [
                                        {
                                            "author": "DigitalAmy0426",
                                            "body": "Pretty much. Lots of relationships got blown up real good thanks to Twilight and 50 shades, and the shitty thing is there's a damn good chance the each side cared a lot about the other. Maybe they didn't meet the needs like the movie version but intuitively knowing what someone needs? Not a thing. We have ideas but we still have to learn our specific partners.\n\nGive a damn, show up, and be willing to work with other. Don't give up on someone bc he doesn't sparkle in the sun (easily fixed with glitter anyway. 😁)",
                                            "score": 11,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "King-Of-Throwaways",
                                    "body": "The most female gazey piece of media I’ve seen is Love and Deepspace, a mobile game where handsome Chinese pretty-boys listen to your troubles and remind you that your period is due in 3 days.",
                                    "score": 56,
                                    "replies": [
                                        {
                                            "author": "alelp",
                                            "body": "And you can also chain then to a wall and rape then.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "AsterTales",
                                                    "body": "Well, actually they chain themselves and you touch their abs. For the greater good of course!\n\nI mean it was certainly kinky visuals with a \"taming an alpha werewolf\" theme, but \"you chain and rape them\" is quite a stretch. AFAIK, it's a kiss for one ML and a pretty intense hug for the other, both initiated by MLs. Also, there are \"bad endings\" in which MLs can kill themselves to avoid hurting FL or run away forever.",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "author": "alelp",
                                                            "body": "That's symbolism, you know that, right? They use symbolism because they need to comply with the app store's guidelines.\n\nAnd even then, the most popular male gooner games are still wholesome vanilla when compared to that.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "AsterTales",
                                                                    "body": "I don't necessarily think so: rape makes the victim helpless and pitiful at the moment. Women in general don't like their MLs helpless and pitiful and like when ML has strong desires which is opposite to raping him.\n\nIf it was openly 18+ then probably MLs would lose control and rape FL, because that's how female rape fantasy works. And probably only one of them, others would \"hold back for her sake\" because it's also a very popular fantasy: someone very powerful restricting themselves for your sake. Which is what event was about: restricting \"dangerous\" impulses and teasing at the same time.\n\nI mean yes, the whole game is about satisfying female fantasies, but female fantasy is often more about complicated power dynamics than only smut. And female-oriented femdom is very niche even in 18+ section.\n\nAs for wholesome vanilla... I played games with actual rapes and \"raping her until she succumbs and reborns as a love slave\" so I can't comprehend how we can compare this to leather suits and some touching. Do you really mean that?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "alelp",
                                                                            "body": ">I don't necessarily think so...\n\nThat's fair.\n\n>As for wholesome vanilla...  I played games with actual rapes and \"raping her until she succumbs and reborns as a love slave\" so I can't comprehend how we can compare this to leather suits and some touching. Do you really mean that?\n\nAre those games the most popular mobile male gooner games around? Because that was the comparison. Otherwise, I'd just cite some NSFW games for women.",
                                                                            "score": 3,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "NeonNKnightrider",
                                    "body": "well I’m going to fucking die alone \n\n(I am autistic and terrible at intuiting non-verbal cues)",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "DigitalAmy0426",
                                            "body": "I said we love it, which says nothing about how we deal. I realize a certain brain isn't going to pick up on things so I've learned to tell them I need emotional support, or give them a sign if I can't iterate. If the partner is willing to learn, we can work out a way to get this level of support.\n\nThe movie Don Jon speaks to this in as far as people - not just one gender searches for the perfect version of their preferred partner but you have to realize it doesn't exist.\n\nOnce we get to that point, then we can see what's right in front of us. I promise, there are plenty of people willing to help you get the cues you need to be the support you want to be to them. Have a little faith hunbun ❤️",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "ErsatzHaderach",
                                            "body": "sir you are vastly overestimating the height of the bar here. making a good-faith effort at all usually soars over it.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "NeonNKnightrider",
                                                    "body": "I hate sounding like some miserable ‘blackpill’ incel, but I think you‘re vastly overestimating how easy dating is for men.\n\nAverage dudes already suffer like hell to find a date.  Meanwhile 30% to 40% of all autistic men *never* have a relationship in their life. Only 5% of autistic adults ever become married.  \n\nI promise you I have been trying, for years.  I’m 22 years old.  The total extent of my relationship experience is two first dates and one kiss.  Good faith is not enough. That is unfortunately just wishful thinking.",
                                                    "score": 8,
                                                    "replies": [
                                                        {
                                                            "author": "ErsatzHaderach",
                                                            "body": "well, godspeed.",
                                                            "score": 2,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Electronic_Basis7726",
                                                            "body": "Mate, you are 22. I know how bad it feels, but you are really, really young. There is a major cohort of women your age as well who will have very little experience, men as well.\n\n\nAverage dudes with their average spouses fill the super markets with their families on weekends, shopping there for food and whatever. Just keep at it, learn from your encounters, use your words if non-verbal cues fail you and ask. Be earnest.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "ErsatzHaderach",
                                            "body": "sir you are vastly overestimating the height of the bar here. making a good-faith effort at all usually soars over it.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "bag_full_of_bugs",
                    "body": "men can also breast boobily, i’ve seen it",
                    "score": 22,
                    "replies": [
                        {
                            "author": "gacha_garbage_1",
                            "body": "Oh my god! That's disgusting. Where?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SacredGeometry9",
                    "body": "“He sacrificed everything to be with her.”\n\n\nA character reduced to something whose only purpose is to please and support the protagonist.",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "Graingy",
                    "body": "Well, what on each sex slaps painfully when jogging naked?",
                    "score": 20,
                    "replies": [
                        {
                            "author": "Kolby_Jack33",
                            "body": "He testicled nuttily across the room?",
                            "score": 31,
                            "replies": [
                                {
                                    "author": "Graingy",
                                    "body": "I guess",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "OldManFire11",
                    "body": "When the male love interest just magically understands all of her emotional and sexual needs without her having to ever express them.",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "ed1749",
                    "body": "Usually some very similar fixation on a shirtless man's chest. Bonus points if we focus on how sweaty he is.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "ChrdeMcDnnis",
                    "body": "He looked at her gazingly. His eyes were the color of passion and sadness and a little bit drunk. His hands were. His arms were. He had a chest with arms on either side and hands at the end of those arms. And hair, he had hair that was thick. And stubble, but only enough that he could also be reasonably considered shaven. He put his thumb in her mouth.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "eathotdog36",
                    "body": "His toned muscles throbbed mightily as he cocked his way through the crowd",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Dark_Stalker28",
                    "body": "I remember reading this anthology valentine themed killer story, and the main protag was really obsessed with the main guys nipples.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "Meows2Feline",
                    "body": "Whatever Sarah J Maas is currently writing.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "_Mike-Honcho_",
                    "body": "The bad boy and safe choice both would do anything for her and knew about each other and were fine competing for her love. One would be her new soul mate, the other almost a soul mate, but just not quite, but he would also wait eternal for her if she changed her mind.\n\nLove triangle with the woman in 100% control of both men and the entire sitiation.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Nonikwe",
                    "body": "He brooded broodily with a smouldering brooding intensity",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "lynx_and_nutmeg",
                    "body": "He forearmed smirkingly down the stairs.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "OnionsHaveLairAction",
            "body": "OP I think your title is a better criticism than the actual image. \n\nHorny writing is normal, I don't mind it at all.\n\nWhat I am tired of is generic ass brooding dudes with no personality except being vaguely dangerous and mysterious but *sometimes* kind to the female protagonist (but never kind with enough frequency that the possibility of danger goes away)\n\nIt can be a good starting point for a character, but when these characters don't develop by the third act it becomes obvious that the protagonist isn't into the dude at all, they just like a sensation of danger. Which would be chill if the book/show wasn't trying to tell me they were in love with Generico's personality.",
            "score": 135,
            "replies": [
                {
                    "author": "Forgot_My_Old_Acct",
                    "body": "Women be loving the trope of the hot bastard who's only nice to you, specifically.",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "StoppableHulk",
                    "body": "The only pitfall one needs to avoid in horny writing is making it narcissistic horny writing. \n\nIf the horniness of the writing is able to be shared amount readers, then that is the whole of the law of the writer.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "meeps20q0",
                    "body": "I swear, this is like the number #1 cultural reason girls get into abusive relationships! \n\nBecause that shit dont happen irl, if they only treat you nice its not because they secretly have a heart of gold. Its cause they're using you.",
                    "score": 21,
                    "replies": [
                        {
                            "author": "Level_Film_3025",
                            "body": "That's the least fact based fact I've ever seen.\n\nNot the second part, that's true. But the idea that it's the #1 cultural reason is like, insane.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "meeps20q0",
                                    "body": "Fair, i was being hyperbolic but i shouldn't have said it as fact. Edited it a bit to more reflect as an opinion.\n\nThough having worked at a womens shelter it definitely seemed to be the most common through line. Course I guess your not exactly going to dive into the more complex systemic societal issues there.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "telehax",
            "body": "the context of the example feels like it's literally supposed to be a sex scene? I think sexualizing your characters is appropriate during a literal sex scene.\n\nnow, if you're including a gratuitous sex scene... that's another matter. but the example doesn't really include anything to suggest it's not just part of a steamy romance novel.",
            "score": 338,
            "replies": [
                {
                    "author": "YsengrimusRein",
                    "body": "Writing tip: sexualize your characters in every situation except for during sex; you are obligated to write your sex scenes with the arousal appeal of a sandpaper sampler.",
                    "score": 186,
                    "replies": [
                        {
                            "author": "awakenDeepBlue",
                            "body": "Hey, I read Tsukihime by Nasu.  The sex scenes are so bad it's hilarious!",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "No_Asparagus9826",
                                    "body": "Is that the webcomic with a bunch of incest?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "awakenDeepBlue",
                                            "body": "No, it's a Japanese Light Novel released in 2000:\n\nhttps://en.wikipedia.org/wiki/Tsukihime\n\nNasu then wrote the much more popular Fate/Stay Night in 2004, which kicked off the very successful Fate franchise.\n\nThe meme is that while Tsukihime is considered very well written, it is deeply contrasted with how forced and badly written the sex scenes were.  This was because at the time of the 2000's, LNs were expected to have sex scenes.\n\nI believe the Tsukihime 2021 remake omits the sex scenes altogether.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "No_Asparagus9826",
                                                    "body": "Huh, this does actually seem to be the thing I remember hearing about, I guess that goes to show how much of the plot I retained\n\n(In my defense, I \"read\" it via out of context screen caps that I was usually sent in the middle of the night)",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "awakenDeepBlue",
                                                            "body": "You can read a playthrough here, it's a pretty easy read:\n\nhttps://lparchive.org/Tsukihime/",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "No_Asparagus9826",
                                                    "body": "Gotcha!",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Kheldarson",
                    "body": "Nothing wrong with a gratuitous sex scene either. But I think the second example isn't necessarily supposed to be part of a sex scene: that's just how writing be in romance novels (and fantasy romance). But it's again serving the purpose of driving up the romantic/sexual tension for the character (and reader), while a lot of \"men writing women\" prose are just... how they describe women? Like the OP's example I would expect to see done to a male lead or a romantic rival but not any of the other men in the book, while male writers tend to \"boob breastily\" all the women, regardless of role.",
                    "score": 57,
                    "replies": [
                        {
                            "author": "zoor90",
                            "body": ">Like the OP's example I would expect to see done to a male lead or a romantic rival but not any of the other men in the book, while male writers tend to \"boob breastily\" all the women, regardless of role.\n\n\nDepends on the genre. If you have a female lead harem romance for example, the vast majority of males will be written that way because the protagonist being surrounded by sexy boys is all part of the fantasy. ",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "zoor90",
                            "body": ">Like the OP's example I would expect to see done to a male lead or a romantic rival but not any of the other men in the book, while male writers tend to \"boob breastily\" all the women, regardless of role.\n\n\nDepends on the genre. If you have a female lead harem romance for example, the vast majority of males will be written that way because the protagonist being surrounded by sexy boys is all part of the fantasy. ",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Kheldarson",
                                    "body": "Yeah, but the vast majority of the males are also going to be in the harem. My point was that the type of writing in the OP is typically reserved for romantic leads (or rivals/red herrings), so if you have more romantic partners, you're gonna have more people that writing is applied to. It's not like every single guy is described like that regardless of their role.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Thatismycat000",
                    "body": "Right? My initial read was, oh the second one sounds like a bodice ripper. The thing that takes me out are narration saying lines like \"she could've been pretty if she wanted to be\" in this thriller novel I started reading or the fact that I can tell you the narration's ranking of the main female characters' attractiveness in The Overstory. It's not relevant to the plot or themes and I find it distracting. ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "randomyOCE",
                    "body": "I read a lot of female-protagonist novels alongside my wife, and let me be clear that men in these books are constantly finding excuses to take their shirt off. The vibe you’re identifying is the whole point/problem, that every scene with the hunky boy(s) is written like a sex scene.",
                    "score": -9,
                    "replies": [
                        {
                            "author": "LenoreEvermore",
                            "body": "I've read a lot of books with female protagonists and this never happens lol. You might just be reading romance/smut? Not that there's anything wrong with that of course! It's just odd to imply that all novels with female protagonists would be the same.",
                            "score": 39,
                            "replies": []
                        },
                        {
                            "author": "urkermannenkoor",
                            "body": "But do those hunky boys also have some sort of personality and role in the story or are they consistently only described by their physical traits even when not at all relevant to the scene at hand?",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "KamikazeArchon",
            "body": "The problem is not with writing characters like that. The problem is the *distribution*.\n\nIf (making up numbers) 40% of women in fiction are there to be sexy, and 40% of men are there to be sexy, there's no problem. \n\nIf 70% of women are there to be sexy, and 30% of men are there to be sexy, then there is a problem.\n\nIdentifying problems like this in a single piece of media is never going to succeed because it's fundamentally about wide patterns.",
            "score": 146,
            "replies": [
                {
                    "author": "27Rench27",
                    "body": "Yeah, this is also gonna vary WILDLY by genre. There’s probably a much higher instance of sexy guys in the Romance section compared to the Sci-Fi section",
                    "score": 92,
                    "replies": [
                        {
                            "author": "IAmASquidInSpace",
                            "body": "- Romance: the men are sexy\n- SciFi: the women are sexy (and badass)\n- Erotica: everyone is sexy\n- Fantasy: the elves are sexy, men and women\n- Thriller: some women are sexy\n- Crime: the killer is sexy\n- Pyschological drama: everyone is ugly, miserable, and hates themselves",
                            "score": 47,
                            "replies": [
                                {
                                    "author": "lofgren777",
                                    "body": "In a thriller, the sexy women are always dangerous.",
                                    "score": 19,
                                    "replies": []
                                },
                                {
                                    "author": "UTI_UTI",
                                    "body": "Sometimes the drama has everyone start sexy and steadily become less sexy",
                                    "score": 15,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Salt_Blackberry_1903",
                    "body": "I remember reading this book called The Dragon Head of Hong Kong. One of the reviews inside the cover said something like, \"Ava Lee (the MC) has it all...etc. etc...and plenty of sex appeal.\" Even in high school, I remember thinking how weird that comment was. And in not one, but two of the Ava Lee books, it mentions that \"she didn't need to wear a padded bra like other Asian women\" - I'm paraphrasing but that book was so weirdly written and boring at the same time",
                    "score": 18,
                    "replies": [
                        {
                            "author": "ErsatzHaderach",
                            "body": "Asian women did not deserve that stray wow",
                            "score": 16,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "alexander1701",
                    "body": "And it's not even the raw distribution, it's about the culturally significant works. Bodice rippers fill the same cultural niche as something like hentai games. Neither of them is the problem.\n\nThe problem is when all of the mainstream stuff has one dimensional characters of one gender alongside fully developed characters of the other. Especially in 20th century cinema, it would be incredibly common to have a fully male cast for the story, and one girl to be the main character's girlfriend, and more often than not she only existed to acknowledge and reward the main character for completing his arc, and for him to prove himself by rescuing her.\n\nIt's toxic when it's everywhere, because it becomes the default role model for women and girls. They don't get to be Batman, they have to imagine being Catwoman to be a part of the action. So, we have a push these days to do more to make sure Wonder Woman is on the table, too, and all of that, in mainstream culture.\n\nBut some people do take it too far, and get offended every time there's a sexualized character in any media, instead of just wanting to make sure there's enough fully realized characters to go around.",
                    "score": 52,
                    "replies": []
                },
                {
                    "author": "jackofslayers",
                    "body": "Very random but percentages from different sets of data that happen to add up to 100% is my pet peeve",
                    "score": 10,
                    "replies": [
                        {
                            "author": "TheErodude",
                            "body": "I didn’t notice it until you mentioned it and it’s not even technically a problem, but dang, now it’s going to start bothering me too.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "alelp",
                    "body": "I mean, if distribution and wide patterns were the focus, then women's objectification of men would completely eclipse the reverse by at least an order of magnitude, considering how the fictional writing market is around 80% romance made for women.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "KamikazeArchon",
                            "body": "I would *love* to know why you believe that.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "alelp",
                                    "body": "Why I believe what? The fact that the market is massively dominated by women? Or the fact that, going by your own focus on distribution and wide patterns, the market being women-centric means that women objectifying men is much more prevalent?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "KamikazeArchon",
                                            "body": "Why you believe that \"the fictional writing market is around 80% romance made for women\".",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "alelp",
                                                    "body": "Right, sorry, crossed wires on my statistics, what I meant to say was that 80% of the fictional book market is dominated by women.",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "CryptographerLost357",
            "body": "Honestly I hate this kind of take. There is nothing wrong with writing horny books, if that’s what you’re trying to write. Women who write this way are generally writing in the romance genre, which is exactly where you’d expect to encounter this sort of writing. Those books are supposed to be horny! It’s totally fine! The problem is when men write the same way but try to claim that they’re writing “serious, high brow literature” instead of just admitting that they’re horny and writing a fucking romance novel like the girls are doing.",
            "score": 258,
            "replies": [
                {
                    "author": "yuckersupper",
                    "body": "it seems like a lot of people are missing that the \"breasted boobily\" criticism comes from the way women have been depicted across genres & forms of media: video games do it with character design & gratuitous jiggle physics, movies/tv do it with camera angles & outfits, novels have been doing it for ages by writing mundane behaviors like walking down a flight of stairs as if the act itself is somehow sexually charged by the presence of boobs.\n\nit can be tedious to try and find stories that feature female characters without overtly sexualizing them. it seems to be a bit of a bad faith argument to compare the writing in wish-fulfillment romance novels to the way women have been depicted in the broader media landscape over the past century. ",
                    "score": 174,
                    "replies": [
                        {
                            "author": "Heather_Chandelure",
                            "body": "This exactly.\n\nThe \"breasted boobily\" criticism is about overall trends in how women are written. This post is trying to counter that by pointing out that individual books written by women do the same thing, which just misses the entire point of the criticism.",
                            "score": 68,
                            "replies": [
                                {
                                    "author": "JoeTheKodiakCuddler",
                                    "body": "idk why people on reddit & other social media can't get this through their heads, there's so many damn posts about how systemic sexism isn't real because women do the same things sometimes. And half the time they act like that's a progressive thing to say.",
                                    "score": 29,
                                    "replies": [
                                        {
                                            "author": "132739",
                                            "body": "Because they want to feel justified in blatantly ignoring criticisms of sexism under the guise of \"woman can be bad/men have it hard, too,\" so that they don't have to actually reflect on things or possibly change their behavior.",
                                            "score": 7,
                                            "replies": []
                                        },
                                        {
                                            "author": "JesterQueenAnne",
                                            "body": "In reddit specifically I feel the majority of users just refuse to accept that the conditions of different genders, races, sexualities etc. are not the same and that systemic discrimination in general is not a real thing. They see double standards where there's just different standards for different situations because they can't conceive the situations being any different, then act like that's the progressive thing to say because they mistake \"everyone is equal\" to mean \"everyone's situation is the same\".",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "DinoOnsie",
                                    "body": "Also \"the woman's gaze\" isn't the equal and opposite of the male gaze. Academically speaking it doesn't exist.\n\n\nThe male gaze is also about a systemic and patriarchal control over all media to objectify. There is no equal opposite to this control. There is no equal gaze.\n\n\nThere's been some criticism because the male gaze leads to the assumption of the opposite and a new words needs to be made to talk about it within pop culture to avoid this.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Heather_Chandelure",
                                            "body": "Just letting you know, you accidentally posted this comment twice.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "DinoOnsie",
                                                    "body": "Got a 'server error' when I hit reply, lol. but thanks, deleted the extra",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "vomce",
                            "body": "Yeah, I see so many posts (not just on reddit/tumblr, but mainly on reddit/tumblr (because those are the sites I use the most, not because I'd like to suggest that their respective user bases are inherently worse about this)) that seem to just... ignore the social context for a certain idea or attitude. It feels mostly like contrarianism to me: people want to feel like they have an original take, so they dust off an old social truism and figure out how to argue that \"this thing sucks, actually\" (which happens to be true a good chunk of the time, but let's not try and throw the baby out with the bath water).",
                            "score": 23,
                            "replies": []
                        },
                        {
                            "author": "CryptographerLost357",
                            "body": "Yes, exactly. If I found this type of writing in a romance novel written by a man I'd have absolutely no problem with it.",
                            "score": 21,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "GonzoTheGreat93",
                    "body": "This is the take. \n\nIt’s treating women romance writers working within a genre, and men writing *serious literature* as the same thing.",
                    "score": 32,
                    "replies": []
                },
                {
                    "author": "irregular_huh",
                    "body": "THANK YOU.\n\nI feel like, for example, a lot of male-authored fantasy books are at the same level of writing competence as some highly criticised romantasy books, with little plot and a lot of self-insert wish fulfillment; but since they're for the male gaze, they're \"serious literature\" and the best in the genre, and get recommended to everyone without mention of the male-gazey horniness.\n\nLike, it's fine if you like horny books - a lot of us do. But let's drop the double standard. Just create a \"romantasy\" genre targeted at men and drop the pretense!",
                    "score": 39,
                    "replies": []
                },
                {
                    "author": "jackofslayers",
                    "body": "I don't hate Warren Ellis because he is a horny author, I hate Warren Ellis because he ruined Castlevania with his horniness.",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "nomindtothink_",
            "body": "Meh, there’s still an asymmetry in how sexualised male characters and sexualised female characters exist in the broader media landscape. Sexualised male characters mostly appear in female-targeted romance media*. These works are explicitly meant for titillation, marketed and widely perceived as such, and make up only a small part of all published/produced works. On the other hand, for a long time, women were sexualised in a lot of mainstream, critically acclaimed/prestigious, non-romance focused works — there’s a reason that most complaints of men-writing-women are  directed at people like Stephen King and shows like Game of Thrones. \n\nThe issue isn’t that there exists media reflecting male-oriented romance/sexual fantasy; it’s that male-oriented romance/sexual fantasy has permeated mainstream media so much that it became the cultural default, even in works that were supposed to have universal appeal. \n\n*The big exception to this seems to be young adult literature, which seems to be increasingly dominated by female-gazey stories and books featuring female-oriented romance. And this is something I think is quite harmful and probably makes the genre quite alienating to teen boys.",
            "score": 26,
            "replies": [
                {
                    "author": "YashaAstora",
                    "body": "> The big exception to this seems to be young adult literature, which seems to be increasingly dominated by female-gazey stories and books featuring female-oriented romance. And this is something I think is quite harmful and probably makes the genre quite alienating to teen boys.\n\nBlame the fact that young boys seem to have zero interest in reading anything that isn't alpha male manosphere nonsense.",
                    "score": -3,
                    "replies": [
                        {
                            "author": "Algohambra",
                            "body": "I’m sorry that’s not even close to being true. As a boy who grew up with most YA LIT being very “female-gazey” books, it made reading a lot of these genres a very alienating experience. Add in the fact that pretty much 98% of smut/romance is also very female-gazey, and it’s pretty easy to be sold some painful insecurities if you’re a man who likes reading books in those two genres.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Strange-Log3376",
            "body": "This is an issue of perspective - literally, narrative perspective. \n\nThe “female writers” excerpt is apparently from the third person POV of someone who is horny for Derek. All well and good - you’ll find a lot of scenes about people being horny for each other without much complaint.\n\nWhat people *do* usually complain about are male writers who are horny for their female characters and bake that horniness into the story. Things like female protagonists gratuitously checking themselves out in the mirror, or the ostensibly omniscient narrator describing a female character with lingering focus on her sexuality. It’s a different animal than smut, because it implies that the existence of women is inherently sexual.",
            "score": 12,
            "replies": []
        },
        {
            "author": "Mouse-Keyboard",
            "body": "> both genders\n\nNow I want to see what terrible non-binary erotica is like.",
            "score": 12,
            "replies": []
        },
        {
            "author": "Warm_Drawing_1754",
            "body": "The problem is expecting good writing from goonerbait manga or dollar-store romance.",
            "score": 24,
            "replies": []
        },
        {
            "author": "XrayAlphaVictor",
            "body": "People be horny, get over it",
            "score": 104,
            "replies": [
                {
                    "author": "NeonNKnightrider",
                    "body": "I’m fine with horny, I just want to poke fun at the people who talk as if sexual desire is something exclusive to straight men",
                    "score": 90,
                    "replies": [
                        {
                            "author": "ApolloniusTyaneus",
                            "body": "Horseshoe theory for gender equality: going so far that you fall back into the stereotype of \"Men horny, women pure\".",
                            "score": 89,
                            "replies": [
                                {
                                    "author": "MyNameIsConnor52",
                                    "body": "that’s literally what radfems do and it sucks",
                                    "score": 24,
                                    "replies": []
                                },
                                {
                                    "author": "RatQueenHolly",
                                    "body": "*Image of Terfs and Misogynists shaking hands*",
                                    "score": 54,
                                    "replies": [
                                        {
                                            "author": "Cheap_Ad_69",
                                            "body": "As is tradition.",
                                            "score": 25,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Broad_Direction7112",
                                    "body": "This is something I've noticed and it chaps my ass.\n\nNerd culture has moved from \"Men get to be abrasively horny while women get mocked for it\" to \"Women get to be abrasively horny while men get mocked for it\"\n\nHow about just let people be their normal horny selves regardless of gender you weird resentful dipshits",
                                    "score": 27,
                                    "replies": [
                                        {
                                            "author": "TwilightVulpine",
                                            "body": "I still wouldn't call women today \"*abrasively* horny\" I don't see men getting routinely driven out of online platforms by sexual harassment.\n\nWe have a wave of people calling everyone gooners, but it doesn't stop horny stuff for men being as common as ever either.",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "Broad_Direction7112",
                                                    "body": "\"Men are significantly more buttoned-up in nerd spaces which is a 180 from the past due to a shift in attitudes\" and \"women still get routinely harassed out of fandom spaces\" are not mutually exclusive things",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "TwilightVulpine",
                                                            "body": "No it's not, but they didn't trade places. The buttoned-up men now are closer to the liberated women now, than the women of today are to men at their worst back then... and now, because there are still some large communities out there that are just as bad as they were then, or possibly worse.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Broad_Direction7112",
                                                                    "body": "I think we're talking at cross-purposes here",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "TwilightVulpine",
                                                                            "body": "What do you mean?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Broad_Direction7112",
                                                                                    "body": "I'm talking about a shift in attitude and expectations regarding expressions of sexuality within nerd culture specifically, whereas you seem to be more addressing how that plays into adjacent social phenomena\n\nEDIT: Okay, to clarify -\n\nYou're not wrong that certain fandoms and fandom spaces are still as male-dominated in their sexuality as they were in the past (the most obvious example being anime fans), but the overall trend to my eyes comes off as a general inversion.\n\nThis does not mean that culture *overall* is no longer patriarchal in its sexuality, but I think it does speak to a shift within nerddom as a specific subculture\n\nTL;DR - I'm not saying misogyny is no longer a thing in nerd circles, I am saying sexual expression specifically seems to have shifted compared to the past, and it's shifted in a way that strikes me as zero-sum",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "TwilightVulpine",
                                                                                            "body": "I am getting to tangential topics to illustrate how the change hasn't been so stark and strictly inversed as you say.\n\nBut let me be straight to the point then. If you browse /r/anime even just a little, you won't find any lack of content intended to appeal to nerdy men, and I wouldn't say that sexualization aimed at women surpasses it. In other nerdy hobbies like /r/comicbooks or /r/rpg it seems to me that sexualization diminished in general, but definitely not that sexualization for women is being favored over sexualization for men. Meanwhile /r/Games has no lack of sexualization, and I'd say it's still more leaning towards appealing to men.\n\nThe only side of nerd fandom that seems to favor sexualization for women over for men is the fanfiction scene, but that's not a new thing. Maybe you just get that impression because of Tumblr, which tends to favor feminine interests more than other social media platforms.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Broad_Direction7112",
                                                                                                    "body": "That's a fair point. I do definitely see a lot of anime and gamer spaces that favor sexualization aimed at straight men. \n\n>In other nerdy hobbies like [r/comicbooks](https://www.reddit.com/r/comicbooks/) or [r/rpg](https://www.reddit.com/r/rpg/) it seems to me that sexualization diminished in general\n\nTaking a step back, I'm willing to admit this is probably the bigger takeaway here. I especially see this with younger people who come off as frankly a bit puritanical in regards to sexuality.\n\n>Maybe you just get that impression because of Tumblr\n\nI'll cop to the fact that my impressions might be skewed given how much I avoid the more incel-y side of fan culture\n\nEDIT: You know now that I've actually thought about it, I'm gonna give you this one, I was talking out my ass",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "TwilightVulpine",
                                                                                                            "body": "Yeah, I definitely agree that there's a strange wave of puritanism going on with younger people. My guess is that it's because they've grown up with modern social media constantly hammering on their heads that sexual content is unnacceptable",
                                                                                                            "score": 2,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Graingy",
                    "body": "And it’s annoying when it’s shoehorned into an otherwise good story.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "OnsenPixelArt",
            "body": "If only there were some equivalent term for male waifus..... maifus perhaps",
            "score": 5,
            "replies": [
                {
                    "author": "TheLeechKing466",
                    "body": "I believe the term is “husbando”",
                    "score": 16,
                    "replies": [
                        {
                            "author": "coffeestealer",
                            "body": "It is! I mostly see used in otome game fandoms, I think.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "grief242",
            "body": "A reminder that Redo of Healer, an anime in which a man goes back in time to brainwash/rpe (in no particular order and touching on the horror of ego death) every woman who wronged him was created by a woman. \n\nSome people are just deviants",
            "score": 4,
            "replies": []
        },
        {
            "author": "CloudsOntheBrain",
            "body": "I mean, there's nothing wrong with OOP's description if it's found in a pulp/romance novel. That's the genre. \n\nI do get how it can be annoying if it leaks outside the romance sphere. I still remember proof-reading a college acquaintance's first chapter for a high-fantasy novel he was writing. He had to introduce EVERY female character with a mention of her \"shapely breasts\". He insisted he was just writing in the style of George R. R. Martin. Not a surprise said acquaintance turned out to be a creep.",
            "score": 25,
            "replies": [
                {
                    "author": "Nick_Pap",
                    "body": "The thing is, due to traditional gender roles being what they are, a lot of wish-fulfillment for men tends to be less specifically focused on romance. There's often a strong action/adventure component that's can be even more central to the story than whatever romantic subplot is going on at the same time. \"Hero from a small village saves the realm from dragons and also gets a hot elf girlfriend along the way\", you know how it goes. It's the same kind of wish-fulfillment writing, the genre is just a bit different to appeal to a different audience. There's nothing really inherently wrong with it imo, it just becomes really cringe when people delude themselves into thinking that the schlock *they're* reading (or writing) is, well, not exactly that lol.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "NeetOOlChap",
            "body": "The example you gave is bad but you are so real for the title",
            "score": 15,
            "replies": []
        },
        {
            "author": "Akuuntus",
            "body": "The \"men writing women\" criticism is usually that a lot of men write *all* women like they primarily exist to be attractive, and they do so regardless of the genre. Writing a potential love interest as being sexy is pretty common across the board, but I don't think it's common for female authors to write *all* of their men through a sexual lens like that (unless they're writing smutty romance or something where all the men being hot is the whole point of the story).",
            "score": 16,
            "replies": []
        },
        {
            "author": "DareDaDerrida",
            "body": "Be sex-obsessed if you want. Write smut, or stories with smut in them. It's fine.",
            "score": 11,
            "replies": []
        },
        {
            "author": "MadsTheorist",
            "body": "I always hated tall, dark, and handsome as a descriptor because I'm then greeted by the pale-est man you've ever seen that wears black shirts or jackets",
            "score": 16,
            "replies": []
        },
        {
            "author": "ImShyBeKind",
            "body": "\"Girls want a bad boy to be good to them, boys want a good girl to be bad with them.\"\n\nAin't nothing wrong with giving the audience what they want, but bad writing is bad writing.",
            "score": 3,
            "replies": []
        },
        {
            "author": "RobinCarsTCG",
            "body": "people enjoy sex and writing about sex who give a shit",
            "score": 20,
            "replies": [
                {
                    "author": "Glad-Way-637",
                    "body": "The people who insist \"only men do this, and even if a woman did exactly this, then it would be a completely different thing!!\" There are dozens in these comments alone, lol.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "RobinCarsTCG",
                            "body": "i think people of any gender writing about things that make them horny and publishing it is a net good for the world especially in the increasingly puritanical pivot of culture in the west thanks to the rise of fascism in the united states and its copycats",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Glad-Way-637",
                                    "body": "Just to make it clear, I do agree with you. The smut isn't the problem, the people who use it as an excuse to be sexist are.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "RobinCarsTCG",
                                            "body": "oh lol soz im sick",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Glad-Way-637",
                                                    "body": "We've all been there lol, flu season sucks more than average this time around.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "urkermannenkoor",
            "body": "Pfffffff \n\nTumblr missing the point again. No, sex-obsessed writers are not the problem. There's nothing inherently wrong with writing smut.",
            "score": 18,
            "replies": [
                {
                    "author": "NeonNKnightrider",
                    "body": "I should have cropped that part out",
                    "score": 1,
                    "replies": [
                        {
                            "author": "urkermannenkoor",
                            "body": "Also the other parts. The whole thing is dumb.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Yulienner",
            "body": "Writers with blue eyes: I'm going to generalize about a group and set up a strawman to flatten the discourse because nuance and complexity about how markets work and why certain types of content get popular is hard to fit into a pithy snark post.\n\nAlso writers with blue eyes: And I steal and eat people's pets",
            "score": 7,
            "replies": [
                {
                    "author": "NeetOOlChap",
                    "body": "Nobody should have eyes ever again",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "NeonNKnightrider",
                    "body": "coaxed into a snafu",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "AniTaneen",
            "body": "I genuinely believe that the problem is that people have very different routes to be turned on.\n\nOften, when a work is meant for a effeminate audience it reads:\n\n> Sasuke held his hand over Naruto sleeping fist. He compared how his skin, pale as moonlight, contrasted with Naruto’s sun kissed and muscular knuckles.\n\nWhile the works meant for a more masculine audience will use language like\n\n> Sasuke opened his eyes and saw that Naruto was hungrily staring at him, his lips sealed like a vacuum cleaner around his manhood. The idea of covering that bratty smile with his seed made him harder.\n\nSee… if you are in the first category, you are going to call the second pornographic. While if you are in the second category, the first is such a slow burn it might as well be called dry aged.\n\nBut my conclusion is not simply that they both objectify their characters. It’s also that their definitions of erotic result in a thin veneer behind which they can hide.",
            "score": 12,
            "replies": [
                {
                    "author": "ErsatzHaderach",
                    "body": "You just wanted to write naruto porn be for real",
                    "score": 14,
                    "replies": [
                        {
                            "author": "AniTaneen",
                            "body": "Your username is amazing.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "ErsatzHaderach",
                                    "body": "aww thanks!",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "akka-vodol",
            "body": "Whoops. You've tried too hard to be critical of all problematic media and you've circled back into failing to understand basic feminist critique of media. Now you're mistaking your failure to recognize mysoginy for deeper understanding of the problem. Rookie mistake.",
            "score": 25,
            "replies": [
                {
                    "author": "akka-vodol",
                    "body": "For those who aren't happy with incendiary replies and want a more in-depth response :\n\nThe point of \"female objectification\" as a lens of analysis wasn't to call out scenes that were written sexily for the purpose of being sexy. No one has a problem with describing a woman's tits in a horny novel about a steamy affair with a sexy woman. The problem was that female objectification, as a trope, was and largely still is present where it doesn't make sense.\n\nMale writers would describe a woman's tits and hips even in a scene that *isn't* trying to be sexy. Even when it doesn't narratively or emotionally make sense to try to elicit arousal in the moment. Even when the woman is seen through the eye of someone who isn't attracted to her, even when she isn't going to be anyone's sexy affair or love interest. And it was rare for a woman to not just be a sexy affair or love interest, which was also part of the problem.\n\nAnd no, men do not, and never have, gotten the same treatment. They're sexualized when that's the point, obviously. But they aren't sexualized by default. Even in books written by female writers. There was and to a lesser extent still is an unconscious assumption in fiction that a when a woman is being described in a novel, the tone and purpose of the scene is to be sexy purely because that's a woman. *That* is what female objectification is.\n\nAnd of course there are exceptions. Of course there are bad book written by untalented women that sexualize men for no reason. But the point of media analysis is to analyze broad and recurring tropes in media, not to dig out niche examples of bad writting and laugh at the bad writing.",
                    "score": 21,
                    "replies": [
                        {
                            "author": "Heather_Chandelure",
                            "body": "Fully agree. This post completely misses the point of what the \"breasted boobily\" criticism is even about.",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "NeonNKnightrider",
                            "body": "I can’t speak for the tumblr users, but like,\n\n I understand the concept of male gaze. I wasn’t trying to make some broad criticism of all sexuality in fiction.  I just wanted to make a funny post about the fact that female writers also have their own cliche ‘sexy’ tropes",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "akka-vodol",
                                    "body": "but is that what the post you shared is *saying* ?\n\nbecause I'm reading this post and what I'm reading is a response to the notion that women are sexualized and obectified in media. a response that says \"women do it to men too so it's not a gender issue\".\n\nI'm down to share some extracts of erotica written by women and make fun of the tropes there. It's been done many times, it can be all in good fun. But that's not quiet the same thing as bringing up a core point of feminist media critique and saying it's wrong and denying that there's misogyny involved.",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Glad-Way-637",
                            "body": ">And no, men do not, and never have, gotten the same treatment.\n\nSorry pal, but you just haven't read enough shitty media made by women. They aren't niche examples just because you've never heard of them, most people haven't ever heard of the vast majority of examples on r/MenWritingWomen either.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "akka-vodol",
                                    "body": "see, that's the problem. you think that r/MenWritingWomen is a good showcase of the problem.\n\nthat subreddit is for sharing the most absurd and entertaining cases of women being sexualized. it isn't a good analysis of the way that misogyny is pervasive in media in general. yes, the stuff being shared there is cherry-picked bad writing, that's kind of the point.\n\nbut misogyny in media doesn't just exist in cherry-picked bad writing. up until fairly recently, it *was* almost everywhere. so yes, you could cherry-pick bad writing by women to prove that they're also capable of that. but if you think that you're proving that the problem exists on both sides, then all you're really showing is that you fully do not understand what the problem is to start with.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Glad-Way-637",
                                            "body": "That subreddit and the weird bias in its members (\"only men do this no exceptions!\" Is rampant as an attitude over there) is exactly the place this post is complaining about, I'm 90% certain. I think you might actually be the one  who doesn't fully understand the point in the post, cause it ain't about saying there aren't misogynistic tropes in media. It's just saying that there aren't ***only*** misogynist tropes, and believe me, plenty of people try and argue to the contrary.\n\n>that subreddit is for sharing the most absurd and entertaining cases of women being sexualized. it isn't a good analysis of the way that misogyny is pervasive in media in general. yes, the stuff being shared there is cherry-picked bad writing, that's kind of the point.\n\nThe problem is, though, the people there treat it like it is an analysis of misogyny in media, and they're simply hypocritical enough about it that it's worth making a complaint post because of that.\n\nAlso, if you *genuinely* think that you need to be cherry-picking to find examples of misandry (or at least, weird objectifying stereotypes used for perfectly valid smut reasons) in media made by women, then this is gonna be an unproductive conversation for both of us tbh.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "akka-vodol",
                                                    "body": "Okay I'll save us from an unproductive conversation by getting to the core of the disagreement. Consider the following statement.\n\n> Misogyny, and it's associated tropes such as female oversexualization, are highly present in most media, more so in older media. Misandry in media is not a problem that exists on a comparable scale, or warrants a comparable amount of discussion and critical analysis.\n\nDo you agree with this statement ?\n\nIf so, then I will ask you to re-evaluate the discussion in the light of this statement and see if you understand the point I'm making.\n\nIf not, then you and I simply percieve two different realities and I do not believe it will be possible to bridge that gap. I would encourage you to go watch some feminist video essays and learn about misogyny in media. Other than that we should just end the discussion here.",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "Glad-Way-637",
                                                            "body": ">Okay I'll save us from an unproductive conversation by getting to the core of the disagreement. Consider the following statement.\n\nI genuinely appreciate this.\n\n>Do you agree with this statement ?\n\nNot in the slightest, that statement is overwhelmingly made by people who simply agree with the misandry and thus don't consider it to be a problem IME. Media loves to portray men as disposable and talk about how amazing it is when they sacrifice themselves for women, among many, *many* other things.\n\nAgreed on the different perceived reality, I'd also encourage you to look at how you might be considering certain things to not be misandry when you would absolutely call them misogyny if they were applied to a woman.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "akka-vodol",
                                                                    "body": "welp, irreconcilable difference it is then.\n\nI hope one day you get out of that \"competition of the most oppressed gender\" mindset of yours. And realize that liberation for all genders is accomplished by acknowledging the reality of gender prejudice in our culture, not by treating it as an accusation that you have to defend against with your best \"they're doing it too\".\n\nbut I won't be the one to convince you of that today. goodbye.",
                                                                    "score": -1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Glad-Way-637",
                                                                            "body": ">I hope one day you get out of that \"competition of the most oppressed gender\" mindset of yours.\n\nFrom my perspective, the one falling into that trap is you. All I've said is that misandry exists, and you might be ignoring some of it. You're the one who called it completely incomparable in scope to misogyny.\n\nSee yah!\n\nEdit: actually, reading your previous comment, you literally say that your gender is the most oppressed one, and thus the problems of the other gender should be ignored. Now I'm curious, how do you reconcile this comment with the stance in the one I'm replying to?",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "alelp",
                            "body": "The problem with you comment is that it's based on the assumption that both genders sexualize the other in the exact same way, which is disproven by the fact that women don't consume porn at nearly the same rates that they consume erotica and smut.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "akka-vodol",
                                    "body": "my comment is not, in fact, based on that assumption. you can account for gender differences in the way sexualization manifests in your analysis, you would still find that popular media objectifies women in a way it doesn't do men.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "alelp",
                                            "body": "Of course you would, you're just blind to it the same way men are blind to the sexualization of women.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "akka-vodol",
                                                    "body": "...men are capable of noticing the sexualization of women. Like, they were more oblivious to it when it was normalized. They are less likely to notice a piece of media which caters to the male gaze than someone who isn't being catered to. But they're not incapable of seeing it. When feminist critiques started pointing this stuff out, the reaction of a lot of men was \"oh damn you're right women are super sexualized in media, that's wild\".\n\nYou seem to think there's some kind of irreconciliable disconnect between the mind of men and women that make them incapable of understanding one-another's perspective on media. There isn't.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "alelp",
                                                            "body": ">You seem to think there's some kind of irreconciliable disconnect between the mind of men and women that make them incapable of understanding one-another's perspective on media. There isn't.\n\nI mean, you sure are disproving your point by inherently denying the way it happens in your previous comment:\n\n>my comment is not, in fact, based on that assumption. you can account for gender differences in the way sexualization manifests in your analysis, you would still find that popular media objectifies women in a way it doesn't do men.\n\nOr maybe the objectification of men is so normalized in real life that you just assume it's normal when you see it in media?",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "alelp",
                            "body": "The problem with you comment is that it's based on the assumption that both genders sexualize the other in the exact same way, which is disproven by the fact that women don't consume porn at nearly the same rates that they consume erotica and smut.",
                            "score": -2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SnooLemons3996",
            "body": "I agree with the concept, but I don’t think it’s a problem, there will be male gaze and female gaze porn written regardless, it’s better to try and enjoy it from both perspectives rather than fight on which one is ok and which one is an “evil virus of Satan”",
            "score": 9,
            "replies": [
                {
                    "author": "Glad-Way-637",
                    "body": "This is a very agreeable statement. The problem only comes into play when people try and act like only a single demographic does this and that's a problem, or that it's only a problem when that demographic does it. You can see those exact takes littering this entire comment section, lol.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Scorkami",
            "body": "\"pornography is unrealistic, cruel, violent and objectifying\" says person who is currently reading a book about a girl fucking a human dragon hybrid with 2 dicks which are both the length of her forearm (the sequel includes his two equally hot twin brothers in the bedroom)",
            "score": 7,
            "replies": []
        },
        {
            "author": "Tethilia",
            "body": "To be fair, if characters of every gender were written badly in the same novel it would probably be ironically great.",
            "score": 3,
            "replies": []
        },
        {
            "author": "faerie-bunnie",
            "body": "\"the problem is sex-obsessed writers\"\n\ni never encounter language like this in the books i read. maybe the issue is that these tumblr users are reading young adult romance books when they don't like young adult romance...",
            "score": 3,
            "replies": []
        },
        {
            "author": "Vivi_Pallas",
            "body": "Tbh I think this has to do more with the fact that smut is very popular among women. Of course the characters are going to be sexualized in your generic romantasy. That's it's purpose. The problem is if it's happening in a detective novel or something.",
            "score": 3,
            "replies": []
        },
        {
            "author": "sharrancleric",
            "body": "Someone saw \"men and women both write sexy characters\" and their takeaway was \"ah yes, it is the sex that is wrong.\"",
            "score": 3,
            "replies": []
        },
        {
            "author": "coffeestealer",
            "body": "\"Sex-obsessed\"...\n\nCan people stop being scared of normal human emotions and behaviours for like thirty seconds.",
            "score": 5,
            "replies": []
        },
        {
            "author": "arsapeek",
            "body": "\"Sex obsessed\" writers aren't the issue. You can write sex scenes, GOOD sex scenes, with any gender or body type. The issue is people don't, or publishers that wont put it in print",
            "score": 9,
            "replies": []
        },
        {
            "author": "idkbutiliekcats",
            "body": "Male characters still have personality and a purpose outside of being brooding arm candy in literally like 99.9% of fiction and I would argue most female characters are treated more like pretty accessories than anything even in genres that have nothing to do with romance. Stupid take",
            "score": 22,
            "replies": [
                {
                    "author": "Volcano_Ballads",
                    "body": "What, in romance novels? Most of them just have a few traits that are always there no matter if the book is completely different. Tall, controlling, usually incredibly toxic, gives off a lot of stalker vibes   \nwhat is with straight women with ts lmao",
                    "score": 19,
                    "replies": [
                        {
                            "author": "idkbutiliekcats",
                            "body": "It's a popular fantasy, and at least it's completely fictional and ultimately just really cringe if anything (unless it's like that time some biker was getting harassed by booktok members)",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Volcano_Ballads",
                                    "body": "Me personally I find this one this video is talking about the funniest [https://youtu.be/tbU8MiZRxwg?si=cuWekNIgGvJIp8vF](https://youtu.be/tbU8MiZRxwg?si=cuWekNIgGvJIp8vF)   \nalso don’t forget I’m pretty sure that biker was like 16",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "idkbutiliekcats",
                                            "body": "God yeah those reels are so cringe to watch 😭 & I did not know he was 16 wow that's awful",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Volcano_Ballads",
                                                    "body": "Thankfully this shit hasn’t-and probably won’t ever infect my neck of the woods  \nthe ones that consume this stuff are far too scared of black people and actual alternative culture to do so",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "lynx_and_nutmeg",
                    "body": "I've read tons of books over my life, including many classics and books written by male authors, and this is a massive exaggeration. I've never had any issue finding books with well-depicted female characters.\n\nAnd there's a difference between a sexualised female character and a poorly written one. The last book I read that could be accused of the former was The Terror by Dan Simmons. Like, sure, the author did mention one female characters' areolas a weird number of times, but other than that she was still a full-fledged character.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "idkbutiliekcats",
                            "body": "im happy 2 believe you :) in all fairness i read a lot more manga etc than i do books so im not the best judge",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Lambbda",
                    "body": "That depends on what you read. Remember, it's tumblr. Have you seen the local favorite The Locked Tomb? Women can be just as hilariously bad at writing men as the opposite",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "robinperching",
            "body": "This is a very silly example. There is nothing wrong with being 'sex obsessed' in writing and frankly we should encourage it. \n\nThe issue is the  wider gendered context in literature broadly - men are typically sexualized in steamy romance novels and depicted otherwise with depth by many female authors, while women are more frequently sexualized *at the expense* of characterization in *all* settings by many male authors.",
            "score": 10,
            "replies": []
        },
        {
            "author": "Last-Percentage5062",
            "body": "Ok, so the difference is that a lot of the time, if a woman writes like this, she will be considered a romance author, her books will be marketed as romance, or if it’s *really* like that, erotica, and so her readers will generally expect and typically want this content.\n\nA lot of the time men will write like this in, say, a drama, or a comedy, or something else, in which case, it’s kind of uncomfortable to read.\n\nThat’s just my personal experience though, and I’d love to read other people’s thoughts though.",
            "score": 11,
            "replies": [
                {
                    "author": "NeetOOlChap",
                    "body": "> I’d love to read other people’s thoughts though.\n\nI agree, but there's a good reason for it. Usually men don't want romance dramas where the conflict comes from the romance, they want novels where there's both a conflict and a romantic thread that's strong enough the conflict can't break it.\n\nHowever, in the exceptions, fantasy or scifi novels with romance aimed at women will be marketed more as romance, while romance aimed at men will be marketed to a general audience. You'll rarely see a guy sold books aimed at women with a female lead and romance plot even with worldbuilding about dragon warfare, so they don't end up complaining about the ebony haired brooding soldiers, but you'll still see women pick up fanservice-heavy harem manga anyway.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "cyborgjohnkeats",
                    "body": "You're 100% right. The post is making a comparison between romance novels/erotica (one type of genre book which is meant to be horny) that happen to be written by women and Every Other Kind Of Book that happen to be written by men (books which may or may not supposed to be horny depending on genre but often only are at the expense of women regardless of if the situation calls for it).\n\nTumble and this post forgot that the criticism of a certain kind of male writer is based on a history of feminist literature and media analysis and didn't just emerge from the sea foam and ether like a misandrist Venus.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "killertortilla",
            "body": "That's not really the same thing though is it? We're comparing \"fuck I want to fuck this guy\" to \"her breasts bounced around like a couple of light weight bowling balls\" it's horny vs horrible.",
            "score": 15,
            "replies": []
        },
        {
            "author": "magnaton117",
            "body": "What the hell even is \"brooding\" anyway? Just frowning and staring off into the distance? How tf can anyone find  that attractive",
            "score": 5,
            "replies": [
                {
                    "author": "Volcano_Ballads",
                    "body": "Literally just a term that people use to make it seem like wanting to be alone is a bad thing",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "VatanKomurcu",
            "body": "no. dont be not-horny. try to be creative about your horniness.",
            "score": 4,
            "replies": []
        },
        {
            "author": "PunkTyrantosaurus",
            "body": "I argue the male writers are bad thing being equal to horny writers are bad- because if you want to talk about a woman's tits, fine, but don't do it like they're sentient things. The issue is more that they have seemingly no idea how woman's bodies work rather than that they're horny. \n\nThat was fine prose from a horny writer XD",
            "score": 5,
            "replies": []
        },
        {
            "author": "cyborgjohnkeats",
            "body": "Why are we comparing explicitly \"romance novel\" genre literature written by women  to the entire broad spectrum of literature written by men?  Seems like a weak argument and not what people are actually talking about when they complain about how men write female characters sometimes. Intentionally missing the point.\n\nIs this post implying that the only thing women write is romance/smut and every other genre of literature (where the complaints of poorly written female characters are focused) is written by men?",
            "score": 5,
            "replies": [
                {
                    "author": "NeonNKnightrider",
                    "body": "hey you posted this comment five times\n\nalso no",
                    "score": 2,
                    "replies": [
                        {
                            "author": "cyborgjohnkeats",
                            "body": "I deleted the extras lol. Oops",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Green__lightning",
            "body": "I think the problem is less horny writing, and that horny writing is annoying unless you're also horny for whoever they're writing about. \n\nThis is no less true about other stuff, you can write like that about all kinds of things, and it's no less annoying.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Matcha_Bubble_Tea",
            "body": "It’s the “I can fix him/her” that still applies honestly ",
            "score": 2,
            "replies": []
        },
        {
            "author": "Haasonreddit",
            "body": "I just listened to the fourth wing on audiobook.\n\nThere was like a 10 minute sex scene followed a few minutes later with another sex scene.\n\nI’m just trying to hear some shit about dragons…",
            "score": 2,
            "replies": [
                {
                    "author": "reddrighthand",
                    "body": "I just started reading it and I am pretty sure what we will get is dragon sex.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Snack29",
            "body": "it’s all the straight people’s fault (joke)",
            "score": 2,
            "replies": []
        },
        {
            "author": "johnmarksmanlovesyou",
            "body": "This is just not accurate, it's missing the first 6 chapters of slow burn teasing, glancing eyes and emotional exploration and it also hasn't got any mpreg",
            "score": 2,
            "replies": []
        },
        {
            "author": "MagicalLibtard",
            "body": "While objectification can happen toward all genders, lets not forget that there are gender specific negative norms in how women portrayed.\n\nI am not a literature expert but I feel like women are much more commonly presented as sort-of objects in that they are not given much agenthood in the narrative themselves but are rather there as \"rewards\" or motivation for male characters. This is especially true for older media but I don't think these norms are necessarily gone.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Dvoraxx",
            "body": "All i’m gonna say is that books about bland women from Forgettabletown getting inexplicably romanced by up to 8 brooding bad boy werewolf princes are really, really popular. Straight women are just as much shameless gooners as straight men are",
            "score": 2,
            "replies": []
        },
        {
            "author": "Starry-Gaze",
            "body": "Objection: these authors aren't problematic or bad at writing, they are writing wish fulfillment novels focusing on physical attraction. These books aren't bad, they just aren't for some readers. Ain't no shame in being narratively horny, fuck outta here with that Puritan shit",
            "score": 2,
            "replies": []
        },
        {
            "author": "thedaniel",
            "body": "Oh man my wife used to ghostwrite like… werewolf erotica and this is so true, every story. She’s even working on an essay about it",
            "score": 2,
            "replies": []
        },
        {
            "author": "bard_of_space",
            "body": "two problems can exist at once, actually",
            "score": 2,
            "replies": []
        },
        {
            "author": "CrazyPlato",
            "body": "There should be a WritersOnly app, so writers can all bone each other and work out some of that horny energy before they write",
            "score": 2,
            "replies": []
        },
        {
            "author": "Economy-Document730",
            "body": "Naw sex books are great. Why is tumblr seemingly anti romance novel",
            "score": 2,
            "replies": []
        },
        {
            "author": "The-Magic-Sword",
            "body": "But why is it a problem",
            "score": 2,
            "replies": []
        },
        {
            "author": "AutumnWisp",
            "body": "STOP writing words. \n\nWords were meant to be SPOKEN, not written.\n\nYears of writing words yet no real world use found for books.\n\nWant to write something down anyway for a laugh? Guess what, we have a tool for that, it's called REMEMBERING.\n\n\"Yes please, write a story for me. Create characters and a plot out of NOTHING.\" Statements dreamed up by the utterly deranged.\n\n\"Ho ho, I LOVE character development.\"\n\nThey have played us for absolute fools.",
            "score": 2,
            "replies": []
        },
        {
            "author": "PuritanicalPanic",
            "body": "I have no time for puritan attitudes towards sex.\n\nThe problem is respect. Not sexualization, not even objectification. It's everything else. If a man wants to write a boobly breasting sexy hot girl that's fine. Long as he makes her a person and an actual character too.\n\nYour title is a fine example of a not person. A not character. An empty doll. That's the problem. Though mostly the problem is its just shitty quality. It's bad writing. \n\nSex is not evil. Grow up. If you agree with Christian fundamentalists on sex you're just not correct.",
            "score": 2,
            "replies": []
        },
        {
            "author": "kjexclamation",
            "body": "No need to make this anti-sex lmao it’s not sex-obsessed it’s BAD writers and the valence of their bad writing tends to be gendered as bad writers struggle writing fleshed out, non-prop characters of the opposite gender.",
            "score": 2,
            "replies": []
        },
        {
            "author": "NeverackWinteright4",
            "body": "Horny is as horny does.",
            "score": 2,
            "replies": []
        },
        {
            "author": "NarrMaster",
            "body": "As a Derek with piercing blue eyes and lips I've been told are really nice...\n\nI don't know what to make of this.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Wild_Buy7833",
            "body": "Hey you, brainrotted smutfic reader: member, piercing cerulean orbs, smirk, loom, smoldering gaze, firm grasp, burning touch, half lidded eyes, presence, ebony hair/ravenette, predatory grace.\n\nNow that the sleeper codes have been activated go drink some water and take a nap",
            "score": 3,
            "replies": []
        },
        {
            "author": "Choice-Sea-6964",
            "body": "awful post, this sub genuinely sucks",
            "score": 16,
            "replies": [
                {
                    "author": "jackofslayers",
                    "body": "This is an incredibly high variance subreddit. The posts are either making fun of Tumblr hot takes or regurgitating them with no in between.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "NeonNKnightrider",
                    "body": "i promise I wasn’t trying to make some sweeping commentary on misogyny, just that women also have some tired cliches about sexy male characters \n\ncomments just go wild sometimes",
                    "score": 17,
                    "replies": [
                        {
                            "author": "Coal_Burner_Inserter",
                            "body": "Even if you disagree with this post calling it \"awful\" and that this sub \"genuinely sucks\" is such peak reddit/tumblr crossover i should put it on ao3",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "lynx_and_nutmeg",
                            "body": "This sub does this every time, it's so annoying. There's some mostly innocuous post that was never supposed to be that deep, or it actually does have a point, but all the comments hack it to pieces in the most smugly contrarian way possible and pat themselves on the back like \"look how much smarter we are than those dumb Tumblrites\".",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Glad-Way-637",
                    "body": "I've got good news, you don't have to be here! You can thank me for my wonderful advice later.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Broad_Direction7112",
            "body": "I mean I could have told you that from the sheer size of DC comics' female fanbase",
            "score": 4,
            "replies": [
                {
                    "author": "NeonNKnightrider",
                    "body": "Dick Grayson",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Broad_Direction7112",
                            "body": "Basically the entire penis-bearing half of the bat-family including bruce",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "chaoticdesires",
            "body": "Congratulations you’ve invented Puritanism",
            "score": 10,
            "replies": [
                {
                    "author": "gerkletoss",
                    "body": "Were Puritans particularly good at pointing put double standards?",
                    "score": 23,
                    "replies": [
                        {
                            "author": "jackofslayers",
                            "body": "The ability to point out double standards IS the difference between Protestantism and Catholicism",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "couldntbdone",
                            "body": "In other people certainly. Most people are great at that.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MeisterCthulhu",
                    "body": "Not really?\n\nThis just says that reducing a character down to their sexuality makes for bad writing. As making one-dimensional characters tends to.\n\nThere is no moral judgment here nor a complete rejection of sexual notions",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "teball3",
            "body": "ITT: an energy for defending horniness that would *never* fly for defending men by themselves. \n\nAnd also just plain misandry. \"We women are conscientious, empathetic lovers, in comparison to those bestial, primative men\". Get the fuck outta here. Or at least go full Dworkin and say that men and women are explicitly different in sexual attraction in ways that make women's more noble. \n\nI expected all of it, see y'all in the subredditdrama thread.",
            "score": 3,
            "replies": []
        },
        {
            "author": "eowynistrans",
            "body": "Goomba fallacy",
            "score": 4,
            "replies": []
        },
        {
            "author": "Designated_Lurker_32",
            "body": "Honestly, if you think about it, these male \"beauty standards\" are even more dehumanizing than the female ones we often complain about. Especially because of that whole \"is dangerous to others but is nice to you\" bit. They literally expect you to act like a territorial animal instead of a human being. *Fuck.* *That.*",
            "score": 7,
            "replies": []
        },
        {
            "author": "blindgallan",
            "body": "The problem is hypocrisy and poor quality writing, regardless of who is doing it.",
            "score": 4,
            "replies": []
        },
        {
            "author": "bookhead714",
            "body": "I mean, they are different. A straight male writer’s idea of excessively sexualizing a character strips them of agency or power, whereas a straight woman’s writing tends to *emphasize* strength and competence to a comical degree. Both result in boring, flat characters who exist only as wish fulfillment for the author and reader, but let’s not pretend they’re identical.",
            "score": 3,
            "replies": []
        },
        {
            "author": "a-woman-there-was",
            "body": "Tldr: \"I want a story about romance and desire (i.e. two people kissing) without actual sensuality\". Do you people hear yourselves? Do you comprehend that attraction and sexuality can exist without objectification, and that \"men writing women\" is a problem because it exists within the framework of patriarchy, not because sexual desire itself is bad, or are you just that heteronormativity/fundie-damaged? I swear. \n\nTalk about conventional beauty standards, talk about romance-writing cliches if you must, but stop acting like the tamest possible expressions of human desire are in any way on par with the routine assumption that women's bodies are public property. You aren't scoring one against oppressive attitudes about sex: you're reinforcing them.",
            "score": 6,
            "replies": [
                {
                    "author": "Glad-Way-637",
                    "body": "I think you might be looking into this a bit too deeply? The post is just saying that the people who constantly complain on places like r/MenWritingWomen about how this is exclusively a male phenomenon tend to not read enough women-written fiction to know it absolutely is not.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "a-woman-there-was",
                            "body": "I mean it's entirely missing why those critiques exist in the first place--it's not because horny = inherently bad/objectifying, it's because men writing women predominantly as sex objects exists in the context of systemic exploitation and entitlement--women aren't the ones currently trying to legislate men's control over their own bodies and lives into nonexistence, let alone routinely sexualizing them from childhood and commodifying that exploitation a la Andrew Tate or the porn industry.\n\nA woman writing horny fiction about men (usually for an audience of mostly women) pales in comparison to the routine objectification of \\*living people\\* \"men writing women\" happens in conjunction with.\n\n(And for the record if a man wrote something as innocuous as that post's example about a woman (\"nice abs, nice lips, here's a steamy kissing scene\") it wouldn't even register. What people mean is \"I'm describing the shape of a woman's breasts through her clothes in an ostensibly non-sexy context and asking you to assume her human worth based on how perky they are.\")",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DeconstructedKaiju",
            "body": "Ok but the dude in this isn't being objectified.",
            "score": 1,
            "replies": [
                {
                    "author": "demonking_soulstorm",
                    "body": "He kind of is? We don’t have the rest of the story to confirm it but it seems here this person’s only value is as a romantic/sexual prospect.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "demonking_soulstorm",
                                    "body": "If that's what you want to think...",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "DeconstructedKaiju",
                            "body": "No. He's not. Nor would a woman written like this in the exact same way. The scene they chose shows zero objectification. Being sexually desirable isn't objectification.\n\nObjectification is writing about women and going on about the \"tiny size of her vagina\" going on and on about her tits amd dick sucking lips.\n\nIf men were actually written about like how men write about women (all too often, but not always) it would involve banging on about their dick and balls, the pucker of their ass, crap like that.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "demonking_soulstorm",
                                    "body": "I literally fucking said we don't have the rest of the story to confirm but this is *obviously* being written with the intent on only focusing on the alluring aspects of the male character. \n\nWomen have different ways in which they express sexual desire (which is its own patriarchal can of worms), and that comment was clearly written with the intention of objectification. How the hell can you engage in such bad faith.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "DeconstructedKaiju",
                                            "body": "I said nothing to disagree with your point about the rest of the story so I don't get why that's even worth mentioning again at all?\n\nIf this exact same wording was used with a female character, which is something I said, it wouldn't be objectifying. It's just a sex scene.\n\nIt was written with the intent to objectify... and fucking failed.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "demonking_soulstorm",
                                                    "body": "If the exact same wording was used it would be different because men and women are different with different perceptions of the world. What are you talking about.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Poke_Jest",
            "body": "Now watch the absolute COPE in the comments that it's somehow \"different.\"",
            "score": 4,
            "replies": []
        },
        {
            "author": "IceCreamSandwich66",
            "body": "tumblr users when a societal issue doesn't go both ways so they need to make up a new problem",
            "score": 2,
            "replies": []
        },
        {
            "author": "Corniferus",
            "body": "This comment section is cringe af",
            "score": 1,
            "replies": []
        },
        {
            "author": "Long-Cauliflower-915",
            "body": "Image seems like Goomba fallacy to me",
            "score": 1,
            "replies": []
        },
        {
            "author": "Haasonreddit",
            "body": "I just listened to the fourth wing on audiobook.\n\nThere was like a 10 minute sex scene followed a few minutes later with another sex scene.\n\nI’m just trying to hear some shit about dragons…",
            "score": 1,
            "replies": []
        },
        {
            "author": "MagicalLibtard",
            "body": "What is the point of this gender war-ism. You can point out male objectification in literature but why phrase it about \"female writers\". A lot of female writers write men fantastically and are not hypocrites.",
            "score": 1,
            "replies": []
        },
        {
            "author": "tetrarchangel",
            "body": "Can't post images on this sub but in short: learn what power is.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FixofLight",
            "body": "…Sure, but no one makes kids read the women's work out loud in class for generations, so Imma give them a pass.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Marinut",
            "body": "Nice to me? What am I, a weenie? No, a brooding man who equally is terrible to everyone",
            "score": 1,
            "replies": []
        },
        {
            "author": "132739",
            "body": "Eh. Outside of Romance and adjacent genres (which shouldn't count, since that's the whole point), I legit see a lot less of this kind of shit from female authors. Not *none* mind you, women are people and all, but a lot less.",
            "score": 1,
            "replies": []
        },
        {
            "author": "wulfinn",
            "body": "no, I like it when the writers are horny, but I also want them to be skilled. i want real descriptions of passion and sensation, not tired metaphors and boobing boobily.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jofromthething",
            "body": "It’s not a men or women or sex problem it’s a sexism problem. It tends to be uniquely bad when men do it not because men are worse but because there is a system of misogyny that it feeds into. Women don’t have such a system to feed into, so their vapid flat sexy characters don’t tend to be so harmful, though sometimes it can be (sic racism)",
            "score": 1,
            "replies": []
        },
        {
            "author": "LCDRformat",
            "body": "Not sex obsessed enough really. Check me out on Literotica \n\n[https://www.literotica.com/authors/LCDRformat/works/stories](https://www.literotica.com/authors/LCDRformat/works/stories)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Elite_AI",
            "body": "Counterpoint: I didn't see a single person complain about \"breasting boobily down the stairs\" in literal, actual porn aimed at men.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ImmoralJester54",
            "body": "We all enjoy a lil trash",
            "score": 1,
            "replies": []
        },
        {
            "author": "loved_and_held",
            "body": "The problem isn’t sex obsessed writers, its writers who can’t weave the sexual elements into the story well enough and this the story suffers.",
            "score": 1,
            "replies": []
        },
        {
            "author": "magikot9",
            "body": "It's called a husbando",
            "score": 1,
            "replies": []
        },
        {
            "author": "whateverMan223",
            "body": "y'all....the market is VERY well established. If people bought boring books, they'd be all over the shelves....or whatever the modern equivalent is. People buy sex, so people write about sex.\n\ndo you have any idea how many failed writers there are out there?",
            "score": 1,
            "replies": []
        },
        {
            "author": "CRoss1999",
            "body": "Nothing wrong with sex obsessed writers of any gender",
            "score": 1,
            "replies": []
        },
        {
            "author": "Random_Rainwing",
            "body": "Batman is irresistible to women",
            "score": 1,
            "replies": []
        },
        {
            "author": "wildebeastees",
            "body": "OOP doesn't know what objectify means. Dark broody handsome male characters in romance books are not objects, they are subjects and mostly have a personality, backstory and goals and actions that are not completly about female characters. All the things male writer's female characters boobing breastily do not have.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NeetOOlChap",
            "body": "Female shonen artists describing women: She's the most beautiful person anyone's ever met and the epitome of kawaii feminine grace. She spends the majority of her time in impractically revealing outfits and kicks ass. She has huge boobies and gets at least one scene bathing\n\nI'd make a comment about male shoujo artists but I don't know any",
            "score": 1,
            "replies": [
                {
                    "author": "NeonNKnightrider",
                    "body": "male shoujo artists: Fujimoto Chainsawman",
                    "score": 4,
                    "replies": [
                        {
                            "author": "NeetOOlChap",
                            "body": "I hope this letter finds you well. I deeply regret to inform you that Chainsaw manga is a shonen manga. My condolences.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Wild_Highlights_5533",
            "body": "Do you genuinely think this happens as much as the way men write/draw/depict women?  Have you see any fantasy art, ever?  Women are always thin and hairless with major cleavage while you’ll find men of all shapes and sizes. I really don’t think this is as big of an issue as you think it is.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KrillLover56",
            "body": "\"both genders\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "lil-lagomorph",
            "body": "as a gray ace and an enby who is fucking sick to death of heteronormativity, i’m just tired of having to pick useless horn out of the shit i’m reading (or watching). i get sex sells, and authors are allowed to write whatever they want, and not all sex is useless to the plot. but when im trying to get into an adventure and there are four paragraphs about how someone breasted boobily away or used their Mighty Meat Tube to seduce some rando, i want to strangle the author \n\nETA: this is not to say all horn in media is useless. i don’t care if sex/sex scenes exist. i care whether or not they actually contribute to the plot (looking directly at you, GRRM and Stephen King)",
            "score": -11,
            "replies": [
                {
                    "author": "AbsolutelyHorrendous",
                    "body": "While I do kinda get where you're coming from when it comes to excessive gratuitous sex, it always strikes me that sex scenes are often the only part of a book where they're often expected to be 100% utilitarian. Like, if two characters are banging away just cos, I'm going to roll my eyes, but it's using words like 'useless' that strike me as odd, because would you describe any other parts of a book that way? I don't think I've ever read a bit of extraneous dialogue and thought 'well, that was useless' \n\nUnfortunately when it comes to heteronormativity, it's 'the norm' for a reason, because romantic and sexual desire is an important part of most people's lives (and I'd definitely say that isn't just a 'hetero' thing), so it's natural that it comes up a lot in books. It's unfortunate for yourself, but it's kinda just how it's always going to be",
                    "score": 11,
                    "replies": [
                        {
                            "author": "saevon",
                            "body": "I've totally read dialog and thought \"that was useless\"; or skimmed past a large action scene because it was exhaustingly useless; or read an entire paragraph of prose thinking \"wow I got its meaning in like two words… the rest was mostly useless <exaggerating>\". Or read exposition that's completely useless cause it's not even used later\n\nExposition is one we often point out how grating it is; usually because it's given at a bad time for the audience to absorb any of it. Or cover so many aspects you feel surrounded in red herrings (making it useless)\n\nAction is common abd tho it can be written for its own enjoyment, there's definitely useless action that seems forced.\n\n\"Filler\" is the word we'd use for a lot of these; but for \"random sex appeal\" it's usually mid-sentence and constant. So maybe \"padding\" is a better word. \n\nYou could also call a lot of this \"badly done\" or \"forced\". But I can see \"useless\" — since often it feels the author is throwing it in more as \"fanservice\" or because they feel they have to, than any thought towards the overall story.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Graingy",
                    "body": "I feel similar in general. I wish to keep the media I associate with (and therefore the creators too) clean. Unfortunately, I’ve long since realized that this is a foolish expectation and to not trust anyone. *Anyone.*\n\nIt sucks, but I can’t look past weird horny shit. It’s a dealbreaker. Ew.",
                    "score": -11,
                    "replies": [
                        {
                            "author": "lil-lagomorph",
                            "body": "tbh i don’t care if my media is clean, but i do care if the sex actually, yknow, adds anything to the plot besides sex. if it’s not a romance novel, that’s just not the type of thing i’m looking for ",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "ByteSizeNudist",
                                    "body": "Sometimes it feels like authors don’t know how to “show don’t tell”.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "lil-lagomorph",
                                            "body": "yeah that’s a pretty big issue in lots of creative writing. like, i enjoy subtle sex scenes and romantic moments that build character (for example, the sex scene and romance subplot in Peter Beagle’s *In Calabria*), but too many authors are very in your face about it, which just isn’t my vibe ",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Graingy",
                                    "body": "Difference in opinion.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "lil-lagomorph",
                                            "body": "entirely fair, and i hope you find more media that vibes with your style in the future 👌 ",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Graingy",
                                                    "body": "There’s next to nothing. I can no longer trust artists.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SlowMope",
            "body": "One is describing how male authors write women in regular fiction, the other is describing how romance authors write \n\n\nThese are not the same.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Vyverna",
            "body": "It may be controversial, but honestly - I disagree.\n\nBoth boobs titting boobily and blue eying piercing gazes are valid, as long as you know that you write b0rn - regular or emotional, doesn't matter, you should know the niche. But while most of woman writers (or at least their readers) seem to be aware what they write, too many men writers seem to think that their erotic fantasies are something deep and universal.",
            "score": -1,
            "replies": []
        }
    ]
}