{
    "title": "\"No one has empathy. No one has real opinions. Everything is virtue signalling.\" I'm so sick of this bullshit take.",
    "author": "TheOtherSideRise",
    "subreddit": "JoeRogan",
    "rank": 19,
    "score": 64,
    "upvote_ratio": 0.64,
    "num_comments (reported by reddit)": 139,
    "url": "https://i.redd.it/h2wkm9qzjgpe1.jpeg",
    "id": "1je67f1",
    "selftext": "",
    "comments": [
        {
            "author": "hughmanBing",
            "body": "“The fundamental weakness of Western civilization is empathy.” -Elon Musk\n\nThe most cognitively impoverished of society seems to have decided that empathy is weakness. They see someone with empathy for another person or group of others and need to demonize it as \"woke\" in their language. They can't believe a person could possibly have empathy for others. What they don't realize is that this says far more about they themselves than it does about anyone else.",
            "score": 37,
            "replies": [
                {
                    "author": "kingofcrob",
                    "body": "Holy fuck, of course Elon would say something like that. Curious what he thinks of schadenfreude, cause watching him fail does give me joy.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Admin--_--",
                            "body": "He means Toxic Empathy and he is not wrong, empathy is a good thing but being naive and being overly empathetic where its unwarranted is problematic and then we become the \"suckers\".",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "yiang29",
                            "body": "Quote is wildly taken out of context,  “but you need to have empathy for, for civilization as a whole, and not commit to a civilizational suicide.” Elon musk",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "MeThinksYes",
                                    "body": "Can you elaborate on what you think Elon means, and how that comports to what he is actively doing now?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "yiang29",
                                            "body": "It’s either you care about the context or you don’t. Just watch the episode.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "MeThinksYes",
                                                    "body": "Illuminating",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "yiang29",
                                                            "body": "You don’t care what I think. Your mind is made up, why pretend otherwise? Kinda pathetic. I’m pointing out that quote was taken out of context and that if you care you should watch the episode",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "MeThinksYes",
                                                                    "body": " I’ve watched it. can you elaborate  now? I’m curious",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "yiang29",
                                                                            "body": "You didn’t watch a 3h podcast in 23 minutes. If you did share your thoughts about the quote I shared and we can go from there. Again, your mind is already made up, why pretend otherwise?",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "MeThinksYes",
                                                                                    "body": "sorry whereabouts did i mention when it was watched?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "yiang29",
                                                                                            "body": "“If you did share your thoughts about the quote I shared” let’s be real, you didn’t but we can pretend you did",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "TheSilmarils",
                                                                                                    "body": "Are you ever going to actually engage or just deflect?",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "yiang29",
                                                                                                            "body": "I did, I shared a quote from the same episode in response. You guys really don’t like it for some reason. Feel free write anything you want bud",
                                                                                                            "score": 0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "TheSilmarils",
                                                                                                                    "body": "You didn’t. You shared the rest of the quote and keep yelling context without addressing why the other commenter is mistaken and using the context to demonstrate it. You just keep stomping your feet like a toddlers and yelling “BUT THE CONTEXT!” and repeating the same quote.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "yiang29",
                                                                                                                            "body": "I’m not “yelling” or “stomping my feet” I shared a  quote that a contradiction of the first one, and pointing out Elon doesn’t think empathy in general is a weakness if you watch the episode. You’re just butthurt about anything that doesn’t show the guy as inhuman. You don’t have to sit there pissing and shitting on the ground while rolling around in it like a “toddler” about it. You don’t have to be angry, relax lil bro. We’re just talking here. Tesla man bad we get it",
                                                                                                                            "score": 0,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "TheSilmarils",
                                                                                                                                    "body": "You’re not talking. You still haven’t addressed his point. You just post an additional quote and say “na uh!”  Now is where you demonstrate what Elon actually meant and why the context disproves his original point. You know, like an actual discussion.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "yiang29",
                                                                                                                                            "body": "Ok listen man, you don’t need to do a handstand up against the wall and spray diarrhoea upwards while you yell, calm down. I responded to a simple quote with another one thats contradictory, while I watched the episode it was clear to me he doesn’t think “empathy” in general is a weakness to civilization. He was talking about the government funding certain programs with little to no insight. Whether that true or not is a different subject but he didn’t just say “empathy is a weakness” and change subject immediately after, it was a little more nuanced. Why ask my OPINON when you can just watch the episode? What have you shared hypocrite? O ya nothing, you’re just going full ad hominem because I shared a quote that doesn’t make him seem inhuman.",
                                                                                                                                            "score": 0,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "TheSilmarils",
                                                                                                                                                    "body": "I’m not yelling. I’m paraphrasing your comments and rhetoric when you were deflecting answering his question. See what you did here? It’s actually addressing the original commenter’s response with a half decent argument about how the context changes what was actually said. That’s called having a discussion. You weren’t doing that earlier.",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "author": "yiang29",
                                                                                                                                                            "body": "What rhetoric? I shared a contradictory quote to a single quote saying if you watch the full episode you’ll see it’s out of context. All you’re doing is bitching and adding nothing. Share you’re thoughts hypocrite, share anything.",
                                                                                                                                                            "score": 0,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "author": "TheSilmarils",
                                                                                                                                                                    "body": "I did share my thoughts. You weren’t actually addressing anything. You just posted a quote and threw your hands up and didn’t expand. You finally actually said something once I dragged it out of you but you weren’t doing that with the original commenter. You thought another quote without expanding on why that showed OP was wrong was some kind of checkmate and it’s not.",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "author": "yiang29",
                                                                                                                                                                            "body": "You didn’t share your thoughts on the quote or episode. Why would you say that?",
                                                                                                                                                                            "score": 0,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "author": "TheSilmarils",
                                                                                                                                                                                    "body": "My thoughts weren’t about the episode. It was about your refusal to actually address a point until it was dragged out of you",
                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                    "replies": [
                                                                                                                                                                                        {
                                                                                                                                                                                            "author": "yiang29",
                                                                                                                                                                                            "body": "I did address the point. You’re just angry for some reason. You’re adding nothing to the conversation and clearly frustrated with my quote but not theirs. Why is that? Why is the original quote considered whole and not needing of elaboration like mine? Why are you so angry? It was pretty clear from the first comment nothings changed. You’re adding “yelling” and “checkmate” for some reason. Why are you being so combative? Why aren’t you sharing your thoughts?(on the topic) you don’t have to be scared. OP didn’t respond by the way, just you guys who aren’t adding anything",
                                                                                                                                                                                            "score": 0,
                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                {
                                                                                                                                                                                                    "author": "TheSilmarils",
                                                                                                                                                                                                    "body": "You didn’t address it until I had to drag it out of you. You just kept reposting the same quote and not adding why it changes what Musk meant. That’s my point but it seems to be lost on you",
                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                        {
                                                                                                                                                                                                            "author": "yiang29",
                                                                                                                                                                                                            "body": "No, I shared a quote that was contradictory to the original and shared if you watch that part of the podcast you’d see it’s taken out of context. I don’t know what that so hard for people to grasp. You’ve added nothing other than sharing your frustration and hurt feelings over it. Lost on me?",
                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                {
                                                                                                                                                                                                                    "author": "Selfket",
                                                                                                                                                                                                                    "body": "It’s the fact that you just dropped a quote on us and never bothered to provide what **you**, u/yiang29 , **think Elon Musk is saying in that moment.**\n\nYou can’t just post some quote and expect that to be your master trump card that absolves you of any further discussion.",
                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                    "replies": []
                                                                                                                                                                                                                }
                                                                                                                                                                                                            ]
                                                                                                                                                                                                        }
                                                                                                                                                                                                    ]
                                                                                                                                                                                                }
                                                                                                                                                                                            ]
                                                                                                                                                                                        }
                                                                                                                                                                                    ]
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "-UnicornFart",
                    "body": "One of the main prosecutors at Nuremberg said the exact opposite. That none of the atrocities of ww2 and the Holocaust would have occurred if not for a complete lack of empathy.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "CardinalsRising91",
                            "body": "Empathy is seen as a strength by the benevolent and weakness by the cruel. Unfortunately, the manipulative pathologists use all sorts of appeals to emotion to prey on our empathy.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "hughmanBing",
                            "body": "I mean it should be obvious. The very purpose of having a society and therefore the governance of a society should be to make life better for the inhabitants. If it doesn't work for everybody then it's not working.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "HowardIsMyOprah",
                    "body": "A lot of empathy is for the purpose of making the empathizer feel better about themselves. Basically, slacktivism. They care about other people’s problems in a “someone should do something about that” kind of way, not in a “I’m going to do something about that” kind of way. What that turns into is a lot of paternalistic people wanting someone else to solve things they perceive as injustice or suffering without themselves having to lift a finger, while ignoring the damage that it does. They oftentimes assign the alleviation of that suffering to a government agency, or non profit with government funding, and can feel good about doing something even though they’ve accomplished nothing. \n\nAs an example, people who empathize with the homeless and want the government to solve homelessness, but never show up at soup kitchens and the like to actually help these people. It leads to things like the homeless industrial complex. \n\nTo me, this isn’t actually empathy, it’s ego, but society labels it as empathy because there is technically someone at the end of their caring rainbow, even though that same “empathic” person would call the cops on that same homeless person if for setting up a tent in their local park.\n\nI’m all for empathy, but not for fake empathy. By observing people’s behaviors rather than their actions, I notice a lot more of the fake kind than the genuine kind.",
                    "score": -5,
                    "replies": [
                        {
                            "author": "hughmanBing",
                            "body": "A lot of times the problems are systemic and the solution to the problem is through governance, laws, awareness. It's weird and disingenuous actually to pretend you know another person's motivations and just assume they are advocating for something for brownie points.\n\nIt's just common courtesy to take people at their word. Even or especially in debate you need to grant your opponent that in order to have an honest, good faith discussion.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "ANewKrish",
                            "body": "This is a convenient way to dismiss empathy-based positions, but it falls apart if you think about it for more than a few seconds.\n\n>As an example, people who empathize with the homeless and want the government to solve homelessness, but never show up at soup kitchens and the like to actually help these people. It leads to things like the homeless industrial complex.\n\nIf someone is a teacher and they have to work on lesson plans and grading over the weekend, does that disqualify them from being able to ask for and vote for more services for homeless people? What if that same teacher *does* have time to volunteer at a shelter on weekends- do they lose the ability to advocate for environmental causes?\n\nNo single person is capable of acting on everything they care about- that's a pretty fundamental feature of society.\n\n>They oftentimes assign the alleviation of that suffering to a government agency, or non profit with government funding, and can feel good about doing something even though they’ve accomplished nothing\n\nWe do this for everything. Roads, food safety regulations, medical research, and so on. Weird to single out social supports. Efficiency and efficacy are a challenge, but even so, the \"accomplished nothing\" part is overly reductive. Shelter programs focus on the fundamental issue of preventing people dying from exposure on the streets. That's important work, even though it \"doesn't get us anywhere\". Other nonprofits work on pushing for housing reform, that alone \"doesn't solve the problem\" but it's a crucial piece of it. Other nonprofits provide free legal representation for homeless people. Others work with local governments to prevent eviction whenever possible, preventing homelessness upstream.\n\nIt's so damn easy to say nothing works and nothing's worth doing. We live in complex systems with complex issues that require complex solutions.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "gaytorboy",
                                    "body": "The person in your hypothetical is not a slacktivist.\n\nI have known people personally who always grandstand about the oppressed but interpersonally they’re selfish, rude, unhelpful. All they say is the government and rich people should fix it. \n\nI don’t think anyone’s saying “nobody has empathy”, just that fake empathy is often used to smuggle in selfishness. It’s a thing.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "hughmanBing",
                                            "body": "These people seem to blankety assume that all empathy / compassion is fake and therefore irrelevant. Assumed with zero examination. Woke is used as a pejorative. And everything that deals with empathy or compassion is considered woke by many, many people.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "ANewKrish",
                                            "body": ">All they say is the government and rich people should fix it.\n\nThey're asking for the people with the means to create systemic change to do so. I'm sure someone looks like a lazy asshole if they never give money to the homeless or volunteer at a shelter, but the reality is that they could do those things day in and day out for their entire lives and do *nothing* of importance to address the systemic issue of homelessness.\n\nHell, they could open and run a shelter for the rest of their life and they would still only be treating the symptoms and not the root causes. At some point, the only way to push for change is to be loud and to put pressure on the legal and political system.\n\nDemanding that your government address the issue (and more importantly, voting for politicians who support your views) IS civic engagement. Asking them to lean on the rich to do so IS civic engagement. That's how things work in our form of representative democracy - people prioritize certain issues, then provide support (generally through taxes) to people who live that work day in and day out. It doesn't really matter if they're an asshole, individually.\n\nAll of this falls out the window if you don't vote, but in that scenario you're not a serious person regardless of views or opinions.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "gaytorboy",
                                                    "body": "You don’t know the individuals I’m talking about. Literally every single thing about interacting with them interpersonally quickly showed they only cared about themselves, and it wasn’t just me who saw it. Unhelpful, selfish, and burdensome. I can give you some stories if you want.\n\nI’m not saying everyone on the left is like this. My best friends wife is very progressive and she’s an angel.\n\nBut the tone, the way that she expresses her political views is just different.\n\nThe mask has kind of come off lately that creating a facade of left wing beliefs is something some people use hide their selfishness behind fake virtue.\n\nIt’s a thing.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "MeThinksYes",
                                                            "body": "This seems like you draw widespread conclusions based on your anecdotal happenings within your immediate social circle. Surely you can zoom out a bit here gaytor",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "ANewKrish",
                                                            "body": "I'd take an example if you have one. There are selfish assholes everywhere on the political spectrum, are the ones you're talking about holding it over you or something?",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "robbodee",
                            "body": "This is never a popular take, especially amongst self-described empaths, but it's the truth. Paul Bloom wrote a fantastic book about the subject that I highly recommend- \"Against Empathy: The Case for Rational Compassion.\" \n\nEmpathy is, first and foremost, an emotional process. It isn't rational or actionable, in and of itself. It CAN be turned into compassionate action, but it can just as easily be masturbatory egoism with zero positive side-effects.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "PromiscuousMNcpl",
                            "body": "What deity are you, to gatekeep empathy and decide what is real and what is performative?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "yiang29",
                    "body": " “but you need to have empathy for, for civilization as a whole, and not commit to a civilizational suicide.” - Elon musk. \n\nYou clearly didn’t watch the episode and are taking one quote way out of context. Bravo! A true redditor!",
                    "score": -2,
                    "replies": [
                        {
                            "author": "hughmanBing",
                            "body": "I actually did watch the whole segment. He still said what he said. Tacking on that you need to have empathy for civilization as a whole doesn't discount that. It's also not true. You can have empathy wherever you happen to feel it and it still matters.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "yiang29",
                                    "body": "I highly doubt that. Context matters(not to people like you) he literally spoke about how a civilization needs empathy to function immediately after.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "hughmanBing",
                                            "body": "He said what he said. It doesn't help that he has an utter lack of empathy on full display. He considers his trans daughter to be dead, he's working to throw many people's lives away destroying their jobs, their administration is working to greatly diminish social security labeling it a ponzi scheme, wearing his child as what appears to be as a human shield and ignoring the child's mother's requests to not bring him out in public, many people's grandparents and regular people who rely on social security will lose it due to their recklessness. \n\nBut yeah tell me more about how Musk wants empathy for the whole civilization.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "STFU_Fridays",
                                                    "body": "People lose jobs everyday, did you only care when Elon made the call? The government is bloated with your tax money and mine, it needs to be trimmed back. If we find that vital services are affected, they can always be hired back. \n\nSocial security is the definition of a Ponzi scheme. \n\nThe rest of what you said is regurgitated bullshit from MSNBC and CNN. Calm down.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "chirpchir",
            "body": "1. Take reality at face value \n2. Choose to believe other people are real\n3. Choose to believe suffering is bad\n4. Agree unnecessary suffering should be reduced over time\n5. Agree human freedom should be increased over time.",
            "score": 75,
            "replies": [
                {
                    "author": "Fluffy-Structure-368",
                    "body": "You're #1 is some of the worst advice I've ever heard.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "chirpchir",
                            "body": "You’re the one, Neo! Good luck",
                            "score": 14,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Definitelymostlikely",
                    "body": "1. You can’t.  Especially regarding sciences and even more so for more complex sciences. What’s intuitive isn’t necessarily what’s real. \n\n2. I’m fairly certain a third of you on this site are not real people. \n\n3. Suffering is bad. But what constitutes suffering is subjective. \n\n4. Yeah. \n\n5. Freedom increased to a certain point. Being free to off anyone you want isn’t greater freedom for a society",
                    "score": -40,
                    "replies": [
                        {
                            "author": "MrPisster",
                            "body": "1. I don’t think that’s what he means. Smoke less weed.\n\n2. Also not what he means, but go off queen.\n\n3. We aren’t talking about getting the wrong order at Taco Bell. We all know what suffering means.\n\n4. Okay.\n\n5. Freedom to kill someone infringes on that victims freedom to be alive. But that’s obvious. Right?",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "Definitelymostlikely",
                                    "body": "Fart",
                                    "score": -7,
                                    "replies": [
                                        {
                                            "author": "Selfket",
                                            "body": "“I am intellectually dishonest and should never be taken seriously” \n\n..Incase anybody wants a translation",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Definitelymostlikely",
                                                    "body": "Thank you. \nI wasn’t reading all that ",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Selfket",
                                                            "body": "Ignorance is bliss mate",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Thereferencenumber",
                            "body": "You’re right, I’ll just listen to Infowars",
                            "score": 14,
                            "replies": []
                        },
                        {
                            "author": "chirpchir",
                            "body": "You can. It’s a just a choice. Sure, we could all be in a matrix or truman show situation and there’s no way to ever disprove it. I just don’t choose to live that way. I think most people would agree with living by the assumptions that other people are real and we inhabit a shared reality. And given those agreements, I think there are many elements of suffering than can be reasonably assumed to be universal. Start there.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Definitelymostlikely",
                                    "body": "Oh you meant like in real life? \n\nThought you meant people on the internet. ",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "author": "chirpchir",
                                            "body": "Yeah, I don’t dispute that there are a lot of bots online. I just think moral consensus is more than “ virtue signaling” and it not wholly dependent on empathy either. You can believe other people are real and suffering is bad just as an intellectual/moral value. You don’t have spend all day crying about the suffering of others to decide it’s bad.",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "MaesterPraetor",
                            "body": "You have to put an /s of this is sarcastic. I really can't tell. ",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Hot-Sandwich7060",
                                    "body": "I think you replied to the wrong comment, G.",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "boxxxeater",
                            "body": "This is so fucking cringe.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "DR3AMSTAT3",
                            "body": "1. You can, if you do so in the context of science\n\n2. This site isn't real life\n\n3. Objective judgements can be made en masse about things that are ultimately subjective individually\n\n4. Yeah\n\n5. The concept of \"freedom\" should be restricted to your own body and destiny, not others'",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "RichardSqueezar",
                            "body": "Suffering is not subjective lmao",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Vegetable-Oil6834",
            "body": "I am not surprised that sociopaths and grifters with 0 empathy are seeing any instance of someone caring for someone else, without the obvious gain, as virtue signaling. \n I think they lie all the time but I do believe they do think this is virtue dsignaling, as they are unable to comprehend empathy.\n\n\n\n\nSame with thieves and corrupt people saying 'everyone is corrupt, they just need opportunity', they legit cannot comprehend someone being honest, they are projecting",
            "score": 57,
            "replies": [
                {
                    "author": "Dull_Guess_4217",
                    "body": "Hell yeah borther.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "gorgias1",
                    "body": "I think you are on the nose.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Intelligent-Wear2824",
                    "body": "So much this!!! 💯",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "CrawlerSiegfriend",
                    "body": "There is definitely an empathy deficit in our current society. The only way to get a MAGA to feel anything at all about all the people being fired is for it to be someone they are personally are friends or family with.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "KeyFig106",
                    "body": "All people who claim to care have to do to fix all the problems they claim to care about is pay for them...with their money.  \n\n\nThe way the rest of us know they don't care is they haven't fixed the problems they claim to care about yet. ",
                    "score": -9,
                    "replies": [
                        {
                            "author": "Lancasterbation",
                            "body": "This is such a dumb take. I care about Gaza, and the homeless, and yadda yadda yadda. I've got $4k to my name, after which I'd be homeless. Which one of those issues would be solved with my $4k?\n\nEdit: this is why we advocate for societal level changes to the structures that caused these problems. Hell, we're all paying into a system that is, in part, using our money to exacerbate these problems (both through taxes and paying for goods and services from private enterprise).",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "KeyFig106",
                                    "body": "So you justify stealing from others to pay for your charities because you are poor.  And your 73 million buddies also are using your excuse to steal from others to pay for their charities as well?\n\n\nIf you only have 4k and then will be homeless then you are the 50% who don't pay net federal taxes.  \n\n\nYou pay money for goods and services because you and your buddies aren't providing those goods and services for free...because you care. ",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "author": "Softboiledboi",
                                            "body": "You are failing to see the income disparity in this country and how much the gap is quickly closing. You’re arguing for a system that works in a utopia where all people actually care about each other. Spoiler.. we don’t! Income equality is never gonna happen unless the govt intervenes. There absolutely needs to be a system in place so that the OVERWHELMING MAJORITY of Americans are not struggling while the top 1 percent create a monopoly (which they are doing). Seeing as how we’re both here arguing on Reddit I doubt you’re in the top 1% (especially given how dumb some of your takes are but that’s besides the point). If you can’t see the fucks in power do not have your best interest in mind, you’re delusional and should not be siding with them",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "KeyFig106",
                                                    "body": "Income disparity is irrelevant. If you want people to have more money give it to them.  Your money. \n\n\nOf course they don't have my best interest in mind.  Neither do you.  I have my best interest in mind and stopping your theft from me is in my best interest. ",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Lancasterbation",
                                            "body": "Lol, I didn't realize I was talking to a 'taxation is theft' guy. Well, it's not. It's how you organize to pay for improvements to things that don't turn a profit (and thus cannot or will not be addressed by private enterprise). \n\nI have $4k in the bank. You're not taxed on net worth, you're taxed on income, expenditure, and property holdings. I don't receive government benefits, nor do I qualify for a tax return, so no I'm not one of the people who don't pay net federal taxes. Most of my income goes to pay for the cost of living and those taxes.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "KeyFig106",
                                                    "body": "Half paying to provide goods and services to the other half who pay no net federal taxes is theft. Duh.  \n\n\nFor taxes to not be theft everyone would pay the same amount for the same services or an amount in proportion to the services individually provided.  Like a head tax or a usage tax.  \n\n\nSo you steal from others to pay for your charities because you live far beyond your means. Why don't you care about the people living in misery?",
                                                    "score": -4,
                                                    "replies": [
                                                        {
                                                            "author": "Lancasterbation",
                                                            "body": "I do care about people living in misery, and I think (defensibly) that the private market causes said misery. Thus, at least some portion of the gains realized by the people who come out on top are illegitimate. So, they should shoulder a higher percentage of the tax burden to compensate for that. Consider that most people on government benefits do work full-time. So, that'd mean the government is being forced to subsidize the employers' unwillingness to adequately pay their employees. Similarly, for those that don't/can't work, many are being actively gatekept from achieving financial success to the degree that they could get off government assistance (you have to have an address and reliable transportation to get most jobs, for instance). \n\nTL;DR it's not theft, it's restitution.",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "mrcold",
                                                                    "body": "Weird, I think it's the government that causes said misery.",
                                                                    "score": -2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Lancasterbation",
                                                                            "body": "How does the government cause poverty?",
                                                                            "score": 3,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "KeyFig106",
                                                                    "body": "Obviously you and your buddies don't care since they are still in misery. \n\n\nYes, we know you want free stuff so you steal it from people who are better at making money than you are. \n\n\nThe government is not forced to give people free stuff.  The moochers force the taxpayers to give them free stuff by using the government to steal it for them. \n\n\nAll anyone needs to be sucessful is for you and your buddies to give them everything they need to be successful...with your money. \n\n\nOf course it is theft and you do it because of your greed and jealousy.  ",
                                                                    "score": -2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Lancasterbation",
                                                                            "body": "I'm very much not a jealous person. I'm quite content to live within my modest but manageable means. You don't have to be jealous to recognize we live in a society that does not provide a level playing field for participants. \n\nYou talk as if the free market would naturally take care of suffering if it weren't for the meddlesome government, but those are two sides of the same coin. The government keeps private enterprise in check and supplements where it falls short. It's not theft for the government to levy taxes. Private enterprise is often only motivated by profit, this leads to a cruel society that provides increasingly worse products for more money over time, leading to huge wealth disparities. I don't propose that the government eliminates that disparity just that they fill the gaps left by that disparity. An impoverished populace doesn't make for very good consumers. The government's taxes are essentially shoring up the consumer base to keep big business afloat. And yeah, they're doing it with the tax revenue from the folks who have profited the most from said businesses. Could the government be better stewards of our tax money? Of course, but business could also be better stewards of the money we pay them, but the apparatus that attempts to solve for that is the government.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "KeyFig106",
                                                                                    "body": "\"Restitution\"  Of course you are jealous. \n\n\nDuh.  \n\n\nOf course the free market won't take care of anyone.  You will.  Because you care. Why don't you care?\n\n\nYou are the thief. Government is your tool. Duh.  \n\n\nBusinesses do what is best for them. Just like you and your moochers.  Businesses have to do it through voluntary economic exchange. You get the government to steal for you and return nothing but more moochers. ",
                                                                                    "score": 0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Lancasterbation",
                                                                                            "body": "I dunno why you keep insisting I'm a moocher when I've made it clear I'm not. Is it impossible for you to conceive that someone may want justice for other people? In order to be a thief, I'd have to be stealing something, I'm not, nor do I want to. I don't really want or need to benefit more from government spending than I already do, but I do think the people with excess income are the direct cause of poverty, and so I think they should pay the costs of their actions. That's all.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "KeyFig106",
                                                                                                    "body": "You make me pay for your charities. Duh. Making me pay for other people's stuff is theft. Duh.  \n\n\nIf you want to pay for other people, do it.  With your money. \n\n\nYour irrational beliefs are irrelevant. If they have committed a crime or damages then take them to court. ",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "badrepos",
            "body": "That’s gotta be edited. I’ve met Alex and he was a good 3-4 inches shorter than me and I’m between 6’0 and 6’1. Joe is close to a foot shorter than Alex here lol",
            "score": 11,
            "replies": [
                {
                    "author": "Dull_Guess_4217",
                    "body": "Maybe everything else has been edited and Ro Bro really is Fo foot fo...",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "fnording",
                    "body": "Joe Rogan uses a fisheye lens to look larger in the podcast. He’s tiny.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "__SlimeQ__",
                            "body": "he's actually sitting at a tiny prop desk and the videos are edited so you can't tell",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "Timely_Mess_1396",
                                    "body": "He uses the same camera tricks that Peter Jackson used to make Gandalf look so much bigger than the hobbits.",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "DoingBurnouts",
                                    "body": "My new head canon for the show",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "NotTheHeroWeNeed",
                            "body": "Fisheye lens would have the opposite effect ",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "lazerzapvectorwhip",
                                    "body": "Not if you put him right in front of the lens\n\nhttps://preview.redd.it/0elr3yvcrgpe1.jpeg?width=3024&format=pjpg&auto=webp&s=6bad0dbe6f38b3fca509a0340266d26a410cf1b2\n\nMy hands are actually tiny",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "MeThinksYes",
                                            "body": "lol this thread",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "IT_Grunt",
                    "body": "No way Rogan is 5’8”. Or Alex is 6’4”+?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Bud_Roller",
                            "body": "Alex is 5'10\"",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "harlsey",
            "body": "This isn’t a real photo right?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Gognitti",
            "body": "Love these two guys",
            "score": 2,
            "replies": []
        },
        {
            "author": "Normal-Ordinary-4744",
            "body": "Alex Jones and Eddie bravo still one of the best eps till date",
            "score": 6,
            "replies": []
        },
        {
            "author": "czar1027",
            "body": "Joe Rogan and Alex Jones are frauds",
            "score": 4,
            "replies": []
        },
        {
            "author": "Welby1220",
            "body": "I thought that was The Mountain in for an interview",
            "score": 2,
            "replies": []
        },
        {
            "author": "Dizsmo",
            "body": "Joe's actually top right the guy on his left is his stunt double",
            "score": 1,
            "replies": []
        },
        {
            "author": "HarwellDekatron",
            "body": "This is a necessary narrative to promote if you are one of the ultra rich. If you allow people to think that there are people out there doing things that aren't _directly linked to their personal interest_ then suddenly it becomes clear that you - a guy who doesn't give two shits about killing people through disinformation to make a buck - are the real enemy.\n\nAnd that's why the whole MAGA leadership loves claiming that there's no such thing as empathy or love, other than \"love of family\". They want you as selfish and isolated as they can make you.",
            "score": 1,
            "replies": [
                {
                    "author": "DrMeatpie",
                    "body": "Killing people through disinformation? Lol like what!?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "HarwellDekatron",
                            "body": "Like promoting Ivermectin as a cure for COVID. Or telling people that 'COVID is just a little flu' when people are dying because of it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Dry-Main-684",
            "body": "Welp - can always listen to something else, no?",
            "score": 1,
            "replies": []
        },
        {
            "author": "anonymous7440987",
            "body": "Where is the rest of Joe?",
            "score": 1,
            "replies": []
        },
        {
            "author": "KptKreampie",
            "body": "Yaaa... but who's the bottom?",
            "score": 1,
            "replies": []
        },
        {
            "author": "aeiou-y",
            "body": "Joe looks tiny",
            "score": 1,
            "replies": []
        },
        {
            "author": "DrMeatpie",
            "body": "I kind of agree. We all have it. Some just make it their whole personality. Even if you disagree politically, most people have a pet they adore, they care for a sick parent, help a spouse with something they're struggling with, help their kid with homework, work two jobs to support them. \n\nYou don't get to make an insane extrapolation like, \"if you don't agree with XYZ, you have NO empathy\". That is childish and frankly lazy reasoning.\n\nEveryone virtue signals. Some more than others. We've all seen Instagram bios that are 7 lines long that have pronouns or rainbows or diseases or a cross or an idiotic \"acab\" or \"maga\". None of those people you care so much about will be at your funeral.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Heathen_Inc",
            "body": "Alex got that hungry look in his eye",
            "score": 1,
            "replies": []
        },
        {
            "author": "BodaciousB1921",
            "body": "Where is he constantly running into to these SJW’s on his feed? I guess Elon is projecting extreme woke accounts directly into his brain at this point.",
            "score": 1,
            "replies": []
        },
        {
            "author": "zachary_mp3",
            "body": "\"Nobody has as much empathy as me. Im more informed than every leader or pundit on the planet. Everyone is a Nazi.\"\n\nYou're right it's silly as fuck.",
            "score": 1,
            "replies": [
                {
                    "author": "TheOtherSideRise",
                    "body": "expect literally no one is saying that. classic straw man.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "woodsy117",
            "body": "Surely Joe’s not that short?",
            "score": 1,
            "replies": [
                {
                    "author": "Dull_Guess_4217",
                    "body": "He's probably not but he's still a jag off",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "A_the_commando",
            "body": "Ok?",
            "score": 1,
            "replies": []
        },
        {
            "author": "stepcorrect",
            "body": "Isn’t ALL human communication technically ‘virtue signaling’ to some degree or another?",
            "score": 1,
            "replies": [
                {
                    "author": "sozcaps",
                    "body": "Either way, fondling cigars and talking about guns and manliness, certainly  is virtue signalling.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "DrMeatpie",
                            "body": "Everyone virtue signals to some extent but nothing you listed consists of virtue signalling at all. Virtue signalling is like, casually sliding in the fact that you're an \"anti-capitalist\" in conversation. Which you probably typed from your cellphone, a literal product of capitalism",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "sozcaps",
                                    "body": "\"How can you critique society when you live in a society.\" Wow, great checkmate there.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Low-Win-6699",
            "body": "But he's right.\nHe's a narcissist so he has no empathy, he virtue signals and everything is transacional for him.\nHis friends are the same so this is the world he lives in.\nUnfortunately he thinks that's how the whole world is but the world is bigger than that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheOtherSideRise",
            "body": "This is the fallacy of attacking someone's character instead of their opinion. It's not even a good subtle fallacy. It's one of the stupidest fallacies.  It amounts to putting your fingers in your ears and yelling \"I CAN'T HEAR YOU!\" This means accusing someone of something that they can't disprove so there is nothing to debate. It's an all purpose argument killer for idiots who can't actually debate.",
            "score": -3,
            "replies": [
                {
                    "author": "everythingbagelss_",
                    "body": "I haven’t had my coffee yet either",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "MuadD1b",
                    "body": "It’s page and verse Russian nihilist propaganda. Nothing is real, everything is a scam etc",
                    "score": 3,
                    "replies": [
                        {
                            "author": "atring6886",
                            "body": "Calm down",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "atring6886",
                    "body": "Not everything needs to be a buzzword-filled online debate, my dude. Are you still in High School? You sound like you just learned what a fallacy was yesterday and have to shoehorn it into every froggan convo….",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Enlowski",
                    "body": "Dude you need to find better things to focus your attention on. You sound like an angry and unhappy person. Leave this sub and focus on things you enjoy rather than hate.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "thachumguzzla",
            "body": "This edited image is a perfect example of what’s wrong with the discourse online, not the joke that Joe is tiny, that’s funny and all. The problem is half the people who see this take it at face value because they don’t like joes politics. Perfect analog to idiots who just read a clickbait headline and assume it means whatever they want it to, based solely on feels and their own preset bias.",
            "score": 0,
            "replies": [
                {
                    "author": "Karlito1618",
                    "body": "Joe is shorter than me, and that's all I need to know",
                    "score": 2,
                    "replies": [
                        {
                            "author": "thachumguzzla",
                            "body": "Yeah but Joe will rip your dick clean off with his chimp hands don’t get too cocky",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Munky_1",
            "body": "It’s fucking MIMI-ME hahaha",
            "score": 0,
            "replies": []
        },
        {
            "author": "FarStarboard",
            "body": "Well it's real so...",
            "score": 0,
            "replies": []
        },
        {
            "author": "Alexandertheape",
            "body": "![gif](giphy|StExRwBu6p1ok)",
            "score": 0,
            "replies": []
        },
        {
            "author": "widoidricsas",
            "body": "https://preview.redd.it/fmdooenfngpe1.jpeg?width=1080&format=pjpg&auto=webp&s=b92ab1d6885426c358ef198961f8c4138af5a8aa\n\n\"What a world, what a world!\"",
            "score": -1,
            "replies": []
        },
        {
            "author": "Appropriate_View8753",
            "body": "I guess you have to listen to the podcast for the context and this to make sense??",
            "score": 0,
            "replies": [
                {
                    "author": "hughmanBing",
                    "body": "What about when Elon said \" “The fundamental weakness of Western civilization is empathy.”\" \n\nWhat was the context?",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "OyenArdv",
            "body": "I’m 5’3 and Joe looks my height in this photo",
            "score": 0,
            "replies": []
        }
    ]
}