{
    "title": "Stranded astronauts return back via SpaceX",
    "author": "bubblewhip",
    "subreddit": "JoeRogan",
    "rank": 3,
    "score": 276,
    "upvote_ratio": 0.89,
    "num_comments (reported by reddit)": 170,
    "url": "https://v.redd.it/zt14ncnluipe1",
    "id": "1jehehw",
    "selftext": "",
    "comments": [
        {
            "author": "AKAGreyArea",
            "body": "That was very graceful.",
            "score": 1,
            "replies": []
        },
        {
            "author": "pickle99",
            "body": "We are not allowed to say anything positive about Elon.",
            "score": 1,
            "replies": [
                {
                    "author": "colerickle",
                    "body": "I think this is an exception even the hard core anti Elons can concede. \nThey can go back to hating him tomorrow.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "reddit_has_fallenoff",
                            "body": "How should i feel if I like Elon, but dont like Astronauts?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "colerickle",
                                    "body": "You’re an anti-Astronite ?  I’d keep that to yourself, you may get deplatformed.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ThatPatelGuy",
                                            "body": "What if I'm an anti-dentite?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Black_Sunshine5oh",
                                                    "body": "Next thing you know, you’ll be saying they should have their own schools!",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ThatPatelGuy",
                            "body": "LOL. They're literally removing it from a bunch of the big subs\n\nhttps://www.reddit.com/r/Damnthatsinteresting/comments/1jeh8de/crew_9_has_returned_home/\n\nEdit: looks like they posted it a few minutes later and [allowed it up](https://www.reddit.com/r/Damnthatsinteresting/comments/1jehexc/nasa_astronauts_splash_down_on_earth_in_the_gulf/)",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "BeatSteady",
                                    "body": "Nah it's not removed, that's a repost\n\nhttps://www.reddit.com/r/Damnthatsinteresting/s/aO3nAh2vlq",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ThatPatelGuy",
                                            "body": "The one I posted is older but glad you're right that it's up.\n\nMay have just been a mod power tripping and wanting that Karma for themselves",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "SilentOcelot4146",
                                    "body": "It's comical at this point\n\n![gif](giphy|S1SnLg08CxnUGqyqha)",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Normal-Ordinary-4744",
                                    "body": "Damn Reddit is so mad. It’s awesomen",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Diesel_Bash",
                                    "body": "This place is ridiculous.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "PickleRicksDad34",
                            "body": "I shall, I said this specific thing to my best friend today. I may hate him, but I can acknowledge the achievements of returning our astronauts home safely.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "OGBEES",
                            "body": "Rofl clearly you haven't looked at the other subs today. Somehow he's still bad for saving them 🤣🤣",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Fuckitimtrippy21",
                            "body": "Sorry, maybe I’m missing it? Elon didn’t save those astronauts..? The people who worked tirelessly with their extensive knowledge of space engineering and things I’m not even sure what to call it because I’m so under-qualified — those are the guys who saved these astronauts. Gotta give credit where credits due. Elon did it make this happen",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "DoubleT_inTheMorning",
                                    "body": "Exactly. I’m so fucking sick of people acting like Elon designed the rocket ships, tunnels, cars, satellites, software systems, etc. that are under the umbrella of his companies. He’s not a design engineer, in fact quite the opposite - he’s an engineers worst nightmare. All you gotta do is look at the cyber truck for an example lol, how many years were they behind on release vs what Elon promised? And his genius requirements of stainless steel body panels which is notoriously difficult to stamp form into shape because of the springback, resulting in horrendous variance in the panel gaps on every vehicle?\n\nHe’s the face of the company, he didn’t get these astronauts home safe himself. He’s busy running around with his son by his side gutting the government lol, he doesn’t have time to do this himself",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "JRC713",
                                            "body": "Oh you mad. 😡",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "ShiftBMDub",
                                    "body": "He didn’t even save anyone. It was all planned the mission the two were on was a literal test flight and they had trained to stay longer than originally anticipated and had research planned. It’s crazy to me, the people that hate participation trophies want us to suck Elons dick for doing his damn job.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Powerful_Room_1217",
                            "body": "It's not anti Elon it's more why should he get the credit for all of this when, in reality, it was the engineers and everyone else. What did Musk actually do ? Sign off on something anyone could of done that",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Normal-Ordinary-4744",
                                    "body": "When ship blows up “haha Elons fault, SpaceX got what it deserved!”\n\nWhen they have a successful rescue mission “booo, Elon deserves no credit”",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Heccubus79",
                                    "body": "Then why does 90% of Reddit masturbate furiously to burning Teslas? In reality it was the engineers and everyone else that built them, not Elon. It’s just blind  rage at everything they dislike.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "colerickle",
                                    "body": "But they didn’t and he did. \nI dunno man, it’s a cool story and it’s his company. A year ago he was a darling. He backs Trump and he’s enemy #1. if you can’t see the media manipulation your eyes aren’t open.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Selfket",
                                            "body": "Musk hate didn’t happen overnight, he’s just been repeatedly getting in more outlandish escapades as time goes on that make it glaringly obvious he is no darling superstar\n\nAlso would’ve helped if he didn’t make his Nazi salutes. I think normal people should just know that?",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "hfdjasbdsawidjds",
                                            "body": "He wasn't a darling a year ago, thats just revisionist history. He has had PR issues for a number of years now that have soured many people's opinion of him well before he supported Trump.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "zen_and_artof_chaos",
                                            "body": "It has very little to do with just simply \"backs Trump\". He is a foreigner who illegally abused the visa system when he came over here, is an unelected person illegally ransacking the government on the false narrative of fraud, and has minimized Hitlers role in genocide while throwing up very questionable sieg heils. His ridicule is warranted, and it's not just from \"backs trump\" or \"media manipulation\".",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "WhiteRoseRevolt",
                                    "body": "Musk used his daddy's money to invest in a company then take credit for what it does.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Normal-Ordinary-4744",
                                            "body": "That’s like saying Job’s gets no credit for Apple, or Gates for Microsoft 😂",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "WhiteRoseRevolt",
                                                    "body": "Pretty simple difference.\n\nJobs confounded apple. Gates founded Microsoft.\n\nElon used his daddy's money to invest.\n\nI'm surprised people don't know this. Elon can't code. He's just an investor and a hype man.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Normal-Ordinary-4744",
                                                            "body": "Elon is literally the founder and CEO on SpaceX, what’re you even talking about lmaoo 🤣 he didn’t buy en established company, he’s literally the sole founder \n\nhttps://www.reddit.com/r/SpaceXLounge/comments/k1e0ta/evidence_that_musk_is_the_chief_engineer_of_spacex/\n\n^literal quotes from established astronauts and engineers in the industry",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "jcozac",
                                                            "body": "Elon is the sole founder of SpaceX. He didn't buy it from anyone and he's still CEO and CTO of the company, both roles he's had since he started the company.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "JRC713",
                                            "body": "Jelly jelly you got a green belly!",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Royal-Possibility219",
                                            "body": "Exactly this. He’s a hype man for all his businesses",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "WhiteRoseRevolt",
                                                    "body": "Elizabeth Holmes in drag",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Efficient-Depth-6975",
                                            "body": "Musk did very well with daddy’s money. He’s very brilliant to accomplish what he’s done. It’s not dumb luck. He deserves credit for his success.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "WhiteRoseRevolt",
                                                    "body": "He invested in a company and hyped it up like the memestock it is. Now it's crashing. Because he started Seig Heiling and apologizing for Hitler.\n\nSorry. I don't give him any credit. Elon is a nazi. He's not brilliant. He's a gambler who got lucky.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "DLDabber",
                            "body": "They won’t. TDS has mutated to MDS.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "insidiousapricot",
                            "body": "No, a lot of them are saying the astronauts were not rescued.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "No-Winter-6554",
                            "body": "If it wasn't for him shoving his way in to become the hero it would be cool. They bitched, cried, moaned, and called foul when they didn't get their way with \"rescuing\" them. Also, Boeing can eat it. They've become nothing but lazy with this contract and I'm glad to see someone able to give them some competition.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "H-town20",
                    "body": "Fuck that guy. Let’s go paint some swastika’s on that dragon.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "JRC713",
                            "body": "Found the Na7i",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Mixitwitdarelish",
                    "body": "Did you say THANK YOU?\n\nDidja, ya fuckin hump!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ShiftBMDub",
                    "body": "The people that hate participation trophies want to suck elons dick for doing his job. Congrats!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "medicinalherbavore",
                    "body": "How about we say something positive about the actual engineers behind pulling this off?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Puzzled_Ad7334",
                    "body": "![gif](giphy|gXhBZfzijya76)",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "BoltUp69",
                    "body": "He’s destroyed thousands of people’s careers/lives. I mean, good for Space X here but Elon can still go fuck himself.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "sketchyuser",
                            "body": "He’s created thousands of peoples careers in much more productive world changing sectors than nonsense DEI programs at the EPA.. also paying them far higher wages",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "JRC713",
                            "body": "Haaaaaa",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Artistic_Pilot_621",
                    "body": "So you think Elon personally engineered this rescue or just told people he hired to do it? Are we not allowed to say anything positive about WORKERS??? It’s like yall love billionaires so much you refuse to see its the people at the end of the line responsible for the credit given to the people at the least responsible party. It’s very bizarre 😂",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Gex2-EnterTheGecko",
                    "body": "I'd rather say something positive about the people who were actually responsible for accomplishing this.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "dogmetal",
            "body": "They were forcefully deported from outer space by literal N-A-Z-I-S.",
            "score": 1,
            "replies": [
                {
                    "author": "JRC713",
                    "body": "🤣",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "GumbyBClay",
            "body": "Quick, someone swim out there and slap some swastikas on it and set it on fire! /s..... you all are so flip floppy.",
            "score": 1,
            "replies": [
                {
                    "author": "zen_and_artof_chaos",
                    "body": "No one has flip flopped. Musk is a shit person and SpaceX is a good company. It's not a hard concept.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Particular_Nervous",
            "body": "Some guy from Seattle was trying to torch the capsule but drowned.",
            "score": 1,
            "replies": [
                {
                    "author": "Normal-Ordinary-4744",
                    "body": "Haha sad little Redditor probably",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Pastorfuzz69",
            "body": "Thank you Elon. Happy they made it back safe",
            "score": 1,
            "replies": [
                {
                    "author": "DaikonCrazy7419",
                    "body": "Imagining thanking another man you don’t know on the internet",
                    "score": 1,
                    "replies": [
                        {
                            "author": "I_AM_MORE_BADASS",
                            "body": "Lol Especially one who had fuck all to do with this other than profiting off of it. \n\nThanks for hiring people smarter you and not getting in their way so they could bring these two home is closer to it.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "CraftyConstruction3",
                            "body": "Imagine mocking someone you don’t know on the internet",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "GumbyBClay",
                                    "body": "Well played!!!!",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Like_A_Somebody",
                                    "body": "Imagine mocking someone you don’t know on the internet mocking someone you don’t know on the internet",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "CraftyConstruction3",
                                            "body": "Imagine mocking someone you don’t know mocking someone they not know mocking someone they don’t know on the internet",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Whycertainly",
                                                    "body": "Imagine...all the people. 🎵",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "whammybarrrr",
                            "body": "Thank you",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Normal-Ordinary-4744",
                    "body": "Huge props to Elons company. They got em home safe!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ktaktb",
            "body": "Great work by the engineers of spacex. \n\n\nNot great work by propagandist elon musk who stopped contributing meaningfully to engineering anywhere years and years ago, and is solely responsible for the misinformation surrounding this i.e. Stranded astronauts.",
            "score": 1,
            "replies": [
                {
                    "author": "CraftyConstruction3",
                    "body": "Somehow I knew I’d find someone to blame the astronauts stuck in space to be elons fault 🤣",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ktaktb",
                            "body": "Lol... i didn't say he is responsible for stranding them. He's responsible for the false narrative that they are stranded\n\n......\n\n\n\n\nWhen are they gonna get a vaccine for brain rot?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Normal_Elevator_8398",
                    "body": "Look which side is the conspiracy theorists now.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "The_Boognish_Cometh",
                            "body": "Where’s the conspiracy?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Normal_Elevator_8398",
                                    "body": "Hmm how about this one, Biden didn’t want to rescue the astronauts when he could because it would be in perfect time for when the icky evil president, Trump, would get into office. \n\nMeow meow :3",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "The_Boognish_Cometh",
                                            "body": "That’s a conspiracy from the left?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "arto26",
                            "body": "How is this a conspiracy theory? You think he's so smart that he's playing Mr President, being a top tier Path of Exile player, *and* not only running spaceX, but contributing to the engineering department in a meaningful way? I may have a bridge to sell you.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ktaktb",
                            "body": "Huh?\n\n\nYour bot is broken, come get your bot elon",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Normal_Elevator_8398",
                                    "body": "Meow meow :3",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Normal-Ordinary-4744",
                    "body": "Huge props to Elons company, the crew and employees for bringing them home safety. SpaceX is an asset to humanity",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "JRC713",
                    "body": "🎶 Craaaazy! (Patsy Cline) 🎶",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Some-Honeydew9241",
                    "body": "It’s his company you dunce",
                    "score": 1,
                    "replies": [
                        {
                            "author": "DrizztDo",
                            "body": "Cuck",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "hfdjasbdsawidjds",
                            "body": "So are you cool with the CEO of the company you work for getting all of the credit for your work?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Gtoronto9",
            "body": "Thank you Elon 🫡 should of happened sooner",
            "score": 1,
            "replies": [
                {
                    "author": "MartinTheMorjin",
                    "body": "Do you think Tim Cook directed severance? lol",
                    "score": 1,
                    "replies": [
                        {
                            "author": "sketchyuser",
                            "body": "Tim Cook lead the company and is final decision maker in starting Apple TV+.\n\nSpacex wouldn’t exist without Elon.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Normal-Ordinary-4744",
                    "body": "Props to Elons company, the crew and employees!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Mr_Blonde0085",
                    "body": "Why are you thanking him? Try thanking the ACTUAL engineers at SpaceX who did the actual work load to make this happen. Not the fail son of an emerald mine owner who barely has a science degree and thinks Hitler did nothing wrong.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Gtoronto9",
                            "body": "Holy triggered 🤣",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "wakanda010",
                                    "body": "Holy sheep",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Fuckitimtrippy21",
                                    "body": "Dawg. Lol. Guy’s right, Elon did not save those astronauts. Give credit to the real heroes who made this happen.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Mr_Blonde0085",
                                    "body": "Dude you worship a billionaire who pays people to play video games for him to increase his stats. I’ll stay triggered rather than a Musk D*ck rider like you.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Gtoronto9",
                                            "body": "You have so much anger built up inside of you , wanna talk about it over some coffee ?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "JahDanko",
                                                    "body": "iS iT fReE tRaDe CoFfEe????\n\n![gif](giphy|3o6Ztftl5d0zTS0VfW)",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "2ndMostHumbleMan",
                                            "body": "*gives Elon a compliment *\n\nReddit: \"Dude stop WORSHIPPING the guy!\"",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "CrackersandChee",
                                                    "body": "“That was pretty cool” \n\n“THE MAN YOU PRAY TO IS A FRAUD!!”",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Enlowski",
                                            "body": "I love how triggered you guys get from the comment “thank you Elon”. Imagine living life being so offends by everything.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "boots_and_cats_and-",
                            "body": "Lmao whether you like it or not Elon is the majority shareholder of Space X \n\nLamenting that fact isn’t discrediting the engineers and technicians that made it happen.\n \n\nYou’re so dead seat on being anti-Elon that you have let it become part of your personality, which sucks by the way. \n\nIf you can’t have an objective conversation without brining up your feelings then you shouldn’t be commenting.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ShivHunchoxXchoppaXx",
                                    "body": "You're so dead \"seat\" on sucking off elon that you have let it become part of your personality, which sucks by the way.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "boots_and_cats_and-",
                                            "body": "I’m not sucking off Elon there are tons of reasons to hate him, this isn’t one of them lol and it’s inductive of the liberal hive mind complex. Everyone Orange Man or Elon does is bad, whether it’s actually bad or not lol. \n\nCongrats lol",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "boots_and_cats_and-",
                                            "body": "Huh? \n\nThe guy I replied to is mad that Elon got thanks for Space X rescuing the astronauts. \n\nElon owns Space X. \n\nI literally don’t understand a single word of your response. It made absolutely zero sense in this conversation.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "JRC713",
                            "body": "![gif](giphy|ZdrUuSEC0LygaFXtNT)",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "silentbob1301",
                            "body": "barely, he doesnt have ANY science degrees. He has a BA in some business fuckery...",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "JRC713",
                                    "body": "![gif](giphy|3sXxyP8q2RlJoGpMn8)",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "GhostBearStark_53",
            "body": "Damn that 'welcome home' slapped",
            "score": 1,
            "replies": []
        },
        {
            "author": "yeahpurn",
            "body": "Take that libs. Can't be a Nazi if this happened. Same thing with Bill Cosby. How can he be a rapist AND America's dad in the 80s? Simple: the Cosby show didn't exist! We all got Ashton Kutchered. They took our jobs!",
            "score": 1,
            "replies": [
                {
                    "author": "Normal-Ordinary-4744",
                    "body": "They’d rather the astronauts die in space than the dreaded SpaceX rescue them 😂",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "tsuness",
            "body": "Thanks NASA and SpaceX. I don't get why we are still calling the astronauts of crew 9 stranded though.",
            "score": 1,
            "replies": [
                {
                    "author": "boots_and_cats_and-",
                    "body": "If you get taken to a location far away with the understanding that you will be returning on the same vehicle you came in on and then suddenly the vehicle is deemed unfit for the task, what do you call that? Helpless? Without resources? Do you realize those are all synonyms for “stranded”? \n\nAdd in the political bullshit, are you really convinced this couldn’t have been done months ago?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "tsuness",
                            "body": "I would say sure, then it was decided the best course of action was to add them to crew 9, this why they were only sent up with 2 instead of 4 and they stopped being stranded as they were now a part of the ISS mission as a whole. Obviously Boeing is pretty bad at everything right now and should wholly be blamed for being unable to bring them home though.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "boots_and_cats_and-",
                                    "body": "So you think Elons statement that Biden declined Space X assistance while he was in office is a straight up lie?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "BeatSteady",
                                            "body": "Yeah I mean he's super pro Trump, and Trump is worse about negging Biden than reddit is about Elon",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "tsuness",
                                            "body": "I think that NASA thought about it but decided the risks weren't worth it and instead decided the safest option was to continue with their scheduled rotation and add them to crew 9.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "boots_and_cats_and-",
                                                    "body": "That’s an extremely logical and respectable view point.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Appropriate_Pop_5849",
                            "body": "Do you believe they wouldn’t have been able to return home without this specific Space X mission?\n  \nThe only political bullshit is coming from MAGA who are trying to use this as some sort of “Why won’t you say ‘Thank you, Trump’?!?” schtick.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "boots_and_cats_and-",
                                    "body": "Not anytime soon. \n\nWe all know Boeing has never put profits ahead of safety right? \n\nDid you just start following this story or are you aware that the Boeing shuttle that took them up was incapable of bringing them back safely? \n\nSeriously, before I waste my energy here, do you have any clue what you’re talking about?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Appropriate_Pop_5849",
                                            "body": "They were always going to return around this time. That was always the plan, back when Biden was president too. \n  \nYes. They were up there longer than expected. They were not abandoned. They were not “stranded”. In their own words. They were waiting for the next scheduled shuttle to be sent.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "boots_and_cats_and-",
                                                    "body": "I understand there was a backup plan. \n\nThe real travesty is that Boeing received yet another non-competitive government contract and shit the bed, multiple times. \n\nI understand they were never going to be abandoned. But I don’t think it’s unfair to say they were “stranded” considering the vehicle they brought them there ( and was supposed to take them back ) wasn’t meeting safety regulations.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "CrackersandChee",
                    "body": "I think it’s because they were stranded",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DropsyJolt",
            "body": "The political rhetoric around this is the funniest shit. Astronauts got an extended stay at the ISS... the horror.... Can you imagine such terror? Working hard for years to get to space and then you have to stay longer than planned? My God... Better cut more aid from the starving so no astronaut ever has to go through that again.",
            "score": 1,
            "replies": [
                {
                    "author": "Stayka",
                    "body": "im pretty sure they all incurred debilitating bones loss that they wont be able to recover from at their age but go ahead and cook fellow redditor",
                    "score": 1,
                    "replies": [
                        {
                            "author": "DropsyJolt",
                            "body": "Pretty sure based on what exactly?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Thereferencenumber",
                                    "body": "Major musculoskeletal degradation is the documented cost of living in space for any period of time",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "DropsyJolt",
                                            "body": "So it's based on vibes? To be clear your claim is that their extended stay is the difference maker between a debilitating life-long illness and being completely fine... and it is based on vibes... This just keeps getting funnier.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "denisvma",
                    "body": "Seems like you don't know what happens to your body and mind when you go to space. It's not the end of the world, but it shouldn't be taken lightly like you mentioned, it's not like they were on vacation. \n\nThe controversy was more agaisnt Boeing than anything...",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ultragenerate",
            "body": "Thank you to all the wonderful engineers and scientists at SpaceX 🫡",
            "score": 1,
            "replies": []
        },
        {
            "author": "Active-Worker-3845",
            "body": "Wait. Reddit says they weren't stranded. If so, then why the profuse thanks?",
            "score": 1,
            "replies": []
        },
        {
            "author": "cretter",
            "body": "Finally some footage of a space mission that looks realistic.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok-Car1006",
            "body": "Literal heroes who saved them !?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Colfrmb",
            "body": "I am so grateful to everyone involved. They should all be very proud from the people who watched over them in space for so long to Musk and the President.  It’s a proud day to be an American.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ScottNoWhat",
            "body": "Just happy they got back safely",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheMissionaryGOAT",
            "body": "isn’t it crazy that there are mentally ill democrats who were likely hoping this rescue mission failed so they could shit on elon\n\nthank goodness this was successful",
            "score": 1,
            "replies": []
        },
        {
            "author": "Porkwarrior2",
            "body": "Obviously to save democracy the capsule needed to be firebombed as soon as it touched down.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RenegadeJedi",
            "body": "'I'm never flying Beoing again'  \n\\-Them, probably",
            "score": 1,
            "replies": []
        },
        {
            "author": "Practical-Salad-7887",
            "body": "Am I looking at CGI?",
            "score": 1,
            "replies": []
        },
        {
            "author": "itsrainingagain",
            "body": "Let’s be clear here- this was a fucking huge win by the talented engineers at NASA and SpaceX.\n\nElon has been off in the shit weeds for a while now. He didn’t do jack shit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SpikeoftheBebop",
            "body": "Great! He’s a hero for this. I know a lot of redditors want to key the space capsule and spray paint a swastika on it but you got to acknowledge he did good here",
            "score": 1,
            "replies": []
        },
        {
            "author": "KwHFatalityxx",
            "body": "Amazing 😁",
            "score": 1,
            "replies": []
        },
        {
            "author": "cooseman22",
            "body": "Leave it to an evil globalist Nazi to save a couple of stranded humans from space.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sleekandspicy",
            "body": "Incredible he did it again",
            "score": 1,
            "replies": []
        },
        {
            "author": "donniedumphy",
            "body": "Why are we watching an animation?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ursomonie",
            "body": "Elon has nothing to do with any of this engineering",
            "score": 1,
            "replies": []
        },
        {
            "author": "redshred42",
            "body": "Thank you space x",
            "score": 1,
            "replies": []
        },
        {
            "author": "Global-Spite-8701",
            "body": "Can’t wait to hear what the flat earthers have to say about this. Fun to watch them try and debunk the “lies” of NASA and space",
            "score": 1,
            "replies": []
        },
        {
            "author": "Expensive_Voice_8853",
            "body": "He can't keep getting away with it!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Limp-Coconut7716",
            "body": "I'm not in a cult (proceeds to bash one of the most productive humans of all time because he's helping their political enemy)",
            "score": 1,
            "replies": [
                {
                    "author": "ChicanoGoodfella",
                    "body": "Lmao “the most productive humans of all time” \nIf you think Elon gets that title, have you tried talking to a construction worker? Plumber? Farmer/Gardener? \nElon literally was born in wealth and privilege, you boot licking him because they sell you his bullshit speaks volumes how Americans see themselves, narcissistic spoiled brats the lot of you",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Mithrandir694",
                            "body": "I used to be a bricklayer, we work hard but we certainly aren't working on the same level as Elon Musk, I can all but confirm that every brickie would crumble under the weight of that responsibility.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ChicanoGoodfella",
                                    "body": "What responsibility? In the corporate world it’s about delegating the shit work, most of the job is creating and maintaining business connections, keeping profits high and cutting deficit spending, essentially it’s more social than anything. It’s not productivity it’s branding and marketing",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "2ndMostHumbleMan",
                            "body": " I'm an industrial/commercial electrician, have been on dozens of construction projects in my life....never seen anyone as productive as Elon.   \"Work smarter not harder\" comes to mind, you don't need to be slaving away 24/7 on a task to be extremely productive.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "thugspecialolympian",
                                    "body": "lol work smarter not harder? You are talking about someone that was born on third base, never had a hard working job in his life, never faced any real everyday problems that people that actually had to work to acheive things, but talks about SS as a wasteful entitlement. Idgaf what he does that you folks consider “wholesome”, he chose to be involved in things that he doesn’t have any qualifications to do, and lord over things that have absolutely no negative affects on him, while his money does nothing but multiply itself while instructing a bunch of fuckface little goons to fire vets and cut funding to our most vulnerable citizens. I truly hope you have the kind of life you deserve worshiping people like that, either way.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "BeatSteady",
                                    "body": "No, you don't. You can tweet all day while your employees slave under you",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "ChicanoGoodfella",
                                    "body": "Oh geez, do you think there’s a level of wealth that would allow people to work “smarter not harder” because it depends on the work, farmers/gardeners work tirelessly because the work requires of that. Elon can just hire other people and delegate job duties, your farmer can’t. It’s all wealth and opportunity disparity but you thinking that these billionaires actually worked to get to where they’re at is as delusional as they care about you smh",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "DLDabber",
            "body": "But. But. But. He’s a Nazi.",
            "score": 1,
            "replies": [
                {
                    "author": "Normal-Ordinary-4744",
                    "body": "I thought SpaceX was a Nazi company 😂",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "silentbob1301",
            "body": "yeah, i bet every time someone is saved by an ambulance you give henry fords corpse a fucking handjob...\n\n![gif](giphy|14smAwp2uHM3Di)",
            "score": 1,
            "replies": []
        },
        {
            "author": "dubaria",
            "body": "Thanks to the US tax payers who subsidize SpaceX. Thank you to NASA for laying the ground work, running the space program and that’s about it. \n\nJamie, pull up the video",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "[Here you go](https://www.google.com/search?q=the video&btnI)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JoeRogan) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "AshHouseware1",
                    "body": ">Thanks to the US tax payers who subsidize SpaceX.\n\nThis is so weird I don't even understand the point of it. I guess instead of thinking folks in the military, next time I'll just just say thank you to the US taxpayers who subsidize the military?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Altruistic_Guess3098",
            "body": "Elon is truly a hero for this one. Whether you like him or not he saved these people's lives",
            "score": 1,
            "replies": [
                {
                    "author": "Normal-Ordinary-4744",
                    "body": "Elons company SpaceX is an asset to America",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Tuppens",
                    "body": "No he didn’t. The astronauts were delayed and Musk wanted to get good PR (and get more money funneled to his company) by sending SpaceX to fetch them before the next routine flight up there. Apparently his ruse worked for all the dullards in the world.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Altruistic_Guess3098",
                            "body": "Revisionist history right there",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "genogalvan",
            "body": "Why does he get the credit and not the actual people who built the ship?",
            "score": 1,
            "replies": [
                {
                    "author": "Colfrmb",
                    "body": "If you’ve ever been involved in such a monumental effort, you will know that they are proud and very relieved.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fuckitimtrippy21",
            "body": "The positivity we needed to see. But not giving elon the credit. He’s not in America’s best interest, I don’t think. Don’t have to blast me, just my opinion, man.",
            "score": 1,
            "replies": [
                {
                    "author": "CraftyConstruction3",
                    "body": "You don’t think he’s for American yet his company just saved American astronauts. He probably could have kept his mouth shut and not done anything.\n\n![gif](giphy|l3q2K5jinAlChoCLS)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "IIIuminatIII",
            "body": "They’re not even real",
            "score": 1,
            "replies": []
        },
        {
            "author": "zero_cool_protege",
            "body": "Who cares",
            "score": 1,
            "replies": []
        }
    ]
}