{
    "title": "True Stories: How did your game go this week? – March 17, 2025",
    "author": "AutoModerator",
    "subreddit": "dndnext",
    "rank": 1,
    "score": 2,
    "upvote_ratio": 0.67,
    "num_comments (reported by reddit)": 17,
    "url": "https://www.reddit.com/r/dndnext/comments/1jczkb1/true_stories_how_did_your_game_go_this_week_march/",
    "id": "1jczkb1",
    "selftext": "Have a recent gaming experience you want to share? Experience an insane TPK? Finish an epic final boss fight? Share it all here for everyone to see!",
    "comments": [
        {
            "author": "Sgt-Fred-Colon",
            "body": "My first time as DM and I am doing lost mines. My players have recruited a goblin warband with Klarg at its head. And then we’re convinced a tower during a random road encounter was haunted when it’s actually one of my players back story biting them. Also\nEnded up with a new trio of NPC in Phandalin who will tie into one of the player back and future post mines story if the group decides to continue past level 5. It’s my second session as DM and the players are supportive, playing their characters, good to each other, and active in our discord between sessions. I am so happy and have fallen in love with the DM role. 3/4 of our session today was improv based off a random encounter that I scaled up because they got through too easy and it wasn’t fun",
            "score": 3,
            "replies": []
        },
        {
            "author": "unclecaveman1",
            "body": "It didn’t. We are midway through the “final boss fight” of the campaign and one of my players has a tendency to change plans on us. Any time something else comes up, he drops the game to go do that. Like the dnd game is just the placeholder until something better comes along.\n\nWe needed all hands on deck for the fight, so I ended up having to cancel the game. Next game sometime in April.\n\nIt’s… insulting. No respect for the time and effort I put in to run this game.",
            "score": 3,
            "replies": [
                {
                    "author": "ColdPhaedrus",
                    "body": "That really sucks. As someone who has had problems in the past with chronically absent players, I feel ya.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DrOddcat",
            "body": "I wasn’t feeling good and one player was really iffy on if they could play. So I announced we were doing a oneshot in the campaign world. My players are normally pirates on their own ship. For the one shot they played as the crew of another pirate ship. They raided a shipwreck to recover a magic artifact. Then I revealed that crew works for the guy they suspect of being the BBEG. Now they are terrified the characters they created are going to become NPC minions they will have to face later.",
            "score": 3,
            "replies": []
        },
        {
            "author": "nregisteredAnarchy",
            "body": "In Phandelver and Below: the Shattered Obelisk, we just reached the second of three consecutive dungeons. In the first room, after a boss fight, the party (4 level 8 adventurers) were attacked by 4 revenants. Upon seeing how hard they hit with each attack, the DM toned down their damage, but the fight was still one of the toughest in the campaign so far. We decided to abandon the quest for the time being and return after buying magic items in Neverwinter. The DM hadn't planned for this, so we ended the session immediately after.",
            "score": 2,
            "replies": []
        },
        {
            "author": "DnDNoobs_DM",
            "body": "Session 2 of a home brew campaign! New players… it went well… but man I made some decisions while in the moment that I need to now figure out 🤣\n\nBut, story is going well.. players seem engaged and they are evolving well!!! What a great game this is",
            "score": 2,
            "replies": []
        },
        {
            "author": "DoktorDefeat",
            "body": "We are currently playing WbtW and were forced to perform for Endelyn Moongrave because we were captured. Our DM let us play out the nonsensical tragedy of performance that Endelyn wanted in the following way:\n\nEach player (we are 2) says a number between 1 and 80 and gets and random sentence, that needs to be part of our performance and fit into our script and we had 90 seconds to do it every time we get a sentence. It was incredibly fun and honestly more stressful than any possible I did so far xDDD\n\nWe did it in the end though (not perfectly, but good enough).",
            "score": 2,
            "replies": []
        },
        {
            "author": "thorn0000",
            "body": "It wasn't this week, but it was the last time I played. We were playing early Descent into Avernus and hunting down the cult of the dead three as memebers of the flaming fists. They were stationed in a bathhouse, and all 3 other party members, including our leader, the Gauntlet, got massages while on work. I'm playing the Dungeon Dudes Apothacary, an intelligence based pact caster with a support focus. I'm a mad surgeon, emphasis on the mad. When the enemies showed up, my character lost it, sick of his colleagues getting massages when we're hunting down a group of murders. He went into a mad rage, swinging around his bonesaw and screaming about how he would carve them to pieces.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NecroDancerBoogie",
            "body": "Homebrew campaign doing an interlude in the feywild.  Players were super engaged, I delivered improv without messing up and did some performing that was a bit outside my comfort zone that I think went well.  The game went for 6 hours and it didn’t feel like it dragged.\n\nProbably my favorite session I’ve run so far.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lorddrake4444",
            "body": "Tabaxi rogue tried to nick a fancy sword off a random npc , turns out that npc is essentially a mafia boss let's say the rogue got his tail slashed off for a permanent -2 to dex",
            "score": 1,
            "replies": []
        },
        {
            "author": "duncanl20",
            "body": "Fellow PC died to finger of death by an arcanaloth in Shattered Obelisk. Final session is next week!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Megamatt215",
            "body": "The party fought an otherworldly god-like being claiming to be the Goddess of Order. She also happened to be the warlock's patron. The party survived. It wasn't exactly a win, it was more of a \"I'm tired of this, you're going to do what I want anyway\" and then teleporting them all outside. But also, the warlock has a new patron, the self-proclaimed God of Chaos. Literally popped into the warlock's head in the middle of the fight to telepathically tell him that his old patron was \"playing dirty\" and he would give him a small, one-time loan of phenomenal cosmic power, purely to piss off his sister, and that they could \"work out the details later, I know you're busy.\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "The_Ora_Charmander",
            "body": "We had to retrieve something that was stolen from us last session, so we tracked down the thief who led us to where he put it, ***in the hoard of a black dragon*** (somewhere between wyrmling and young). We're level 3 so we really didn't wanna fight this thing so we tried the diplomatic approach, which surprisingly worked, we managed to break a deal: we get our thing back plus a slumbering dragon vessel in exchange for some other magic item which was cool in theory but we weren't sure how to use it",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zealousideal_Bet4038",
            "body": "My play-by-post group is assembled and we just settled on 5e ‘14 as our system! I’m doing some finishing touches on the Discord server and I’ve gotta pick out which of a few campaign premises I’m gonna set us off with still.",
            "score": 1,
            "replies": []
        },
        {
            "author": "YamikoPros",
            "body": "Great game this week, a bit of admin after our castle was sieged and a couple npcs died (my characters adoptive mom being one of then). Very roleplay heavy, with mixed emotions while everyone tried to prepare for what is next. Did get this fun little exerpt from my Pallock and her patron though: (her grandmother). \n\nPallock: yet again you find yourself biting the bullet due to my own inadequacies. Please. If there's anything I can do to ease your suffering, you only need to ask.\n\nPatron: yeah, i can think of something that could help.\n\nPallock: what is it?\n\nPatron: You getting a better attitude\n\nPallock:\n\nPatron: seriously, go touch some grass.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SkillDabbler",
            "body": "Our game this week was the aftermath of my PC dying the previous session. I went into this session feeling pretty anxious, a little sad, and curious about what comes next from that fallout. I felt like the players didn’t share my shock or sadness, and I felt like this was the session where I’d be saying good-bye to her. We’ve all played our respective characters for a really long time and my character (Druid using optional spells from TCOE) acted as the healer of the party, bringing others back to life or buffing them up to prevent death. I felt like I save everyone else, but who’s there to save me? \n\nWell, I was definitely proven wrong. There was a sense of urgency and sadness in character, and my friends expressed out of character how they’ve had shower thoughts of what could have been done differently since our last session. The PCs have learned that my PC’s soul was captured by our Warlock’s cursed gold eye and they might be able to retrieve it from her Patron in the Hells. The PCs performed a ritual to preserve her body and each provided an offering (diamond dust, sage, a honey scoop, a lucky ring, and Rod of the Pack Keeper). Our gnome player cried when the rogue, my PC’s partner, kissed my PC and assured her that he was coming to get her. It was all really sweet and I felt like my silly worries were relieved.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ColdPhaedrus",
            "body": "I have two groups running through my homebrew campaign and the Thursday group decided to go a nautical route. They just wrapped up their business on the second island after a battle assisting a pair of dolphin delighters against a big group of deep scions.\n\nNow I figured that they were going to look at the map and plot out an island hopping route to the island where the next stage of the main quest is located, but instead, because they are having so much fun with their own ship, they're planning on going out of their way to hit EVERY SINGLE ISLAND.\n\nThis is gonna take a while...",
            "score": 1,
            "replies": []
        }
    ]
}