{
    "title": "Ascendant step",
    "author": "Redragontoughstreet",
    "subreddit": "dndnext",
    "rank": 9,
    "score": 7,
    "upvote_ratio": 0.78,
    "num_comments (reported by reddit)": 10,
    "url": "https://www.reddit.com/r/dndnext/comments/1je98ac/ascendant_step/",
    "id": "1je98ac",
    "selftext": "This invocation seems so flavourful; it gives off magneto like vibes. \n\nMy concerns, how useful is this invocation in actual game play. I find with my warlock I like to concentrate on hour long summons spells in an attempt to get as much value from my pact slots as possible. \n\nBut I supposed by level 9 I could just levitate out of melee reach and just spam Eldritch blast and synaptic static. I don’t know. \n\nHas anybody used this invocation and how did it go? ",
    "comments": [
        {
            "author": "milkmandanimal",
            "body": "Levitating in the middle of combat is essentially holding a giant \"Hey, look, I'm a squishy caster, please target me, ranged enemies.\"  Can certainly be effective if there are only melee enemies, but you're basically making yourself a big target with it.  It's just not that great.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GnomeOfShadows",
            "body": "My DM allowed me to take it via a Feat, gave me a +1 to my casting stat and removed the targeting restrictions. And even with all this, it hasn't really become a strong feature and is only used for flavor. So yeah, it is definitly weak",
            "score": 1,
            "replies": [
                {
                    "author": "Redragontoughstreet",
                    "body": "Yikes.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "GnomeOfShadows",
                            "body": "Outside of combat it is fun, but at that high of a level you don't really need to levitate stuff. Yeah, it is at will flight for small gaps and stuff like that, but at level 12 you don't really plan on a wild river to use up any ressources anyway.\n\nI am a rogue focussing on telekinesis magic and fighting with a bracer of flying daggers, so flying above everyone only makes me a target without somewhere to hide. I could levitate others, but that would waste my turn and make them immobile. We have a caster with the fly spell for that.\n\nI am still waiting for a strong melee-only enemy to cast this on, since those types get completly disabled by the spell, but they probably have high enough Con to be completly immune.\n\nMy honest review is that it is great for flavor and can be used to some effect. But it will never trivialize something that was hard before.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Redragontoughstreet",
                                    "body": "Problem is with the invocation as written you can only cast levitate on yourself. So that’s not an option without a homebrew.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "GnomeOfShadows",
                                            "body": "Yep. All you can do is float yourself up and down, and slowly climb along walls...",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Creepy-Caramel-6726",
            "body": "It's extremely situational, and a big part of it depends on how often your party takes short rests. If you break concentration to levitate, you want to feel sure you'll have a chance to reclaim that spell slot soon.",
            "score": 1,
            "replies": []
        },
        {
            "author": "nasada19",
            "body": "You're better off using Shadow of Moil. It makes all attacks have disadvantage, you have advantage on all your attacks, and you can't be targeted by abilities or spells that require sight unless the enemy has blindsight. True sight doesn't even cut through it.",
            "score": 1,
            "replies": [
                {
                    "author": "Redragontoughstreet",
                    "body": "I’ve been using summon undead a lot. It lasts and hour and has been doing a good job of grant disadvantage to foes attacks. \nI’m only level 7; I suspect being obscure might be more valuable once the enemies have more powerful range attacks.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ThisWasMe7",
            "body": "The problem with levitation is it doesn't move you horizontally. So you can't escape unless you levitate to the ceiling and your DM lets you pull yourself along. Enemies can flee or go around a corner and just wait you out. Assuming they don't have a ranged or improvised ranged attack.",
            "score": 1,
            "replies": []
        }
    ]
}