{
    "title": "Rules from BG3 that you’ve implemented in your game?",
    "author": "LemonLord7",
    "subreddit": "dndnext",
    "rank": 8,
    "score": 6,
    "upvote_ratio": 0.59,
    "num_comments (reported by reddit)": 54,
    "url": "https://www.reddit.com/r/dndnext/comments/1jec7ue/rules_from_bg3_that_youve_implemented_in_your_game/",
    "id": "1jec7ue",
    "selftext": "Are there any rules in Baldur’s Gate 3 that you (or your DM) have liked so much you’ve house ruled them into your game of DnD 5e? ",
    "comments": [
        {
            "author": "JRStors",
            "body": "Potions as a Bonus Action. I use this in a 5E 2014 campaign.\n\nThe ruling was so good, 5E 2024 changed it.",
            "score": 1,
            "replies": [
                {
                    "author": "GIORNO-phone11-pro",
                    "body": "Mainly because everyone and their mother had a variation of BA potions.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "marimbaguy715",
                            "body": "Yup. I'm not saying Critical Role were the first to make potions a Bonus Action nor am I even confident they're the reason the houserule was so common, but they've been using potions as Bonus Actions since they started in 2015 and that shows just how old this houserule is. BG3 and D&D 2024 smarly decided to go with the trend.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Varaken",
                    "body": "I stole an idea from the internet that healing potions taken as a bonus action you roll for but if you choose to take your action to down it you get maximum effect. Idea being that rushing it as a bonus you might spill some, not finish it etc.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TimidBerserker",
                    "body": "What are potions 2014 RAW?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "LovecraftInDC",
                            "body": "An action.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "LurkyTheHatMan",
                            "body": "Potions are an action to drink or administer in 2014.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Radigan0",
                            "body": "Action",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Feefait",
                    "body": "I do this, but I hate it. lol It just makes it easier for my players, while I want them to freakin work for ti already! :P",
                    "score": 1,
                    "replies": [
                        {
                            "author": "JRStors",
                            "body": "Honestly if the potions are making combats too easy for your players, I would consider giving some spellcaster enemies spells like chill touch to prevent them from healing as often",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "afroedi",
                                    "body": "Or giving less potions to the players, so they feel more impactful",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Shreddzzz93",
            "body": "A lot of spells that have long durations tracked in hours I run till the next long rest. It's just easier this way.",
            "score": 1,
            "replies": [
                {
                    "author": "Annual_Pride8244",
                    "body": "honestly I feel like most DMs do this without realizing",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Shreddzzz93",
                            "body": "They do. But just openly telling players this clarifies a lot of things and cuts down on the hey DM how long has it been question.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "LegacyofLegend",
                            "body": "Ya gotta be careful with which ones you choose cause you could accidentally make something stronger than you anticipated.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Lucina18",
                                    "body": "Not really, all the 8 hour spells are expected to last till long rest normally. They just don't want to write \"duration: untill next long rest/short rest/end of encounter\" because that is evil infernal 4e speak!! (Sadly not even joking...)",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "LegacyofLegend",
                                            "body": "I speaking of hour long ones specifically. That could present an issue.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Lucina18",
                                                    "body": "Hour long spells are the only weird one, basically 3/4ths of the way towards being a short rest spell.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "LegacyofLegend",
                                                            "body": "Hence why I don’t make those last 8 hours.\n\nIt’d make caster even stronger than they currently are.\n\nSame with summons.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "StCr0wn",
                                            "body": "Kinda of an extreme example but foresight goes from should I cast it in the morning/early and expect my day to be done early or should I wait and risk not having it up?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Annual_Pride8244",
                                    "body": "yeah but if it lasts 8 hours like mage armor or something I just say till long rest unless there is a thematic reason for it to go away",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "FabianTheElf",
            "body": "2 short rests per long rest but ten minutes rather than an hour.",
            "score": 1,
            "replies": [
                {
                    "author": "kittyonkeyboards",
                    "body": "Been doing this and people actually short rest. Even saving the princess allows for a 10 minute breather.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "demonic-cheese",
            "body": "Shared pool of inspiration, it can be a life saver, but it’s doubly awesome when we all agree to let someone use them for something stupid",
            "score": 1,
            "replies": [
                {
                    "author": "rkthehermit",
                    "body": "I love mixing up ways to handle inspiration. My favorite stolen one is from a Star Wars ttrpg with a lightside/darkside system where there are a number of inspiration coins in play at all times. \n\nIf a coin is white side up the players can use it but it flips it to dark which makes it available for the DM.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "LemonLord7",
                    "body": "I don’t think this is a house rule actually. If I recall correctly, you may give your inspiration to a friend at any time.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "WeimSean",
            "body": "Consuming a potion as a bonus action.",
            "score": 1,
            "replies": [
                {
                    "author": "balrog687",
                    "body": "I've seen a variant on this one.\n\nUsing a bonus action rolls 1d6 hp, using an action gets 6hp, no dice rolled.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "CrownLexicon",
                            "body": "Potions are normally 2d4+2, but yes, same.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Nutzori",
                            "body": "I like to imagine healing potions activate upon opening the cork, and quickly chugging it has middling effects. Letting it settle / mix properly (taking entire action) gets you full benefits.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "aleguarita",
                    "body": "Potions in D&D 2024 is bonus action",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ActualSpamBot",
            "body": "* Two more or less instant short rests per long rest for balance between short rest and long rest classes \n* Inspiration as a party resource rather than an individual one (still capped at 1/party member in capacity, but enthusiastic roleplayers can earn Inspiration multiple times if there's room in the party pool)\n* The existence of an ancient network of fast travel portals that connect to each other and need to be activated in person before a person can use one isn't really a house rule so much as a lore inclusion, but its a game mechanic that really unborings repetitive travel on a large map (although its not instantaneous in our game, just much faster than walking)",
            "score": 1,
            "replies": []
        },
        {
            "author": "JulyKimono",
            "body": "I'm experimenting in one campaign with inspiration stacking up to 4. I really like it so far. That means I can give inspiration whenever the party does something creative, roleplays in some unique way, or completes a quest. Although I don't give individual inspiration, if I'm giving it, I'm giving it to the entire party. But I track individual accomplishments that I'd give inspiration for and give it to the entire party after several such instances.\n\nI think it averages to 1-1.5 inspiration dice each member gets every session. Which also leads to them using the inspiration a lot more often or stacking it for some boss fight.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DiemAlara",
            "body": "Crowd control effects that last a minute are reduced to two rounds.\n\n  \nNot really, but I'm curious as to how much of a difference it would make.",
            "score": 1,
            "replies": [
                {
                    "author": "JanBartolomeus",
                    "body": "I think the impact would be pretty small? On average i feel combat only lasts 3-4 rounds. So odds are that 2 rounds wont really reduce the amount of rounds you lose out on?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Too-many-Bees",
            "body": "Anyone can use a spell scroll",
            "score": 1,
            "replies": [
                {
                    "author": "resevil239",
                    "body": "This. I wonder how many dms allow this without even realizing it's not raw. I didn't know for a while, read the raw rules, and thought it was the dumbest thing I've ever read. And I disagree with a lot of points in the raw rules - mostly because they feel written to counteract abuse where as my players tend to competly forget about resources they have and use little strategy.\n\nIn world in my campaign Scrolls are single use consumables designed to be easy to use. If I had a party memeber with the ability to make them maybe I'd consider some restrictions , but otherwise I don't even understand why they are limited. Unless you have a player trying to mass produce high level spells it seems pointless. Even if that happens, there, are better ways around it than limiting who can use a scroll.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Ninjacat97",
                            "body": "Even if you've players making their own scrolls, that's downtime and gold they have to spend. Though how impactful those costs are vary greatly with the campaign at hand and whether you use the Xanathar's or 5e24 numbers.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "LemonLord7",
                            "body": "How do you view wands?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "resevil239",
                                    "body": "Are there even official rules for wands? Or are you referring to spellcasting focuses? Either way it's not something I really think about after the first session if even then. My players have never asked about wands and the closest I'd probably get are spell charged staffs which would work the same way as say a necklace of fireball or similar magic items with charges work. Only difference is I'd probably allow that to be considered a focus.\n\nIf a player really liked wands for whatever reason then either it's just a focus and is purely a flavor thing or same properties as a charged staff.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "basicgear00",
            "body": "Not a rule but I am in the process of designing and 3D printing a player place mat that has a flipper for the player action as a green circle and bonus action as an orange triangle. The player can flip it after they do it. I’m also making card slots there for their spell cards so they can divide them into action spells or bonus spells.\n\nOther features too but taking the icons from Bg3.\n\n\nI am also designing weapons and weapon abilities that refresh at short rests like BG3.",
            "score": 1,
            "replies": []
        },
        {
            "author": "geosunsetmoth",
            "body": "Having played the 2014 warlock, the 2024 warlock, rhe BG3 warlock and the LaserLlama warlock; BG3 is my clear favorite. Players get the BG3 versions of the pacts and the deepened pact feature",
            "score": 1,
            "replies": []
        },
        {
            "author": "The_UX_Guy",
            "body": "Allowing a thrown potion as a way to administer it. \n\nExample\nAs an action, I will allow a player to throw a health potion at another player. They make an attack roll with it as an improvised weapon. If it hits, it deals damage (1 hp or maybe 1d4 if bigger than common) then breaking, it gives the benefit of the potion.\n\nI allow it mostly because I think it's hilarious to bean a PC to heal them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nystagohod",
            "body": "Potions as a bonus action. \n\nI'm debating in the jump rules, but I think there's some more nuances to be worked out there.\n\nThe ethis of certain items just mit needing attunement.\n\nRemoving the imit on spellslot spells per turn. \n\nRelatives ease of flow of weapon swapping .\n\nThe wet condition and some similar stuff.\nDebating on the bonuses for highground, but wanna do more work with them.\n\nThere's a fair bit",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gael_of_Ariandel",
            "body": "Never break Karlach's heart.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pinkalink23",
            "body": "Those long rest potions, I can't remember the name now",
            "score": 1,
            "replies": [
                {
                    "author": "Ninjacat97",
                    "body": "Angelic Reprieve and Angelic Slumber for short and long rests, respectively.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "kittyonkeyboards",
            "body": "Two short rests but only 10 minutes required. \n\nWith 1 hour rule players either barely short rested or gamed it on monk / warlock.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PaladinWiggles",
            "body": "2 free short rests per day. Really helps keep the pace going.",
            "score": 1,
            "replies": []
        },
        {
            "author": "meusnomenestiesus",
            "body": "It's controversial but multiple leveled spells per turn and no restrictions on Haste actions. I balance with it in mind.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bagel_Bear",
            "body": "I thought a little bit about using that you lost your action if you were just brought back after being unconscious when I run Strahd soon but idk",
            "score": 1,
            "replies": [
                {
                    "author": "JanBartolomeus",
                    "body": "The main reason i'd argue against this is that it already feels really bad if you are the one player that went down, and on average you will have already lost a turn being down.\n\n\nIf you then also lose a turn being up, odds are you cant even move away from the danger and go down again\n\n\nBg turns are fast and most people control more than one character, so not being able to act for a turn is not that big a deal. In dnd losing a turn can mean not doing anything for 15 minutes assuming 4 players and a dm each taking 3 minutes per turn. So if you go down and have to be brought back up thats 15 minutes. If you then lose another turn thats 30 minutes. If you then get downed again because you couldnt move thats 45 minutes\n\n\nI get the idea of challenging, and how yoyo healing is... Problematic, but just be wary of screwing the players that presumably already got screwed",
                    "score": 1,
                    "replies": [
                        {
                            "author": "VengefulPeanut18",
                            "body": "The change I've used to avoid yoyo healing is that being reduced to 0HP incurs 1 point of exhaustion. To compensate, Lesser Restoration removes 1 point of exhaustion and Greater Restoration removes all exhaustion.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Champion-of-Nurgle",
            "body": "None",
            "score": 1,
            "replies": []
        }
    ]
}