{
    "title": "Are there default thematic names for the class-grouping of subclasses in 5.5e? ie. Barbarian Paths, Warlock Patrons, etc.",
    "author": "mfdaw",
    "subreddit": "dndnext",
    "rank": 3,
    "score": 16,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.reddit.com/r/dndnext/comments/1jef8hp/are_there_default_thematic_names_for_the/",
    "id": "1jef8hp",
    "selftext": "Working on a basic introduction to D&D that I can use to teach people the fundamentals, and I'm trying to hit the highlights of classes (with examples from common media). I'd like to sum up the idea of subclasses with a single, thematic term, and there used to be ones in the PHB but some have just defaulted to Subclass, which is boring.\n\nWizards used to have Schools, but that's changed with 5.5e. Monks had Ways and now they're Warriors. Fighters, Rangers, and Rogues all had Archetypes, but I'm trying to change things up a little bit to paint a bit more difference between the classes.\n\nHere's what I have so far:\n\nBarbarian Path  \nBard College  \nCleric Domain  \nDruid Circle  \nFighter Archetype (the old name)  \nMonk Warrior  \nPaladin Oath  \nRanger Specialization (used to be Archetype but want to be different from the Fighter)  \nRogue Profession (also used to be Archetype and Profession seems to fit Rogue well)  \nSorcerer Origin  \nWarlock Patron  \nWizard Savant (used to be School, Savant seems interesting to use)\n\nSo, Fighter, Ranger and Rogue all used Archetype. Wizards used to have Schools, but Savant is in the feature description. Any thoughts? Probably thinking too much but trying to flair things to make it as easy to differentiate between classes for new folks as possible at a glance, and don't want to re-use the same word or just say Subclass.",
    "comments": [
        {
            "author": "SevenLuckySkulls",
            "body": "I think savant is a very interesting term for the wizard classes because it sort of implies that wizards who devote themselves further to a specialization sort of lose some of their ability with others. For all you gain in power with Illusion, your evocation will be lacking. \n\nI don't expect that scheme to continue when WoTC release wizard subclasses that don't revolve around a school of magic, though.",
            "score": 1,
            "replies": [
                {
                    "author": "Cranyx",
                    "body": ">it sort of implies that wizards who devote themselves further to a specialization sort of lose some of their ability with others\n\n\nThat's how wizard subclasses used to work in AD&D",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SevenLuckySkulls",
                            "body": "I think it would be more interesting for sure but I doubt the vast majority of players would be ok with a change like that.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Xeviat",
            "body": "Here's what I like, mostly from 5E:\n\nArtificer Specialization\nBarbarian Path\nBard College\nCleric Domain\nDruid Circle\nFighter Archetype\nMonk Way\nPaladin Oath\nRanger Conclave\nRogue Scheme\nSorcerer Bloodline\nWarlock Patron\nWizard School\n\nI really miss \"Way of the X\" for Monk. Monks aren't warriors to me, they're a divine class seeking enlightenment and one with the divine through different physical and mental practices. \"Way of the Shadow\" sounds much cooler than \"Warrior of Shadow\" to me. The fighter is the warrior, not the monk.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jack_of_Spades",
            "body": "Its neat for a flavor perspective, but I think subclass is more clear.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lopsidedbuilder69",
            "body": "Hey op, not what you asked but in my experience, \"subclass\" for all classes is a better ways to go. Can't tell you how many conversations I've had that go like \n\n\nPlayer 1- \"I wish I could do XYZ thing\"\n\n\nDM- \"You can actually, you got the ability to do so from your Domain!\"\n\n\nPlayer 1- \"huh? My domain? What's that??\"",
            "score": 1,
            "replies": [
                {
                    "author": "Jealous_Bottle_510",
                    "body": "This is a prime example of the type of player who didn't read any of their character materials, not an argument against flavorful titles for subclasses.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Jealous_Bottle_510",
            "body": "Each subclass type used to have its own title, as per the class features which granted them:\n\n* Artificer Specialization\n* Primal Path\n* Bard College\n* Divine Domain\n* Druid Circle\n* Marital Archetype\n* Monastic Tradition\n* Sacred Oath\n* Ranger Conclave\n* Roguish Archetype\n* Sorcerous Origin\n* Otherworldly Patron \n* Arcane Tradition\n\nAnd yeah, 2024 5e dumbed the subclass features down to \"X subclass\" (and renamed Monk subclasses to reinforce them being dumbed down into being nothing but \"warriors\").",
            "score": 1,
            "replies": []
        }
    ]
}