{
    "title": "Trust him.He knows that stuff",
    "author": "CuddlyWuddly0",
    "subreddit": "WTF",
    "rank": 19,
    "score": 14700,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 739,
    "url": "https://v.redd.it/esgazjasujne1",
    "id": "1j6txxa",
    "selftext": "",
    "comments": [
        {
            "author": "GieckPDX",
            "body": "“He runs structural steel down the brick channels and bolts them into a steel support/moment  frame.” \n\nThis is what I’m telling myself - and I don’t want to be talked out of it.  😂",
            "score": 4492,
            "replies": [
                {
                    "author": "Cador0223",
                    "body": "I guess this is cheaper than metal deck and concrete, but damn ",
                    "score": 555,
                    "replies": [
                        {
                            "author": "ExecrablePiety1",
                            "body": "In the short term, yes. Not so much in the long term WHEN these collapse on someone and he gets sued into oblivion. Or his contracting company, if that's the case.\n\nProblem is, if he can't afford to build a roof properly, he probably can't afford to pay out any significant amount for a lawsuit. Assuming he isn't contracted.\n\nOtherwise, I would imagine the contractor would take most of the heat, since they would obviously know this is going on. So, either they encourage it, or turn a blind eye to it.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "Cador0223",
                                    "body": "Nobody is suing anyone if you live in that building. I doubt that is a litigious culture.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "ExecrablePiety1",
                                            "body": "Part of it is not so much whether it's a litigious culture as much as the ability of the lower class to litigate being held back by the exorbitant costs of it. At least with civil matters.\n\nIn the case of criminal matters builders in developing countries are still sometimes held accountable for shoddy work. Especially if it generates a lot of public outrage. \n\nProbably a lot more than it's reported in the news here in the west. Our news doesn't care about such matters.\n\nOf course. This is all generally speaking. I have no doubt there are countries where said contractors are in the pockets of politicians or involved in some other shady dealings that keeps them safe. If such laws even exist there.\n\nHell, I've heard of shady dealings with American contractors that \"slipped through the cracks.\"",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "jimmyjohn2018",
                                            "body": "Sue, they'll just kill you.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "GieckPDX",
                                    "body": "NANANANA. I can't hear (read) you.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 30,
                            "replies": [
                                {
                                    "author": "Cador0223",
                                    "body": "No, metal deck can span large gaps. It's not the truly structural part. It's the reinforced concrete poured onto it that carries the load.",
                                    "score": 51,
                                    "replies": []
                                },
                                {
                                    "author": "Numeno230n",
                                    "body": "Hey you heard about that cyborg gigolo? He had a metal deck.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "fftimberwolf",
                                            "body": "I'm reading this in a kiwi accent",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Numeno230n",
                                                    "body": "lol exactly what I intended",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "lectrician7",
                                    "body": "What are you talking about? The job we’re building now has spans of 10-20 between steel beams with the deck on top of it that’s another floor. These spans in the video are less. So no if there were metal decking and concrete it would not necessarily need more steel.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Rydralain",
                            "body": "I definitely didn't read the word \"deck\" the first time around.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "EyeChihuahua",
                            "body": "It looks like the deck at club aqua",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Cicer",
                    "body": "Based on the lack of grout on the short ends I hope you are right. ",
                    "score": 190,
                    "replies": [
                        {
                            "author": "cokacola69",
                            "body": "You can see light through the cracks when he walks and shows off the underneath side. It is terrible terrible terrible.",
                            "score": 73,
                            "replies": [
                                {
                                    "author": "GieckPDX",
                                    "body": "FAKE NEWS.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Vassago81",
                    "body": "Or he just hope he get paid before the next magnitude 1 earthquake.",
                    "score": 89,
                    "replies": [
                        {
                            "author": "maineac",
                            "body": "> magnitude 1 earthquake.\n\nYou mean when someone scrapes a chair across the floor.",
                            "score": 145,
                            "replies": [
                                {
                                    "author": "Vassago81",
                                    "body": "More like when a butterfly on the other side of the world have an orgasm.",
                                    "score": 63,
                                    "replies": [
                                        {
                                            "author": "The_Pleasant_Orange",
                                            "body": "Fucking butterflies, always the lead cause of every problem",
                                            "score": 20,
                                            "replies": [
                                                {
                                                    "author": "BrannC",
                                                    "body": "Typical butterfly effect",
                                                    "score": 6,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "amancalledJayne",
                                                    "body": "Fucking Butterflies ain’t a half bad band name either",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "LettuceWithBeetroot",
                                                    "body": "Yeah, and they have more orgasms than me",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "DoubleAholeTwice",
                                                    "body": "Should probably stop fucking butterflies....",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "__redruM",
                                    "body": "When someone scrapes a chair across that second story floor.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "hellotypewriter",
                            "body": "Nah, he’s pushing his truck up the road from that job site. Too risky to start the engine.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "NowWhoCouldThatBe",
                            "body": "Or a fart",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "ExecrablePiety1",
                            "body": "Magnitude 1 earthquakes are a dime a dozen.\n\nAccording to the USGS, there have been 31 earthquakes larger than 2.5 in the last day (March 11) out of 85 earthquakes total.\n\nOr 744 earthquakes in the last 7 days, 3,544 in the last month and 48,654 over the last 365 days. Those are of any magnitude. I just thought those figures were interesting. Shows just how much more active earth is than we think.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Scroatpig",
                    "body": "But in the other areas the channels aren't even lined up properly.",
                    "score": 81,
                    "replies": [
                        {
                            "author": "MonsieurFubar",
                            "body": "He told you, don’t argue about it. They will line the holes one way or another, even if they have to drill it.",
                            "score": 48,
                            "replies": [
                                {
                                    "author": "GieckPDX",
                                    "body": "Thanks - that helps me sleep better.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "GieckPDX",
                            "body": "I said I WON'T be talked out of it (dammit)  :/",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "The_salty_swab",
                    "body": "No way in hell is anyone threading that needle",
                    "score": 28,
                    "replies": [
                        {
                            "author": "GieckPDX",
                            "body": "Boo.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 17,
                    "replies": [
                        {
                            "author": "High-Steak",
                            "body": "This is Iranian. I’m fairly sure it from one of the hundreds of Iran/ Kurd nomad channels on YouTube. Many are located in the Lordegan region.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "ukatz1",
                            "body": "Not brazil, they are not speaking portuguese",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "JamesLikesIt",
                    "body": "Him: “oh yeah, that would have been a good idea. Maybe next time!”",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Crowd0Control",
                    "body": "Is thar even structurally sound for a brick? They are great under compression but can be broken by hand with sheer. ",
                    "score": 2,
                    "replies": [
                        {
                            "author": "GieckPDX",
                            "body": "No. No it is not. \n\nNow please do shut up - I’m having the nightmares again.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ShanghaiBebop",
                    "body": "It’s actually a flat arch. It provides structural support in the same way a normal arch does to distribute the load to the steel beams.\n\nThis pattern is also used above some windows for the span. ",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "MyAssDoesHeeHawww",
                    "body": "I'm telling myself that he's got a secret formula for the mortar that basically turns the structure into a brick-filled spiderweb.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "PazJohnMitch",
                    "body": "Some of the bricks are rotated 90 degrees in the completed section.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "placenta_resenter",
                    "body": "He borrowed two screws from his aunt",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "mrRynstone",
            "body": "Reminds me of the game Dont Break the Ice",
            "score": 7464,
            "replies": [
                {
                    "author": "NoHorseShitWang",
                    "body": "New version “Don’t Kill the People on the 1st Floor”",
                    "score": 1921,
                    "replies": [
                        {
                            "author": "weech",
                            "body": "*all floors",
                            "score": 332,
                            "replies": [
                                {
                                    "author": "lithiumdaze",
                                    "body": "I doubt there would be a second, so the first floor is all floors!",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "GieckPDX",
                            "body": "Infinite Boo.  STRUCTURAL STEEL I SAID.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "the_moist_conundrum",
                            "body": "Ground floor",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "some_user_2021",
                            "body": "Why is the 1st floor not called floor zero?",
                            "score": -2,
                            "replies": []
                        },
                        {
                            "author": "WALancer",
                            "body": "because its the 1st one",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "the_moist_conundrum",
                            "body": "Ah ok. Most of the world says ground. The first is the first raised floor.",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "scrochum",
                            "body": "its different in certain parts of the world, here in ireland, the ground floor is the ground floor, the next floor up is the first floor and so on, where as in the US the ground floor is the first floor, the next floor up is the second and so on. this leads to confusion when we have americans visiting when they hit the 1 button on an elevator expecting the ground floor.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "mikesum32",
                            "body": "It mostly that way in America, but not always.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "WaylandReddit",
                            "body": "Most English speaking countries do that, it's called the ground floor.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Noname666Devil",
                    "body": "I wonder if this does have any structural purposes if it isn’t supposed to be walked on. Nah probably not why make a roof that can’t handle pressure",
                    "score": 195,
                    "replies": [
                        {
                            "author": "nehuen93",
                            "body": "Either this guy's works have not collapsed yet by miracle or he has no critical thinking nor any kind of knowledge of construction",
                            "score": 286,
                            "replies": [
                                {
                                    "author": "justArash",
                                    "body": "This guy's an expert. He used to design overhead walkways for Hyatt in the 70s.",
                                    "score": 401,
                                    "replies": [
                                        {
                                            "author": "Princess_Fluffypants",
                                            "body": "This is such an obscure joke and I’m sad so few people will understand it. ",
                                            "score": 175,
                                            "replies": [
                                                {
                                                    "author": "bjeebus",
                                                    "body": "I'm in my 40s and I don't get it...",
                                                    "score": 40,
                                                    "replies": [
                                                        {
                                                            "author": "poyuki",
                                                            "body": "in 1981 a bridge inside a Kansas City Hyatt hotel [collapsed](https://en.wikipedia.org/wiki/Hyatt_Regency_walkway_collapse) killing 114 people, mainly due to engineering failures.",
                                                            "score": 150,
                                                            "replies": [
                                                                {
                                                                    "author": "Cyphr",
                                                                    "body": "For those who prefer a podcast (with slides!). Here's a [Well There's Your Problem](https://youtu.be/Hw2t0MOGnVc?si=VMrKFqzwsIB74Jjw) episode covering this disaster.",
                                                                    "score": 16,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "xterraadam",
                                                                    "body": "The original engineering was flawed, the revision was deadly.",
                                                                    "score": 6,
                                                                    "replies": [
                                                                        {
                                                                            "author": "None",
                                                                            "body": "[deleted]",
                                                                            "score": 6,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Tbplayer59",
                                                                                    "body": "I think the problem with the original design was it called for threads in the MIDDLE of a long steel rod which of course doesn't make sense.  How are you going to get the nut on there?",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "None",
                                                                                    "body": "[deleted]",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Tbplayer59",
                                                                                            "body": "Also my understanding that the design change was made on site, but it did get referred back to the engineers who missed how the load carrying would change.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "xterraadam",
                                                                                    "body": "You pay a guy with a drill motor by the hour.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "xterraadam",
                                                                                    "body": "They found it was only 60% of required strength as designed.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "No-Hedgehog-677",
                                                                    "body": "Born an raised KC. I got a homeboy who's grandma was in that... My bad with my cousins neighbor story but the point is.. His family got low key rich from that settlement. He never had a job during HS, but 3 new cars from soph to sr yr and His mom and older bro got into real estate..",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "NinjaScenester",
                                                                    "body": "!Remindme 13 hours",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "ElReydelosLocos",
                                                                    "body": "My grandads brother died in that.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Techno_plague_fire",
                                                                    "body": "Inside? Well there's your problem. Bridges go on the outside of buildings. ",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "jesusismyupline",
                                                            "body": "mistakes were made at the hyatt, people were hurt",
                                                            "score": 12,
                                                            "replies": [
                                                                {
                                                                    "author": "bjeebus",
                                                                    "body": "Killed 114!  That's more than most airplane disasters! \n\nhttps://en.m.wikipedia.org/wiki/Hyatt_Regency_walkway_collapse",
                                                                    "score": 35,
                                                                    "replies": [
                                                                        {
                                                                            "author": "skelebone",
                                                                            "body": "It was the deadliest non-deliberate structural failure since the collapse of Pemberton Mill over 120 years earlier, and remained the second deadliest structural collapse in the United States until the collapse of the World Trade Center towers 20 years later.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "PGRacer",
                                                                            "body": "Teneriffe airport....hold my beer.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "jesusismyupline",
                                                                    "body": "[https://en.wikipedia.org/wiki/Hyatt\\_Regency\\_walkway\\_collapse](https://en.wikipedia.org/wiki/Hyatt_Regency_walkway_collapse)",
                                                                    "score": 10,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Faxon",
                                                            "body": "Others have posted what it was, but for those who don't want to read, or are not good at imagining things based on text, this video from Grady at Practical Engineering (as a guest video on Tom Scott's channel back when Grady was relatively unknown). Absolutely fantastic visual explanation of what happened https://www.youtube.com/watch?v=VnvGwFegbC8",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Ok_Palpitation_8438",
                                                    "body": "I'm glad I wasn't the only one",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "janart59",
                                                    "body": "Swindled did a great podcast on it.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "TerpZ",
                                                            "body": "so did Stuff You Should Know",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "copperwatt",
                                                    "body": "Well you have to go all the way along the whole length of the thread to find it... It would be easier if you could just go directly to the comment.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Channel250",
                                                    "body": "They used to beat these engineering failures into our skulls when I was studying for engineering. The whole course was basically how every failure is obvious after the fact, and it's *really* easy to kill people accidentally.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "tacoheadbob",
                                                    "body": "I got it and I agree, not many are going to understand it.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "BenFrankLynn",
                                                    "body": "Only engineers will remember. Oh, and Pepperidge Farms.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Capnmarvel76",
                                                    "body": "Grew up in KC, and hearing about the Hyatt Regency disaster this is one of my earliest memories. Crazy obscure reference.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Skylord1325",
                                                    "body": "I’m from Kansas City so immediately got the reference.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "CanadaJack",
                                                    "body": "I don't know what it's referencing, but I'm pretty sure I get it.  Hyatt hotels in the 70s probably had at least one collapse, of ceiling, roof, or entire building.  Or maybe the company itself had a collapse then. It's a structural joke!",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Ok-Nectarine7152",
                                            "body": "That was in '81.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "justArash",
                                            "body": "Yeah, he's a busy designer he didn't stay around for 3 years after construction started. High demand for his skills and whatnot",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Y_Y_why",
                                            "body": "Thank you. Well done.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Ashamed-Simple-8303",
                                            "body": "And bridges for Florida university.\n\nReading more about that bridge is shocking especially when you see the pictures a weekand days before the collapse and wonder why the fuck that bridge and road weren't' closed weeks before.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "0peRightBehindYa",
                                            "body": "I understood that reference.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "HurbleBurble",
                                            "body": "Early '80s, but yes.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "AvatarofSleep",
                                            "body": "And the slab drop ceilings in Boston tunnels",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "justArash",
                                            "body": "Nah he's too old school for epoxy",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "CreeepyUncle",
                                            "body": "Too soon?",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "GieckPDX",
                                            "body": "YESSSSS?...Arrrgh, FUCK! Sarcasm! Damn you to hell.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "redditmethisonesir",
                                    "body": "Or?",
                                    "score": 32,
                                    "replies": [
                                        {
                                            "author": "Fast-Reaction8521",
                                            "body": "No oversight ",
                                            "score": 21,
                                            "replies": [
                                                {
                                                    "author": "Mczern",
                                                    "body": "Well yeah that's why he's putting the bricks there for. So you can't see above it.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Excellent_Set_232",
                                            "body": "Video was filmed sideways \n\n/s",
                                            "score": 37,
                                            "replies": [
                                                {
                                                    "author": "sohidden",
                                                    "body": "Gravity works differently on his planet.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Forgot_Password_Dude",
                                                    "body": "Yea dude just has a lot of core strength",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "blender4life",
                                            "body": "LOL",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "MarceloWallace",
                                    "body": "This is very common roof in poorer areas. I grew up in house built like that, we even built a second floor on it later and it’s still standing to this day, I’m talking 30 years ago.\nIt’s old method of building but it works.",
                                    "score": 26,
                                    "replies": [
                                        {
                                            "author": "livestrong2109",
                                            "body": "Dude, this isn't a method at all. Bricks don't work the way he's stacking them even if there was mortar. This won't hold weight at all.",
                                            "score": 88,
                                            "replies": [
                                                {
                                                    "author": "MC-oaler",
                                                    "body": "There is some slight curvature in each section, so it might still hold even if someone steps on it.",
                                                    "score": 21,
                                                    "replies": [
                                                        {
                                                            "author": "TheClaws",
                                                            "body": "Here's the answer, everyone",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "MarceloWallace",
                                                    "body": "Im not making shit up take a look at [this](https://youtu.be/D0Mq0V-47hs?feature=shared)",
                                                    "score": 75,
                                                    "replies": [
                                                        {
                                                            "author": "Crowbar_Freeman",
                                                            "body": "Damn. Is there a secret technique to this or these bricks are just held by thoughts and prayers?",
                                                            "score": 20,
                                                            "replies": [
                                                                {
                                                                    "author": "OhMaiCaptain",
                                                                    "body": "It's a very shallow arch. When the camera in the OP video goes to the completed sections, you can see the minor arching. No mortar removes any extra leeway, allowing the bricks to support each other more firmly. \nBigger arches are more stable for more weight, as expected. But these also appear to work. \nThis is reminiscent of when I lived in Spain. Seeing some ways of construction there, I always thought, \"My daddy would beat my ass if I did that.\"",
                                                                    "score": 38,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "deij",
                                                            "body": "Interesting",
                                                            "score": 8,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Mazzaroppi",
                                                            "body": "That's just one video of them doing this the same way, doesn't mean it's normal or that it works.",
                                                            "score": 10,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "SirDigger13",
                                                    "body": "if you look closly. you see its slightly arched...",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "brando56894",
                                                    "body": "Tell me you don't know about *the compression force* without telling me you don't know about *the compression force*.\n\nPick up 4 books, put them between your hands, squeeze, and lift them up. How do the center books stay up?! Magic!",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Burninghoursatwork",
                                                    "body": "Yea, brick decks are a thing… I guess you just didn’t know before now.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "lX_HeadShotGunner_Xl",
                                    "body": "The issue is he's usually under his works when they collapse.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Dark_Wing_350",
                            "body": "It's not meant to be walked on, but it can handle pressure from like rain and whatnot, clearly an area that doesn't get snow.\n\nIf anything needed to be mounted to the roof (HVAC unit or something) they would run steel beams across the top and affix them to the structural beams and then bolt whatever needed to be held up there directly to the beams. Nothing will be directly resting on the bricks.",
                            "score": 22,
                            "replies": []
                        },
                        {
                            "author": "joanzen",
                            "body": "Even with rebar and cement in the holes making sturdy rows, you'd still have the rows wanting to detach from each other, so there's no way this is a structural design by itself.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Noname666Devil",
                                    "body": "This really makes me question the structural integrity of walls in general. Nothing is stopping pressure on its plane from knocking it over.",
                                    "score": 0,
                                    "replies": []
                                },
                                {
                                    "author": "joanzen",
                                    "body": "Well this is why you don't want much horizontal load on a wall. \n\nEven with the vertical weight holding things in place walls are still not built well for thieves bonking cars and other stuff into them.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "brando56894",
                            "body": "When it's tightly fitted together it can withstand a lot of load. Next time you see a stone archway look at the top dead center, that piece will tend to look different and is called a *key stone*. It's pretty much a wedge that will exert a force on the other stones, locking them in place. There's no *actual* key stone here, but the last one he puts into the frame acts as one.",
                            "score": -1,
                            "replies": []
                        },
                        {
                            "author": "Haulie",
                            "body": "Apart from the lack of a keystone, it's also not a fucking arch, my guy.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "torklugnutz",
                            "body": "There is a slight arch held in compression by the metal bars.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Tigertail5000",
                    "body": "that just unlocked some childhood memories for me",
                    "score": 132,
                    "replies": [
                        {
                            "author": "mgr86",
                            "body": "They still make the game. Though my kids broke the hammer the second day 🤷🏻‍♂️",
                            "score": 60,
                            "replies": [
                                {
                                    "author": "ButtFuzzNow",
                                    "body": "Shit just ain't made like it used to be. Even the ice is easier to break",
                                    "score": 42,
                                    "replies": [
                                        {
                                            "author": "KwordShmiff",
                                            "body": "Global warming",
                                            "score": 59,
                                            "replies": [
                                                {
                                                    "author": "Level9TraumaCenter",
                                                    "body": "No it's a direct result of work from home policies.",
                                                    "score": 23,
                                                    "replies": [
                                                        {
                                                            "author": "darkest_hour1428",
                                                            "body": "All those noisy cancer-causing windmills steal jobs from hard-working oil-chugging Americans!",
                                                            "score": 18,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "rwhop",
                                                    "body": "Gave me a good morning lol there",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Apocolypse007",
                                    "body": "Don't break the hammer",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Tigertail5000",
                                    "body": "Sounds about right lol",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "KeX03",
                                    "body": "Because of that comment I've just lost the game",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "catwiesel",
                                    "body": "had the game as a kid. those hammers were plastic, but rock solid. no flex in them. plenty of material, like a t girlder built. solid.\n\nthe game was great but got lost. so i looked for it for my kids. found the new version. those hammers are flimsy. so much flex. I dont think they used much less material but the form is just bad...\n\n:(",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "KaerMorhen",
                            "body": "Same, I played that game so much when I was a kid and I haven't thought about that game for years. Forgot it even existed",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Enge712",
                            "body": "I play it so much with my younger kid we put either all the blocks or alternate blocks upside down to make it harder",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Channel250",
                            "body": "Man a lot of games were like that. \n\nDon't Break The Ice\n\nDon't Wake Daddy\n\nDon't Whizz On The Electric Fence.\n\nGame designers have some weird hang ups",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "chilehead",
                            "body": "Imagine if real people delivered electrical shocks when certain parts of their organs are touched with scalpels.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "GieckPDX",
                            "body": "Boo. BOO...God Dammit.",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "Tigertail5000",
                            "body": "...what?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "GieckPDX",
                            "body": "I’m not trying to hear that, see?",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "Tigertail5000",
                            "body": "no? you're not making any sense here..",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "GieckPDX",
                            "body": "Whoosh.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "john_the_fetch",
                    "body": "Yes! I was coming here to say \"dude played don't break the ice\"",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ViolentCroissan1",
                    "body": "I used to watch a game show on Toggo Tv as a kid (it's a german tv show for kids) where they would play games like that, blue vs red.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Rare_Register_4181",
                    "body": "Took me years to figure out how my older brother cheated. I couldn't manage to put the game back together but he could, so he would feel around for the easy blocks and save them for the end.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "xodarkstarox",
                    "body": "God this game was so fucking hard to setup, I remember having the hardest fucking time getting all the blocks into the grid, and I had SUCH A GOOD TIME PLAYING for like 2 minutes and then it was back to placing the fucking bricks",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Foreplaying",
                    "body": "Yeah, you'd be surprised how strong this potentially could be.\n\nThere are structures built with the bricks curved into an arch and even without mortar that are still standing today. The more weight on top actually makes it stronger. \n\nHere's a classic example of just that. \nhttps://www.britannica.com/topic/Segovia-aqueduct\n\nI don't think this is as well put together, but the principle still should work the same - there's a noticeable concave when it shows the previous sections near the end of the clip.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "_Colonal_Mustard_",
                    "body": "Came to say the exact same thing 😅 if one goes, they'll all go",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "namesyeti",
                    "body": "That was my jam! Still undefeated",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "smprandomstuffs",
                    "body": "So weird I just looked at the footage of the new upcoming battlefield game and they're jumping on boxes that you can shoot out and I said out loud Oh don't break the ice and then thought no ones going to remember that game..... Also you are old",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "GieckPDX",
                    "body": "Double Boo.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "FaceroII",
                    "body": "Reminds me of the clip with the kid breaking all at once",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ALonelyWelcomeMat",
                    "body": "Lmao yes. My kid loves that game",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Nosferatu13",
                    "body": "THROOOOWBAAACK! Damn that one took me.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "pdxrains",
                    "body": "Yeah this looks like a pretty sus construction technique. You gotta make that shit arch if you’re gonna do that.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "buscemian_rhapsody",
                    "body": "I had the exact same thought.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "carolina_red_eyes",
                    "body": "it cracks me up how posts like this rise to the top. You guys are a bunch of fucking nerds.",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "davidcwilliams",
                    "body": "what do you mean?",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "hotinhawaii",
            "body": "This is going to be one of those videos from a wedding where everyone is jumping up and down dancing at the same and the floor gives out and they all crash to the floor below. Homie is playing the long game here.",
            "score": 4613,
            "replies": [
                {
                    "author": "Suttonian",
                    "body": "Except instead of everyone jumping, a bird lands on it and it collapses",
                    "score": 1182,
                    "replies": [
                        {
                            "author": "Joker-Smurf",
                            "body": "Someone farts nearby and it’ll collapse.",
                            "score": 223,
                            "replies": [
                                {
                                    "author": "Tamer_",
                                    "body": "Bruce Willis was dead at the end of 6th sense and it’ll collapse.",
                                    "score": 77,
                                    "replies": [
                                        {
                                            "author": "UsualPuzzleheaded179",
                                            "body": "wtf spoilers",
                                            "score": 44,
                                            "replies": []
                                        },
                                        {
                                            "author": "MouseRat_AD",
                                            "body": "And I jizzed in my pants.",
                                            "score": 24,
                                            "replies": [
                                                {
                                                    "author": "Meatseeker",
                                                    "body": "I see lonely island I upvote. Simple",
                                                    "score": 14,
                                                    "replies": [
                                                        {
                                                            "author": "DarkAbyss666",
                                                            "body": "A breeze rolls in and...it collapses",
                                                            "score": 5,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "iWasAwesome",
                                                            "body": "What you think I am? A charity case? I took your upvote and THREW IT ON THE GROUND!",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "RCx_Vortex",
                                                            "body": "Of course you were attracted to him jizzing, with a name like that",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Inner-Heron0033",
                                            "body": "Lmao wtf, I like the way you think",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "Tamer_",
                                                    "body": "I don't have credit: https://www.youtube.com/watch?v=VLnWf1sQkjY",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "dr1fter",
                                            "body": "You guys really shouldn't even have talked about it, now you're responsible too.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "lueckestman",
                                    "body": "No that makes you lighter!",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "greenrangerguy",
                            "body": "and instead of the whole bird it's just a feather",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "OderWieOderWatJunge",
                            "body": "A hummingbird",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "cykbryk3",
                            "body": "LOL",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "fishman1287",
                    "body": "https://youtu.be/HMUDVMiITOU",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Full_FrontaI_Nerdity",
                            "body": "Thanks, now people are staring at me cuz I can't stop laughing, even though the vid is on mute. How did I miss this one? 😂",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "fishman1287",
                            "body": "Ha. It is a great music video",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "exipheas",
                            "body": "Someone should edit that into a boner pill comercial.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "pimpmastahanhduece",
                    "body": "\"It should've been me!\" to nth degree.",
                    "score": 26,
                    "replies": []
                },
                {
                    "author": "DarthDregan",
                    "body": "The most cunningly indirect serial killer of all time.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "conquer69",
                            "body": "Seems pretty direct to me.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "norwegian",
                    "body": "Gonna take lot less than multiple people jumping up and down. Maybe just rain.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "hatecriminal",
                    "body": "That's because he's set to inherit when his older brother and his entire family die in the collapse. King Ralph style.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TeslasAndComicbooks",
                    "body": "First thing I thought as well.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Hootnany",
                    "body": "What do you mean one of those, how many has this happened ?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TrollingForFunsies",
                    "body": "Like this one?\n\nhttps://www.youtube.com/watch?v=8d4ul3IWoSg",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "gscience",
                    "body": "You mean like in this instance? https://youtu.be/dQw4w9WgXcQ?si=87yw9fzaA7Zvqqvz",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ADIDAS247",
                    "body": "He’s betting on it happening during his ex-wife’s wedding to his brother. The affair hasn’t happened yet, nor has he even met his wife yet, but he’s nothing if not prepared.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Eglitarian",
                    "body": "[for the uninitiated](https://en.m.wikipedia.org/wiki/Versailles_wedding_hall_disaster)",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "PsyOpBunnyHop",
                    "body": "https://www.youtube.com/watch?v=NPMscZJIjzY",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "PsyOpBunnyHop",
                    "body": "Here it is without your tracking tag: https://youtu.be/S7Ab7U6lcgQ",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "SaneYoungPoot2",
                    "body": "Whoops lol. I'll delete mine",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mekelaxo",
            "body": "Bro thinks he's in Minecraft",
            "score": 1174,
            "replies": [
                {
                    "author": "ZenkaiZ",
                    "body": "I feel like this is how Bowser sets up some levels with random falling tiles.",
                    "score": 146,
                    "replies": []
                },
                {
                    "author": "JeremyR22",
                    "body": "...and is building a Spleef map...",
                    "score": 29,
                    "replies": []
                }
            ]
        },
        {
            "author": "Graffers67",
            "body": "The flooring tiles will hold that together, smart work right there.",
            "score": 1432,
            "replies": [
                {
                    "author": "JacquesBlaireau13",
                    "body": "...until the next earthquake hits.",
                    "score": 188,
                    "replies": [
                        {
                            "author": "Tamer_",
                            "body": "Job guarantee, I don't see the problem here.",
                            "score": 86,
                            "replies": [
                                {
                                    "author": "JacquesBlaireau13",
                                    "body": ">don't see the problem\n\nThe Feb. 6, 2023 earthquakes in Turkyie and Syria killed over 59,000 people and caused over $150B in damage.\n\nYou must be a Republican.",
                                    "score": -44,
                                    "replies": []
                                },
                                {
                                    "author": "Tamer_",
                                    "body": "It... It was a joke Jack... No need to Badger me about it.",
                                    "score": 11,
                                    "replies": []
                                },
                                {
                                    "author": "JacquesBlaireau13",
                                    "body": "I've used this name for 12 years, and you, Great Redditor, are the first to figure it out.\n\nWell done.",
                                    "score": -9,
                                    "replies": []
                                },
                                {
                                    "author": "davidcwilliams",
                                    "body": "That’s insane. It took me a while just to figure out what the connection was at all.\n\nhttps://www.alamy.com/badger-or-le-blaireau-detail-from-engraving-created-in-1700s-for-french-naturalist-georges-louis-leclerc-comte-de-buffon-1707-1788-from-a-drawing-by-french-wildlife-artist-jacques-henri-e-de-sve-fl1742-1788-the-engraving-appeared-in-buffons-influential-work-on-natural-history-the-36-volume-histoire-naturelle-gnrale-et-particulire-published-between-1749-and-1788-this-illustration-later-coloured-by-hand-comes-from-the-rare-1780-french-edition-of-the-histoire-image345496343.html",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "ghostfacestealer",
                                    "body": "r/whoooosh",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "thiosk",
                            "body": "thats sounds like a problem for the buyer",
                            "score": 16,
                            "replies": []
                        },
                        {
                            "author": "ilovemelongtime",
                            "body": "Or a light rain",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "KonigSteve",
                            "body": "If by earthquake you mean til the next slightly heavier than average person walks through then sure.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "livens",
                    "body": "As long as you stagger the seams of the tiles and those bricks it'll hold.",
                    "score": 59,
                    "replies": []
                },
                {
                    "author": "Weldobud",
                    "body": "lol. Made me laugh. \n\nWait …. What if lays them East-west instead of north-south - will that work?",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "ReflexSave",
                    "body": "Actually, this construction is going to be relying on load-bearing carpet for most of the structural support. Close guess though!",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "phoenix5irre",
                    "body": "How will they install the flooring tiles...?",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "xBHL",
            "body": "People do this and then wonder why their whole city collapses from a minor earthquake",
            "score": 1127,
            "replies": [
                {
                    "author": "Waiting4The3nd",
                    "body": "Minor Earthquake? That shit looks like it'd collapse if Fat Albert went \"Hey, Hey, Hey!\" just a little too enthusiastically.",
                    "score": 694,
                    "replies": [
                        {
                            "author": "Raccoon_Expert_69",
                            "body": "Holy shit 🤣",
                            "score": 60,
                            "replies": [
                                {
                                    "author": "randynumbergenerator",
                                    "body": "He possesses the knowledge of the Ancient Ways!",
                                    "score": 11,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "redbeard8989",
                            "body": "That shit looks like it’d collapse if OPs mom logged into Reddit and saw it.",
                            "score": 38,
                            "replies": []
                        },
                        {
                            "author": "xubax",
                            "body": "What are you who are so wise in the ways of Faticus Alberticus?",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "read-my-comments",
                            "body": "Yeah yeah yeah gonna have a good time.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Cicer",
                            "body": "Core memory unlocked",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Delayed_Wireless",
                            "body": "OK this got me to spit my coke zero 🤣",
                            "score": -2,
                            "replies": []
                        },
                        {
                            "author": "floog",
                            "body": "Or just Albert, clocking in at a buck twenty.",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "DeathPercept10n",
                            "body": "Lmfaooo",
                            "score": -1,
                            "replies": []
                        },
                        {
                            "author": "Crackimus",
                            "body": "🤣",
                            "score": -2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "The_Submentalist",
                    "body": "They don't wonder that at all. It's not even a secret. \nTurkey does something no other country does afaik and that is called *development amnesty bill* (imar barışı). It means construction that is illegally built is going to be legal. \n\nThis bill has been passed 8 times or more since the 90's. \nSo developers don't fear anything. \n\nWhen your country is corrupt to the bone, rich people have nothing to fear. \n\nPoor people that die? Well tell them that the Dünya (this world) is a place for trial and tribulations and the ones who passed away in earthquakes are martyrs. That'll do and all be fine.",
                    "score": 48,
                    "replies": [
                        {
                            "author": "Grabsch",
                            "body": "Construction is probably the most lucrative way to funnel money from a state to your family and friends. Overpay the contract and let them save with everything: taking sand from the beach for their concrete and saving big. No repercussions when people inevitably die.",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "The_Submentalist",
                                    "body": "Exactly. In Turkey there is also another way Erdoğan and his sycophants make bank. In the construction contact they put a clausule where there is a threshold that needs to be reached or else there is financial compensation for the company. \n\nFor example: the developer builds a bridge on condition where ten million cars need to pass it annually. If that threshold is not going to be reached, that company is going to be compensated. \n\nIt's never going to be reached so the government is paying huge amounts of money every year to that company who in return gives Erdoğan a cut. \n\nMany projects like this exist with the airport in bumfuck nowhere being the cherry of the cake.\n\nAdvanced corruption.",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "orincoro",
                            "body": "Jesus. There’s corruption and there’s that. What kind of idiocy is this.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "The_Submentalist",
                                    "body": "Well, Let me introduce you to the newborn gang consisting of doctors, nurses and other health professionals. \n\nNew parents that just got a newborn **healthy** baby are being told that they are sick and in need of expensive treatment. To speed things up, they need to pay a huge amount of money. Babies have died because of unnecessary treatment. \n\nhttps://www.aljazeera.com/news/2024/12/2/who-are-turkiyes-newborn-gang-and-why-are-they-on-trial\n\nTurkey is a failed state. Don't expect anything other than misery in the next decade.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TobysGrundlee",
                    "body": "Just think of how much time and expense the owner saved by not requiring any of those commie inspections and permits though.",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "orincoro",
                    "body": "I don’t think they wonder.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "MildlyAmusedMars",
                    "body": "A malnourished toddler falling over would  cause this to collapse not to mind an earthquake",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "showyourteeth",
            "body": "Structural engineer here, reporting for duty! This is called terra cotta flat arch construction, and was actually pretty common up until the 1950s when reinforced concrete and steel deck became more widely used. Lots of old buildings in NYC with this construction type. It's what it looks like - the clay tiles are wedged between steel beams and usually covered with some sort of concrete floor slab. \n\nhttps://oldstructures.com/2022/02/07/equitable-specs-floor-arches/",
            "score": 1396,
            "replies": [
                {
                    "author": "and_i_mean_it",
                    "body": "And if you look closely, the tiles are actually placed in arch, so the compression is actually holding them together. You can see above the metal beam, underneath the first row, he used cement to make the \"guide arch\", and the following rows are placed in a similar manner.",
                    "score": 197,
                    "replies": [
                        {
                            "author": "GieckPDX",
                            "body": "Yes. Tell me more please. So tired, must sleep sometime.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Bigr789",
                    "body": "I feel like I just got taken back to 2012 reddit with this well informed and professional comment... take me back...",
                    "score": 401,
                    "replies": [
                        {
                            "author": "DoingCharleyWork",
                            "body": "The one they linked is absolutely not what the op video is. \n\nYour comment takes me back to every day on this site where someone sees a comment that states something confidently and all the dinguses eat it up. Even though the link they provided proves that this guy isn't doing what they are talking about.",
                            "score": 184,
                            "replies": [
                                {
                                    "author": "DifGuyCominFromSky",
                                    "body": "The article looked correct to me. The first picture you see in the article is a crosscut of what the tiles look like when completed. By having them arrange in an arch the compression of the bricks is what holds them together and makes it stronger. The article mentions at the very end that old New York buildings built using this technique can hold 400psf even though most buildings were built in the late 1800’s which only required 100psf at the time. So when done properly this is actually a legit way to build a floor.",
                                    "score": 21,
                                    "replies": [
                                        {
                                            "author": "DoingCharleyWork",
                                            "body": "You need to get your eyes checked if you think the link in that picture remotely looks like the op video. \n\nBrick doesn't squish and change shape either lmao.",
                                            "score": -9,
                                            "replies": []
                                        },
                                        {
                                            "author": "rvgoingtohavefun",
                                            "body": ">Brick doesn't squish and change shape either lmao.\n\nWhat are you trying to say here? Do you think that by \"compression\" they mean that the bricks change shape?",
                                            "score": 8,
                                            "replies": []
                                        },
                                        {
                                            "author": "DoingCharleyWork",
                                            "body": "No I'm saying you guys should read the article in the parent comment. This shit wouldn't even be a discussion if you all just read the damn article they linked.",
                                            "score": -2,
                                            "replies": []
                                        },
                                        {
                                            "author": "rvgoingtohavefun",
                                            "body": "I did. You're saying that bricks don't squish and change shape.\n\nWho said they did? What in the actual fuck are you talking about?",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "DoingCharleyWork",
                                            "body": "Maybe try reading the article a little slower. And then read the comments again.",
                                            "score": -1,
                                            "replies": []
                                        },
                                        {
                                            "author": "rvgoingtohavefun",
                                            "body": "Like I said, I read it and you're talking about bricks not being compressible for some reason.\n\nEnlighten us all as to why you're talking about how bricks don't compress or squish.\n\nPointing at the article and saying \"I'm right because I read the article\" is not how arguments work. What in the article, is specifically related to the compressibility of bricks or leads you to the conclusion that the two construction methods are unrelated?",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "Bigr789",
                                            "body": "He won't even tell me what his favorite dinosaur is, he is a coward",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Tinkerer0fTerror",
                                            "body": "And you should adjust your attitude.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Bigr789",
                                    "body": "What is your favorite dinosaur :3",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "DoingCharleyWork",
                                            "body": "I enjoy each dinosaur equally as Kier would expect.",
                                            "score": 18,
                                            "replies": [
                                                {
                                                    "author": "Bigr789",
                                                    "body": "Answer the question or I'm gonna let the beast in me out to play... And he doesn't mess around",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "why_not_rmjl",
                                                            "body": "Lmao this exchange has my dying 🤣",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "CommodoreFresh",
                                                    "body": "Too soon. I'm still frustrated at that last episode.",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Nova35",
                                                    "body": "The normal amount",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "bikenvikin",
                                            "body": "chicken nuggets",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Konayo",
                                    "body": "Maybe they are gpt4o and not structural engineer after all \\[insert crying emoji; can't do it because it turned out the emoji keyboard extension contains malware so I had to uninstall it - thanks for reading\\]",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Wolfgang985",
                                    "body": "Yes it is. You just missed the angle shown near the end of OP's video. \n\nMight want to revisit this comment 😂",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "DoingCharleyWork",
                                            "body": "If you're talking about the end of the video where the bricks are layed in a different direction and have very little angle to them, then no I did not miss it. \n\nLook at the picture in the link and looks at the bricks in the op video. \n\nMight want to revisit preschool education where you learn shapes 😂",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "Wolfgang985",
                                            "body": ">and have very little angle to them\n\nYep, and that's all you need to see. \n\nJust say you're ignorant and don't understand what's being discussed here. It's not difficult.",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "DoingCharleyWork",
                                            "body": "Dog just say you can't read if you can't read.",
                                            "score": -1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Wolfgang985",
                                            "body": "Rich coming from the Neanderthal who still doesn't understand load distribution 😂",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "DoingCharleyWork",
                                            "body": "😂 whatever makes you feel better about not being able to read.",
                                            "score": -2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "hexeir",
                                    "body": "It quite literally is the same thing. The illustration is exaggerated to show the concept.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "DoingCharleyWork",
                                            "body": "Try reading the article. There's more than one picture.",
                                            "score": -2,
                                            "replies": []
                                        },
                                        {
                                            "author": "Bigr789",
                                            "body": "[Try reading the article. There's more than one picture.](https://imgur.com/a/PAQpuBl)",
                                            "score": 0,
                                            "replies": []
                                        },
                                        {
                                            "author": "DoingCharleyWork",
                                            "body": "You're almost there chief. I still have faith in you. \n\nI could explain how different shapes exist if you need me to.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "cballowe",
                            "body": "For a second, I doubted you, but you have indeed been here since 2012... I think we'd all go back if we could!",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "bautofdi",
                            "body": "More like 2007",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Arenyr",
                    "body": "In the link you provided it shows the clay tiles having an angle but his appear to be completely straight.. does that not cause any issues?",
                    "score": 117,
                    "replies": [
                        {
                            "author": "takenwithapotato",
                            "body": "When the camera pans to the completed areas, I did see a small kind of arch which made sense when I saw the above comment. Also explains how it holds together since it would be pushing against the steel like a bridge.",
                            "score": 147,
                            "replies": [
                                {
                                    "author": "TricoMex",
                                    "body": "I missed that the first time. Yeah, there's an arch, wedged between the steel frame in sections. That's pretty neat.",
                                    "score": 32,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ieraaa",
                            "body": "They have an angle, the last one you see very clearly. It made me scroll to see the context because I didn't think this man was doing this at random. And he didn't",
                            "score": 23,
                            "replies": []
                        },
                        {
                            "author": "ElReyResident",
                            "body": "Would have taken you half the time you \nspend writing this comment to just rewatch the video and notice the obvious arch in the brink.",
                            "score": 11,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "neotokyo2099",
                    "body": "Wait are you implying that this guy who clearly looks like he's been doing this a LONG fucking time might know more about his job that random redditors?",
                    "score": 202,
                    "replies": [
                        {
                            "author": "Haasts_Eagle",
                            "body": "Maybe he has only built one roof. But he looms so well practiced because it keeps falling down over and over and over.\n\n/s",
                            "score": 14,
                            "replies": []
                        },
                        {
                            "author": "davasaur",
                            "body": "That's crazy talk.",
                            "score": 31,
                            "replies": [
                                {
                                    "author": "KungFlu81",
                                    "body": "😆",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "iconofsin_",
                            "body": "Doesn't help that all we're seeing is a short clip of an obviously longer process that's also not showing the final result.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "TunaOnWhiteNoCrust",
                            "body": "Are you telling me that you can tell this guy has been doing this for a LONG time too? Simple physics will answer that for you and it will crumble",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Mean_Occasion_1091",
                            "body": "people that make this type of comment in every thread and think they're better than the average redditor are ironically the most insufferable redditors",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "SweetNeo85",
                                    "body": "I'm the smartest redditor of THEM ALL.",
                                    "score": 13,
                                    "replies": []
                                },
                                {
                                    "author": "KEEPCARLM",
                                    "body": "Not really though is it. Because he isn't saying he knows better, just that he knows to shut up and not comment on a subject he doesn't know much about.\n\nRedditors are famously good at making bold assumptions about subjects they have no knowledge in.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "not_so_plausible",
                                            "body": "Reading comments from people on topics that involve my career (privacy) has cause me to doubt almost every comment I read on here.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "InferiousX",
                                                    "body": "Same. I used to think there were a ton of smart people on here until I came across something that I knew a fair bit about and realized a lot of the high comments were just completely wrong.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Mean_Occasion_1091",
                                            "body": "he's picking a side just like everyone else is\n\nhe's implying everyone else is stupid or gullible for not trusting an 'expert' from a 3rd world country and someone who's claiming they're a structural engineer on reddit but are posting an illustration of something different than what's in the video\n\nin reality the majority of people who are saying that construction method is shit may be right, and the self proclaimed experts could be wrong",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "transeunte",
                                    "body": "lol I seriously doubt they're more insufferable than all the regards here calling this guy a moron",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "EverMoar",
                                    "body": "Every thread is overboard, but it’s a good reminder to remember we are in an echo chamber. This shit is bad for us (social media) and it’s a serious issue.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "pmcall221",
                    "body": "I hope you are right but I didn't see any skews or keys.",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "Segundo-Sol",
                    "body": "ngl I thought this was gonna end with Mankind plummeting 16 ft through an announcer's table",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "PandaXXL",
                    "body": "The roof in this video looks much less secure than what is shown in the article.",
                    "score": 22,
                    "replies": [
                        {
                            "author": "Bigr789",
                            "body": "Teach me your ways oh wise redditard, how do I become as informed as you in the ways of knowing *everything*",
                            "score": -22,
                            "replies": []
                        },
                        {
                            "author": "PandaXXL",
                            "body": "You lonely bud?",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Bigr789",
                            "body": "What is your favorite transformer?",
                            "score": -6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TheHorrorAbove",
                    "body": "Did anyone's stop mid paragraph and think this was a shittymorph comment because ot the writing style? I was almost positive I was being set up..",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "gooblefrump",
                    "body": "What's your thoughts on there not being a full schmear of mortar between the bricks?\n\nAt one point he just dabs a bit on with his hand. Would that be enough?\n\nI have no idea about this",
                    "score": 5,
                    "replies": [
                        {
                            "author": "DoingCharleyWork",
                            "body": "The one they linked are bricks that are interlocked at angles. The op video is definitely not the same.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MysticalVictrix",
                    "body": "Also a structural engineer here. doesn't look like these tiles are the same as in the video. There's longer span between the cross beams so ther's no way that these tiles would sufficently wedge themselves against the beams to withstand any meaningfull load. These are probably the roof of the building so there would not be that much load, but I personally would not trust these alone to hold anything, even if there's a concrete floor slab on top of them.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "TeosPWR",
                    "body": "This form of arch ceiling was also common in stables in Northern Europe, my house has this, it lasts around 100 years, I hvae yad ro replace some of it due to slipping (basically the I beams was rusted away)",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "laihipp",
                    "body": "that's great, we also used to use lead in our gas\n\nso the real meaningful question, would you be willing to have your own family live in a building made in this manner?",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "baccalaman420",
                    "body": "Is it safe?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "kingslayerer",
                    "body": "Is it safe enough to walk on top of that or is it just for roofing purpose?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Mahringa",
                    "body": "This was still common to do a few centuries ago where I live (a place with almost no earthquakes or very very weak ones). If it was built correctly it is no problem at all. But today it was replaced by concrete as well as it is a faster and better way. \nI think some people do not understand that almost all old buildings are probably built from briks entirely, or even just wood and wodden supports.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Kraymur",
                    "body": "Not sure of the specifics but it looks to me to be a Madras roof (again not sure if that's a different term for the same thing but anyways) they're designed somewhat like this and are usually ever so slightly sloped to allow rainwater to run off. The brick / mortar / terracotta let the building cool more naturally so they're used more often in warmer climates.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "FriggenChiggen",
                    "body": "Yep, also a structural engineer, we have a lot of historical buildings constructed this way in northeast PA. From historical data I’ve been able to find, it holds a surprising amount of weight, but I do hate when clients get some fun renovation ideas in these buildings. I tend to avoid any/all modifications to them when they pop up.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "yaten_ko",
                    "body": "Now that you pointed it out I kinda se the arching, wouldn’t it be easier to use… I don’t know the word in English, the wood mold below, cimbra",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Otherwise_Hat7713",
                    "body": "I had to scroll way too long for this post...",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "mikakela",
                    "body": "ye accept theres no \"skewed\" cross section on the blocks hes placing, so this isnt the case. The blocks hes placing have rectangular cross section.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "nofatnoflavor",
                    "body": "Why isn't this the top comment, FFS?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "lordofduct",
                    "body": "The stuff I like to ask myself when I see things like the videos are:\n\n1. Does the person in the video look to be following a trade method rather than just some schmoe doing mad stuff? If so, does that tradesman possibly know something my dumbass might not know?\n2. I can imagine a world before modern technologies. What did they do before the days of modern things like... reinforced rebar and the sort.\n\nFor example I was recently in DUMBO/Brooklyn in an office for a video game dev group called 'GUMBO'. The office is in an old building and while there I was just staring at the ceiling and everyone around me was like \"what do you keep looking at?\" And I would point at the way the ceiling (floor above) was held up and how interesting it was. You can see it in some of these pics:\n\n[https://gumbonyc.org/about](https://gumbonyc.org/about)\n\nAnd the work is very similar to what you just linked above. So yeah, spot on (of course, you're a structural engineer... you know more than me about this)!\n\nAnd sure, in the video the arch is less pronounced. But from the background it looks like a region that is more arid. These people have been probably building with mud/brick work for MUCH longer and they likely have refined their techniques more. I can see an arch, just much less pronounced... which considering this is likely how they have built there for ages (likely removing the steel supports and replacing with some older technology), they probably know what they're doing to optimize that arch. Where as that NYC structure was much more commodified/streamlined for a set of workers in a time period/region less used to working with the same materials on a master level (they were literally throwing up these buildings at mad speed in NYC... your labor force was while skilled was likely less so than some master brick layer from a region that ONLY has bricks).",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Bucser",
                    "body": "Rather than the 5 witty comeback this should be the top comment on this thread.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Smell_My_Cannoli",
                    "body": "get this to the top!",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "UniquelyIndistinct",
                    "body": "Okay! I'll use my upvote!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "PmMeYourMug",
                    "body": "There's no arch here Mr engineer. They have what you're referring to in Barcelona, and it looks totally different.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "clippervictor",
                    "body": "So are you telling me this puts to shame all the redditors here talking out of their asses?",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "qpv",
                    "body": "Ahh very cool.  I thought I could see an arch to the form and was wondering if this would be the case.  Super interesting thanks for the link.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "jezwel",
            "body": "Barrel vaulted ceiling, fairly common in Mediterranean locales.  In this case the arch is pretty damn low though.\n\nHere's an example\n\nhttps://www.dezeen.com/2014/03/01/casa-tomas-vaulted-brick-ceilings-barcelona-apartment/",
            "score": 37,
            "replies": []
        },
        {
            "author": "SippinOnHatorade",
            "body": "“INCOMING MORTAR”\n\n“What, like artillery?”\n\n“No, the fucking CEILING!”",
            "score": 30,
            "replies": []
        },
        {
            "author": "The_Stockholm_Rhino",
            "body": "Is this a gag/fake video of some sort? It can’t be real real, right??\n\n’cause one man’s flor is another man’s ceiling…",
            "score": 139,
            "replies": [
                {
                    "author": "Cicer",
                    "body": "It’s real just don’t walking on it or hang any lights from it. You know what just don’t even look at it. ",
                    "score": 67,
                    "replies": [
                        {
                            "author": "panamaspace",
                            "body": "Can I stand _under_ it?",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "lupercal1986",
                                    "body": "If you get there quick enough, you can stand under it at least once!",
                                    "score": 21,
                                    "replies": []
                                },
                                {
                                    "author": "Drostan_S",
                                    "body": "Oh most CERTAINLY not.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Banana7273",
                                    "body": "just don't hit your head on the ceiling or blow at it, I think",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "cates",
                                    "body": "no",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Ipsider",
                    "body": "In the finished area you can see the arch. I bet it’s solid. The beams are holding the arch in place",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Jaded_Celery_451",
                    "body": "In the last shot you can see they have an arch to them. I can't imagine this is the best way to build them, but they'll be stronger than they look.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "chaindrop",
                    "body": "It's just an art installation about the fragility of human life.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Ylsid",
                    "body": "It looks sketch, but an engineer posted a great comment about it\n\nhttps://old.reddit.com/r/WTF/comments/1j6txxa/trust_himhe_knows_that_stuff/mgs31w5/",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "c4chokes",
                    "body": "Yeah I couldn’t believe it either 🤷‍♂️",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CuddlyWuddly0",
            "body": "He's building the walls horizontally first, so it dries faster in the sun. Later he will out them upright. Smart.",
            "score": 446,
            "replies": [
                {
                    "author": "fredlllll",
                    "body": "has someone told him he can also do that on a table and the walls will not have a bend in them?",
                    "score": 243,
                    "replies": [
                        {
                            "author": "JakeEaton",
                            "body": "Or just build them normally because the sun is only overhead once in the day, and will warm them from either side throughout the day…and also not have a bend.",
                            "score": 159,
                            "replies": [
                                {
                                    "author": "DA_ZWAGLI",
                                    "body": "Real walls have curves.",
                                    "score": 84,
                                    "replies": [
                                        {
                                            "author": "CactusCait",
                                            "body": "They are mini arches that perfectly hold the bricks in place   /s",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "slamdanceswithwolves",
                                                    "body": "A triangle is the strongest shape so… I don’t know… fuck it, dude.",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "BanginNLeavin",
                                                    "body": "Who's electrifying the bricks?",
                                                    "score": -2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Skruestik",
                                            "body": "[Some really do.](https://en.wikipedia.org/wiki/Crinkle_crankle_wall?wprov=sfti1)",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Dioxybenzone",
                                            "body": "Another [Crinkle Crankle](https://en.m.wikipedia.org/wiki/Crinkle_crankle_wall) fan I see",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": -4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "gazow",
                    "body": "The amount of people thinking you're serious is concerning",
                    "score": 110,
                    "replies": [
                        {
                            "author": "OddHeybert",
                            "body": "Still not as concerning as standing under that \"roof\"",
                            "score": 18,
                            "replies": []
                        },
                        {
                            "author": "slamdanceswithwolves",
                            "body": "They might be simultaneously serious and wrong",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Cicer",
                                    "body": "Seriously confidently wrong. ",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "leeps22",
                            "body": "This is why we can't have nice things",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "hbomberman",
                    "body": "Yeah he'll just pick em up and stand them up properly later. Easy stuff",
                    "score": 4,
                    "replies": [
                        {
                            "author": "randynumbergenerator",
                            "body": "Easy with a long enough lever, in this case a kilometer long one ought to do it.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "hbomberman",
                                    "body": "Ok Archimedes",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "thenoblenacho",
                    "body": "The orientation of that I-Beam says you're fuckin with me",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 12,
                    "replies": [
                        {
                            "author": "BanginNLeavin",
                            "body": "The word gullible isn't in the dict... You know what nevermind.",
                            "score": 19,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "UltimateToa",
                    "body": "Surely there's some sort of structural compromise by it not being supported well during the drying process",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "welcomefinside",
                    "body": "You forgot /s",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "gstormcrow80",
                    "body": "Except they are not straight. They are arched up against the pull of gravity and will collapse quickly. This guy did not suddenly discover a better way to build something that had been missed for all of human civilization.",
                    "score": 0,
                    "replies": []
                },
                {
                    "author": "No-Edge3406",
                    "body": "U got a link to or source to him putting them up right?",
                    "score": -7,
                    "replies": []
                },
                {
                    "author": "nater255",
                    "body": "He's making a joke and you missed it.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Miseryy",
                    "body": "The smartestester",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "CokeEhCola",
                    "body": "Urmm. That's not how you do precast tilt panel construction",
                    "score": -5,
                    "replies": []
                }
            ]
        },
        {
            "author": "stone_henge",
            "body": "Just a guy building a sturdy apartment complex directly on top of a fault line in Turkey, nothing to see here.",
            "score": 11,
            "replies": []
        },
        {
            "author": "Chiryou",
            "body": "If it works with Lego",
            "score": 33,
            "replies": []
        },
        {
            "author": "roger_27",
            "body": "What country is this lol",
            "score": 23,
            "replies": [
                {
                    "author": "read-my-comments",
                    "body": "One that 30,000 people die in after a natural disaster.",
                    "score": 24,
                    "replies": []
                },
                {
                    "author": "kataskopo",
                    "body": "The USA in 3 years when the current orange administration fires OSHA.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -10,
                    "replies": []
                },
                {
                    "author": "olivianobody",
                    "body": "Milei sold the beams to buy some more crypto",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "SomethingAbtU",
            "body": "will the cement curing win or will gravity win. find out in a video update",
            "score": 6,
            "replies": []
        },
        {
            "author": "spongebobama",
            "body": "Honest lay man question. This is not right is it? No racism, jokes, can someone explain?",
            "score": 38,
            "replies": [
                {
                    "author": "KaiserReisser",
                    "body": "You are correct. He’s building the floor with a slight arch to it so it won’t fall if people walk on it (also he wouldn’t be doing this if it never worked, many of the buildings in this region are probably built like this). However, any sort of earthquake or other strong horizontal force would quickly collapse these floors. Unreinforced concrete performs fine under compression but not well under shear forces.",
                    "score": 44,
                    "replies": [
                        {
                            "author": "spongebobama",
                            "body": "Many thanks",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "orincoro",
                            "body": "Right. A little shear (like the walls moving up and down during the W wave in an earthquake, or back and forth like during the S wave), and the structural integrity of these bricks completely falls apart. You’re unlikely to have a large heavy structure built using gravity arches to fail like that, so bridges and aqueducts that the Romans built are standing after thousands of years, but those have huge columns and multiple layers of bricks. If the building deforms even a little bit with these floors in place, they’re going to collapse. If you have a heavy dresser or a piano or refrigerator, it’s going to drop straight down into floor after floor.\n\nIf anyone wants to see what I mean, try this with some Lego bricks on your kitchen table. Just lightly connect them into arches and then wedge them between two walls or even 4. To simulate a quake, you can do three basic movements: slap then edge of the table once for a P wave, shake it back and forth for an S wave, and then repeatedly shake it up and down for a W wave. You’ll see that the structure will be MORE stable with more weight on it for a P wave and maybe an S wave too, but the more weight you put on it, the less integrity it will have with the W wave. This is why the W (up and down) is often the most destructive.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "FilouBlanco",
                    "body": "An  alleged structural engineer in the thread said that it’s actually not that crazy.\n\nhttps://www.reddit.com/r/WTF/s/4ESHjTRvDv",
                    "score": 16,
                    "replies": [
                        {
                            "author": "spongebobama",
                            "body": "Thanks!",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "orincoro",
                            "body": "To be fair they said it’s still not good for earthquakes, but it’s not like it’s just going to collapse when someone sneezes.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "GieckPDX",
                            "body": "I am CONVINCED he is experienced and 100% correct (if I say it enough maybe I'll believe it).",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "emkoemko",
                    "body": "You're not comprehending the gravity of the situation?",
                    "score": 58,
                    "replies": [
                        {
                            "author": "spongebobama",
                            "body": "LoL nice",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "Skruestik",
                            "body": "You’re.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "emkoemko",
                            "body": "thanks",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "GieckPDX",
                            "body": "That was really good, you bastard. And....not sleeping.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Popes_g",
                            "body": "Mavity*",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "orcvader",
                    "body": "Correct. It’s not right. \n\nConcrete roofs (good for houses in countries that can be impacted by storms, as well as houses that want to have a structure built on top of the house) are made of slabs of pure concrete with rebar (or similar technique) used for integrity. \n\nThis is extremely unsafe and will likely collapse very soon because cinder blocks are being held only by a small amount of mix plus each one individually is a weak-spot since weight isn’t distributed across a whole unified surface area like it would be with a slab.",
                    "score": 40,
                    "replies": [
                        {
                            "author": "Pickledsoul",
                            "body": "https://www.reddit.com/r/WTF/comments/1j6txxa/trust_himhe_knows_that_stuff/mgs31w5/",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "spongebobama",
                            "body": "Many thanks",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "moconahaftmere",
                            "body": "Each segment is arched and wedged between the steel beams, and then a concrete slab goes on top. Actually pretty safe.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "roger_27",
                    "body": "You don't make a ceiling with bricks..You need to lay across peices of wood, then lay Styrofoam bricks, and pour concrete across the roof to be one huge piece of concrete.. All the while providing rebar and load bearing walls... This guy is literally just smacking on hollow bricks along a roof. I'm not a professional anything but I'm pretty sure this isn't right.",
                    "score": 49,
                    "replies": [
                        {
                            "author": "ericstern",
                            "body": "This is wrong. You can definitely make a ceiling with bricks but there is a right way to do it and what this guy is doing is not it. Usually you make a slight arch between the steel beam runs. The more arched those runs are the stronger it will be(or the closer the metal beam runs are), but even slightly curved but relatively flat looking arches will compress out to the beams very effectively. In Mexico it is standard and you will see it everywhere. Example of commonly used arch/flatness used in mexican building ceilings: [here](https://imgur.com/355Yuyk). And here is an example [of one of these types of roofs in the middle of building process](https://imgur.com/ighg0uC). You can see on this one that they often use a metal template to keep the arch uniform and standardized as they progress along the beams length.\n\nHowever you do usually have to put some amount of mortar/mix/flooring above to prevent degradation (plus concrete and/or waterproof paints if it will be acting as a top level flat roof),  as a protective layer above them as they should not be left out to the elements. \n\nIn this video the guy is not even putting mortar on the side of the bricks. The back ones they show halfway into the video like they were more correctly done(still too flat maybe), I'm guessing he didn't do those since these were made with the bricklines running in a different direction? The brick lines do short lines from beam to beam and seem to be ever so slightly curved.",
                            "score": 35,
                            "replies": [
                                {
                                    "author": "moconahaftmere",
                                    "body": "You can see the arches at the end of this video.",
                                    "score": 13,
                                    "replies": []
                                },
                                {
                                    "author": "ConfusedMaverick",
                                    "body": "More or less what I was thinking, but\n\n>these were made with the bricklines running in a different direction \n\nThe arches he is making are at right angles to the ones in the final frame, but the technique is the sam. Look at the first frame of the video, and the line of the first row of bricks he would have laid - you can see a wedge of mortar along the beam, so he isn't following the straight beam with his lines of bricks, but the curve of the mortar wedge. \n\n>the guy is not even putting mortar on the side of the bricks.\n\nThe strength of the arch comes from the rigid bricks being butted right up against each other, you definitely don't want mortar creating a gap between them.\n\nThe closer I look, the more convinced I am that he knows exactly what he is doing, this is just a way of creating a low profile arch",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "idkyimh",
                            "body": "You can make [dome](https://youtu.be/z7K99RUlfVk?t=7m57s) ceiling out of bricks. But not flat like in the post",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "jwnsfw",
                                    "body": "0.32 cum of sand?????????????? excuse me?",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "doopliss6",
                                    "body": "Without watching the video I assume this\n\nhttps://en.wikipedia.org/wiki/Cubic_metre\n\nIs what it is you're seeing",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ul49",
                            "body": "You can absolutely make ceilings out of bricks. They just are supposed to be vaulted. And they look cool as fuck.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "spongebobama",
                            "body": "Many thanks",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "karoshikun",
                            "body": "also can use concrete slabs reinforced with a mesh of thick wire or construction rods atop chained brick walls, and then you pour concrete",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "KappKapp",
                    "body": "There’s no support for the bricks. Any real weight sitting on this will cause them to fail which at best is a large renovation, at worst could kill someone.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "spongebobama",
                            "body": "Many thanks.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BlurryBigfoot74",
                    "body": "No. It causes compression in the top and tension in the bottom. You need rebar for tension because brick and mortar has no strength when you pull it apart.\n\nConcrete monolithic slabs require a lot of calculations to determine thickness and rebar size and this is bricks which is way less stable.\n\nAny weight on this will make it crumble if can even hold it's own weight.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "spongebobama",
                            "body": "Many thanks",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "neotokyo2099",
                    "body": "https://www.reddit.com/r/WTF/s/r11bca3SSJ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MissRekt",
            "body": "Is this minecraft in real life?",
            "score": 7,
            "replies": []
        },
        {
            "author": "GoLow63",
            "body": "Don't they have the occasional earthquake round those parts ?....",
            "score": 6,
            "replies": [
                {
                    "author": "Flankdiesel",
                    "body": "It's called job security!",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "t0x1k_x",
            "body": "He's building this at the equator. Gravity works different there, centrifugal forces and whatnot",
            "score": 6,
            "replies": [
                {
                    "author": "GieckPDX",
                    "body": "I WANT to believe you so bad, but I don't think that's 100% right. Shit.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "sergeantbiggles",
            "body": "this makes me think of that old kids game Don't Break the Ice 🐧",
            "score": 6,
            "replies": []
        },
        {
            "author": "blacks252",
            "body": "Dudes playing minecraft in real life",
            "score": 5,
            "replies": []
        },
        {
            "author": "top2percent",
            "body": "Poor country construction methods make me so mad lol",
            "score": 56,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": -48,
                    "replies": []
                },
                {
                    "author": "IggyKami",
                    "body": "No no no, don't shake the baby.",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "unclepaprika",
                    "body": "Omg!",
                    "score": -19,
                    "replies": []
                },
                {
                    "author": "robertovdp",
                    "body": "why u feel the need to include america into it?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Crow_eggs",
                    "body": "Just Richard Carpenter for me. He knows what he did.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "LocationEarth",
                    "body": "you talking USA?",
                    "score": -3,
                    "replies": []
                },
                {
                    "author": "DrCactus14",
                    "body": "No, they are talking about Germany.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "LocationEarth",
                    "body": "the punchline is that this was a technique used widely in the USA but you have neither humor nor wits, huh",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "DrCactus14",
                    "body": "The punchline is that this technique is very common in other countries too, not just the USA. Take most of Europe, for instance, where it is extremely common to find older buildings and even some newer ones that utilize this style of horizontal bricklaying. But you have neither humor *nor wits, huh. \n\nDude, I was trying to make a statement using the exact same idea for the punchline as you were making. That was literally the whole point. I thought that would have been obvious but I guess not. \n\n⚡️⚡️am I right",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "LocationEarth",
                    "body": "well fine.. except for Germany, that is why it failed to make sense to me ;)\n\n(The vast majority of brick buildings follow conventional patterns like running bond, Flemish bond, or monk bond, which improve structural integrity.)",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "DrCactus14",
                    "body": "Oh nice you changed the “or” to “nor”. Good job bud.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ohyeahits",
            "body": "Looks like the billionaire CEO is helping out on the floor today!",
            "score": 5,
            "replies": []
        },
        {
            "author": "Kraymur",
            "body": "It's probably a form of Madras roof, used in warmer regions. \n\n\"It involves **constructing a flat roof with a slight slope to allow rainwater to drain off**. Typically, these roofs are made using a combination of materials like brick, lime mortar, and terracotta tiles. The design allows for natural cooling and ventilation, making it well-suited to the hot climate of the region\"",
            "score": 5,
            "replies": []
        },
        {
            "author": "GrumpyWampa",
            "body": "Structural support? Not on my watch!",
            "score": 5,
            "replies": []
        },
        {
            "author": "wildyam",
            "body": "What’s the issue? He just put the walls on the roof… clearly the comments calling him ‘dangerous’ and ‘an idiot’ are all from Big Builder trying to stop this 5D chess player from stealing their money.",
            "score": 4,
            "replies": []
        },
        {
            "author": "razytazz",
            "body": "Project manager - so what are your qualifications?\nBuilder - I have 10,000 hours in Minecraft. \nProject Manager - When can you start?",
            "score": 5,
            "replies": []
        },
        {
            "author": "Gwifitz",
            "body": "Now I understand where all those videos of people falling through roofs/floors come from",
            "score": 5,
            "replies": []
        },
        {
            "author": "brannigans_girdle",
            "body": "He skipped the physics class",
            "score": 3,
            "replies": [
                {
                    "author": "Mimical",
                    "body": "There is a construction technique that uses clay bricks/tiles and [a wedge/key that locks the whole section together.](https://i0.wp.com/oldstructures.com/wp-content/uploads/2023/03/0db23-natcohollowtilefireproofing1915_0009.jpg?resize=780%2C674&ssl=1)\n\nSeems like the guy is just doing this. Which is actually kinda neato.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "FlemmerVermeul",
            "body": "Bro thinks he's building in minecraft or something",
            "score": 4,
            "replies": []
        },
        {
            "author": "SourpatchMao",
            "body": "This is why I have that weird dip in the kitchen that makes that weird groan sound",
            "score": 5,
            "replies": []
        },
        {
            "author": "stillnotlovin",
            "body": "I've never felt so violently angry before!",
            "score": 4,
            "replies": []
        },
        {
            "author": "noahdavis1202",
            "body": "This reminds me when SpongeBob was trying to rebuild his pineapple and Patrick was underneath and kept getting hit with it lol",
            "score": 3,
            "replies": []
        },
        {
            "author": "Rockytriton",
            "body": "See how free you are to build efficiently without stupid government regulations",
            "score": 7,
            "replies": []
        },
        {
            "author": "wright007",
            "body": "My engineering mind went from flabbergasted to quickly being concerned for the well-being of the community. This asshole is going to get people killed.",
            "score": 7,
            "replies": [
                {
                    "author": "Alyxstudios",
                    "body": "Must not be an engineer then if you don’t know what a barrel vault is dumbass",
                    "score": 2,
                    "replies": [
                        {
                            "author": "wright007",
                            "body": "You mean those ARCHED structures?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Alyxstudios",
                            "body": "What??",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "wright007",
                            "body": "If the brick masonry is arched, it can support its own weight like that. But flat? That leads to collapse. Clearly this is flat in the video above, but the technique can be used similar to that if they are stacked in arches that disperse the forces to the edges of the structure.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Medic2011",
            "body": "MR GEORGE!!",
            "score": 6,
            "replies": [
                {
                    "author": "gmarkv10",
                    "body": "He's no good operator",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ICheckPostHistory",
            "body": "I'll huff and I'll puff and I'll...",
            "score": 3,
            "replies": []
        },
        {
            "author": "badbatch",
            "body": "I didn't know that you could build things with wafer cookies and peanut butter.",
            "score": 3,
            "replies": [
                {
                    "author": "nukemgt",
                    "body": "Mustard makes for a good adhesive.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dinierto",
            "body": "I'm actually really impressed that's staying together long enough to dry",
            "score": 3,
            "replies": []
        },
        {
            "author": "beansahol",
            "body": "This is how I build in valheim",
            "score": 3,
            "replies": []
        },
        {
            "author": "Affectionate_Owl8351",
            "body": "Yeah, I'm never standing under there.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Nerveras",
            "body": "Gives me vibes from that episode of SpongeBob where they try building SpongeBob his new house",
            "score": 3,
            "replies": []
        },
        {
            "author": "Polenicus",
            "body": "It would have more structural integrity if it was made of old breadsticks, shellac and paint.",
            "score": 3,
            "replies": []
        },
        {
            "author": "jdemack",
            "body": "No wonder the death tolls are so high during earthquakes.",
            "score": 3,
            "replies": []
        },
        {
            "author": "labatomi",
            "body": "Big rebar wants to have this video removed from the internet.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Jack_Hackerman",
            "body": "Ah shit. I bought a car garage like two years ago and some mfcker put bricks like that. They started falling on the previous owner's car",
            "score": 3,
            "replies": []
        },
        {
            "author": "MikeOntheMicc",
            "body": "I mean fuck. He got the other side done",
            "score": 3,
            "replies": []
        },
        {
            "author": "brandon24745",
            "body": "He's setting up for the next round of spleef.",
            "score": 3,
            "replies": []
        },
        {
            "author": "thetburg",
            "body": "The completed sections look like they are bowed up slightly. I think he is doing it right. Bricks are strong in compression and even a slightly parabolic shape will give you that.\n\nWhether those steel straps can hold all that weight is another thing though.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Flesh_Dyed_Pubes",
            "body": "This guy built the deck at club Aqua?",
            "score": 3,
            "replies": []
        },
        {
            "author": "VinnySmallsz",
            "body": "I came looking for someone to defend this guys actions in any way. Nope.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Beefweezle",
            "body": "Minimalist arches, let’s see how that works out for him.",
            "score": 3,
            "replies": []
        },
        {
            "author": "umaijcp",
            "body": "The reason this seems so sketchy is because, aside from the sketchy  construction technique, the structure itself is optimized to take advantage of the best properties of the steel and the terracotta bricks. \n\nFirst, it is not an arch, but a dome. Arches transfer forces laterally and down. Domes can do the same, but in this case it is transferring all the downward force into tension on the steel. As long as the joints hold and the steel does not stretch, it is very strong. The terracotta is in compression so both materials are used in their optimum way. This is a subtle but important shift as a flat slab ends up seeing some tension and even the slight arch eliminates that (it has to be enough of an arch that it is robust and is always an arch at all points with the bottom of the bricks always in compression and never tension.) Likewise, the load on the steel is more complex, but the important force is tension from the dome. \n\nIn fact, this structure is so robust that he can do it by eye and sloppily and it will still stand. There is more to say about the history of the technique and how he will get mortar between the bricks when the top is finished, but I am reddited out for now.",
            "score": 3,
            "replies": [
                {
                    "author": "houliclan",
                    "body": "So it’s good?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "umaijcp",
                    "body": "How he is doing it? no. There has to be quality control and consistency. He may be a master but the only way to know is to see how many of his domes fail.\n\nBut even if done right there are problems:\n\n- Corrosion of joint fasteners will cause failure\n\n- Deformation due to settling or earthquakes will cause failure.\n\n- Any penetration of slab (retrofits, piping, etc) will weaken structure... and cause failure.\n\nThe main problem is that when it fails, it fails catastrophically. So it is not up Western standards but is typical for most construction around the world. \nIMHO",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "houliclan",
                    "body": "Interesting thanks",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "GieckPDX",
                    "body": "Fuck.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "kilo_newton",
            "body": "I wonder if he passed inspection.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ToastyBob27",
            "body": "If i remember correctly these are the same bricks that handle earthquakes very poorly.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Diogenes_Will",
            "body": "Jim Lahey is getting hella sunburned",
            "score": 3,
            "replies": []
        },
        {
            "author": "Uncle_owen69",
            "body": "Someone’s gonna die from that",
            "score": 3,
            "replies": []
        },
        {
            "author": "TheOneValen",
            "body": "No worries, he will add plaster later on.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Plenty_Intention1991",
            "body": "Ah yes. It’ll make a great storm shelter too!",
            "score": 3,
            "replies": []
        },
        {
            "author": "CustomCarNerd",
            "body": "Is this how the pyramids were built? Shit was built square and then fell into a pointed pile and was just left there….",
            "score": 3,
            "replies": []
        },
        {
            "author": "Dylanator13",
            "body": "In fairness he is making a shallow arch with the bricks so they are staying up for now. Not a good arch that will fall, but it’s something at least.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Remarkable-Fuel1862",
            "body": "Dude needs a trowel his fingers must be fucked lol",
            "score": 3,
            "replies": []
        },
        {
            "author": "Better_Astronaut3972",
            "body": "See? This is what happens when ICE removes all the real tradesmen!",
            "score": 3,
            "replies": []
        },
        {
            "author": "LetsTryAnal_ogy",
            "body": "And Trump wants to eliminate OSHA. That’s what construction will look like in the US if that happens. People will die.",
            "score": 4,
            "replies": []
        },
        {
            "author": "BlurryBigfoot74",
            "body": "This gives whole new meaning to \"dead loads\"",
            "score": 4,
            "replies": []
        },
        {
            "author": "elburritodelicioso",
            "body": "Well it's a kind of Catalan vaulted roof I'm assuming, bricks layered at a slight arch (seems almost horizontal). The multiple layers create strength and weight is distributed laterally.",
            "score": 3,
            "replies": [
                {
                    "author": "GieckPDX",
                    "body": "It's OK - they're going to put REALLY Thick faux-brick linoleum flooring on top.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Flimsy-Sprinkles7331",
            "body": "If the current U.S. government continues to demolish protective oversight entities, then we too can build houses like this! ",
            "score": 5,
            "replies": []
        },
        {
            "author": "RaspBoy",
            "body": "This house will stand the rest of time",
            "score": 2,
            "replies": []
        },
        {
            "author": "patronizingperv",
            "body": "Standing under that literally kills the cameraman.",
            "score": 2,
            "replies": [
                {
                    "author": "jwnsfw",
                    "body": "if he dies, he dies....",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "chosimba83",
            "body": "Forget an earthquake, a good rainstorm will completely compromise this.",
            "score": 2,
            "replies": []
        },
        {
            "author": "christador",
            "body": "Holy shit, I’d be afraid to so much as sneeze anywhere near that thing!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Voldruun",
            "body": "Hold by hopes and dreams",
            "score": 2,
            "replies": []
        },
        {
            "author": "EmeraldPrime",
            "body": "Wow, stupid allowed to continuing being stupid. How the hell has no one pointed out how stupid stupid is?",
            "score": 2,
            "replies": []
        },
        {
            "author": "EAComunityTeam",
            "body": "Jeez. This reminds me of the \"house\" my in-laws live in.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ThatBulgarian",
            "body": "This man plays Minecraft",
            "score": 2,
            "replies": []
        },
        {
            "author": "stanger828",
            "body": "I dont work in construction buuuuut….",
            "score": 2,
            "replies": []
        },
        {
            "author": "Dreadrazorbeast",
            "body": "Real life Fall Guys floor.",
            "score": 2,
            "replies": []
        },
        {
            "author": "stuartwitherspoon",
            "body": "Dude building a literal waffle house",
            "score": 2,
            "replies": []
        },
        {
            "author": "hyperion420",
            "body": "Next level floor is lava game",
            "score": 2,
            "replies": []
        },
        {
            "author": "emarvil",
            "body": "Can't believe he really thinks that thing will hold.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Shultzi_soldat",
            "body": "We have this kind of cealing, it's called monta. Except he is obviously doing it wrong. You need to have more of those beams holding up bricks or structural wires or even reinforced concrete, and bricks are specially made for this kind of cealling/floor. It's very good insulation, much easier for installations and way lighter than concrete floor. Also you need supporting beam along the whole length, no more than 50-60 cm apart until it sets.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Revised_Copy-NFS",
            "body": "Slight curve keeps it up. Just don't walk on it?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Exciting_Sky_3593",
            "body": "My upper arms and shoulders are getting sore just looking at this guy.",
            "score": 2,
            "replies": []
        },
        {
            "author": "xZandrem",
            "body": "THAT SHIT'S GONNA COLLAPSE 🗣️🗣️",
            "score": 2,
            "replies": []
        },
        {
            "author": "Rabidkitty95",
            "body": "Average fortnite player",
            "score": 2,
            "replies": []
        },
        {
            "author": "Szaborovich9",
            "body": "One tremor, thousands dead",
            "score": 2,
            "replies": []
        },
        {
            "author": "shinobi500",
            "body": "Minecraft engineer.",
            "score": 2,
            "replies": []
        },
        {
            "author": "paulodelgado",
            "body": "Minecraft physics in real life.",
            "score": 2,
            "replies": []
        },
        {
            "author": "el_Technico",
            "body": "That kind of looks like Iran, no 5,000-year-old civilization. I think they'll be fine.",
            "score": 2,
            "replies": []
        },
        {
            "author": "silentbeast1287",
            "body": "Minecraft logic.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Nawzays_",
            "body": "One step is all it takes",
            "score": 2,
            "replies": []
        },
        {
            "author": "Lackadaisical_ninja",
            "body": "HUH?!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Flyinmanm",
            "body": "The only thing I'd say in his favour is,\n\nI work in a Victorian Mill in the UK and the original floors/ ceilings are arched brick work, between cast iron beams, the ceilings look like a very much neater version of this. They've been there for almost 150 years.\n\nThe only thing holding them up is a bit of an arch on the brickwork and the weight of the screed/ concrete on top of the bricks forcing them into compression... I'm pretty sure they used timber formwork to form the arches though?\n\nSiting at work and hearing a random bit of mortar drop out of the ceiling does kind of put you on edge though!\n\nI wonder how many bricks this guys had fall out onto his head in the process of this?",
            "score": 2,
            "replies": [
                {
                    "author": "GieckPDX",
                    "body": "OK good to hear. You guys have lots of earthquakes in the UK right?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MyvaJynaherz",
            "body": "You fool!\n\n  \nOne does not simply block-into-mortar.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Background-Elk-543",
            "body": "I worked (hanged lights) with these ceilings/floors before and idk how they are up there",
            "score": 2,
            "replies": [
                {
                    "author": "bobspuds",
                    "body": "Now I ain't defending this shit but I can see the thinking behind it, you can see the completed sections have a bow upwards, the bricks are wider at the top then the bottom so it creates a small arch that once completed holds itself together by compression. \n\nIt's still a fucking pisstake though! Any movement in the ground or metal work and it's gone! \n\nOne brick cracks and it's only a matter of time before it drops!",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Background-Elk-543",
                            "body": "So drilling holes is a nono?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "bobspuds",
                                    "body": "As long as you don't expect me to do it - it's fine bud! Just wear a Hi-vis so we can find the bits afterwards!",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Background-Elk-543",
                                            "body": "isn't there a combined version where they poor reinforced concrete on top of the bricks",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "bobspuds",
                                                    "body": "Your still relying on the bricks to support it all, like pouring one continuous slab, would reinforce it but the bricks are still holding that platform up, it's creating a whole lot of weight and relying of the side bricks and metal more than I'd like. \n\nI'd expect the concrete would mostly be to lever the top bows rather than structure though. \n\nAs it is - the bricks are doing the same job as a bit of timber shuttering would do before removal. \n\nI'm not trying to piss on the methods, but this is why you see such devastation after earthquakes or flooding, all it takes is a little bit of movement and it drops like a house of cards!",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "DoeSeeDoe123",
            "body": "Load-bearing mortar",
            "score": 2,
            "replies": []
        },
        {
            "author": "WeebPansy",
            "body": "Try standing on it",
            "score": 2,
            "replies": [
                {
                    "author": "polo27",
                    "body": "You've very likely stood on many floors constructed with this technique.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "shootermac32",
            "body": "Just living in the moment, not a single osha violation insight",
            "score": 2,
            "replies": []
        },
        {
            "author": "lawrencecoldman",
            "body": "Bro thinks he is in Raft or what?????",
            "score": 2,
            "replies": []
        },
        {
            "author": "Wind2Energy",
            "body": "Gravity never sleeps.",
            "score": 2,
            "replies": []
        },
        {
            "author": "djlofly",
            "body": "All that frame for that",
            "score": 2,
            "replies": []
        },
        {
            "author": "BritishAnimator",
            "body": "One loud fart and that roof could kill you.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Tater_Mater",
            "body": "Dude thinks he lives in a Minecraft world",
            "score": 2,
            "replies": []
        },
        {
            "author": "BilboStaggins",
            "body": "One of those times I'm thankful for building code",
            "score": 2,
            "replies": []
        },
        {
            "author": "JP6660999",
            "body": "I definitely am not a mason but I’m gonna say no this won’t work",
            "score": 2,
            "replies": []
        },
        {
            "author": "penispotato69",
            "body": "What is this minecraft",
            "score": 2,
            "replies": []
        },
        {
            "author": "pinky_-dinky",
            "body": "That looks like some tweeker engineering 👀",
            "score": 2,
            "replies": []
        },
        {
            "author": "Big-Raspberry-7319",
            "body": "It looks like wafer! I imagine it'll be the house where Hansel and Gretel go to.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Gaurav1738",
            "body": "He's still in his Minecraft era.",
            "score": 2,
            "replies": []
        },
        {
            "author": "eutohkgtorsatoca",
            "body": "I guess the slightly concave shape is what keeps it up.",
            "score": 2,
            "replies": []
        },
        {
            "author": "sp0okyx3",
            "body": "The landlord special",
            "score": 2,
            "replies": []
        },
        {
            "author": "xxTheMagicBulleT",
            "body": "This seems so low tech and dangerous. Seen a lot of crazy chinees construction bullshit. But this is inane. Why not just a reinforced concrete slab. Why this insanity.",
            "score": 2,
            "replies": []
        },
        {
            "author": "too_rolling_stoned",
            "body": "I don’t know that I would stand or sit beneath this on a dare.",
            "score": 2,
            "replies": []
        },
        {
            "author": "onequbit",
            "body": "dead people can't complain about shoddy construction",
            "score": 2,
            "replies": []
        },
        {
            "author": "standaggs",
            "body": "He learned construction from Minecraft",
            "score": 2,
            "replies": []
        },
        {
            "author": "igivefreetickles",
            "body": "This is how a drone strike kills so many people?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Aa_82_aa",
            "body": "I've seen this done in Iraq. We had a building put up as a sleeping quarters at a police station. The guys who built it walked across it confidently. We decided not sandbag that roof like we did to all the others though.",
            "score": 2,
            "replies": []
        },
        {
            "author": "tomparker",
            "body": "Ever heard of getting “the pinkies?” A few minutes of moving caustic mortar with bare hands can cause your fingers to feel like you touched a hot griddle. His hands may have been fossilized long ago.",
            "score": 2,
            "replies": []
        },
        {
            "author": "RuprectGern",
            "body": "While watching this video i was mindlessly saying \"No No No No No\"  like those stupid TikTok videos...",
            "score": 2,
            "replies": []
        },
        {
            "author": "Sequitur1",
            "body": "Would not go in that structure.  Nfw.",
            "score": 2,
            "replies": []
        },
        {
            "author": "davidbrit2",
            "body": "Is he one of those \"free masons\" I've heard about?",
            "score": 2,
            "replies": []
        },
        {
            "author": "sithcookies",
            "body": "Building with Minecraft logic...someone's gonna get hurt here.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ikonoqlast",
            "body": "You know, if you tilt the screen 90 degrees this looks fine...",
            "score": 2,
            "replies": []
        },
        {
            "author": "KingoftheKeeshonds",
            "body": "I watched the video without noticing the subreddit and thought *what the fuck?*",
            "score": 2,
            "replies": []
        },
        {
            "author": "eVOLve865",
            "body": "Me building my compound in Valheim",
            "score": 2,
            "replies": []
        },
        {
            "author": "leslieferrer",
            "body": "he hasn't read the book on gravity yet.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Rocannon22",
            "body": "Classic masonry work by a pro. 👍 \nSee the slight arch? The more weight on top, the tighter the tiles compress together, and the stronger the floor. Works for roofs too.",
            "score": 2,
            "replies": []
        },
        {
            "author": "BroccoliStrong8256",
            "body": "No trowel needed. Just bare hands. This man makes Chuck Norris look like Paul Reubens",
            "score": 2,
            "replies": []
        },
        {
            "author": "popcornfart",
            "body": "I've seen patios like this in big cities.  The has to be rebar in there, right guys? ^right ^guys? ^^right?",
            "score": 3,
            "replies": []
        },
        {
            "author": "HPchipz",
            "body": "I wouldn’t even walk under it",
            "score": 3,
            "replies": []
        },
        {
            "author": "ToonMasterRace",
            "body": "Not shocked at all to see the 1 construction video actually involving Americans be this. We really don't know how to do anything anymore.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Momps",
            "body": "looks like Turkey",
            "score": 2,
            "replies": []
        },
        {
            "author": "ClosPins",
            "body": "This sort of thing is why, every year in Turkey, an earthquake happens - and roughly 37 million buildings collapse...",
            "score": 2,
            "replies": []
        },
        {
            "author": "archiewaldron",
            "body": "Roman engineers ca. 100 BC: “WTF?”",
            "score": 2,
            "replies": []
        },
        {
            "author": "DangerousYoghurt3187",
            "body": "Wall with waves",
            "score": 1,
            "replies": []
        },
        {
            "author": "JoeyDubbs",
            "body": "He's building a parking garage.",
            "score": 1,
            "replies": []
        },
        {
            "author": "counterhit121",
            "body": "This looks crazy, but also idk what it should look like.  Can someone explain how it should be done?",
            "score": 1,
            "replies": [
                {
                    "author": "idkyimh",
                    "body": "https://youtu.be/z7K99RUlfVk?t=7m57s\nSomething like this, but that's not what the guy in the post trying . You can't lay bricks flat and call it a roof",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Swimming-Scholar-675",
                            "body": "this guy just did",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "centralvaguy",
            "body": "I try not to think about it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MatDoosh",
            "body": "That's a roof.... Right?\n\nRight?!",
            "score": 1,
            "replies": [
                {
                    "author": "M4dcap",
                    "body": "That's only floor two of three. It's load bearing, that's why it's made from concrete.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "gynalubamint",
            "body": "Don't break the ice game!",
            "score": 1,
            "replies": []
        },
        {
            "author": "psubs07",
            "body": "That's Jerry. He's always screwin up, so do do this to keep him busy.\n\nHe's not a smart man, or a rich man, bu he's a good man. They pay him to keep him busy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bearing1991",
            "body": "Jesus christ. That's outright dangerous.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Derb710",
            "body": "At least it looks like he put an arch in each one of those sections. Should hold haha",
            "score": 1,
            "replies": []
        },
        {
            "author": "EvolutionInProgress",
            "body": "That Minecraft physics will not work in real life",
            "score": 1,
            "replies": []
        },
        {
            "author": "ayriuss",
            "body": "These must be lightweight insulation tiles. Otherwise, this completely defies physics.",
            "score": 1,
            "replies": []
        },
        {
            "author": "g0ingb0ing",
            "body": "It’s government work\n\nThey want to encourage ppl to stay under a certain weight, or else..",
            "score": 1,
            "replies": []
        },
        {
            "author": "P_516",
            "body": ": dog head tilt of confusion :",
            "score": 1,
            "replies": []
        },
        {
            "author": "MANISH_14",
            "body": "Seems like Minecraft building",
            "score": 1,
            "replies": []
        },
        {
            "author": "bad3ip420",
            "body": "Steel deck, steelbars, and cement pouring is pretty damn expensive nowadays.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ryrynz",
            "body": "The sag",
            "score": 1,
            "replies": []
        },
        {
            "author": "michi03",
            "body": "So this is how cathedrals are made! Wow!",
            "score": 1,
            "replies": []
        },
        {
            "author": "IronLunchBox",
            "body": "woah",
            "score": 1,
            "replies": []
        },
        {
            "author": "Govt-Issue-SexRobot",
            "body": "He’s on that stuff too",
            "score": 1,
            "replies": []
        },
        {
            "author": "therealkaptinkaos",
            "body": "Here's a good argument for governmental regulation.",
            "score": 1,
            "replies": []
        },
        {
            "author": "johndeer89",
            "body": "You guys are dumb. Just flip the phone sideways.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fuzzy_Muscle",
            "body": "Bros got the Bluetooth structural support",
            "score": 1,
            "replies": []
        },
        {
            "author": "mellcrisp",
            "body": "This is one of those that actually got the verbal \"what in the fuck\". Nice job.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Thatguyfromnihil",
            "body": "pre-Roman engineering",
            "score": 1,
            "replies": []
        },
        {
            "author": "Motor-Principle",
            "body": "Building standards, eh? Who needs 'em!",
            "score": 1,
            "replies": []
        },
        {
            "author": "boot2skull",
            "body": "Muggles hate this one trick",
            "score": 1,
            "replies": []
        },
        {
            "author": "BrianmurrayTruth",
            "body": "😂",
            "score": 1,
            "replies": []
        },
        {
            "author": "DarkBomberX",
            "body": "\"It just had to *look* like a roof, right?\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "DolphinSweater",
            "body": "Dude needs some sunscreen.",
            "score": 1,
            "replies": []
        },
        {
            "author": "itsgreybush",
            "body": "My man plays to much Minecraft",
            "score": 1,
            "replies": []
        },
        {
            "author": "N0Grundle",
            "body": "Don't worry. He will remove the steel beams when he's done with the masonry.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Saturday72",
            "body": "A gush of wind the building will crumble",
            "score": 1,
            "replies": []
        },
        {
            "author": "mojis11",
            "body": "I have seen this and its a decoration kind of thing on top they add a other layer of concrete and more steel. Never seen them fall. I have also seen it done with square rocks",
            "score": 1,
            "replies": []
        },
        {
            "author": "lovelife0011",
            "body": "lol I know I know I have trillions of Tera flops of paperwork. get to the candy bar part.",
            "score": 1,
            "replies": []
        },
        {
            "author": "eldelabahia",
            "body": "This works but I think it needs more angle. Later on they lay down a still mesh on top and poor more concrete. This is very common on Latin America.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JeebsFat",
            "body": "I've heard of floating floors, but this is ridiculous!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Convict_felon",
            "body": "Oh man, he must really need that job. Lying on his job interview and beeing put to test like this....damn!",
            "score": 1,
            "replies": []
        },
        {
            "author": "neko_ouji",
            "body": "Haeh?",
            "score": 1,
            "replies": []
        },
        {
            "author": "JewelerNo5072",
            "body": "This looks like terracotta to me. I’ve worked in many old buildings in my city which have walls and ceilings made up of this material, and it is actually very strong. Said buildings have been standing for many decades.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DavyB",
            "body": "That’s a no for me dawg.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Aeroncastle",
            "body": "Cartoon logic",
            "score": 1,
            "replies": []
        },
        {
            "author": "guardwoman12345",
            "body": "Only thing that is holding together is mortar and hopes and prayers LOL",
            "score": 1,
            "replies": []
        },
        {
            "author": "MattMose",
            "body": "Reminds me of the big deck at Club Aqua.",
            "score": 1,
            "replies": []
        },
        {
            "author": "president__not_sure",
            "body": "you guys don't get it. he's gonna stay there even after construction to hold everything up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "zhivago",
            "body": "You can see he's building arches between the steel beams.\n\nThis might actually be pretty strong.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alibaba20202020",
            "body": "but why?",
            "score": 1,
            "replies": []
        },
        {
            "author": "dedokta",
            "body": "When people complain that there's to much red tape in building construction this is the result of lax inspections.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ieraaa",
            "body": "Looks like the guy knows exactly what he's doing",
            "score": 1,
            "replies": []
        },
        {
            "author": "xdanish",
            "body": "but... what happens if it rains??",
            "score": 1,
            "replies": []
        },
        {
            "author": "xerxes_dandy",
            "body": "Without minimum scaffold difficult for row of hollow bricks to hold on until curayion unless the mortar is fortified with extra strong additive or adhesive",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hesam2010",
            "body": "Spit, Next.",
            "score": 1,
            "replies": []
        },
        {
            "author": "g00dm0rNiNgCaPTain",
            "body": "look up Guastivino arched tile system.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jon_Irenicus1",
            "body": "Id trust wooden planks than that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "J-MRP",
            "body": "Probably the same guy that built the deck at Aqua.",
            "score": 1,
            "replies": []
        },
        {
            "author": "S0m3-Dud3",
            "body": "he learned that from minecraft",
            "score": 1,
            "replies": []
        },
        {
            "author": "0x45646479",
            "body": "NOT safe for work",
            "score": 1,
            "replies": []
        },
        {
            "author": "modsaretoddlers",
            "body": "As somebody who isn't familiar with the material or the construction process here, what am I looking at?",
            "score": 1,
            "replies": [
                {
                    "author": "Minimum_Lead_7712",
                    "body": "I think it's peanut butter and Belgian waffles",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "ertbvcdfg",
            "body": "I don’t want sleep under it",
            "score": 1,
            "replies": []
        },
        {
            "author": "imunfair",
            "body": "I wouldn't want to be under even those finished ones during an earthquake, that looks unstable as hell with just some mortar holding up an entire sheet of bricks as your roof.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AbjectReporter2373",
            "body": "Oh oh?????",
            "score": 1,
            "replies": []
        },
        {
            "author": "AcerolaUnderBlade",
            "body": "That thing would crumble the moment a pigeons step foot on that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheNotorious__",
            "body": "You ever seen those really big people when they walk? I don’t necessarily mean overweight, I just mean like really tall and built people- the floor shakes.. this will collapse just by them walking on the floor underneath. This will collapse when someone shuts the door a little too hard",
            "score": 1,
            "replies": []
        },
        {
            "author": "uQuestionIt",
            "body": "Don't fart too loud",
            "score": 1,
            "replies": []
        },
        {
            "author": "PriceFister66",
            "body": "Rebar would help.",
            "score": 1,
            "replies": [
                {
                    "author": "Liquidust256",
                    "body": "Don’t be ridiculous.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "joelesprod",
            "body": "\"it's OK I'm a expert in Minecraft\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "m3kw",
            "body": "Looks like oatmeal",
            "score": 1,
            "replies": []
        },
        {
            "author": "N3HKRO",
            "body": "Man wtf 🤣🤣🤣",
            "score": 1,
            "replies": []
        },
        {
            "author": "SepticX75",
            "body": "As a heavier person (tall, ya fuckers) this makes me very uneasy",
            "score": 1,
            "replies": []
        },
        {
            "author": "aroundincircles",
            "body": "it looks like there is an arch to it. Is there? if so, he's probably GTG. Compression will hold them in place. If not, the slightest pressure will send it crumbling down.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CurlOfTheBurl11",
            "body": "Uhhh I'm no expert but that is not up to code.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gilgamesh2062",
            "body": "Besides the poor safety of this,   can you imagine how tiring it would be to have to hold your arm up like that and pressing those bricks like that?",
            "score": 1,
            "replies": []
        },
        {
            "author": "andrewse",
            "body": "Do the completed sections have a slight arch? If so it would add a lot of strength. I don't think that it's going to be waterproof though.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Naive-Offer8868",
            "body": "Lmfao me trying to build myself a stone castle in Valheim 🤣",
            "score": 1,
            "replies": []
        },
        {
            "author": "I_am_The_Teapot",
            "body": "Load bearing hopes and dreams.",
            "score": 1,
            "replies": []
        },
        {
            "author": "richardtallent",
            "body": "This man should be designing 3D printers",
            "score": 1,
            "replies": []
        },
        {
            "author": "nano8150",
            "body": "How many gallons is the new hot tub?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Roronoa_Zoro8615",
            "body": "*smacks it* yeah that baby ain't movin",
            "score": 1,
            "replies": []
        },
        {
            "author": "Roscommunist16",
            "body": "It’ll be fine once he tips it on to its side.",
            "score": 1,
            "replies": []
        },
        {
            "author": "1moreguyccl",
            "body": "I am very sure it is earthquake proof",
            "score": 1,
            "replies": []
        },
        {
            "author": "slyiscoming",
            "body": "I don't know whether to be impressed or mortified",
            "score": 1,
            "replies": [
                {
                    "author": "thedevillivesinside",
                    "body": "Impressed nobody is dead \n\nMortified that this type of construction apparently exists",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Crush-N-It",
            "body": "This is not happening in America. I’m confident about that",
            "score": 1,
            "replies": []
        },
        {
            "author": "swiftpwns",
            "body": "If you look closely there is actually a slight arch which gives it sttenght, so its not as weak as it may seem at first glance",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jonathan_Pine",
            "body": "If you watch the very first part of the video you can see it's double layered, so doubly safe.  Nothing to see here.  Everything is fine.  No structural integrity issues to be had for decades.",
            "score": 1,
            "replies": []
        },
        {
            "author": "raindoctor420",
            "body": "I just really hope this is a case of there's is engineering or construction magic happening in the background to hold that up. \n\nThe only thing my uneducated mind can even begin to guess at is there's more to the interlocking pattern and the mortor than is commonly known? \n\n\n\nI'm not putting any weight up there though, no thanks.",
            "score": 1,
            "replies": []
        },
        {
            "author": "tizadxtr",
            "body": "If persimmon operatives were left to their own devices..",
            "score": 1,
            "replies": []
        },
        {
            "author": "tlucas0303",
            "body": "All fun and games till the front falls off",
            "score": 1,
            "replies": []
        },
        {
            "author": "MMN_NLD",
            "body": "Make him stand on the finished 'floors'....",
            "score": 1,
            "replies": []
        },
        {
            "author": "Some-Air1274",
            "body": "Incredible! Where’s the bracing?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Necessary_Advice_795",
            "body": "Someone out there is paying real money for that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Agent---4--7",
            "body": "Physics switched off while he's doing the job",
            "score": 1,
            "replies": []
        },
        {
            "author": "Snerl69",
            "body": "this is some minecraft level engineering",
            "score": 1,
            "replies": []
        },
        {
            "author": "dofusm",
            "body": "Gravity always wins",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheNeonRipper",
            "body": "He's the mate of a mate who can \"do it cheaper\".",
            "score": 1,
            "replies": []
        },
        {
            "author": "JayAndViolentMob",
            "body": "Inbuilt obsolescence. \n\nHow else is he supposed to stay in work?",
            "score": 1,
            "replies": []
        },
        {
            "author": "garyconnor",
            "body": "How in the name of gravity is that staying up...is he jesus 😮",
            "score": 1,
            "replies": []
        },
        {
            "author": "PedroFPardo",
            "body": "Video end too soon.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Buffnick",
            "body": "Looks good from here!",
            "score": 1,
            "replies": []
        },
        {
            "author": "senorhotpants",
            "body": "Knock knock \nWho’s there\nHead trauma",
            "score": 1,
            "replies": []
        },
        {
            "author": "Echostation3T8",
            "body": "This guy built the ‘word of God‘ floor from the end of “Indiana Jones and the Last Crusade”.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AeliosZero",
            "body": "This looks safe",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tremulant21",
            "body": "What is this a waffle road?",
            "score": 1,
            "replies": []
        },
        {
            "author": "WantToBeAverageHuman",
            "body": "real question tho, is this appropriate, ok, applicable, align to the protocol?\n\nedit: Will this be part of the Final Destination?",
            "score": 1,
            "replies": []
        },
        {
            "author": "MudRepresentative201",
            "body": "Kann mir jemand sagen was das für Mörtel ist? Der muss ja ziehen wie hechtsuppe",
            "score": 1,
            "replies": []
        },
        {
            "author": "StrawberryRibena",
            "body": "So, is someone gna have their roof caved in one day when it rains or strong winds come about ?",
            "score": 1,
            "replies": []
        },
        {
            "author": "NotTukTukPirate",
            "body": "r/OopsThatsDeadly ?",
            "score": 1,
            "replies": []
        },
        {
            "author": "itsjustbeny",
            "body": "Chinesium building",
            "score": 1,
            "replies": []
        },
        {
            "author": "E-radi-cate",
            "body": "Thank you. Please tap tap.",
            "score": 1,
            "replies": []
        },
        {
            "author": "smokethenights",
            "body": "This is 'volta tavan' in Turkish and many examples in 19-20th century buildings",
            "score": 1,
            "replies": []
        },
        {
            "author": "CodeMonkeyX",
            "body": "It looks like it's slightly arched so I guess it could work. It just seems like there are better ways to do this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Warm-Future1835",
            "body": "something don't feel right",
            "score": 1,
            "replies": []
        },
        {
            "author": "chaosandturmoil",
            "body": "I watched with my head in my hand",
            "score": 1,
            "replies": []
        },
        {
            "author": "p1gf00t",
            "body": "Um, gravity",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mrcraigt",
            "body": "That new dance floor is sweet.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Waxflower8",
            "body": "I feel laughter and frustration all at once",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ambitious_Welder6613",
            "body": "Great skill set",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bluenosedcoop",
            "body": "That Turkey by any chance? Last time an earthquake hit loads of buildings collapsed because they were built like this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kind_Significance_60",
            "body": "Yeah, that looks safe. 🤣",
            "score": 1,
            "replies": []
        },
        {
            "author": "dhiwira25",
            "body": "bro no need gravity",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pleasant-Dogwater",
            "body": "yep",
            "score": 1,
            "replies": []
        },
        {
            "author": "IamtheDanr",
            "body": "Physicists hate this trick!",
            "score": 1,
            "replies": []
        },
        {
            "author": "raider1v11",
            "body": "No way I'd be under or on top of that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "StainlSteelRat",
            "body": "Why do I want to eat that?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ericadamb",
            "body": "This is how you get headlines, 3.5 magnitude quake. 300k missing or dead.",
            "score": 1,
            "replies": []
        },
        {
            "author": "redgarnetdragon2000",
            "body": "Spotty mudding but okay",
            "score": 1,
            "replies": []
        },
        {
            "author": "RhetoricalAnswer-001",
            "body": "There are mega real estate companies in China who will pay big bucks for Tofu Dreg fraud, no questions asked.\n\nJust sayin'",
            "score": 1,
            "replies": []
        },
        {
            "author": "ExecrablePiety1",
            "body": "Those are the bendiest ceilings I've ever seen.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ExecrablePiety1",
            "body": "The irony of him showing off is that now they have proof of his negligence for when (not if) these roofs collapse on their occupants. \n\nProbably crushing some young children, the way these things tend to go down.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dyke13",
            "body": "he looks professional lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sab666",
            "body": "Struktrool Enjinia",
            "score": 1,
            "replies": []
        },
        {
            "author": "ObiWantCannotBe",
            "body": "The brick hang on his faith",
            "score": 1,
            "replies": []
        },
        {
            "author": "youngphnx",
            "body": "One butterfly land on top and wonder what’s gonna happen",
            "score": 1,
            "replies": []
        },
        {
            "author": "longJump26",
            "body": "Does Physics exist in his world!",
            "score": 1,
            "replies": []
        },
        {
            "author": "evila_elf",
            "body": "Ummmm wow. And not a good wow.",
            "score": 1,
            "replies": []
        },
        {
            "author": "kaantellioglu",
            "body": "am\\*noglu construction and engineering co",
            "score": 1,
            "replies": []
        },
        {
            "author": "Organic_South8865",
            "body": "There's a slight arch to it I think.  Usually the arch is much more pronounced though.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Madstupid",
            "body": "The wall is going the wrong direction",
            "score": 1,
            "replies": []
        },
        {
            "author": "Crush-N-It",
            "body": "🤣🤣🤣",
            "score": 1,
            "replies": []
        },
        {
            "author": "the-big-throngler",
            "body": "Ya know you see news stories like 384 Killed in India when building collapsed, or 246 Died in Suriname bridge collapse, etc? Yea this is why.",
            "score": 1,
            "replies": []
        },
        {
            "author": "polo27",
            "body": "No it's not",
            "score": 1,
            "replies": []
        },
        {
            "author": "rickyhatesspam",
            "body": "Why is it every uncivilised third world shit hole has cars beeping their horn non stop?",
            "score": 1,
            "replies": []
        },
        {
            "author": "drweird",
            "body": "It's a cultural thing. Indians I've dealt with her in the states are utterly amazed how quiet traffic is and how well behaved people are in traffic and obeying the rules. Indians, and maybe other, honk \"to let you know they're there\" and there are all kinds of other \"look at me, I'm about to do X\" sorta honks too. Hard to explain fully.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rickyhatesspam",
            "body": "I understand the horn is a method of communicating but it's completely unnecessary, if the drivers are properly trained, tested and obide. But, as demonstrated in this video, nothing is done properly in these shot holes. I know because my parents are originally from one.",
            "score": 1,
            "replies": []
        },
        {
            "author": "drweird",
            "body": "For sure the honking could stop, it's just so ingrained in the culture it would be a major effort",
            "score": 1,
            "replies": []
        },
        {
            "author": "polo27",
            "body": "There is nothing wrong with what he is doing.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Billy_Badass_",
            "body": "[https://en.wikipedia.org/wiki/Structural\\_clay\\_tile](https://en.wikipedia.org/wiki/Structural_clay_tile)",
            "score": 0,
            "replies": []
        },
        {
            "author": "RadVarken",
            "body": "Side pressure arch construction per the article.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Human-Calendar-8077",
            "body": "Bloke's playing minecraft irl",
            "score": 0,
            "replies": []
        },
        {
            "author": "ManlyMenopause",
            "body": "Trained him wrong on purpose for a joke.",
            "score": 0,
            "replies": []
        },
        {
            "author": "exprezso",
            "body": "The lack of tools and PPE is concerning ",
            "score": -5,
            "replies": []
        },
        {
            "author": "chocolateboomslang",
            "body": "There is something MUCH more concerning going on here. Tools and PPE barely even register.",
            "score": 18,
            "replies": []
        },
        {
            "author": "tilmanbaumann",
            "body": "Probably more solid than you think. It's an arch",
            "score": -35,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 18,
            "replies": []
        },
        {
            "author": "tilmanbaumann",
            "body": "You can literally see it in the video. It's shallow but it's an arch. \n\nPretty typical in Italy, although this arch seems a bit too shallow maybe",
            "score": -22,
            "replies": []
        },
        {
            "author": "masthema",
            "body": "It has an arch-like deformity. It's not an arch - an arch that sustains itself is precise, not just \"bendy\".",
            "score": 10,
            "replies": []
        },
        {
            "author": "ayylmaohss",
            "body": "No, it's not.",
            "score": 16,
            "replies": []
        },
        {
            "author": "Odd_Turnover_4464",
            "body": "it's an arched terracotta ceiling you dumb fuck",
            "score": -12,
            "replies": []
        },
        {
            "author": "ayylmaohss",
            "body": "what? it's obviously a sideways-wedged stracciatella ceiling",
            "score": 4,
            "replies": []
        },
        {
            "author": "Odd_Turnover_4464",
            "body": "you let your dog lick gelato off your asshole?",
            "score": -5,
            "replies": []
        },
        {
            "author": "ayylmaohss",
            "body": "only in my free time..",
            "score": 2,
            "replies": []
        },
        {
            "author": "tilmanbaumann",
            "body": "🤦‍♂️ I can't believe we argue over something that is a clearly visible fact. I mean you all have eyes and watched the video, right?",
            "score": -15,
            "replies": []
        },
        {
            "author": "salbris",
            "body": "I have literally zero construction experience but it seems pretty obvious to me this isn't an arch. He's clearly putting these bricks matching the pattern of the blue metal beams which are VERY clearly straight lines and not even remotely a curve like an arch.",
            "score": 8,
            "replies": []
        },
        {
            "author": "jg6410",
            "body": "They are, when the camera pans to show the already done ones they are bowed. Maybe to not have to cut the bricks when they get to the end?  But they are, it's like an upside down shallow bowl you would see on some ladies entryway table.",
            "score": 3,
            "replies": []
        },
        {
            "author": "salbris",
            "body": "I get what your saying but it's so close to flat I highly doubt that would really affect the structural integrity of it. You can see it's also means mortal all over the place and eventually straightens out at the sides. So even if it is slightly curved it's clearly not done correctly.\n\nTake a look at this random video I found: [https://www.youtube.com/watch?v=1H6WJnPoci4](https://www.youtube.com/watch?v=1H6WJnPoci4)\n\nHe puts the middle brick in last due to the fact that it has the most severe shape change from a rectangular brick and because it's a pretty well known and basic fact that archs compress towards the center. Putting in the side bricks in last would be stupid.",
            "score": 1,
            "replies": []
        },
        {
            "author": "InShortSight",
            "body": "> it's so close to flat \n\nAgreed\n\nIt's possible the builder thinks its safe because it holds long enough for him to put the last brick in and make it \"arch\". I reckon for it to be proper safe with such a small curve the bricks would have to be designed with angled or curved edges to produce a reliable arch in a proper catenary shape. A proper arch that can free stand even if the mortar fails.",
            "score": 1,
            "replies": []
        },
        {
            "author": "-Enrique_Shockwave-",
            "body": "It’s arched because it’s bowing already under the poor construction, that does not make it stronger lol",
            "score": 15,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 4,
            "replies": []
        },
        {
            "author": "tilmanbaumann",
            "body": "I don't think the fact that the bricks are not trapezoidal makes a lick of difference at that shallow angle.\n\nAnd the load goes into some pretty chunky steel beams.\n\nWell I'm not an architect. But this still looks a lot stronger to me than it appears at first glance. Shoddy maybe. But not completely insane either",
            "score": 1,
            "replies": []
        },
        {
            "author": "Buriedpickle",
            "body": "They aren't, and they don't have to. Trust me bro, I'm an architect.\n\nMortar is a completely fine material to compress. As long as you construct the arch well, it shouldn't experience significant tensile stresses. Which should never happen, since brick doesn't take that shit well either. Yes, trapezoidal arch bricks exist, but that effect can just as easily be made with mortar.\n\nWhat's being constructed is basically a Prussian cap ceiling, or something similar to a Catalan vault. Used widely in the 19th and 20th century, and still stable.\n\nRegardless, the method of construction showcased could be better. While the structure does have a noticeable arch, I hope it doesn't have to bear too much additional weight.",
            "score": 1,
            "replies": []
        },
        {
            "author": "infra_d3ad",
            "body": "It might not be as shallow as it looks, cellphone camera's are know to flatten things some.",
            "score": 2,
            "replies": []
        },
        {
            "author": "BlurryBigfoot74",
            "body": "When you stand on a monolithic concrete floor there's tension in the lower half so it needs rebar.\n\nEven if it was an arch the ends need to be reinforced to support the weight.",
            "score": 7,
            "replies": []
        },
        {
            "author": "tilmanbaumann",
            "body": "Steel is pretty strong under tension. I'm not a builder but neither are any of you.\n\nFact is, shallow vaulted ceilings similar to this are pretty typical in some places. I wouldn't dismiss it as complete garbage",
            "score": -8,
            "replies": []
        },
        {
            "author": "BlurryBigfoot74",
            "body": "Theres zero rebar here for tension.\n\nReally? You're no a builder? I would have never known.\n\nI'm a civil engineering technologist. The compressive and tensile forces are not equal here.",
            "score": 4,
            "replies": []
        },
        {
            "author": "anormalgeek",
            "body": "Look at the blue beams. They're all straight lines and the bricks stay in line with them and every side that is shown.",
            "score": 1,
            "replies": []
        },
        {
            "author": "schutie",
            "body": "nobody is this dumb, maybe he will add the steel bars later",
            "score": -1,
            "replies": []
        },
        {
            "author": "Ragingdark",
            "body": "They're arched, they can't come down without breaking those thick bricks.\n\nBut sure downvote the one with a brain.",
            "score": -21,
            "replies": []
        },
        {
            "author": "BlurryBigfoot74",
            "body": "Even if they were arched the ends need to be solidly braced which they are not.\n\nArches create lateral forces that isn't even considered here.\n\nThese aren't even prestressed which is kind of an artificial arch.",
            "score": 5,
            "replies": []
        },
        {
            "author": "GLORYway",
            "body": "I don’t know why wood and Cardboard boxes house ppl are laughing at it’s very safe simple and easy \nHere in my country almost every house roof is like this my house actually like this and i have a second floor and before i build the second floor the serfs on top have special kind of clay that prevents water and moisture and heat  . \n\nAnd why we do this instead of concrete? Will it’s cheaper and back in the day having a concrete roof is almost impossible for Lack of building materials specially Iron rod and for it’s high price \n\nNow after everything is available and for reasonable price ppl build their houses with concrete roof top and in my house I built the first floor like this one in the video we called it ( Akkad ) because it was the 90s and an in 2014 I built the second floor and it was concrete \n\nAnd all these years and weight and nothing ever happened. \n\nAnd there is a second reason ppl do it like this now days also because it’s cheaper and sometimes when you are Building far from the city / village this can be easier and cheaper far more than concrete. \n\nI hope i send the message correctly with my bad English ….",
            "score": -2,
            "replies": []
        },
        {
            "author": "ky420",
            "body": "So u stuck the bricks up and built your floor like this? Pics?",
            "score": 1,
            "replies": []
        }
    ]
}