{
    "title": "March 2025 roadmap from DBD Twitter page",
    "author": "AedionMorris",
    "subreddit": "deadbydaylight",
    "rank": 1,
    "score": 207,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 114,
    "url": "https://i.redd.it/6qac77jqppme1.png",
    "id": "1j3h1wf",
    "selftext": "",
    "comments": [
        {
            "author": "WitcherStiv",
            "body": "what's Fearless Legends? I can't find anything related to it on google",
            "score": 80,
            "replies": [
                {
                    "author": "Mechapizza",
                    "body": "I have a feeling it’ll be a selection of preexisting characters and outfits on sale, and judging by the title Fearless Legends, it might be based on licensed survivors? I remember there was a sale sometime last year focused on some of the licensed killers if I recall correctly.",
                    "score": 52,
                    "replies": []
                },
                {
                    "author": "Megadoomer2",
                    "body": "In September 2024, they randomly had a Slasher Legends sale that discounted the Halloween and Nightmare on Elm Street characters along with Leatherface, Ghost Face, and Chucky.  My guess is that this is going to be something similar where specific licensed survivors (and maybe a few associated licensed killers) are discounted.\n\nIf I had to take a guess, I'd think that Ripley (and the Xenomorph), Lara Croft, and Ash would be some of the characters on sale.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "bonelees_dip",
                    "body": "I'd expect it to be a collection sale, not fully sure.\n\nEdit to make it clear",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Duncaster2",
                            "body": "It says it’s a sale.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "bonelees_dip",
                                    "body": "Yes, a collection sale, I wrote it a bit unclear.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Fit_Use9941",
            "body": "I was hoping the blood moon event would come back :(",
            "score": 45,
            "replies": [
                {
                    "author": "elscardo",
                    "body": "It's coming back in April if I recall correctly.",
                    "score": 31,
                    "replies": [
                        {
                            "author": "One_Spite245",
                            "body": "No blood moon is instead of lunar event ",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "elscardo",
                                    "body": "Yes but the entire schedule got shifted due to the health update",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Full-Curve2567",
                    "body": "Yeah I'm shocked it didn't. I thought the entire point of the Blood Moon was so they'd have a March event.\n\nProbably got delayed with the Health Update stuff. Likely until March. Blood Moon was very buggy so I'm not surprised by this.",
                    "score": 20,
                    "replies": [
                        {
                            "author": "EmeraldGhostface",
                            "body": "IIRC they delayed *everything* for the operation health",
                            "score": 26,
                            "replies": []
                        },
                        {
                            "author": "MC_Amsterdam",
                            "body": "I am quite annoyed by the delay actually. It shouldn’t impact events. I booked my holiday so I could play bloodmoon in March. Now it’ll be in April…",
                            "score": -18,
                            "replies": [
                                {
                                    "author": "LowrysBurner",
                                    "body": "Why wouldn’t it impact events though, they delayed everything for project health",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "MC_Amsterdam",
                                            "body": "I think it is unfair towards people like me, who plan their time off around events. I now have to miss out on them. I understand new content but events such as Bloodmoon are not different from last year (and even if they were, they already are done preparing them).",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "Alarmed_Leather9574",
                                                    "body": "Maybe dont plan a vacation around a video game?",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Sticky_And_Sweet",
                    "body": "It better come back in April then",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Smallbunsenpai",
                    "body": "I’m praying we get a Taurie cosmetic in the blood mood event",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "wonhundredyen",
            "body": "No skin announcements :<",
            "score": 20,
            "replies": [
                {
                    "author": "Spartaren",
                    "body": "It's honestly pretty odd. Don't remember the last time we've gone a whole month without new skins.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "wonhundredyen",
                            "body": "Well I kinda understand since they postponed all updates, they probably don't want to update the game just for skins which might tie into the next killer release or blood moon event.... Still sucks",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Legend_of_Zelia",
                                    "body": "If anything, a whole month without new skins will shut those people up who complained about BHVR only caring about selling skins instead of fixing the game.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "Spartaren",
                                    "body": "Even so, Operation Health only delayed the game for a few weeks, and I doubt that they had no skins whatsoever to sell. Fingers crossed they make up for it and release some incredible skins soon!",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Full-Curve2567",
                    "body": "I was under the impression that Taimada Japan was a skin drop, no? Or is it a sale?\n\nAnd I mean, old Rift cosmetics are coming back I guess. That'll tide people over while they do health patch stuff.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "wonhundredyen",
                            "body": "Tadaima Japan is an irl event, I'm not sure if there are any related cosmetics",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Full-Curve2567",
                                    "body": "Confused why it would be listed for the in-game roadmap then, but we'll see.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheNebeskyMuzOne",
            "body": "8vs2 when?",
            "score": 29,
            "replies": [
                {
                    "author": "Alken5",
                    "body": "Yesterday",
                    "score": 6,
                    "replies": [
                        {
                            "author": "DrumStix-",
                            "body": "no, no. That was 2v8. They want 8v2. 8 killers, two survivors.",
                            "score": 27,
                            "replies": [
                                {
                                    "author": "Valentinee105",
                                    "body": "Ya, the object is for each killer to actually fight over the 2 survivors. You win if you get the kill. This means other killers need to hit the survivor out of your hands and steal it.\n\nIt's like shitty rocket league, but everyone is against each other.",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "RodanThrelos",
                                            "body": "It would take MASSIVE changes, but a killers-only battle Royale-type mode would be CRAZY fun.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "PREPARE_YOURSELF_",
                                    "body": "8 killers fighting each other to get to kill 2 survivors.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Darkbat70",
                                            "body": "Funny enough, that was one of the new gamemodes that was poll voted by the community. 2 teams of 4 survivors and 1 killer each.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "lXlNeMiSiSlXl",
            "body": "Ooof no skins? That's a really dry month besides the PTB. Maybe they are taking this Game Health thing seriously though, which is great.",
            "score": 13,
            "replies": []
        },
        {
            "author": "The_L3G10N",
            "body": "Wait, what killer is going to be in this ptb? Or is it just the testing for anti slugging camping stuff",
            "score": 6,
            "replies": [
                {
                    "author": "Sliver1002",
                    "body": "Sometimes they don't announce the PTB until like the day before. But it will have a new licensed killer and no new survivor, according to the roadmap\n\nhttps://preview.redd.it/3pt35fjikqme1.jpeg?width=1870&format=pjpg&auto=webp&s=96baea8a4eb6a8ac3253728c36f3484f156d9aad",
                    "score": 13,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "time__is__cereal",
                                    "body": "seems an anime called Tokyo Ghoul is the most popular guess, but i'm not entirely sure where that's coming from. i remember reading something about a poster in the movie theater map hinting at it. i think Cote may have alluded to it in an interview as well? i'm a bit out of the loop on what new content they've announced.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Sliver1002",
                                            "body": "Mathew Cote said \"people are gonna bitch about it\" in an interview, so an anime/manga chapter \\*would\\* fit that.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Sliver1002",
                                    "body": "Mathew Cote said \"people are gonna bitch about it\" in an interview",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "RyeLucario",
                    "body": "It's going to be the next chapter alongside the QOL stuff.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "HappyAgentYoshi",
                            "body": "Though the QoL stuff also trickles into midchapter too i believe.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "deadbydaylight-ModTeam",
                            "body": "Thank you for visiting /r/DeadByDaylight; however, your submission has been removed under the following rule:\n\n**[Rule 5 - Avoid Inappropriate Submissions](https://www.reddit.com/r/deadbydaylight/wiki/rules#wiki_rule_5_-_avoid_inappropriate_submissions)** \n\n**Your submission was removed for one of the following reasons:**\n\n* Leaks of any kind; please use r/LeaksDBD, Twitter, or the leaks Discord instead.\n\nFor further information, please read our [subreddit rules](https://www.reddit.com/r/deadbydaylight/wiki/rules). \n\n**If you’ve read your removal message, and you’d like to discuss our decision, you can contact us** [**here**](https://www.reddit.com/message/compose?to=%2Fr%2Fdeadbydaylight)**.**",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "epikpepsi",
                    "body": "They haven't officially stated who/what the next Killer is, just that it's a licensed Killer. Seems they want it to be a surprise.\n\n\nBut there's some leaked info out there that seems very likely and are easy to find should you choose to look for it.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Megadoomer2",
                    "body": "The solo licensed killer who was originally scheduled for a March release will be included in the PTB, presumably.  The release date got pushed back due to the quality of life/game health updates.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fog-Champ",
            "body": "Damn I though chaos shuffle was sooner. \n\n\nAlso no new outfits? Now how am I supposed to bitch about new sable skins??",
            "score": 27,
            "replies": [
                {
                    "author": "OdysseyDeluxe",
                    "body": "It was originally announced to start on the 4th. I’m assuming the 2v8 extension pushed it back",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "football1078",
            "body": "Drop permanent Chaos Shuffle damn",
            "score": 9,
            "replies": []
        },
        {
            "author": "kuma_metal",
            "body": "Currently reading Tokyo Ghoul on the off chance the rumors are right. Would be cool.",
            "score": 14,
            "replies": [
                {
                    "author": "yukichigai",
                    "body": "The fact that they're having a community event in Tokyo the day after the PTB drops would fit in really well with the rumors.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "blahblahsomethingyea",
                            "body": "In our timezone the event is the day OF the PTB",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "yukichigai",
                                    "body": "Well that's just even more fitting.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Valentinee105",
                            "body": "The ame event, I think, is having some bigger Tokyo Ghoul branded announcements as well.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "RealMaceWindu",
                    "body": "I’m planning on doing the same once it gets announced. How is the series?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "kuma_metal",
                            "body": "I'm only about 15 chapters in so far but I like it, it seems like it's setting up for some interesting stuff.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "The_L3G10N",
                    "body": "As someone who just finished reading it. It was really good. RE so far is struggling to keep my attention.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Full-Curve2567",
            "body": "Chaos Shuffle again 😒\n\nCurious what the Tadaima drop will be. Also curious what the Fearless Legends sale is beyond the old Rifts?\n\nAnd obviously: PTB finally. Don't get me wrong thank *god* we're getting that health update but I won't deny that Houndmaster dropped like a wet fart and it feels like we've been waiting for 6 months for new content.",
            "score": 19,
            "replies": [
                {
                    "author": "PCMasterCucks",
                    "body": "> Chaos Shuffle again 😒\n\nYou don't like No Mither bonanza?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Full-Curve2567",
                            "body": "If they restricted items and offerings it's fun. But as the mode is currently it's just Iridescent addon and map offering simulator. Sac Wards help with the second problem; not the first.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Rick_Napalm",
                                    "body": "Chaos shuffle should be CHAOS shuffle. Everyone gets a random item with random addons killers get random power addons. The game has 5 random offerings and all cosmetic pieces are randomized between the ones you own. \n\nNow THAT's chaos.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Full-Curve2567",
                                            "body": "I disagree on item randomization because it would feel like crap to play someone like Myers and get Scratched Mirror + Judith's Tombstone, or Artist and get Charcoal Stick + Ink Egg. I think there should be a baseline in the addons you get or items you bring to have some level of generalized consistency.\n\nI also think that the balance of purple and iridescent addons is intentionally meant to be overpowered so allowing them in a mode where players will intentionally be at a weaker power level (due to unknown perk builds) massively skews the balance in the side of the player who brings them.\n\nI *also* think that Commodious Toolboxes are much too strong as a Green but I mean if survivors aren't slapping Brand New Parts down for free it's probably fine.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "watermelonpizzafries",
                                    "body": "I completely agree with you. I usually end up going back to regular during Chaos Shuffle because people turn Chaos Shuffle into such a sweat fest",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Full-Curve2567",
                                            "body": "Just players who are too shit to win against players with good perks so they go into random perks mode, stack the most OP shit they have available, and try to rake in free wins that way. Same types of people who give up instantly if they don't have a \"good build\" in the mode where everyone's build is literally randomized.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Valentinee105",
                    "body": "Would have been the perfect time to bring back the giant oni mode instead. \n\nChaos Shuffle is fine but not so close to the one they just had.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "video-kid",
                    "body": "I'm with you. It looks like we might be getting 3 chapters this year instead of 4, and one of those is going to be FNAF which is pretty divisive. There's a balance between QoL and new content and I'm glad it's not a full stop to new content, though.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Embarrassed-Deal-157",
                            "body": "Honestly I'd take one less chapter this year if it means the health updates will be good. \n\nThe problem is that I'm neither interested in Tokyo Ghoul or FNAF, so it's going to be a slow year for me. I'm hoping they'll have good/fun perks so at least I'll get something to look forward to.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "video-kid",
                                    "body": "I think a vocal minority of FNAF fans here have acted really poorly and it's soured a lot of people, but I just personally don't find it that engaging. I like the *concept*, but I think it's just too young for me, and it does feel like horror for kids to an extent, and I don't think we need more kids and young teens playing DBD. I don't want DBD to be treated as a FNAF spin-off which is what I fear at least some of the newcomers will do.\n\nI started watching Tokyo Ghoul last night and it's pretty good. The only issue is that I'm watching it on Netflix and there's a lot of censorship for the gore. There's a lot of colour inversion and at one point the whole screen went black apart from a little patch and I thought my TV was fucked. I don't know if there's an uncensored/unrated version but it ain't on Netflix.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Duncaster2",
                                            "body": "You’re honestly better off reading Tokyo Ghoul instead of watching it. The anime gets really bad after the first season.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "video-kid",
                                                    "body": "Yeah, I think I will, I just got interested and saw it on Netflix.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "time__is__cereal",
                                            "body": "i've never played FNAF and don't really care for the gameplay or setting, but i am interested by its inclusion in DBD because of the potential for unique game mechanics, and that it's such a different kind of horror compared to what we've gotten. i think Singularity is the closest thing we've gotten to it.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Embarrassed-Deal-157",
                                            "body": "I get you.\n\nI hate mascot horror. To me, it's the literal corporatization of horror, where the genre is stripped of its most interesting parts, replaced by what's marketable and easily mass-produced. Sure, there's creepy elements and all, but it's all \"sanitized\" and fake, if that makes sense. Children's horror used to be cool, like Courage the Cowardly Dog, Billy & Mandy or Coraline.\n\nI don't want to blame FNAF that much, as I've heard its creator is actually very passionate and cares for the IP, unlike the FNAF clones that pretty much embody what I just said.\n\nThat said, I was never against FNAF coming to DbD. The popularity boost the game will get will probably surpass the Resident Evil chapter. If anything, I'm more worried about the game not being in a healthy enough state to maintain that player spike. That's probably the reason why they're doing the health update in the first place.\n\nOh! And while I agree with you that some FNAF fans will probably treat this game as yet another spinoff, I'm more hopeful that DbD will introduce those players to other types of horror.\n\nAs for Tokyo Ghoul, I'm interested to see how they'll translate the anime/manga artstyle into the game.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "video-kid",
                                                    "body": "Mascot horror I think has potential since there's something unsettling about the idea, but my issue with FNAF is that they kept milking it and the newer games have nothing in common with the older ones. It's lost its identity by trying to remain relevant, I guess. I played the first one, I was crap at it, and I think it's sadly become what a lot of survival horror games draw from. I've tried reading up on the lore but I don't get it, and it just feels like... the stan culture of video games, almost? It's one of these things I don't understand. I think it's *interesting* for sure, but it's definitely the least exciting licensed chapter I've seen outside of the survivor only ones. There hasn't been a licensed chapter I haven't been pumped for, but with this one I'll get it, I'll play it, I'll probably enoy it, but I don't personally see FNAF in the same level as Resident Evil or Silent Hill.\n\nA lot of people treat it as *the* horror franchise, and I got tired of the constant FNAF predictions and a minority of folks actively insulting people who *didn't* agree that a clip from Hellraiser was *obviously* hinting at FNAF, or acting as if something like Chucky wasn't relevant when he was literally starring in a TV show (which, by the way, fuck them for cancelling). \n\nI think it left a sour taste in a lot of mouths and it didn't do anything to make people want to play the games. I'm glad that that aspect will shut up, but I just hope that now that the chapter is coming out people act more maturely.\n\nAs for Cawthorn, I think he sold the franchise when it turned out he was a big Trump donater? It makes things a little complicated, even if he's into the IP.\n\nAs for the health increase I do agree it's necessary, but I also wonder how much of it is them anticipating future behaviour as well? Things like the idle crows, Go Next prevention, and isn't there something about no collision to stop body blocking as well? It might be cynical of me but as I said, I don't want people to treat DBD as a FNAF spin-off, but I can see a spike in toxic behaviour \"For the memes\" or people suiciding on hook because they wanted to face Springtrap and ended up going against Sadako. Hopefully those are a minority, and the majority of new players stick around and see what else DBD has to offer, or even potentially get introduced to some other fantastic horror franchises.\n\nAs for Tokyo Ghoul, I think it'll be an interesting addition. There's a lot of different ghouls with their own powers they could draw from, and we've previously seen manga/anime aesthetics done in a way that sticks to DBD's art style while still feeling authentic.",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "deadbydaylight-ModTeam",
                                            "body": "Thank you for visiting /r/DeadByDaylight; however, your submission has been removed under the following rule:\n\n**[Rule 5 - Avoid Inappropriate Submissions](https://www.reddit.com/r/deadbydaylight/wiki/rules#wiki_rule_5_-_avoid_inappropriate_submissions)** \n\n**Your submission was removed for one of the following reasons:**\n\n* Pornography, or overtly sexual submissions - please use the dedicated porn subreddits, such as r/DBDGoneWild\n* Submissions must be in English\n* For tech support, bug reports, etc. Please use the [official forums](https://forums.bhvr.com/dead-by-daylight/categories/bugs) or [customer support](https://support.deadbydaylight.com/hc/en-us/requests/new).\n* Excessively edgy or NSFL content (i.e., graphic injuries, gore, or death - this includes user-created and real life submissions)\n* Buying, selling, trading, or begging; Please use /r/DBDTrade, /r/GameTrade, or the Steam forums\n* In-game ban appeals (use the official Dead by Daylight Help Center, contact EasyAntiCheat [EAC] or contact the support team of your platform).\n* Individual actions of the /r/DeadByDaylight mod team; this includes post removals, or subreddit ban appeals. Please send us a modmail.\n* Overly political, religious, and otherwise unsuitable discussion for a video game subreddit.\n* Fake news and potential misinformation regarding the game.\n* Leaks of any kind; please use r/LeaksDBD, Twitter, or the leaks Discord instead.\n\nFor further information, please read our [subreddit rules](https://www.reddit.com/r/deadbydaylight/wiki/rules). \n\n**If you’ve read your removal message, and you’d like to discuss our decision, you can contact us** [**here**](https://www.reddit.com/message/compose?to=%2Fr%2Fdeadbydaylight)**.**",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "DarthyTMC",
                            "body": "why is fnaf divisive lmao? we have Nicolas Cage, RE, and Castlevania, the only difference is Fnaf is popular with people who are teens now, not people who liked RE/Castle as teens b4 but are now older",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "video-kid",
                                    "body": "I think a lot of people see it as \"horror for kids\" which might be unfair with the lore, or they think the gameplay is too simplistic.\n\nAt the same time, some FNAF fans have acted in a really immature way when it comes to theorizing, like insisting that iconic killers like Pinhead or Chucky don't deserve to be in DBD (IE claiming Chucky wasn't relevant despite the fact he was starring in a TV show when the chapter was announced) or outright refusing to consider that an obvious clue to a chapter (Most famously Hellraiser) was actually a hint for FNAF and occasionally getting downright hostile if others disagree. It's given people who know nothing about the franchise a bad impression.\n\nPlus there's Cawthorn being a Trump donor. Given how big DBD's queer fan base is and the fact that horror has always been more on the liberal side of things, I think that's also left a bad taste in a lot of mouths.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Karth321",
            "body": "Fair enough.\n\nNot too bad\n\nStill want to see that Bloodmoon Banner or more info from it though",
            "score": 3,
            "replies": []
        },
        {
            "author": "CasperDeux",
            "body": "Pretty cool, although I kinda wish we got lights out instead of chaos shuffle. I know I’m the minority on that and I’m still happy to get chaos shuffle",
            "score": 5,
            "replies": [
                {
                    "author": "VulgarT0ngue",
                    "body": "lights out is 100x better than chaos shuffle",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Bravely_Default",
            "body": "Everyone crying about no new outfits are the same people who were crying for an operation health; there really is no pleasing you people.",
            "score": 2,
            "replies": [
                {
                    "author": "DecutorR",
                    "body": "Pretty sure they are different groups.\n\nI for one never wanted operation health and always want BHVR to focus on new content.\n\nBut you absolutely can generalize and just call it \"DBD community\", then yes, the community complains one way or the other.\n\nThe worst part?\n\nPeople that demanded operation health will be twice as angry after its over (like it happened to every single game that tried it) so BHVR gains literally nothing from this move other than pissing people off.\n\nIt pisses off those that want content.\n\nIt pisses off those that truly believe \"operation health\" fixes any game where its attemped.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "am-a-g",
            "body": "Soooo next chapter announcement isn't too far off 👀",
            "score": 2,
            "replies": []
        },
        {
            "author": "watermelonpizzafries",
            "body": "Chaos Shuffle is cool and all, but as a Lights Out enjoyer (I know I'm a minority) I would love to see it in the rotation more because I love it on both sides.\n\nAlso, please, if Chaos Shuffle is going to be basically monthly now, please have the items/addons both sides can bring be completely randomized (for the sake of randomness) and have map and hatch offerings disabled because having the ability to pick specific items/add-ons to bypass shitty perks you might get while also being able to pick a specific map (I bring sac wards in shuffle because map offerings in it are such a problem) offering to favor you saps the fun out of it. The only offerings that should be allowed in it are BP offerings",
            "score": 2,
            "replies": []
        },
        {
            "author": "theyoungandtheb",
            "body": "I’m bored",
            "score": 2,
            "replies": []
        },
        {
            "author": "-Eightball-",
            "body": "Remember new outfits? We got them like every week.\n\nGood times.",
            "score": 4,
            "replies": [
                {
                    "author": "EmeraldGhostface",
                    "body": "It's the consequence of BHVR locking in for the health of the game, and I'm all for it",
                    "score": 28,
                    "replies": [
                        {
                            "author": "-Eightball-",
                            "body": "I don't disagree but BHVR is a big enough company that the art team shouldn't be fixing bugs.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "EmeraldGhostface",
                                    "body": "I think the team who makes the skins is not the same team who makes the skins *in game*",
                                    "score": 14,
                                    "replies": []
                                },
                                {
                                    "author": "Space_Waffles",
                                    "body": "True but they may also be hyper-focused on next chapter or FNAF chapter stuff",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "FoggyGlassEye",
            "body": "Year 9's roadmap said this month would have a licensed Killer chapter released. Are they delaying it, or is that part of the PTB?",
            "score": 1,
            "replies": []
        },
        {
            "author": "THC017",
            "body": "Anyone know what the 12th is about?",
            "score": 1,
            "replies": [
                {
                    "author": "epikpepsi",
                    "body": "They're holding an event in Japan. Current theory is that they're going to announce the next chapter there.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Numerous-Ad6898",
            "body": "I'm wondering if there will be another fragment frenzy like last rift😍",
            "score": 1,
            "replies": []
        },
        {
            "author": "Frakezoom88",
            "body": "Do we know who the Killer is?",
            "score": 1,
            "replies": [
                {
                    "author": "Megadoomer2",
                    "body": "Nothing's been officially announced, though the Taidama event in Japan is going to involve a gameplay reveal for the new killer, so it's seemingly going to be someone who's popular in, well-known in, or originates from Japan.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DarthyTMC",
            "body": "Chaos Shuffle back!!! slay",
            "score": 1,
            "replies": []
        },
        {
            "author": "theCOMBOguy",
            "body": "PTB and Chaos Shuffle/Bloodhunt carrying this month HARD",
            "score": 1,
            "replies": []
        },
        {
            "author": "SassySnappingTurtle",
            "body": "Chaos shuffle again huh.  Might as well just do it every weekend.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cyber-Slxt2005",
            "body": "Not seeing much people commenting about them keeping Ken Kaneki such a big secret and surprise, although with this months’ roadmap it makes it even more fitting and likely for him to be this month’s killer. The tokyo community event happening at the same time the PTB comes out… i really hope it’s him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "walmart-brand-barbie",
            "body": "Does the ptb being tomorrow mean we’re getting an announcement for the new killer",
            "score": 1,
            "replies": []
        },
        {
            "author": "ExoticSuccess6574",
            "body": "no st patricks outifts?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Drakal11",
            "body": "Not at all hopeful that it'll actually happen, but I would love nothing more than them actually banning items and addons for chaos shuffle like with 2v8 or make them random (minus the meme killer addons that destroy your power). It was so obnoxious how such a massive percentage of people decided to go into every match in the random mode with full meta items or addons rather than just embracing the chaos and making matches actually interesting since you don't have these massive crutches and actually have to try and play around the perks you got.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Sweet_Terror",
            "body": "Is the PTB to test out the new QOL implementations? I thought there wasn't going to be a new chapter this time around.\n\nAlso, when can we start seeing fun experiments like My Little Oni again?",
            "score": 1,
            "replies": [
                {
                    "author": "qwertyboi4",
                    "body": "its a new chapter ptb, yeah",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Sweet_Terror",
                            "body": "No, I mean since BHVR announced that there won't be a usual killer chapter this time around since they're instead working on a \"health\" chapter, is that what we'll see in the PTB?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Fike101",
                                    "body": "no its the new killer it just got delayed is all not canceled",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Sweet_Terror",
                                            "body": "Oh, ok. Thanks!",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "qwertyboi4",
                                    "body": "yeah, this is the solo killer chapter outlined in the roadmap for the year",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "vchnosti",
                                    "body": "Operation health was a lie, theyre not actually pausing new content to fix the game, theyre just pushing it back by a week or two as if thatll fix anything.",
                                    "score": -2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ChrisRedfield129",
            "body": "Nothing interesting",
            "score": 0,
            "replies": []
        },
        {
            "author": "NakiMode",
            "body": "OMG so much content!!!!1!1!!",
            "score": -2,
            "replies": []
        },
        {
            "author": "fagger--456",
            "body": "Probably not gonna be anime chapter weebs coping",
            "score": 0,
            "replies": []
        },
        {
            "author": "Valentinee105",
            "body": "So they're going to announce the new killer the same day as the ptb launch?\n\nThis guy is gonna get zero hype.",
            "score": -5,
            "replies": []
        }
    ]
}