{
    "title": "What \"non horror\" IP do you REALLY want ingame? For me it's Control",
    "author": "TheSleepyBarnOwl",
    "subreddit": "deadbydaylight",
    "rank": 10,
    "score": 177,
    "upvote_ratio": 0.89,
    "num_comments (reported by reddit)": 227,
    "url": "https://i.redd.it/5ex8nz4nvipe1.png",
    "id": "1jehjc5",
    "selftext": "",
    "comments": [
        {
            "author": "FriedSolidWater",
            "body": "Half life. A Gordon Freeman paragraph with a head crab mask for all original survivors.",
            "score": 99,
            "replies": [
                {
                    "author": "TheSleepyBarnOwl",
                    "body": "oh that'd go hard",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "Valentinee105",
                    "body": "Gordon with Alyx legendary and Barny legendary skins.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "lizardjoe_xx_YT",
                    "body": "Half life isn't horror?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "TheLegendaryPilot",
                            "body": "What is the name of this post, my good sir?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "FriedSolidWater",
                            "body": "I mean there are zombies but you're armed to the teeth so it's not that scary. Kinda like doom.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "buildmaster668",
                            "body": "The series has always had horror elements, though there's enough parts that aren't horror to make it a weird label. You could maybe call it action horror.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TheFairKiller",
                    "body": "Read the title, thought Gordon Freeman, saw your comment, being glad many people still smell the ashes.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "buildmaster668",
                    "body": "Father Gregori",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "A1dini",
            "body": "https://i.redd.it/or73azt7yipe1.gif",
            "score": 40,
            "replies": [
                {
                    "author": "Doomterminator01",
                    "body": "Yes.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "nomoreinternetforme",
                    "body": "You could argue the first terminator is a Slasher, so it wouldn't be too far a stretch",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Tnerd15",
                            "body": "The first one is 100% a slasher",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "apieceofsheet9",
                    "body": "found otz",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "SCameraa",
            "body": "Metal Gear Solid.",
            "score": 34,
            "replies": [
                {
                    "author": "KamenKnight",
                    "body": "Snake has to make that iconic death cry and the icing on the cake of when Snake dies you hear someone over the coms saying \"Snake? Snake!? ***SSSSSNNNNAAAAKKKKEEEE!!!!!***\"\n\nAlso, his box should be a stealth perk where whenever you're stock still in it, you have Wraith's cloak. But anyone bumping into you makes you viable.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "xd-Sushi_Master",
                            "body": "Goanna need a voiceline for kicking Victor too.\n \n\"Boss! You killed a chil- great work! This is why you're the best!\"",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "SCameraa",
                            "body": "That or a perk that's let's u go \"prone\" similar to plot twist. Had a game where I was messing around with plot twist, tenacity, flip flop, and power struggle. Had a scenario in end game where I plot twisted, 99d the plot twist, then was crawling to the exit gate trying to avoid the killer and to get close enough where I can \"get up\" and use the hit speed boost to escape. That was the game I thought \"man it would be cool to have solid snake or big boss in the game.\"",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ThanksFluffy1207",
                    "body": "![gif](giphy|muNcDSuINVr1e)",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "radiant_icon",
            "body": "i loved control, i completed it, (with auto aim 🤫 ) that counts though right?",
            "score": 34,
            "replies": [
                {
                    "author": "TheSleepyBarnOwl",
                    "body": "Sure counts! No shame in playing games in a way you enjoy! (Also Launch is basically auto aim anyways so 90% of people play the game with pseudo auto aim ;)",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "Targetshopper4000",
                    "body": "I completed the game without it, or any of the cheats/modifiers. The combat was always such a slog, I wanted to explore the world which was so damn interesting, but every. single. room. had an extended combat sequence that blew it apart.\n\nWhen I played the DLCs I used the modifier that made everything die in one hit. 1000x more enjoyable.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "TheSleepyBarnOwl",
                            "body": "True, combat get's a bit stale after a while",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Elite_gamer228",
                    "body": "You gotta control your aim 🤣🤣🤣",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "ZengZiong",
                    "body": "complete a single player game however you want. It was wayyy too short for me tho :(",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "QuilledRaptors2001",
            "body": "Dream comic rep Killer\n\n![gif](giphy|RALT90at2BINGROHXj)",
            "score": 16,
            "replies": [
                {
                    "author": "San-Carton",
                    "body": "I'm on the DC side here...\n\nhttps://preview.redd.it/u94psp5c4jpe1.jpeg?width=960&format=pjpg&auto=webp&s=fba024fe557dbfb747b205064813b2b8b93f0447",
                    "score": 11,
                    "replies": [
                        {
                            "author": "QuilledRaptors2001",
                            "body": "Another great pick",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "PREPARE_YOURSELF_",
                            "body": "Both as survivors, killer is spiderman writers.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "NuclearChavez",
            "body": "Either Jurassic Park or Star Wars. I think despite the franchises as a whole not being horror, they work in the context of the game and can be scary in their own right.",
            "score": 23,
            "replies": [
                {
                    "author": "gracist0",
                    "body": "not until dawn?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "NuclearChavez",
                            "body": "Until Dawn is a horror IP, the post asks for non-horror IPs.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "gracist0",
                                    "body": "ohh what am I talking about haha",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Trem45",
                    "body": "If they ever did Star Wars, I hope they dig into the lore for someone and not just go for Vader or something\n\nDespite him decently fitting for the game, I feel like it'd be really hard to see him as scary if that makes sense?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "robertman21",
                    "body": "Jurassic Park is definitely horror",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "StrisselStudios",
            "body": "Well, it's SUPPOSED to be at least a horror adjacent game,  so nothing of the sort. But they should add the Refrigerator from Control. That shit is horrifying",
            "score": 26,
            "replies": [
                {
                    "author": "TheSleepyBarnOwl",
                    "body": "RIP Phillip",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "New-Development7218",
            "body": "That's totally horror",
            "score": 26,
            "replies": [
                {
                    "author": "frogfuckers",
                    "body": "Not at all, but if Control 2 is like Alan Wake 2 it might ramp up the horror elements and make it horror.",
                    "score": -3,
                    "replies": [
                        {
                            "author": "TheSleepyBarnOwl",
                            "body": "dunno if they're gonna genre shift so hard. I hope nit cause the action gameplay of Control is great :)",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "frogfuckers",
                                    "body": "Control is super fun, but was just arguing if it was horror or not. I'd say Gears of War is scarier than Control lol",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "TheSleepyBarnOwl",
                                            "body": "Control has it's moments but no, it's not horror. It's unashamed Action. I mean...\"TAKE CONTROL\" - need I say more xD",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Nathansack",
                            "body": "Well Alan Wake is inspired by Stephen King, it's maybe not exactly horror  \nBut it also have lot of horror elements (mostly linked to surnatural events happening)",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Ok-Wedding-151",
                                    "body": "Alan Wake is Twin Peaks more than anything",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "CatchTheWolf",
            "body": "Jesse would make an awesome survivor and her perks could be a new type tbh. For me, I would love a Portal or Half-Life chapter unironically.",
            "score": 19,
            "replies": [
                {
                    "author": "TheSleepyBarnOwl",
                    "body": "Portal gives me shivers cause of the setting - Cell would go hard as a Survivor.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "CatchTheWolf",
                            "body": "You mean Chell? Oh 100%. She is so stubborn yet cunning and that could be reflected in her perks.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Greedy_Ad6035",
            "body": "Dishonored",
            "score": 16,
            "replies": [
                {
                    "author": "Zomer15689",
                    "body": "Corvo would be a interesting concept as a killer, considering the chaos System in the game, it could canonically work.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "PREPARE_YOURSELF_",
                            "body": "A killer that can benefit from purposely not killing. I imagine you could knock out survivors cold to keep them out of the game without progressing the high chaos, or injuring them repeatedly to increase the chaos higher. Dishonored has zombie equivalents in both games and they increase with chaos, but on the other hand keeping a lower chaos decreases security in future levels. He also has a great mix of abilities: teleport, stealth, range attacks, melee techniques, magics... Since the series makes a focus on approaching encounters however you please, I feel like he could have dream pallet type add-ons that change his power with different runes or bone charms. Definitely would be one of the more complex killers.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AdCold6788",
            "body": "Oddworld would be cool. Batman as well",
            "score": 8,
            "replies": [
                {
                    "author": "ReddKnight10",
                    "body": "PH MY GOSH Abe as a survivor would go so hard. A new invocation perk with the chanting could be fun",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "TrufasMushroom",
            "body": "I'm all in for a control chapter or collab if that also gets us Alex Casey as a legendary skin for Alan Wake",
            "score": 8,
            "replies": [
                {
                    "author": "TheSleepyBarnOwl",
                    "body": "Alex Casey is the GOAT",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "JustAlex_AI",
                    "body": "Imagine hanging the Remedy CEO on the hook",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Darth_Amarth",
            "body": "Alan Wake needed to be a full chapter.\n\nI'm hopeful a Control chapter will be **the** Remedy-verse chapter that we wanted. Remedy has a good relationship with BHVR, and the lore of both universes fit like they were made to be crossed at one point.",
            "score": 7,
            "replies": [
                {
                    "author": "Super_Imagination_90",
                    "body": "Alan Wake not being a full chapter when they were almost going to have Scratch as a killer is still a really sad thing. I would especially love to have American Nightmare Scratch. Who knows though. They could pull as you say, the Remedy-verse chapter. They could always include Scratch in there with Jesse or something wild.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "TheSleepyBarnOwl",
                    "body": "Alan Wake would habe been such a dope chapter. As is, I'm just glad he's here at all",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Darth_Amarth",
                            "body": "Yeah, at least he's here.\n\nWe've gotten some Alan Wake stuff post release, so I'm still hopeful we'll keep getting content. Something that probably will not happen but would be cool nonetheless are music packs. I know it could take away some of the horror aspect and whatnot, but imagine being chased (or chasing) with Balance Slays The Demon or Take Control",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Ibellasnowrider",
                    "body": "Yeah, I always feel that Alan Wake chapter should have a killer and since we now get a mentally broken Kaneki that fully succumb to his ghoul hunger as a killer, a version of Mr Scratch that take prema-control of Alan should be one too that or Barbara Jagger",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "EichenSoldat",
                    "body": "I'm so frustrated we didn't have Scratch as a killer, and the chance of having it is just minimal.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "idk48d",
            "body": "Something bout having Stanley from the Stanley parable as a survivor would be most pleasing",
            "score": 6,
            "replies": [
                {
                    "author": "TheSleepyBarnOwl",
                    "body": "Make all of his actions narrated xD",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "JermermFoReal",
            "body": "Invincible\n\nMortal Kombat\n\nElden Ring\n\nULTRAKILL",
            "score": 13,
            "replies": [
                {
                    "author": "tsilver33",
                    "body": "An Omni-Man killer could legit be terrifying if done right, goddamn.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "JermermFoReal",
                            "body": "I was thinking Conquest.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "GaymerWolfDante",
            "body": "That would be a lot of fun and Jesse would be another non human/not natural human, so that would be interesting.  She would probably need a mark of the entity too with how bad ass she is.",
            "score": 6,
            "replies": [
                {
                    "author": "TheSleepyBarnOwl",
                    "body": "A Survivor with that Mark would go so hard",
                    "score": 3,
                    "replies": [
                        {
                            "author": "GaymerWolfDante",
                            "body": "I mean if she still had her power imagine how the trials would go lol  any killer would end up being turned into paste after being thrown into the nearest wall 500 times in a row.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "TheSleepyBarnOwl",
                                    "body": "But I just realised: all the Entity would have to do is just take her. She gets her powers from OOPs - if she gets separated from them she'd be a regular human again",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "GaymerWolfDante",
                                            "body": "That is true, but the question is, if the entity takes her does that cut her off from the OOPS, because remember she does do a bit of traveling through dimensions in Control.  \nBut I guess it also depends on who is more powerful, but we do know the Entity has destroyed worlds and universes before.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "TheSleepyBarnOwl",
                                                    "body": "I would rate the Entity above the power of the Board.\n\nBut true, she at least travvels to the Astral plane a lot. But maybe that's not an issue cause Altered items and OOPs are deeply connected with the Asteal plane to begin with",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "GaymerWolfDante",
                                                            "body": "That is very true and not the first higher being the Entity has possibly pissed off before. Like the Gods of Silent Hill and even the town itself, the Mind Flayer from Stranger Things and even Vecna who is impressive on his own and one of the few beings that needed the Entity to mark him.  \n  \nI could see her having smaller effects on in game items and boosting their powers possibly, but nothing like the OOP that she is use to.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Keyboard_Gospel",
            "body": "Darth Vader, he's the most non-horror villain that could fit. If DnD Vecna could find a good spot in dbd Vader for sure can",
            "score": 5,
            "replies": [
                {
                    "author": "TheSleepyBarnOwl",
                    "body": "True",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ReZisTLust",
            "body": "Ahti humming and singing in the hallway would be my crutch",
            "score": 5,
            "replies": [
                {
                    "author": "TheSleepyBarnOwl",
                    "body": "Like the RE save theme plaxing in the RE map - you can hear Athi humming through closed Janito closets! Make it random whuch song he hums when the map loads :D",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ReZisTLust",
                            "body": "I'd like him zoned out on every variant too, dont need it locked behind Easter eggs",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "dmitrogorsky",
            "body": "Jesse as a new Legendary for Alan would be great. I think I'd prefer Alex Casey though, so that we'll essentially get him, Max Payne and Sam Lake at once",
            "score": 5,
            "replies": [
                {
                    "author": "TheSleepyBarnOwl",
                    "body": "Screw it, just Sam Lake as Survivor xD",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "whisperingstars2501",
            "body": "YES PLS CONTROL OMG",
            "score": 6,
            "replies": []
        },
        {
            "author": "Dismal_Tadpole_4328",
            "body": "Scooby Doo",
            "score": 10,
            "replies": [
                {
                    "author": "TacoButtSlut",
                    "body": "A 4 survivor chapter would be so fun",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "grim_Judgement",
                    "body": "I can actually see this being in the game sure it isn't horror it's mainly a mysteries show but it's pretty horror adjacent especially with mystery Incorporated.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Pokepunk710",
                    "body": "I don't even love Scooby Doo but it fits so well idk how it's not in lol",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "GhostlyOnryo",
            "body": "Non horror? I'd want Nier: Automata",
            "score": 9,
            "replies": [
                {
                    "author": "frogfuckers",
                    "body": "2B for Sable and 9S for Jake would be great",
                    "score": 6,
                    "replies": [
                        {
                            "author": "GhostlyOnryo",
                            "body": "Nah, i'd much rather it be a chapter, i feel like just skin would make it look weird, and 2B/9S perks could also be interesting",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "frogfuckers",
                                    "body": "I'd prefer skins over nothing, I couldn't imagine them doing a Nier paragraph. Would but super cool though and I'd insta buy",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "GhostlyOnryo",
                                            "body": "So would i and yes i agree, but even then, a full chapter would be possible, the map could be an expansion to eyrie of crows and the killers Adam or Eve, or both.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "reevethewriter",
                                                    "body": "I think the Killer would be the Shadowlord/World-Ender (Father version as a personal preference) or the Red Girls (aka N2) since both caused a lot of deaths and tragedy. \n\nFor survivors 2B as the main costume but I would love to see 2P as her alt color while other characters like 9S, A2, 10H, Hina, and Kaine as legendary costumes.\n\n\nWould like the glitching Cage as the map.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "GhostlyOnryo",
                                                            "body": "That is actually a much better idea yeah",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "In_My_Own_Image",
                    "body": "I wonder how they'd handle the look of 2B because, if I recall correctly, the creator of 2B/Nier is pretty adamant about 2B's outfit being accurate and not toned down and we know DBD doesn't allow thongs/exposed buttocks.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Glass_Ad_1490",
            "body": "Control was my first platinum trophy on PlayStation. So I wouldn't mind at all if they added a Control chapter.",
            "score": 5,
            "replies": []
        },
        {
            "author": "horrorfan555",
            "body": "![gif](giphy|sFSkNNeNKDAJ2|downsized)",
            "score": 4,
            "replies": []
        },
        {
            "author": "medullah",
            "body": "\"Watch out Jesse, Legion is coming for us!  They're very fast and have a knife and oh never mind you just telekinetically threw them into space\"",
            "score": 4,
            "replies": [
                {
                    "author": "TheSleepyBarnOwl",
                    "body": "She'd need an Entity mark ye xD\n\nThough. Maybe the Entity can Unbind the OOPs so she's powerless again - no floppy disc, no telekinesis",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AutismSupportGroup",
            "body": "That is horror. Not by genre (and even then I'd argue a level of psychological horror), but by themes. But still horror. The only entirely non-horror IP in the game that I can think of is R6S ... and Nicolas Cage. For Honor if you count the charm, I guess.\n\nBut, knowing most people wouldn't count it as horror, I'd go with The Mask - specifically the comics. Big Head is a nigh unstoppable force of unnature, only impeded by the morals and ethics of its human counterpart.\n\nIf you've only seen the classic Jim Carrey movie, then just take my word for it, Stanley Ipkiss' Big Head is not just a charismatic wiseguy with looney tunes antics, he is a cold blooded maniac, and during his relatively short time with the mask he killed countless people.\n\nThe best part about a The Mask chapter? They could pull a Ghost Face, and make an entirely original character that specifically fits what they want it to be!",
            "score": 4,
            "replies": [
                {
                    "author": "TheSleepyBarnOwl",
                    "body": "Well that's why I put \"not horror\" in quotation marks :)",
                    "score": 2,
                    "replies": [
                        {
                            "author": "AutismSupportGroup",
                            "body": "Yeah that's my bad. I'm just really tired of people arguing what is and isn't horror in this game.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "TheSleepyBarnOwl",
                                    "body": "Me too tbh. It's ridiculous the gatekeeping. I half expected ppl to gatekeep me with Control",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Perfect_Employee_257",
            "body": "Doctor Who",
            "score": 8,
            "replies": [
                {
                    "author": "TheSleepyBarnOwl",
                    "body": "Comes woth 16 legendary skins",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "KamenKnight",
                    "body": "Who would the killer be?\n\nThey have so many to choose from.\n(But I think either Darleks or Cybermen would be picked as the killer)",
                    "score": 2,
                    "replies": [
                        {
                            "author": "ShiddyMage1",
                            "body": "I think a Dalek or Weeping Angel would be the *ideal* choice, but logistically i don't think either would work out well, so probably a Cyberman",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "KamenKnight",
                                    "body": "I don't think Weeping Angles could work in a multiplayer game. They only move when you don't look at them, and stealth killers already have a hard time getting accidently spotted. So I can't imagine how much harder it would be for the angles to work...\n\nI can see the Daleks working like the ray gun is just taking a long time to reload between shots. With the plunger as the basic attack. (Plus, they can just hover up stairs)\n\n But the Cybermen are just men in costumes, so they're the \"easiest\" to make. The question then becomes which Cyberman is going to be it? The 10th Doctors? The new sleek design ones? Or go old school with one of the classic Cybermen?",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Lolsalot12321",
                                    "body": "Cyberman or dalek are the ideal ones for me imo\n\nI fuck hard with the cyberman design, plus singularity is cool and all, but I want a straight up classic robot killer, no meaty bits",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "KamenKnight",
                                            "body": "Depending on the Cyberman. There are still meaty bits, just underneath the suit or face plate.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "PsychoUmbreon1082",
                            "body": "A weeping angel could go hard if done right.\n\nLet me write up a rough concept.\n\nKiller: The angel\n\nMedium\n\n24 meter TR\n\n115%\n\nPower: Don't Blink\n\nWhen not being observed by any survivor, The Angel gains 35% haste and is undetectable. \n\nThe Angel can not grab survivors off of generators, chests or totems.\n\nWhen observed by any survivor, The Angel can not move.\n\nEvery 5 seconds, all survivors observing the angel will \"Blink\" for 1 second obstructing view of The angel, during this time they will move at 175% for the 1 second, this Blink timer is shared by all observing survivors.\n\nPerks: \n\n1: Don't look away\n\nWhiles survivors can not see you gain 2/4/6% haste.\n\nWhiles survivors can see you gain 1/1.5/2% hinder.\n\n2: Hex: Lifespan Siphon\n\nAt the start of a trial, this perk inhabits a random dull totem, turning it into a hex totem.\n\nWhiles this perk is active damaging a survivor by any means will grant 3/6/9% basic attack recovery time on successful attacks up to a cap of 12/24/36%\n\n\n3: Quantum lock\n\nAt the start of the trial, gain 3/5/9/% hinder\n\nEvery generator completed gives 1/2/3% haste",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "KamenKnight",
                                    "body": "Multiplayer just breaks the Weeping Angles.\n\nAll it takes is 2 survivors look at it to completely have the angle frozen in place for the whole game.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "PsychoUmbreon1082",
                                            "body": "That's why the Blink cool down is shared amongst all survivors\n\nAka they all Blink at the same time.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "LittleFireShovel",
                            "body": "The Master surely.  His power would be his iconic shrink ray thing and bhvr can reuse code from My Little Oni",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SatisfactionRude6501",
            "body": "With the T-1000 coming to MK1, i really want a Terminator 2 chapter with the T-1000 and Sarah Connor.",
            "score": 3,
            "replies": []
        },
        {
            "author": "StrisselStudios",
            "body": "Well, it's SUPPOSED to be at least a horror adjacent game,  so nothing of the sort. But they should add the Refrigerator from Control. That shit is horrifying",
            "score": 3,
            "replies": []
        },
        {
            "author": "itzliamm",
            "body": "I would like to get Ghostwire Tokyo. I’m not sure if some people consider it horror…",
            "score": 3,
            "replies": [
                {
                    "author": "Wampao",
                    "body": "That sounds very nice conceptually - not sure what gimmick we'd give the Killer except summoning Visitors à la Knight.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "LordRiden",
            "body": "A Halo chapter \n\nFlood Pure Form for the killer\n\nSgt Johnson for the survivor\n\nInstallation 05 for the map",
            "score": 3,
            "replies": []
        },
        {
            "author": "NicoTheBear64",
            "body": "Dragon Ball, just to piss that one neckbeard off",
            "score": 3,
            "replies": []
        },
        {
            "author": "NOCTURN_05",
            "body": "I want control in the game so bad. I made a whole [concept chapter](https://www.reddit.com/r/deadbydaylight/s/WVgWfBaDF3) for it way back before the return of Stranger Things. Jesse, Dylan, the Oldest House, all of it",
            "score": 3,
            "replies": [
                {
                    "author": "TheSleepyBarnOwl",
                    "body": "Yea I saw it back then :)",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "L1MPWR1ST666",
            "body": "![gif](giphy|l0MYHpCZ9yxKXIsjC)",
            "score": 2,
            "replies": []
        },
        {
            "author": "RandomCaveOfMonsters",
            "body": "I want awaria girl as a survivor (she's so me coded)",
            "score": 2,
            "replies": []
        },
        {
            "author": "BunbunTheJackalope",
            "body": "She's part of the Alan wake universe, they could totally add Jessie as. Legendary skin for alan",
            "score": 2,
            "replies": []
        },
        {
            "author": "MatchaEmerald71",
            "body": "Metal Gear Solid. Not because I like the series, But because it would be mad funny to get him as a killer.\n\nhttps://preview.redd.it/a3vcyja71jpe1.png?width=838&format=png&auto=webp&s=9b1427919aa95c4f211f0661f81126126f72cc3f",
            "score": 2,
            "replies": []
        },
        {
            "author": "GoobieHasRabies",
            "body": "Invincible or The boys would be awesome",
            "score": 2,
            "replies": []
        },
        {
            "author": "Astrium6",
            "body": "Isn’t *Control Remedy* an *Alan Wake* spinoff? How the hell is it not horror?",
            "score": 2,
            "replies": [
                {
                    "author": "NOCTURN_05",
                    "body": "Not exactly a spinoff, just part of the connected universe. It definitely has some big elements of horror and scary things in it, but it isn't your typical horror gameplay, playing more like a superhero game (i.e. Spiderman, Prototype, InFamous)",
                    "score": 2,
                    "replies": [
                        {
                            "author": "TheSleepyBarnOwl",
                            "body": "Best Jedi game. unironicaly",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TheSleepyBarnOwl",
                    "body": "No not really. When Control was made it was a new IP. The only mentions of AW were hidden in easter eggs. Till the AWE DLC that is. It's an action game through and through! Yes, even more than Max Payne. Payne was scarier than Control.\n\nControl and AW are connected in the sense that they play in the same universe and that in AW weird events happened and the organisation from Control (the FBC) deals with weird things. Like SCP foundation.\n\nYou should play it if you haven't - it's a wild ride :)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "WhimsyPeddler",
            "body": "I've been saying this!!!\n\nI literally ran around the game the other day to see what areas might make good maps (Mail Room, Logistics, Ordinary AWE were my top picks)\n\nAnd Dr. Hartman as The Third Thing would be a great Killer that could tie in Alan Wake",
            "score": 2,
            "replies": []
        },
        {
            "author": "SoDamnGeneric",
            "body": "Star Wars. Darth Vader would be the easiest killer for them to make, and the Death Star could make for a fun map. Then just make the survivor some rando rebel\n\nAlso Invincible. Do an alternate universe where Mark never got his powers, making him the survivor, while Omni-Man is the killer.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Kinsa83",
            "body": "Control already has a foot in with Alan Wake. Its part of the same universe",
            "score": 2,
            "replies": [
                {
                    "author": "TheSleepyBarnOwl",
                    "body": "I want it so bad you don't even know how bad",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "WoodenToaster9k",
            "body": "A control themed map inside The Oldest House, and possibly with a maze section would be peak... which unfortunately means we probably won't ever get it, but we can dream.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Medium_Web_9135",
            "body": "If Alan Wake got in I wouldn't be surprised to see Control, at least as a Legendary skin.\n\nAnyways: WheatDraws made a concept for Jacket from Hotline Miami as a killer and I could never get it out of my head. I love the idea of a swift and brutal street vigilante killer. Maybe not necessarily Jacket; an original killer would be cool too.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ok-Wedding-151",
            "body": "I’d fully expect control to come with control 2’s arrival\n\nRemedy likes doing this stuff ",
            "score": 2,
            "replies": []
        },
        {
            "author": "Maultaschtyrann",
            "body": "YOU ARE A WORM THROUGH TIME",
            "score": 2,
            "replies": [
                {
                    "author": "TheSleepyBarnOwl",
                    "body": "THE THUNDERSONG DISTORTS YOU",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "acebender",
            "body": "Control is such a cool IP, I wonder what they could do with it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "LookasMook",
            "body": "So based. I think there's a lot more potential for a Control chapter then say, an SCP chapter. Oldest House as a map, (De-powered) Jesse as a survivor and maybe Dylan as a Killer? I also read an idea from someone of creating a set of \"Hissified\" killers, similar to the blighted cosmetics. I'd love a tome similar to what Alan Wake got, the FBC trying to make contact with the Entity's realm or something similar to that premise.",
            "score": 2,
            "replies": [
                {
                    "author": "TheSleepyBarnOwl",
                    "body": "Oh Hiss cosmetics would go so hard!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mangle3",
            "body": "You've got no idea how badly I want Jesse, Alan Wake is one of my favorite games of all time, and was my most wanted chapter up until it released and given how closely tied together Control and Alan Wake are at least gimme a Jesse legendary",
            "score": 2,
            "replies": [
                {
                    "author": "TheSleepyBarnOwl",
                    "body": "Control is my favourite game of all time. Tbh I only started playing AW due to the DBD chapter announcement. Then I played 1, AN and 2. I love it! But Control is still my favourite. Ever since the AW chapter I hope so hard for a Control chapter :)",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Super_Imagination_90",
            "body": "Control would be perfect to go with Alan Wake. Hell, they could just make Jesse a legendary as well if they wanted to.",
            "score": 3,
            "replies": []
        },
        {
            "author": "KingBlackFrost",
            "body": "Final Fantasy VIi. Sephiroth with one winged angel as his chase theme? Plus Cloud and Aerith as survivors with Tifa legendary? Take my 💰",
            "score": 4,
            "replies": [
                {
                    "author": "TheSleepyBarnOwl",
                    "body": "Oh good one!",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "reevethewriter",
                    "body": "Burning Nibilhiem as the map, bodies scattered everywhere from Sephiroth carnage.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "RodrigoOlabiaga",
            "body": "I NEED shirtless Casper Darling. ![gif](emote|free_emotes_pack|heart_eyes)",
            "score": 3,
            "replies": [
                {
                    "author": "TheSleepyBarnOwl",
                    "body": "https://preview.redd.it/33quxrg17jpe1.jpeg?width=1322&format=pjpg&auto=webp&s=1b318a7e7c8b8f09e8419d26806665efd6b24e78\n\nI am totally not a fan of his and totally not extremely unhinged",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Kitty_Alysha",
            "body": "I never understood that game",
            "score": 1,
            "replies": [
                {
                    "author": "TheSleepyBarnOwl",
                    "body": "Well... That's partly due to design :)\n\nIdk if you know SCP foundation, but that's also very similar. Otherwise if you care there's brilliant yt videos :)",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Kitty_Alysha",
                            "body": "I started it and never finished it, not because i didn't like it, I just had no idea what was going on",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "TheSleepyBarnOwl",
                                    "body": "fair enough tbh",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Argynvost64",
            "body": "I’d kill for a Jurassic Park or Star Wars chapter. A raptor and Darth Vader would make such cool killers.",
            "score": 1,
            "replies": []
        },
        {
            "author": "faabeli",
            "body": "elder scrolls and nothing else even comes close (except maybe berserk and nier). oh how i dream of a jyggalag skin for knight that changes the guards into knights and priests of order...",
            "score": 1,
            "replies": []
        },
        {
            "author": "keelekingfisher",
            "body": "I've said it before and I'll say it again - Hotline Miami. Give us Jacket as a killer please",
            "score": 1,
            "replies": []
        },
        {
            "author": "Consistent_Ad2255",
            "body": "ULTRAKILL full chapter would be beyond sick, other ideas would be like...The Witcher or an anime chapter",
            "score": 1,
            "replies": []
        },
        {
            "author": "theCOMBOguy",
            "body": "Darkest Dungeon. Come on, Behaviour owns them now anyway. Might as well.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Power-Core",
            "body": "StarCraft, Warcraft, and Danganronpa.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mrcraft8658",
            "body": "Final form sukuna would be so good as a killer",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThatBrenon131",
            "body": "I just want a pirate cove map",
            "score": 1,
            "replies": []
        },
        {
            "author": "reevethewriter",
            "body": "For me it’s Nier. Algamation chapter with the (Father) Shadowlord/ World-Ender as the killer with 2B as the survivor and the map is the Cage.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KamenKnight",
            "body": "Transformers\n\nEither a Pretender joining like a Bludgeon skin for Oni or the Pretender from Revenge of The Fallen as her own killer with the ability to pretend to be any of the survivors in the match.\n\nOr maybe a Beast Wars Predacon like Turanturus.\n\nOr even aSoundWave & Ravage costume for Hound Master.",
            "score": 1,
            "replies": []
        },
        {
            "author": "grim_Judgement",
            "body": "The owl House \n\nThe Killer \n emperor belos\n\nSurvivor \nLuz noceda\nHunter",
            "score": 1,
            "replies": []
        },
        {
            "author": "ImmortalFriend",
            "body": "For Honor, but for real.\n\nApollyon as killer would go so unbelievably hard.",
            "score": 1,
            "replies": [
                {
                    "author": "TheSleepyBarnOwl",
                    "body": "Sad we already got a Knight",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ImmortalFriend",
                            "body": "I know, but still",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Chaoscube11",
            "body": "Please I need the Jurassic Park velociraptor as a killer",
            "score": 1,
            "replies": []
        },
        {
            "author": "charggles",
            "body": "Most definitely Scooby-Doo! I'd call it mystery over horror any day; for the most part the franchise just contains heavy horror themes. But its tomato-tomahto.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SmoothieRedditor",
            "body": "https://preview.redd.it/7lykmx1g7jpe1.jpeg?width=1708&format=pjpg&auto=webp&s=45fcb7887e686f77da2dd054053e6425c38945a6\n\nVENOM!!!",
            "score": 1,
            "replies": [
                {
                    "author": "TheSleepyBarnOwl",
                    "body": "When I hit em with the VENOMMMM",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheGamerKitty1",
            "body": "Control is technically action horror so it fits.",
            "score": 1,
            "replies": [
                {
                    "author": "TheSleepyBarnOwl",
                    "body": "Technically maybe. The horror is in quotation marks for a reason :)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "PsychoUmbreon1082",
            "body": "Warframe would unironically go hard.\n\nInfested zealot prelate as a killer.\n\nA corpus crewman as a survivor.\n\nA shadow stalker skin for knight, seriously go look up the shadow stalker and tell me it doesn't fit the overall shape of knight.\n\nI even have a rough concept for it, I may finish and post it later on tbh.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ShiddyMage1",
            "body": "https://preview.redd.it/eagymp2z8jpe1.jpeg?width=672&format=pjpg&auto=webp&s=2d091eeeb3f330d61c86a3194c69777827176268\n\nWarhammer 40k, while every faction has about a dozen options for a killer, for a survivor I'd want Ciaphus Cain",
            "score": 1,
            "replies": []
        },
        {
            "author": "Chineese_spiderman",
            "body": "Unicorn wars.\n\nhttps://preview.redd.it/0mu4ma7z8jpe1.jpeg?width=523&format=pjpg&auto=webp&s=890ef73c91ca97a493de97a554b189d895053839\n\nmake the characters human first off no killer,just two new survivors(blue guy and pink guy) and make the original design tall and ultra rare",
            "score": 1,
            "replies": []
        },
        {
            "author": "RequirementTall8361",
            "body": "https://preview.redd.it/wpom7in89jpe1.jpeg?width=1280&format=pjpg&auto=webp&s=60f1e4f5da625280172e693d5adfdb0676c5bb22\n\nIf we can have Lara, we can have Jason (or Nathan Drake)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jeremy_Melton",
            "body": "Cyberpunk \n\nKiller: either Adam Smasher or Blackwall Songbird (Phantom Liberty) \n\nSurvivors: Vincent and Panam or Reed and Myers \n\nMap: Mikoshi or Cynosure Site",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fiddlestiicks",
            "body": "Fiddlesticks from League of legends",
            "score": 1,
            "replies": []
        },
        {
            "author": "OrderNo",
            "body": "Breaking Bad",
            "score": 1,
            "replies": []
        },
        {
            "author": "LarsArmstrong",
            "body": "Hear me out!\n\nhttps://preview.redd.it/brmh59o9bjpe1.png?width=1285&format=png&auto=webp&s=5410fe23785d3903cb95223a3ab1f646ddd53e10\n\nNaraku from Inuyasha as a killer.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SCIOTT",
            "body": "Epic the musical. I can already feel judgment",
            "score": 1,
            "replies": []
        },
        {
            "author": "GOURMEY905",
            "body": "https://preview.redd.it/545b8cfmcjpe1.png?width=1080&format=png&auto=webp&s=20642b29651e26b8ff29a5fe6e9169ca0b69be3a\n\nThe game could use a new gen rusher",
            "score": 1,
            "replies": []
        },
        {
            "author": "666Creature666",
            "body": "I'd find it funny to have someone like John Cena as a survivor. And my usual answer of wanting a Mortal Kombat chapter",
            "score": 1,
            "replies": []
        },
        {
            "author": "matteoarts",
            "body": "I mean, Control is still pretty horror-esque. I’d rather Control than Tokyo Ghoul, tbh.",
            "score": 1,
            "replies": []
        },
        {
            "author": "natural-icosahedron",
            "body": "Give us Arthur Morgan, I don't think he fits I just wanna see him suffer more, and maybe moan in pain just a little?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Imchoosingnottoexist",
            "body": "The Dark Urge with Slayer Form",
            "score": 1,
            "replies": [
                {
                    "author": "TheSleepyBarnOwl",
                    "body": "Only when Gale my boi is a Surv xD",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "The_fox_of_chicago",
            "body": "I would foam at the mouth for the Chicago vigilante to have a chsnce in the realm",
            "score": 1,
            "replies": []
        },
        {
            "author": "GOURMEY905",
            "body": "https://preview.redd.it/eoa45qkudjpe1.jpeg?width=310&format=pjpg&auto=webp&s=88d547c3f97507c7f131fc88174b7c6fa63ec1e9\n\nAhem",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sum1_X",
            "body": "somebody once posted about Maze Runner - I'd consider that more of a sci-fi thriller\n\n  \nGriever killer and one of the main teen/heroes as a survivor (I only saw 1st movie - forgot names), plus a shifting maze-like map\n\n  \nyes please",
            "score": 1,
            "replies": []
        },
        {
            "author": "SpankedEagle",
            "body": "Velociraptor, Darth Vader, and Terminator are my top 3. Oryx, Crota, Rhulk, Nezarec, or The Witness from Destiny would be pretty cool.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FantaCan039",
            "body": "https://preview.redd.it/ozwtkgthijpe1.jpeg?width=1284&format=pjpg&auto=webp&s=a14142450d0a74a7f23adc241f5a2a9c3654c2fb\n\nSurvivor or killer I don’t really care.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SelectShop9006",
            "body": "I’d say a Living Dead Dolls costume set!\n\nI’d love a Maggot costume.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OAZdevs_alt2",
            "body": "While it’s a horror-comedy, and is labeled horror on Steam, I believe a Danganronpa chapter would be a fitting answer. With The Headmaster as the Killer, and Junko Enoshima as the Survivor.",
            "score": 1,
            "replies": [
                {
                    "author": "FriendlyAd6652",
                    "body": "Danganronpa is definitely horror, but it's not mainly horror, so I can see how it would fit. The thing is, during the times when it is being horror, it can get really extreme.\n\nWhen Junko tied up that Hope's Peak trustee and tortured him to death by gouging out his eyeball while she ate curry with the same spoon, that was horror. When Junko killed herself and was then dismembered by her followers, who replaced their own body parts with her nonfunctional corpse parts (e.g. her arm, her womb, etc),  that was horror. When Junko coerced high schoolers into slaughtering each other for her amusement, that was horror. All the killing games perpetrated by Junko, which are the main setting of Danganronpa, are also clearly horror.\n\nAnd that's not even considering The Tragedy, which was extremely horrific every time it's described in any detail, especially in the novels.\n\nThe list of horror elements goes on and on, but all of it always ties back to Junko. If she didn't exist, the Danganronpa universe would have been pretty peaceful.\n\nThat's why I think when they add Danganronpa to DBD, Junko will be the killer. She is horror incarnate.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "iCoerce",
            "body": "Control is in the remedyverse, so honestly it's possible.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Honky_Joe",
            "body": "Dr. House as a survivor. Or killer.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dvasfeet",
            "body": "Bloodborne",
            "score": 1,
            "replies": []
        },
        {
            "author": "Grizz_Bandicoot",
            "body": "Carnage",
            "score": 1,
            "replies": []
        },
        {
            "author": "slendersleeper",
            "body": "squid game",
            "score": 1,
            "replies": []
        },
        {
            "author": "Qbertjack",
            "body": "Ghostbusters, even if it's the jumpsuits itll go so hard",
            "score": 1,
            "replies": []
        },
        {
            "author": "sinkwoke",
            "body": "No non horror should be in this game",
            "score": 1,
            "replies": []
        },
        {
            "author": "Demon-Bunny-22",
            "body": "Yakuza, give me Kiryu as a survivor",
            "score": 1,
            "replies": []
        },
        {
            "author": "HenryTheGoat173",
            "body": "Hotline Miami!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Garresh",
            "body": "Debatable how much of a horror game it is, but Shodan from System Shock would go hard af. Wouldn't mind the Typhon from Prey 2017 either.",
            "score": 1,
            "replies": []
        },
        {
            "author": "walterfardwellwhite6",
            "body": "I'd love to get John Rambo as a survivor. There's plenty of cosmetics you could get too with it",
            "score": 1,
            "replies": []
        },
        {
            "author": "eyyduudhwfgdu",
            "body": "https://i.redd.it/i2ffnhw3njpe1.gif\n\ni have zero clue how they would make him work but i want him in DBD",
            "score": 1,
            "replies": []
        },
        {
            "author": "crazyinsanefrenzy",
            "body": "I think mortal kombat would be cool to see",
            "score": 1,
            "replies": []
        },
        {
            "author": "imaregretthislater_",
            "body": "Jurassic world, and probably another thing that i really enjoy that i cant name at the top of my head, \n\nAnd also murder drones maybe...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sleepy_Doge97",
            "body": "Cool thing about this specific licence, is that Remedy and Behavior seem to be on good terms after the Alan wake chapter.\n\nSo Control could potentially be more than just a dream.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lizardjoe_xx_YT",
            "body": "Lost planet",
            "score": 1,
            "replies": []
        },
        {
            "author": "MTG_RelevantCard",
            "body": "Garuuk from MTG - “The Planeswalker”\n\nNick Saban - “The Crimson”",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ibellasnowrider",
            "body": "Personally I think a Dandadan costume collection collab would be fun give it heavily refences horror and urban legends and can do both well",
            "score": 1,
            "replies": []
        },
        {
            "author": "EichenSoldat",
            "body": "Cyberpunk 2077 would be unironically very fitting!",
            "score": 1,
            "replies": []
        },
        {
            "author": "IBM_PCjr",
            "body": "Star Trek, specifically the Borg. They are possibly the most terrifying thing in all of sci-fi.",
            "score": 1,
            "replies": []
        },
        {
            "author": "khtff",
            "body": "Mordekaiser from LoL. I really wanna send every Sable to Brazil",
            "score": 1,
            "replies": []
        },
        {
            "author": "Artistic_Wrongdoer_3",
            "body": "Borderlands 100%. Make the survivor one of the vault hunters (multi outfits like the bard) and maybe one of the villains as the killer? Perhaps a Pandora map that could be part of the Erie of Crows realm?",
            "score": 1,
            "replies": []
        },
        {
            "author": "thepresscorpse_",
            "body": "![gif](giphy|n04l7lgE751xS)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Moshyma",
            "body": "I had a few ideas that evade me right now, but the one I can still think of is Apex Legends just to have a Revenant killer skin with his own moris.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Complimentary-Trash",
            "body": "I gotta say my top 4 for “Non Horror” would be\n- Half Life (Gordon Freeman Survivor)\n- Metal Gear Solid (Psycho Mantis Killer)\n- Hotline Miami (Jacket Killer)\n- Gremlins (Stripe Killer)",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheFairKiller",
            "body": "Bioshock, Big Daddy!",
            "score": 1,
            "replies": []
        },
        {
            "author": "dajitrapslayer",
            "body": "Control is lame",
            "score": -9,
            "replies": [
                {
                    "author": "horrorfan555",
                    "body": "One of the best video games I have ever played",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "TheSleepyBarnOwl",
                    "body": "hm. Well your opinion. Personally it's the best game I've ever played and it's my absolute favourite.",
                    "score": 4,
                    "replies": []
                }
            ]
        }
    ]
}