{
    "title": "Trudeau tells Trump 'we will not back down' from trade war, calling tariffs 'very dumb'",
    "author": "ObamasDeadChef",
    "subreddit": "Conservative",
    "rank": 72,
    "score": 2337,
    "upvote_ratio": 0.9,
    "num_comments (reported by reddit)": 1534,
    "url": "https://www.foxbusiness.com/economy/trudeau-tells-trump-we-not-back-down-from-trade-war-calling-tariffs-very-dumb",
    "id": "1j3gw1e",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This thread has been so heavily reported that I, Automoderator, decided to promote our other socials.  [Follow us on X.com](https://x.com/rcondiscord) and [join us on Discord](https://discord.com/invite/conservative).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Conservative) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "otakuzod",
            "body": "What is Trump’s endgame with this?  Was there something else Canada was supposed to do but didn’t?",
            "score": 400,
            "replies": [
                {
                    "author": "TisMeDA",
                    "body": "Nothing publicly discussed as far as I can tell. This particular tariff is regarding the border security stuff, which is an obvious excuse to anyone being remotely honest",
                    "score": 219,
                    "replies": []
                },
                {
                    "author": "Zedakah",
                    "body": "I think the two points Trump wanted Canada to fix was tight border security to prevent fentanyl from crossing over the northern border and for Canada to meet it's NATO requirement spending. \n\n  \nThere may be more, but those are the two I saw.",
                    "score": 28,
                    "replies": []
                },
                {
                    "author": "GeneticsGuy",
                    "body": "How about the fact Canada tariffs the F out of the US and the US has just bent over and taken it. But ya, now tariffs are done because he said no more, we are retaliating. \n\nMaybe if Canada agrees to end tariffs against the US.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "GirlsWasteXp",
                    "body": "Bring manufacturing back to America and reduce the trade deficit.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "An_Average_Joe_",
                            "body": "Why do you care about a trade deficit?",
                            "score": 139,
                            "replies": [
                                {
                                    "author": "GirlsWasteXp",
                                    "body": "He didn't ask for my opinion. He asked about what Trump's goal is and I responded. If you want to learn about the pros and cons of trade deficits, you can use Google.",
                                    "score": 51,
                                    "replies": [
                                        {
                                            "author": "An_Average_Joe_",
                                            "body": "Sorry, I thought you were responding with your opinion. I am here to participate in civil discourse, let’s not devolve into “educate yourself”",
                                            "score": 51,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Texas103",
                                    "body": "What a silly question.  Either you're in high school or just absolutely out of touch with politics.",
                                    "score": -7,
                                    "replies": []
                                },
                                {
                                    "author": "An_Average_Joe_",
                                    "body": "Please, enlighten me.",
                                    "score": 27,
                                    "replies": []
                                },
                                {
                                    "author": "Texas103",
                                    "body": ">Why do you care about a trade deficit?\n\nExplaining basic economics to you isn't part of my day 🤣 but feel free to educate yourself.  \n\nBut then again... this is something a leftist wound say.  Lotta fellow conservatives running around these days lol.",
                                    "score": -7,
                                    "replies": []
                                },
                                {
                                    "author": "An_Average_Joe_",
                                    "body": "It’s sounding like you think ideology is an adequate substitute for understanding.\n\nInstead of trying to dodge civil discourse with low-grade insults, I can start:\n\nBasic macroeconomics teaches that everybody wins with free trade. Free trade allows for nations to specialize, which will increase the total capacity of goods created/manufactured (the production possibility frontier shifts outward). A trade deficit, by basic laws of supply and demand, would suggest that foreign nations are capable of producing a good cheaper than we can produce it domestically. While that may be less ideal for an American worker, it is ideal for an American consumer.\n\nWhile trade deficits can devalue a country’s base currency, this is largely inapplicable to the US as we have the world’s reserve currency. Since we began our trade deficit in 1976, we have not witnessed a substantial weakening of the dollar.\n\nSo, again, I’ll ask you: why do you care about a trade deficit?",
                                    "score": 42,
                                    "replies": []
                                },
                                {
                                    "author": "Texas103",
                                    "body": "Literally straight out of leftist economic theory.  \n\nMostly, I care about the trade deficit because of lost American jobs.  To a lesser degree, I care about trade deficits out of a sense of fairness and not having Americans be taken advantage of.  As other Western countries embrace their socialist welfare states, and shy away from defense spending and innovation and their cultural values, I see no reason to be in large trade deficits with Western first world countries while they piggyback off of American exceptionalism.  \n\n>everybody wins with free trade\n\nI'm fine with free and fair trade with Canada, but they have to live up to their promises with NATO.  But if we can't have free trade, I am also for equal trade with Canada and other Western countries which Trump is gonna help us out with.  \n\nYes, I understand that our trade relationship is complicated, especially with oil and gas.  But you rhetorically asking \"why do you care about a trade deficit?\" is just... not constructive.",
                                    "score": 0,
                                    "replies": []
                                },
                                {
                                    "author": "An_Average_Joe_",
                                    "body": "I don’t know how you could say that asking a question is not constructive when it was literally not rhetorical… I don’t want to bicker with you, but do you not see the hypocrisy in that you would not engage initially and took the “fellow conservative” route?\n\nI understand where you are coming from in that trade deficits can hurt the American worker. I do not understand when you say you are concerned with trade deficits “out of fairness and not having other Americans being taken advantage of.” How are Americans being taken advantage of? No one is compelling anyone to buy cheap foreign goods.\n\nTrade deficits don’t really have much to do with the budgets of other governments. I agree NATO countries need to boost defense spending and stop relying entirely on our military umbrella. This, however, has nothing to do with Joe Shmoe buying something from a small business across the border.",
                                    "score": 27,
                                    "replies": []
                                },
                                {
                                    "author": "Texas103",
                                    "body": ">I don’t know how you could say that asking a question is not constructive when it was literally not rhetorical… I don’t want to bicker with you, but do you not see the hypocrisy in that you would not engage initially and took the “fellow conservative” route?\n\nTrade deficits being a bad thing is axiomatic to anyone who is right of center politically.  I should not have to explain that on r/conservative.  What is annoying is having people get flair and then spout leftist talking points, there's entire threads from the mods about this.  If that isn't you and you're a real conservative, then I am sorry for you.  \n\n>How are Americans being taken advantage of? \n\nAgain, this is axiomatic.  Americans are hurt when other countries tariff American products.  It's bad for American companies when they can't sell their goods on a global market.  Do I really have to say more?  \n\nIn the case of the Chinese, it hurts 2x as bad because they steal our IP at the same time.    \n\n>Trade deficits don’t really have much to do with the budgets of other governments.\n\nNonsensical.  If this were true, then Canada wouldn't care about the tariffs or incoming trade war.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "An_Average_Joe_",
                                    "body": "I am a conservative and have been flaired for years. Just because someone doesn’t agree with every single right wing platform point or, god forbid, disagree with Trump doesn’t mean they are a brigader.\n\nI don’t think a trade deficit is a bad thing is a conservative axiom. I agree that another country imposing tariffs will hurt people (primarily the consumers of that country first, then American businesses second). However, I don’t think it’s the case that other countries tariff US goods with no American response. If I am wrong, I would agree with you, but I don’t think that’s the case.\n\nChinese corporate espionage is a bad thing, on that I agree with you, however, this is not related to our trade deficit with them. When I buy a cheap plastic toy, I am not degrading any American company’s IP. They are hacking these companies illegally and would do so even if we didn’t trade with them at all.\n\nCanada cares about tariffs because it will hurt their businesses. It is time honored tradition to reciprocate tariffs to save face. Besides Trump attaching a demand for Canada to increase defense spending (which afaik he has not done, he has only spoken about fentanyl crossing the border) tariffs are not related to Canada’s budget/spending.",
                                    "score": 21,
                                    "replies": [
                                        {
                                            "author": "Texas103",
                                            "body": ">Just because someone doesn’t agree with every single right wing platform point or, god forbid, disagree with Trump doesn’t mean they are a brigader.\n\nThats fine...\n\n>I don’t think a trade deficit is a bad thing is a conservative axiom. I agree that another country imposing tariffs will hurt people (primarily the consumers of that country first, then American businesses second). \n\n... but these are things that leftists say about tariffs.  At this point, I'm just here to let you know.\n\nIt's ok to be a free market conservative and not like the tariffs or trade wars.  But your rationale seems to be coming from a leftist point of view rather than a truly free market free trade conservative.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "An_Average_Joe_",
                                                    "body": "What did I say that is a leftist talking point? \n\nYou sound like McCarthy fear mongering about communism. You say this as anything considered “left” is automatically bad by virtue of being on the left. A bad idea is bad because it doesn’t work or is not true not because of where it comes from.",
                                                    "score": 12,
                                                    "replies": [
                                                        {
                                                            "author": "Texas103",
                                                            "body": "I quoted you. \n\nYour assumption that trade deficits bad combined with your thoughts on tariffs, all of it comes from the left. ",
                                                            "score": -2,
                                                            "replies": [
                                                                {
                                                                    "author": "An_Average_Joe_",
                                                                    "body": "Can you point me to any proof showing that trade deficits are bad? Less jobs vs lower prices is a trade off. Is there anything else?",
                                                                    "score": 9,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Texas103",
                                                                            "body": "We’ve come fullll circle brother. If you need a lesson in why trade deficits are bad then I don’t know what to tell ya… ",
                                                                            "score": -1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "An_Average_Joe_",
                                                                                    "body": "You’re the reason civil discourse in this country is dying.",
                                                                                    "score": 14,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Texas103",
                                                                                            "body": "You’re talking but it’s like you aren’t listening. You’ve literally gone in a full circle and are back to your original question of “Why are trade deficits a bad thing?”\n\nWe just had that conversation.. I answered your questions.. and you didn’t like the answer so you just went back to square one. It’s like I’m talking to a bot. \n\nAnd then because you didn’t get the answer you want… you declare civil discourse is dead?  Wtf?  ",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "An_Average_Joe_",
                                                                                                    "body": "You’ve literally talked about everything except for trade deficits. If you want to use tariffs as leverage for other political gain like defense spending and corporate espionage (2 topics you’ve mentioned when trying to talk about trade deficits, but are entirely unrelated) that’s one thing.\n\nI am asking you explicitly about trade deficits. And why you think they are inherently bad. You’ve literally called me a leftist multiple times and told me to research it myself.\n\nYes, because you can’t hold a conversation without devolving into us vs them, without attempting to degrade me, without giving me an answer, or without talking about entirely unrelated topics is exactly why you are contributing to the downfall of civil discourse in America.",
                                                                                                    "score": 11,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Texas103",
                                                                                                            "body": "I literally told you.\n\n>Mostly, I care about the trade deficit because of lost American jobs. To a lesser degree, I care about trade deficits out of a sense of fairness and not having Americans be taken advantage of. As other Western countries embrace their socialist welfare states, and shy away from defense spending and innovation and their cultural values, I see no reason to be in large trade deficits with Western first world countries while they piggyback off of American exceptionalism.\n\nTo be precise, the context is Canada.  Trade deficits as a whole can be good or bad depending upon context.  But with Canada, I would argue the above.\n\nHowever, I admit you can go to school for years and years and still not learn all there is to know about international trade and \"trade deficits\".\n\n>Yes, because you can’t hold a conversation without devolving into us vs them, without attempting to degrade me, without giving me an answer, or without talking about entirely unrelated topics is exactly why you are contributing to the downfall of civil discourse in America.\n\nI have been precise this entire time.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "An_Average_Joe_",
                                                                                                                    "body": "The only thing that makes sense in that paragraph is about jobs. But tariffs are only protectionist to an extent. The Smoot-Hawley tariffs were designed to protect American jobs but it is considered a large contributing factor to the Great Depression.\n\nAgain: the trade deficit does not relate to government budgets. Americans aren’t being taken advantage of just because Americans are obsessed with cheap consumption. While people do piggyback on American exceptionalism and fund their social programs at the expense of their defense budgets, this has nothing to do with the trade deficit.",
                                                                                                                    "score": 8,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "Texas103",
                                                                                                                            "body": "That's fine.  We have to just disagree then.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "An_Average_Joe_",
                                                                                                                                    "body": "Disagree on what? On what is the better tradeoff between jobs and prices? That would be fine.\n\nIf it’s about government budgets, I would prefer some explanation on how you’re connecting those dots.",
                                                                                                                                    "score": 7,
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Normalasfolk",
            "body": "The White House needs to explain the reasoning and facts behind the tariffs over and over like a broken record.  Right now, the tariffs make the headlines and the news makes little to no mention of why or what Trump is asking for.\n\nWhat have tariffs imposed on Canada and the US looked like prior to this?  Has it been fair?\n\nWhat is the US asking for Canada to do that will end the tariffs?  Is it just border security?  I honestly don’t know.",
            "score": 152,
            "replies": []
        },
        {
            "author": "Communalbuttplug",
            "body": "Trumps just announced for every retaliatory tariff Canada places on the USA then the existing tariffs will immediately increase by the same amount.\n\nIf I'm reading it right that would mean the tariffs will be increasing from 25% to 50% as of today.\n\nBe interesting to see who blinks first.",
            "score": 189,
            "replies": [
                {
                    "author": "No-Werewolf541",
                    "body": "Canada imports over 60% of their goods from us. Lol the people are going to be crying. Trudeau has no cards and Canadians are going to suffer miserably.",
                    "score": 91,
                    "replies": [
                        {
                            "author": "GiediOne",
                            "body": "I love Canadians, but it's time to recalibrate the relationship.  If they insist on going socialist with their policies and free ride in NATO and NORAD to the tune of hundreds of billions of dollars a year on the backs of American taxpayers, clearly that's not fair to American citizens and Trump was voted in by the American people  to correct those kinds of international relationship imbalances.",
                            "score": 34,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Opening-Citron2733",
                    "body": "Canada gets 99% of their gas from America. They also send 97% of their oil exports to us so that we can refine their oil for them\n\n\nThey are absolutely fucked",
                    "score": 31,
                    "replies": []
                }
            ]
        },
        {
            "author": "NoFocus4742",
            "body": "I just don't know why it's necessary to pick fights with our friends up north. I'm on board with pretty much everything Trump is doing, but isolating ourselves unnecessarily from our allies is just odd.",
            "score": 148,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 120,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "MarcVipsaniAgrippa",
                            "body": ">for no reason\n\nThe reason is that your country has imposed high tariffs on the U.S. for a long time, and the Americans are no longer willing to put up with it.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "_TheWolfOfWalmart_",
                    "body": "Our friends up north? Stolen from another post in here, these are some of the tariffs that Canada has on US products:\n\nMilk: 270%\n\nCheese: 245%\n\nButter: 298%\n\nChicken: 238%\n\nSausages: 69.9%\n\nBarley seed: 57%\n\nCopper: 48%\n\nAluminum: 45%\n\nSteel: 25%\n\n\n\nConsumer Goods:\n\nCars: 45%\n\nTVs: 45%\n\nEggs: 163%\n\nWheat: 94%\n\nBovine/Meat: 26.5%\n\nDoes that seem friendly?",
                    "score": 32,
                    "replies": []
                },
                {
                    "author": "Imissyourgirlfriend2",
                    "body": "> I just don't know why it's necessary to pick fights with our friends up north.\n\nBecause they ain't securing their border and because American manufacturing is better for Americans than imports.",
                    "score": -19,
                    "replies": []
                },
                {
                    "author": "Texas103",
                    "body": "The JD Vance position.  \n\nThis guy gets it.",
                    "score": -10,
                    "replies": []
                },
                {
                    "author": "directstranger",
                    "body": "Because he cannot pick a fight with europe at the same time. He cannot take on Europe now, because the rift would be too big and might push EU and China togheter. He's only screwing Europe militarily for now.",
                    "score": -1,
                    "replies": []
                },
                {
                    "author": "pbnjandmilk",
                    "body": "They are NOT our friends. Neither is Mexico. If they had the stones they would try to invade on each side.",
                    "score": -6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lifeisagreatteacher",
            "body": "Math:\n\nCanada annual trade surplus with US $108 Billion\n\nhttps://tradingeconomics.com/canada/balance-of-trade\n\nWho is going to win a trade war? Not Canada.\n\nhttps://wits.worldbank.org/CountryProfile/en/Country/USA/Year/2022/TradeFlow/Import/Partner/by-country\n\nCanada average tariff on US imports 13.4%\n\nUS average tariff on Canada goods 1.8%\n\nWho has been taking advantage of who now?\n\nTop 3 countries tariffs on US imports:\n\nChina 17%\nMexico 13.6%\nCanada 13.2%\n\nWho did Trump just impose 25% tariffs on? These 3 countries.\n\nThe next highest tariff after these 3 is 4.6%\n\nTrump doesn’t do anything without leverage. My guess is he lowers the tariff to about 15% to make it equal with the US getting a big gain. He started with 25% to let them know he’s serious. It was a message. The message has been received.",
            "score": 266,
            "replies": [
                {
                    "author": "InAingeWeTrust",
                    "body": "Source? I don’t doubt the average tariff statistic but I’d like to see it",
                    "score": 78,
                    "replies": [
                        {
                            "author": "yrunsyndylyfu",
                            "body": "Not OP, but there have been some examples of Canada's egregious tariffs floating around ever since Trump announced his plan:\n\nMilk: 270%  \nCheese: 245%  \nButter: 298%  \nChicken: 238%  \nSausages: 69.9%  \nBarley seed: 57%  \nCopper: 48%  \nAluminum: 45%  \nSteel: 25%  \n\n\nConsumer Goods:  \nCars: 45%  \nTVs: 45%  \nEggs: 163%  \nWheat: 94%  \nBovine/Meat: 26.5%\n\nYou can confirm these [here](https://www.tariffinder.ca/en/getStarted).",
                            "score": 55,
                            "replies": [
                                {
                                    "author": "TisMeDA",
                                    "body": "Am I missing something? Every type of car I tried was about 6%",
                                    "score": 62,
                                    "replies": [
                                        {
                                            "author": "Everlovin",
                                            "body": "I believe most of those are quota tariffs, meaning the tariff kicks in only after a certain amount of goods are imported per year. Basically serve to reduce the flood of goods into Canada that would otherwise put Canadian industries out of business due to the power and volume of the US economy comparatively. \n\nIm a Canadian and I want free trade across the board. Im tired of paying premium prices to protect industry that can’t provide value on its own. Furthermore our provinces tariff each other, making the Canadian cost of living unaffordable for many.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "TisMeDA",
                                                    "body": "So the thing is, I tested Milk first (cause that's a notorious one), and it indicated the tariff + the over the limit tariff.\n\nfor any car that I tried, new or used, it was hovering around 6.2% and I didn't see anything in addition\n\nI do agree though. I would rather dump the practice (no pun intended) of us pouring milk that's over a certain amount simply to protect the milk industry by adding some meaningful competition.\n\nIf that means things like our egg prices going up, so be it. The market will adapt. Some industries will thrive while others will have to get their act together.\n\nIt was less than a year ago that half the country was boycotting Loblaws and cheering for American competition in the space, yet here we are. Ironically our most consumer friendly companies in the space are Walmart and Costco.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Cranks_No_Start",
                                    "body": "I saw this list a week or so ago and was trying to make a point and wanted to find it again. \n\nNo where to be found.  Fucking Google. ",
                                    "score": 29,
                                    "replies": [
                                        {
                                            "author": "Lifeisagreatteacher",
                                            "body": "Use Yandex search. Google is propaganda, they remove searches that don’t fit their leftist ideology.",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "chriscrowder",
                    "body": "Yup, Canada depends on the U.S. a ton—most of its exports (like lumber, oil, cars) come here. If the U.S. makes it expensive for Canada to sell, Canada’s economy could be hurt badly.  This is not a smart move, Castrso's son!",
                    "score": 14,
                    "replies": [
                        {
                            "author": "pbnjandmilk",
                            "body": "Who give a crap. Winter is coming soon for Canada, but this one will hurt!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "mal1291",
                    "body": "For some reason, people seem incapable of realizing that Trump is not proposing that these tariffs remain in place in perpetuity. The goal is to use the economic leverage that the US has to get these countries to eliminate their high tariffs on US goods and, actually, to encourage an environment with less tariffs overall moving forward. It does make sense in the long run, but taking this kind of action is politically bold, guaranteed to be lambasted, and has probably been viewed as suicidal by most previous administrations.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "HKatzOnline",
            "body": "If tariffs are dumb, why did Canada have such large tariffs on US goods already?",
            "score": 83,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1074,
            "replies": [
                {
                    "author": "TheYoungLung",
                    "body": "You guys already tariff the shit out of our exports. *Retalitory* is a key word here",
                    "score": 58,
                    "replies": [
                        {
                            "author": "The_Asian_Viper",
                            "body": "That's only on agricultural products right? I mean it makes some sense to protect your own food production.",
                            "score": 44,
                            "replies": [
                                {
                                    "author": "TheYoungLung",
                                    "body": "They also tariff clothes, appliances and cosmetics",
                                    "score": 12,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "MrOake",
                            "body": "How dare we protect our farmers",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "Mrsmeowy",
                                    "body": "And how dare America protect themselves. You guys love to do one thing yourselves and then hate America when they do it.",
                                    "score": 26,
                                    "replies": []
                                },
                                {
                                    "author": "Nifty_5050",
                                    "body": "Hypocrite.",
                                    "score": 16,
                                    "replies": []
                                },
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 47,
                                    "replies": []
                                },
                                {
                                    "author": "slipperysnail",
                                    "body": "Oh, so the rest of the world can protect their own domestic producers, but America's shouldn't be given even the tiniest opportunity to survive",
                                    "score": 37,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "GeneticsGuy",
                    "body": "So do you feel Canada should remove all their tariffs against the US that existed before Trump's retaliation, or are you only outraged now because Trump. All he is saying no more unfair trade practices where people tariffs us and we do nothing. Canada are hypocrites.",
                    "score": 49,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 321,
                            "replies": [
                                {
                                    "author": "GeneticsGuy",
                                    "body": "You still haven't addressed the issue. This isn't just about the USMCA. Tariffs can exist outside of that.\n\nCanada is tariffing the US long before Trump and every US president just let Canada get away with it. Trump says no more and you Canada tariffs apologists freak out. Seems like fair game retaliation to me. Maybe Canada should normalize.",
                                    "score": 17,
                                    "replies": []
                                },
                                {
                                    "author": "Texas103",
                                    "body": "New term new rules.  Equal tariffs.  \n\nI really don't care if Canada has problems with it.",
                                    "score": -8,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Texas103",
                    "body": "Let's just keep the tariffs with Canada equal.  Now and forever.  Equal trade.  Let's do it.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "pbnjandmilk",
                            "body": "To hell with them. We don't need them.",
                            "score": -10,
                            "replies": []
                        },
                        {
                            "author": "EchoKiloEcho1",
                            "body": "This is a silly sentiment. Equal trade is always better than “to hell with them.”",
                            "score": 28,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "HKatzOnline",
                    "body": "They are dumb, but for the US to accept the one-sided tariffs is not fair either. Kind of hypocritical.",
                    "score": 21,
                    "replies": [
                        {
                            "author": "MMcDeer",
                            "body": "Did Canada have a bunch of tariffs on US goods prior? Agree we should match them if so, but I was not aware.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "More-Hovercraft-7923",
                    "body": "Then don't. Canada puts on a good show of being our friendly neighbors all while taking economic advantage of us. We voted for this to stop and Trump is doing that. This isn't about the Canadian people, it's about their corrupt Nancy DEI government. ",
                    "score": -140,
                    "replies": [
                        {
                            "author": "Unlucky-Prize",
                            "body": "Bullshit. They pay us a ton via ip royalties, us corps operating in Canada with IP (tech and entertainment). That doesn’t show up on the trade balance but when you add it in, we are in surplus, not them. Also they pay us net about 12 or 13b in misc services which offset the goods imbalance somewhat. But the ip and corp profits are the lions share and are larger than the goods imbalance.\n\nThis trade war is theatrical and stupid.",
                            "score": 369,
                            "replies": [
                                {
                                    "author": "More-Hovercraft-7923",
                                    "body": "Oh, I see so there are some uncounted things that are out there that balance it out!  🤡\n\n\nI always forget about magic. ",
                                    "score": -118,
                                    "replies": []
                                },
                                {
                                    "author": "Unlucky-Prize",
                                    "body": "Apple, Google, Microsoft, Netflix, Disney, adobe profits are very real, flow into our economy, and are net paid in large amounts by Canada in Canada. And they don’t show up in the goods trade balance. Apples phones do but from China, but they profits and App Store aren’t in the equation and are large. Oh and video game companies and others too. There’s a lot.",
                                    "score": 186,
                                    "replies": []
                                },
                                {
                                    "author": "slagathor_zimblebob",
                                    "body": "So American companies making money from consumers in other countries is a reason to accept a trade deficit and Canadian tariffs? Lol",
                                    "score": -18,
                                    "replies": []
                                },
                                {
                                    "author": "Unlucky-Prize",
                                    "body": "The trade deficit is one aspect of our commercial relationships. If we are trading IP licenses which have a marginal cost of 0 and support 6 figure jobs for physical goods that have large marginal cost that support 5 figure jobs in canada that’s pretty great. That’s in fact what the actual trade equation with Canada is. We are literately trading windows 365 licenses and Netflix subs for barrels of maple syrup and oil, but Trump is pissed about that? \n\nChina doesn’t pay us much for IP and has extensive non trade barriers, so the trade deficit is more relevant.",
                                    "score": 61,
                                    "replies": []
                                },
                                {
                                    "author": "slagathor_zimblebob",
                                    "body": "I may be misunderstanding you, but I just see that as the benefit of having innovative companies start here. \n\nI don’t see why that factors into the discussion of physical commodities and how they are tariffed.",
                                    "score": -11,
                                    "replies": []
                                },
                                {
                                    "author": "Unlucky-Prize",
                                    "body": "Trade balance is only physical goods. It does not include services or IP royalties/licenses through foreign subsidiaries. Saying Canada is ripping us off because of trade imbalance is missing the point. \n\nIt would be like your wife saying that your marriage is messed up because you have a 3:1 housework imbalance with her (but fail to mention she works part time aside from taking care of home and you work full time and make 4x what she does in income, or that you file the taxes each year and also fix the cars and do the yard work) \n\nThe comparison like I said is more relevant for China which doesn’t allow us to compete on many our strengths.",
                                    "score": 50,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "grand_soul",
                            "body": "Canadian here, how are taking advantage?  I've seen that as a reason, but I've yet to see how we are.",
                            "score": 202,
                            "replies": [
                                {
                                    "author": "More-Hovercraft-7923",
                                    "body": "Access to markets is one area as is the amount the US spends in military deterance.  Canada hasn't broken 1.5% of GDP payments to NATO in decades. The country needs to pay their share to remain at the adult table. ",
                                    "score": -37,
                                    "replies": []
                                },
                                {
                                    "author": "grand_soul",
                                    "body": "Yeah, I agree we should be spending more on our military, for more reasons than just NATO, but we aren't the only ones to fail at this.  Again, the reasons given don't appear to be adding up.  \n\nIt feels like something is being left unsaid or willfully withheld.",
                                    "score": 148,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 643,
                            "replies": [
                                {
                                    "author": "Bramse-TFK",
                                    "body": "Canada imposes up to a 200% tariff on American dairy and poultry products and has done so for decades.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "sowellpatrol",
                                            "body": "No response from OP, I see",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Opening-Citron2733",
                            "body": "The tariffs Canada has on some American products, especially dairy, are absurd.\n\n\nIf they're going to suppress the fuck out of our farmers then fuck em. This is something that's about 10 years overdue tbh ",
                            "score": 62,
                            "replies": []
                        },
                        {
                            "author": "RyanLJacobsen",
                            "body": "Classic, a Canadian conservative upvoted to the moon. Not brigaded, my eye.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "HonoraryNwb",
                    "body": "Then you have to work harder to convince your countrymen that Trudeau is to blame for these tariffs and getting rid of him and the leftists in charge of your government is the only way to remove the tariffs.",
                    "score": -23,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 106,
                    "replies": []
                },
                {
                    "author": "HonoraryNwb",
                    "body": "Sounds like your conservatives have a pretty ineffectual leader. Trudeau brought this on Canada while heading out the door and the conservatives couldn't capitalize on it.",
                    "score": -31,
                    "replies": []
                },
                {
                    "author": "TisMeDA",
                    "body": "Conservatives were so far ahead that there wasn't much room for them to go except down. This is a huge blunder for anyone cheering on a conservative culture shift",
                    "score": 47,
                    "replies": []
                },
                {
                    "author": "No-Werewolf541",
                    "body": "Oh what do you agree with?",
                    "score": -58,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 190,
                    "replies": []
                },
                {
                    "author": "Ok-Entertainment7741",
                    "body": "And which country has had a lot more tariffs against the other?",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "No-Werewolf541",
                    "body": "Such insight.",
                    "score": -63,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mehnard",
            "body": "What did Trudeau say about the dairy tariffs Canada has had in place against the US for decades?  The ones that can exceed 200%.",
            "score": 17,
            "replies": []
        },
        {
            "author": "Opening-Citron2733",
            "body": "He calls tariffs dumb but they have like a 200% tariff on American dairy products.\n\n\nFuck off ",
            "score": 196,
            "replies": [
                {
                    "author": "StillWatersRunWild",
                    "body": "And we subsidize the shit out of our own milk.",
                    "score": 61,
                    "replies": []
                }
            ]
        },
        {
            "author": "GeneticsGuy",
            "body": "If tariffs are so dumb, why does Canada already have existing massive tariffs on the US before this tariffs situation? Maybe if the media was honest they'd point out the hypocrisy.",
            "score": 48,
            "replies": []
        },
        {
            "author": "Bramse-TFK",
            "body": "\"Tariffs are very dumb, except for the ones we have on you, those make perfect sense, and since you placed tariffs on US (even though they hurt the country that places them) WE are going to place tariffs on YOU!!!\"",
            "score": 15,
            "replies": []
        },
        {
            "author": "Lord_Sicarius",
            "body": "If you think tariffs are dumb then you should lead by example and remove all your tariffs, which you've had on the US for forever.",
            "score": 13,
            "replies": []
        },
        {
            "author": "slippery_55jack",
            "body": "“Tariffs are very dumb”,\n\nAlso:\n\n“Check out these new tariffs on US goods!”",
            "score": 262,
            "replies": [
                {
                    "author": "Hour_Insurance_7795",
                    "body": "Let me clear up the confusion:  it’s (d)ifferent, you see.",
                    "score": 59,
                    "replies": []
                }
            ]
        },
        {
            "author": "Rommel79",
            "body": "Then remove the tariffs you have on us.",
            "score": 18,
            "replies": []
        },
        {
            "author": "d2r_freak",
            "body": "Just look up canadas pre-existing tariffs on American goods - separate from all the stuff being announced. All used to “protect Canadian businesses”.\n\nThese pre-existing tariffs remain in effect and are separate from the retaliatory measures:\n\n- Dairy Products:\n  - Milk: Up to 270%\n  - Cheese: Up to 245%\n  - Butter: Up to 298%\n- Poultry:\n  - Chicken: Up to 238%\n  - Eggs: Up to 163%\n- Grains:\n  - Barley: Up to 160%\n  - Wheat: Up to 94%\n- Notes: These high tariffs are part of Canada’s supply management system to protect domestic producers and are applied under tariff-rate quotas (TRQs). Imports within the quota face lower or no tariffs, while over-quota imports incur these steep rates. These rates predate the 2025 trade dispute but have been cited in discussions about U.S.-Canada trade imbalances.",
            "score": 27,
            "replies": []
        },
        {
            "author": "jcubio93",
            "body": "Trudeau is right for once.",
            "score": 99,
            "replies": [
                {
                    "author": "ultrainstict",
                    "body": "He would be if he wasnt a hypocrite. Free trade doesn't exist unless everyone participates, and the us was the only one following either of our free trade agreements. How is it that when canda places tarrif on the us everything is good, but when the us places tarrifs on canada it's the end of the fucking world.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "ChristopherRoberto",
            "body": "Spoiler: this happened in 2018 and they backed down and negotiated the USMCA.  Now they're going to back down again and negotiate some new deal.  They should just save themselves the embarrassment and go straight to the table.",
            "score": 22,
            "replies": []
        },
        {
            "author": "Vacher-Cream",
            "body": "#we have our own maple syrup!",
            "score": 46,
            "replies": [
                {
                    "author": "Actual-Journalist-69",
                    "body": "As a midwesterner, I always thought Vermont Maple is the standard. Have I been missing something?",
                    "score": 16,
                    "replies": [
                        {
                            "author": "RipVanToot",
                            "body": "Canada has a strategic maple syrup reserve. They are on a whole 'nother level. \n\nhttps://en.wikipedia.org/wiki/Great_Canadian_Maple_Syrup_Heist",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "Vacher-Cream",
                            "body": "Many people dont understand that the usa has the same maple trees as Canada. Just because that tree is on the other side of a border doesn’t make it any different.",
                            "score": 23,
                            "replies": []
                        },
                        {
                            "author": "Jett-Daisy2",
                            "body": "Vermont wants to secede from the US.",
                            "score": -12,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AstraVolans_21",
            "body": "So tariffs are 'very dumb' and that is why he announced tariffs in return?",
            "score": 35,
            "replies": []
        },
        {
            "author": "slagathor_zimblebob",
            "body": "Comment scores in this thread are being hijacked by the rest of Reddit who don’t want to buy Vermont maple syrup and are worried the price of their avocado toast is going to soar. Real America First sentiments are getting downvoted. \n\nThey have absolutely zero idea about the tariffs Canada employs on our exports. \n\nThey just know this is bad because MSNBC “economists” said so.",
            "score": 116,
            "replies": []
        },
        {
            "author": "HonoraryNwb",
            "body": "The fact that Trudeau is still the one in position to respond on Canada's behalf shows why these tariffs are necessary.",
            "score": 138,
            "replies": [
                {
                    "author": "StillWatersRunWild",
                    "body": "And his party will remain in charge thanks to these tariffs.",
                    "score": 258,
                    "replies": [
                        {
                            "author": "r2k398",
                            "body": "I have never and will probably never care about Canadian elections.",
                            "score": 41,
                            "replies": [
                                {
                                    "author": "RyanLJacobsen",
                                    "body": "Seriously, what the hell does their elections have to do with America? In fact, if they keep going the way they are, they'll only drive a more conservative younger generation.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "Shadeylark",
                                            "body": "Well, since everyone else pays attention to American politics (because they have to; when America turns, the rest of the world turns), they assume we care about their politics as well.",
                                            "score": -1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "notsocharmingprince",
                            "body": "Imagine being such a fuck up of a country that you make your domestic political decisions based off of another counties actions.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "MMcDeer",
                                    "body": "Canada is a terrible country now?\n\nI support Trump, but  we don't have to hate Canada",
                                    "score": 20,
                                    "replies": [
                                        {
                                            "author": "ultrainstict",
                                            "body": "It has been a terrible country for a long time, they are not free and have been treating us like crap violating both free trade agreements through loop holes to impose insane tarrifs.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Bramse-TFK",
                            "body": "Good, collapsing their economy will reduce the cost of their labor and goods compared to the dollar.",
                            "score": -47,
                            "replies": []
                        },
                        {
                            "author": "Coastie456",
                            "body": "Thats absolutely NOT how that works lmao 😂",
                            "score": 137,
                            "replies": []
                        },
                        {
                            "author": "Bramse-TFK",
                            "body": "I'm going to give you a few numbers to chew on.\n\nUS goods represent about 51% of all Canadian imports.\nCanadian goods represent about 13% of American imports.\n\nThe United States was the destination for approximately 75% of Canada's total exports by value.\nCanada is was the destination of about 17% of total U.S. goods exports in 2024.\n\nCanada has far less leverage in the relationship and Castro Jr is virtue signaling at the expense of Canadian citizens. Guess we will see in 6 months.",
                            "score": 10,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "No-Entertainer8627",
                    "body": "Exactly, also never ever take political advice from any Canadian. Look at their country. Take a day trip there you will feel like you are in Punjab, India.",
                    "score": -19,
                    "replies": []
                }
            ]
        },
        {
            "author": "Resident_Maybe_6869",
            "body": "![gif](giphy|C4ord1QtfZKRd7mCCn)",
            "score": 11,
            "replies": []
        },
        {
            "author": "AFishNamedFreddie",
            "body": "Canada puts tarrifs on us. Trump simply matches those tarrifs. Canada loses its mind. \n\nTruly incredible.",
            "score": 90,
            "replies": [
                {
                    "author": "johndeer89",
                    "body": "Seriously? We're just matching their tarrifs? I assumed we were going way higher than them the way everyone was freaking out.",
                    "score": 34,
                    "replies": []
                }
            ]
        },
        {
            "author": "shocky32",
            "body": "It’s so predictable. Trump makes demands. Complete outrage ensues. Trump takes action. More outrage. Demands agreed to. \nEvery single time",
            "score": 32,
            "replies": []
        },
        {
            "author": "Device_whisperer",
            "body": "Libs say the dumbest things right before they go down.",
            "score": 65,
            "replies": []
        },
        {
            "author": "Zealousideal-Dig8210",
            "body": "Canada is that gold digger that turns manipulative and toxic when you catch their lies ",
            "score": 56,
            "replies": [
                {
                    "author": "whicky1978",
                    "body": "https://grok.com/share/bGVnYWN5_6aaeee98-98cb-4e7f-9fd9-accb316f266c",
                    "score": 4,
                    "replies": [
                        {
                            "author": "sowellpatrol",
                            "body": "Opulence. I haz it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "OzoneLaters",
                    "body": "Absolutely!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "scrapqueen",
            "body": "So, when they are negotiating an end to these tariffs - is Canada going to be ready to end all their tariffs on our products since tariffs are so unreasonable?",
            "score": 4,
            "replies": []
        },
        {
            "author": "SonnyC_50",
            "body": "Only our tariffs though apparently...",
            "score": 7,
            "replies": []
        },
        {
            "author": "Goongala22",
            "body": "“Tariffs called dumb by leader of nation that charges 300% tariffs.” \n\nWho knew hypocrisy came in maple flavor?",
            "score": 4,
            "replies": []
        },
        {
            "author": "Imissyourgirlfriend2",
            "body": "I thought this Castro spawn was leaving?!",
            "score": 11,
            "replies": []
        },
        {
            "author": "TheGame81677",
            "body": "I thought that moron resigned.",
            "score": 3,
            "replies": [
                {
                    "author": "DetColePhelps11k",
                    "body": "I thought so too. But him stepping down won't occur until March 24th. And at this rate whichever Liberal party member takes over from him will be the one who wins the elections later this year. Apparently Trudeau leaving office and the tariff war is making the Liberals popular again.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Royal_IDunno",
            "body": "Canada won’t win this 😂😂",
            "score": 0,
            "replies": []
        },
        {
            "author": "mschramm06",
            "body": "Tomorrow - Canada Backs Down",
            "score": -7,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "rigorousthinker",
            "body": "I believe this will have little to no effect on the US economy. There are alternatives from many other countries. Canada and Mexico and China aren’t the only places you can buy goods from.",
            "score": -10,
            "replies": []
        },
        {
            "author": "_TheWolfOfWalmart_",
            "body": "Yes he will back down.",
            "score": -6,
            "replies": []
        },
        {
            "author": "Hectoriu",
            "body": "Why would Canada make tariffs too if the only alleged victims are the citizens of their own country?",
            "score": 1,
            "replies": []
        },
        {
            "author": "More-Hovercraft-7923",
            "body": "Narrator: they backed down. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "No-Entertainer8627",
            "body": "Cool, then don't tariff back since they are dumb and don't work. Also maybe he should deal with the mass migration problem that his country has. Canada is a 3rd world country right now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sdevil713",
            "body": "Muh maple syrup reserves",
            "score": 1,
            "replies": []
        },
        {
            "author": "mjgcfb",
            "body": "Get fucked Canada.  Your gravy train is over.",
            "score": -6,
            "replies": []
        },
        {
            "author": "EverySingleMinute",
            "body": "Does he mean existing tariffs or future tariffs?",
            "score": 1,
            "replies": []
        },
        {
            "author": "plastimanb",
            "body": "Lost all respect for Trudeau for calling the President of the United States \"Donald\".  What a mess he's going to make of Canada.",
            "score": -6,
            "replies": []
        },
        {
            "author": "MMcDeer",
            "body": "You don't make yourself an enemy of the US. You do what Trump wants or you LOSE. Those are the only 2 options.",
            "score": 1,
            "replies": []
        },
        {
            "author": "deciduousredcoat",
            "body": "And yet the market barely moved. I'm crying. I thought I was going to make so much money today...",
            "score": -44,
            "replies": []
        },
        {
            "author": "lolycc1911",
            "body": "The good thing is when Canada becomes the 51st state no more tariffs.",
            "score": -11,
            "replies": []
        }
    ]
}