{
    "title": "And what did the democrats accomplish?",
    "author": "CptWigglesOMG",
    "subreddit": "Conservative",
    "rank": 62,
    "score": 463,
    "upvote_ratio": 0.8,
    "num_comments (reported by reddit)": 118,
    "url": "https://www.reddit.com/r/Conservative/comments/1j3uhmh/and_what_did_the_democrats_accomplish/",
    "id": "1j3uhmh",
    "selftext": "They had their little signs pointed at the camera with the word “false” when Trump was speaking the truth. They were screaming and booing, not clapping, not standing. AL GREEN was interrupting, shouting, and waving his Cain! He got multiple warnings, along with all of the democrats and already ignorant people on Reddit are trash talking saying he was being silenced and blah blah blah. What did they accomplish? Other than looking like immature bratty children. \n\nEdit: Love how this has been “So heavily reported” hmm wonder whose doing that and why? 🤔 Lol",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This thread has been so heavily reported that I, Automoderator, decided to promote our other socials.  [Follow us on X.com](https://x.com/rcondiscord) and [join us on Discord](https://discord.com/invite/conservative).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Conservative) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sithire",
            "body": "My favorite was when they refused to stand up and clap in support of a family who's 12 year old daughter was murdered. But only closely rivaled by also refusing to stand and clap for a young man who's been battling brain cancer for 5 years having a dream of his fulfilled.. \n\nThe message was sent loud and clear tonight.",
            "score": 58,
            "replies": [
                {
                    "author": "Admirable-Mine2661",
                    "body": "The problem is only that she wasn't murdered the \" right\" way.  If killed in a school shooting, there would have been thunderous Democrat applause to support their agenda of eroding Second Amendment rights. Murdered by an illegal? Silence. Absolute proof that murder victims NEVER matter to Democrats. If a murder moves their agenda forward, they are sad,, outraged, angry, and demand \" justice.\" If the murder doesn't move their agenda forward, they say nothing. There is no value to a human merely by virtue of being a human who has an inherent right to live. Humans only have worth based on their political value to a  Democrat.",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "shamalonight",
            "body": "What the fuck is wrong with Democrats that they can’t even applaud a 13 year old surviving cancer?",
            "score": 71,
            "replies": [
                {
                    "author": "me_too_999",
                    "body": "Up until now, I just thought it was a meme.\n\nThey proved it true tonight.",
                    "score": 13,
                    "replies": []
                }
            ]
        },
        {
            "author": "CptMcCrae",
            "body": "Even CNN is saying the signs look stupid",
            "score": 56,
            "replies": []
        },
        {
            "author": "Ice_Dapper",
            "body": "They tanked their image even further with the electorate. Couldn't even clap for a kid who beat cancer? Despicable behavior",
            "score": 122,
            "replies": [
                {
                    "author": "zombie_pr0cess",
                    "body": "My theory is that without their slush funds, USAID and the like knitting their disparate groups together, and Green New Scam money going to people like Stacey Abrams, there is no way to hold together the coalition that is the Democratic Party. They will moderate or cease to exist.",
                    "score": 22,
                    "replies": [
                        {
                            "author": "BlackScienceManTyson",
                            "body": "No more hidden Democrat slush funds",
                            "score": 17,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "LyrMeThatBifrost",
            "body": "Nothing. Al Green tried to get him to go off but trump barely even acknowledged him",
            "score": 90,
            "replies": []
        },
        {
            "author": "anotherproxyself",
            "body": "Pouting on their phones like teenagers. Refusing to clap or stand during feel good or consoling bipartisan moments. Waving Musk Steals signs. Steals what, other than your pride?",
            "score": 93,
            "replies": []
        },
        {
            "author": "ancienteggfart",
            "body": "It would’ve actually been better for them and the party had they not shown up like many of them had promised. Their presence/behavior just validated every voter that voted for Trump.",
            "score": 84,
            "replies": []
        },
        {
            "author": "old---",
            "body": "They have demonstrated their resolve to hold their party line and continue to spend tax dollars like they have for decades.",
            "score": 93,
            "replies": [
                {
                    "author": "AnswerAffectionate69",
                    "body": "That was the only thing they clapped for.... spending 300 billion in Ukraine.",
                    "score": 70,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheOnlyEliteOne",
            "body": "They reaffirmed that we made the right choice as a country…not an intended accomplishment but an accomplishment nonetheless.",
            "score": 118,
            "replies": []
        },
        {
            "author": "Status_Control_9500",
            "body": "What cracked me up was Tlaib with her whiteboard. Wrote \"Pay your taxes\"! LOL! 🤣 When they were bitching Trump only paid $750, they failed to check that he PREPAID $25 Million!",
            "score": 106,
            "replies": []
        },
        {
            "author": "Odiemus",
            "body": "The dem response is kind of dumb… just the same old he’s wrong talking points. Straight lies.",
            "score": 100,
            "replies": [
                {
                    "author": "cptjaydvm",
                    "body": "I can’t imagine the level of masochism that would force me to watch that. Kudos.",
                    "score": 21,
                    "replies": [
                        {
                            "author": "Odiemus",
                            "body": "I made it a little bit. Not the whole thing. It was funny because she started out on a really good track. Like we all gotta get along and work together… BUT Trump is doing it all wrong and (dem talking points). That’s the point I kinda couldn’t keep watching… the rampant TDS on display.",
                            "score": 32,
                            "replies": [
                                {
                                    "author": "Status_Control_9500",
                                    "body": "Ya, she hit ALL the Dem talking points! Drivel!",
                                    "score": 11,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "PingLaooo",
                    "body": "She said could before every fearmongering statement lol this truly is the hill they want to die on",
                    "score": 14,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mysterious_Main_5391",
            "body": "Same thing they've always accomplished. They showed what the really are while doing nothing.",
            "score": 125,
            "replies": []
        },
        {
            "author": "GeorgeWashingfun",
            "body": "They got their clip showing Green being \"forced\" away. That's all they wanted, to throw fuel on the \"Trump is a dictator\" fire.",
            "score": 31,
            "replies": [
                {
                    "author": "monobarreller",
                    "body": "Doesn't look like it had the intended impact. Disrupting a speech is nothing new. MTG famously did it last year and got Biden to say, \"Lincoln Riley.\" But she at least sat back down afterward.  \n\nUnfrozen caveman lawyer stood up and just cussed a bunch and refused to sit after being admonished. People who watched saw that and agreed that he had to go. Their whole strategy from last night is backfiring wonderfully this morning. When you refuse to clap for a kid who survived brain cancer and got to be an honorary SS agent, you're cooked. They're floundering even more today because of it.",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "greenbud420",
            "body": "This was more for their base to show them that they're making an effort to oppose Trump. Based on some of the reaction I've seen on reddit, people wanted them to go further, somehow. All of them stripping and walking out naked would have been a hoot!\n\nI don't see them accomplishing much until at least after the mid-terms. Their leadership is weak and mostly resigned to spending the next 2 years in opposition but their base is still wound up from all the end-of-the-world if Trump is reelected doomer propaganda they spewed during the election.",
            "score": 18,
            "replies": []
        },
        {
            "author": "Dingo_Winterwolf",
            "body": "The official democrat rebuttal had me rolling my eyes. It was all fear mongering, dismissive character jabs, and blanket \"orange man bad\" talking points with no substance.",
            "score": 17,
            "replies": []
        },
        {
            "author": "Stockjock1",
            "body": "I was almost embarrassed for Rep. Green.  Almost.  What a disgrace.  And he had the nerve to use the word unfit.",
            "score": 51,
            "replies": []
        },
        {
            "author": "therealcirillafiona",
            "body": "All they do is whine and complain. \n\nThey're entire worldview is falling flat on their face as their doodoo policies is taken away from them and they've never been more angry and loud.",
            "score": 14,
            "replies": []
        },
        {
            "author": "GlitteringLocality",
            "body": "Children would have behaved better than them.",
            "score": 40,
            "replies": []
        },
        {
            "author": "Wonderful_Ad5651",
            "body": "I expected to come in here and see zero replies to \"And what did the Democrats accomplish\"",
            "score": 9,
            "replies": []
        },
        {
            "author": "cptjaydvm",
            "body": "Making themselves look completely ridiculous and out of touch with normie Americans.",
            "score": 38,
            "replies": []
        },
        {
            "author": "Periwinklepanda_",
            "body": "Does anyone else remember what a huge deal it was when Rep. Joe Wilson yelled out “You Lie!” in the middle of an Obama speech? Maybe it’s just because I lived in his state of SC, but it was huge news, and democrats and republicans alike acted like it was so shameful.\n\nAnyways, who could have imagined last night’s display back then? lol.",
            "score": 4,
            "replies": []
        },
        {
            "author": "ReaganWon",
            "body": "Never yell at a man holding the mic.  You will always lose the debate.",
            "score": 14,
            "replies": []
        },
        {
            "author": "downsouthcountry",
            "body": "They looked childish imo",
            "score": 10,
            "replies": []
        },
        {
            "author": "keithedwardpittman",
            "body": "Anyone who actually watched and carefully listened, knows the demoncrats hate America and American values, they need to be voted out in their next election, but we Conservatives can't just sit idly by, we have to really inform others, \nThere is a really good chance we will lose the House and Senate pretty soon if we don't .",
            "score": 53,
            "replies": []
        },
        {
            "author": "Schwanntacular",
            "body": "They became the Traitor Party last night. Everybody saw it. They hate America. They're all traitors",
            "score": 1,
            "replies": []
        }
    ]
}