{
    "title": "This Was the Best State of the Union EVER: Crowd Was On Fire! Dems behaved HORRIBLY + DRAMA!",
    "author": "-Erase",
    "subreddit": "Conservative",
    "rank": 53,
    "score": 579,
    "upvote_ratio": 0.77,
    "num_comments (reported by reddit)": 102,
    "url": "https://www.reddit.com/r/Conservative/comments/1j3udf0/this_was_the_best_state_of_the_union_ever_crowd/",
    "id": "1j3udf0",
    "selftext": "So the Democrats booed so hard that it interrupted Trump‘s speech and then they had to call in people to escort some of the Democrats out. The Democrats tried so hard to rain on Trump‘s parade, interrupting the state of the union with jeers and boos, even needing to be escorted out. I’m SURE that’s never happened before, why are Dems so badly behaved? However their boos only set the Republican crowd on fire. They were so excited, clapping and cheering so loud. It only amped up Trump‘s energy more. Also, his speech was phenomenal!\n\nSuch a phenomenal time to be a Conservative!!! ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This thread has been so heavily reported that I, Automoderator, decided to promote our other socials.  [Follow us on X.com](https://x.com/rcondiscord) and [join us on Discord](https://discord.com/invite/conservative).\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Conservative) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "-Erase",
                    "body": "Wow I’m proud!!! 💕💕💕",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "krazyellinas23",
            "body": "Democrats can't even cheer for a 13 year old kid fighting for his life. They are a disgrace. Amazing speech by President Trump.",
            "score": 172,
            "replies": [
                {
                    "author": "OzoneLaters",
                    "body": "That was totally a watershed moment.\n\nThat is a child.\n\nDemocrats treated a child with brain cancer like crap.\n\nHe saw how they just sat there and he probably felt a little bad because of it.\n\nWho are those people down there who hate me ? Those are democrats son, democrats.\n\nI will remember where I was for the rest of my life when I saw that happen.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Germy_1114",
                    "body": "If Trump suddenly supported UBI and Medicare for all Dems would become fiscal conservatives.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Gfunk27",
            "body": "The dems couldn’t even clap for the capture of a terrorist.",
            "score": 129,
            "replies": []
        },
        {
            "author": "FlightLower2814",
            "body": "The Dems couldn't even clap for the 95 year old lady who was reunited to her son.",
            "score": 110,
            "replies": []
        },
        {
            "author": "LyrMeThatBifrost",
            "body": "Disaster of a night for the dems. Even my liberal friends were disappointed at their showing tonight. Made them look like a joke.",
            "score": 150,
            "replies": []
        },
        {
            "author": "getupkid1986",
            "body": "Trump was correct - he could announce that cancer has been eradicated and the Demtards would still just sit there and languish in their own stupidity and angry faces.",
            "score": 145,
            "replies": []
        },
        {
            "author": "Away-Comfortable1607",
            "body": "Pocahontas says yes.",
            "score": 125,
            "replies": [
                {
                    "author": "AdministrativeAct902",
                    "body": "lol, smh… guy had JOKES last night.",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "pkilla50",
            "body": "That whole Al green thing was so staged lol, they chose him to do that. Now they have they’re talking point for a week",
            "score": 98,
            "replies": []
        }
    ]
}