{
    "title": "Trump announces US has CAUGHT terrorist behind 2021 Abbey Gate bombing",
    "author": "f1sh98",
    "subreddit": "Conservative",
    "rank": 59,
    "score": 484,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 18,
    "url": "https://www.reddit.com/r/Conservative/comments/1j3udm6/trump_announces_us_has_caught_terrorist_behind/",
    "id": "1j3udm6",
    "selftext": "Posted by Emma Colton for Fox News\n\n\n\nPresident [Donald Trump](https://www.foxnews.com/category/person/donald-trump) revealed on Tuesday that the top terrorist behind the Abbey Gate attack in Afghanistan during the U.S.' withdrawal from the nation has been apprehended.\n\n\"Tonight, I am pleased to announce that we have just apprehended the top terrorist responsible for that atrocity. And he is right now on his way here to face the swift sword of American justice,\" Trump said.\n\n13 U.S. service members who were killed during the terrorist attack at Abbey Gate outside Kabul's Hamid Karzai International Airport on Aug. 26, 2021.\n\n",
    "comments": [
        {
            "author": "Silly_Ad_4612",
            "body": "And the DEM WOULDNT EVEN STAND AN APPLAUD. THESE WERE DEAD SERVICE MEMBERS FOR FUCK SAKE. This is appalling. ",
            "score": 91,
            "replies": []
        },
        {
            "author": "H3nchman_24",
            "body": "[I remember when Biden claimed that he authorized a drone strike on the mastermind of the attack, but it ended up being a US asset transporting a bunch of children....](https://www.defense.gov/News/News-Stories/Article/Article/2780257/dod-august-29-strike-in-kabul-tragic-mistake-kills-10-civilians/) so it's no wonder they didn't clap.",
            "score": 22,
            "replies": []
        },
        {
            "author": "Tarantula_Saurus_Rex",
            "body": "🇺🇲 God Bless America!!! 🇺🇲",
            "score": 50,
            "replies": []
        },
        {
            "author": "TheOnlyEliteOne",
            "body": "We caught him alive? I mean that’s cool, but a well placed JDAM could’ve sufficed. But letting him languish in prison for the rest of his days is cool, too.",
            "score": 39,
            "replies": [
                {
                    "author": "Evilsmile",
                    "body": "Had to make sure it was the right target. Wouldn't want to accidentally hit a van full of children and aid workers like some president did...",
                    "score": 39,
                    "replies": [
                        {
                            "author": "DatTrumpDoh",
                            "body": "You're gonna have to narrow it down. Trump is pretty much the only president of the last five that doesn't apply to.",
                            "score": 18,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "sanesociopath",
                    "body": "I like the idea of capture becoming the default again instead of blowing up an area and anyone else nearby and just saying we got them.\n\nThis has not only not got them, killed far to many innocent bystanders, and most egregiously been aimed at the complete wrong people or used to target people who aren't legitimate targets far far too much",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "DaleGribbleBluGrass",
            "body": "And the Dems couldn't even stand and clap for it. Pathetic.",
            "score": 12,
            "replies": []
        },
        {
            "author": "lolycc1911",
            "body": "Thank you President Trump for bringing this scum to justice!  We accept this justice!",
            "score": 41,
            "replies": []
        }
    ]
}