{
    "title": "What They Are Saying: President Trump’s Masterclass Before Congress",
    "author": "Pinot_Greasio",
    "subreddit": "Conservative",
    "rank": 74,
    "score": 76,
    "upvote_ratio": 0.7,
    "num_comments (reported by reddit)": 47,
    "url": "https://www.whitehouse.gov/articles/2025/03/what-they-are-saying-president-trumps-masterclass-before-congress/",
    "id": "1j41hrj",
    "selftext": "",
    "comments": [
        {
            "author": "AFishNamedFreddie",
            "body": "The dems behavior will play well with the far far left, but turn away literally everyone else. They refused to clap for peace in Ukraine (Trump announced both big z and Putin are willing to negotiate). They refused to clap for a 15 year old with brain cancer. They refused to clap for Laken Riley. Instead, they had their cringy signs and their cringy pink suits (when NONE of them voted to protect women). This played horribly with any moderate. \n\n  \nAnd the whole time, Trump spoke of success, strength, and unity. \n\n  \nIm so glad Trump won. We are so back.",
            "score": 77,
            "replies": [
                {
                    "author": "Zonostros",
                    "body": "They've been insane for years, yet still received 48% of the vote.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "luderiffic",
                            "body": "That is very worrisome",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "According-Activity87",
                                    "body": "Voter ID laws will help with that figure.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Blahblahnownow",
                                            "body": "No. Just go to CA, it’s a shit show. They have to fix the census. Only citizens should determine electoral college and seats in house of representatives ",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Pinot_Greasio",
            "body": "\"A CBS/YouGov poll found 76 percent of people approved of Trump's speech\"\n\n\nLeftist losers in shambles.",
            "score": 130,
            "replies": [
                {
                    "author": "777_heavy",
                    "body": "I think it perfectly explains the internet temper tantrum from the extreme few still willing to align themselves with that dying political party and its ideology.",
                    "score": 37,
                    "replies": []
                },
                {
                    "author": "According-Activity87",
                    "body": "![gif](giphy|3b8DH6eVOIJexjngfQ)",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "likeabuddha",
            "body": "Pocahontas clapping for the war in Ukraine to continue on was just the icing on the cake for how arrogant and disrespectful they all were last night. Yikes.",
            "score": 21,
            "replies": []
        },
        {
            "author": "downsouthcountry",
            "body": "Only watched maybe 15 mins of it, but it sounded like the Democrats were behaving like children.",
            "score": 55,
            "replies": [
                {
                    "author": "Left4DayZGone",
                    "body": "Ever see a movie or TV show about an exorcism, and how the demon screeches and screams and flails and thrashes as it’s being exercised?\n\nJust wondering, no reason.",
                    "score": 48,
                    "replies": [
                        {
                            "author": "downsouthcountry",
                            "body": "Oh dear",
                            "score": -1,
                            "replies": []
                        },
                        {
                            "author": "rivenhex",
                            "body": "They especially hate being made to run laps.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "social_dinosaur",
                    "body": "The left lets emotion rather than facts and logic to determine their decisions. Just like children do.",
                    "score": 25,
                    "replies": []
                },
                {
                    "author": "AppState1981",
                    "body": "The losers throw a tantrum",
                    "score": 19,
                    "replies": []
                }
            ]
        },
        {
            "author": "Creeepy_Chris",
            "body": "Dems keep wanting to flip the old switch-a-roo on the “Biden was mentally incompetent” to try to say that Trump is the one who is mentally diminished, but could you imagine how it would have gone had Biden attempted a 1:45 speaking engagement?  Or how about Harris droning on for nearly 2 hours with all of her verbal ticking",
            "score": 6,
            "replies": []
        }
    ]
}