{
    "title": "CIA Director says US halted intel sharing with Ukraine following aid pause",
    "author": "triggernaut",
    "subreddit": "Conservative",
    "rank": 34,
    "score": 122,
    "upvote_ratio": 0.89,
    "num_comments (reported by reddit)": 48,
    "url": "https://nypost.com/2025/03/05/us-news/cia-director-says-us-halted-intel-sharing-with-ukraine-following-aid-pause/",
    "id": "1j46kla",
    "selftext": "",
    "comments": [
        {
            "author": "StillWatersRunWild",
            "body": "Does that mean we wouldn't warn them of attack on civilians and infrastructure and the like?  We're trying to stop the loss of lives and if we stop giving them information that could be used to protect themselves I think that's a bridge too far.",
            "score": 74,
            "replies": [
                {
                    "author": "pbnjandmilk",
                    "body": "He chose to pull his little stunt. Like I said in a previous post about what occurred; that little garden gnome thought he could come into the White House like he has done in the past and flash a couple of pictures of the crackhead son of the \"president\" that held the office hostage and demand the money he thinks he is entitled to. He knows what he has to do if he wants to save whatever is left of his people and country.",
                    "score": -14,
                    "replies": []
                }
            ]
        },
        {
            "author": "fleshdropcolorjeans",
            "body": "Intel is aid. All those reconnaissance flights cost $. The analysts that work to process the info cost $. There are opportunity costs to using our satellites over Ukraine instead of China, etc.",
            "score": 12,
            "replies": []
        },
        {
            "author": "According-Activity87",
            "body": "![gif](giphy|3ornjTfcat9eNI1wg8)",
            "score": 2,
            "replies": []
        },
        {
            "author": "Lifeisagreatteacher",
            "body": "It will be reinstated when Zelensky signs the agreement. It is Zelensky and Ukraines choice if they want support from the US. He made that decision when he pulled his stunt at the White House. It is not up to the US to provide support no matter what. Ask Europe, or sign the agreement.",
            "score": 2,
            "replies": []
        },
        {
            "author": "pbnjandmilk",
            "body": "![gif](giphy|cFUACoKoPUD8SzSDfv)\n\nFAFO has entered the chat room.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Single-Stop6768",
            "body": "That might have a bigger impact than the freezing of military aid. But it seems necessary to get the message across. We as a nation are done with this war. We will help them make peace and with a minerals deal they'll have more leverage to get a better deal. But we aren't funding a forever war.",
            "score": -6,
            "replies": []
        }
    ]
}