{
    "title": "The View Is Toast",
    "author": "MadOblivion",
    "subreddit": "Conservative",
    "rank": 61,
    "score": 32,
    "upvote_ratio": 0.8,
    "num_comments (reported by reddit)": 13,
    "url": "https://www.reddit.com/r/Conservative/comments/1j4ax6r/the_view_is_toast/",
    "id": "1j4ax6r",
    "selftext": "For the first time ever former presidential candidate and Democrat calls out TV show \"The View\" as a extreme left wing arm of the Democratic elite. Marianne Williamson calls for the Democrat party to throw out the old Democratic establishment to let in New more conservative Democrats run the party.\n\nMarianne and Robby Admit Trump broke from the party norms of \"The deep state\" influencing candidate selection process.  Marianne tells us this is why Trump is so popular and why the Democratic Elites essentially destroyed their own party from within.\n\nSource: The Hill [https://www.youtube.com/watch?v=MQENo9sihvY](https://www.youtube.com/watch?v=MQENo9sihvY)",
    "comments": [
        {
            "author": "mdws1977",
            "body": "I don't think there are any conservative Democrats left in the party.",
            "score": 14,
            "replies": [
                {
                    "author": "MadOblivion",
                    "body": "Fear has kept many from switching party's or speaking out. Once you are in the cult, the cult only offers the kool-aid as an exit.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Nectarine-Fast",
            "body": "The best part is they will double down",
            "score": 11,
            "replies": [
                {
                    "author": "SheetFarter",
                    "body": "Every time too.  They love that Uno draw 25 cards card too.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "triggernaut",
            "body": "How can Democrats go back to being more conservative when they have indoctrinated their base for the past 6 decades in radicalism? They can't. This is their religion and they can't break away from it because how can they feel morally superior then?",
            "score": 10,
            "replies": [
                {
                    "author": "OkYogurtcloset2661",
                    "body": "They need to abandon their base because it is now a super minority",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "MadOblivion",
                    "body": "I don't think its so much a problem of group think. Its the Donors and lobbyist. \n\nWho ousted Joe Biden? THE DONORS did, they paused their funding until Joe agreed to drop out of the race so that Kamala could replace him. Those same Donors prefer to pull the strings in major policy decisions in the WH.\n\nI don't think donors are inherently bad but you do have some that do not have Americas best interest at heart and they have latched onto the Democratic party.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}