{
    "title": "Garrett Bardsley, 12, vanished while camping with his father, brothers, and other Boy Scouts on August 20th, 2004.",
    "author": "WinnieBean33",
    "subreddit": "AllThatIsInteresting",
    "rank": 18,
    "score": 290,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 21,
    "url": "https://mshort.substack.com/p/garrett-bardsley-utah-boy-scout-vanishes",
    "id": "1jbj46u",
    "selftext": "",
    "comments": [
        {
            "author": "WinnieBean33",
            "body": "> Garrett Bardsley, a 12-year-old Boy Scout, went camping with his father, brothers, and other Boy Scouts in Utah’s Uinta Mountains in late August 2004. It was meant to be a fun trip before the start of a new school year. But what had begun as an enjoyable outing in the wilderness would unexpectedly turn to tragedy.\n\n> Garrett got up early on the morning of August 20th to go fishing with his father at one of the nearby lakes, but the boy would soon mysteriously vanish on his way back to camp. And though the search for him was initiated within just 15-20 minutes of when he was last seen, neither Garrett nor the fishing pole he’d been carrying would ever be located.\n\n[Read more](https://mshort.substack.com/p/garrett-bardsley-utah-boy-scout-vanishes)",
            "score": 28,
            "replies": [
                {
                    "author": "herowiggles",
                    "body": "His bones are in the trees.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "WoolshirtedWolf",
                            "body": "We had a disappearce happen with a California soldier being escorted to a German medical facility for behavioral treatment.  He broke away and vanished into a forest.  Many searches later, they eventually declared him missing. There had been a fairly publicized dispute between  the two countries over who was responsible for finding him.  He was eventually found hanging high up in the tree canopy by a German logger.  It can happen.  I was a part of his funeral detail when his remains were transported back to the States and laid to rest.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "nastibass",
            "body": "The part that no one ever considers is that it was very early in the morning, like crack of dawn and a near 90 degree drop from a cliff a 20 minute walk away. Easy explanation and there's lots of places down the cliff side where you'd never find him if he fell",
            "score": 18,
            "replies": []
        },
        {
            "author": "haliforniannomad",
            "body": "The way he vanished so quick and so quiet is likely a cougar attack. Sad but otherwise I would suspect the family",
            "score": 42,
            "replies": [
                {
                    "author": "KeyApplication221",
                    "body": "If He was attacked probably would drop the fishing pole at the moment uh?",
                    "score": 17,
                    "replies": [
                        {
                            "author": "ObviousDepartment",
                            "body": "Not necessarily. Some people get a death grip when they freeze up, espescially when surprised. And if he died very shortly after that reaction (i.e. crushed windpipe or skull) he might have continued clutching it after rigor mortise set in. Heard a story about a couple of welders up here who were attacked by a cougar; the first victim was working on something with a tool and the cougar snuck up and killed him so fast he was found still kneeling on the ground with the tool clutched in his hand. \n\n\n\n\n ",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "KeyApplication221",
                                    "body": "But would the cougar drag the boy so far away?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "ObviousDepartment",
                                            "body": "Yup. They're even known to drag the carcases of adult deers up trees to keep safe for later. Noticed how I mentioned that that welder was the 1st victim? Well his buddy was found much later because he got dragged off and stashed. \n\n\nThat might actually be why they can't find him. There's been a few cases of people disappearing and their remains being found years later stuck up in trees. In a lot of those cases though it was actually people who who climbed up there themselves for various reasons. ",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Happy-Chest-9054",
                                    "body": "I was fishing when i was a child and got pulled into the water right off the dock, my dumbass never let go of the rod.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "CharlieBoxCutter",
                    "body": "There would have been evidence. More likely he fell into a cave",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "rNBAisGarbage",
                    "body": "Wild animals are trying to avoid you at all costs. Cougars don't just come into active areas and pick people off. There are on average around 4-6 cougar attacks per year in Canada and the US combined, compared to about 20,000 murders per year in the US. It was a human who did this, not an animal.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "haliforniannomad",
                            "body": "There you go, the kid is on of the 4-6 per year",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Worldly-Jury-8046",
                            "body": "They were in the mountains, not “active areas”.  Wild animals cross humans all the time in reserves, wilderness areas,  national forests, and national parks.  I go backpacking all the time and have to watch those stupid videos about bears, wolves, and cougars where they say you may go your entire life without seeing them… I see bears in almost every park in the Rockies and Sierras I’ve been in.  See moose regularly.  Wolves and cougars are rare to see but you see evidence they’re in the areas.  They don’t avoid humans at all cost.  They avoid crowds of humans.  Children and small women by themselves are who they often target.  Or their pets",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Super-Bank-4800",
                                    "body": "I did a lot of research on mountain lion attacks about a decade ago and you're right. Almost every mountain lion attack on people was against one or two people with a small dog. They go for the dog, the dog runs back to the people for protection, the cougar attacks the people.  \n  \nI have seen one in my life in the wild. I was alone at night and shined my flashlight at it, we both watched each other pretty closely but it didn't try to get any closer to me. I'm a pretty big guy at 6'2\" and 200+ lbs. Mountain lions are ambush predators, they don't want to get into a fight where they might get hurt.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "CharlieBoxCutter",
            "body": "Probably fell into a cave, got stuck, and died of dehydration",
            "score": 3,
            "replies": []
        },
        {
            "author": "Ok-Map-2089",
            "body": "Naw. More likely a child abductor was lurking around with all the young boys in the area looking for an opportunity",
            "score": -2,
            "replies": [
                {
                    "author": "Rash_Bandicoot_81",
                    "body": "Child abductor lurking 6 miles up a mountain?",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Ok-Map-2089",
                    "body": "They were only 1000 ft above sea level. Look at all the players that go trough all kinds of contortions to imbed with the religious so they can be near unsuspecting children",
                    "score": 0,
                    "replies": []
                }
            ]
        }
    ]
}