{
    "title": "Name one thing that you are insecure about and why? as well what made this an insecurity? ** i know this is a vulnerable thing to do but this is only intended for a positive outcome **",
    "author": "kaylasunapologetic",
    "subreddit": "AllThatIsInteresting",
    "rank": 12,
    "score": 0,
    "upvote_ratio": 0.2,
    "num_comments (reported by reddit)": 6,
    "url": "https://www.reddit.com/r/AllThatIsInteresting/comments/1jeduig/name_one_thing_that_you_are_insecure_about_and/",
    "id": "1jeduig",
    "selftext": "",
    "comments": [
        {
            "author": "KodokushiGirl",
            "body": "My autoimmune condition.\n\nHydradenitis Supparativa. Aka The Hidden Plague because its typically only on intimate parts of the body such as inner thighs, buttcrack, groin, underbelly, underboobs and armpits. And if you're luckly like me, your stomach and back of the legs!\n\nIt can make life incredibly painful and uncomfortable to live on top of making me feel ugly, gross and undesirable.\n\nI wouldn't wish this on my worst enemy.",
            "score": 2,
            "replies": [
                {
                    "author": "kaylasunapologetic",
                    "body": "I love that you were vulnerable  with me! I just know that what  you said is very relateable! Although many people may not talk about it openly , it is very common ! I hope today  you feel heard and  beautiful! this does not define you ! And kodkushigirl i want to let you know that you found a friend in me! And you made me feel  like I can be a bit more brave just by sharing this. ✨️ JUST KNOW THAT WE SOMETIMES OVER THINK AND THAT CAN SOME TIMES BE HARD TO TURN OFF .. BUT YOUR NOT UGLY  OR GROSS ! YOUR A HUMAN JUST LIKE EVERYONE ELSE ! LETS BE MORE POSITIVE AND ACCEPT OUR SELFS   CAUSE YOU MY FRIEND ! I ACCEPT YOU !:) \n-unapologetically  kayla",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "shandalf_thegrey",
            "body": "My height. I’m a 6 foot tall woman, and I’ve been 6’0” since I was 12. I’ve gotten nonstop comments on it for 20 years now which leads to a lot of insecurity. Sometimes it’s positive like “I love how tall you are” but for the most part I get a lot of “how tall are you? WHY are you so tall? Are your parents tall? (that one is extra fun bc I’m adopted) Do you play basketball?”. People openly stare at me  and make comments about me in public.",
            "score": 2,
            "replies": [
                {
                    "author": "kaylasunapologetic",
                    "body": "Wow ! I know how uncomfortable  that must make you feel, especially  being asked it very frequently  ! I am also tall but only 5'8  . Now, this being said, i recall getting  asked this a lot growing up  ... believe it or not, I  thought, am I not normal ? Or is that question nice .. or mean ? I always found it hard to accept it as a  compliment . Regardless I do feel it is very important to know that your height is unique, and that is what makes you stand out from the crowd  ! ✨️  (literally), but this is a very good thing  !people are fascinated  about your  height .humans are very vocal when they see something thats fascinating to them and that  is a very good thing ! Gir,  just know that we  love the height ! And you have nothing to feel ashamed about ! You found yourself  a positive  community  and a friend today  and know I'm rooting for you  ! Accept your self ✨️ 😌",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ottomatic72215",
            "body": "I have a long neck and a not so great hair line.",
            "score": 1,
            "replies": [
                {
                    "author": "kaylasunapologetic",
                    "body": "What made you feel this way ? When did this start happening?",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}