{
    "title": "FINALLY BEAT AT NERGIGANTE",
    "author": "Longjumping-Knee-648",
    "subreddit": "MonsterHunterWorld",
    "rank": 15,
    "score": 39,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 22,
    "url": "https://www.reddit.com/r/MonsterHunterWorld/comments/1je2s9i/finally_beat_at_nergigante/",
    "id": "1je2s9i",
    "selftext": "Did i do it solo? No... But i was finally able to beat him with randos keeping the offensive without carting. Someday ill be able to even solo him.",
    "comments": [
        {
            "author": "neighborhood_ginger",
            "body": "awesome work!!!! the guild commends you and your fellow hunters for preventing another potential threat to the ecosystem",
            "score": 13,
            "replies": []
        },
        {
            "author": "Zelcron",
            "body": "Good work. AT Nergi was the only monster in the base game I gave up on soloing except Behemoth. Just hits so GD hard and fast.\n\nI even beat Ancient Leshan because no one mentioned she doesn't scale...",
            "score": 6,
            "replies": []
        },
        {
            "author": "Chomasterq2",
            "body": "AT nergi is the hardest AT monster in base game imo, and i only beat him solo in HR gear by hiding behind the shield of a lance",
            "score": 4,
            "replies": []
        },
        {
            "author": "locorasuke",
            "body": "I’m so excited for you, heck yeah!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Outrageous_Lion4912",
            "body": "Trust me you can solo Nerg. I once thought I couldn’t too.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Conjuras21",
            "body": "Hell yeah, my turn soon fr",
            "score": 1,
            "replies": []
        },
        {
            "author": "2ClawZ",
            "body": "ohno... I'm just about to do the nergigante quests and im scared. anything that i should prepare?",
            "score": 1,
            "replies": [
                {
                    "author": "Longjumping-Knee-648",
                    "body": "Normal nergigante is easy. Im talking about the end levels of highrank",
                    "score": 1,
                    "replies": [
                        {
                            "author": "2ClawZ",
                            "body": "i am in the high rank quest, got into elder's recess and discovered nergigante's track",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Longjumping-Knee-648",
                                    "body": "Normal nergigante it is then. Dont worry hes not that bad.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "2ClawZ",
                                            "body": "ahh ur talking about the dark variant?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Longjumping-Knee-648",
                                                    "body": "AT: Arch tempered, powered versions of some elder dragons. Stronger than Tempered monsters",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "skiddle_skoodle",
                                                    "body": "he fought the arch tempered, which is significantly harder. you don't have to fight any arch tempereds to progress",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Shameless_Catslut",
                    "body": "He's talking Arch-Tempered Negi, but even normal Nergi is a wall for new players. There are tips elsewhere for handling him, though.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "YukYukas",
            "body": "I don't even think you're supposed to solo AT monsters lmao. I did them enough times and gave it the middle finger lmao fuck that",
            "score": 1,
            "replies": [
                {
                    "author": "Longjumping-Knee-648",
                    "body": "Kush and vaal were piss easy solo. Teo was annoying, luna and nergi are way too overtuned for solo",
                    "score": 1,
                    "replies": [
                        {
                            "author": "YukYukas",
                            "body": "I only really remember Nerg and Velk. Former because he wouldn't stop spamming that slam, and it always got my ass. Velk because using an IG pretty much made the fight a cakewalk lol",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "MotherBeef",
                            "body": "Even normal Lunastra is a pain in the ass. The wind, the nova, her tail hitbox is way larger than Teos and than her own model, when she is enraged it’s almost impossible to actually fight her properly as her spits blue shit everywhere. One of the most chaotic, least enjoyable fights imo.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 0,
            "replies": [
                {
                    "author": "Longjumping-Knee-648",
                    "body": "My brother in christ. Arch tempered nergi is the most hard hitting monster before Exbehemoth. I was using CB but was being punished by his pepega slam everytime. Switched to wide GL and started poke shelling him",
                    "score": 6,
                    "replies": [
                        {
                            "author": "iMissEdgeTransit",
                            "body": "Srry my brain skipped past \"AT\". It's too early.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "eOnWaT",
                    "body": "It was AT, not normal.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "iMissEdgeTransit",
                            "body": "I gotta wake up before typing bullshit. Ty for the correction.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}