{
    "title": "I hate this quest so much now i actualy failed this 3 times",
    "author": "Status-Ad-8970",
    "subreddit": "MonsterHunterWorld",
    "rank": 7,
    "score": 71,
    "upvote_ratio": 0.78,
    "num_comments (reported by reddit)": 29,
    "url": "https://v.redd.it/i1vanifrwgpe1",
    "id": "1je7use",
    "selftext": "",
    "comments": [
        {
            "author": "uneven_cactus",
            "body": "I can't say If I found those zorah quests hard, but they are definitely the worst designed ones on the entire game. I understand their intention with them, literally a living volcano and stuff... But it only seemed to work in concept I guess",
            "score": 75,
            "replies": [
                {
                    "author": "Withnogenes",
                    "body": "Absolutely boring to hit the 3 rocks as fast as possible, skipping the nergigante entcounter and afterwards switching into carrying canon balls and ballista ammunition  for 5-10in.",
                    "score": 34,
                    "replies": [
                        {
                            "author": "Grub_McGuffins",
                            "body": "much more fun with friends when you've got three other idiots in a call shouting and running about like it's a race to finish the slog",
                            "score": 16,
                            "replies": []
                        },
                        {
                            "author": "Interloper9000",
                            "body": "I ended up standing there for 10 min. Every time.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Chomasterq2",
                    "body": "I prefer zorah over Lao Shan Lung, but not by much",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "padman531",
            "body": "Are you still using leather armour?\n\n\nI think you're supposed to upgrade that",
            "score": 36,
            "replies": [
                {
                    "author": "Status-Ad-8970",
                    "body": "i thought i could speedrun low rank since ive done it before but didnt think it was gonna be that bad with leather armor",
                    "score": -48,
                    "replies": [
                        {
                            "author": "padman531",
                            "body": "If you've done it before just use the guardian weapons and armor, that's what they're for",
                            "score": 33,
                            "replies": []
                        },
                        {
                            "author": "--Dolorem--",
                            "body": "You can speedrun it but use defender",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "Status-Ad-8970",
                                    "body": "Def wil now just thought leathet armor wasnt gonna be that bad lol",
                                    "score": -27,
                                    "replies": [
                                        {
                                            "author": "padman531",
                                            "body": "It's like, literally the worst armour in the game xD",
                                            "score": 25,
                                            "replies": [
                                                {
                                                    "author": "gadgaurd",
                                                    "body": "Stylish though. Glad we can layer it in IB.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "soviman1",
            "body": "If you are carting a lot on any fight, it is good to start with upgrading your armor to whatever the best you can make is. Sometimes you may need to grind out one or two monsters to make a better set, but it is definitely worth it.\n\nAnother thing is that you should make sure that you are always eating a meal before every fight. I cant tell if you did that here, but it looks like you carted and just ran back in right away. If you cannot eat because it has not been long enough, you can use an ancient potion if you have one to get max hp and stam.",
            "score": 8,
            "replies": []
        },
        {
            "author": "LittlePVMP",
            "body": "This quest is really easy if you don't use the absolute weakest armor in the game, which you do.\n\nAnd even with good gear, the Zorah-siege still takes way too long, and honestly just straight up sucks.\n\nWhich is super sad, because they obviously put a lot of budget and hours into this specific fight, imagine what they could've been doing instead...",
            "score": 6,
            "replies": []
        },
        {
            "author": "The_Joker_Ledger",
            "body": "I didn't think you can even fail this one.",
            "score": 3,
            "replies": []
        },
        {
            "author": "gian2099",
            "body": "If this is the cave one. Don't you just need to watch it until you do the cannon and DRAGONNATOR part?\nAnd nice you still have the default leather armor while been this far into the game",
            "score": 4,
            "replies": [
                {
                    "author": "Hundstrid",
                    "body": "Wait, what?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mero34",
            "body": "If this is the story mission, then that's your fault, you shouldn't have a weak armor at this point, i have never even came close to dying except wen I am just damage tanking when destroying the cores",
            "score": 4,
            "replies": []
        },
        {
            "author": "HawkeyeG_",
            "body": "Craft better armor. \n\nDon't go in with low health + stamina. Take the time to do expeditions for materials to make Max Potions, or at least some Nutrients and Rations or Steaks.",
            "score": 2,
            "replies": []
        },
        {
            "author": "StillGold2506",
            "body": "They havent done a Good Siege monster since MH tri with Jhen Morrah\n\n  \nand they reused in all 3rd generation and we got a variant in 4U for some reason Dareh Morrahn...why? I mean I still like the fight.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Th3AnT0in3",
            "body": "Change your armor to get more defense, eat to get +50hp, try using health boost for even more health.\nThat's one of the easiest quest, but also the worst designed.",
            "score": 2,
            "replies": []
        },
        {
            "author": "oldmangrumpy420",
            "body": "EAT",
            "score": 1,
            "replies": []
        },
        {
            "author": "doubletimerush",
            "body": "Send an SOS flare",
            "score": 1,
            "replies": []
        },
        {
            "author": "someone2795",
            "body": "I literally do this quest naked because it bores me so much. You don't even need to get on him, just use the artillery and cannons.",
            "score": 1,
            "replies": [
                {
                    "author": "Zeekie_P",
                    "body": "Did not know this. I still get on him for parts.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "iShadePaint",
            "body": "Im so glad I forgot about these parts of the game lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "beyeonic",
            "body": "... do you not have a meal and cool drink minimum in you? Mega demon drug, mega armorskin? I don't see any of those things up top.. do yourself a favor.\n(Upgraded) armor and charms resistant to fire.\nYou've got this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ApprehensiveAd3776",
            "body": "Brother eat something",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrFantasticGhost",
            "body": "Use water weapons against the spires on him to quickly get them down.  \n  \nPut two heavy artillery and pro transporter via jewels or charm or even armor. It makes the cannon section much faster.  \n  \nUse Ancient potion when you get carted. The easy way of getting back to full health.\n\nCraft or upgrade your armor, why you still in leather at the end part of the game? \n\nThe fight is boring, but there are ways to speed it up.",
            "score": 0,
            "replies": []
        }
    ]
}