{
    "title": "FUCK Black Veil Vaal Hazak",
    "author": "Infinite_Holiday9511",
    "subreddit": "MonsterHunterWorld",
    "rank": 3,
    "score": 65,
    "upvote_ratio": 0.83,
    "num_comments (reported by reddit)": 40,
    "url": "https://www.reddit.com/r/MonsterHunterWorld/comments/1jeg27u/fuck_black_veil_vaal_hazak/",
    "id": "1jeg27u",
    "selftext": "That's it",
    "comments": [
        {
            "author": "N1dhogg3r",
            "body": "Effluvia resistance",
            "score": 102,
            "replies": [
                {
                    "author": "kidanokun",
                    "body": "Great help, but doesn't protect from that backward breath attack, and those fogs that created by its explosive attack",
                    "score": 6,
                    "replies": [
                        {
                            "author": "icemage_999",
                            "body": "There's no law that says you have to chase him through the haze. Just back away and let him come to you.",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "Quietsquid",
                                    "body": "Everyone always seems to be trying to speedrun. You have a full fifty minutes to work with, you can make use of an extra thirty seconds occasionally.",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "DanielTeague",
                                            "body": "If you do want to speedrun it, the clouds are in a circle around them and you can hang out at its feet to avoid them until they inevitably move away from the eye of the nasty storm.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "knight_in_white",
                                            "body": "What was it Abraham Lincoln said? “Give me an hour to fell an elder dragon and I’ll spend the first 2 carts sharpening my switch axe”",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "EntertainersPact",
                            "body": "I’m a hammer main and I didn’t have any trouble with those. He can be waited out pretty easily if you play patiently enough",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Nightmari0ne",
            "body": "Hazmat\n\nEfluvia resistance\n\n#BURN THAT FUCKER TO THE GROUND\n\n*(Yes, fire)*",
            "score": 19,
            "replies": [
                {
                    "author": "Infinite_Holiday9511",
                    "body": "Well goes who just upgraded their weapon to the Velkhana tree?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Nightmari0ne",
                            "body": "Oof\n\nTime to farm Rathalos!",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Infinite_Holiday9511",
                                    "body": "*external screaming*",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "roonzy94",
                                            "body": "Yea….. get an element of each type at least for these types of scenarios. Investigations are your friend",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Maggle_",
            "body": "r/monsterhunterrage",
            "score": 14,
            "replies": []
        },
        {
            "author": "gadgaurd",
            "body": "My first fight against that fucker took just shy of 40 minutes. That was one hell of a Hunt.",
            "score": 5,
            "replies": [
                {
                    "author": "Infinite_Holiday9511",
                    "body": "I can't even find people with the SOS, probably because they how utterly bullshit this is and don't want to waste their time",
                    "score": 1,
                    "replies": [
                        {
                            "author": "VergesOfSin",
                            "body": "What platform you on? If you’re on Xbox I’ll make mincemeat of him",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Dry_Smell433",
            "body": "I had 2 peices of Girros gear and 1 miasma gem. Gave me Effluvial Resist 3 and Effluvial expert. That'll mitigate most of the damage. However you can still be chipped by effluvial. \n\nLure the bastard out of its Effluvial. Fight on your terms not Hazaak.",
            "score": 3,
            "replies": []
        },
        {
            "author": "No_Grapefruit_7845",
            "body": "I have the same line of thinking  \nBut with.... the Monkey",
            "score": 3,
            "replies": []
        },
        {
            "author": "That1RagingBat",
            "body": "**PREACH BROTHA**",
            "score": 3,
            "replies": []
        },
        {
            "author": "OsirisAvoidTheLight",
            "body": "Resident Evil version goes hard",
            "score": 3,
            "replies": []
        },
        {
            "author": "Gomberstone",
            "body": "My favorite monster! Man i love to hunt him!",
            "score": 3,
            "replies": []
        },
        {
            "author": "fluegtar",
            "body": "Blackrock Veil Hazak is fun. Fuck Rajang bro",
            "score": 3,
            "replies": [
                {
                    "author": "No_Fox_Given82",
                    "body": "Mate Furious Kong is a crazy fight it's basically RnG if I can beat him lol",
                    "score": 1,
                    "replies": [
                        {
                            "author": "fluegtar",
                            "body": "Haven't gotten to Furious Rajang but I fucking dread it. Been farming stamina recovery and duration decorations to prepare for that 😅",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "No-Examination1749",
            "body": "My giving nickname to Black Veil Valal Hazak I called it “Covid Dragon”",
            "score": 2,
            "replies": []
        },
        {
            "author": "kyuuri117",
            "body": "My favorite fight in world/Iceborn. Couldn't tell you why, I just enjoy it a lot. Don't even need effluvial res when you learn the fight.",
            "score": 2,
            "replies": [
                {
                    "author": "Infinite_Holiday9511",
                    "body": "Learning the fight is kinda useless when the effluvial breath hits you even behind him",
                    "score": 3,
                    "replies": [
                        {
                            "author": "kyuuri117",
                            "body": "The effluvial reducing your health doesn't matter if you don't get hit tho",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Nordic_Krune",
            "body": "Lol me and my friend just fought him in The Ancient Forrest\n\nIt took us 30 minutes but it wasn't a hard fight by any means\n\nI had Euffla resistance 3, he had 1",
            "score": 1,
            "replies": []
        },
        {
            "author": "bugogkang",
            "body": "I love both Vaals, I did build for 3 levels of effluvia res for Blackveil. Not a crazyyyy hard fight but definitely worse than the other elders pre-Alatreon",
            "score": 1,
            "replies": []
        },
        {
            "author": "ArcusAllsorts",
            "body": "AT Vaal was so good. Black Veil stood no chance.",
            "score": 1,
            "replies": []
        },
        {
            "author": "IAmTheGreybeardy",
            "body": "Blackveil is one of my favourite monsters from Iceborne.",
            "score": 1,
            "replies": []
        },
        {
            "author": "zzvoltaic",
            "body": "hey i just beat him a couple days ago and all i really changed in my loadout from the last fight was slottimg in 2 effluvium resistance gems (i didnt have a third one). it takes pretty long for the effluvium to build up assuming you arent getting hit left and right, and thats where my next tip comes from: just be patient. the only thing that really poses a threat are the farts, so just stay behind him and learn the timings for the back farts since those are the most predictable. keep poking until you get the timings right and youll be completely fine. i only fainted once in the hunt and that was because i cornered myself like a fucking idiot, but other than that it was pretty fun. his attacks are really easy to avoid but its balanced my making them do insanely high damage, so just keep an eye out for the lazers and big breaths and DONT overextend",
            "score": 1,
            "replies": []
        },
        {
            "author": "Commercial-Dealer-68",
            "body": "I wouldn't hate him so much if he didn't replace regular Vaal Hazak in Master Rank. Just beat him the one time its required and then use the Resident Evil Event quest to farm. It's a way more fun fight.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Shroomheadmatt",
            "body": "Just beat it the other day after coming back to the game after a couple years. Hated every second of it",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hopeful-Prompt4755",
            "body": "One thing to note, you can gem effluvia resistance to a glide mantle and rotate it with your immunity mantle. Very small gap but should be doable if you start with your immunity mantle first, that way you don’t have to dip into your build to get effluvia.\n\nTake your time though. unless you have a shield with guard up, If it ever gets on its hind legs, back up. There is definitely sound and physical queues for all of its attacks. Listen and learn.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Fox_Given82",
            "body": "Couldn't do him either but I crafted and maxed out the Miasma charm, and then he's just another Elder Dragon",
            "score": 1,
            "replies": []
        },
        {
            "author": "MonkeyTarpdo",
            "body": "If you insist",
            "score": 1,
            "replies": []
        },
        {
            "author": "DudeBroFist",
            "body": "Skill issue.",
            "score": 0,
            "replies": [
                {
                    "author": "Infinite_Holiday9511",
                    "body": "Yes.",
                    "score": 0,
                    "replies": []
                }
            ]
        }
    ]
}