{
    "title": "I witnessed someone commit suicide today",
    "author": "Silent-Youth4742",
    "subreddit": "offmychest",
    "rank": 17,
    "score": 358,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 40,
    "url": "https://www.reddit.com/r/offmychest/comments/1jdw07p/i_witnessed_someone_commit_suicide_today/",
    "id": "1jdw07p",
    "selftext": "Me and my partner had dinner at a restaurant in Midtown. As we were leaving the restaurant, we strolled across the street on the side of a high story building with sort of a cul de sac where a man was cycling around with packages behind his bike. Suddenly I heard him yell, \"OH SHIT\" and I looked left and up and saw a man fall down to the concrete. I started to back up off the sidewalk and into the road. My partner tried to hold and shelter me from it, telling me not to look.\n\nNext thing I saw was the blood on the concrete below his head. Him just laying there. People calling 911. Doorman yelling for a tablecloth from the restaurant/bar across the street. Someone laid a cloth over his head. Then a tarp. We tried to stop adults with their kids from passing by. It was awful. I'm still in shock.",
    "comments": [
        {
            "author": "whatscookinbeach",
            "body": "I’m so sorry that happened:(\n\nI once saw a man jump off of an overpass into high speed traffic. Still sticks with me.",
            "score": 138,
            "replies": []
        },
        {
            "author": "Musicology91",
            "body": "I’m sorry that happened to you. \n\nSomeone jumped in front of me a few years ago while I was pushing my 1 year old in a pram! We ended up covered in her blood she landed so close! Thankfully my son was asleep and didn’t see anything. \n\nThe shock lasted a few weeks. Thankfully I had no PTSD symptoms. \n\nI found that going to the inquest to find out why she jumped was really healing. Since then I’ve barely thought about it. \n\nTake it easy and make sure you talk about it with people.",
            "score": 77,
            "replies": [
                {
                    "author": "Silent-Youth4742",
                    "body": "Thank you. I am fortunate to have a community to talk to, and will be seeing my psychologist soon. May I ask, what do you mean by \"going to the inquest\"? I have been googling and reading about people who jump. Is that what you mean?",
                    "score": 25,
                    "replies": [
                        {
                            "author": "Musicology91",
                            "body": "I contacted the coroner and asked for information about who had died and they invited me to attend the inquest in court.",
                            "score": 26,
                            "replies": [
                                {
                                    "author": "Silent-Youth4742",
                                    "body": "Oh I understand now. We after police and ambulance arrived. How did you reach out to the coroner? Is that something we could still do? I do want to know more about this man.",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "Musicology91",
                                            "body": "If you just google which coroner is in charge of the area in which he died, their email should be public information.",
                                            "score": 18,
                                            "replies": [
                                                {
                                                    "author": "Silent-Youth4742",
                                                    "body": "Thank you. I emailed them.",
                                                    "score": 17,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Iifeismudandiamstuck",
            "body": "That is definitely a traumatic situation but how brave u guys were for helping the parents not scare their kids, people dont realise how much them doing it so publicly can effect others for years! Im not saying anyone should commit suicide and do not support it been there done that mindset moved forward. If ur gonna do it make sure its not gonna effect LITTLE ONES ON THE STREET AND SHI ygm!!? Im so sorry u went through that today",
            "score": 143,
            "replies": [
                {
                    "author": "Silent-Youth4742",
                    "body": "We tried to tell them to cross the street. They didn't listen to us and just shuffled their kids past.",
                    "score": 62,
                    "replies": [
                        {
                            "author": "tiredgirl93",
                            "body": "My uncle was 2 seconds away from witnessing a suicide - he heard the woman land and before he could stop in his tracks, he'd rounded the corner and her body was ahead of him. He and another man who had come from the opposite direction tried to stop families from coming past as it was school pick-up time and there was a school nearby, but barely anybody listened to him. Quite a few apparently said to him \"it's fine, they won't be bothered\" about their primary school aged kids. Sadly I imagine it's stuck in the minds of a lot of those children. You did the best you could.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TheGrammarNazzi",
                    "body": "Well sorry that he disturbed you with his crippling depression",
                    "score": -100,
                    "replies": [
                        {
                            "author": "MollyViper",
                            "body": "Oh please stfu, the least someone could do when ending their own life is to do it in a way that will traumatise the least amount of people. No one else needs to have their life ruined because someone decided to end theirs.",
                            "score": 37,
                            "replies": [
                                {
                                    "author": "Eager_Panther3825",
                                    "body": "So you would rather prefer someone to endure all of the pain and torture for the sake of not traumatizing anyone else? How thoughtful of you",
                                    "score": -14,
                                    "replies": [
                                        {
                                            "author": "MollyViper",
                                            "body": "Are you an idiot or are you just pretending to be? You’re talking to someone who’s chronically depressed and has been suicidal throughout my life a lot. Never did I ever, while planning to kill myself, think of jumping in front of a train or jumping from a building. Because compared to some, I am considerate enough to not want to fuck someone else over. \n\nAnd now I stay here because I have a daughter and I would never put her through growing up with a mother that killed herself. So might as well make the best of it and fix my mental health to the best of my capabilities.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "Eager_Panther3825",
                                                    "body": "I respect that, but as another suicidal person I honestly don’t give a slightest amount of fk if i “traumatize” the people that are in the same house as i am in. Because they are the ones who traumatized me all along and caused me to become like this, so why should and would i care for what would they feel and think if i end myself in the house? I of course wouldn’t do it in front of people who has nothing to do with it",
                                                    "score": -3,
                                                    "replies": [
                                                        {
                                                            "author": "MollyViper",
                                                            "body": "Well, that was the same for me as a teenager. I tried to hang myself in my room as a teenager but the rope I used wasn’t strong enough. I did not care about traumatising them either. So I get that part. I wouldn’t care about traumatising my parents, if I ever did it, which I won’t, I wish they’re the ones that find me. \n\nSorry for coming off a bit strong, I was having a shit time when I got the notification. I’m really, really sorry.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "Eager_Panther3825",
                                                                    "body": "No need to apologize i really think i am an idiot anymore, and i am sorry that you had to go through that as well, hope you are and will become better and have a better life with your child",
                                                                    "score": 6,
                                                                    "replies": [
                                                                        {
                                                                            "author": "MollyViper",
                                                                            "body": "Thank you! I hope things become better for you too! And you’re not an idiot. I was just being hot-tempered because I had been drinking and there was some drama around me right before I received your response. It’s a lesson for me to take a few breaths before I respond to comments.",
                                                                            "score": 4,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "HeatherLouWhotheEff",
            "body": "I’m sorry.  I know it is hard.  I found someone who attempted to kill themselves years ago and while they were alive when I found them, they died later.  It comes back to me at the oddest times and I don’t go to the place where I found them anymore, but I have been able to move past it though I will say those early days were the worst because the image would just pop into my head and I’d feel guilty for being disturbed or replay how I reacted.   Seek therapy and hang in there.  It gets better. ",
            "score": 9,
            "replies": []
        },
        {
            "author": "oregonduck18",
            "body": "Please take care of yourself. Strange advice, but play Tetris on your phone ASAP. It’s been shown to reduce PTSD symptoms after exposure to trauma. It sounds odd, but it can help. Talk to people that you trust and find a therapist if you can. Much love.",
            "score": 63,
            "replies": [
                {
                    "author": "The_Downward_Samsara",
                    "body": "This has never been properly proven.",
                    "score": 21,
                    "replies": [
                        {
                            "author": "Pearlbracelet1",
                            "body": "Sometimes the placebo of having intentionally \\*done something\\* in order to help yourself heal is enough in and of itself. Because you look back on the moment and think 'No. I did something that will help me. This will be more manageable because I took action to protect my mental health'.",
                            "score": 45,
                            "replies": []
                        },
                        {
                            "author": "Wonderful-Nerve3132",
                            "body": "I’ve never looked into it myself, but for a few months after my mom passed (last october) I played my Nintendo DS which had Tetris a lot and Guitar Hero with my boyfriend, I think it did help me. At the very least I wasn’t spiraling all the time from having something to focus on. Even though I’d still be thinking about it, it felt more logical and less emotionally consuming. Everyone is different but I think most people would benefit from doing a small activity like playing a game rather than sit and dwell.",
                            "score": 24,
                            "replies": [
                                {
                                    "author": "lolgobbz",
                                    "body": ">At the very least I wasn’t spiraling all the time from having something to focus on. Even though I’d still be thinking about it, it felt more logical and less emotionally consuming.\n\nI play Tetris when I have to make scary adult decisions. Taking the emotion out of the thought process makes me feel more in control. Not so scared, yk?",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Wonderful-Nerve3132",
            "body": "I’m so sorry, thank you for trying to help others not have to experience it as well. That is truly awful to deal with and I hope you are able to talk to the right people to get past it ❤️",
            "score": 5,
            "replies": []
        },
        {
            "author": "FirebirdWriter",
            "body": "Please get therapy if you haven't already. This can cause PTSD and therapy will help. I have had things that would without care have caused PTSD in the last year such as seeing someone trip and burn to death on the sidewalk. I did what I could for them and I appreciate not having that replaying in my head constantly anymore. This is horrible. Suicide is also something that witnessing it does increase the odds of someone going there themselves. I am sorry you went through this",
            "score": 3,
            "replies": [
                {
                    "author": "Silent-Youth4742",
                    "body": "Thank you. I made an appointment to see my psychologist on Wednesday. And yes.. thank you again for understanding. It just replays in my head. And I hear that awful sound.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "FirebirdWriter",
                            "body": "Yes. Its horrible. It will get better with help. I am proud of you",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "annmouse06",
            "body": "It sounds silly but play Tetris. “McGonigal talked about the research from Oxford University which found playing the video game, Tetris as soon as possible after witnessing or experiencing a trauma could prevent flashbacks.”",
            "score": 3,
            "replies": []
        },
        {
            "author": "Quarter_Shot",
            "body": "You may want to keep in mind seeing someone if you feel any lingering emotional effects...I'm sorry you had to see that.\n\nI hope his next death is more peaceful",
            "score": 2,
            "replies": []
        },
        {
            "author": "ghostygirl79",
            "body": "Midtown Atlanta? I'm going there in a few hours is the only reason I ask. My God, I am so, so sorry you had to witness that. I would NOT be ok!!",
            "score": 4,
            "replies": [
                {
                    "author": "Silent-Youth4742",
                    "body": "NYC around Grand Central.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "michxl_c",
            "body": "Damm",
            "score": 1,
            "replies": []
        },
        {
            "author": "Additional-Ad5298",
            "body": "I am so sorry that happened to you, prayers to you and the victims family <3",
            "score": 1,
            "replies": []
        },
        {
            "author": "7thpostman",
            "body": "I'm so sorry. That's awful.",
            "score": 1,
            "replies": []
        },
        {
            "author": "perksforlater",
            "body": "Awful and tragic thing to witness. Keep talking about it. I hope you will manage to process it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bookkinkster",
            "body": "I'm so sorry you witnessed that. It's such a rough time for so many people. It's very heartbreaking. It's traumatic to have experienced that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BeelzeBat",
            "body": "Don’t worry he’s just sleeping competitively",
            "score": -9,
            "replies": []
        }
    ]
}