{
    "title": "I Can't Eat Rice",
    "author": "Zilaxia",
    "subreddit": "offmychest",
    "rank": 14,
    "score": 12,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 9,
    "url": "https://www.reddit.com/r/offmychest/comments/1jehr9r/i_cant_eat_rice/",
    "id": "1jehr9r",
    "selftext": "You heard that right, I cannot eat rice (or beans). Am I allergic? Nope. On a diet? Nope. Some complex medical issue? No. I can't eat rice because of fucking trauma.\n\nThis is the most embarrassing and stupid thing that has happened to me and it's all because of my piece of shit father.\n\nI came to the US as a 6 year old, we came from Cuba and we were poor, Cubans eat \"congri\" which is basically rice and black beans EVERY. SINGLE. DAY. Now im not gonna rant on about how Cuban cuisine is actual fucking dogshit, but Cubans will eat the same thing every day like a DOG and be perfectly happy and in fact PREFER IT.\n\nSo, we were poor, so they fed me a lot of congri because we didn't have a lot of food, but we had enough to have basic \"cuban\" food, like congri. I was a picky eater (I have ADHD and POSSIBLY autism but thats a maybe, and this explains why I was and still am the way I am) and my father, HATED that. First off my dad is a piece of shit human being, he is the most evil person I have ever met, that is it, all you have to know. So he would force me to eat congri everyday because he hated that I was picky and thought I was \"going to die\" because I didn't eat a gigantic bowl of it, but lets be real, he was a sadistic piece of shit that liked to torture his daughter, so he would beat me, scream at me, etc. because I didn't want to keep eating, I was FULL or actually just DIDN'T want to eat the same shit everyday. I actually didn't hate congri by the way, I liked it, but he would FORCE me to eat it everyday, he ruined the dish for me, so yeah, this was the usual for me as a child for weeks, maybe months.\n\nUntil one day, he was doing the usual, beating me and making me cry so I would eat, and he forced me to eat it, until I stood up, and threw up all. over. the. place.\n\nand I mean all over.\n\nAfter that, he never forced me to eat rice again, didn't even try. After that day, I could not, absolutely not eat rice. I couldn't even fucking look at it. This happened when I was around 7-8, and for years and years I struggled, and STILL DO. People have made fun of me for my rice trauma, because yeah its FUCKING DUMB I'd make fun of it too, and I have to explain to people to PLEASE keep your rice dish away from me because it GROSSES me out, and I had to explain that ridiculous story EVERY. TIME. \n\nand I have TRIED to change man, trust me I have.\n\nI have tried to eat sushi, threw up all over the restaurant, GREAT experience.\n\nAnd whenever I go to a restaurant I have to miss out on sushi and all the other beautiful rice dishes that look great.\n\nI have not been able to progress on my mental rice trauma, because it's not a physical thing at all, purely mental. Wanna know how I know? My husband.\n\nWe went to a korean restaurant once and I ordered these fried fish things, little did I know, they were filled with rice inside. I bit into it and I felt fear and disgust fill up my body once I saw these white dots inside.\n\nBut my husband is a little trickster.\n\nI start panicking going \"Is-..is that rice..?\" and he goes \"NOOO no nooo...that's the fish eggs, theyre tiny and pale\"\n\nI know a great deal about animals, it's almost like a special interest to me, and I was like \"..These don't LOOK like fish eggs..but im not grossed out anymore so I guess hes right\" and I ATE it, years later he told me he tricked me and I learned that this is purely a mental issue.\n\nI still do not have the bravery to try rice, not even sushi, but I've thought about it, because I HAVE progressed on my bean issue.\n\nA few weeks ago I ordered at a Chili's I ordered southern spring rolls, little did I know they had BLACK beans in them, and I took a bite, TASTED the bean, but I was doing my best to not panic, I thought, since there's so many other flavors happening, the bean isn't grossing me out, and even though I CAN taste it, it tastes pretty damn good, and I ate all the spring rolls, it was a bit hard sometimes to not throw up but I mostly enjoyed it. im IMPROVING. And today a few minutes ago I ate a dorayaki, a pancake filled with SWEET RED BEAN PASTE, and I could TASTE the flavor of the bean and it was DELICIOUS.\n\nI don't know WHY im posting this, but I guess I did need to get it off my chest and tell someone other than my husband.\n\nIm improving on these stupid little rice and bean traumas, and now that I think about it, it's a big old FUCK YOU to my dad. FUCK YOU for giving me the dumbest type of trauma ever compared to all the other bullshit you gave me, and FUCK YOU for making me miss out on delicious rice dishes and bean dishes. and FUCK YOU because im going to prove you WRONG.\n\nI hope I can improve on the rice trauma soon, I think i'll start with sushi, hopefully I don't throw up. Wish me luck.",
    "comments": [
        {
            "author": "not_gay_enough",
            "body": "Props to you for pushing through it, I know lots of people who would just be fine living without it and I’m impressed you’re putting in the work! I’m sorry you went through that, but I definitely don’t think you’re stupid. As a kid whenever I was sick and throwing up my mom would give me gatorade for the electrolytes. So most of the time I was just throwing up gatorade. I can appreciate her good intentions, but to this day I still don’t drink gatorade because it just tastes like puke to me. I can tolerate some flavors but I don’t bother to seek it out ever.",
            "score": 3,
            "replies": []
        },
        {
            "author": "DigitalDuke32",
            "body": "Food phobias are tough. \n\nYou are very aware that it is psychological and not physical. You can live a great life without rice and beans, but not a carefree one. Ever vigilant and unnecessary restictive you will vomit if fed them because of:\n\n fear of liking them? Hatred of having been forced to eat them? Revenge for your perceived mistreatment?  Taste and texture issues ? General aversion to and adverse association with your culture, family, poverty? All of the above? \n\nAnyway like all phobias they will need to be treated with exposure therapy and getting at the root causes. \n\nOr just don't eat them",
            "score": 3,
            "replies": [
                {
                    "author": "Zilaxia",
                    "body": "I didn't even mention how vigilant I have to be, thats very true. I have spent almost my whole life being careful of a grain of rice being in my food which is why I always have to make my own, no matter how many times you tell people \"hey, PLEASE dont put this in\" they will still be ignorant.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "DigitalDuke32",
                            "body": "Again you know you have a problem that is psychosomatic. It means mind affecting the body(nausea). Help is possible with professional treatment and therapy. \n\nDon't suffer with this, conquer it and move forward towards food  freedom, and Mexican or Asian food, yum!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "mx_Vee",
            "body": "I get it, when I was a kid I ate these thin wafer things that I can’t even remember what they’re called anymore, but I threw up once from eating them and have never been able to eat them since. Can’t even eat KitKats because of the texture resemblance. But kudos to you for knowing your trauma, the world won’t end because you can’t eat rice 🤗",
            "score": 1,
            "replies": []
        },
        {
            "author": "R-Lee16",
            "body": "That really sucks. \n\nThere are some therapy’s that might help. \nEMDR is a rapid eye therapy that is used to treat PTSD. \nThere are also some hypnotherapy programs that might help. \n\nGood luck",
            "score": 1,
            "replies": []
        },
        {
            "author": "Intelligent_Till_433",
            "body": "When I was maybe 7, I threw up after eating rice.  (I had a stomach bug) I didn't eat rice for several years because I associated it with getting sick.  That was not even a traumatic event like you experienced and I still had an aversion for years.  The fact that you want to work past it and have had success with beans tells me that you will get there.  Sushi is amazing...great place to start!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rjk_15",
            "body": "Sympathizing with you OP but also proud that you're trying to overcome it.\nIt's nothing food related for me but it was riding a bike that (after reading your post) I realized I've been avoiding since the time my uncle pretty much forcefully tried to teach us (me and sibling) to the point of raising his voice.\n\nI love how you had a nice experience with the azuki (red bean) in dorayaki. If you're ever feeling courageous and want to test out waters for rice, maybe sweets is the way. There's a lot of asian rice-based sweets and (sometimes savory) snacks around that's ground and flavored so it doesn't have the same taste or mouth feel as just plain grains any more.\n\nstarting from japanese since you had dorayaki in your area and there might be more jp stuff available: mochi/daifuku & senbei (there's sweet and savory variants for this), mochi buns (it's like normal bread but springy and a lil chewy)\n\nfor the rest, it my not be commercially available so idk the availability in your area if a restaurant or asian mart would have it:\n\n-filipino/indonedian: hopia/bakpia (sometimes filled with sweetened mung beans similar to azuki - comes in yellow/red/black)\n-chinese: tikoy, tikoy rolls (comed flavored too, with various fillings ranging from crushed nuts mungbeans and such), tang yuan (similar to tikoy and mochi but served differently as it's in \"soup\")\n-filipino/malaysian steamed rice cake - puto/putu - it's ground glutinous rice so it doesn't look or feel like grains, for the topping it depends on preference if this is with shredded coconut or cheese or something else\n-thai mango sticky rice (though this might be a bit too similar looking so proceed with caution ig)",
            "score": 1,
            "replies": []
        }
    ]
}