{
    "title": "My bf doesn’t know I’m traveling across the country to celebrate his birthday with him",
    "author": "Zach-uh-ri-uh",
    "subreddit": "offmychest",
    "rank": 3,
    "score": 122,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 20,
    "url": "https://www.reddit.com/r/offmychest/comments/1jei1jq/my_bf_doesnt_know_im_traveling_across_the_country/",
    "id": "1jei1jq",
    "selftext": "I’m so excited and I can’t tell him yet. In 8 hours I’m going to surprise him in the morning on his birthday and he doesn’t suspect a thing. I pretended to have my normal evening phone call with him while stressing out the door, I complained on the phone about my early morning doctors appointment tomorrow… EEEEEK!!! I feel like a double agent.\n\nIt’s one of the big birthdays too. He’s been sounding a bit sad about feeling lonely about the birthday and ive damn near exploded from desire to say something but I’ve managed to keep my mouth shut  can’t believe it’s happening so soon!! \n\nI’ve coordinated with his neighbor to let me in through the big door and his roommate to tape the key to the apartment under the mailboxes so I can sneak in tomorrow morning and sing happy birthday.\n\nCan’t wait to see him and I can’t wait to see the look on his face!",
    "comments": [
        {
            "author": "NikkiNot_TheOne",
            "body": "Don't listen to anyone trying to rain on your happiness!! From someone who has been through too many storms, there's no time for that.\n\nYou will have the best time and he will ALWAYS remember it. He won't be lonely and that's what life is about. Sharing it with the people who want to share it with you but not feel the need to do it.\n\nYou want to be there with him, it doesn't get any better than that.",
            "score": 41,
            "replies": []
        },
        {
            "author": "Mikinl",
            "body": "I used to do that and fly across the ocean a couple of times to surprise my then girlfriend, just because. \n\nNot even for birthday.\n\nIt was so worth every time.\n\nHave fun, enjoy your stay.",
            "score": 25,
            "replies": []
        },
        {
            "author": "Mountain-Manner8858",
            "body": "I think you should set up your phone to record when he sees you, when he walks in the door. It would be wonderful to see a happy moment in a world of such chaos and negativity. Enjoy your trip!",
            "score": 7,
            "replies": []
        },
        {
            "author": "Savings-Ad-3607",
            "body": "Please update us if he has a guest over 👀",
            "score": 69,
            "replies": [
                {
                    "author": "sanebutoverwhelmedtx",
                    "body": "This is, unfortunately, the first place my mind went to.",
                    "score": 37,
                    "replies": [
                        {
                            "author": "CommercialExotic2038",
                            "body": "Me too.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Ralphythechomo69",
                    "body": "That’s hilarious what everyone secretly wishes for the sake of tea",
                    "score": 13,
                    "replies": [
                        {
                            "author": "NofairRoo",
                            "body": "Naw. I’m hoping he just gets a lovely and unexpected surprise and treat. I’m hoping everyone comes out of this feeling and being loved.",
                            "score": 16,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MeowMeowBiatch",
                    "body": "This is a mean thing to say, they're so excited!",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "PicklesNBacon",
                    "body": "Ha right! I hope to not see a post about that from OP tomorrow…",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Bookworm8989",
                    "body": "Right? Like those videos of the girls surprise visiting their long distance boyfriend in college and it’s clear they were with another girl.  My mind went exactly there as well.",
                    "score": -3,
                    "replies": []
                }
            ]
        },
        {
            "author": "carameldreamss",
            "body": "So excited for you!^-^ I would melt if someone did that for me💗",
            "score": 5,
            "replies": []
        },
        {
            "author": "pavlovs_pavlova",
            "body": "This is the sweetest thing. I hope you both have the best time.",
            "score": 3,
            "replies": []
        },
        {
            "author": "givemeyourking",
            "body": " I Would hate being surprised like that, I need time to clean and prepare for company",
            "score": 5,
            "replies": [
                {
                    "author": "azdoroth",
                    "body": "Good thing OP isn't dating you. I'm sure OP knows her whether or not her bf would like getting surprised like that before doing it.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "1justathrowaway2",
                    "body": "I'm with this all the way. I take really good care of other people but if it's just me I slack. \n\nEven just like oh shit there isn't a trash bag in the bathroom trashcan. I take a significant amount of time to prepare for SOs. Buy their favorite snacks. Make sure everything is pristine. If I'm late for work it doesn't really matter if I shave and leave hair on the sink. Can clean it later. Isn't any world I'm doing that if I live with someone or have company coming.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "hoedonkey",
            "body": "So sweet! Love a good birthday surprise!!! Hope you have an awesome morning :)",
            "score": 1,
            "replies": []
        },
        {
            "author": "The_Girl_That_Got",
            "body": "That’s really exciting",
            "score": 1,
            "replies": []
        }
    ]
}