{
    "title": "How do you cope with the pain of making a major mistake that you can’t change and have to live with?",
    "author": "YelaNelaMela",
    "subreddit": "AskWomen",
    "rank": 19,
    "score": 17,
    "upvote_ratio": 0.86,
    "num_comments (reported by reddit)": 29,
    "url": "https://www.reddit.com/r/AskWomen/comments/1jclbjl/how_do_you_cope_with_the_pain_of_making_a_major/",
    "id": "1jclbjl",
    "selftext": "",
    "comments": [
        {
            "author": "kaeorin",
            "body": "I just do. If you have to live with it, you have to live with it. What other options are there? I try not to think about it, and I try to make better choices moving forward.",
            "score": 29,
            "replies": []
        },
        {
            "author": "RaccoonImmediate5795",
            "body": "Realize that we all make some mistakes; larger or lesser, it does not matter. Be happy that you have the opportunity to learn this way and that the lesson wasn't much harder .",
            "score": 15,
            "replies": []
        },
        {
            "author": "Prislv223",
            "body": "You go to bed with it, you wake up with it. Guilt, shame, lamenting. You have to feel it. It won’t go away by some magic. Time heals. Just everyday do better. Be better.",
            "score": 11,
            "replies": []
        },
        {
            "author": "Parking_Buy_1525",
            "body": "radical acceptance\n\naccept things for what they are with the ability to absolve judgement",
            "score": 8,
            "replies": []
        },
        {
            "author": "lynzpie-",
            "body": "Therapy. A lot of therapy.",
            "score": 7,
            "replies": []
        },
        {
            "author": "MutedOlive9065",
            "body": "Coming to terms with the fact that beating myself up about it won’t change the fact it happened and reverting my thought process to something that is beneficial to my mental health. Repeat cycle until eventually you think about it less and less. Learn from your mistake, be humble and give yourself grace.",
            "score": 8,
            "replies": []
        },
        {
            "author": "lifelovepursuit",
            "body": "Meditation 🧘‍♀️ babe fuck ton plus acceptance and wanting to move forward",
            "score": 3,
            "replies": []
        },
        {
            "author": "geeltulpen",
            "body": "You feel pain from the mistake because you have grown as a person, and the person you are right now wouldn’t make it.\n\nSo while it’s painful, you DID learn something from it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "LveMeB",
            "body": "I don't mind making mistakes, as long as they're truly my mistakes and not someone else's. I generally don't regret decisions I've made as long as I was given informed consent. My only regrets have happened whenever someone forces me into something.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alemya13",
            "body": "Feeling it. Letting your mind Go There. Grieving, if you need to. Then you move away from that mental address and don’t leave a forwarding pot. Visit, if you need to, but don’t live in that mental place - that’s compounding the mistake. Give yourself grace. Learn lessons from the mistake. Let it flow through, then out.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ApexPedator69",
            "body": "Learn from that mistake and make sure to never do it again. Accept what happened happened tbh. You can't change the past but you can prevent said mistake from happening again and if you allow your emotions to rule over you due to it then maybe that's exactly what you got to work on. I've done some pretty big mistakes in my time years ago but that doesn't mean I gotta let it rule my life soo I just think shit happens and I ain't doing that crap again. It's pretty simple tbh one only makes it complicated if you make it complicated.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ladylemondrop209",
            "body": "Just accept it and make the best out of that situation.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Geosync",
            "body": "Practice meditation, self-acceptance, self-love, and forgiveness. Allow yourself to grieve. It has been said that time heals all wounds.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mmnicole",
            "body": "Truly sitting with it, mourning what could’ve been, allow yourself to feel, and then forgive yourself. If not you’ll sit with it forever, and it affect your life and lead to more mistakes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "theplantsarealive",
            "body": "Don't flinch away from acknowledging it and figuring out how to learn from it and how to take responsibility for it. \n\nDon't deny or avoid it, even though it can be painful to think about. The more you avoid it the harder it'll be to deal with, and instead of healing it'll just kind of get worse and worse in my experience. \n\nAt the same time, don't beat yourself up excessively. We fuck up. Sometimes we fuck up really bad. Some people fuck up worse than others, and if you're unlucky you may end up making a mistake so major that nobody around you has ever experienced something similar. Accept that. \n\nRegardless of the relative \"badness\" of your mistake, the reality is that it happened and it cannot un-happen. While this sucks, it also means you cannot waste time wishing it didn't happen (although I've definitely been there).\n\nAcknowledge it. \nDo what you can.\nTime helps.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DragonMasterBrady",
            "body": "I tell myself that mistakes are a part of life, as long as you learn from it and know to make a better decision if it comes up again. Also, dwelling on it or beating myself up over something I absolutely cannot change isn't going to help.\n\nI also try to put things in logical perspective: Did I make the right decision based on all the information I had at the time? A lot of the choices we make that end up being wrong are usually due to not having all the information, or learning the full picture AFTER we make the decision. Its really easy to think \"wow, I can't believe I did that... how horrible am I?\" when you have all the information...that didn't exist when a choice had to be made.\n\nMistakes happen; its what makes us human.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hello /u/Bunny-Bardot, welcome to r/AskWomen! **Please read this entire message before taking action.**\n\nAs this is your first day on Reddit, your comment has been removed to give you time to get a feel of the place. Feel free to lurk today and come back tomorrow.\n\n**No exceptions to this rule will be granted.** Please also **[read our rules](https://www.reddit.com/r/AskWomen/wiki/rules) before participating**.\n\nHappy reditting!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskWomen) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hello /u/One-Vast1700. **Please read this entire message before taking action.**\n\nYour post or comment has been removed because your Reddit Karma is too low to participate on AskWomen. You will be able to participate when your Karma has increased, you can do that by participating in good faith in other subreddits that don't have Karma requirements. This action **cannnot be undone** by the moderators.\n\n **No exceptions to this rule will be granted.** [Click here to read more about Reddit Karma](https://reddit.zendesk.com/hc/en-us/articles/204511829-What-is-karma-), and please also **[read our rules](https://www.reddit.com/r/AskWomen/wiki/rules) before participating**.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskWomen) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CanNotChangeName",
            "body": "Overthinking at 3 AM is my full-time job. But seriously, you either learn to laugh abuot it or let it haunt you forever. No in-between.",
            "score": 1,
            "replies": []
        },
        {
            "author": "batty48",
            "body": "Use it as a learning experience. Always try to do better",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hello /u/MoonlitxBlush. **Please read this entire message before taking action.**\n\nYour post or comment has been removed because your Reddit Karma is too low to participate on AskWomen. You will be able to participate when your Karma has increased, you can do that by participating in good faith in other subreddits that don't have Karma requirements. This action **cannnot be undone** by the moderators.\n\n **No exceptions to this rule will be granted.** [Click here to read more about Reddit Karma](https://reddit.zendesk.com/hc/en-us/articles/204511829-What-is-karma-), and please also **[read our rules](https://www.reddit.com/r/AskWomen/wiki/rules) before participating**.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskWomen) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Gigglepuuuffff",
            "body": "overthink at night and just accept it anyhow and sleep.. because nothing as such can be changed for now",
            "score": 1,
            "replies": []
        },
        {
            "author": "graaaaaaaaa",
            "body": "I admit it",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hello /u/PeeplySqueeps. Thank you for participating in /r/AskWomen. **Please read this entire message before taking action.**\n\nYour submission has been removed, because your account does not have a verified email. **No exceptions will be granted**.\n\nYou can verify your email address on the [Reddit Preferences page](https://www.reddit.com/prefs/update/), and if you have any issues with verification please contact reddit support at /r/help. **Subreddit moderators do not have the tools to aid with verification**, so please ignore the bot in italics below, do not message the mod team about this as we have no way of helping you.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskWomen) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}