{
    "title": "What is something you wanted to talk about but no one ever asks you?",
    "author": "Mission_Homework_545",
    "subreddit": "AskWomen",
    "rank": 14,
    "score": 55,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 137,
    "url": "https://www.reddit.com/r/AskWomen/comments/1jcssgi/what_is_something_you_wanted_to_talk_about_but_no/",
    "id": "1jcssgi",
    "selftext": "",
    "comments": [
        {
            "author": "Louisianimal09",
            "body": "Why tai lung in kung fu panda is considered the villain when shifu and oogway inflated his ego and guaranteed him without a shadow of a doubt that he would be the dragon warrior only for at the last minute to have it taken from him?\n\nTo elaborate…\n\nTai Lung is a characterization of the weight of expectation. He was Shifu’s prized student with the strength, skill, speed, and raw talent needed to inherit the dragon scroll. Which was rightfully his since his whole life was dedicated to, and even encouraged to earning it. Then some asshole tortoise tells him he’s a little angry since Shifu used him as a catalyst for his own ambitions despite Oogway also living in the temple during all of Tai Lungs life, training, and spare time where he could’ve dropped in at any time to balance his aggression. But noooooo, this bowl on legs decides like 2 1/2 decades later after Tai Lung is a man set in his ways to tell him he done fucked up. \n\nSo Tai Lung, rightfully, has some rage built up. He took it out on the local village, wrongfully, but still understandable, and Oogway has the audacity to put him down after being a silent objector for 25ish years. Then, after Tai Lung escapes prison he rushes back to retrieve the scroll. He doesn’t kill and rampage until the furious five confront him at the rope bridge where he wipes the floor with all five who were considered to be dragon warrior material, further proving he was more than worthy which justified his lifelong compulsion to earning it. By beating the 5 runners up at once further proved his rightful claim to it. \n\nWhen he fights Shifu he has that line where he’s throwing a flurry of punches and says “are you proud now? Tell me how proud you are” and Shifu confesses he was always proud which catches TL off guard because that was all he ever wanted. Approval. Approval and to be seen as worthy from his father figure. Shifu and Oogway are the reason for TL emotional shortcomings and pent up aggression. \n\nHis whole life he was forged into a weapon, but he obviously didn’t get a lot of hugs along the way or was told he did a good job. Cause and effect. He was put on a pedestal and made to believe from adolescence that he absolutely positively would become the dragon warrior and was never told otherwise so his arrogance became the fuze to the time bomb that was the expectations cast upon him his entire life. It’s tragic and Tai Lung was too talented to be cast aside like he was. His anger is warranted and was directed at the right people after his prison escape. 5 watered down versions of him got the business, his mentor, and Oogway’s weak ass would’ve got that werk too had he not bailed out like a coward early on in the movie. The only reason he lost is because the plot deemed it necessary since it’s a kids movie and we’re made to believe we’re all special or whatever. \n\nThank you for your time.",
            "score": 93,
            "replies": [
                {
                    "author": "Top_Presentation7515",
                    "body": "This is wonderful and I enjoyed every second of it",
                    "score": 21,
                    "replies": [
                        {
                            "author": "Louisianimal09",
                            "body": "I’m here all week",
                            "score": 13,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "bing-no",
                    "body": "I mean I don’t think Shifu was cast as being “in the right” by the movie either. He seems to regret it immensely, and can’t even seem to fight Tai Lung either.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "AutoModerator",
                            "body": "Hello /u/frozenbutterstick. Thank you for participating in /r/AskWomen. **Please read this entire message before taking action.**\n\nYour submission has been removed, because your account does not have a verified email. **No exceptions will be granted**.\n\nYou can verify your email address on the [Reddit Preferences page](https://www.reddit.com/prefs/update/), and if you have any issues with verification please contact reddit support at /r/help. **Subreddit moderators do not have the tools to aid with verification**, so please ignore the bot in italics below, do not message the mod team about this as we have no way of helping you.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskWomen) if you have any questions or concerns.*",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "lynzpie-",
            "body": "Books. I could talk about books all day if someone would let me.",
            "score": 126,
            "replies": [
                {
                    "author": "Skyler827",
                    "body": "What is a book that most people haven't read but they totally should and why?",
                    "score": 22,
                    "replies": [
                        {
                            "author": "lynzpie-",
                            "body": "I have a few! I’ll go based off some of my 2024 reads since those are the freshest for me: \n- I never see anyone talk about The Wall by Marlen Haushofer but it is such a good book that I thought about all year! I loved it because it’s about a woman vacationing at a hunting lodge in Austria when, seemingly out of nowhere, an invisible wall appears separating her from the rest of the world. Everyone and everything on the other side appears to have died. It was so beautifully written and just about a woman trying to navigate her new reality with little survival skills and some luck. \n- Chain-Gang All-Stars by Nana Kwame Adjei-Brenyah. It’s a future America in which inmates in the prison system fight to the death in a gladiator style arena to earn their freedom. It’s necessary because it has footnotes detailing actual realities of prisoners in America and it makes you really think about incarceration and the penal system. \n- One Dark Window and Two Twisted Crowns (The Shepherd King duology) by Rachel Gillig. Those two books are my #1 books for 2024 and the best fantasy series I’ve read in a while! So well done! So creative!",
                            "score": 37,
                            "replies": [
                                {
                                    "author": "Skyler827",
                                    "body": "For the Shepherd King duology, what's a really challenging decision that a main character faced? Did you agree with the decision?  I remember for a few books I've read, the main characters made some questionable decisions.\n\nI get that this would probably require a lot of explanation..... Don't necessarily want a whole book report and ideally this could be a decision early enough in the plot to not run the book too much cause I might read those two books.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "itspotatotoyousir",
                                    "body": "I have been STRUGGLING through Chain-Gang All-Stars. I love the premise and I think it includes a lot of important themes like racism in and out of the penal system, the damage private prisons are capable of, and the inhumanity that comes with late-stage capitalism. But I have to say this book is a slog. It's taken me a month to get halfway, where usually I can read 3 books in a week. It's so disjointed, there are too many POVs, and the way some things are written makes it difficult to understand. I keep feeling like... *just get on with it and tell the damn story* lmao.\n\nAnd I'm just here also to say that The Shepherd King was the best duology I've read. The magic system was so interesting and different. It was stunning, I loved it. \n\nHave you read Don't Let The Forest In by C.G. Drews? I tell everyone to read this. It's a little spooky YA LGBTQIA+ horror with such stunning, poetic prose. It will devastate you in the best way.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "lynzpie-",
                                            "body": "Oh noooo! It’s so funny how we can all view books so differently. I loved how it was written and was super into it the whole time. Plus I’m a big footnote fan so I loved those. I also just really really wanted to know what was going to happen and how it would all play out. \n\nI haven’t heard of that book but I love horror so I’ll check it out!",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "AutoModerator",
                                            "body": "Hello /u/veronicarules. Thank you for participating in /r/AskWomen. **Please read this entire message before taking action.**\n\nYour submission has been removed, because your account does not have a verified email. **No exceptions will be granted**.\n\nYou can verify your email address on the [Reddit Preferences page](https://www.reddit.com/prefs/update/), and if you have any issues with verification please contact reddit support at /r/help. **Subreddit moderators do not have the tools to aid with verification**, so please ignore the bot in italics below, do not message the mod team about this as we have no way of helping you.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskWomen) if you have any questions or concerns.*",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "hissing-fauna",
                                    "body": "thanks for these recs and your blurbs!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "FlumenAcheron",
                    "body": "I have a friend that loves books and so do I. But it's not obvious to me how I would even ask them to talk about books, especially since they are on the more reserved side of being social. They are more prompted by specific question but not gonna lie, I'm fresh out of those. And ideas or advice?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "lynzpie-",
                            "body": "I respond super well to questions like: what are you reading right now? What is your last 5 star read? What was your favourite book this month? What was the last book you got super excited about? \n\nBut I don’t respond well to on the spot questions about recommendations because I find those take a lot more time to think about and I can’t always name and recommend books off the top of my head. I also want so desperately for people to like my recommendations so I just need time!",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "FlumenAcheron",
                                    "body": "I like those ideas. I also definitely understand wanting people to like my recs, so I don't really ask people book recommendations.\n\nOkay so here's a thought. Curious if you have any insight. My friend, she's writing her own book and she's like super critical about it because she knows exactly what she wants, she just doesn't know how to word it in the way that she can picture it in her mind. She likes asking me for advice and ideas but she won't let me read it yet cause it's still a work in progress. So my question is, what advice would you think to give someone that has so many ways a story could go but doesn't know which way to develope it?\n\nHope that makes sense. I can elaborate further if need be.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AloneWish4895",
                    "body": "1Q84",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Bluetinfoilhat",
                    "body": "Do you belong to a book club.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Parking_Buy_1525",
            "body": "everyone tried to force different things on me or wrongfully made assumptions about me, but nobody in my lifetime has ever had the human decency to sit me down and gently ask what would make me happy - they just tried to project onto me, box me / “mold” me, or control me",
            "score": 68,
            "replies": [
                {
                    "author": "HeartBeetz",
                    "body": "I feel every single word of this. I'm sorry for you and me.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "CoBudemeRobit",
                    "body": "in a few words, what is it that would make you happy?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Parking_Buy_1525",
                            "body": "living alone, having access to a car, always having money, always having a dog, buying myself whatever i want, doing whatever i want - whenever i want, and traveling at any given time -without- ever sharing my life with anyone",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "CoBudemeRobit",
                                    "body": "are you stuck with someone?",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Middle_Ad5147",
            "body": "Behavioural science and psychology.",
            "score": 21,
            "replies": [
                {
                    "author": "LucyGh",
                    "body": "Do you maybe want to talk to me about those?",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Mundane-Flamingo14",
                    "body": "Listening.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "LockeKenneth553",
            "body": "Skin care. I've struggled with acne my whole life and people often don't realize how difficult it is",
            "score": 18,
            "replies": [
                {
                    "author": "SeoulSista11",
                    "body": "Maybe check out r/skincareaddiction or r/skincareaddicts. From what I’ve seen there’s an overwhelming amount of support for people struggling with just that. A lot of help/insight as well.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Glow_Up_Heaux",
                    "body": "Nothing worked for me until they put me on accutane man… I still have to take two different meds to stay clear at least 2/4 weeks of the month. I stay clean eat well drink lots of water… it’s the most gd frustrating thing in the world.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "gentle_shart",
            "body": "A lot of things. My brain is an encyclopedia for niche interests, and people tend to tune out when I talk about any of them. I listen when people talk about whatever it is they're passionate about, even if it doesn't particularly interest me",
            "score": 32,
            "replies": []
        },
        {
            "author": "LiberateMyBananas",
            "body": "the sims 😭",
            "score": 15,
            "replies": [
                {
                    "author": "Ezada",
                    "body": "The stories I would love to tell but no one wants to hear about my diabolical Sims saves 😂 \n\nI'm hoping you're in the Sims communities on Reddit cause they are WILD.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "LiberateMyBananas",
                            "body": "lmao i definitely would. and yeah i’m in them 🤣 i enjoy them, especially r/AITASims",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Ezada",
                                    "body": "I have to check what sub Im in when those pop up lol",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Dilemma_stress",
            "body": "As someone with no friends, anything and everything. Unfortunately I talk to myself about the things I wanna talk about. Hey, at least I'll listen 🥲",
            "score": 14,
            "replies": [
                {
                    "author": "Glow_Up_Heaux",
                    "body": "The chat bots may be a cheap bandaid… but they talk back at least! Idk it’s working for me. It’s like interactive reading 😅",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "CoBudemeRobit",
                    "body": "Wanna be pen pals? I just got a new fountain pen",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Idrialis",
                    "body": "Try buying a VR headtset like Meta Quest, and get into virtual worlds. That is helping me a lot and. I go in there and talk to people, I'm already in two different groups, but also there are discussions chats about specificañ topics, etc...\n\nAnd as you have an avatar and you talk using your voice/microphone, it's a good way to cover the conversation part that we need in life.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "LavenderAurora119",
            "body": "Without trying to sound like a pity party….why do some people hate or ride on folks for making simple mistakes? I’ve had so many experiences where a simple mistake was made, usually not intentionally, and in the grand scheme of things doesn’t really matter, but brining it up gets hate almost all the time. I’ve met so many people in life when I try to talk about this subject, they end up being rude or spinning the subject in way that puts me down.",
            "score": 10,
            "replies": [
                {
                    "author": "Glow_Up_Heaux",
                    "body": "Oh, I saw this wonderful quote today that might apply here, “if you’re tired of being the bigger person, quit being around such small people” \n\nPerhaps you’re just swimming w the wrong crowd. 🤷‍♀️",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "CoBudemeRobit",
                    "body": "mistakes are how we learn. People are afraid of people that arent afraid of failing.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "AlienSayingHi",
            "body": "My dad, who passed away. How was it backpacking across Europe? What were my adventures? What music do I like? Honestly no one asks me anything but I feel like I'm always asking questions. I'm a quiet person so I think people assume I'm boring with nothing interesting to say.",
            "score": 11,
            "replies": [
                {
                    "author": "PM_boobs_for_luck",
                    "body": "I'll bet your dad is very proud of your European adventures. Tough to be in unfamiliar territory as an introvert but from the sound of it you made a great go of it",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "EmbracingTheWorld",
            "body": "Horses! >< I recently rediscovered my passion for it, but no one around me rides or owns them. I do go to a small barn for lessons, but all the girls there are 13-17 and I am almost 30 lol!",
            "score": 33,
            "replies": [
                {
                    "author": "Mission_Homework_545",
                    "body": "That sounds so fun ngl",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "WhippieCake",
            "body": "Creative fulfillment. I want to talk about what it means to be a \"successful\" artist and how to create for yourself rather than for external validation in the era of social media.",
            "score": 8,
            "replies": [
                {
                    "author": "CoBudemeRobit",
                    "body": "Im listening",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "RaccoonImmediate5795",
            "body": "What is my perfect version of myself, and have I ever managed to achieve it? It's funny how my life turned out so very differently .",
            "score": 5,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 4,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 3,
                    "replies": [
                        {
                            "author": "AskWomen-ModTeam",
                            "body": "**Please read this entire message before taking action.**\n\nDerailing the topic is not permitted. Derailing includes but is not limited to: \n\n* Changing the topic from OP's question\n\n* Leaving a top-level comment when you're not the target demographic\n\n* Giving unsolicited advice\n\n* Making someone else's response about yourself. If you'd like to share your experience in response to the OP's question, do so in a top-level comment.\n\n* Asking unrelated follow-up questions\n\n* Branching into unrelated topics\n\n* \"What-about\"-ism\n\n* Trying to start arguments, or debates\n\n* Judging or rating other responses\n\n* Meta comments about other responses, such as \"same!\" or \"this!\"\n\n* Gifs, images, emojis or other media in place text\n\n* Sharing links without a summary \n\n* Responding to comments to tell us how your dick feels. No one cares.\n\nFor more information, please [click here](https://www.reddit.com/r/AskWomen/wiki/rules#wiki_no_derailing).\n\nHave questions about this moderator action? See the [AskWomen rules](http://www.reddit.com/r/askwomen/wiki/rules).\n\nIf you need assistance, first **copy a link to your removed post or comment** and then paste it in a message to the mod team [clicking here](http://www.reddit.com/message/compose/?to=/r/AskWomen&subject=Why+was+this+removed). We will not reply to messages without a link for review. DO NOT contact moderators privately. \n\n\n[AskWomen rules](http://www.reddit.com/r/askwomen/wiki/rules) | [AskWomen FAQ](http://www.reddit.com/r/askwomen/wiki/index)  \n[reddit rules](http://www.reddit.com/rules/) | [reddiquette](http://www.reddit.com/wiki/reddiquette)",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "emilyogre",
            "body": "I always wanna talk about dreams but no one ever asks me so I just bring it up LOL",
            "score": 4,
            "replies": [
                {
                    "author": "Glow_Up_Heaux",
                    "body": "I love hearing about dreams",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "goldencloudxo",
                    "body": "This is me too 😂",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "imkarnotaurus",
            "body": "Dinosaurs. I NEED SOMEONE TO TALK ABOUT DINOSAURS",
            "score": 4,
            "replies": []
        },
        {
            "author": "Desperate-Exit692",
            "body": "Anarchism. I love the idea of self governed people, even tho it's not practical, and I'd love to discuss it",
            "score": 16,
            "replies": [
                {
                    "author": "Awesome4some",
                    "body": "If you're accepting reading recommendations, then *Government of No One* by Ruth Kinna, and of course *The Conquest of Bread* by Peter Kropotkin are fantastic, decently short, and a great crash course in both anarchist ideology and the history of anarchist/libertarian socialist movements around the world. It's a fascinating subject.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Desperate-Exit692",
                            "body": "I'm always accepting reading recommendations. Thank you! I'll definitely add them to my reading list :)",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Wall_Brick_Cement",
                                    "body": "Have you ever heard of Distributism? It's an interesting concept ",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "-CarmenSandiego-",
            "body": "Ghosts and aliens",
            "score": 10,
            "replies": [
                {
                    "author": "OriginalChapter4",
                    "body": "Same. I look up wiki and end up in the alien page. I mostly look at alien sightings and also watch Netflix documentaries",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Mobius_Stripping",
                    "body": "same. it’s remarkably hard to work into conversation in relevant ways if no one asks 👽",
                    "score": 2,
                    "replies": [
                        {
                            "author": "witchbaby420",
                            "body": "I literally say “so, y’all believe in aliens?” in as many group gatherings as I can. It’s so funny and tbh most people say yes. Ghosts as a follow up.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ohgodplzfindit",
                    "body": "We should smoke one and hang out because I’ve got *stories*",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "LucyGh",
            "body": "I want people to be very honest and criticize me when they feel the need. No one ever does that, I hate it.",
            "score": 4,
            "replies": [
                {
                    "author": "bing-no",
                    "body": "I have to tell myself that “IF someone is upset with me, it is their responsibility to communicate with me, and not for me to guess”\n\nBUT it can be hard when it’s a friend or coworker that DOESNT tell you. I wish people would :/",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "CoBudemeRobit",
                    "body": "I find that people that like me like to give me shit and call me out. The reason tends to be is that I enjoy handing out small bits of my soft spots and laughing at them. \n\nMind you those soft spots are handed out because I know you cant hurt me by joking about them, but they do make other feel that I appear open to constructive criticism. \n\nPlay around with it, have fun with showing some of your belly, if you will.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "LilSweetCasey",
            "body": "Why no one ever asks me what my ultimate comfort food is, because I have STRONG opinions on this! 😂",
            "score": 4,
            "replies": [
                {
                    "author": "Ezada",
                    "body": "Ok but now I NEED to know! \n\nMine is Tuna Mac, made with the cheapest box Mac n cheese you can find, a can of tuna, caramelized onions, and sometimes peas, baked with cheap Italian bread crumbs on it. \n\nOr fried eggplant.\n\nBoth dishes my mom used to make and we would eat them on sad days.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "cryanide_",
            "body": "I wanna talk about how success comes with isolation. And how intelligence can cause you to be dissatisfied with many things---and how that's not a bad thing, because a heightened skill does not diminish the human merit of social belongingness. \n\nBut yeah. I can't talk about it mostly because I don't want to come across as arrogant, and pretty much my comfort in life stems from my reputation and work ethic. That combo pays dividends. And maybe because I'm great at carrying on; how people around wouldn't even notice or realize I do feel lonely from time to time.",
            "score": 4,
            "replies": [
                {
                    "author": "aunte_",
                    "body": "And they wouldn’t believe you anyway. Everyone around me seems to think I’m not lonely. And anyone I’ve let behind the curtain freaks out. I need to suck it up better.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "cryanide_",
                            "body": "Haha. Actually, yeah. That can be quite the truth in some occasions. If it's any help, I just take advantage of the situation. Since they think I'm not lonely, better seize the time to laser focus and make my fortress while they're busy not thinking about me. Not that I'm *so* important to think of, but the gist is that whenever I can move in silence, I move in silence. \n\nI also have streaks of loneliness and frustration when my then close \"friend group\" just wouldn't get me. A friend gets a high grade on an exam, she's vehemently amazing (I mean, why not? It's honest work as well). I make a sale in my business, suddenly I'm overwhelming myself and making a poor decision and shouldn't really go after certain things (huh?). But if any, I've learned to look within. Remind myself to not seek validation from people who don't see my worth. \n\nWhether or not they're bad friends---I refuse to label. I just believe that their level of friendship doesn't match what I'm willing to give, and that's okay. Because their incapacity doesn't automatically translate to what's my own incapacity per se. \n\nI've always been a believer that so as long as people like you and me keep pushing, we'd eventually find ourselves in the route towards people who understand us. The ones who would not require us to translate our souls, because they speak our language, with the eloquence and symphony and ensemble of words that thrill and nurture the spirit simultaneously. \n\nLife can be challenging, and sometimes more than what we believe could take . . . but life being challenging doesn't make you any less of a conqueror <3",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "aunte_",
                                    "body": "Wow! This is a wonderful, refreshing perspective and I appreciate it! Move in silence, I like it. I hadn’t thought of it like that but it’s true. \n\nMy walls are higher and higher. Soon there won’t be any way over. I mourn that a bit. I don’t think I’ll ever let anyone in again.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Frequently_Abroad_00",
            "body": "I would have loved for someone to ask me to share my favorite songs with them.\n\nAlso, I like talking about dreams and aspirations.",
            "score": 3,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "matterhorn276",
                    "body": "What type of music you listen to?",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "celestialism",
            "body": "I love talking about my creative projects, especially with other creatives!",
            "score": 3,
            "replies": []
        },
        {
            "author": "Positive-Mountain325",
            "body": "Geography",
            "score": 3,
            "replies": []
        },
        {
            "author": "starlightvagabond",
            "body": "About how I'm not able to fall in love with my husband even though we're pregnant..  and how I feel like I maybe in an unhealthy relationship that is emotionally stable or fulfilling..",
            "score": 3,
            "replies": []
        },
        {
            "author": "ControlAltDlt-5526",
            "body": "How do I want to be treated in any relationship really. They just assume based of my character and actions.",
            "score": 3,
            "replies": [
                {
                    "author": "CoBudemeRobit",
                    "body": "Been there, took some reading and understanding self. But the boiled down version of it is “you are treated the way you teach people to treat you” so only project what you want to be seen as.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "WhyLie2me18",
            "body": "My past. I have huge gaps in my memory and no one I can trust to fill them. I’ve lost every relationship I’d had and I don’t even know what I did. It’s a miserable way to live.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ElegantBabygirl",
            "body": "The time I witnessed a hit and run but in reverse  the person who got hit chased down the other car on foot caught up at a red light and left a note saying karma will find you with a smiley face.",
            "score": 3,
            "replies": [
                {
                    "author": "axbvby",
                    "body": "Oh!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Midir_Cutie",
            "body": "I want to tell people about Merlin (from BBC's \"Merlin\") and about how he dedicated his entire life to Arthur, hid his true self, risked death and persecution, killed people, lost friends and family, is treated like a fool, turned his back on magic and the magic community, all while being the most powerful guy in the world and not getting any credit for saving Arthur, saving Uther, saving the knights, keeping Camelot safe, etc. etc. etc. Only to be rejected by Arthur who then dies in his arms, and being immortal, Merlin now has to live for eternity alone without all his dead friends, constantly thinking about every mistake, every person he killed, every alternate choice he could have made.",
            "score": 3,
            "replies": []
        },
        {
            "author": "BillieDoc-Holiday",
            "body": "Funk music.",
            "score": 5,
            "replies": [
                {
                    "author": "Mission_Homework_545",
                    "body": "What do you like about it?",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "StupendousGroove",
            "body": "Favorite music artists and songs and why.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Juja00",
            "body": "Art, music, languages, politics, psychology… and turtles.",
            "score": 2,
            "replies": []
        },
        {
            "author": "dancinghobbit81",
            "body": "In Toy Story, the pizza truck driver pulls up to the gas station yelling \"the pizzas are getting cold here!\" implying that he has pizzas to deliver, but then drives right back to Pizza Planet after filling up. Is this a plot mistake or does the movie just skip the pizza delivery?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Glow_Up_Heaux",
            "body": "Self improvement, parenting, investing, raising good sons.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Winter_Value_7632",
            "body": "books, taxes and lana del rey",
            "score": 2,
            "replies": []
        },
        {
            "author": "ElegantBabygirl",
            "body": "It's refreshing to see someone so excited about reading.  Always looking for new book ideas!",
            "score": 2,
            "replies": []
        },
        {
            "author": "anonymonsters",
            "body": "Child development and the impact of screens on children < 3 years of age. Do not get me started on the screens lol",
            "score": 2,
            "replies": []
        },
        {
            "author": "Harnasus",
            "body": "Geology",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hello /u/orrieberry. **Please read this entire message before taking action.**\n\nYour post or comment has been removed because your Reddit Karma is too low to participate on AskWomen. You will be able to participate when your Karma has increased, you can do that by participating in good faith in other subreddits that don't have Karma requirements. This action **cannnot be undone** by the moderators.\n\n **No exceptions to this rule will be granted.** [Click here to read more about Reddit Karma](https://reddit.zendesk.com/hc/en-us/articles/204511829-What-is-karma-), and please also **[read our rules](https://www.reddit.com/r/AskWomen/wiki/rules) before participating**.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskWomen) if you have any questions or concerns.*",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hello /u/Background_Mouse_962. **Please read this entire message before taking action.**\n\nYour post or comment has been removed because your Reddit Karma is too low to participate on AskWomen. You will be able to participate when your Karma has increased, you can do that by participating in good faith in other subreddits that don't have Karma requirements. This action **cannnot be undone** by the moderators.\n\n **No exceptions to this rule will be granted.** [Click here to read more about Reddit Karma](https://reddit.zendesk.com/hc/en-us/articles/204511829-What-is-karma-), and please also **[read our rules](https://www.reddit.com/r/AskWomen/wiki/rules) before participating**.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskWomen) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hello /u/justkraveherr. **Please read this entire message before taking action.**\n\nYour post or comment has been removed because your Reddit Karma is too low to participate on AskWomen. You will be able to participate when your Karma has increased, you can do that by participating in good faith in other subreddits that don't have Karma requirements. This action **cannnot be undone** by the moderators.\n\n **No exceptions to this rule will be granted.** [Click here to read more about Reddit Karma](https://reddit.zendesk.com/hc/en-us/articles/204511829-What-is-karma-), and please also **[read our rules](https://www.reddit.com/r/AskWomen/wiki/rules) before participating**.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskWomen) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AskWomen-ModTeam",
                    "body": "**Please read this entire message before taking action.**\n\nRemoved for casual or inappropriate usage of mental health related terms or diagnostic labels. Please do not speculate, armchair diagnose, or label other people's mental health situations; or use terms for mental health issues as judgments, slurs, or synonyms for toxic/abusive behaviour even when talking about yourself. \n\nIf you're referring to someone (yourself or others) who has been formally diagnosed by a medical professional, please make sure your comment reflects that. \nHave questions about this moderator action? See the [AskWomen rules](http://www.reddit.com/r/askwomen/wiki/rules).\n\nIf you need assistance, first **copy a link to your removed post or comment** and then paste it in a message to the mod team [clicking here](http://www.reddit.com/message/compose/?to=/r/AskWomen&subject=Why+was+this+removed). We will not reply to messages without a link for review. DO NOT contact moderators privately. \n\n\n[AskWomen rules](http://www.reddit.com/r/askwomen/wiki/rules) | [AskWomen FAQ](http://www.reddit.com/r/askwomen/wiki/index)  \n[reddit rules](http://www.reddit.com/rules/) | [reddiquette](http://www.reddit.com/wiki/reddiquette)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hello /u/No_Camera_8888. **Please read this entire message before taking action.**\n\nYour post or comment has been removed because your Reddit Karma is too low to participate on AskWomen. You will be able to participate when your Karma has increased, you can do that by participating in good faith in other subreddits that don't have Karma requirements. This action **cannnot be undone** by the moderators.\n\n **No exceptions to this rule will be granted.** [Click here to read more about Reddit Karma](https://reddit.zendesk.com/hc/en-us/articles/204511829-What-is-karma-), and please also **[read our rules](https://www.reddit.com/r/AskWomen/wiki/rules) before participating**.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskWomen) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hello /u/LilaHalo. **Please read this entire message before taking action.**\n\nYour post or comment has been removed because your Reddit Karma is too low to participate on AskWomen. You will be able to participate when your Karma has increased, you can do that by participating in good faith in other subreddits that don't have Karma requirements. This action **cannnot be undone** by the moderators.\n\n **No exceptions to this rule will be granted.** [Click here to read more about Reddit Karma](https://reddit.zendesk.com/hc/en-us/articles/204511829-What-is-karma-), and please also **[read our rules](https://www.reddit.com/r/AskWomen/wiki/rules) before participating**.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskWomen) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hello /u/SiennakeyMX42. **Please read this entire message before taking action.**\n\nYour post or comment has been removed because your Reddit Karma is too low to participate on AskWomen. You will be able to participate when your Karma has increased, you can do that by participating in good faith in other subreddits that don't have Karma requirements. This action **cannnot be undone** by the moderators.\n\n **No exceptions to this rule will be granted.** [Click here to read more about Reddit Karma](https://reddit.zendesk.com/hc/en-us/articles/204511829-What-is-karma-), and please also **[read our rules](https://www.reddit.com/r/AskWomen/wiki/rules) before participating**.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskWomen) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hello /u/Aromatic_Animator_94. **Please read this entire message before taking action.**\n\nYour post or comment has been removed because your Reddit Karma is too low to participate on AskWomen. You will be able to participate when your Karma has increased, you can do that by participating in good faith in other subreddits that don't have Karma requirements. This action **cannnot be undone** by the moderators.\n\n **No exceptions to this rule will be granted.** [Click here to read more about Reddit Karma](https://reddit.zendesk.com/hc/en-us/articles/204511829-What-is-karma-), and please also **[read our rules](https://www.reddit.com/r/AskWomen/wiki/rules) before participating**.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskWomen) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hello /u/annyeong_jijishii. **Please read this entire message before taking action.**\n\nYour post or comment has been removed because your Reddit Karma is too low to participate on AskWomen. You will be able to participate when your Karma has increased, you can do that by participating in good faith in other subreddits that don't have Karma requirements. This action **cannnot be undone** by the moderators.\n\n **No exceptions to this rule will be granted.** [Click here to read more about Reddit Karma](https://reddit.zendesk.com/hc/en-us/articles/204511829-What-is-karma-), and please also **[read our rules](https://www.reddit.com/r/AskWomen/wiki/rules) before participating**.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskWomen) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CoBudemeRobit",
            "body": "as a lurking man I’d like to say great question for a sub that shines insight on my favorite people ",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hello /u/Polar_ice007. **Please read this entire message before taking action.**\n\nYour post or comment has been removed because your Reddit Karma is too low to participate on AskWomen. You will be able to participate when your Karma has increased, you can do that by participating in good faith in other subreddits that don't have Karma requirements. This action **cannnot be undone** by the moderators.\n\n **No exceptions to this rule will be granted.** [Click here to read more about Reddit Karma](https://reddit.zendesk.com/hc/en-us/articles/204511829-What-is-karma-), and please also **[read our rules](https://www.reddit.com/r/AskWomen/wiki/rules) before participating**.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskWomen) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Numerous_Business895",
            "body": "Anti-consumption and how consumption and consumerism has toxified our entire society. Things are being loved, people are being used instead of the other way around.",
            "score": 1,
            "replies": []
        },
        {
            "author": "smalltittysoftgirl",
            "body": "How the Munsters, my favourite show, were ahead of their day in being a brilliant metaphor for the way minorites/immigrants were treated and depicting \"Othered\" groups as ordinary, flawed, hardworking people like you and me. And how it's frustrating that fans have appropriated the Munsters' themes and aspects and given them to the bougie Addams Family. Who were a satire on rich white people.\n\n\nAnd also how ironic and fitting it is that the white, conventionally attractive aristocrats are the ones taking credit for what the more humble minorities did.",
            "score": 1,
            "replies": []
        },
        {
            "author": "azscorpio19",
            "body": "Anything besides politics and covid",
            "score": 1,
            "replies": []
        },
        {
            "author": "Acedia_spark",
            "body": "South Korean Smutty Romance Comics and novels. I am obsessed with them 😂. I consume a huge amount of them. \n\nThey cover some fascinating topics. ED, people who push back on condom use, fear of intimacy, trauma, how society treats promiscuous women, how society views homosexuality, the list goes on. \n\nDon't get me wrong, I do enjoy the explicit content, but truthfully, not as much as I enjoy the stories they tell.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hello /u/Sensitive_Jacket879. **Please read this entire message before taking action.**\n\nYour post or comment has been removed because your Reddit Karma is too low to participate on AskWomen. You will be able to participate when your Karma has increased, you can do that by participating in good faith in other subreddits that don't have Karma requirements. This action **cannnot be undone** by the moderators.\n\n **No exceptions to this rule will be granted.** [Click here to read more about Reddit Karma](https://reddit.zendesk.com/hc/en-us/articles/204511829-What-is-karma-), and please also **[read our rules](https://www.reddit.com/r/AskWomen/wiki/rules) before participating**.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskWomen) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "LolaMooniee",
            "body": "My dad or my grandmas 💔 I love getting to tell people about them, talking about them. It’s not going to upset me if they’re brought up, it makes me happy to know that they are still remembered and loved",
            "score": 1,
            "replies": []
        },
        {
            "author": "axbvby",
            "body": "How about how much I️ freaking loveeeeeee teen romance dramas like My Fault London or the OG Spain version, or anything off Galatea TV or Brat TV, or XO Kitty, Summer I️ Turned Pretty, To All The Boys, Maxton Hall, My Life With The Walter Boys etc. \n\nI️ think Amazon Prime is particularly killing it rn. They just acquired the Off Campus series! Netflix is paying catch up and hasn’t had anything good since To All The Boys although XO Kitty is filling the gap pretty good. Outerbanks, while popular,  only has romance as a side plot. \n\nAlso I️ wanna recommend my friends to play the visual novel game Romance Club soooo bad so I️ could have someone to talk about it with IRL (but don’t so here I️ am just on the Romance Club subreddit).",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gigglepuuuffff",
            "body": "past life trauma(people touching in public randomly)",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "AutoModerator",
                    "body": "Hello /u/ZenRico2023. **Please read this entire message before taking action.**\n\nYour post or comment has been removed because your Reddit Karma is too low to participate on AskWomen. You will be able to participate when your Karma has increased, you can do that by participating in good faith in other subreddits that don't have Karma requirements. This action **cannnot be undone** by the moderators.\n\n **No exceptions to this rule will be granted.** [Click here to read more about Reddit Karma](https://reddit.zendesk.com/hc/en-us/articles/204511829-What-is-karma-), and please also **[read our rules](https://www.reddit.com/r/AskWomen/wiki/rules) before participating**.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskWomen) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "PuzzleheadAir7279",
            "body": "Classical literature!! More specifically, Neoclassical and Victorian. I crave that kind of conversation but unfortunately, I've never met someone who's actually interested in that, except the ones who read Moby Dick or some Jane Austen for a school project. I could even talk about the weirder, controversial ones, like Justine (de Sade, don't bite me.)   \nAnother thing I'd like to rant about is the unfair but unwavering elements of society, i.e. capitalism and gender bias and things like that. But people instantly change the subject or never ask at all because they don't want to have to think harder.    \nProbably difficult to find such people when I'm only 19 though, so it's understandable.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dependswho",
            "body": "My past lives.",
            "score": 1,
            "replies": [
                {
                    "author": "axbvby",
                    "body": "Wait girl, tell me about them? Who were they? Where were they from? How many do you remember? How do you remember them? We’re on a good person or a bad one?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "FelicityAzura",
            "body": "Cuddle therapy",
            "score": 0,
            "replies": []
        }
    ]
}