{
    "title": "Savoy domination was so popular that the new Italians would rather endure *gags* New Jersey.",
    "author": "Garviel-Loken-LW",
    "subreddit": "HistoryMemes",
    "rank": 2,
    "score": 2378,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 80,
    "url": "https://i.redd.it/nho0v4c1ehpe1.jpeg",
    "id": "1jea6cl",
    "selftext": "",
    "comments": [
        {
            "author": "Flussschlauch",
            "body": "Most Italian Americans came from southern Italy",
            "score": 597,
            "replies": [
                {
                    "author": "The-Forbidden-one",
                    "body": "Yep. I always wondered why my family would move from such a beautiful place. \n\nI visited where they came from and it clicked.\n\nStill, it’s very beautiful! Just not much in terms of jobs or social advancement",
                    "score": 306,
                    "replies": [
                        {
                            "author": "Archneme5is",
                            "body": "And didn’t help the government considered you genetically inferior",
                            "score": 149,
                            "replies": [
                                {
                                    "author": "The-Forbidden-one",
                                    "body": "Yeah, I’m sure that didn’t lol. They probably got tired of all the wars in Africa they were getting sent to fight in as well.",
                                    "score": 61,
                                    "replies": []
                                },
                                {
                                    "author": "duga404",
                                    "body": "Wait what can you elaborate on that?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Archneme5is",
                                            "body": "Scientific racism",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "duga404",
                                                    "body": "Italian on Italian racism?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Archneme5is",
                                                            "body": "Southern Italians were seen as Italians but were considered inferior based on their genetics",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "duga404",
                                                                    "body": "Did no one ever come to the realization that them also being Italians meant that they had at least very similar genetics?",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Jaquestrap",
                                                                            "body": "The old argument was that Southern Italians were \"muddied\" with Greek and Arab ancestry, as compared to the Nothern Italians who were the descendents of Romans mixed with Lombards (both \"higher\" ethnic groups by their standards).",
                                                                            "score": 3,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "GUlysses",
                            "body": "I mean, I moved from one part of the US to another, and this is true of where I came from.",
                            "score": 30,
                            "replies": [
                                {
                                    "author": "The-Forbidden-one",
                                    "body": "Sure, but you could move within the US. I don’t think the northern Italians were super welcoming to the southern Italians",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "awawe",
                            "body": "Southern Italy is largely controlled by the mafia to this day, and it was so much worse at the turn of the 20th century.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "IllegalIranianYogurt",
                    "body": "Which by contrast, is really ugly??",
                    "score": 14,
                    "replies": [
                        {
                            "author": "SpecialistNote6535",
                            "body": "No, but the crime level is insane and decades of organized crime becoming institutionalized stifled any real economic development \n\nItaly is already a borderline poor country, and their economy has actually been shrinking, in large part due to how bad it is in the south",
                            "score": 81,
                            "replies": [
                                {
                                    "author": "Pitiful_Couple5804",
                                    "body": "Decades? It's centuries of the same crime families at this point lol",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "SpecialistNote6535",
                                            "body": "If you underestimate Reddit doesn’t care, if you overestimate 1000 Redditors will point it out and act like it invalidates your entire argument ",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "thissexypoptart",
                            "body": "Are people in this thread under the impression that folks who immigrate to another country are on average wealthy enough to live in pristine, beautiful valleys and beaches? \n\nYou can’t live in a beautiful alpine valley if you can’t afford to. Your great grand uncle who immigrated from Italy wasn’t living in a single family home on the shores of an alpine lake lmao",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "Pitiful_Couple5804",
                                    "body": "Actually all immigrants are privileged and only move because they're bored and stuff",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "IllegalIranianYogurt",
                                    "body": "I was being rather flippant, I'm afraid",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Cicero912",
                            "body": "Well I mean, southern italy isn't ugly, but it sure isnt a great place full of opportunity.",
                            "score": 17,
                            "replies": []
                        },
                        {
                            "author": "crashper",
                            "body": "Well not ugly. But not exactly the alpine region, the green heart or the the former trade republics. Which is what is being portrayed/insinuated here. Sometimes people forget that more countries in Europe than germany a strongly divided. Most European countries are as a matter of fact.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Fabulous_Night_1164",
            "body": "Most of the Italians who moved to USA/Canada were from Sicily, which doesn't look like this at all.\n\nAnd they were mostly impoverished, living under the thumb of the mafia. Not exactly idyllic living conditions.\n\nAt the beginning of the 20th century, North America was seen as bustling and modern. There were cars, trains, subways, skyscrapers, highways, indoor electricity, 24/7 service, restaurants, indoor plumbing, etc. New York City and surrounding area was massive compared to anything in Europe at the time. You also get services that we take for granted now. Like having an ambulance or firefighters available in emergencies. Or, you know, COPS. Things that were lacking in mafia-controlled Sicily.\n\nEven a mid-city like Montreal (which has a large Italian community) would look like a significant improvement to many Italian places at the time. Montreal had about the same population as Rome, but unlike Rome, also had skyscrapers, cinemas, indoor plumbing, electricity, lots of personal ownership of vehicles, etc. This is Montreal in the 1920s. [Photo](https://www.alamy.com/canada-montreal-st-catherine-street-probably-1920s-image66170853.html) [Photo](https://images.radio-canada.ca/q_auto,w_960/v1/ici-info/16x9/montreal-nuit-enseigne-neon-tramway-archives.jpg) [Photo](https://i.ebayimg.com/images/g/jc4AAOSwi9Vf3CnI/s-l1600.webp) [Photo](https://www.montrealgazette.com/new-articles/88h4qp/picture198087/alternates/LANDSCAPE_1140/1207)\n\nWhereas this is Palermo - the capital of Sicily - in the 1920s. [Photo ](https://i.guim.co.uk/img/media/16dbbfcb438a8aa6a6433f5d75b5f0a07ea80f0e/85_824_4890_2934/master/4890.jpg?width=620&dpr=2&s=none&crop=none) [Photo](https://www.meisterdrucke.uk/kunstwerke/1260px/Italian_Photographer_-_A_Characteristic_Street_in_Palermo_1920_-_%28MeisterDrucke-594112%29.jpg) (I get these are selective photos. Here is one that shows a more modern section of Palermo at the time - [Photo](https://www.prints-online.com/palermo-sicily-italy-crossroads-maqueda-7211885.html)). In this time frame, if you didn't have a pump in your home, you might be walking far away to get fresh water. Likely limited electricity available (Palermo may have had it, but certainly not in the countryside). You were likely not eating meat that often. No refrigeration. School - maybe you got up to grade 3? Laundry all being done by hand. No employment opportunities. No healthcare.",
            "score": 128,
            "replies": [
                {
                    "author": "thatguywhosadick",
                    "body": "Wait so the critically acclaimed Hayden Christian film “little Italy” set in Canada had is based on a real place? Damn",
                    "score": 28,
                    "replies": [
                        {
                            "author": "Fabulous_Night_1164",
                            "body": "That's in Toronto's Little Italy.\n\nToronto also had a massive migration of Italians. More than Montreal actually.\n\nHere is Toronto in the 1920s: https://www.blogto.com/city/2017/04/toronto-photos-1920s/\n\nAgain, contrast this with the Sicily photos and you can see the appeal of being in the big \"modern cities\" of North America. The Royal York Hotel in Toronto was the tallest building in the British Empire at the time. \n\nAnd I haven't even touched NYC, which was much bigger than Toronto and Montreal.",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "chef_yes_chef97",
                                    "body": "Yeah i was wondering why all the signs were in English.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "RN_Renato",
                    "body": "Most Italians that moved to Brazil were actually from the North of Italy, specially Veneto",
                    "score": 12,
                    "replies": [
                        {
                            "author": "Fabulous_Night_1164",
                            "body": "Interesting! I edited my post. I find this particularly interesting, because I remember reading elsewhere that Italy actually tried to curb immigration to Brazil, due to the poor working conditions they were subjected to (some might even call it indentured servitude). So why was the wealthy part of Italy moving there?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Epic_Skara",
                                    "body": "from my understanding, immigrants from the northern part of italy were \"richer\" as they usually came from farmers' families who owned (little) patches of land, in comparison with southerners who mostly worked on landlords' land and so had little to no belongings to speak of. \n\nso northern immigrants (mostly cadet sons) could afford to try their luck in farming elsewhere and that's how the majority of them ended up in south america, which had plenty of land and almost no people, notably with people from piedmont ending up in argentina and uruguay and people from veneto ending up in brazil (don't know the reasons of this \"partition\" tho). meanwhile southerners just flocked to the states looking for any opportunity to just prove themselves and succeed at the american dream, colonising the metropolises of north america.\n\nplease note that this analysis basically comes up from my understanding of the situation as an italian (a piedmontese to be precise) and there were a lot of exceptions, for example i've got relatives in california who emigrated from piedmont and relatives in argentina who emigrated from calabria (in the deep south).",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "aneille",
                                    "body": "Because people were poor in the North too. Most Italians that emigrated to South and Central America were from Northern Italy. One of the biggest football clubs in Uruguay is named after a town in Piedmont.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Epic_Skara",
            "body": "the fact that i'm pretty sure all of the places depicted in these photos weren't part of italy at the height of the emigration to america is really funny",
            "score": 265,
            "replies": [
                {
                    "author": "CinderX5",
                    "body": "Where’s the Roman drive to conquer!?",
                    "score": 63,
                    "replies": [
                        {
                            "author": "ModernByzantine",
                            "body": "Italians ≠ Ancient Romans",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "Rynewulf",
                                    "body": "I mean it was the Romans who named it Italia though",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "ModernByzantine",
                                            "body": "Well the Romans named a lot of things",
                                            "score": 18,
                                            "replies": [
                                                {
                                                    "author": "freekoout",
                                                    "body": "They didn't name me! \n\nOh wait\n\nAustin derives from Augustine which comes from Augustus",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Claudius_Marcellus",
                                            "body": "Romans didn't name it lol",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "CinderX5",
                                    "body": "Why not! This is an outrage!!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "CinderX5",
                    "body": "Where’s the Roman drive to conquer!?",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "RomanItalianEuropean",
            "body": "Meme is funny but:\n\n1)Pics in the photo are from South Tryol, which Italy took only with WW1. Not the time nor the place of origin of Italian emigrants.\n\n2)Savoy \"domination\" has nothing to do with Italian emigration. Large emigration occured in late 19th century because: the Americas boomed, European agriculture got into a crisis, the transatlantic crossings became frequent due to technological revolution in the navigation industry.\n\n3)What even are the \"new Italians\"?",
            "score": 32,
            "replies": [
                {
                    "author": "ANTEDEGUEMON",
                    "body": "Some of my family emigrated from South Tyrol, lol. Italian emigration, to Brazil at least, was pretty much evenly split between north and south.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "RomanItalianEuropean",
                            "body": "But if it happened pre-1918 it was considered German-Austrian emigration. And probably even for decades after 1918.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "ANTEDEGUEMON",
                                    "body": "Yes, that side of the family is Austrian/German/Italian mixed... so, you're probably right.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "newbronzeagecollapse",
                    "body": "Savoy domination had A LOT to do with Italian emigration, especially at a time in which the north was pretty much off limits thanks to the spread of Cesare Lombroso, Paolo Ornano and Alfredo Niceforo's eugenic theories. But then again, it depends on which part of the so-called “south” we speak of. I come from a place where such theories had actual direct repercussions onto the population, and my people faced the consequence of the already present racial hatred against them being heightened by the capillary spread of Niceforo's eugenics even outside of their homeland (see [this lil thingy right here](https://it.m.wikipedia.org/wiki/Strage_di_Itri)).",
                    "score": -1,
                    "replies": [
                        {
                            "author": "RomanItalianEuropean",
                            "body": "Absolute non-sense.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Cowboywizard12",
            "body": "90 percent of Italian immigrants came from Sicily or Southern Italy, including some of my ancestors.\n\n\n\n\nThough they came to Massachusetts and New England is much better than New Jersey. Or if you subscribe to The New England Mindset, better than everywhere else in the whole country as every other place is Inferior to New England",
            "score": 27,
            "replies": []
        },
        {
            "author": "Motor-Travel-7560",
            "body": "Yeah, but New Jersey has El Toro.",
            "score": 17,
            "replies": [
                {
                    "author": "AssclownJericho",
                    "body": "my buddy got stuck on that lol",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "onichan-daisuki",
            "body": "\"too much water\" \n\n-some Italians probably",
            "score": 36,
            "replies": []
        },
        {
            "author": "Baykusu",
            "body": "Ah yes, the three places where all of the Italian population lives.",
            "score": 40,
            "replies": []
        },
        {
            "author": "MysteriousScratch478",
            "body": "I think people underestimate how poor big chunks of Europe were back then.",
            "score": 4,
            "replies": []
        },
        {
            "author": "AfterimageMike",
            "body": "Starve in pretty Italy or eat in ugly New Jersey. Would you make the same choice?",
            "score": 9,
            "replies": [
                {
                    "author": "captaincid42",
                    "body": "Pass the gabagool.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Eric-Lodendorp",
            "body": "Most Italian immigrants were from the poorer south.",
            "score": 4,
            "replies": []
        },
        {
            "author": "DepressedHomoculus",
            "body": "Most Italian immigrants to the US came from Southern Italy, which was in a less-than-ideal economic position following the Risorgimento (Italian unification).\n\nBut lmao my family's from Veneto, so I got no fucking clue why they chose to live in Northern BC of all fucking places.",
            "score": 3,
            "replies": [
                {
                    "author": "NeedsToShutUp",
                    "body": "To be fair, it was also in a less-than-ideal economic position before unification. It just wasn't helped by unification.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Everestkid",
                    "body": "My grandparents were from Emilia-Romagna and settled in the same place. Story is that my grandfather went to Kingston, Ontario first and enjoyed it there but was told by a friend of his that there was a lot of work way over in Prince Rupert, BC.\n\nSo that's how he got hoodwinked into living in the literal rainiest city in Canada and one of the cloudiest places in the world. Dreary place, Rupert, but it is beautiful when it's a nice day. Which is on average 17 days a year.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AssclownJericho",
            "body": "South new jersey here, go fuck yourself.",
            "score": 3,
            "replies": []
        },
        {
            "author": "BigChaosGuy",
            "body": "I don’t get the meme? Those are perfect pictures of the palisades, Newark waterfront, and even a lovely view of the cooper river in Camden.",
            "score": 4,
            "replies": []
        },
        {
            "author": "srv340mike",
            "body": "TBF most Italian immigrants were from Southern Italy",
            "score": 2,
            "replies": []
        },
        {
            "author": "peelerrd",
            "body": "You can't feed your kids with nice views.",
            "score": 2,
            "replies": []
        },
        {
            "author": "AlbiTuri05",
            "body": "Unfortunately, those places were part of Austria until WW1",
            "score": 2,
            "replies": []
        },
        {
            "author": "Brofessor-0ak",
            "body": "My ancestors immigrated to the US from northern Italy in 1913. Safe to say they made the right choice, even though it certainly was a beautiful country",
            "score": 2,
            "replies": []
        },
        {
            "author": "TaftIsUnderrated",
            "body": "Almost half of Italian immigrants did return to Italy after making some money in the US.",
            "score": 1,
            "replies": []
        },
        {
            "author": "yourstruly912",
            "body": "The pellagra, however...",
            "score": 1,
            "replies": []
        },
        {
            "author": "SPECTREagent700",
            "body": "Fun fact: The New York City Metro Area has an estimated three to four million Italians or persons of Italian descent which is more people than the population of Rome. All told it’s estimated that there are approximately 140 million Italians worldwide with about 2/3rds living outside Italy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Whentheangelsings",
            "body": "This is barely a history meme. It's just a meme vaguely referencing something that happened in history.",
            "score": 1,
            "replies": []
        },
        {
            "author": "brod121",
            "body": "It’s beautiful, but hard living. Rocky, sloping soils, not enough water, cold winters in the north and hard summers in the south, and of course entrenched power structures like the church and feudal nobility. Indiana may be flat and ugly, but it’s got meters of organic clay soils next to wide and slow rivers. To people coming from rocky mountains it must have seemed like the garden of Eden.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tired_of_politics_75",
            "body": "The grass is never greener on the other side",
            "score": 1,
            "replies": []
        },
        {
            "author": "greenfloridabull",
            "body": "New Jersey has beautiful scenery too, especially in the northwest, in the woods, and on the beaches.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Needs_coffee1143",
            "body": "Why most Italian emigres to USA were from the south",
            "score": 1,
            "replies": []
        },
        {
            "author": "paladin_slim",
            "body": "I’ve been to New Jersey and I’d rather not go there again but Savoy looks amazing.",
            "score": -1,
            "replies": []
        },
        {
            "author": "Enoppp",
            "body": "Ah yes, 40 million italians of course left for New Jersey. Jesus, why yanks are like this...",
            "score": -25,
            "replies": [
                {
                    "author": "Safe-Ad-5017",
                    "body": "Stupid American with their… jokes?",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "HorrorArticle7848",
                    "body": "Shit dude, there's a 0 too much in there. if that many went the good ol' boot would have ended empty.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "Standard-Nebula1204",
                    "body": "Is that actually how you interpreted what they were trying to say? Really?",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Common-Swimmer-5105",
                    "body": "Because we're funny, hope this helps 👍",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}