{
    "title": "HELP! My dog will not let me sleep!",
    "author": "Treeseph90",
    "subreddit": "Dogtraining",
    "rank": 392,
    "score": 2,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1i51ykb/help_my_dog_will_not_let_me_sleep/",
    "id": "1i51ykb",
    "selftext": "I'll be cross posting to r/dogs group as well. \nPre text; his name is Chevy, he is a mix but the closest thing to a French basset. He has separation anxiety and is taking 40mg of human grade fluoxetine(do not get me started, I tried all the \"natural\" stuff and he'd fight it) he has his good moments, but he is that dog that set the bar as when people refer to other dogs they say, well at least they're not as bad as Chevy. My vet said he would of given up on him.\nGoing to keep this short and detailed as possible, me and my wife our at are wits end. My dog will not let me sleep. I don't know what started to cause this issue. We narrowed it down to he has full blown anxiety attack over my cpap. Hes will sleep fine in any other situation but he hears it hiss or wine he'll start to freak out. He'll make it our problem too, he'll stand and step on us to wake up. You can only get him out of bed so many times till your tired. Can't lock him out side he'll trash something, or stress poop in the basement, can't lock him in another room he'll make a hole in the door, can't put him in a cage, he destroyed 3. The 3rd one he lucky to be alive he was so cut up and blood was all over the wall cause he doesn't know any better. I would give him alittle trazadone before bed but that would make him aggressive.\nThe positive things I've tried exercising and walking him more, I've tried getting Him used to the cpap during the day just a causal thing, gave him more stimulant tricks to do. I'm trying to get a quieter mask.\nEveryone said they'd give up on him, I refuse to. He's my idiot!\nAny advice would be most helpful.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "Treeseph90",
                    "body": "I believe my question is valid after reading the approval guide",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Unique-Public-8594",
            "body": "Wow. \n\nThorough yet also brief write up. Good job. \n\nThis is a tough one. \n\nI wonder if it is making a high pitch sound only your dog can hear (or that bothers your dog’s hearing)?\n\nJust a wild, out-of-the box idea:  can you leave the CPAP on near the food dish during feedings to create a positive association?  Or tape record the sound and play it softer during mealtimes to the level that is under threshold, gradually increasing by tiny increments each day?",
            "score": 2,
            "replies": [
                {
                    "author": "Treeseph90",
                    "body": "We have worked with him, to stay on a pedestal until released, I also have a spare cpap, to give him treats and run the machine just normally, doing it for multiple sets a day. We started so see alittle progress but last night was the worst. It was like one step forward 3 back.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}