{
    "title": "Dog hates poor people ",
    "author": "FederalBobcat35",
    "subreddit": "Dogtraining",
    "rank": 382,
    "score": 0,
    "upvote_ratio": 0.4,
    "num_comments (reported by reddit)": 19,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1i5z2ip/dog_hates_poor_people/",
    "id": "1i5z2ip",
    "selftext": "We adopted him from a shelter when he was about a year old, he's been a great dog but this has been his only issue  \nWhenever he sees a poor person, he will bark, growl and attack them  \nONLY with poor people, not with anyone else (important)  \nHe also gets hyperexcited seeing cats and other dogs  \nWe have done basic obedience training and he listens to basic sit, stay, leave it, come commands  \nHe is 1.5 years old, neutered, and a Shih Tzu mix",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "FederalBobcat35",
                    "body": "I have looked through the wiki, especially the reactivity, leash walking, misbehaviour sections but none of them fix this particular issue of attacking solely poor people  \nHe is indifferent, maybe a little wary, of other people (understandable considering possible abuse he may have faced in the past)  \nIt's become a serious issue especially on our walks when we encounter maintenance workers, labourers, car cleaners, grocery store employees, delivery workers, etc. He will attack these people for seemingly no reason",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "shortofbreathonwalks",
            "body": "What exactly do you mean by poor people ?",
            "score": 28,
            "replies": [
                {
                    "author": "DildoMcHomie",
                    "body": "Must be one hell of a dog to recognize net worth by senses.",
                    "score": 18,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 11,
            "replies": [
                {
                    "author": "turtlefan32",
                    "body": "I suggest that YOU tense up or something and seeing 'poor' people",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "kylerxvx",
            "body": "He knows they’re poor because he’s also their banker or…?",
            "score": 23,
            "replies": []
        },
        {
            "author": "Impressive_Peanut",
            "body": "This is either a shit post or the only other option I can think of is English isn't your first language and you mean homeless people ? (Which would still be odd behavior)",
            "score": 7,
            "replies": []
        },
        {
            "author": "NightHawkFliesSolo",
            "body": "I'll make sure to wear my real Rolex watch next time I see him instead of my counterfeit one.",
            "score": 5,
            "replies": []
        },
        {
            "author": "More-Ad5919",
            "body": "\nHow the fuck should a dog know if a person is poor?",
            "score": 5,
            "replies": []
        },
        {
            "author": "Creativered4",
            "body": "How does your dog know how much money someone has?",
            "score": 3,
            "replies": []
        },
        {
            "author": "lawfromabove",
            "body": "Hahahahahahah",
            "score": 2,
            "replies": []
        },
        {
            "author": "Unique-Public-8594",
            "body": "(your poor person comment seems offensive)\n\n> “hyperexcited seeing cats and other dogs”\n\nTry desensitization and counter conditioning to triggers:  https://vcahospitals.com/know-your-pet/introduction-to-desensitization-and-counterconditioning. Here’s a demonstration video (Diesel, barking & lunging at scooters):  https://m.youtube.com/watch?v=tdFK5rGbjJ0",
            "score": 4,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "Cursethewind",
                    "body": "They followed instructions, you did not. Follow the instructions on the automod reply and it'll be approved.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "pawsitivelyfocused",
            "body": "Your dog’s gonna hate me then….",
            "score": 1,
            "replies": []
        },
        {
            "author": "TazmanianMaverick",
            "body": "How do you know if the person he's barking at is poor?",
            "score": 1,
            "replies": []
        },
        {
            "author": "spiderfrommars4",
            "body": "Most likely you are tensing up around people you deem as poor and he feels a need to protect you so he reacts. I learned this going through a leash reactivity course, turns out I was tensing up when we would pass other dogs which is super easy for them to pick up on. you should try training him. go to a class or take him to a specific trainer, have someone come to your house and show you how to handle your dog. Also this post is just so off putting you shouldn’t talk about this in real life. It’s lowkey pretty obvious you’re the one who is scared of “poor people”. it reads like you want someone to say a poor person beat him up and that’s why he’s scared. it’s not. obvious answer is to just train him can’t believe you needed to post on Reddit to figure that out",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Stress-7034",
            "body": ">It's become a serious issue especially on our walks when we encounter maintenance workers, labourers, car cleaners, grocery store employees, delivery workers, etc. He will attack these people for seemingly no reason\n\nSo when you say \"poor people\", it sounds like you mean people who are employed in jobs that are considered blue collar/working class? \n\nFirst of all, keep this dog away from other people. Consult your vet - medication is good for this dog, especially given other issues you mentioned. Then hire a trainer with proper certifications (see the wiki for what to look for in a trainer). \n\nIt sounds like your dog is uncomfortable around people in general. And I get the feeling that you're uncomfortable about people you perceive as \"poor\", and your dog is picking up on that.",
            "score": 1,
            "replies": []
        }
    ]
}