{
    "title": "Fetch, drop it, hold it oh my",
    "author": "Zitidoodle",
    "subreddit": "Dogtraining",
    "rank": 361,
    "score": 79,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 30,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1i617sn/fetch_drop_it_hold_it_oh_my/",
    "id": "1i617sn",
    "selftext": "My dog is really good at going out and retrieving the ball. Shes decent at dropping it. The problem is, when she drops it, it’s how far away from me. She’ll drop it then come to me and whine. I’ve tried teaching her to hold the ball first but she just thinks I’m trying to play. It’s weird I’ve got the beginning and end down, but it gets lost in the in between. Any ideas? ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "Zitidoodle",
                    "body": "I attempted to use the wiki with honing, adding onto, etc with cues for training, but none seem to answer what I’m looking for.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MalsPrettyBonnet",
            "body": "I would separate \"Hold it\" from the ball entirely. Find another item (even a traditional dumb bell would work). Practice \"Give\" into your hand. Once the dog has the idea, ONLY reward when they bring to hand. It's up to you if dropping it at your feet is good enough, but if you're going on to performance activities, I'd make the dog give it TO YOU. \n\nOnly use the commands when training because you won't be able to reinforce them, and they will lose their power. Then you go from retrieve and return on 6ft leash, then longer leash, then off-leash in your fenced yard until the dog is solid.",
            "score": 9,
            "replies": [
                {
                    "author": "duketheunicorn",
                    "body": "I have a poodle—I trained fetch to hand and my neighbour, who plays with her near daily, didn’t. So he gets to bend over😆 I’ve also trained his dog to fetch to hand, but he won’t fetch for my neighbour at all!",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "BubblyNecessary",
            "body": "I taught my dog \"give it\" in addition to drop it. If I say \"give it\", I expect her to put whatever it is into my hand. I taught her this by asking her to \"get it\" with a toy, then putting my hand under her chin and using a clicker/treat when it fell into my hand. Then start slowly moving your hand further away, a few inches at a time. If she drops it on the floor instead of my hand, I would point at the toy and say \"try again\" and prompt her to pick it up. She caught on fairly quickly. I can now ask her to give me an item and she will put it in my outstretched hand.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Whale_Bonk_You",
            "body": "I trained my golden to deliver in my hand by teaching him “get it” he would drop the ball far away from me so I would say “get it” and only reward once he gave it to me on my hand.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Correct-Special-4261",
            "body": "just never throw the ball until they drop it at your feet. they'll figure it out quick.",
            "score": 3,
            "replies": [
                {
                    "author": "Accomplished-Leek736",
                    "body": "This is the method I thought would work but my bernedoodle just LOVES chewing on the ball in her mouth. Apparently more fun than chasing after it, although she does really love that as well!",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Zitidoodle",
                    "body": "I have tried that. She will whine and whine and whine or just chew on the ball.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "craftycountess",
            "body": "Our fetch has several stages. “Fetch”-run after and grab item “Bring it back” - return to me with item “Drop it” - drop on ground by me. If they short changed the drop, I also added in “All the way” which means to pick it back up and bring it the rest of the way. This way if they short change it and just sit by me or don’t get it I can give a quick sequence of “Fetch All the Way” and they know they have to go back for it and do the short distance before they get rewarded. Works pretty well and eventually they got fed up having to go back for it and just figured out to do the full distance to maximize treat receiving",
            "score": 2,
            "replies": []
        },
        {
            "author": "Jaded_Houseplant",
            "body": "I say “ball”, and tap/point to the ground where I want him to drop it, and he’s figured out that I need him to bring it to *me*.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Accomplished-Wish494",
            "body": "Train the “hold” and add duration separately from the rest of the game. Retrieving dog trainers would tell you to stop playing fetch until the “hold” is solid.",
            "score": 1,
            "replies": [
                {
                    "author": "Accomplished-Leek736",
                    "body": "How do you reward a “hold” aside from verbal praise? If they drop it for a treat that’s what’s reinforced right?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "x7BZCsP9qFvqiw",
            "body": "what do you do when she does bring the toy to you? ideally, you'd have a big party and either tug (start with a different toy) or reward with personal play.",
            "score": 1,
            "replies": []
        },
        {
            "author": "goodnite_nurse",
            "body": "keep them on leash and reel them all the way in before she has a chance to drop it. reward them with a treat. do this a bunch of times. then try it without the leash and see what happens. if they bring it all the way to you, or even closer, reward it. keep rewarding as they get closer but do not reward any backward progress. \n\nwhat’s likely happened it when you taught your dog to play you praised them too early (a few feet away) for bringing the ball back instead of waiting for them to hand it to you or drop it at your feet. now they think that’s what you want.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "rebcart",
                    "body": "Please read the sub [rules](https://old.reddit.com/r/Dogtraining/about/rules/) and [posting guidelines](http://old.reddit.com/r/Dogtraining/wiki/guidelines), particularly regarding trainer recommendations.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "trippyhippyart",
            "body": "Idk if this will help. But I always did it like this , and it worked for me. I'd throw the ball, and say \"go get it\" and she'd run and go get it. Once it was in her mouth, she'd run and bring it to me. Then I'd say \"drop it\".  But it also may help to start with a different toy like a rope, that way she may have even more fun when bringing it to you, so you can pull on it gently and play a bit, because dogs do this with each other when playing with toys.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ineedanamegenerator",
            "body": "Sort of struggling with this as well, although it's largely my fault because I go along with it.\n\nI improved it by patiently shaping the intended behavior. If you haven't shaped anything before I would recommend to start with something easier/new like picking up a pen or so. Just to get them to learn the concept of shaping.\n\nI've also had some success with changing the game by sitting down. This makes it different for the dog and possibly easier to train the wanted behavior because it's a (sort of) new thing. Using a specific toy can also help. Initially only use the specific toy when you're training the new behavior.\n\nYou could work with a clear large target (a large piece of cardboard or something) and shape towards releasing the ball on the target. Then you can make it smaller later.\n\nLast but not least: I don't know your intention, but if it is entertaining your dog and letting them have a good time, you can just go along with their behavior. If they find it fun to drop it elsewhere and fetch you and then maybe chase you for it, then that's just fine too (if you're fine with it). Whatever you both find acceptable and fun is good. You don't have to do it perfectly like it's supposed to by some non-existing standard.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Aquaphoric",
            "body": "Mine already did it sometimes if you ignored her long enough so I taught her \"closer\" when she did it on her own and now she can do it on command.",
            "score": 1,
            "replies": []
        },
        {
            "author": "11worthgal",
            "body": "Our Great Dane did the same thing! He'd bring it 3'-5' from us and drop it, then look between us and the ball alternately barking. What we came to realize was that he wasn't a retriever, but instead he was an \"exchanger\"! Once we had another ball/stick/toy to throw, he'd bring it all the way to us. He'd then drop it at my feet and wait for the exchange when I threw it!",
            "score": 1,
            "replies": []
        },
        {
            "author": "inevitableDays",
            "body": "I would try using a toy you can play tug with for a while as the pay off for the dog comes from when the toy is in your hands. You play tug then ask them to drop and throw again. Another thing I have done with my dogs is a small mat that the dog is asked to drop the ball on. Both of my dogs work well with the mat. The tug toy taught them both to bring the ball back but the cheeky one often runs off with the ball and wants to be chased.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BidAdministrative433",
            "body": "i tell my boy..\"i cant reach it..you get it!\" hell grab it n bring it a little closer each time.  if he really wants me to toss he drops it close",
            "score": 1,
            "replies": []
        },
        {
            "author": "Foreverarookie",
            "body": "My Australian Shepherd does the same thing sometimes. When he does; I playfully yell at him to bring me the ball!\nThat usually works, because he just loves to play catch, as in snagging it out of the air. And he is smart enough to know that he can't catch it unless I have the ball to throw it for him. So he will pick it back up and either drop it at my feet, or 'hand' it to me.",
            "score": 1,
            "replies": []
        }
    ]
}