{
    "title": "Guidance Needed",
    "author": "CISSPStressed",
    "subreddit": "Dogtraining",
    "rank": 339,
    "score": 2,
    "upvote_ratio": 0.67,
    "num_comments (reported by reddit)": 9,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1i7mbko/guidance_needed/",
    "id": "1i7mbko",
    "selftext": "I went through the Guide on this Reddit and I don’t quite see anything that relates to my question so here I go. \n\nI have a seven year-old toy poodle, who is generally a well behaved dog. Since he was little, he has been out in the city and highly socialized with other people.\n\nThe issue we are having is that he acts like an absolute angel when one of us (myself and my spouse) is with him on an outing, but if both of us are with him, he is an nut. We were flying with him from the age of six months, but had to stop that because he will moan nonstop and act like the world is ending. Even with him sitting in my lap next to my spouse, he will still walk back-and-forth between us and he is never satisfied no matter what we do for him. If I were to be out with him by himself, he acts like nothing is wrong, and he shows no signs of stress. He loves his tote and happily jumps in it to come with me. He only behaves this way when both of us are with him. \n\nI would love to train this behavior out of him as it has only gotten worse as he’s gotten older, but I’m not sure where to start. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "CISSPStressed",
                    "body": "Hello, I reviewed calmness and the misbehaving section but I do not feel that it addresses this behavior that is dependent on us both being present.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "No-Comparisons",
            "body": "I’m gonna go out on a limb and say you’re reinforcing the behaviour. What happens when he makes a fuss? Do you give him extra attention so that he calms down? If so, you’re TRAINING the behaviour you don’t like!\n\nHe acts well when just with one of you so this sounds like some game playing from doggo rather than any genuine fear or anxiety. \n\nTalk to your spouse and put together a game plan.\n\nIf he moans he doesn’t get attention. No punishment, he’s just ignored. When he’s quiet and calm, click and reward. \n\nA lot of the skill is in timing. If he’s going mad, but then calms down for 2 secs, make sure you click and reward and calm behaviour.\n\nIf you haven’t click trained you might want to try that first.",
            "score": 5,
            "replies": [
                {
                    "author": "CISSPStressed",
                    "body": "When he fusses he goes in his bag and is ignored.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "No-Comparisons",
                            "body": "Remember to mark and reward the moments when he is calm, even if he just calms down very briefly, click and reward the calm behaviour and he should soon get the hang of it if you're consistent. \n\nIf you want to go back to basics, I would suggest starting at home since it seems he acts up at home as well. Train him to sit calmly on his bed in the living room (as I think he already does) with just one of you there. Make sure you can toss him a treat to his bed, with him staying there without getting up. \n\nWhen is he well behaved and trained to lie in his bed with just one of you there, and you are able to throw him treats, you can work on part 2. \n\nVery slowly introduce your spouse (SP). SP slowly comes into the room. If doggo is calm, mark and reward. Then SP leaves. \n\nBuild this up - Sp comes in and sits on the other side of the room. Then, sp comes and sits closer to you. Then next to you. etc etc. If one element of this causes massive fussing, it is probably time to take a break then reinforce the \"easier\" level. \n\nYou might be able to do this in a day or two. It is more likely to take a couple of weeks.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "No-Comparisons",
                                    "body": "I recommend 'When Pigs Fly' training book. Its marketed as for difficult dogs but its good for all dogs.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "CISSPStressed",
                                            "body": "I very much appreciate your time and effort on this. Thank you.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "PrettyLittleSkitty",
            "body": "Could you describe the behaviours you’re experiencing in more detail?",
            "score": 2,
            "replies": [
                {
                    "author": "CISSPStressed",
                    "body": "If I am out with him on the subway, he will quietly sit in my lap and overall behave perfectly. If he is in his tote, he lays there with his paws crossed and a “smile” on his face. You wouldn’t even know he is in there. Tail is up, he might even play with me a little. \n\nIf my spouse is with me, he will moan and pace back and forth in our laps. If I am holding him, he wants my spouse. If my spouse is holding him, he wants me. He seems unable to be comfortable, and is not satisfied if we offer him water, attention, or even treats. If he is in his bag, he will draw so much attention from the loud moaning. He can see both of us at all times also. \n\nSame thing at home. If either of us are alone with him, he is quiet, calm, and listens well. When we are both home, he’s extremely opinionated about almost anything. Breaking the silence? Bark. Getting up to get water? Bark. Hugging my spouse? Moan. \n\nIf he were an actor, he would win best performance in a drama series.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}