{
    "title": "My dog approaches strangers to bark at them",
    "author": "bonkersbinky",
    "subreddit": "Dogtraining",
    "rank": 341,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1i7raza/my_dog_approaches_strangers_to_bark_at_them/",
    "id": "1i7raza",
    "selftext": "Just a bit of background on her barking behavious: my dog barks at strangers when they come into the house but I think we are managing this well by educating new guests on what to do when they enter, redirecting etc. She does not bark, or often even acknowledge, other people when we are walking on busier trails. However, if we are on a quiet trail and we see someone she will bark at them, honestly this doesn't bother me too much (I'm a female and often hike alone) as long as I can assure her there is no threat and she stops barking imminently.\n\nThe problem I have and am really unsure how to manage is when she purposely approaches groups and barks at them. We live in BC and go camping a lot, mostly on crown land far up forest service roads. When we are out there we let her off-leash and she loves roaming around and never goes too far. Mostly we are alone but sometimes there are other groups near by. We continue to have her off-leash and she'll be fine wondering around close by but after a while she'll take herself over to the other group, stand around 5 meters away from them and bark at them (she never gets closer). Maybe she's bored? She normally knows they are there before approaching so it's not like she's startled by new people coming in. When this happens I go over to get her (she will not recall) and put her in our truck for time out. Am I doing the right thing? What more can I do? Why is she doing this? Boredem? Scared? Trying to establish a new territory?\n\nI would like to take her to my partners cottage as I know she would love to roam around on the large lot of land but I also know she will take herself off to the neighbours property and start barking at them. \n\nI appreciate any and all help! Thank you!!\n\n\n\n",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "bonkersbinky",
                    "body": "I’m unsure why she barks so I’m not sure how to manage it. It could be territorial or alert or fearful but these people aren’t suddenly approaching or doing anything different, they were there the whole time and she goes up to them.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Unique-Public-8594",
            "body": "If I had a dog that would take herself off to the neighbor's property and start barking at them and not recall, I would keep her on a long lead. \n\nI would also work on recall daily. \n\nIt would be inconsiderate to have my dog on someone else’s property, disturbing them. \n\nOur trainer says:\n\nGet the best treats (meat, cheese, dried liver)\n\nDon’t starve your dog but do practice when your pup is hungry, just before meals. Triple check to make sure (kibble + treats) that the pup isn’t over fed. \n\nStart easy (indoors, fewest distractions). \n\nCombine calling (only once)  with a body language signal (clap hands, slap your leg, etc). Dogs find signals/sounds/gestures easier than words.\n\nTurn and move away from your dog (as you call and do the gesture). Running away, for a dog, is like an invitation to come play. It makes it fun. \n\nReact super excited when doggo comes:  praise, rubs, play, dance, high pitched voice (it doesn’t matter if the neighbors think you are crazy). It’s like pooch just won the lottery. Over the top. Some owners make the mistake of patting/rubbing  the dog’s head as a way of saying “Good boy” but some dogs dislike that so they are less likely to come when called next time. \n\nWhen you shift from indoors to outdoors use a long leash (attached to a halter not their collar) until they come 100% of the time. \n\nNever call if they won’t come. It’s important not to practice/repeat them ignoring your calls. Hard to be consistent about this one. If she won’t come on one call, she should be on a long leash.  Don’t call more than once. \n\nIf your dog ignores you, don’t up the reward to get them to come because this trains them not to come. If your dog ignores you, use the long line. End the training session and next time try it in an easier scenario (possibly indoors). \n\nAvoid accidentally punishing your dog when it comes when called. For instance, if you call your dog to you but then do something to it that it doesn’t like (give medicine, put a harness on, or a bath), then it’s going to be very hesitant to come to you.  During play sessions with other dogs, call your dog, after they come, then release to play (so they don’t associate recall = leaving). \n\nWhen it’s urgent, don’t get stern. Instead be cheerful and excited and turn to run away as you call. As if to say “come now and we’ll have so much fun!!!” (which works well) - rather than “Come or else you are in **BIG TROUBLE** (which works less often). \n\nPractice every single day, multiple times a day. \nNever stop. ",
            "score": 1,
            "replies": [
                {
                    "author": "bonkersbinky",
                    "body": "Thank you for this very in-depth comment, sooo many helpful tips! Looks like recall is the thing to work on rather than the barking itself. I always use the long-line when out walking and been doing a lot of what you’ve already mentioned and will continue to do so. Definitely got lots more work to do on recalling with distractions. I think I’ll start spending time each camping trip to do some recall training so she gets better at recalling in that environment too.\n\nJust to clarify we haven’t been to the cottage yet and would keep her on-leash if we do. And when we are camping we confirm with the other group that they are okay with her being off-leash (they always are, everyone has there dogs off-leash), she spends a couple hours roaming around contentedly before she starts the barking of which she then remains in the truck/ on-leash for the rest of the night.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Unique-Public-8594",
                            "body": "Ah. Got it!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}