{
    "title": "Rescue regression after loss (grief)",
    "author": "wtch_42",
    "subreddit": "Dogtraining",
    "rank": 308,
    "score": 9,
    "upvote_ratio": 0.77,
    "num_comments (reported by reddit)": 15,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1i8q8y8/rescue_regression_after_loss_grief/",
    "id": "1i8q8y8",
    "selftext": "I have looked through the community resources and read the community guidelines and wasn't able to find what I need help with, maybe somebody can point me to the right direction.\n\nEnglish is my second language, apologies in advance if I fail to express myself correctly and apologies for the long post. \n\nBACKGROUND:\n3 years ago we adopted a 9 month old, terribly traumatised (mudi mix) pooch. They found her stuck in mud, beaten up, malnourished. Her first adoptive family kept her for a few months but given up on her due to severe behavioural issues (chewing, fearfulness, aggression, reactiveness, the whole lot). We already had a 13 year old puli and a 2 year old vizsla, both of them very well trained, balanced and confident, we took her in to save her from being put down. \n\nIt was a very slow progress but she made huge steps, became the most loving, sweetest ball of fur, I fell in love with her. She is very intelligent, takes a few repetitions only to teach her new tricks, however she has almost no food drive (but loves praise). One thing we always struggled with: she just won't trust anyone (human) outside of us. We socialise her, have frequent (daily) visitors but the progress is barely noticeable. I have to add, we live in rural Hungary and have a huge garden so going on walks isn't an everyday thing and even when we go, we don't meet people nor other dogs (just rabbits and deer).\n\nShe became best friend almost instantly with our vizsla, who had a huge part in building her confidence. For the past 3 years they were inseparable, playing, wrestling, 'hunting' being mischievous together in oir garden all day. \n\nTHE PROBLEM:\nNow onto the issue itself. We lost our vizsla to kidney failure a few days ago and besides having to deal with our grief and having a huge hole in our hearts, our rescue is showing alarming signs of regression and I don't know how to approach the situation, I worry about her and want her to feel better. Everything got turned up to 100: fearfulness (barking, hiding, growling even if a fly buzzez), resource guarding (location: entire room if the old puli is coming in), she is on edge all day and can't seem to relax, almost anything can be a trigger. My heart is breaking for her. \n\nWe don't have the financial means to hire a trainer and Youtube hasn't been helpful so far. Can anyone point me to the right direction (resources, books, advice) on how to approach the situation? How to build her confidence after the loss of her best doggie friend? I know she feels our sadness too and I try and give her so much of my loving attention (today we will have a long and pleasant grooming session etc.). I am at home with them all day and will be for the next month, I want to help her as much as I can. \n\nThank you everyone who got to the end of my post. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "wtch_42",
                    "body": "I found resources for reactivity, training shelter dogs and resource guarding both on the subreddit and Youtube, but haven't found anything about grief, lacknof confidence due to loss, regression in behaviours.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Momshie_mo",
            "body": "Since it's just a few days, perhaps, give her time and space to grieve? If she does not get better in a week or two, a trip to the vet first. ",
            "score": 8,
            "replies": [
                {
                    "author": "wtch_42",
                    "body": "Thank you. Of course, patience is key.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Altruistic_Plant7655",
            "body": "Do you have anything that smells like the dog that passed? Is this dog allowed to sleep near you? She is missing her friend. Will calming music help or leaving the tv on even if you’re just in the other room? I agree a behaviorist could help, but some of my dogs have taken grief extremely hard. Give her lots of treats if she will take them, maybe leave a snuffle mat out. She could also be “waiting” for your other dog to come home, so if you see pacing at the door or looking out the window, you can try to distract with a treat or toy. One of our dogs lost a little bit of trust after we put a housemate down, but overtime it kind of clicked that her friend wasn’t coming back, and it wasn’t our “fault”",
            "score": 5,
            "replies": [
                {
                    "author": "wtch_42",
                    "body": "Thank you very much for your detailed answer and ideas! Yes, I will definitely pay attention to when she's pacing and distract her. Best friend's smell is still everywhere because we were all hanging out on the same carpet every evening, them sleeping on it. Even in the final days. We hoovered and mopped since, but didn't have a deep clean.\nToday I've given her a big grooming session that she loves and managed to get her excited about treats and rewarded calm behaviour. \n\nGood news is, today is my birthday and we had my parents visit us. She's made a big step forward: not barking once everyone has settled. She did go to her corner and was peaking out of there, but previously she always barked very loudly and growled. She was laying down, paying attention to everyone . I asked my parents to not approach her and not to make too much eye contact/staring. Total success, she even sneaked up to my mom to sniff her.\n\nOne step at a time, I am happy I have the opportunity to stay home (with a broken leg) for an other month so I can help her as much as possible.\n\nThank you again for your answer!",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "PhoenixFreeSpirited",
            "body": "Our aussie lost his best friend and went from 50lbs to 25lbs.\nI think the only things that saved his life from dying from depression were: extreme levels of love and care given. Crying together, snuggling, being around her old stuff. And majorly, we had a new puppy who brought him out of his shell. Granted, we got her 1 month before our Sheba (her name, not her breed) died.\n\nGive your pup something to be confident in again. We help give our dogs confidence by saying \"go home\" and they lead us on walks, or \"find ____\" and they get tons of praise.\n\nDepression is terrible. I feel for you and your pup 💔.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Low_Weakness3",
            "body": "Have you let her smell the dog that passed? \n\nI've done it with all my dogs and it definitely helps them grieve. They otherwise don't know where their friend, their safe space has gone. Considering your rescue was rehomed before, maybe the dog things the other dog has just simply left them behind as well. Let them smell the body of the dog that passed so they know they aren't coming back.\nI've only ever seen issues like regression occur if this ISNT done.",
            "score": 2,
            "replies": [
                {
                    "author": "wtch_42",
                    "body": "You are right. It's too late now, I should've done that, I was misinformed previously and told not to let her see the euthanasia itself either or sniff the dog that has passed. She did spend the few nights & days with the best friend leading up to the day, seeing her suffer but once poochie was dead I didn't allow her near to sniff her but instead separated her and put her in her kennel until we buried the other pooch. I wouldn't want a re-do because it was a very painful week and day for all of us but next time I will make sure everyone is present after the fact and can sniff and say goodbye.\n\nSince it's legal in our country, we dug a deep grave for her in our garden and put planted a pear tree over her grave. Our rescue saw the burial itself and I caught her sitting/laying by the grave since, for prolonged periods of time (she never really just sits in that area of our backyard).\n\nThank you for your advice.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Low_Weakness3",
                            "body": "So I partly agree with whoever you were misinformed by. It is NOT smart to let another pet witness an euthanasia. Multiple factors play into this. Safety, the other dog may panic and act unexpectedly. They might even try to \"protect\" the other pet. You can fully focus on your dying pet. Mentally it will relieve you from a lot of stress by having to cope with a dying pet and having to keep an eye on another one at the same time. But do let them smell the body, let them sit with them as long as they need. They will show when they're done, might be after 5 minutes with some, other ones take up to 30 minutes. They will walk away, leave the body alone and \"do something else\". That's when they know and you can take the body away. Trust me they know.\n\nKnow that it's not your fault that you were misinformed. Absolutely zero blame to you. You sound like an amazing pet parent.❤️",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Motor-Michael",
            "body": "When your Vizsla passed was it at home or did you take  or was she taken to the veterinarian to be euthanized?",
            "score": 1,
            "replies": [
                {
                    "author": "wtch_42",
                    "body": "After 4 days of home treatment by the local vet she spent a day in a nearby city's veterinary clinic for further testing. After a series of tests hey told us the situation and how they can't help her (blood creatinine levels were over 1000 and quickly rising). After hours of talks, I asked what they think is best for the vizsla girl and they told us to take her back home and be together but to not extend her pain and suffering as she could collapse any minute. We took her back home and spent the night all together (2 humans 3 dogs) cuddled up, stroking her and conforting her. We wanted a goodbye. \n\nOn the next day, when the time came and before the vet arrived to the house, we put the other dogs in the kennel. \n\nOur baby girl was euthanised with us hugging her in the livingroom in her spot  but we didn't want our two other dogs to see the process... \n\nWe buried her in our garden under her favourite pear tree.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Motor-Michael",
                            "body": "Sounds like you gave her the best last bit of life that you could have. I’m glad she passed at home. When I had to euthanize my little girl it was done at home too. My little boy dog was there and saw her die. It helped him deal with the loss of his sister knowing that she died and didn’t just disappear.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Responsible-Stock-12",
            "body": "This dog really needs to see a board certified veterinary behaviorist. It’s great you rescued her, but rescuing a dog with known, severe behavioral issues means you need to be prepared to get professional help for them, even if finances are tight.",
            "score": -3,
            "replies": [
                {
                    "author": "wtch_42",
                    "body": "Thank you for your answer, I agree with you that she'd do best with professional help and I would definitely do that if we lived in the right country with the right salary and pet-culture. We used to live in the UK before we rescued her and I know how accessible and available everything is in certain countries. Unfortunately it isn't the same over here and I must try my best, given the resources around me. \n\nIn these rural areas people don't even keep their dogs in the house, 90% of dogs are guard dogs in our area, some are chained up and fed corn flour (seriously, my heart is breaking for them). The adoption process is far from what it is in more 'developed' countries, shelters (there's only one in the county) are still kill shelters. Finding the right professional would is an issue on it's own. Imagine, we are often judged for letting our dogs inside the house and the old lady puli even sleeps in our bed.. It's just a very different culture. In the capital I know it's a bit better, but rural areas have decades of catching up to do.",
                    "score": 3,
                    "replies": []
                }
            ]
        }
    ]
}