{
    "title": "My whippet eats other dogs’ poop on walks – please help!",
    "author": "gazmatron",
    "subreddit": "Dogtraining",
    "rank": 286,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1ia82ss/my_whippet_eats_other_dogs_poop_on_walks_please/",
    "id": "1ia82ss",
    "selftext": "Hi all – basically at my wits end with this. I have a 19-month old male whippet (neutered), he started eating dog poop around 8 months ago (post-neutering). I’ve tried several different complete foods with him since then in case it was a deficiency (currently on Naturaw ‘Forage’ range which is FEDIAF approved, plus extra raw veggies, pure meat treats and Purina fortiflora probiotic) … food has made no difference.  \n  \nHis leave-it is good on lead and we use a negative marker so whenever he goes to sniff / investigate poop he gets corrected, however, I can’t see every poo in the woods so when he is on a longer line I don’t know whether he’s sniffing (and about to snaffle) poo or just sniffing stuff… and when he’s off lead he basically turns into a sh\\*t seeking missile, won’t leave/ drop. He does come back when called – begrudgingly - though not until snacks have been partaken of.  \n  \nI’m so tired of spending every walk scanning the floor for poo and he is getting more and more frustrated at being on the lead (whippets will zoom – inside or out…I’d really rather it was outside, and off-lead given he’s a solid 17kg!)  \nAny advice/ anyone managed to train this behaviour out??!??",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "gazmatron",
                    "body": "Have trained leave it (from hand, on floor inside. Will leave when instructed on lead, and off lead at a distance IF he hasn't already got a mouthful of poo.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Unique-Public-8594",
            "body": "Sounds super frustrating and a tough problem and you’ve smartly tried many options and described it here thoroughly. \n\nI’m not familiar with a negative marker. Does that include punishment?  (Punishment is not recommended.)\n\nIf each time he does this you call and reward for coming,  would that be rewarding eating poop?\n\nI’m guessing a basket muzzle for walks would be ineffective. Just… messier. \n\nI guess your choices are either keep him on a short lead, (as you’ve said you prefer not to due to the breed’s need for exercise), take him to a fenced area that is poop free zone, or teach a more consistent “Leave it” (which isn’t perfect as you might need to watch all the time and say “Leave it” to any sniffing).\n\nThis was the process we followed to teach a solid  Leave It (but, unfair, we have a border collie mix, extremely easy to train and very obedient, might disqualify me from giving any dog training advice):\n\n I would set up treats on a plastic lid in one room, then leash up my dog in another room, walk towards the treats but stop maybe 12 feet away, a place close enough that he notices the treats but far enough that he can control himself. Then say “Leave it” and give a treat. Back up, walk in another room, then approach again, say “Leave it” and reward. You want him to automatically look at you when you say “Leave It” expecting a treat from you if he doesn’t get the treats on the lid. Then gradually closer, never grabbing the treats on the lid, always looking at you when you say “Leave It” and always rewarded for looking at you rather than the treats on the lid. \n\nEventually, take it outdoors, same set up. Treats on lid, walking near it on leash. “Leave It”. Looks at you instead. Reward. \n\nEventually you will be able to say “Leave It” anywhere, anytime whether he sees a dead frog or a tampon, or McDonald’s trash or pee  and 100% know your dog will look at you instead.\n\nThat’s what worked for us but not a perfect solution as it requires you to be hyper vigilant. \n\nI wish I had a better answer for you. ",
            "score": 2,
            "replies": [
                {
                    "author": "gazmatron",
                    "body": "Thanks for the response! …. I will definitely give your suggestion a go.  \n   \nThe negative marker is just a noise (kinda “ah-ah”) which I use when he is doing something undesirable (started off as a ‘stop nipping’ thing when he was a baby, so nip – ah-ah  – play stops, but found it generalised well to making him just stop and pause to give me chance to give a more constructive command). I guess the “punishment” in this case is being recalled (or fetched when he’s being stubborn) and put on a lead? I don’t hit my dog (despite my Dad constantly haranguing me about it being the only way he’ll learn).  \n  \nI’m not rewarding him for the post-poop consumption recall, I just put him straight on the lead, keep it short and (mostly because I’m annoyed and trying not to take it out on the dog) essentially give him the cold shoulder while we head straight home.     \n  \nAh! A poop-free field… my kingdom for a poop-free field!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Unique-Public-8594",
                            "body": "Good for you for not taking your Dad’s advice!\n\nHard (really hard) but I’ve heard some dogs crave attention -whether the attention is positive or negative  - and while I doubt anything you are doing is causing this behavior, try to act neutral when it happens.  Zero response. \n\nPut all that energy into prevention. \n\nYou might want to bring great treats with you on outings. Feed great treats until the dog eats poop and immediately/calmly turn back home as soon as poop is eaten (even if it is a 2 min walk. Maybe the next day it would be a 3 min, then 4 min, etc. \n\nSo being outside becomes the reward for not eating poop.  🤷",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}