{
    "title": "Need help training my Dachshund",
    "author": "Topglock344",
    "subreddit": "Dogtraining",
    "rank": 174,
    "score": 4,
    "upvote_ratio": 0.84,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1igamlv/need_help_training_my_dachshund/",
    "id": "1igamlv",
    "selftext": "Hi guys i’m very new to having a dog and I haven’t had one since i was a kid.\n\nI have had this Dachshund (or what i believe to be a Dachshund after many pictures looked at and a dog identifier app) for a couple months now and i’m having a lot of trouble trying to figure out how to train him properly.\n\nSo the main troubles i’m having with the little guy is that I keep on potty training him by taking him outside to potty or poop every hour and this does work. He won’t go to the bathroom in the house for a while then suddenly he just resorts back to going inside on random days. Also we just got a new carpet on our wooden floors and he keeps peeing on it. Please help me properly train him to not do such things!!\n\nAnother problem i’m having is that he keeps tearing up his beds even tho he has a lot of toys he likes. I have gone through 5 beds already please let me know if there’s a way to fix this!\n\nOne more problem I have with him is that I don't know how to make him stop jumping up on people and furniture. I have tried scolding him. I will not use any kind of physical punishment. The farthest I have gone and will go with that is simply pushing him off of me and furniture while saying \"no.\" However, this does not fix anything.\n\nHis daily schedule looks like this:\nWake up and taken outside for 10 minutes to potty\nThen he is fed and given water for the day\nThen i put him in the backyard to play with my moms bigger dog while I got to classes for about 4 hours\nWhen i come home I take him on a 30-40 minute run/walk \nThen I will play with him for a little bit through out the rest of the day\nThen I take him outside for another 10 minutes for a potty and feed him\nThen that’s Goodnight\n\nAny help will be greatly appreciated please!!",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "Topglock344",
                    "body": "I have researched and met the dogs daily activity needs through his walks and training. I have shown the schedule at the bottom of my post where I describe these activities. I have also tried to teach him wrong from right as I said in the third paragraph where I try verbally disciplining him when he jumps. However, I need help understanding how to properly do this and how to make sure the affects last.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lizdance40",
            "body": ">I have had this Dachshund (or what i believe to be a Dachshund after many pictures looked at and a dog identifier app) ... potty training him by taking him outside to potty or poop every hour and this does work. He won’t go to the bathroom in the house for a while then suddenly he just resorts back to going inside on random days. Also we just got a new carpet on our wooden floors and he keeps peeing on it. Please help me properly train him to not do such things!! \n\nDogs with short legs and a long body are frequently difficult to potty train.  Until the dog is reliable, which clearly is not yet, the dog must be crated, or tethered to a person, or under direct supervision 100% of the time.  If he is able to sneak off and toilet on one of your new carpets, he is obviously not crated, not tethered to someone and not directly supervised.   Taking him out frequently is an excellent start!  Make sure when you do take him out and he successfully toilets outdoors that you make a big deal about it. He should get a high-value treat, lots of praise and enthusiasm.  \n\n>Another problem i’m having is that he keeps tearing up his beds even tho he has a lot of toys he likes. I have gone through 5 beds already please let me know if there’s a way to fix this! \n\nTake away the bedding. I know it sounds unkind, but if he's destroying it he doesn't appreciate it anyway. And it's more dangerous to leave bedding while he's on supervised. He could ingest portions of the stuffing or the fabric and you'd wind up with a dog that either needs very expensive surgery, or is not alive.   When the puppy gets used to the household and becomes more comfortable and more mature, then you may allow a bed while supervised. At that point if doggy is not destroying the bed, then he might be able to have a bed in his crate.\n\n>One more problem I have with him is that I don't know how to make him stop jumping up on people and furniture.\n\nA jumping is a natural behavior for dogs. The only way to extinguish the behavior is for the dog to get no HANDS, no TALK, no eyes, no attention whatsoever when they jump. This means you have to control the dog on leash when meeting new people.  Tell people to ignore him completely till he sits.  Only then can he get attention.\n\n> I have tried scolding him.\n\nNo.   It serves absolutely no purpose - he does not understand why you are scolding him. If anything you are giving him attention which is why he jumps..  Please follow the directions above. Absolutely no attention.\n\n> I will not use any kind of physical punishment. The farthest I have gone and will go with that is simply pushing him off of me and furniture while saying \"no.\" However, this does not fix anything. \n\nOf course not. You're using your hands which is what he wants. You're giving him attention which is what he wants. Zero attention, pretend he does not exist. If he's persistent get up and walk away.  \n\n>His daily schedule looks like this: Wake up and taken outside for 10 minutes to potty Then he is fed and given water for the day Then i put him in the backyard to play with my moms bigger dog while I got to classes for about 4 hours When i come home I take him on a 30-40 minute run/walk Then I will play with him for a little bit through out the rest of the day Then I take him outside for another 10 minutes for a potty and feed him\n\nYep there's missing pieces here. When you take him outside in the morning he should have to pee and poop. If you are not with him when he pees and poops to reward  and praise him for toileting outdoors you have missed a part of his training.   \n\nThe Long Walk is excellent. If this dog is under 1 year old he should not be running on pavement (other than playing in the backyard). Puppy bones are not yet fully formed and you can actually damage their joints. A Long Walk to explore with his nose is a wonderful idea.  Walking can also stimulate the need to toilet..  a leisurely walk after meal time will encourage toileting and May prevent accidents indoors. \n\nAll in all, I'm glad to hear you are invested in your puppy's education. I appreciate the fact that you're reaching out to the dog training community for assistance from those who have been down this road with many puppies and dogs.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Analyst-Effective",
            "body": "Make the right thing easy, and the wrong thing hard.",
            "score": 2,
            "replies": []
        },
        {
            "author": "fiberlooper",
            "body": "How are you cleaning up the mess when he goes in the house? Also, is your mom’s dog well-trained? If no, I would reconsider letting him spend so much unsupervised time with them. A well-trained dog will teach a new dog good habits and vice versa.",
            "score": 2,
            "replies": []
        },
        {
            "author": "maybeambermaybenot",
            "body": "How old is your puppy? Consistency and patience is really important. I've had my pup for two months (he's 6m old now) and despite training he still has plenty of problem behaviours to overcome, but he's made awesome progress. Keep up the potty training routine until he's had no accidents for a week and then SLOWLY fade it out, e.g. go every 2 hours instead of every hour...",
            "score": 1,
            "replies": []
        },
        {
            "author": "dullbeans",
            "body": "So much great advice from others, there's a few things I haven't seen: \n\nRegarding potty training: dogs and puppies naturally keep their homes/dens clean. Accidents usually come from two things. First, their bladder might not being strong for the schedule you set (this is especially common with smaller dogs, but taking him out regularly is a great idea! the only thing I would tweak is to also take them out right after naps, play/activity sessions or food as well). Second,  you two have different definitions of what parts of the house is part of that squeaky clean home :) So you have to show them where you would like them to pee and poop. Celebrate any potty-win with really high value treats and taking them to the same part of the yard for potty is a good idea (I would recommend taking them their on a leash even if it's the backyard). They will learn that you like it when they do that in no time. If they make a mistake, just clean up the mess and move on (even if it's so hard sometimes). Scolding doesn't really work here, they won't understand and it might make them afraid, which uhm, can be counterproductive to potty training. Cleaning up the messes with an enzyme cleaner is a good idea. It removes even the smells that we humans cannot smell, which tells dogs that this is their potty spot, so it helps a bit from preventing a habit from forming. \n\nIn terms of your schedule, I would add a bit of play/training in the morning before you go to classes and rethink whether you want to leave your puppy completely unsupervised with your mom's dog. I wouldn't be shocked if your dog soon slept through most of the time while you're in class and then maybe can walk them once in the middle for the time being (young dogs need anywhere from 16-20 hours of sleep a day depending on their age).\n\nOthers have recommended a crate where they can be while you can't supervise. I think that's a great idea in general but a few things to watch out for:  \n\\- A crate should be a happy, safe place, not a place of punishment. Make sure you get to a point where they have a strong positive association with it before you lock that door and increase their time spent in there gradually. Feeding all their meals in there and throwing some treats in there randomly is a good idea. Reward them heavily for any curiosity they show towards it.  \n\\- Make sure their crate isn't too big for them. They should be able to comfortably stand and turn around in it, but if it's too big, they might start \"partitioning it\" and designate a \"sleeping area\" and a \"potty area\" within it.\n\nYou're really on the right track here by putting in all this work, I hope you have a long and happy relationship with your puppy!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jabelinha",
            "body": "Im not trying to kill your hope but I have had 2 doxies (male and female) and they both struggled with potty training. Many of my friends with the breed had told me to give up because they are never 100% potty trained. It might mean kennelling them when you are not home, having puppy pads available and avoiding carpets.",
            "score": 1,
            "replies": []
        }
    ]
}