{
    "title": "LF chewy recommendations",
    "author": "SilverGearsVII",
    "subreddit": "Dogtraining",
    "rank": 149,
    "score": 6,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 37,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1ihzwdx/lf_chewy_recommendations/",
    "id": "1ihzwdx",
    "selftext": "So I have two shepherd mutts that absolutely love chewing on things they shouldn't when they start to get bored. \n\nI'm caught on the whole \"don't give dogs chewies that aren't flexible because they could break their teeth\" (so stuff like bones and hooves would be a no-go). But, alternatively, they're shredding dogs so soft chewies don't last them and are more like treats for them instead of something to keep them preoccupied while I work.\n\nSo is there a happy medium here that I'm missing? \n\nWhen I have extra, I do give them cardboard that they are allowed to shred to their hearts content in restricted areas of the house (to make cleanup easier), so they are getting the tear part of their prey drive satiated. (I do want to eventually move them to partial heads of lettuce that way its also refreshing to them instead of running the risk of causing a bowel obstruction.)",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "SilverGearsVII",
                    "body": "I'm not sure what I'm supposed to reply here considering recommendations for heavy chewers is not in the guide. I've seen some posts talking about freezing kongs, but my dogs have a tendency to tear up soft plastic as well, so they would shred those just to get to the frozen food.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ohyonkavich",
            "body": "Frozen Kong filled with wet food and a few treats keeps my dog occupied when I leave for work",
            "score": 10,
            "replies": []
        },
        {
            "author": "Welly_Beans",
            "body": "Yak chews, coffee wood chews and JCB rubber toys have all worked for my heavy chewing lab (he ate part of a skirting board to give you an idea) the first two break apart safely and can be ingested. Plus the yak chews can be turned into giant cheese puffs when they’re worn down! 5 minutes soak in water and a minute in the microwave - for a light huge crunchy puff. Ours goes bananas for them. I hope this helps - I can post links if needed.",
            "score": 6,
            "replies": [
                {
                    "author": "Careful-Budget-2102",
                    "body": "My golden retriever is a non-chewer which is really unfortunate because I feel it would curb boredom and be good for her…NOTHING works except for yak chews!!! A godsend! Good recommendation!",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Lizdance40",
                    "body": "I am not happy with some of the quality of yak chews. Even the large ones I have seen shatter if dropped or after just a bite or two,  and then there are sharp pieces. I have had to take them away from even smaller dogs. I never give them without supervision.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Happy-Respond607",
                    "body": "Highly recommend always watching your dog with those yak chews! Especially heavy chewers. I used them until one day I realized just how big and sharp the pieces my dog was breaking off were.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "ferocioustigercat",
                            "body": "They are also way smaller than they should be (even the big dog ones) and I don't trust my dog not to swallow one.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "No-Talk-997",
                    "body": "I love this with the yak chew!!\n\nMy BC cross just sits and works away on for it for a few hours",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lizdance40",
            "body": "Did they just need more general exercise?  One of the reasons dogs chew is to get out some pent up energy.",
            "score": 2,
            "replies": []
        },
        {
            "author": "maybeambermaybenot",
            "body": "There are some bendy/stuffed toys which are pretty resilient. I bought my dogs the \"Tuffy\" octopus and they've played tug of war with it just fine (two large dogs weighing about 30kg/66 lbs each) It has squeakers in it too which they love. Kong has a lot of options- their teethers are pretty good too. I would avoid rope toys. They're always advertised as durable but my dogs shred them within a day.",
            "score": 1,
            "replies": [
                {
                    "author": "queercactus505",
                    "body": "Also if the ropes untwist and are ingested, they can cause dangerous linear blockages which are more difficult to remove.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "SpicyPeanutSauce",
                    "body": "Damn that Tuffy Octopus lasted exactly 1 day with my 45lb shepard/hound",
                    "score": 2,
                    "replies": [
                        {
                            "author": "occasionallyquail",
                            "body": "yeah mine's learned how to locate and target the seams, octopus was toast in minutes. Same with the toys made of fire hose that are supposed to be indestructible. At this point I just think of stuffed toys as being disposable because they're gonna be ribbons in two days tops.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "maybeambermaybenot",
                            "body": "Oh no! 😬 Ill have to monitor it then. I thought I'd finally found a good one lol",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Frankief1sh",
            "body": "Can they shred the kong extremes?",
            "score": 1,
            "replies": []
        },
        {
            "author": "StuffDue518",
            "body": "Beef cheek rolls or strips!\n\nMy girl is also a voracious chewer and recently cracked a tooth on either a yak cheese stick, or a knuckle bone 😭. It was close to $2000 at the vet. We now, of course, have a moratorium on those things, including antlers and hooves.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dbellz76",
            "body": "Try bully sticks but in a holder so they don't swallow it up. What about frozen filled Kongs?",
            "score": 1,
            "replies": []
        },
        {
            "author": "BeingKhaleesi",
            "body": "Yak chews are a good choice for strong chewers. Kongs with food in are also a good option, although needs refilling pretty regularly. I haven’t tried anything beyond dried kibble in the kong yet though.",
            "score": 1,
            "replies": []
        },
        {
            "author": "otterpopqween",
            "body": "I’m a huge fan of the yak chews!! They are softer than bones and chip away easily so not as much risk to the teeth, but still hard enough that they last a while for your dog to get through! It takes my dog several days-weeks to get through one. Once it gets down to about an inch in size you put it in warm water then in the microwave and it turns into a big soft cheese chew that dogs love!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alternative_Title91",
            "body": "My heavy chewer does well with the black Kong products.  My vet said only things that you can dent with a fingernail are safe for teeth.  I used to give the large bones but my boy wore his teeth down  pretty quick with those, he is 6 years old and his teeth look like an older dogs.",
            "score": 1,
            "replies": []
        },
        {
            "author": "huskys_are_the_best",
            "body": "I totally get the struggle! You want something durable enough to keep them busy but safe for their teeth. A good middle ground would be rubber or nylon chew toys like West Paw’s Zogoflex line or the Kong Extreme. They have some give but are tough enough for power chewers. Himalayan yak chews are also great—hard at first but soften as they chew, making them last longer than standard treats. Raw, frozen marrow bones (with supervision) can be a safe option too since they’re softer than cooked bones.\n\nIf they love shredding, consider tightly rolled jute tug toys or even supervised sessions with a fleece rope toy—they can tear into it a bit but not swallow large pieces. Your idea of lettuce is interesting, too! Maybe try frozen carrots for a crunchy, safe alternative. Hope that helps!",
            "score": 1,
            "replies": []
        },
        {
            "author": "FreeLittleFox",
            "body": "We give our dog a coffee stick, it's wood, and easily broken off, so won't hurt their teeth. And they absolutely enjoy it!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Moki_Canyon",
            "body": "I have a GSD and I give her those large bones. Big enough not to swallow, but all day long its \"Gnash, gnash gnash! Crunch, crunch, crunch!\" Her teeth are clean, and she's happy.\n\nBecause she has bones, and toys, we have been able to teach her not to chew on forbidden items like shoes and gloves...and pillows, and bedspreads, and the garbage can...\n\nSo what's the problem with bones? Teeth? Is that for real, or just an urban legend?",
            "score": 1,
            "replies": [
                {
                    "author": "Moki_Canyon",
                    "body": "PS Anything we have bought has been chewed to pieces and swallowed, or she simply loses interest in it. A bone is forever, it seems.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Witty-Cat1996",
            "body": "Yak chews or if you want softer I bought a rubber toy that looks like a stick at Cabelas and so far my dog hasn’t been able to destroy it. I see someone recommended coffee chews, I bought one for my dog and ended up with little tiny wood chips everywhere so it became an outside chew not inside lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "bi0ta",
            "body": "I second the yak cheese chews. They can be kind of expensive but I often see them at places like Ross/tjmaxx/Marshalls for a little cheaper",
            "score": 1,
            "replies": []
        },
        {
            "author": "wvraven",
            "body": "You can find bully sticks stuffed with a strip of beef cheek on Amazon.  It's the only thing on earth my three year old Newphie can't turn into confetti in under a minute.  I think the brand is Natural Farms or maybe Farm Natruals.   Obviously you may want to consider a bully stick holder to keep your pup safe from swallowing the stub.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bassjam1",
            "body": "Reddit can be a bit extreme on some of these topics.  Bones and hooves are fine for most dogs.  I particularly like antlers, whenever I find sheds in the woods I'll cut them into smaller pieces and give them to my dogs.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ferocioustigercat",
            "body": "I used to freeze bone broth in toppls. Just make sure there are no onions in the broth ingredients (most canned broth has onions) so I either make my own in a instant pot or buy the bone broth from pet stores. I did get the woof treat dispenser, because it came with a little ice maker. That keeps them entertained. But I recently started getting the deer/elk antlers and my dogs basically eat the middle out. They are pretty good at it. I started with the split antlers because they wouldn't full force chew the bone, they would focus on getting the middle marrow part. Then when they got that part, I'd throw the bone out. I figured it was better than my furniture.\nOh, they also have chews that are basically wood. I think little loyals brand or gorilla chews are the ones I had in the past.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Son-of-Anders",
            "body": "I've had really good experiences with coffee wood chews. They last forever, and while they are hard, I feel like they're more forgiving than something like antler.  It doesn't really splinter, but it does leave tons of little rice grain sized wood crumbles.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GoofyGirl_",
            "body": "I agree with a lot of the other comments that bones can be just fine. My border collie is a shredder too. I always prefer to give her the split antlers (not the whole ones) because the marrow is soft enough not to break teeth and it also helps clean her teeth too! Puzzle toys are also great and tire dogs out. I’ll use low calorie training treats or just kibble in puzzle toys/snuffle mats. Frozen kongs and frozen lick mats are also tiresome and can take a while!",
            "score": 1,
            "replies": []
        },
        {
            "author": "whitnia6275",
            "body": "Maybe a toy like a Kong stuffed with treats would be better suited for your dogs. Frozen treats last my dogs a long time. They’re rubbery so still somewhat flexible, but very tough.\n\nJust wondering, where did you hear not to give them chews that aren’t flexible? I’ve not heard that.",
            "score": 1,
            "replies": [
                {
                    "author": "Delicious_Lime6925",
                    "body": "I’ve heard don’t give dogs treats that don’t sink under the pressured your them or fingers. Treats that don’t give under pressure can break their teeth. I am a firm believer. Happened to two of my dogs. Several broken teeth for each tooth.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "_Trinith_",
                    "body": "The recommendation of very many vets is not to give your dog anything that you can’t leave a mark on with your fingernail, with a reasonable amount of pressure. Not “if I press my fingernail into it as hard as I can, it leaves a mark”.\n\nThings that are harder than that can break teeth, which is a problem that’s not only incredibly painful but also incredibly expensive. Ice/ice cubes fall under that category, but frozen treats are fine. As long as you can make the mark with your fingernail.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Happy-Respond607",
            "body": "There is not a safe chew or toy for a dog to use unsupervised while you work, the closest is any sort of stuffable rubber toy, but honestly just enrich your dogs and train them to settle. Any chew used long term with minimal supervision comes with risks that i personally don’t think are worth it. I’d rather spend a day at the beach with my dog than stuffing kongs.",
            "score": 0,
            "replies": []
        }
    ]
}