{
    "title": "Is there anything I can do to help my dog ignore the TV?",
    "author": "urdogthinksurcute",
    "subreddit": "Dogtraining",
    "rank": 136,
    "score": 6,
    "upvote_ratio": 0.72,
    "num_comments (reported by reddit)": 27,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1iiuzze/is_there_anything_i_can_do_to_help_my_dog_ignore/",
    "id": "1iiuzze",
    "selftext": "I recently adopted a chihuahua.  He is extremely disturbed by TV images and, to a lesser extent, voices coming from a computer.  He looks directly at any TV without looking away, and will begin sniffing frantically at the air, running around sniffing, looking behind the TV, and so on.  He seems to think this is some sort of sorcery, people who do not have a scent and disappear from certain angles.  \n  \nHe eventually begins growling and barking, something he never does otherwise.  The only other time I heard him bark is when he was super stimulated by meeting my neighbor's dog, and that was because he was happy and it was an appropriate time to bark. He's never even barked at a vacuum or real people walking down the hallway of my apartment building.  And he seems genuinely distressed/scared by the TV.\n\n  \nThis is not a cute and trivial thing for me.  I'm a cinephile, have been for decades, and film is my main passion and hobby in life.  I watch more than a movie a day on average.  I need to find a way for this dog to accept the existence of the TV.\n\nObviously I could try leaving the TV on, but I live in an apartment complex and a dog barking his head off is not really appropriate.  I can't ignore his behavior, he paces and jumps over me and seems so angry.  Otherwise he's a completely silent dog with some young dog energy but no behavioral issues.\n\nI think maybe he was a stray before we got him and never experienced any technology.  Should I expect him to get over it eventually?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "urdogthinksurcute",
                    "body": "I didn't find anything chill.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Shark8MyToeOff",
            "body": "Look up desensitization training for dogs.",
            "score": 19,
            "replies": [
                {
                    "author": "kylaroma",
                    "body": "This. Screens need to mean treat time. \n\nOP should start small, like a minimized video in the corner of a phone screen.\n\nI would also let the dog see that OP can start and stop it at any time, and check behind it, so he knows it’s safe.\n\nMy service dog is a golden retriever and he was very concerned about our bath tub when he was a puppy, and spent a lot of time looking “under” the bath (ie. At the very bottom, where the floor met the tub surround) while figuring out why there’s water in one per of the room, but not the other",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "PotatoTheBandit",
            "body": "How long have you had him?\n\nI rescued a stray dog and whilst not to the same extent, he would ALWAYS be set off by dogs barking on TV. It really opened my eyes to how often shows and movies have dogs barking in the background that I never usually noticed! He would be running behind and looking for the source as you say yours does.\n\nI didn't do anything specific other than avoid documentaries about dogs at first as I couldn't be arsed with the inevitable drama. It's been a few months and he's now totally unbothered by even the most ferocious barking on TV. I was actually thinking this the other night, he didn't even twitch at some super aggressive and loud dogs barking on TV as he knew it wasn't real.\n\nI think it takes them a while to just get used to the concept of a TV and that the TV will produce all sorts of noises but it's nothing to worry about.",
            "score": 9,
            "replies": [
                {
                    "author": "urdogthinksurcute",
                    "body": "Thanks, i hooe that will happen as well.  We've only had him a few weeks.  The strange thing is he is transfixed and disturbed by the images, and doesn't react to the sounds specifically. I definitely had dogs growing up who would bark if there was a knock or doorbell on TV, but never one that would look at the TV except in a few odd moments before they decide it's not important.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "croix_v",
                    "body": "This could be it, but I’ve had the same dog for 6 years and he still hates the TV he’ll eventually settle and leave it alone but the desensitization has been something we need to upkeep over the years.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "PotatoTheBandit",
                            "body": "Yeah I guess it's different for all dogs. I asked how long they had him because if it was a very short time then they may have hope that it would go away on its own. But also equally might not",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "new2bay",
                    "body": "It used to be doorbells and door knocks with my dog. It wasn’t a huge problem for us, though, and she eventually got over it.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "nebulaespiral",
            "body": "Turn on the sitting with dogs YouTube channel while you shower him with treats. \n\nMy dogs love that channel 🤣",
            "score": 5,
            "replies": []
        },
        {
            "author": "noneuclidiansquid",
            "body": "Narrow it down to if it's the sound or image that gets him going,  \nget yourself a likimat and some of his favourite food,  \nget him used to the likimat so he enjoys it then a couple of days later you start to pair it with the tv,  \nstart by covering up the tv and play it very low sound while he licks - he should have no reacticion, if there is a reaction lift it up on a bench while he is on the floor or use your phone which is small, basically the likimat will make him feel happy and safe and you are looking for him to just continue liking while over a period of several weeks you uncover the tv slowly.  \nYou may need to give him a break from the TV even being on for 2 weeks prior - this is how you train a dog not to react but also change his feelings towards a thing. You have to start with a break from the trigger to lower their stress levels. If you need tv / sound / ect on use head phones to give him a break.\n\nYou have to move at his pace as well I say weeks but it might only take days you do it slowly so he can build up repetition of likimat + tv, which will ultimatly make him enjoy the tv. If he reacts you stop access to the likimat and turn the tv off, take a break for 30 min or so and try again.\n\nThis is how you get dogs used to having their nails done and grooming as well\n\nYou can't punish reaction out of them, you just can't say 'no' and have him stop - you have to make him feel like TV is no issue because currently it's an issue for him.\n\nA trainer in R+ training will help you get your timing right but using this method even if you have bad timing training will just take longer it won't hurt the dog.",
            "score": 3,
            "replies": [
                {
                    "author": "urdogthinksurcute",
                    "body": "Thank you, this is helpful.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "hitzchicky",
            "body": "It's possible over time he'll get over it on his own, although you may have to modify your hobby for a bit. \n\n\nWhen ours was still new she would frequently bark when she heard screaming on the TV or sirens. I'd mute the TV when a scene I knew there'd be screaming came on. Of course, that only works if you already know it's coming. \n\n\nShe still looks at the TV weird when there's sirens, but otherwise she doesn't pay it any mind at all. ",
            "score": 3,
            "replies": []
        },
        {
            "author": "lilmermie",
            "body": "put on bluey",
            "score": 2,
            "replies": []
        },
        {
            "author": "Financial-Bobcat-612",
            "body": "How long has this been going on? Cuz I’d expect he’d get over it eventually.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Manic-Stoic",
            "body": "I feel like this is something the dog will just get used to. It’s new to it now but it will eventually understand. Just give it time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ZebraCard",
            "body": "My dog also watches TV but only reacts to animals on television. I treat it like reactivity training. I will have high value treats with me while watching television and will reward him when he stops barking at the television. Sometimes I have to start with the tv on a lower volume, or pause the show until he calms down. Over time he has gotten much less reactive to the television. You can also give a bone for the dog to chew on or a lick mat, that also helps!",
            "score": 1,
            "replies": [
                {
                    "author": "urdogthinksurcute",
                    "body": "How long have you been doing this without thr behavior going away?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "rebcart",
                    "body": "Please note that we ask people who want to mention being a professional in their comments [undergo verification](https://old.reddit.com/r/Dogtraining/wiki/userflair) before doing so. Otherwise we ask phrases like that to be omitted.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Proper_Jellyfish_",
            "body": "Play something dog friendly for him. And slowly try to desensitize him. My previous dog completely ignored any type of screen but this little one doesn’t, he watches sometimes tv with me and seems quite invested lol\nI like that about him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Euphoric_Bathroom_73",
            "body": "I am having a very similar problem with my 1 yr old blue heeler and really struggling with it. Not only does he growl and bark at the tv, he lunges and tries to scratch / destroy the screen. It’s been a month of this new behavior and I’m struggling to desensitize him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TurnoverOk4082",
            "body": "Turn off the tv.",
            "score": 0,
            "replies": [
                {
                    "author": "urdogthinksurcute",
                    "body": "Pointless comment.",
                    "score": 4,
                    "replies": []
                }
            ]
        }
    ]
}