{
    "title": "Rescue dog disrupting the entire house",
    "author": "PerkisizingWeiner",
    "subreddit": "Dogtraining",
    "rank": 130,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1ijg24k/rescue_dog_disrupting_the_entire_house/",
    "id": "1ijg24k",
    "selftext": "2 years ago we rescued a senior lab-release Beagle who is very sweet and gentle but has a lot of quirks. To put it frankly, she's a very weird dog and even the professional behaviorists we've consulted with have been a little stumped.\n\nThe most obnoxious issue is that she doesn't bark. She *can* bark, because we've heard it a couple of times, but for some reason she chooses not to. So to get our attention she will make noise in any other way possible. Usually this means scratching loudly on anything plastic (like a power strip plugged into the wall) or using her nose to bang around anything left on the floor (baskets, boxes, hard plastic toys, and even our slow cooker, which we have to store on a low shelf since we have no other storage or counter space). \n\nShe does this any time she wants food, which means the banging and clanging starts every. single. morning. at 4 am, then in the afternoon/evening at 3 p.m. and again at 6:30 p.m. (we feed at 5 a.m., 5 p.m. and 8 p.m.). We don't want to encourage the behavior, so we just ignore it. But her stubbornness is unmatched, so we end up listening to her make noise for 1 - 2 hours at a time, often early in the morning and again during work hours. I love her, but this is truly draining my sanity. My husband and I have even boarded her for a couple of days before just to get a full night of sleep...\n\nDoes anyone have suggestions? For excessive barking, the solution seems to be training them on that specific command so they can distinguish appropriate from inappropriate usage. But she picks whatever object is available, so it's not exactly consistent (we do our best to pick up anything on the floor every night, but you'd be shocked by the workarounds she can find). We feed her in different puzzle feeders and she gets plenty of stimulation, so I don't think it's a boredom thing. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "PerkisizingWeiner",
                    "body": "I have looked at the Wiki links for behavior issues (including promoting calmness), but this specific behavior does not fit into any of the categories mentioned. We have worked with professional behaviorists on calmness and problem-solving behaviors, but they do not seem to be related to this issue, as it happens specifically at meal times and we can only ignore or redirect for so long.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "dullbeans",
            "body": "This seems like a really entrenched behavior, so I would do two things: put some management to make sure she doesn't get to \"rehearse it\" any further and train for long term results. \n\nIn terms of management: I think by picking everything up you're on the right track, make the good thing easy, the bad (\"bad\") thing hard. I would rely on that rather than ignoring or scolding (not that you said you did that, but just in case you do any of that). How is she with being crated (with being a former lab-dog I could see it go either way)? My first thought would be to crate her or put her in a puppy pen overnight. I would of course not crate her until she has a strong, genuinely positive relationship with her crate, which might or might not be a realistic option in a reasonable time frame given her history. Otherwise I would put baby gates in front of lower shelves so she can't get to these things. When you're there to supervise, putting her on a leash and tethering her to one of you (or some furniture is a good idea). \n\nIn terms of training: I would \"attack\" training by capturing the desired behavior (lying calmly) and asking her to do something that would be incompatible with banging on pots (how is she with place or stay? you could also do a bunch of tricks in a row with her). My recommendation is to start randomly reward her with treats for lying calmly, just in her place/bed or wherever you think is appropriate (couch, rug, etc.), just capturing whenever she \"offers\" what you want to see. I would avoid places that she resource, if she has a tendency to.\n\nYou can even time some of your training or other activities to be just before she would get agitated. You just have to be very spot-on with the timing, because once's she's in an agitated state, I assume she's hard to break out of it.\n\nAlso, you probably have already been over this with the behaviorists, but here are the questions I had based on your post (maybe one of them can give you a new angle): Are you sure she wants food (you mention she's trying to get your attention, what happens if/when she gets your attention in these cases)? What happens if you offer play or training to her in these situations (either before or after she starts)? How much time do you spend together (both in terms of just coexisting/cuddling and in terms of actively interacting)? You mention puzzles, do you do any social activities with her as well (food games/puzzles that make you an active participant as well, playing, training/free shaping or any dog sports)?  Could it be that she needs more of that? Are there any ways you can tire her out (mostly mentally), things that make her sleep especially well? Could you do some of that timed in such a way that she's more likely to nap at this time (this is obviously tricky with the 5am feeding). Have you considered medical reasons (either physiological like pain or some sort of obsessive disorder)?\n\nJust out of curiosity, is there a reason why you feed her twice in 3 hours in the evening? The reason I am asking is because it can sometimes be weird how long of a chain of events a dog sometimes sees as being part of one long event. A classic example is separation. For example, my dog struggles with separation a bit, she sometimes finds us leaving tricky, so we're trying to de-couple our actual departure and our departure cues (packing our bags, getting ready, showering, etc). But sometimes she can think of us getting ready or showering up to an hour or two before the actual departure as \\_part of us leaving\\_ and is on high alert for the whole time even though we sit with her for a literal hour. In comparison, she often finds it easier if we pack our things and leave (so if we just \"rip that band-aid\", she's often back to sleep within 10 minutes). It is possible that your dog views the whole 5-8:10pm time range as one Big Event, where she's frustrated with how things are going for about 2 hours and 59 minutes of it (rather than two separate 10-minute feeding events). Maybe there's something you could change up about that schedule too.\n\nI hope this helps!",
            "score": 3,
            "replies": [
                {
                    "author": "PerkisizingWeiner",
                    "body": "Thank you for taking the time to reply and offering suggestions - you have given me some new things to thing about!\n\nTo answer some questions:\n\n>How is she with being crated\n\nWe leave her crate door open at all times and she goes in willingly to nap and hang out, but will freak out if we close the door (even if we're standing right there). She will scratch the plastic pan nonstop and use her nails to scratch the bars; it sounds like a prisoner clanging a metal cup across the bars. She will do this to the point of physically injuring herself. We spent a lot of time trying to create a positive association with the crate, but she hates being shut inside. \n\nWe used a baby gate for awhile, but she will also scratch the plastic relentlessly. It sounds like nails on a chalkboard.\n\n>When you're there to supervise, putting her on a leash and tethering her to one of you (or some furniture is a good idea).\n\nWe got a tether leash for potty training, and it's been a pretty good tool. Only downside is that we can't walk very far with her tethered to us, as she becomes dead weight and refuses to move with us 😅\n\n>I would \"attack\" training by capturing the desired behavior (lying calmly)\n\nThis was a suggestion from our trainers and we have been trying to reward her with lots of praise when she is calm. Sometimes this seems to stimulate her more though, making the interaction redundant? The other day I was shredding a rotisserie chicken, and she would normally be going crazy at my feet begging for a piece, but this time she made eye contact, went to her bed, and lied down. I was so proud! So I walked over and calmly rewarded her, but then she got super excited and started going nuts. Is there a better way I should be approaching this?\n\n>make the good thing easy, the bad (\"bad\") thing hard\n\nI really like this mindset. When my schedule was more flexible, I would take her to the park about 30 minutes before mealtime and although she didn't have much interest in walking around, she enjoyed smelling the smells and people watching and she wasn't at home banging around stuff and behaving inappropriately. It was a great routine for awhile, but now I have to work until 5 (at home), so we can't do the park walks until after dinner :/\n\n>Have you considered medical reasons\n\nShe's been checked thoroughly by our local vet practice multiple times, and they have no concerns about her physical or mental health. Of course, she acts like a completely subdued angel every time we're there so I think they think I'm being dramatic about some of her home behaviors...\n\n>Just out of curiosity, is there a reason why you feed her twice in 3 hours in the evening? The reason I am asking is because it can sometimes be weird how long of a chain of events a dog sometimes sees as being part of one long event\n\nI think you are hitting on something really important here that I hadn't considered. We started \"second dinner\" to kill two birds with one stone: she needed to gain weight, and feeding her later at night would initially stop her from waking up so early (we used to feed at 6 a.m. but that time has gradually moved back further and further). It's obviously not working anymore, but if we skip that third meal, she'll wake up even earlier in the middle of the night. The vet has assured she is getting enough calories, so I wonder if it is a psychological thing. I think we will have to start feeding a larger second dinner and cut the third meal, hopefully closing that \"chain of events.\"\n\nThanks again for the advice!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "dullbeans",
                            "body": "Thanks for the answers and context! Yeah the crate is a no-go then!\n\n>This was a suggestion from our trainers and we have been trying to reward her with lots of praise when she is calm. Sometimes this seems to stimulate her more though, making the interaction redundant?\n\nDoes it change things if you do or do not have food as part of that reward? If you this is something you do with food, you can just walk over without a word and non-chalantly drop/place some pieces of kibble to where she is. If you do it without food, I would not walk over, just give some verbal praise in your most soothing voice. Also, one thing to keep in mind when training neutrality, you should also follow a scale of difficulty, like with any other training. So for example, if you like your dog lying calmly on their bed and being neutral to the world, reward it when it's not hard to stay neutral at all (when nothing is happening). For example, my dog used to be very sensitive to noises from the street and she would panic/bark at loud noises. So in the first few weeks we would reward for any calm lying down even if the world was also quiet and not just when noises would occur.\n\nIt's interesting what you're saying about how you used to have the walk-routine before meals and now you don't! It seems like she really liked that routine (people-watching and sniffing is the best!), I wonder if there's a connection there. Do you now go after dinner? I wonder if it would help if you took her for a walk at 5pm and then feed rather than the current feed and walk. Is her morning walk before breakfast? What happens if you take her for a bigger outing on the weekend (maybe even getting home a few hours before dinner), do you see the same behavior or does she have an easier time resting?\n\nThis also made me think about whether she sleeps well/enough (about 14 hours). I'm guessing it's easier for her to hyper-fixate on an upcoming feeding if she's up \"anyway\". If you think that's an issue, maybe seeking some help from the vet there could be worth it.\n\nHang in there and good luck!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}