{
    "title": "Dog keeps pooping inside house",
    "author": "sunshineeemia",
    "subreddit": "Dogtraining",
    "rank": 114,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1ik3egc/dog_keeps_pooping_inside_house/",
    "id": "1ik3egc",
    "selftext": "Hi guys. It’s exactly in the title!\n\nMy dog is 4 years old and potty trained. But lately for the past few months, he suddenly starts pooping inside the house instead of outside.\n\nNow, I did consult with his vet to see if there was a problem. None. He started to now build a habit of pooping in the same spot right by the front door. Here’s the other thing. He knows he is supposed to go outside pooping. And he does… when he wants to. But we stick to a very tight schedule to keep it on routine. \n\nI hate this a lot but whenever we’re outside in the yard, I am out there with him for max 30 minutes… ALMOST AN HOUR. Of course to let him play and take some time. But all he ever does is get distracted by our neighbor’s dogs who are quite viscous. So I usually take him out when they are not there and incorporate a lot of play therapy to get him away from the fence. He has a habit of literally waiting at the fence and looking through to see if they are there.\n\nOnce I feel like its time to go back inside… He instantly poops. These days I have been catching ready to go and I reinforce that by leading him outside to poop. Eventually he does poop outside, and I have started to reward him with treats while outside. I really do try to restrict access indoors. If he doesn’t poop outside and I know he needs to, I keep him in a confined space for a short period before trying again. This prevents him from sneaking off and reinforcing the indoor habit.\n\nBut unfortunately he still keeps doing the same habit when he doesn’t poop outside.\n\nI’m absolutely lost and unsure what to do. I’m not sure if I should block off the area where he usually sneakily poops inside cause that’s basically where he claimed his spot.\n\nShould I keep rewarding him for pooping outside? Please help. I want to get better at improving this. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "sunshineeemia",
                    "body": "I just need advice simply on dog training. After reading the guide, it has nothing related to what I’m relating to. I just need INSIGHT from other dog owners and trainers. Thank you.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}