{
    "title": "Would meeting my neighbours dog stop her from barking at me through a wall?",
    "author": "PurplecakeOwO",
    "subreddit": "Dogtraining",
    "rank": 89,
    "score": 96,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 62,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1iknde5/would_meeting_my_neighbours_dog_stop_her_from/",
    "id": "1iknde5",
    "selftext": "My neighbours dog has had barking issues and I believe anxiety issues and usually barks through the wall at me when I'm in my room making noise. (we share a wall on one side of the house) this is like daily. I understand they probably can't afford to train the dog as they were redoing the house and had a baby, I'm not asking to be told to tell them to train it.\nMy question is would meeting the dog, maybe agreeing with the neighbours maybe I can say her name through the wall after so she recognises it's just me the neighbour? would allowing her to come to my room to like make sense of it being a solution? I know these a bizzare solution but I wanna try and do my part as I am kind of the reason for the problem. any suggestions would help x\n\n(sorry if my post doesn't fit the guide I did read it)\n\n\nOkay, updated information below 👇 \n\nI live in a connected houses rather than an apartment (vv British thing I believe) so we share an entire side of the house plus the garden with them, so my room, bathroom, dining room, kitchen garden.\nIf you make noise in any part of the house that is closest and if she's not either in the active company of someone else (petting playing I think), doing something or eating sleeping, maybe playing not sure, she will run to the closest wall and bark, and bark at any noise. \nI do think the neighbours did try to train her or maybe she was on meds or smth because there was a like good half a year(?) where she was not barking like much at all.\nI understand having a dog like this is very stressful and angering and they do often take out their anger by shouting at the dog, which gets her to stop for like 5 minutes and then if you make a noise again she barks again non stop.\nusually she stops by saying her name and stop and like shush but it's usually only for a minute or 2\nThis has been happening for like 4/5 years, 😭 usually I can drown it out but like because I've quit my job I'm home all the time so she's like always barking and I feel awful because my neighbour it on maternity leave and is focusing on the baby and is home alot and the dog is always barking.\n\nI am going to ask my neighbour if they would be willing to try this and I'm sure they would be down as we have always been on good neighbourly terms and helping them out sometimes x\nI'll probably do it some time this week so I'll probably make an update post? or edit it I'm not quite sure yet \n\nThank you for all the suggestions, I'll ping some comments just to notify about the update x",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "PurplecakeOwO",
                    "body": "yes I still need the help as it is an usual method of training I'm asking for an opinion on",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "restingwitchface22",
                    "body": "I think it’s one of the best ideas. I just got a new small dog (9yrs old) who barks at everything. I have gotten all 5 people in the household to spend a little time greeting him and saying hello and being really kind every time they come in the house and he now does not bark at any of those people where as before he was just wigging out when he heard them. So anything that works toward familiarizing yourself with this dog will be helpful. Also I was told in a training class to try to give or say a special word in a special way (like hello in a falsetto)so that the dog recognizes that specifically to you. I do believe these things help. So glad and impressed that you are approaching this issue with the “how can we make this work” momentum. Let us know how it goes.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "PurplecakeOwO",
                    "body": "wait this is great, I'll probably sound like a mad man to my neighbours but if it works it works lmao, thanks for the suggestion",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ericscal",
            "body": "One of my main methods to address barking at strange noises is to let my dog investigate with me so he can see it's not something scary. They bark at scary unknowns but are also pretty good at learning what's normal. So my thought is just help them learn what the normal noises are.\n\nSo you could tell your neighbors about this idea and let them know that you are willing to help if they want to bring the dog over to investigate what you are up to that is currently scaring them.",
            "score": 56,
            "replies": [
                {
                    "author": "traumakidshollywood",
                    "body": "This is 100%. Plan it so the neighbor is ready. You make a “fake” noise and keep doing it long enough for her to put her dog in the lead and follow the sound. Ultimately, your neighbor can open your door and let go of the lead. The dog will find you giving treats and praise. \n\nThe only potential problem is if the dog falls in love with you. It’ll hear you and want you. The bark will likely be a whimper, which is more easily “un” trained if the owner understands training.  \n\nYour neighbor should love this suggestion. If they don’t you’ll have to contact management. The dog can be trained now, frankly.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "PurplecakeOwO",
                            "body": "this and the one above are what I was thinking about doing hopefully I get some success, I'll probably do it some time in the week, not sure how I'll update it, prolly just update the post x",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "traumakidshollywood",
                                    "body": "Maybe add updates on certain comments so a few commenters are re-notified and it reactivates your original post with an update in it.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "sleeping-dogs11",
            "body": "Likely not. The dog will not associate hearing the noises with meeting you. If it's only been going on for a short time, the dog may acclimate on their own when they realize the noises are normal. Otherwise, it's on the owners of the dog to train or otherwise manage the situation (play soft music, white noise machine, keep dog away from that one wall, etc.)",
            "score": 13,
            "replies": [
                {
                    "author": "PurplecakeOwO",
                    "body": "no hun it's been like 4/5 years 😭😭",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "desertfractal",
            "body": "I have no idea what the answer is but that’s very kind and understanding of you <3",
            "score": 10,
            "replies": []
        },
        {
            "author": "2lrup2tink",
            "body": "If I was the neighbor with the barking dog AND a baby, I would be so grateful for this.  However. You never know what people will say, so be prepared for the unexpected!",
            "score": 6,
            "replies": [
                {
                    "author": "PurplecakeOwO",
                    "body": "we knew their father who lived there before and we are on friendly terms so I'm sure they'll be down for the idea",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "MoodFearless6771",
            "body": "That likely wouldn’t work but I also don’t think it would hurt, so try it. What would work better is [Karen overalls protocol for relaxation](https://www.karenoverall.com/wp-content/uploads/2020/06/Protocol-for-relaxation_Overall.pdf). If you wanted to help, you could offer to minimize sound while they work up to better sound tolerance. Or you could offer to make noise/distractions for them to desensitize or ask if they’d like you to do something to aid them in training her. They could teach her when she hears noise, she gets a cookie until she has a positive association with the sounds.",
            "score": 4,
            "replies": []
        },
        {
            "author": "sicksages",
            "body": "No, she wouldn't be able to put it together. It's just barrier frustration. She wants to explore the sound and can't so she's angry. She doesn't need training, she just needs more play time.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Rubycon_",
            "body": "Idk some dogs are just really really stupid. My friend had a chihuahua that barked and growled like I was an intruder every time I came over, no matter how many years went by. She would be on my lap after a few minutes, but every time I first came over she would bark. And some dogs will bark even if they recognize you if there's a barrier like a fence or a wall",
            "score": 5,
            "replies": []
        },
        {
            "author": "SeaworthinessAny5490",
            "body": "I think meeting sounds like a great idea, and at the very least opens the door to a conversation. The dog owners might have ideas of their own but aren’t sure of how to start the conversation or if you would be willing. They are lucky to have you as a neighbor, this is a kind and thoughtful way to approach this",
            "score": 3,
            "replies": []
        },
        {
            "author": "Happy-Respond607",
            "body": "Most likely no, the first thing you learn in dog training is dogs cannot generalize. If you want a dog to do something in an environment you must train them in that environment. Unfortunately the only solution is for the owners to take the time to train their dog to settle at home.",
            "score": 3,
            "replies": [
                {
                    "author": "Happy-Respond607",
                    "body": "I will say, this is super simple, and can be done without a trainer. So i personally would recommend them looking into “place” and “settle” training, tell them youll help if you want!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "MyFaceSaysItsSugar",
            "body": "No, because the dog is barking at the noise, not you specifically. They need to turn on a tv or radio to cover the noise up or do some counter conditioning training.",
            "score": 2,
            "replies": []
        },
        {
            "author": "phantomsoul11",
            "body": "If they scold the dog, the dog is probably afraid of them. That means she either doesn't bark in their presence or barks much less. Not out of good behavior, but out of fear.\n\nIf the dog is not flat-out suffering from isolation disorder (panic when left alone while the owner goes out), she is being reactive to sounds on your side of the wall and then barking because of barrier frustration, much like a dog barks at the window after seeing another dog passing by. In any case, it's unlikely they will be able to effectively train her out of this behavior on their own if they have been scolding her; she is too afraid of them to be able to effectively focus on any training they provide. Sure she might respond for treats, but then immediately revert as soon as the treats stop, or even just reduce in value, because she's doing it for the treats, but still has the underlying fear of her owners.\n\nI would honestly recommend they engage a veterinary behaviorist for help with the anxiety and/or reactivity. Yes, they are expensive; they're doggy psychologists, and most pet insurance policies do not cover them. But if they claim they don't have the money for it, then I would advise them to consider rehoming the dog to someone who does have the resources to meet her needs, and perhaps avoid getting another dog until they have their finances in enough order to meet any special needs that may arise, such as this. Frankly, mental health concerns are not just for people, but our pets as well.\n\nOf course, if they're not cooperative - which I suspect they probably won't be - then I would go to management complaining, repeatedly. It's not fair to you or the dog to be left barking like this all the time, especially in connected housing with shared walls.\n\nGood luck!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Thog13",
            "body": "Well, if it were my dog doing that, I would be overjoyed to have a neighbor willing to work together to try to fix the problem.  Some dogs are just... complicated.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Hostastitch",
            "body": "This has worked for neighbors on my one side, but not the other.\n\nAre you a dog lover? The dog might enjoy coming over and getting treats!",
            "score": 1,
            "replies": [
                {
                    "author": "PurplecakeOwO",
                    "body": "no I'm actually kind of allergic to dogs lol, and kind of scared of them too 😭",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Hostastitch",
                            "body": "Darn!! My dog is now obsessed with my neighbor and waits at his door every time we pass in hopes of being invited in!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Detroiter4Ever",
            "body": "Probably not. I have a reactive dog that's protective of me. She barks at my fiancé when he comes home and we all live together.",
            "score": 1,
            "replies": [
                {
                    "author": "stonerbbyyyy",
                    "body": "my dogs bark at my husband because they’re excited to see him! they can hear his truck probably from the stop light down the road. i can hear it from about 5-6 houses down. but they’ll start barking right around the time he gets to our direct neighbors driveway. every day when he gets home. \n\nit’s not an aggressive bark. \n\nmy dogs have different barks for different people/animals/scenarios so it helps to recognize them and correct *certain* behaviors. i’m not gonna tell my dogs to stop barking because they’re happy to see my husband. i will however stop them from barking at the neighbors or the quiet couple that walks their pitbull the same route, the same time, every single day.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Detroiter4Ever",
                            "body": "I totally understand what you mean about different barks. My little one is totally on the protective side. We live in a loft condo and try to keep the barking to a minimum since we have neighbors on both sides and above us.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "stonerbbyyyy",
                                    "body": "yeah one of our dogs has a soft little bark bc we used to live in an apartment. we call it his whisper.\n\nnow we own our house and idgaf if my neighbors hate me tbh",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Dreamsnaps19",
                    "body": "This has happened to me a couple of times. Especially if I’m in an area she’s not expecting like the backyard \n\nAnd it’s like, it’s me you idiot why are you barking. And then she looks at me confused, like how did you get there!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "tamescartha",
            "body": "I give my dog rotisserie chicken when she meets people she’s scared of. Works pretty good to desensitize her.",
            "score": 1,
            "replies": [
                {
                    "author": "PurplecakeOwO",
                    "body": "hahaha brilliant, how could I apply that with my neighbours dog 😭 invite them round then hand the god a chicken in my room to desensitize her to me? that would be a really funny solution tbh",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ivorwen1",
            "body": "It might take more than one visit, but it might work, if you can get to the point where the dog both knows the sound of your voice and trusts you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Manic-Stoic",
            "body": " Couldn’t hurt.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Crabulousz",
            "body": "From what it sounds like, the dog won’t know it’s you making the noise so it would be unlikely unless she could see or smell you, or you’re gonna shout her name so she learns it’s associated with you but that would be a whole lot of effort for unlikely gains. \nMeeting her is worth a go tho as the more experiences a dog gets that are positive, the less scary the world becomes, so could help normalise the noise for that reason.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PotatoTheBandit",
            "body": "It won't guarantee it but it certainly wouldn't hurt!\n\nMy dog went crazy at the neighbour dog walking past so we arranged a few meets and he eventually loved that dog. But then once he knew who the dog was walking past, he still barked but it was more of an excited bark rather than a fearful bark.\n\nOn the other hand - my dog sometimes barks if someone enters the home and he was caught off guard. If it's me, I just call to him to let him know it's only me and he quiets instantly and comes to greet.\n\n So this sounds like a great thing to try out!",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 0,
            "replies": [
                {
                    "author": "rebcart",
                    "body": "Please read the sub [rules](https://old.reddit.com/r/Dogtraining/about/rules) and [guidelines](http://old.reddit.com/r/Dogtraining/wiki/guidelines), as well as our wiki page on [punishment](https://old.reddit.com/r/Dogtraining/wiki/punishmentproblems).",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MaintenanceSea959",
            "body": "It might help. Associate it with a verbal greeting and a treat. Several times, so that the dog thinks of you asa friend.  My neighbor got my yappers by calling over the fence and telling them to go to bed.  I taught her to do that. \n\nWhen she left, the new neighbors had a beautiful Chesapeake retriever that stopped habitual barking when I made a tradition of calling him by name and handing him a large dog biscuit through the knothole in the fence. I knew he was ready for a treat when I saw his big nose sticking through the hole. Never another bark from my pal Tahoe. \n\nIt didn’t work, however, with the fight- trained pitbull in the other neighbors yard.   That one got out and killed a pet cat down the street. Incorrigible.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SilverLabPuppies",
            "body": "Yes get your voice snd scent in their apartment do pup is socialized to you. Visit once a week bring or give one of their treats. It will decrease pups anxiety/barking. Learn his/her name and call out “it’s okay ___, It’s me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "EARoden",
            "body": "How well do you know your neighbors? You have to start there. They may allow you to dog sit or not!",
            "score": 1,
            "replies": []
        },
        {
            "author": "RockyShoresNBigTrees",
            "body": "My dogs bark at me if I just walk outside and back in. They are just so happy to see me after the 5 minutes I was outside.",
            "score": 1,
            "replies": []
        },
        {
            "author": "variablecloudyskies",
            "body": "Maybe?  But maybe not. I have lgds and we have neighbors that ride their side by side up the easement. No matter HOW MANY TIMES they did this one of my lgds never got used to it. They had even been over, so not like they were total strangers. Loki was NOT having it. He’s loose his mind every single time and run that whole fence line like a devil. \n\nI wound up relocating the fence line back 100’ and that’s solved the entire issue. \n\nMy point is it’s my issue. I’m sure my neighbors did not like having his 120 pound ass looking like he was ready to tear something g to pieces every time they went up their own easement. So I solved the issue before it became a much bigger one. Just familiarity didn’t fix it with Loki. It did with the other two though",
            "score": 1,
            "replies": []
        },
        {
            "author": "cheesiegorditacrunch",
            "body": "I think this is a really thoughtful idea, and a super generous reaction to the situation. One flag- especially if they’ve been redoing their home and have a baby (and a barky dog!), their nerves may be fried, and I could see a world where they feel attacked by the suggestion.  \n\nCould you fib a reason to go over just to say hello and casually interact with the dog? And maybe playfully address the dog, like “hi! I’m the one you must hear on the other side of the wall” - maybe pretend it’s your fault for bothering them, to open the door for a convo?.. \n\nAs someone with a very noisy dog (who I’m working tirelessly to train), I’d be pretty receptive to something lighthearted like that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SparkleAuntie",
            "body": "We had workers in our basement fixing our water system. Our dog could hear them through the floor and was losing her mind. One of the workers asked if they could come up and meet the dog so she would calm down. Totally worked. She recognized that if I was ok with these guys, everything was fine and she was quiet the rest of the day.\n\nI think your idea could work as long as the dog is able to put two and two together. It needs to recognize that you’re the sound on the other side of the wall and that you’re allowed to be there.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Loud_Law_6418",
            "body": "Probably, when you are butt and ear scratching be sure to tell the dog its a good dog over and over so when the dog does bark you can holler back in you best your a good dog voice, be a good dog.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CommanderGO",
            "body": "No. All of the dogs in my neighborhood bark at my dog whenever we walk past their house, and I've walked my dog by these houses almost every day for 2 years. Although, the other dogs might not be familiar with my dog because she doesn't bark back.",
            "score": 1,
            "replies": [
                {
                    "author": "phantomsoul11",
                    "body": "This is true, but a properly exercised dog will be too exhausted to keep it up for hours on end. That dog is either panicking (separation anxiety) or bored (barrier frustration after hearing a sound she wants to investigate). If the dog is properly exercised and stimulated and you stop making the triggering sound, the barking should subside quickly, just as such a dog stops barking at the window after the other dog passes.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Unusual-Ad-5489",
            "body": "One of my dogs barks every time my son came out of his room.  He loves my son. Don’t know what the dog’s deal is. Good luck resolving this.",
            "score": 1,
            "replies": [
                {
                    "author": "PurplecakeOwO",
                    "body": "that defo sounds like an excited bark more of a fear bark which seems what my neighbours dog is barking like",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "chubbycat96",
            "body": "Toss a treat to her and walk away. Multiple times. Don’t give eye contact and over time she will associate you with good things :?",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "rebcart",
                    "body": "Please read the sub [rules](https://old.reddit.com/r/Dogtraining/about/rules) and [guidelines](http://old.reddit.com/r/Dogtraining/wiki/guidelines), as well as our wiki page on [punishment](https://old.reddit.com/r/Dogtraining/wiki/punishmentproblems).",
                    "score": 1,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Cursethewind",
                                    "body": "What do you mean by \"correction\"?\n\nCorrections break our rules as correction means positive/additive punishment in dog training circles.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Cursethewind",
                                                    "body": "Then spell out the steps instead of using the term \"correction\".\n\nMost people who use this word in response to an unwanted behavior don't mean positive reinforcement because this term means adding a stimuli to *increase* a behavior, which will not reduce your barking.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Closetpunkrocker",
            "body": "If they have a new baby, gift them a white noise machine. Helps calm babies, but also helps the dog not hear random noises. Or try putting one on your side of the wall and see if it helps dampen the noises you make - especially if the dog barks when you close drawers, close doors, or any other thumping noises (that’s what my dog barks about - startles him).",
            "score": 1,
            "replies": []
        },
        {
            "author": "Deathbydragonfire",
            "body": "My trick for the barking dog for me was treats.  Throw them over the fence, that way they break the barking and start looking for treats instead.  People think giving a treat will reward the barking but they don't actually think that way, they will just associate you with good things and by causing them to sniff the ground it engages them in a different behavior.",
            "score": 1,
            "replies": []
        },
        {
            "author": "xthatwasmex",
            "body": "They are training the dog to bark, by using angry noises and shouting - that just reinforces that the noises ARE scary and you SHOULD use noise to scare it away. Instead, they should tell her \"I got it, go lie down\" in a calm manner and reward her for go lie down. \n\nThere are a lot of alternative behaviors that the dog can do instead. If they figure out what they want the dog to do, they can train and reward that behavior and make it more likely to happen instead of barking. \n\nUntil they have the time to train it, white noise or classical music to drown out any noise you might make + general stress reduction would work. Catching the behavior before she has the chance to bark, and redirect, is how to get rid of it - but they can at least not reinforce the unwanted behavior by joining in, and controlling the environment to make it less likely to happen. The clue is to not \"train\" the dog to bark more than she already is - to reduce that behavior and reward the alternative.",
            "score": 1,
            "replies": []
        }
    ]
}