{
    "title": "My dog gets anxious when baby cries at night",
    "author": "PiePrestigious",
    "subreddit": "Dogtraining",
    "rank": 43,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1inpzto/my_dog_gets_anxious_when_baby_cries_at_night/",
    "id": "1inpzto",
    "selftext": "Ever since my 8 month old has transitioned into his own room/crib at night my dog has been extremely anxious when he cries. If my son makes even a peep my dog is whining for my attention (which wakes us up all night). Once I go to open the door to his room, my dog will scratch at the door and run in ahead of me to sniff the baby through the crib. My dog is very normal around the baby at all other times even when baby cries outside of the room during the day. It seems to only happen at night when his door is closed. We tried to keep his door open but my dog still whines excessively when the baby cries causing him to fully wake and I also don’t feel comfortable allowing him to be at face level with baby without supervision. What can we do to train him to stop? ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "PiePrestigious",
                    "body": "i can't find any information on this subject i am not sure if this is considered seperation anxiety if it only happens at night in a seperate room? None of the tips match the situation.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}