{
    "title": "Great Pyrenees Afghan hound mix training help",
    "author": "PineappleFun1412",
    "subreddit": "Dogtraining",
    "rank": 40,
    "score": 3,
    "upvote_ratio": 0.6,
    "num_comments (reported by reddit)": 17,
    "url": "https://www.reddit.com/r/Dogtraining/comments/1intwd2/great_pyrenees_afghan_hound_mix_training_help/",
    "id": "1intwd2",
    "selftext": "I have let my dog roam as he pleases because he stays in a general area I’m aware of. Recently my neighbor told me he’s been terrorizing them, he has been doing this for the 2 years he’s been alive and I had no idea. He chases their kids, he digs under their chicken coop and destroys property. They finally gave me the details of his nonsense this morning. He loves walking around our yard and laying down in the sun and listening to the outside. I’ve been trying to plan how I’m going to train him to live a life where he isn’t free to roam. \n2 walks a day, only allowed outside while supervised, training session mid day if I’m home and enrichment if I’m not. \nI need tips on how I’m gonna keep him happy while not letting him be free outside all he wants. Im mostly worried because he has been doing th same thing for so long.  this will completely change his schedule and he loves his creature comforts like everyone else. His is being able to take multiple hour naps in the dirt outside and I don’t want to watch him do that. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Your post requires review. In order to be reviewed you must follow [THIS APPROVAL GUIDE](https://old.reddit.com/r/Dogtraining/wiki/guide) and respond to this Automoderator comment as instructed by the guide. If you do not respond within 24 hours we will assume you no longer need advice and the post will be removed. If the app is broken and won't let you view the guide, use a web browser. \n\nThank you for your patience as we get through the modqueue. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Dogtraining) if you have any questions or concerns.*",
            "score": 1,
            "replies": [
                {
                    "author": "PineappleFun1412",
                    "body": "I see you have opinions on off leash dogs. This is something similar but not what you might think. We live in a rural area where all the neighborhood dogs roam. My dog is losing that privilege I need help with his transition into a new way of life.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Greigebananas",
                    "body": "I'd look at canine enrichment groups on Facebook for ideas of how to keep them active indoors and tire them out. high energy dogs can find themselves on crate rest due to injury so people have been forced to figure out ways to manage sudden changes in activity levels! \n\nIt seems like you want to do what's best for your dog and I'm glad you're not letting your dog still go at the neighbours. \n\nSupervised long line time could also be an idea. Be careful about no accidents whilst tied out though",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "lilsassprincess",
            "body": "Get a fence. I live on 45 acres in a rural area. My dogs (Pyrenees mix and border Collie mix) do not have free roam when unsupervised. We have about an acre closed in with 5ft goat fencing and cedar posts where they are free to roam as they please. They get daily walks to fulfill their enrichment needs, plus added enrichment through trick training, scent work, chews, etc.",
            "score": 19,
            "replies": []
        },
        {
            "author": "floofelina",
            "body": "Do you have a fence?",
            "score": 6,
            "replies": []
        },
        {
            "author": "Otherwise-Winner9643",
            "body": "Put in a solid high fence that keeps him in your yard",
            "score": 6,
            "replies": []
        },
        {
            "author": "Otherwise_Mix_3305",
            "body": "Fence your yard.",
            "score": 6,
            "replies": []
        },
        {
            "author": "MaintenanceSea959",
            "body": "My parents had an Afghan hound in the 50s. Took him along on rides in the desert- magnificent looking dog, but not the brightest. Parents lived in an agricultural area; a herd of sheep were installed in a field across the road. Taj, being a sight hound (chases prey), went across the road, leaped the fence, killing 6 sheep, injuring 30 others.  Parents were billed several thousand $$ for damages. \n\nTaj was sent to the San Diego Humane Society; he was rescued and thereafter won awards in dog shows. \n\nIf your dog exhibits Afghan traits, as well as having a lighter Afghan body type, your fence should be more than 5’ high.",
            "score": 3,
            "replies": [
                {
                    "author": "Cautious-Ball-6334",
                    "body": "Goodness, gracious killing six sheep and entering 30 more that is crazy. I’m not even pitching this dog riding my head. I don’t even have no idea what this bear looks like.!!!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Cautious-Ball-6334",
            "body": "It really sounds like to me that your neighbors just need to move that would solve a lot of your problems.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bi0ta",
            "body": "Have you thought about a long line staked into the ground? You could get a 30 or 50 foot line you can put him out on so he can still get his dirt naps in without being able to leave your yard. You could also fence a portion of the property that you want him to be in. Otherwise, just experimenting with his walk length and intervals until it seems like he is fulfilled along with the enrichment you mentioned.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Smoothe_Loadde",
            "body": "Depending on how dominant the Afghan is in his genetics, good luck with your endeavors.  Only dog I ever gave up on was a purebred Afghan Hound.  Beautiful, but headstrong and dumber than dirt.   Ended up giving him away, a thousand dollar show dog back in the 80’s. The lady I gave him to entered him in shows at least locally, and I think he did well.  She had fun, and I ended up with a half block lab, half golden retriever a few years later.  Magic dog. Win win.",
            "score": -1,
            "replies": []
        }
    ]
}