{
    "title": "'Reboot' Revealed: Elon Musk's CEO-Dictator Playbook",
    "author": "b01sh3v1k",
    "subreddit": "socialism",
    "rank": 452,
    "score": 232,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.thenerdreich.com/reboot-elon-musk-ceo-dictator-doge/",
    "id": "1ij3tce",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This is a space for socialists to discuss current events in our world from anti-capitalist perspective(s), and a certain knowledge of socialism is expected from participants. **This is not a space for non-socialists.** Please be mindful [of our rules](https://reddit.com/r/socialism/about/rules) before participating, which include:\n\n- **No Bigotry**, including racism, sexism, homophobia, transphobia, ableism...\n\n- **No Reactionaries**, including all kind of right-wingers.\n\n- **No Liberalism**, including social democracy, lesser evilism...\n\n- **No Sectarianism**. There is plenty of room for discussion, but not for baseless attacks.\n\nPlease help us keep the subreddit helpful by reporting content that break r/Socialism's rules.\n\n______________________\n\n&#128172; Wish to chat elsewhere? Join us in discord: https://discord.gg/QPJPzNhuRE\n    \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/socialism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Containerstorejams",
            "body": "\"But the new regime must perform the real functions of the old, and ideally perform them much better.\"\n\nThis is where the whole thing falls apart. None of these Trump loyalists, or Lil Muskies, or whoever they want to install to supplant the core of rank and file civil servants will be able to do any of the routine functions of career employees. Trump and Musk can't even run their own companies well, much less a federal administrative bureaucracy. \n\nWith every \"unnecessary and wasteful\" department they chop, they will discover that there was a practical reason for it's construction in the first place, usually to address a problem. \n\nThey will soon find out what those problems were when they return with greater force onto a class of lackeys that are unprepared, untrained, and unwilling to understand the challenge.",
            "score": 57,
            "replies": []
        },
        {
            "author": "Kal-Elm",
            "body": "I've been reading up on NRx and Yarvin and checking out his writings. It's actually quite interesting to pick apart his methodology. Not because I think their end goal is correct, but because many of their critiques seem to borrow a lot from leftism.\n\nThere was an interview with Vance pre-2020 where he described some of his thoughts. He didn't use buzzwords like \"deep state\" and \"woke.\" He actually explained how he thought the structures of liberal power created a dynamic that hurt every day people.\n\nNow obviously they're still off-base. They're ultimately a populist movement that's passionate about anti-bureaucracy, and free speech, and restoring communities (by encouraging religion and \"old-fashioned\" values). But here's the thing. The left needs to take notes. \n\nThese people are addressing real-world people's real-world concerns, and they're packaging their message in real-world language. The left could learn a thing or two from that. People are more receptive to that message than a lot of people realize - but you have to sell it to them in their native tongue, not the academic vernacular that so many use. Delivery matters.",
            "score": 0,
            "replies": []
        }
    ]
}