{
    "title": "Would I be facilitating an ICE Raid?",
    "author": "Formal-Pilot7014",
    "subreddit": "socialism",
    "rank": 419,
    "score": 101,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 27,
    "url": "https://www.reddit.com/r/socialism/comments/1ikwx0m/would_i_be_facilitating_an_ice_raid/",
    "id": "1ikwx0m",
    "selftext": "I apologize if this is off-topic but I am a Marxist and I do find this to be an ethical/moral dilemma.\n\nIm a paramedic and one the agencies I work for frequently does law enforcement standbys for SWAT raids. I have issues with having to go on those but we frequently don’t get info on what the raid is for.\n\nThere have been talks of coming ICE raids on undocumented peoples in my area soon and its possibly they would used my agency for EMS standby. I have reasoned that I will not do such a thing and will refuse to go. This wouldn’t stop the raid of course or even my agency from being able to fill the standby but I just don’t wanna feel complicit but maybe I already am?\n\nDoes anyone have thoughts on this?\n\n",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This is a space for socialists to discuss current events in our world from anti-capitalist perspective(s), and a certain knowledge of socialism is expected from participants. **This is not a space for non-socialists.** Please be mindful [of our rules](https://reddit.com/r/socialism/about/rules) before participating, which include:\n\n- **No Bigotry**, including racism, sexism, homophobia, transphobia, ableism...\n\n- **No Reactionaries**, including all kind of right-wingers.\n\n- **No Liberalism**, including social democracy, lesser evilism...\n\n- **No Sectarianism**. There is plenty of room for discussion, but not for baseless attacks.\n\nPlease help us keep the subreddit helpful by reporting content that break r/Socialism's rules.\n\n______________________\n\n&#128172; Wish to chat elsewhere? Join us in discord: https://discord.gg/QPJPzNhuRE\n    \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/socialism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "ItsNotACoop",
            "body": "If it were me, I would ask: 1) Would my refusal reduce the quality of care an injured immigrant would receive? 2) Would my refusal cost me my job, preventing me from supporting my family and preventing me from providing quality, compassionate care in the future?\n\nIf yes, I would feel obligated to participate. \n\nIf, however, my refusal to participate would prevent the raid from happening, then I would do that. Seems like this isn’t the case, but maybe you could try and organize your coworkers around this?",
            "score": 129,
            "replies": [
                {
                    "author": "ArmoredSaintLuigi",
                    "body": "These two questions to me make the most sense. If the raid is going to happen anyways, you may be the one person who could try to save one of their lives. If I couldn't stop the raid from happening at all, I'd say least want to make sure it goes as best it can and raise hell if it doesn't...",
                    "score": 20,
                    "replies": [
                        {
                            "author": "ItsNotACoop",
                            "body": "Definitely. No one involved in the raids gives a flying shit about these people. If the raid is going to happen whether OP is there or not, having a medic on hand that cares could easily be the difference between living and dying for someone if shit goes awry.",
                            "score": 13,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Vevtheduck",
                    "body": "Thanks for posting this - it's a really well reasoned position.\n\nI think in part, OP and so many others should grapple with by living in the US, many of are complicit by our actions. It is really hard to purchase entirely ethical, or union, or away from some big billionaire that makes a profit from us. Each and every day *most if not all* of us contribute in ways big and small. The goal here shouldn't be a depressive state that results from our complicity but rather, how much of our agency can we direct at reducing harm, resisting fascism, and pushing society past capitalism's evils. (In my own opinion, in that order). \n\nAs an EMS, your care in such a situation could be lifesaving, OP. It could be the caring touch that will save a life that otherwise wouldn't happen. I would argue that you have a huge power here to make a difference in that small moment.\n\nBut the ability to interrupt the ICE raid? Huge. Is it possible for you to tip off the target community? You shouldn't do this directly or through electronic means. Do you have connections and friends that you trust that you could speak verbally to that could alert targets? This could also be life saving. I would suggest being *very* careful about that process.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Objective-Try7969",
            "body": "There was this scene in station 19. That if an undocumented escapes an ambulance that they aren't cops and there's really nothing they can do 🤷🏻‍♀️ rebellion is needed. Malicious compliance is the way to go",
            "score": 47,
            "replies": [
                {
                    "author": "CalendarThis3912",
                    "body": "This. Leave the cuffs unlocked. Leave the door unlocked.",
                    "score": 24,
                    "replies": []
                }
            ]
        },
        {
            "author": "XxGrillfackelxX",
            "body": "Better that you make money on this rather than a fascist with no qualms. Be the best ally you can, feed relevant info about police procedure or coming raids to local orgs, give the victims a flyer of their rights, help as much as you can. You have now become a counter-intelligence agent for the antifascist resistance.\n\nEdit: n",
            "score": 22,
            "replies": []
        },
        {
            "author": "Excellent_Valuable92",
            "body": "Do you have a union? Ask them to back you up in refusing to participate. ",
            "score": 21,
            "replies": [
                {
                    "author": "Dai_Kaisho",
                    "body": "1000% We don't have to comply with the cruelty. We don't just have to allow deportations to happen and just do individual things to make them as kind as possible. We can STOP them by being organized together.\n\n\n\n\nTalk with coworkers and classmates, the people you share the most time of your life with. what kind of meetings and signage and creativity can you put together to make sure your community has the time, knowledge and space to be safe? \n\n\nTrump and Elon sure as fuck aren't following the rules, why should we? The more people who understand that we don't have to comply, and are prepared to stop it together, the sooner we can reject them as frauds.",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "Komischaffe",
            "body": "Are you able to leak information about upcoming raids to local organizations?",
            "score": 14,
            "replies": []
        },
        {
            "author": "fxkatt",
            "body": "You know all that makes up your context than any of us do, but a couple questions:  1) will you risk losing your job? 2) will this be covered somewhere in the media?  If the answer to the first is \"yes\" then the second answer should probably also be \"yes.\" But if you don't think your job is in jeopardy, then you can just refuse the assignment-- the story would probably not be covered, but it would influence some others around you, I wd think.",
            "score": 23,
            "replies": []
        },
        {
            "author": "John_Philips",
            "body": "They want you to be apathetic. They want you to stand by and just let it happen. I promise you, it’s not going to stop with immigrants. We must continue to stand our ground for what’s right",
            "score": 8,
            "replies": []
        },
        {
            "author": "The_Conquest_of-Red",
            "body": "You’re a paramedic AND a potential witness. I‘d want you there if I were the target.",
            "score": 8,
            "replies": []
        },
        {
            "author": "MaxSucc",
            "body": "I wouldn’t but I don’t know your situation so i can’t say too much on it",
            "score": 5,
            "replies": []
        },
        {
            "author": "bethezcheese",
            "body": "Sorry you have to make this decision. All I can say is that I wouldn’t criticize you regardless of what you decide to do here.",
            "score": 6,
            "replies": []
        },
        {
            "author": "freedom_viking",
            "body": "I don’t really think your doing too much harm at all if your just providing medical assistance",
            "score": 3,
            "replies": [
                {
                    "author": "Dai_Kaisho",
                    "body": "I see where you're coming from, but Elijah McClain should be with us today.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "freedom_viking",
                            "body": "I don’t think cops can force paramedics to overdose already restrained people with ketamine shame the people involved with that didn’t get more time but I’m assuming OP is better than that",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Dai_Kaisho",
                                    "body": "Point is, just doing our job can put us in evil places. That's capitalism.\n\nDeportations are not something you 'improve' by being a good guy in a bad system.\n\nOP and the rest of us should be talking about how to shut them down, how to prevent and delay them, how to strike,  how to inform and prepare our coworkers and communities.\n\nFor all of us, this month is the warmup. changing it will require not going along with what the bosses have planned for us.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Manmeat79",
            "body": "Gather intel, if possible give the victims as much warning as possible.",
            "score": 1,
            "replies": []
        },
        {
            "author": "tender-majesty",
            "body": "Being present while genuinely caring is an equally radical option, I'd say —",
            "score": 1,
            "replies": []
        },
        {
            "author": "Throwaway7652891",
            "body": "If you do get any info in advance you can find ways to warn people, then stand by as you don't have anyone to save on a lucky day.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fragrant-Survey-3258",
            "body": "As i see it your paramedic work is non political,",
            "score": 0,
            "replies": []
        }
    ]
}