{
    "title": "I think that accelerationism is the only way for a workers revolution in the US",
    "author": "Kateshaian",
    "subreddit": "socialism",
    "rank": 284,
    "score": 0,
    "upvote_ratio": 0.29,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.reddit.com/r/socialism/comments/1is3lp9/i_think_that_accelerationism_is_the_only_way_for/",
    "id": "1is3lp9",
    "selftext": "(Sorry if theres gramatical errors, im not so good with english)\nSo, i believe that the only way to have a bif chance to stop fascism, is to force the US economy to collapse massively, because i believe that if theres a economy collapse then the working class in the US would radicalized more into left leaning, if the communist and socialist take advantage of it",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This is a space for socialists to discuss current events in our world from anti-capitalist perspective(s), and a certain knowledge of socialism is expected from participants. **This is not a space for non-socialists.** Please be mindful [of our rules](https://reddit.com/r/socialism/about/rules) before participating, which include:\n\n- **No Bigotry**, including racism, sexism, homophobia, transphobia, ableism...\n\n- **No Reactionaries**, including all kind of right-wingers.\n\n- **No Liberalism**, including social democracy, lesser evilism...\n\n- **No Sectarianism**. There is plenty of room for discussion, but not for baseless attacks.\n\nPlease help us keep the subreddit helpful by reporting content that break r/Socialism's rules.\n\n______________________\n\n&#128172; Wish to chat elsewhere? Join us in discord: https://discord.gg/QPJPzNhuRE\n    \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/socialism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "BlouPontak",
            "body": "Well, then you must love the way it's currently going. \n\nThat said- unless there's a strong socialist movement,  there will only be meaningless suffering, and nobody will be able to mobilize it into social change. \n\nI think there's a great opportunity here- nothing lays bare the class struggle like how openly these people are acting. So now's the time to mobilise and unite and do grassroots work to build a movement",
            "score": 17,
            "replies": []
        },
        {
            "author": "jshrdd_",
            "body": "No. Because right wing groups and outright fascists will also make appeals to the working class and win chunks of them over. Evidence: history,  Italy and Germany as two examples. \n\nI'm just some dude working a shit job so I don't know the balance of forces between socialist groups and right wing groups but I don't think we have the large enough infrastructure and organization advantage just yet. Plus a bunch of right wing asshats and millionaires/billionaires control the US govt right now.",
            "score": 9,
            "replies": []
        },
        {
            "author": "mowey44219",
            "body": "If we were organized enough to collapse the US economy we would've done it already. That's called a general strike.\n\nPeople call for a general strike every day on this website, it's not happening because we keep looking for top-down shortcuts to building a mass independent workers' party. Many of the people posting about a general strike or intentionally crashing the economy have never even talked to a coworker about unionizing, nor done outreach for a political organization.\n\nThe problem isn't reform vs acceleration, it's that the working class isn't organized enough to wield its power over production in any coherent way.",
            "score": 2,
            "replies": []
        }
    ]
}