{
    "title": "Discussion: Leftists on Russia",
    "author": "davinjones",
    "subreddit": "socialism",
    "rank": 135,
    "score": 93,
    "upvote_ratio": 0.82,
    "num_comments (reported by reddit)": 96,
    "url": "https://www.reddit.com/r/socialism/comments/1iy5ji1/discussion_leftists_on_russia/",
    "id": "1iy5ji1",
    "selftext": "I’ve seen an uptick in leftists defending/supporting current day Russia, mostly under the context of Russia/Ukraine and a certain connection between Ukrainian military and a storied far-right group (don’t wanna use the word in case that would flag this post). Obviously USSR is a different case entirely than modern day Russia but I was curious how others felt about the country and their politics today. Personally, I think that ever since Gorbachev the country has moved farther and farther into the same realm as capitalism, even so far as setting the groundwork for oligarchy so I’m a little confused as to why I’ve seen so many self-proclaimed socialists talking in support of Russia and was hoping for some clarity.\n\nSide note: my views on China are very different than my views on Russia.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This is a space for socialists to discuss current events in our world from anti-capitalist perspective(s), and a certain knowledge of socialism is expected from participants. **This is not a space for non-socialists.** Please be mindful [of our rules](https://reddit.com/r/socialism/about/rules) before participating, which include:\n\n- **No Bigotry**, including racism, sexism, homophobia, transphobia, ableism...\n\n- **No Reactionaries**, including all kind of right-wingers.\n\n- **No Liberalism**, including social democracy, lesser evilism...\n\n- **No Sectarianism**. There is plenty of room for discussion, but not for baseless attacks.\n\nPlease help us keep the subreddit helpful by reporting content that break r/Socialism's rules.\n\n______________________\n\n&#128172; Wish to chat elsewhere? Join us in discord: https://discord.gg/QPJPzNhuRE\n    \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/socialism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "FoodForTh0ts",
            "body": "I think a lot of people on here believe that any check on US/Western power is a good thing. I seriously doubt any sane socialist has any illusions that Russia isn't extremely capitalist.",
            "score": 223,
            "replies": [
                {
                    "author": "davinjones",
                    "body": "This makes a little more sense to me. I was working off the assumption that these people actually have a complex argument and in reality it’s probably just this",
                    "score": 28,
                    "replies": [
                        {
                            "author": "FoodForTh0ts",
                            "body": "Yeah it pretty much boils down to \"the enemy of my enemy is my friend.\"",
                            "score": 31,
                            "replies": [
                                {
                                    "author": "Dai_Kaisho",
                                    "body": "Which we all need to realize is not how we get to socialism.",
                                    "score": 25,
                                    "replies": [
                                        {
                                            "author": "FoodForTh0ts",
                                            "body": "Yeah if you even suggest applying the same logic domestically you'll get called a lib but supporting what is arguably the most capitalist country in the world in a war of conquest is fine lol",
                                            "score": 8,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "bort_jenkins",
                            "body": "Just want to add that leftists oppose nazis, and ukraine has a nazi problem, see azov",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "davinjones",
                                    "body": "I mean you’re preaching to the choir here but I also don’t think Russia should be getting “morality points” for fighting Nazis (especially considering that isn’t one of the reasons why the conflict is even happening).",
                                    "score": 32,
                                    "replies": [
                                        {
                                            "author": "bort_jenkins",
                                            "body": "Completely agree. Not making the claim that russia is in any way socialist or communist, just wanted to add to why leftists might be weighing in against ukraine",
                                            "score": 9,
                                            "replies": []
                                        },
                                        {
                                            "author": "Commie_nextdoor",
                                            "body": "That is one of the reasons that the conflict is happening. From the Russian perspective, the breakaway regions (which are ethnically Russian) were treated badly by the fascists after voting to leave Ukraine in 2014. Again \"from the Russian perspective\", not saying whether their perspective is correct.",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "renaissanceman71",
                                            "body": "In a geopolitical sense, trying to rationalize what is happening right now from the socialist/capitalist dimension doesn't make a lot of sense - it goes beyond mere economics and social organization.     \n\nThis is a war that the capitalist West has been fomenting ever since the dissolution of the USSR in 1991 and the 2014 coup against the democratically elected Ukrainian government was the start of the current war. The West spent the years between 2014 and 2022 arming and training Ukraine's rabid fascists for a war against a Russia they had always hated.\n\nAs leftists, I think we should see this conflict as the last gasp of the Western capitalist order - their last, futile attempt to assert their waning strength over a world that has grown tired of their tyranny. Russia is not some beacon of socialism, but it is willing to fight against the Western juggernaut once again when no other country would step up to the plate, and I respect them for that.\n\nSocialists should celebrate the upcoming multipolar world and welcome the path towards prosperity that has been laid out so skillfully and effectively by China and the Communist Party of China (CPC) specifically. What they've done in such a short period of time without the genocides and wars of centuries of Western aggression is truly remarkable and should be emulated.\n\nThe West's strategy of keeping fascism and Nazism alive to be used against Russia again has collapsed, and the West really has nothing to fall back on.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Lonely_Attention9210",
                                                    "body": "What even is this group when the most rational comment gets downvoted so much?",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Cacophonous_Silence",
                                    "body": "...are we gonna ignore Wagner group too?",
                                    "score": 33,
                                    "replies": [
                                        {
                                            "author": "pagey12345",
                                            "body": "https://www.latrobe.edu.au/news/articles/2022/opinion/russias-long-history-of-neo-nazis\n\nIt's not just Wagner. Both Ukraine and Russia have a Nazi problem.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "Cacophonous_Silence",
                                                    "body": "That was my point. If you're going to say you support Russia bc Ukraine has a Nazi problem... well, so does Russia.\n\nPersonally, i support the country that was invaded and that's the end of that for me. 🤷🏼‍♂️\n\nNot that I don't want to see Ukraine deal with the Nazi problem when they are able. However, the initial invasion in 2014 is what led to the problem in the first place. Nationalism peaks when your country is actively being invaded.",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "pagey12345",
                                                            "body": "I couldn't have said it better.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Lonely_Attention9210",
                                            "body": "Wagner wasn’t an ideological entity so yes, we must ignore them in this instance.",
                                            "score": -4,
                                            "replies": [
                                                {
                                                    "author": "Leaveustinnkin",
                                                    "body": "Seems like you guys are picky choosy.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "glucklandau",
                                            "body": "Is it nazi? I didn't know that",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "Cacophonous_Silence",
                                                    "body": "Its name comes from Richard Wagner, an antisemite and Hitler's favorite composer\n\n[Here's an article about their use of Nazi symbols](https://en.respublica.lt/signs-of-neo-nazi-ideology-amongst-russian-mercenaries)",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "poshtadetil",
                                    "body": "Far right groups tend to radicalize when an invader force attacks their country. How nice of you to ignore Wagner or even the Nazis in your own country.",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "DoctorHilarius",
                                    "body": "14% of Russians would not accept a Jewish person as a citizen of their country. 5% of Ukrainians feel the same way. Not sure I buy the idea that Ukraine is any more racist then the rest of Eastern Europe. \n\nSource: [https://www.pewresearch.org/short-reads/2018/03/28/most-poles-accept-jews-as-fellow-citizens-and-neighbors-but-a-minority-do-not/](https://www.pewresearch.org/short-reads/2018/03/28/most-poles-accept-jews-as-fellow-citizens-and-neighbors-but-a-minority-do-not/)",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "TTTyrant",
                                            "body": "Why is anti-semitism being used as the litmus test to gauge racism? Also, polls are tough to use as accurate social ques, and the thread is talking about ukrainian ultra-nationalists in particular. Who are a minority.\n\nThe focus of Ukraines ultra-nationalism has historically been extreme Russophobia. They view Russians, and anything they associate with Russia, as the source of all evil. \n\nOf course. The object of their hatred shifts from instance to instance, and jews would very quickly find themselves in the ukro nazis crosshairs again(Ukrainian ultras were some of the most enthusiastic and brutal perpetrators of pogroms against Jews) if it weren't for their obligation to align with western interests (israel).",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "29adamski",
                    "body": "I got banned from /r/GreenAndPleasant for saying this. Ridiculous.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "FoodForTh0ts",
                            "body": "Do they seriously consider Russia to be socialist there?!",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "29adamski",
                                    "body": "I have no idea, I asked why I was banned and they called me a fascist. Was very strange, probably more a problem with moderators than the sub itself.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Tiny-Wheel5561",
            "body": "We all know the hegemony of the USA and its imperialism must be damaged in any way possible, however that doesn't excuse other entities performing imperialism.\n\nIn the end, remember that the common people and working class suffer this war, no matter which side, it is a war between capital interests, nothing to gain for the working people except graveyards.\n\nThis is the difference between leftist anti war takes and the puppets that sell their country for capitalists from other countries (far-right).\n\nWe are different types of \"enemies\" from within (for different classes), except only one fights capitalism, the other enforces it violently.\n\nWhen reactionaries talk about enemies within, they aren't talking randomly just to divide people, they are sending a clear message to the left, while also fooling the liberals that don't know better.",
            "score": 64,
            "replies": [
                {
                    "author": "stewie999-",
                    "body": "Wow this is so well put. You are very eloquent",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "2moons4hills",
            "body": "I hope I don't get banned, but it's accepted by socialists and communists that Russia is not socialist/communist today, right?",
            "score": 31,
            "replies": [
                {
                    "author": "studio_bob",
                    "body": "Of course. The post-1991 neoliberal shock therapy made sure to leave little intact of socialist economy of the former USSR and what remained of communist/socialist political power (and, for that matter, democracy) in the former RSFSR was decisively put down by Yeltsin's 1993 self-coup and assault on the Russian parliament.",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "ebolaRETURNS",
                    "body": "I would imagine.  If anything, contemporary Russia can be characterized as hypercapitalist or 'later staged capitalist', in that their economy is centered on resource extraction and circulation of finance capital, having evolved (or devolved) beyond manufacturing-centered production of commodities for end-consumers, with even more severe class-inequality than characterizes the West.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "Dai_Kaisho",
                    "body": "Yes. Nor is China. This is where a lot more leftists are looking for shortcuts",
                    "score": -6,
                    "replies": [
                        {
                            "author": "2moons4hills",
                            "body": "I'd consider China socialist personally, but it took me a while to find the evidence since there's so much propaganda against them out there.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Suitable-Figure-2730",
                                    "body": "is there anything i could read that provides that evidence? i myself am really not entirely convinced china is socialist but i want to have an open mind about it",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "2moons4hills",
                                            "body": "somebody shared this link on here a while ago. I haven't vetted everything yet so be aware of that, but it seems like a good compiled list of evidence of China's successes based on what I have checked of it.\n\nhttps://informedleftist.weebly.com/debunking-anti-china-myths.html",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Suitable-Figure-2730",
                                                    "body": "thank you very much! i skimmed the page a bit and i’m glad that there are citations for every single claim lol",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "2moons4hills",
                                                            "body": "Yeah there's so many I haven't read all of them...YET! But I saved it since us western socialists are often very wary of China due to the active propaganda of the feds",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "whiteriot0906",
            "body": "I feel the need to remind people that blaming NATO for the Ukraine situation, or rejecting the US stance towards and race to war with Russia, does not in any way automatically somehow equate to “supporting Russia.”",
            "score": 74,
            "replies": [
                {
                    "author": "davinjones",
                    "body": "the instance that prompted my post was someone who is a devout leftist (including getting in a LOT of hot water for openly threatening a senator) and was showing genuine support for Russia based largely around the fascist pacts in Ukraine.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "whiteriot0906",
                            "body": "What did they say/do that you’re saying is support?",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "AmitabhaStyle",
                            "body": "To clarify, is this person arguing that Putin/Russia are (purposefully) advancing socialism or anything like that?",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "kgberton",
                            "body": "What does genuine support sound like in this case?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Gold_Extreme_48",
            "body": "Fuck that war! \nThe only way is class war!",
            "score": 11,
            "replies": []
        },
        {
            "author": "Future_Minimum6454",
            "body": "It’s a lot less of “Russia good” than “America bad” probably. I don’t think any socialist supports any oligarchic hyper capitalist regime, however I tend to be more critical of the American neoliberal perspective on most issues as I’ve already seen that they lie when it comes to China (and any socialism for that matter) so why should I trust them on Russia? ",
            "score": 25,
            "replies": [
                {
                    "author": "Menacingly",
                    "body": "Thats kind of the issue with campism: it paints a false dichotomy between imperialist and anti-imperialist actors so that “Russia good” and “America bad” are actually the same thing. \n\nBesides, I wouldn’t be surprised, as an American leftist, if the Russian state perspective has an influence on their views. For example, conversations with American leftists are pretty rife with state department talking points and it’s not a coincidence that American leftists are largely “libertarian socialists” who reject Lenin, Castro, and Mao. (because they were *state socialist*, instead of socialist, whatever that means) I don’t think Russians are any more or less prone to their national propaganda than Americans are.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Important_Baby5462",
                            "body": "What’s a libertarian socialist? Isn’t that just anarchism?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Putrid_Operation9403",
            "body": "I see it as nothing more than two capitalist and imperialist powers grabbing at land. I think it all boils down to that",
            "score": 31,
            "replies": []
        },
        {
            "author": "MonsterkillWow",
            "body": "Some support Russia out of a pure desire to oppose America really.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Equivalent-Ad3606",
            "body": "I'm from Russia. Now Russia is an extremely conservative country. After the crisis, liberal flirtations are a thing of the past. The ban on rallies and meetings has not been lifted since the coronavirus. Right-wing groups are once again actively supported by the authorities. Right-wingers, police, Cossacks and others are acting together to round up immigrants. They are also acting separately. All this is happening against the backdrop of a huge demographic crisis. Ethnic Russians don't want to reproduce. Interest on loans and mortgages is 30+%. Despite this, 70-80% of the population has loans. Many have several loans. For many, contract service in the armed forces is almost the only way to earn good money. Education requirements have been lowered. The market needs laborers. Nine grades are now enough to get a high school education. Clericalism and anti-communism are planted in schools. In kindergarten - clericalism. There is a huge problem with corruption. Recently the number of convictions for corruption has increased. But their number is not decreasing. It is more like a change of elites. Church and political figures often allow themselves misanthropic and sometimes outright fascist slogans. They are not held accountable for this. Political cases have become more frequent. One can get a real sentence for speaking out against the current government. With the beginning of the SWO the sentences have increased and become huge. Very strongly conservatism is starting to go even more to the right-wing ideology.\n\nThe CPRF takes an opportunist position. Instead of denouncing capitalism and power, it has been engaged in solidarism throughout the SWO. It tells us that big business and ordinary people have a common task.\n\nThis is a summary of the information.",
            "score": 5,
            "replies": []
        },
        {
            "author": "GroundbreakingTax259",
            "body": "I support the Ukrainian people in this. Look at the refugees and the common soldiers; they're not all neo-fascists, but people who have been driven from their homes by a violent agressor, and volunteers willing to lay down their lives for their homeland. There is even a fair number of leftists in Ukraine who want the Russians out.\n\nAll that being said, I think the way the west in general (and the US in particular) has treated Ukraine and this war has been reprehensible. In my read, negotiations for peace should have begun in the first few months of the war, after the initial invasion of Kiev was turned back and Ukraine had given Russia an unexpected and humiliating bloody nose. Instead, the west talked about \"victory for Ukraine,\" as if the goal was Ukrainian soldiers marchine through Red Square. This only became more absurd when the west got what it had always wanted, but never been able to achieve: Finland and Sweden joining NATO, effectively turning the Baltic into NATO Lake.\n\nThe truth is, negotiation was the only realistic way the war would ever end and Ukraine would ever be safe; they're not a major political power, and they don't have a big enough diaspora in the US to risk a world war over, so they would always have to give something up. Maybe a deal in which Ukraine loses those eastern provinces (which honestly seem to be more trouble than they're really worth at this point), but gets expedited EU membership and a mutual-defense pact with other non-Russia-aligned Eastern European states (instead of joining NATO) could have worked. I don't know.\n\nWhat I do know is that the US treated Ukraine the same way we treated Cambodia and Afghanistan during the Cold War; as a convenient source of bodies to throw at Russians, with no attention paid to who, precisely, our weapons were being given out to.\n\nI expect there will be blowback from our tacit support of non- and paramilitary actors with fascist ideas, just like it did in those other nations.",
            "score": 18,
            "replies": [
                {
                    "author": "DefiantPhotograph808",
                    "body": ">willing to lay down their lives for their homeland. There is even a fair number of leftists in Ukraine who want the Russians out.\n\nExcept they don't do it for their \"homeland\", but for a regime dominated by chauvinists from Galicia and Volhynia that is selling out Ukraine's wealth and resources to the west.`And the number of Ukrainians who are \"willing to lay down their lives\" is very small, which is why the government has employed TCC thugs to terrorise other Ukrainians into joining by way of assault and kidnapping, mostly targeting Russian-speaking regions closer to the fighting like Kharkiv and Odessa.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Funny_Material_4559",
            "body": "The left tends to play favorites when it comes to capitalists, they're both empires, they're both oligarchies, they're both your enemies",
            "score": 7,
            "replies": []
        },
        {
            "author": "Stankfootjuice",
            "body": "They're both imperialist powers and are thus both fully indefensible in the eyes of anyone who truly believes themselves to be anti-imperialist. Anti-Imperialism is not exclusively Anti-US Imperialism, and anybody who defends or lavishes praise on either power is simply exposing themselves as a lesser-evilist, or someone who holds a far less formed, more naive understanding of what imperialism is.\n\nI standby the opinion that both should equally be detested, though the US/NATO bloc does have significantly more resource capital at their disposal. The Russian Federation is using military force to destroy Ukrainian independence and self-determination, to bring all of the country's wealth of resources under the exclusive control of their imperial sphere. Ukraine's economy will be stripped for parts and turned into a resource extraction operation to fuel the Russian Empire, its people forced to assimilate into Russian culture and forget their own.\n\nThe US's plan is no different, though their methods are more cloak and dagger and backroom deal. The weapons and personnel they've provided have a price tag that Ukraine will have to pay if they somehow don't get integrated into the Russian empire. They will be forced to take out loans from IMF or other organizations of that type to pay for the war, then sell off their economy and impose austerity measures on their population, thus ensuring their country will never have the freedom of self-determination, as generations of Ukrainians will pay for a war that achieved nothing beneficial to them. \n\nSocialists need to identify that there is no lesser evil, not defend one imperial power over another just because their tools of imperial conquest may seem more benign than the other.",
            "score": 17,
            "replies": []
        },
        {
            "author": "justheretodoplace",
            "body": "Russia is an enemy. The US is also an enemy. Ukraine is not an enemy. Maybe Russia is slowing down the US’s imperialism; you could argue that. They do not need to commit war crimes against Ukraine to do so.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ryuch1",
            "body": "Both sides suck\n\nBoth are imperialist the only difference is one's a western imperialist force and the other is a Russian imperialist force",
            "score": 2,
            "replies": []
        },
        {
            "author": "tetrarchangel",
            "body": "I got muted from r/GreenAndPleasant the otherwise best left-wing sub for my country for saying one of the regular posters (who turned out to also be a mod) posted a lot more pro-Russia in a Campist way than in an anti-US way. I believe there should be no war but the class war and that should be the focus. I think the current chaos in the US is exactly the sort of thing that was engendered in post-USSR Russia and what comes out of it is a lot of billionaires.",
            "score": 4,
            "replies": []
        },
        {
            "author": "MassiveCollision",
            "body": "Modern day Russia under Putin is imperialist and fascist as hell.",
            "score": 2,
            "replies": []
        },
        {
            "author": "StoneyThePlant",
            "body": "Idk I've seen a lot of people on both sides seem to fall into the web of lies Russia produces around this war wether it was Ukrainian chemical weapons labs like in the early days or alleged genocide against ethnic Russians living in Ukraine for me the bottom line isn't about the grand magical fight against capitalism like every other person (socialist) seems to want it to be when in reality it's a war against a sovereign nation that if/when defeated will then become a war on Europe as a whole and then we will all wish we had done something differently not saying Europe's governments eating shit and then that maybe trickling over to ours isn't a good thing cause you know still fuck capitalism just saying this is bigger then what the left and especially socialists want to admit",
            "score": 1,
            "replies": []
        },
        {
            "author": "Marxism-Enjoyer101",
            "body": "I feel like a lot of people forget that socialism/communism is egalitarian in nature. \n\nYes Ukraine is a puppet of Western countries or specifically America and complicit in capitalism. \n\nYes Russia is an imperialistic, authoritarian country.\n\nThe only people that suffer in this war is the workers and everyday people. Russia or even the USSR (despite its achievements) shouldn’t be defended.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Online_Commentor_69",
            "body": "they might be bad but the yanks are worse, is the gist of it.  they are an ally of china as well and were provoked into the war.",
            "score": -3,
            "replies": [
                {
                    "author": "davinjones",
                    "body": "I understand the argument about NATO forcing their hand, but like, it’s still Putin-led Russia lol",
                    "score": 5,
                    "replies": [
                        {
                            "author": "rd--",
                            "body": "'strongman' putin leading russia is partially a consequence of nato is how i view it",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "studio_bob",
                                    "body": "US was instrumental in keeping Yeltsin in power. Putin was his hand-picked successor, specially groomed for the role over some years. Probably there would be no Putin without US interference in Russian post-Soviet politics.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Online_Commentor_69",
                            "body": "it's definitely a lesser evil thing.  material conditions and all that, first you gotta get rid of US imperialism before you can have socialism.  fight with putin until it's time to fight against putin.  \n\nand i am generalizing and simplifying a great deal here of course.  and these are only my own views.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "d7gt",
                                    "body": "\\> fight with putin until it's time to fight against putin.\n\nSurely many Ukrainians would argue that it's long past time to fight against Putin?",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "DefiantPhotograph808",
            "body": "Nobody here is in a position to support Russia. The sentiment you're likely referring to is not one of mistaking Russia to still be socialist, but rather a reaction towards dehumanising propaganda against Russian people which has the goal of turning them into a Jew-like figure to blame the failures of liberalism on, as was done with Russia Gate, and to dismantle the nation which will eliminate it as a competitor to the United States and the EU. Even after everything that happened since the fall of the USSR and the implementation of shock therapy, Russia is still a country of over a hundred million educated people, rich in resources like fuel, and a producer of advanced technologies. This is why Russia is in the crosshairs of imperialism.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LeftyInTraining",
            "body": "Are leftists defending/supporting Russia or are they just identifying the nuance of why Russia likely invaded? I've seen plenty of people think that someone is supporting Russia just be abuse they point out things like NATO expansion as an aggrevating factor, Ukraine legitimately having a Nazi problem, and the US only being in it for Ukraines capital markets and resources.",
            "score": 1,
            "replies": []
        },
        {
            "author": "877fmradiopushka",
            "body": "Russia has become the same capitalist hell hole as America. They think that if they put holy water near a traffic light then accidents will be less frequent there lol. (very religious) Russia is doing its best to follow in the footsteps of America which is why i hate putin. I am from there actually, so I can tell you some insider information lol. There is a thing there where people like European culture and want to be more like Europe. Putin is kind of like that and all I hope is that Trump doesn't win him over because if he does then that will mean less restrictions for western dominance. Honestly if Putin does that, I am all for China taking it over. Call me a traitor at that point. Not to mention, Russia has been censoring some socialist narratives as well.",
            "score": 1,
            "replies": []
        },
        {
            "author": "unity100",
            "body": "The Putin administration has been running a relaxed version of China's model for decades now - which is in turn a version of relaxed Leninism. Russia's (and I think the world's) biggest company along with a lot of drivers of their economy are state-owned, the private sector is made subservient to the state and do what the state strategy dictates (like in China) among a lot of other things. The oligarchs do whatever the state dictates, while having a right to provide feedback and object. (like in China, but more lenient) In the domestic front, the policy seems to be a relaxed social democratic state that imitates the generic European social democratic format. The security state seems to model itself from the old USSR and China and it keeps the security tight. Generationally, still the cadres who were educated in the last decades of the USSR seem to be running the show. Soviet secularism still exists strongly despite all the political rhetoric about conservative values and Christianity, so the current Russian state and society are as diverse as the old USSR with many non-Russian ethnicities occupying high state posts based on merit. So today's Russia seems to fall somewhere closer to the old USSR than Yeltsin's Russia or any state in the Western hemisphere, with a slightly conservative storefront. Then again the USSR was also quite conservative.",
            "score": -10,
            "replies": [
                {
                    "author": "davinjones",
                    "body": "I appreciate how informative this reply was. Thank you.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "unity100",
                            "body": "Right, I listed all the characteristics of the United Russia movement. (Putin's party). There are a few more, like imitating the old historic Russian paternalism in which the nobles/princes of higher rank acting as patrons of those in lower rank etc (which also goes back to Roman format by the way). Howewer listing all traits is a bit hard as the current Russian system has many characteristics that interact with each other.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Wob_Nobbler",
            "body": "Most serious leftists don't like the current Russian regime, but rather support the idea of a multipolar world order. I.e: a world where there are more than one major powers pushing their influence rather than just the US bullying everybody else into submission.\n\nA multipolar world order would allow Socialist nations like China and Cuba to assert themselves geopolitically, challenging the capitalist status quo. \n\nRussia is a very capitalist country, but is in a position to break the stranglehold the West has had globally since the fall of the Soviet union.\n\nAgain, I don't like Russia at all, but the US (and israel) is by far the biggest threat yo global peace by far",
            "score": 0,
            "replies": [
                {
                    "author": "Dai_Kaisho",
                    "body": "We won't get socialism by supporting the \"less bad\" ruling classes or trying to push revolutionary defeatism over the heads of workers. Need to understand where people are at where we are, and how we can connect the fight for what we need with workers elsewhere. ",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Wob_Nobbler",
                            "body": "Russia of course bad, but multipolar world is good.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Dai_Kaisho",
                                    "body": "Multipolarity for whose gain? It's all billionaires\n\n\nIf workers buy into this logic we're still trapped in a downward spiral paying for billionaires imperialist wars and austerity\n\n\n\nWould love to support the working class independently choosing how to run China or anywhere else- this is now what is happening there. Billionaires are not going to magically grow their Grinch hearts just bc they can quote marx",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "tecate_papi",
            "body": "OP: why don't you link to some posts or statements from leftists you find concerning on this topic? I see a lot of people on here trying to engage with you in good faith but you keep saying how there are posts or statements that go further. Russia is a hyper-capitalist state. In general, leftists are critical of an expanded NATO because it strengthens an alliance of capitalist and colonialist nations and threatens global stability. Are some internet \"leftists\" unable to understand this distinction? Absolutely.\n\nSo, can you please share these posts you're talking about? We can't have a real discussion on this subject unless you do so. Otherwise, it's just conjecture and we're having discussions over your interpretation of what you think other people are saying.",
            "score": 0,
            "replies": [
                {
                    "author": "DefiantPhotograph808",
                    "body": "What is \"hyper-capitalist\"? Capitalists after they drink coffee?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "tecate_papi",
                            "body": "It's where everything is for sale. I thought about calling it a croney-capitalist state as many have, but that is redundant and really also describes the state of the US right now.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "DefiantPhotograph808",
                                    "body": "Russia still has a public sector. I think just calling it a dictatorship of the bourgeoisie would suffice.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "tecate_papi",
                                            "body": "Oh, I didn't use your preferred descriptor for Russia? If that's the only thing you have to say then piss off.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "DefiantPhotograph808",
                                                    "body": "I don't have a \"preferred descriptor\" but I don't like the implications behind calling Russia \"hyper-capitalist\" which is obviously a meaningless word, but there is a reason why you've specifically used it which is what I'm trying to figure out. My guess is racism, like how Russia has \"oligarchs\" while other countries simply have CEOs and boards of directors.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "akejavel",
            "body": "A good resource on the repression of leftists by the Russian regime here: [https://avtonom.org/en/news/through-war-despotism-and-social-change-russias-anarchist-black-cross](https://avtonom.org/en/news/through-war-despotism-and-social-change-russias-anarchist-black-cross)",
            "score": 0,
            "replies": []
        },
        {
            "author": "Commie_nextdoor",
            "body": "It's not that we support Russia or Putin, it's that we oppose fascists in Ukraine, the 2014 coup, the US puppet regime, NATO's eastward expansion, the US government blowing up a pipeline, etc.\n\nThe fact that self professed leftists and socialists don't understand the difference between supporting Russia, and opposing a US puppet regime in Ukraine is truly appalling. The fact that those same people ignore the 1990 promise made by the US not to expand NATO an inch further east, by adding 14 new members is even worse. \nHow do you put the entire fault of the war on Russia when the West has broken every promise made to Russia since WWII? \n\nY'all agree that the US shouldn't surround Iran , China, etc with our military bases... But think it's okay to surround Russia and coup their closest neighbor? \n\nWhat is the reason? Because since WWII the US propaganda machine has been hammering how evil Russia is. That propaganda doesn't work on you when it comes to most other countries.",
            "score": -3,
            "replies": []
        },
        {
            "author": "Lonely_Attention9210",
            "body": "I think for all the flack Russia gets, at the end of the day it’s basically social democracy but with the better indigenous/ ethnic minority policies from the USSR still intact.  Putin to me is just a jobber at the end of the day. He doesn’t suppress everyone or even every opposition leader. He does however suppress and even kill US backed opposition, as one should.",
            "score": -6,
            "replies": [
                {
                    "author": "akejavel",
                    "body": "[https://avtonom.org/en/news/through-war-despotism-and-social-change-russias-anarchist-black-cross](https://avtonom.org/en/news/through-war-despotism-and-social-change-russias-anarchist-black-cross)",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Lonely_Attention9210",
                            "body": "Thanks for sharing that, it was informative.  I’m not really down with anarchists on a fundamental level, but even still, all that oppression tracks with social democracy, which isn’t good to begin with. The suppression of opps is more real than I previously mentioned, even though the U.S. only cares when right wing libs get suppressed. Call it ignorance on my part. I still think the country as a whole is in the sort of perpetual danger by the U.S. that forces some degree of repression.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}