{
    "title": "How can I actively help be a thorn in the side of the Trump presidency?",
    "author": "T_H_E_A_T_M",
    "subreddit": "socialism",
    "rank": 80,
    "score": 12,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/socialism/comments/1j0t8gm/how_can_i_actively_help_be_a_thorn_in_the_side_of/",
    "id": "1j0t8gm",
    "selftext": "I'm more talking about online help mostly with all this currently\n\n\n\n1. what are the best initiatives I can support financially that help the workers cause in this country, \n\n\n\n2.  how can I, in whatever way be a helpful part of the active wave of resistance against this terrible administration?",
    "comments": [
        {
            "author": "Dazzling-Screen-2479",
            "body": "https://incarceratedworkers.org/\n\nThey need more branches, but also if you're local to one contact them. They also always could use donations and information sharing of campaigns. They were involved with organizing the largest prison strike in US history. They are are subgroup of the https://www.iww.org/\n\n\nThere is also anarchist black cross which is a crucial organization that supports prisoners with solidarity and connection to the outside world. Espescially political prisoners.\n\nhttps://www.abcf.net/\n\n\nThen there is the PSL which is the only marxist leninist group actively in solidarity beyond their idealist bubbles (in modern usa I mean not in general)\n\nhttps://pslweb.org/\n\n\n\nA site for general actions occuring not related to one group or the other -\n\nwww.itsgoingdown.org",
            "score": 6,
            "replies": []
        },
        {
            "author": "supremeprintmaster",
            "body": "Buy and learn to shoot a handgun or rifle of your choosing. Enlist with your local SRA or other leftist gun club.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DefiantPhotograph808",
            "body": "Why the Trump administration in particular? Did you have any desire to be a thorne in the side of the Biden administration as well during the four years of his presidency?",
            "score": -3,
            "replies": [
                {
                    "author": "T_H_E_A_T_M",
                    "body": "I wasn't really living in america at that point lol",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Hefty_Ad_405",
            "body": "If you happen to be in the country during a Democratic presidency, we could REALLY use your help because no one cares when Biden does the same thing if not worse. Now is a good time to be an activist too.\n\n\nThere might be a People's Forum in your city where you can learn about socialist causes and protests. You can work with local Pro-Palestine and anti-war groups.  Any time there is a protest, find out who organized it.\n\n\nYou can also support / donate to independent and non-profit left-wing news outlets and podcasts. Alot of American news (both MSNBC and Fox) are owned by investors who also have significant financial interests in weapon manufacturering companies like Lockheed. We need alternative voices really badly.\n\n\nThank you for asking. Good luck and stay safe!",
            "score": 0,
            "replies": []
        }
    ]
}