{
    "title": "Looking for statistics citing material improvements under Soviet Union",
    "author": "incredibleninja",
    "subreddit": "socialism",
    "rank": 71,
    "score": 1,
    "upvote_ratio": 0.57,
    "num_comments (reported by reddit)": 1,
    "url": "https://www.reddit.com/r/socialism/comments/1j1udqb/looking_for_statistics_citing_material/",
    "id": "1j1udqb",
    "selftext": "Many different studies that I looked up years ago, as well as many academic speeches I remember hearing, cite the material improvements of life under Soviet society: birth rates, life expectancy, average education rate, average access to nutrition, etc. \n\nBut now when I try to find this information all I can find is Quora posts rife with reactionaries posting anecdotal stories of how horrible communism was for their grandparents. \n\nDoes anyone have access to actual statistics of pre-Soviet Russia vs. Soviet Russia?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "This is a space for socialists to discuss current events in our world from anti-capitalist perspective(s), and a certain knowledge of socialism is expected from participants. **This is not a space for non-socialists.** Please be mindful [of our rules](https://reddit.com/r/socialism/about/rules) before participating, which include:\n\n- **No Bigotry**, including racism, sexism, homophobia, transphobia, ableism...\n\n- **No Reactionaries**, including all kind of right-wingers.\n\n- **No Liberalism**, including social democracy, lesser evilism...\n\n- **No Sectarianism**. There is plenty of room for discussion, but not for baseless attacks.\n\nPlease help us keep the subreddit helpful by reporting content that break r/Socialism's rules.\n\n______________________\n\n&#128172; Wish to chat elsewhere? Join us in discord: https://discord.gg/QPJPzNhuRE\n    \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/socialism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        }
    ]
}