{
    "title": "What could be this big black thing used by police during Belgrade protests?",
    "author": "mikizez",
    "subreddit": "whatisthisthing",
    "rank": 8,
    "score": 2773,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 111,
    "url": "https://i.redd.it/krmrl219x9pe1.jpeg",
    "id": "1jdgbop",
    "selftext": "This photo is circulating the internet and was supposedly taken during the last protests in Belgrade, Serbia. While hundreds of thousands of people were gathered in silence to pay respect to fifteen people who died in November last year, a phantom sound was heard reportedly resembling that of a speeding car, a jet, a herd of horses that put people in panic and made them clear a large street in seconds, splitting into two leaving an empty space in the middle. Various people are describing effects reportedly consistent with the use of LARD. This photo was allegedly taken moments before the incident a few hundred meters down the street. Van someone shed a light as to what this black thing on the right is?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "All comments must be civil and helpful toward finding an answer.\n\n**Jokes and other unhelpful comments will earn you a ban**, even on the first instance and even if the item has been identified. If you see any comments that violate this rule, report them.\n\n[OP](/u/mikizez), when your item is identified, remember to reply **Solved!** or **Likely Solved!** to the comment that gave the answer.  Check your [inbox](https://www.reddit.com/message/inbox/) for a message on how to make your post visible to others.\n\n----\n\n[Click here to message RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/whatisthisthing/comments/1jdgbop/what_could_be_this_big_black_thing_used_by_police/]%0A%0ARemindMe!%202%20days)\n\n----\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/whatisthisthing) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Important-Ad-6936",
            "body": "thats a drone jammer similar to this one. the yagi RF antenna housings are always a dead giveaway\n\nhttps://preview.redd.it/om25ujle8ape1.jpeg?width=1030&format=pjpg&auto=webp&s=b61e2529b633f2a22c42fe1cf55f8404872d6d4d",
            "score": 514,
            "replies": [
                {
                    "author": "tcdoey",
                    "body": "Definitely",
                    "score": 16,
                    "replies": []
                }
            ]
        },
        {
            "author": "SeriousStrokes69",
            "body": "> Various people are describing effects reportedly consistent with the use of LARD\n\nlol I assume you mean LRAD, long-range acoustic device. \n\nThe device he's holding looks like it could be an LRAD of some type, but it's hard to tell which one specifically with as grainy as the image is.\n\nEDIT: It could also be a drone jammer, but since it's pointed downward rather than toward the sky where drones would be, I don't think that's what it is.",
            "score": 1410,
            "replies": [
                {
                    "author": "airfryerfuntime",
                    "body": "The LRAD they were using was a big square dish shaped thing mounted on a truck. If I had to guess, it's one is those line of sight drone jammers.",
                    "score": 46,
                    "replies": []
                },
                {
                    "author": "Ambitious-Body8133",
                    "body": "Drone jammer was my first thought\n\nAside from the extended barrel they have similar shape. \n\nhttps://www.unmannedsystemstechnology.com/expo/drone-jamming-guns/\n\nPic is far too grainy to say for certain.",
                    "score": 372,
                    "replies": [
                        {
                            "author": "afrench1618",
                            "body": "LRAD is a big circle loudspeaker thing that has to be mounted on a vehicle with a power source to provide enough wattage. \n\nhttps://en.wikipedia.org/wiki/Long-range_acoustic_device",
                            "score": 96,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 27,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 15,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "mustom",
                                    "body": "[Hand held version.](https://heweigroup.en.made-in-china.com/product/qwitlxeHJpTz/China-1km-Non-Lethal-Handheld-Acoustic-Device-LRAD-for-Dispersing-Special-Targets.html)",
                                    "score": 46,
                                    "replies": []
                                },
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 27,
                            "replies": [
                                {
                                    "author": "kn33",
                                    "body": "Could also just be not aimed yet when the picture was taken",
                                    "score": 53,
                                    "replies": [
                                        {
                                            "author": "MountainDoit",
                                            "body": "Insane to have to scroll this far to find the most likely answer lol, I don’t think people realize it’s not something you just wave around randomly at the sky hoping there’s a drone somewhere",
                                            "score": 34,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "StrugglesTheClown",
                                    "body": "I'm assuming it has off label uses as well. It probably jams a wide range of RF singles.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 31,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 8,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "secacc",
                                            "body": "Hot RF singles in your area!",
                                            "score": 25,
                                            "replies": [
                                                {
                                                    "author": "shortnthic",
                                                    "body": "Pick up the phone!",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SmokedBeef",
                            "body": "I’m fairly familiar with all the current drone jammers, especially military issued ones and systems in use in Ukraine and as you pointed out the lack of “barrel” would likely make this the most compact jammer on the market, so I’m inclined to believe it’s an LRAD, not a jammer.",
                            "score": 19,
                            "replies": []
                        },
                        {
                            "author": "loogie97",
                            "body": "Could you use a drone jammer to just jam cell phones? I feel like there would be some overlap there.",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "MRKworkaccount",
                            "body": "The extended barrel isn't part of the device, its a cctv camera behind the device you can see another one to the left behind binocular man.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "Ok-Compote-4143",
                            "body": "This is there right answer!",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Starcat75",
                    "body": "There is another video on Reddit, showing the crowd running after it being used on them.\n People stated it sounded like a jet was going to come over them. Definitely sounds like an LRAD.",
                    "score": 69,
                    "replies": [
                        {
                            "author": "bramley36",
                            "body": "There are eerie videos that appear to show the Serbian government recently using a military-grade sonic weapon on thousands of protesters in the streets.",
                            "score": 24,
                            "replies": [
                                {
                                    "author": "scud121",
                                    "body": "That's an LRAD. And military grade is a useless term, which generally means \"Cheapest possible\". \n\nThese systems are owned by dozens of countries police forces. And whilst using it on peaceful protesters is utterly shitty, baton charges/cs/baton rounds/rubber bullets would have produced far more casualties and panic.",
                                    "score": 39,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "sabotthehawk",
                    "body": "Maybe using drone jammer to block cell signals to prevent live broadcast?",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "mikizez",
                    "body": "Likely Solved! I am going to mark it as such since the consensus seems to be its a drone jammer. No links to a specific model. Others suggested a facial recognition device. \nAs for mass hysteria comment, there are other videos online where the sound can be heard. Although this is most likely not the picture of the source, the source itself is still unknown and people exposed to it report feeling sick, ears bleeding, pacemakers malfunctioning etc. A petition for an independent investigation was signed by hundreds of thousands already. \nThank you all for the answers!",
                    "score": 26,
                    "replies": [
                        {
                            "author": "MoveAlooong",
                            "body": "Drzite se tamo!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DodgyRogue",
                    "body": "I believe US cops use LARD.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 8,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[removed]",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "[removed]",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "None",
                                                                            "body": "[removed]",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Phinnegan",
                    "body": "Related:\n\nhttps://v.redd.it/v8iwxo3mj9pe1",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 7,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ApprehensivePrint465",
                    "body": "LRAD is a disc shape.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "the_real_xuth",
                            "body": "LRAD can be in many shapes but most importantly it is a largish flat panel with a bunch of transducers on it which uses interference patterns to create directional sound at high amplitudes.",
                            "score": 19,
                            "replies": []
                        },
                        {
                            "author": "Pretend_Weight5385",
                            "body": "LRAD's also come in square shape",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "SeriousStrokes69",
                            "body": "They make LRADs in the form of guns/rifles. And while the emitters on those are typically(?) round, it's hard to tell on this image if the front of what he's holding is round or not.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "DialMMM",
                                    "body": "> They make LRADs in the form of guns/rifles.\n\nI am skeptical. A rifle-format LRAD wouldn't make sense at all: not enough surface area to produce the signal. Do you have a link?",
                                    "score": 21,
                                    "replies": []
                                },
                                {
                                    "author": "DirtyDillons",
                                    "body": "I distinctly remember watching a documentary about a handheld sound cannon that had a similar shape. The technology featured proprietary sound frequencies, which were a guarded secret. According to the documentary, this device was reportedly used against Al Qaeda operatives hiding in caves, leveraging sound as a tactical tool.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "jaffa-caked",
                    "body": "Thought LRAD were square",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "budna",
                    "body": "> but since it's pointed downward rather than toward the sky\n\nIf they are on a balcony, it is possible to fly a drone in the direction they are pointing towards.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Krawen13",
                    "body": "If it's being used on the average american, then \"LARD\" could be accurate too",
                    "score": -3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lemon_head_guy",
            "body": "I can’t speak to the specific model but I work at an electronics factory that makes drone jammers and they’re fairly similar, so I’m pretty confident in saying that those are drone jammers",
            "score": 24,
            "replies": []
        },
        {
            "author": "ObjectiveMinute2641",
            "body": "Looks drone-jammerish :) Could be a acoustic 'weapon' but I'm leaning to the former :)",
            "score": 75,
            "replies": []
        },
        {
            "author": "GitEmSteveDave",
            "body": "From the video I have seen, it was dark when the sound cannon was used, e.g. the street and building lights were on.  So highly unlikley this was taken \"moments\" before.",
            "score": 63,
            "replies": [
                {
                    "author": "Accomplished_Bag_804",
                    "body": "Yes, the photo was taken either earlier that day or some days before.",
                    "score": 16,
                    "replies": []
                }
            ]
        },
        {
            "author": "Cardboardtube97",
            "body": "It’s a drone jammer",
            "score": 39,
            "replies": []
        },
        {
            "author": "werkwerk3",
            "body": "The profile matches an anti-drone jammer gun, although I can't find the exact model they often have that triangle on its side profile.\n\nOn the other hand I can't find any LRAD-like weapons in gun form factor. They are usually made for area denial and communication at a distance and usually have static form-factors with swivels or vehicle mounts. There's one or two handheld models, but they aren't designed to be aimed as a gun.\n\nAlso at this protests there were multiple DJI mini drones flying on the street just a couple of meters above the crowd, so that would explain the aiming angle\n\nSo I'm gonna say that the government is surprisingly telling the truth here.",
            "score": 14,
            "replies": []
        },
        {
            "author": "Aleksandar_Pa",
            "body": "Probbably a drone-jammer.",
            "score": 8,
            "replies": []
        },
        {
            "author": "40percentCheese",
            "body": "Looks like a handheld CUAS device (jammer) although it’s probably being used to jam WiFi and GPS on the ground, for what reason, I couldn’t say.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Go-Away-Sun",
            "body": "That looks like a drone jammer cannon.",
            "score": 7,
            "replies": []
        },
        {
            "author": "tearsofhaters",
            "body": "What sound cannon or some sci-fi nonsense? It's just classic mass hysteria/panic. Here's the footage, judge for yourself.\n\nhttps://streamable.com/4tkc4k",
            "score": 2,
            "replies": []
        },
        {
            "author": "Maleficent_Sense_948",
            "body": "Looks like a from jamming weapon",
            "score": 2,
            "replies": []
        },
        {
            "author": "raka_defocus",
            "body": "anti drone, line of sight jammer to ground them",
            "score": 2,
            "replies": []
        },
        {
            "author": "cabeachguy_94037",
            "body": "Looks like a standard professional videocamera with a weather resistant cover fitted over it. The camera/lense combo is usually about $50,000 USD, so anyone with any smarts and a govt. issued device of this sort would be responsible for it.  Notice the top of the device has an upside down U shaped thingy on top. That is the handle to carry the camera around when not shooting. \n\nSorry, conspiracy theorists; the government was just acquiring everyone's facial image to ingest later into their Big Brother database of everyone who attended the memorial. For later \"questioning\", of course.",
            "score": -2,
            "replies": [
                {
                    "author": "427BananaFish",
                    "body": "I’m curious how you can cite a price without being able to identify a camera body or lens in the picture. And why would they be using beefy weather resistant housing that professional filmmakers or military don’t even use? I don’t think that’s a camera and if it is it’s definitely not standard.",
                    "score": 14,
                    "replies": []
                }
            ]
        },
        {
            "author": "lylisdad",
            "body": "I think this weapon is what is in the picture.\n\nhttps://preview.redd.it/ire1a9uv6ape1.jpeg?width=1080&format=pjpg&auto=webp&s=601f9a737f09ad6967998c567e7b737d691f1f18\n\n[Personnel Halting and Stimulation Response (PHaSR)](https://www.kirtland.af.mil/News/Photos/igphoto/2000502222/)",
            "score": 0,
            "replies": [
                {
                    "author": "Important-Ad-6936",
                    "body": "no, they canceled developing this thing because it was ineffective. blinding people with a laser is a dumb move. you can always tell where its coming from and makes the user a primary target for everything that has some sort of caliber. what op posted is a drone jammer\n\nhttps://preview.redd.it/t7td72a88ape1.jpeg?width=1030&format=pjpg&auto=webp&s=91de7dafface7afa11412f76f2df2d32eeaaaa2d",
                    "score": 26,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sufficient-Pound-508",
            "body": "Or a pointed microphone.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cbih",
            "body": "It's a drone jammer",
            "score": 1,
            "replies": []
        },
        {
            "author": "SoundlessScream",
            "body": "I don't know if this particular device could be directional speakers, but it is hypothetically possible that directional speakers could be used to shoot a beam of sound at a target, only the target(s) and those immediately near the target or depending on how loud the sound is would affect distance heard -  would hear the sound, as it would be bouncing off of whatever the device is aimed at. There are youtube videos of people demonstrating what this is like on a small home made hobby scale. A powerful device could likely accomplish what you describe, but again, I don't know what it would look like or if it could be this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mikizez",
            "body": "My title describes the thing. I really have no further info apart from people speculating on social media most of them either saying a riot control non-lethal weapon, or a drone jammer.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cablemonkey604",
            "body": "Directional antenna of some kind. Could be logging BT and/or wifi MACs of people dumb enough to bring a phone to a protest, or a jammer as others have suggested.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PrizeSyntax",
            "body": "Some kind of a camera or  binoculars or something along those lines. It definitely looks like he is looking through it. Either way aren't LRADs bigger? The ones I have seen are like a circular table that can accommodate 4 people, usually mounted on a vehicle",
            "score": 1,
            "replies": []
        },
        {
            "author": "StrictDisk4281",
            "body": "Telephoto lens camera",
            "score": -3,
            "replies": []
        },
        {
            "author": "Haunting_Average5784",
            "body": "Portable facial recognition optics",
            "score": -4,
            "replies": []
        },
        {
            "author": "Jazza330",
            "body": "[Sonic Attack](https://youtu.be/XMSnVplyTOM?si=MhiumKfoBtJd4re1)",
            "score": -5,
            "replies": []
        }
    ]
}