{
    "title": "Attic find in rural Slovenia. A metal ball with holes and a metal rod going through the center. The ball threads off entirely the two halves of the ball dont come apart. It has no marks, numbers or anything on it. The house it was found in is well over 100 years old.",
    "author": "Even-Salary-3551",
    "subreddit": "whatisthisthing",
    "rank": 14,
    "score": 248,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 47,
    "url": "https://www.reddit.com/gallery/1jdh5f0",
    "id": "1jdh5f0",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "All comments must be civil and helpful toward finding an answer.\n\n**Jokes and other unhelpful comments will earn you a ban**, even on the first instance and even if the item has been identified. If you see any comments that violate this rule, report them.\n\n[OP](/u/Even-Salary-3551), when your item is identified, remember to reply **Solved!** or **Likely Solved!** to the comment that gave the answer.  Check your [inbox](https://www.reddit.com/message/inbox/) for a message on how to make your post visible to others.\n\n----\n\n[Click here to message RemindMeBot](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=[https://www.reddit.com/r/whatisthisthing/comments/1jdh5f0/attic_find_in_rural_slovenia_a_metal_ball_with/]%0A%0ARemindMe!%202%20days)\n\n----\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/whatisthisthing) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "jeffersonairmattress",
            "body": "Nut roaster.  Sits in front of or beside the cooking fire. \n\nMy great aunt had a Rumford kitchen fireplace with a pierced cylinder version of this globe that rotated on the brackets that stuck out from the bricks.   She used it for hazelnuts- she also made popcorn in it",
            "score": 250,
            "replies": [
                {
                    "author": "Even-Salary-3551",
                    "body": "This makes a lot of sense! My mom says popcorn probably wasnt really a thing but hazelnuts are just small enough to pass through the bigger hole. The house itself also used to be a restaurant for a long time and we removed a really old brick wood burnong stove from the ground floor a few years ago.",
                    "score": 61,
                    "replies": [
                        {
                            "author": "Old-Towel-4186",
                            "body": "maybe chestnuts too - which I think fit Slovenia as well",
                            "score": 25,
                            "replies": []
                        },
                        {
                            "author": "bel_ray",
                            "body": "For what it's worth, my grandparents had a similar thing for roasting coffee",
                            "score": 12,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Old-Towel-4186",
                    "body": "I feel like this is right... but I'd feel better if I could see the handle better and see it how it is attached to the device",
                    "score": 14,
                    "replies": [
                        {
                            "author": "jeffersonairmattress",
                            "body": "The handle is shown in the last photo.  It doesn;t take much of a crank arm to spin a pound of nuts.\n\nIt hangs from side hooks in a big fireplace or from the billy tongs in [this photo](https://i.pinimg.com/originals/c7/fd/e5/c7fde55d10cfb304181bfd6417076a65.jpg) that are holding up the kettle.",
                            "score": 10,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "already-taken-wtf",
                    "body": "[https://www.ebay.co.uk/itm/156303516507](https://www.ebay.co.uk/itm/156303516507)\n\nhttps://preview.redd.it/pctitr52wape1.jpeg?width=1170&format=pjpg&auto=webp&s=6c0316332157ffaf7bdc6c780f59ad69fcc2aaec",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "achillebro",
                    "body": "i would have guessed chestnut... in italy we have similar things for chestnuts.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Even-Salary-3551",
            "body": "I think it might be some sort of rotating device for roasting something? Maybe chestnuts? My dad thinks it might be some sort of device for the smoke that priests use to bless stuff. Or maybe a manual disco ball of some sort😂 (or maybe not lol). Since taking the picture we have managed to also take the ball off through the threaded part with a bit of effort because of the rust. It also has a nice wooden handle at one end. I did a few image searches but only saw similar things but hanging on chains. My title describes the thing.\n\nThanks for any ideas or feedback! We were thinking of making some sort of light fixture with it, but do any of you have an idea of what to do with it?",
            "score": 12,
            "replies": []
        },
        {
            "author": "Old-Towel-4186",
            "body": "It's could be a finial for the top of a gable on the house, it would serve two purposes in all likelihood 1) decorative, and 2) if they ground it, as a lightning rod.\n\nA second piece to the finial (a point) may also be missing that would have screwed down onto the ball. \n\nYou mention a handle but I don't see one attached to it in the third picture where you're holding it??? I see something in the last picture, that would indicate a crank but it's difficult to see.",
            "score": 16,
            "replies": [
                {
                    "author": "cochese25",
                    "body": "Lightning rod was my first though, but it doesn't appear to be",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Even-Salary-3551",
                    "body": "A great idea but i dont know why it would have a nice wooden handle at an angle like that",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Old-Towel-4186",
                            "body": "yeah I agree completely - I just can't really see how the handle is attached... how is the handle attached to the device? screwed on? Like does the rod flatten out and the handle is screwed onto it?\n\nIs it kind of attached [like these: ](https://library.sweetmarias.com/antique-home-coffee-roasters/)",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Even-Salary-3551",
                                    "body": "I didnt do a really good job taking a picture but if you look closely on the 3rd and 4th picture you can see the rod kind of going in a spiral and ending in a handle. First its a bit of metal and then it is just a standard kind of handle that are common on tools for woodworking ect.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Old-Towel-4186",
                                            "body": "yeah - probably a nut or coffee bean roaster of some sort. Clearly made for open fire, hence the length of it. I think there's someone below who has it! Thanks, I liked this one.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "runKitty",
                    "body": "Did not know house finials could also be lightning rods so thank you for that tidbit. Also never thought to call them finials; not sure why, as they perfectly fit the description.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Old-Towel-4186",
                            "body": "most would be strictly ornamental really, grounding weathervanes and finials isn't typical really but it can be, and in this case the way it looked, i.e. very long metal rod with the end looking like it may have been attached to wire (later I realized it was just a coil on the ground - perspective in pictures can be difficult) it led me to believe it may have been for grounding purposes. Still - some are grounded for lightning... in this case - turns out this thing is a nut / coffee roaster :)",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Onetap1",
            "body": ">My dad thinks it might be some sort of device for the smoke that priests use to bless stuff. \n\nA thurible. I've seen big ones, suspended from the ceiling of a church, but they're usually brass/bronze or gold plated.\n\nPS I don't think it is, from the Wikipedia article they're usually of a standardised form, with an openable top half and 3 chain attachments.",
            "score": 28,
            "replies": [
                {
                    "author": "IntentionallyHuman",
                    "body": "With no way to open it (to add charcoal or clean it out) this would make for a very inconvenient censer/thurible/kadilo.",
                    "score": 22,
                    "replies": []
                },
                {
                    "author": "RupertMurdockfuckers",
                    "body": "Always referred to them as a censer growing up, never realized that the larger ones were called thuribles. Almost 2 decades of going to mass every  week and never heard that term. Learn something new everyday.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Even-Salary-3551",
                    "body": "Yes i agree that that doesnt really make sense.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "MRGWONK",
            "body": "The first thing I thought of was lightning rod.",
            "score": 7,
            "replies": [
                {
                    "author": "hopeandnonthings",
                    "body": "Yea, I've seen balls like that attached to weather vanes to be used as a lightening rod",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 3,
            "replies": [
                {
                    "author": "Vyedr",
                    "body": "I dont think it would work for that - if the ball portion is supposed to contain the rice you would need a very deep pot to get the ball submerged, the rod sticks out too far.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Even-Salary-3551",
                    "body": "I dont think its for rice because people didnt eat/ couldnt really get rice here.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "IntentionallyHuman",
            "body": "Could it be a lightning rod?",
            "score": 3,
            "replies": []
        },
        {
            "author": "alwaysboopthesnoot",
            "body": "Is it hinged and does it open and close really easily and securely? ",
            "score": 2,
            "replies": [
                {
                    "author": "Even-Salary-3551",
                    "body": "It is made of two halves that i thought at first are just rusted together but we couldnt get them apart so i think they might be hammered together?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ksdkjlf",
                            "body": "Note the rod is threaded on the end with the hole. To me that suggests there was a cap that would've slid over the rod on that end and screwed on to keep everything in after filling it. Seems like it would make it difficult to unload if it was still hot, but for something like coffee where you'd let the roasted stuff cool down before doing anything with it, it would probably be adequate, and likely easier to make than something with hinges or a little sliding door.\n\nThat would be my only reason to think it might've been for roasting coffee over nuts -- roasted chestnuts are best enjoyed warm so you'd likely want a way to easily get them out when the apparatus was still hot if that's what it was (primarily) intended for.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "lNooBDowlN",
            "body": "maybe for roasting coffee beans",
            "score": 2,
            "replies": []
        },
        {
            "author": "woodboogers",
            "body": "salad spinner.",
            "score": 2,
            "replies": []
        },
        {
            "author": "syseyes",
            "body": "We got something similar but smaller and cilyndrical  to roast cofee.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Even-Salary-3551",
            "body": "I think we found it!\n\nhttps://preview.redd.it/b5f00mwhabpe1.jpeg?width=1080&format=pjpg&auto=webp&s=bc8611d77bf164a1fa7a0cd2662daaab343e8b8e\n\nLooks just like a homemade version of this without the bottom holder",
            "score": 2,
            "replies": []
        },
        {
            "author": "Vyedr",
            "body": "I would agree with roasting device - the lengths at either end would allow for setting on a pair of spitroast stands, and the right angle would act as the handle for turning.",
            "score": 2,
            "replies": []
        },
        {
            "author": "nicemessages",
            "body": "Could be some sort of Moth Ball holder?  For storing cloths in the attic.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RadiantCarpenter1498",
            "body": "Maybe something similar to this vintage roaster: [https://www.etsy.com/listing/1555152883/a-nice-vintage-french-chimney-top-ball](https://www.etsy.com/listing/1555152883/a-nice-vintage-french-chimney-top-ball)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nghtyhedocpl",
            "body": "Lightning rod??",
            "score": 1,
            "replies": []
        },
        {
            "author": "Stalaktitas",
            "body": "Looks like you could fill it up with fish bait and bread mix, attach it to the rope and throw it into the lake to attract fish while fishing. That would explain why it's so rusty",
            "score": 1,
            "replies": []
        },
        {
            "author": "OpeningDish3093",
            "body": "Thats for roasting coffee.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Guitar_Man_1955",
            "body": "My experience with wells and cooling water towers make me think that it looks like a float to turn off an automatic filling system. As the float is lifted in the water it allows only to the adjusted height, much like an old fashioned toilet valve only much bigger. The holes in the ball are a bit confusing although a air bladder of rubber or canvas could have been used on the inside of the ball. Coffee roaster?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rasael",
            "body": "Looks Luke \"time ball\", like in The Greenwich Time Ball. Nowadays we see them dropping on news year at 12:00.",
            "score": 1,
            "replies": []
        }
    ]
}