{
    "title": "[Mic'd Up] Jalen Hurts to DeVonta Smith: \"It's been a ride, man. You deserve it bro.\"",
    "author": "nfl",
    "subreddit": "MadeMeSmile",
    "rank": 56,
    "score": 231,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 22,
    "url": "https://v.redd.it/i6pg9n5arkie1",
    "id": "1in9dv0",
    "selftext": "",
    "comments": [
        {
            "author": "Dull_Switch1955",
            "body": "being supportive in sports is a big thing",
            "score": 45,
            "replies": []
        },
        {
            "author": "Inspectorgadget4250",
            "body": "Hurts is a leader. Make no mistake about that",
            "score": 37,
            "replies": []
        },
        {
            "author": "cmacfarland64",
            "body": "Love it.  They are professionals and they play for money, but they care.  They want to win.  It’s awesome.",
            "score": 14,
            "replies": [
                {
                    "author": "HoodWisdom",
                    "body": "They're teammates from way back, won Natty together",
                    "score": 1,
                    "replies": [
                        {
                            "author": "cmacfarland64",
                            "body": "No they didn’t.  Hurts transferred to Oklahoma while Smith won his with Tua.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Pro-editor-1105",
            "body": "this sounds like the ending of a spider man movie or something",
            "score": 7,
            "replies": []
        },
        {
            "author": "AstroHealer222",
            "body": "“In your hometown” Who’s cuttin onions in here🥹",
            "score": 16,
            "replies": []
        },
        {
            "author": "WitchScarlett",
            "body": "this is so wholesome, love to see it",
            "score": 4,
            "replies": []
        },
        {
            "author": "vikmuratti",
            "body": "When smitty cries, we All CRY! S/o to smitty man.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Defiant-Sir15",
            "body": "I wish I had a dude like hurts in my life 🤧. (No diddy)",
            "score": 2,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "Welcome to /r/MadeMeSmile. Please make sure you read our [rules here.](https://www.reddit.com/r/MadeMeSmile/about/rules/) We'd like to take this time to remind users that:\n\n* We do not allow any type of jerk-like behavior, including but not limited to: personal attacks, hate speech, harassment, racism, sexism, or other jerk-like behavior (includes gatekeeping posts).\n\n* Any sort of post showing a mug, a shirt, or a print is a scam. You will not receive anything except a headache and a stolen credit card.\n\n- [More information regarding rule 1 as well as how mug/shirt/poster scammers operate can be found here.](https://www.reddit.com/r/mademesmile/wiki/rule1)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MadeMeSmile) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Particular_Concert_5",
            "body": "Could anyone provide context for me? Thank you in advance.",
            "score": 1,
            "replies": [
                {
                    "author": "Icy-Inside-7559",
                    "body": "These two dudes have been playing football together for most of their adult lives and are realizing that they just won a superbowl together",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Particular_Concert_5",
                            "body": "Awesome! Thank you!",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "silver88wrx",
                    "body": "Smith is from Louisiana, he lost his high school state championship in the Dome, won a national championship in the Dome, and now has a Super Bowl championship in the Dome! \nHas played with Hurts since his freshman year at Bama. Hurts transferred to Oklahoma for one season and have now been teammates their entire pro career’s",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "ScubaSnow",
            "body": "I could tell early on Devonta was more emotional after his TD's this year and I really think it is because he wanted to get back so bad.  I can't imagine thinking you might not be able to get a ring for yourself or your city and the next year your revenge tour gets cancelled.  He fought so hard for the Eagles and damn does he deserve it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Redback_Gaming",
            "body": "As a KC supporter, I was amazed at how well the Eagles defensive team completely suppressed KC from getting anywhere, and also how poorly the KC defensive team was at shutting down Eagles. Clearly on the day, the Eagles were far superior. It looked to me that the Eagles relaxed their game a little in the 4th quarter which let KC get out of the thrashing they were getting.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Decoy1228",
            "body": "Eagles fans don’t deserve this. They’re the worst",
            "score": -41,
            "replies": [
                {
                    "author": "WhyDoTheyAlwaysRun",
                    "body": "Deserve ain't got nothing to do with it. It was just our time, that's all.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "BuddahSack",
                    "body": "Hahahahahaha I'm not necessarily even an Eagles fan, but I'm from PA and I live outside Philly now, but I love that they won! Eagles fans get a bad rap, for a few decade old instances lol. You wanna see real shit fans look at the Boston Red Sox fans, they are some of the rudest and most racist people I've met or had the displeasure of attending games around",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}