{
    "title": "Couple who died in DC crash honored by local farmers",
    "author": "finding_harmony",
    "subreddit": "MadeMeSmile",
    "rank": 18,
    "score": 2030,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 48,
    "url": "https://v.redd.it/6bimlj3l0zhe1",
    "id": "1inekja",
    "selftext": "",
    "comments": [
        {
            "author": "Starlit_Vale",
            "body": "I don't know a single victim from this crash. But every single video about them and their homecoming brings me to tears",
            "score": 232,
            "replies": []
        },
        {
            "author": "Zapz564",
            "body": "Rest in heavenly peace Bob and Lori Schrock 🙏🏻 condolences to their family, friends and community .🙏🏻",
            "score": 136,
            "replies": []
        },
        {
            "author": "LooseAdhesiveness412",
            "body": "A nice gesture",
            "score": 62,
            "replies": [
                {
                    "author": "lily_quean",
                    "body": "Yup, it's a sweet tribute! Nice to see local communities coming together like this.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "jess_cocksocket4",
                            "body": "Totally, it's heartwarming! :)",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Kharos",
                    "body": "The least they could do. It’s their votes that killed that couple along with hundreds of other people.",
                    "score": -56,
                    "replies": [
                        {
                            "author": "Glittering-Alarm-387",
                            "body": "How so?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": -153,
                    "replies": [
                        {
                            "author": "finding_harmony",
                            "body": "No it was a local couple who were flying to see their kid.",
                            "score": 59,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "LuminouLove",
            "body": "Man, that's what makes rural America so great.",
            "score": 69,
            "replies": [
                {
                    "author": "finding_harmony",
                    "body": "Yes, there’s some really great communities in KS. No, it’s not a destination state, it’s a flyover but these really do take care of each other.",
                    "score": 42,
                    "replies": [
                        {
                            "author": "jess_cocksocket4",
                            "body": "Wow, that's so heartwarming! It's great to see how communities come together in times of need.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "fox_grapen",
                                    "body": "True, deffo heartwarming! Shows how ppl can come together & help each other through the tough times. :)",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Few_Garbages",
                                    "body": "Yeah, it really is. The farmers did a beautiful job honoring the couple who died.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "One_Rough5369",
                    "body": "I'm not from rural America, but I've vacationed there and their acceptance of everyone, gay or straight or black or Asian or trans has always made me respect them.\n\nBeautiful land and beautiful people.",
                    "score": -6,
                    "replies": [
                        {
                            "author": "coalhobbler",
                            "body": "Then they go and vote against all that kindness you speak of.",
                            "score": 34,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DocDibber",
            "body": "Love this. Thank you.",
            "score": 4,
            "replies": []
        },
        {
            "author": "backtoreddit420",
            "body": "Folks from Kansas are a special breed. Such kind and caring people.",
            "score": 16,
            "replies": [
                {
                    "author": "ATLAuto",
                    "body": "Yes we are 🫶🏼💙",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "BadAsBroccoli",
            "body": "How kind and respectful.",
            "score": 9,
            "replies": []
        },
        {
            "author": "graffiksguru",
            "body": "Who started cutting onions in here..\n\nWhat a nice tribute",
            "score": 6,
            "replies": []
        },
        {
            "author": "XxThrowaway987xX",
            "body": "This is a really touching tribute. I hope it brings the family a small ray of hope on their journey with grief.",
            "score": 7,
            "replies": []
        },
        {
            "author": "MelissaMead",
            "body": "More and more stuff here makes me sad....",
            "score": 2,
            "replies": []
        },
        {
            "author": "Sacmo77",
            "body": "Rest in peace.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Specialist-Exit-3285",
            "body": "That's such a touching tribute",
            "score": 1,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "Welcome to /r/MadeMeSmile. Please make sure you read our [rules here.](https://www.reddit.com/r/MadeMeSmile/about/rules/) We'd like to take this time to remind users that:\n\n* We do not allow any type of jerk-like behavior, including but not limited to: personal attacks, hate speech, harassment, racism, sexism, or other jerk-like behavior (includes gatekeeping posts).\n\n* Any sort of post showing a mug, a shirt, or a print is a scam. You will not receive anything except a headache and a stolen credit card.\n\n- [More information regarding rule 1 as well as how mug/shirt/poster scammers operate can be found here.](https://www.reddit.com/r/mademesmile/wiki/rule1)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MadeMeSmile) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "bengalstomp",
            "body": "Very touching tribute. Wonder what the cost of equipment, fuel, man hours, lost productivity etc was here. Those combines exist to make money, which makes it apparent that these people were very loved.",
            "score": 0,
            "replies": [
                {
                    "author": "rearadmiraldumbass",
                    "body": "It's winter. No combines needed.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "JimeVR46",
            "body": "Thought they were tanks",
            "score": 1,
            "replies": []
        },
        {
            "author": "Puzzleheaded-Sun2583",
            "body": "The plane crash these same farmers think DEI and Obama caused?  \n\nBeing \"honored\" by hateful racists traitors is worthless.",
            "score": -25,
            "replies": [
                {
                    "author": "JSC843",
                    "body": "Do you know them? Did all of these farmers that are paying tribute exhibit racist behaviors or blame DEI for the plane crash, or are you just generalizing the entire agriculture industry because they tend to vote republican?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Puzzleheaded-Sun2583",
                            "body": "I dont need to know them to know who they support politically.  You know its true, they know its true, so why lie?",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "JSC843",
                                    "body": "No one is lying about anything. Those could be the most liberal farmers in the country as far as we know. Idk why you gotta make it weird on what is supposed to be a wholesome post about a tragic event.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Puzzleheaded-Sun2583",
                                            "body": "So you agree, DEI and Obama caused the crash?  Gross.  Pretty scummy and disrespectful to the dead.  How do you live with yourself?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Consistent_Dream_740",
                    "body": "My friend was on that plane and I'm so sick of reading horrible comments like this. DEI and Obama had nothing to do with this. JFC. Get a life.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Puzzleheaded-Sun2583",
                            "body": "Sorry for your loss and I agree they had nothing to do with it.  Yet before the bodies were even recovered Trump issued an executive order declaring DEI and Obama caused the crash.  So if you have an issue with it, take it up with Trump and his vile supporters.  Did you not know that?  Or just dont care?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "outofcontextsex",
            "body": "A memorial commemorating a couple's death made you smile?\n\nEdit: so I'm not saying there's anything wrong with there being a memorial I'm saying you're fucking weird if this makes you smile because memorials like funerals are sad things and sad things aren't supposed to make us smile. We're on r/mademesmile not r/Christianmomhas emotionaldepthofmudpuddle.",
            "score": -23,
            "replies": [
                {
                    "author": "finding_harmony",
                    "body": "I was a hospice nurse in rural KS and this  is more KS than the Wizard of Oz.  I’m familiar with death and farmers. Yes, a thoughtful tribute does make me smile. The reason for it is sad, but humans being kind I appreciate.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "Glynwys",
                    "body": "I mean, sure.\n\nIts is a massive gesture. Those farmers just lost an entire day of productivity and money. Not to mention fuel for those giant combines and the manpower costs of keeping them there for an extended period. The couple apparently had their own farming company in Kansas, and for all intents and purposes were extremely loved. Those farmers honored the couple in the best way they knew how, by losing an entire day of work. Which is a huge sacrifice in today's economy.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "outofcontextsex",
                            "body": "Ugh, I get that you think it's good but you understand that something being good and something being the kind of thing that makes you smile aren't always necessarily the same? It's good that they were memorialized, it's fucking weird that it put a smile on your face. Also you may not know much about farming but those combines aren't doing anything right now and I doubt very much the farmers are either, it's February. Which leads me to my other issue which is that you seem to be very focused on what a nice thing these farmers are doing but the point of what the farmers doing is memorializing two people who died which is a sad thing and we generally don't smile about sad things unless we're cracked.",
                            "score": -19,
                            "replies": [
                                {
                                    "author": "Glynwys",
                                    "body": "\n\n\n> a sad thing and we generally don't smile about sad things unless we're cracked.\n\nPretty ignorant of you to assume everyone deals with grief in the same way. Like, I don't have anything else to say here, aside from the fact that you must not get out much to interact with other people. My buddy Robert still smiled after he lost both of his parents back-to-back to cancer when he was 14 because he knew they were no longer in pain. I still smiled when my last grandmother passed because I knew that she would have wanted me to not spend her funeral miserable. Please, just shut up about things you don't understand. \n\n>Also you may not know much about farming but those combines aren't doing anything right now and I doubt very much the farmers are either, it's February\n\nIts almost as if you believe that there are no crops to be grown in February. Even if those combines aren't doing anything, how much money do you think those farmers just lost driving them to that location instead of handling other duties and tasks, to say nothing of fuel. That was my entire point. You're being argumentive simply for the sake of being argumentive.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Curtisd1976",
                    "body": "Just to be clear I wasn’t judging you or anyone. Everyone feels or does things differently, just as people view death in different ways.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Curtisd1976",
                    "body": "It’s remembering someone, which hopefully someone will do for you someday. It doesn’t cost much to be nice.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "snapjackel",
                            "body": "The way I interpreted the comment was that it was a strange sub to post this to - def a beautiful thing to do but it certainly didn’t make me smile (I’m under the impression this sub is to improve the mood?) but happy to be corrected!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}