{
    "title": "This is so sweet :)",
    "author": "Ok_Eggplant6053",
    "subreddit": "MadeMeSmile",
    "rank": 50,
    "score": 10,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 4,
    "url": "https://v.redd.it/hws85hd4p6ie1",
    "id": "1inw8tb",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Welcome to /r/MadeMeSmile. Please make sure you read our [rules here.](https://www.reddit.com/r/MadeMeSmile/about/rules/) We'd like to take this time to remind users that:\n\n* We do not allow any type of jerk-like behavior, including but not limited to: personal attacks, hate speech, harassment, racism, sexism, or other jerk-like behavior (includes gatekeeping posts).\n\n* Any sort of post showing a mug, a shirt, or a print is a scam. You will not receive anything except a headache and a stolen credit card.\n\n- [More information regarding rule 1 as well as how mug/shirt/poster scammers operate can be found here.](https://www.reddit.com/r/mademesmile/wiki/rule1)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/MadeMeSmile) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "GrassChew",
            "body": "Jesus Christ that broke me to tears\n\nLike literally most perfect for that kid. Gets to meet his hero and his hero is one of the few people that can help this little boy understand this fast and confusing world",
            "score": 1,
            "replies": [
                {
                    "author": "Ok_Eggplant6053",
                    "body": "it makes me so happy to see things like this happen. I learned asl from 5th grade up till 9th and wish I was able to continue I should retake classes because it really is so helpful to those around you",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}