{
    "title": "A Call to Action!",
    "author": "Morfolk",
    "subreddit": "ukraine",
    "rank": 1,
    "score": 3207,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 168,
    "url": "https://www.reddit.com/r/ukraine/comments/1j36yvw/a_call_to_action/",
    "id": "1j36yvw",
    "selftext": "As a Ukrainian and one of the founders of this community, I must address you all today, for the global situation has taken a grim turn in the past few days and it will not get better without our actions.\n\nThe agenda of the new White House administration is now undeniably clear — **russia must win this war and restore its position in Europe**. Though unfathomable when such goal initially became public, this reality is now staring us all in the face. We can argue long and hard why they want this but that will only make us lose precious time and initiative. The next steps have already been outlined so we know what is coming:\n\n- cut all aid to Ukraine\n- remove sanctions from russia\n- supply rusia with weaponry (either secretly or openly, depending on how brazen they get).\n\nSo, what can we do?\n\n1. To Americans:\n\nGet a gun and learn to shoot. As someone who has participated in two revolutions, I can tell you that our situation back then wasn’t as dire as yours is now. Unfortunately, I see no way forward for you without civil disobedience and violent resistance. You can continue to write letters and call your representatives but in my view those efforts are now as useful as writing to Putin. This is not even two months of this Presidency - imagine what will happen in two years.\n\n2. To my European friends:\n\nI can tell you what will happen in two years. More specifically I can give two options:\n\n- either we unite and push russia back now in its weakened state\n- or you will face a resurgent russia several years later, armed to the teeth, with a replenished stockpile of ammunition and using the rest of the Ukrainian population as they are doing with their national minorities now - driving them in meat waves to discover artillery positions and clear minefields.\n\nAttend rallies, contact your representatives, organize meetups with other activists to raise noise and to demand to massively increase military aid including boots on the ground. Your politicians will be pressured by the Americans to stop the aid and remove sanctions from russia - you must pressure them back and make your voices heard.\n\nThere is no diplomatic solution to this for both Putin and Trump see themselves as the architects of a new world order and the rest of us must either submit or perish. They are both in the final years of their lives and they will act swiftly. Imagine how many lives could have been saved if Europe stopped Hitler at Czechoslovakia and Sudetenland, we are in the same part of history again. \n\n3. To Ukrainians:\n\nIt’s time for us to fully switch to a war economy. Donate, enlist, and think of every possible way to ensure our existence. Many of you know much better than me what to do but we must be even more serious about it. Either we stop russia now or be forced to fight Europe later.\n\nThe good guys still outnumber the bad ones, but the bad ones are willing to act with ruthless speed and force others to do their bidding. We must act preemptively, and we must act now.",
    "comments": [
        {
            "author": "slipknot_official",
            "body": "As an American and a vet, I’m with you 100%. \n\nThis is an intentional upheaval of the global order where democracy is on the line, and a new order of authoritarianism and stripping of personal, cultural and states sovereignty is the new ocean we find ourselves in. \n\nFind units and trusted sources in Ukraine to donate to. Anything you can. Stay educated and don’t get caught up on defeatism and distractions. \n\nYou got the wake up call.",
            "score": 585,
            "replies": [
                {
                    "author": "762x39innawoods",
                    "body": "Something something... foreign and domestic... something hmmm",
                    "score": 43,
                    "replies": []
                },
                {
                    "author": "Oldguy_1959",
                    "body": "Spot on.\n\nThe values we cherish and defend haven't changed.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Equivalent-Recover-8",
            "body": "Time to regrow the British Army and the rest of NATO.\n\nWe need to learn what the Ukrainian Army has spilt so much blood to learn.\n\n2 major points - we need to massively improve digital encrypted comms and invest heavily in MANPADS and ATGM. Both of which we never really did from the 80s onwards.",
            "score": 262,
            "replies": [
                {
                    "author": "PeriPeriTekken",
                    "body": "Drones, we also need fucktons of drones.\n\nUkrainian drones are great - we should be licensing them for manufacture in the UK (and Europe) which will help fund Ukraine and help us.",
                    "score": 54,
                    "replies": [
                        {
                            "author": "bulgarianlily",
                            "body": "Europe is crammed full of people like me, who are of an age where we have stopped working. Our brains are still sharp, and we have a good work ethic. If only we could volunteer to help remotely, watching drone footage, tracking troop and supply convoys by satellite, anything. Instead I sit here knitting warm socks. And feeling my heart break for the whole shitty mess that should never have happened in the first place.",
                            "score": 54,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Glittering_Turnip526",
            "body": "What an equally heartbreaking, timely and poignant post. There is no hiding it anymore. Everything stated above, will happen. \n\nAMERICANS: You need to fight. it only took Hitler 6 weeks to legally convert Germany's democracy into a dictatorship. They are doing the same thing again. This is the reason for your second amendment. USE IT",
            "score": 786,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 209,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 107,
                            "replies": [
                                {
                                    "author": "Grumpy_Engineer_1984",
                                    "body": "Is that sub a good place to learn about protests and either join them or amplify views and clicks?",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "CuriousCamels",
                                            "body": "Yes, it’s one of, if not the best subs for that. They also have a website:\n\nhttps://www.fiftyfifty.one\n\n\nIndivisible is another good website for ways to act:\n\nhttps://indivisible.org/resource/guide\n\n\n5calls is a good site with an app you can use to look up your representatives and contact them:\n\nhttps://5calls.org/\n\n\nThere’s a march being planned in DC on 3/14:\n\nhttps://nowmarch.org/\n\n\nResistbot will help you write emails and even fax your reps:\n\nhttps://resist.bot/\n\n\nPlease help share and spread these resources. People have gotten too docile, but there are many ways to make a difference while we still have a chance.",
                                            "score": 10,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "TreadheadS",
                            "body": "I've not seen a single US protest. Have there been any? Why isn't it reported more? Thanks for sharing!",
                            "score": 31,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 91,
                                    "replies": [
                                        {
                                            "author": "Glittering_Turnip526",
                                            "body": "They have been small, and they aren't enough. Its not time to send vegans to picket the butcher. These aren't those days anymore. You need to wake up, and realise exactly what you are fighting against. Trump is completely ok to do genocide.\n\nProtest is how you make changes in a democracy. Autocracies only end with bloodshed.",
                                            "score": 23,
                                            "replies": []
                                        },
                                        {
                                            "author": "LucccyVanPelt",
                                            "body": "So where are the demonstrations which are large enough to actually make a difference or have any bigger news coverage? Like Womens march demonstrations? German newspapers are actually writing about it that it is really quiet in the US for such a dismantling of the state (Spiegel article yesterday for example).",
                                            "score": 21,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[deleted]",
                                                    "score": 36,
                                                    "replies": [
                                                        {
                                                            "author": "LucccyVanPelt",
                                                            "body": "From my experience as a volunteer in politics and activism, all I can say is you need bipartisan demonstrations, for example veterans standing up together because they're getting fired en masse right now. Not signs portraying Vance as a couch fucker (although it is funny), but real facts that matter to all Americans. National security, lack of workers (because deported) and the resulting damage to your economy, inflation, etc. pp. you know the facts better yourself. If \"only\" Democrats protest, your government can always say: we don't care, they lost anyway and we know they don't agree with our policies. Stand together with the reasonable conservatives! And thank you for the link, will look into upcoming demonstrations. Don't give up, democracy needs you!!\n\nand PS: I saw a few people in protests wearing kuffiyas.. this is not about palestine, this is about the US democracy. Any sane republican won't protest with you if you wear stuff like that. Be reasonable for once for a greater good.",
                                                            "score": 46,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "UAVolunteerVeteran",
                                                    "body": "Demonstrations aren't going to make a difference. The time for that is past. Buy a gun and learn how to use it.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "ukraine-ModTeam",
                                                            "body": "We remove all russian narratives and content about russian matters, including the statements and activities of prominent russians, unless it is significant news related to positive military outcomes for Ukraine.  All russia-produced content, state-produced media, and social media will be removed.  Analysis of russian propaganda, however well-intentioned, spreads the poison and will be removed.\n\n[Feel free to browse our rules here.](https://www.reddit.com/r/ukraine/about/rules)",
                                                            "score": 11,
                                                            "replies": [
                                                                {
                                                                    "author": "serrated_edge321",
                                                                    "body": "That's nice, and I appreciate that... But this was written by a human from the US who now lives in the EU. Trying to provide insight why people in the US aren't burning cars like in France. 🤷🏼‍♀️\n\nEdit: \n\nBtw don't kill the messenger! I'm on Ukraine's side. \n\nI just spent the last hour sending people all over Reddit messages about how they can *act against* the crazy goons in the US administration. It's time for them to act, yes! But there's also reasons why they haven't yet. \n\nHere's a copy of that info, for everyone else here: \n\n- - - -\n\nIf you're not aware already, here's helpful links to spread: \n\nhttps://5calls.org\n\nhttps://www.fiftyfifty.one/\n\nhttps://www.reddit.com/r/50501/s/poqEFy7WGE \n(r/50501)\n\nHelp with the resistance! There's already people protesting, it's just been subdued by media censorship. Get the word out!",
                                                                    "score": 9,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "AromaticCycle1053",
                                    "body": "We have been protesting in every state, but the media is not covering it.",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "jeetjejll",
                                    "body": "I suspect because the media is censored and because still almost 50% supports mr tyrant.",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "serrated_edge321",
                                            "body": "If you're not aware already, here's helpful links to spread: \n\nhttps://5calls.org\n\nhttps://www.fiftyfifty.one/\n\nhttps://www.reddit.com/r/50501/s/poqEFy7WGE \n(r/50501)\n\nHelp with the resistance! There's already people protesting, it's just been subdued by media censorship. Get the word out!",
                                            "score": 7,
                                            "replies": []
                                        },
                                        {
                                            "author": "PinguPST",
                                            "body": "No, I went to the demo in San Diego. It was pathetic. Supposedly the House of Ukraine organized it; there were five people there.  The organizers didn't even show up. It was out in the suburbs at rush hour; hard to get to and pointless\n\nI am old enough to remember Vietnam. They could put thousands of people in the streets no problem. Even that didn't stop the war. What stopped the war was 60,000 Americans coming back in body bags and the armed resistance of the Vietnamese. I regret to say it, but it  but the peaceful protests aren't gonna do shit. As someone else noted, Hitler turned Germany into a dictatorship in six weeks. Trump, Musk and Vance are crazy. Don't be defeatist, but be serious",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "bamamed67",
                                            "body": "Yep",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Objective-Common-175",
                                    "body": "There have been several protests. My daughter lives in the Baltimore area and is participating in her second protest today.",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "HURTz_56",
                                    "body": "The American population has been softened up for this since 2016. The culture has changed.",
                                    "score": 10,
                                    "replies": []
                                },
                                {
                                    "author": "Delgra",
                                    "body": "My town in the middle of Oregon state has been organizing protests. Almost no press cares.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Skiddienyc1978",
                                    "body": "There have been protests.  As Winkinsburst stated, the media hasn't covered much of this.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "kmoonster",
                                    "body": "In my city we had (I think) at least 25 events in a month with 28 days, and in March we've been averaging a minimum of 8-9 per week; and that's just the ones I'm aware of.\n\nI don't know why it's not covered more, even on local news something *might* get 30 seconds up to about two minutes of generic coverage. It's a little eerie, because in the past every news agency was fighting each other for coverage if so much as 30 or 40 people showed up to protest something, and most of the ones these last few weeks have had one or two reporters, sometimes none.\n\nAnd my area is not exceptional, we're pretty average. Granted, no violent or intense standoffs yet, these are more like rallies than anything but many of them are still in the thousands or tens of thousands of people even in areas with small populations.\n\nAnd conservatives / Trump voters are getting in on it, too, though in a different way. Check this series of clips from last week's community meetings. (Congress was 'home' last week, and community meetings are a pretty normal part of being \"at home\"; keep in mind that Seattle, WA to Miami, FL is the same distance as London to Baghdad, Iraq. Congress doesn't just get on a train and go DC/home every day, they do a few days or weeks (or months) in DC and then have a recess period where they are in their offices in their districts taking meetings and office hours.\n\nFrom my city to DC is the same distance as Dublin, Ireland to Kyiv. And I'm only halfway across the country. When Congress is home, meetings are usually pretty generic meet-and-greets, but this last week was decidedly *not* generic. These are all from districts that went very strongly for Trump, with most of the public present being Trump supporters (most introduced themselves, but that was edited out for brevity in this sequence). They were *merciless* taking their MAGA reps to the cleaners: [https://youtu.be/j7lXWNWzmtc?si=MtgnXfouAx0Uu1yy](https://youtu.be/j7lXWNWzmtc?si=MtgnXfouAx0Uu1yy)",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "VintageLilly317",
                                    "body": "There are protests every single day in every city, but they are not being reported on. It is leaving the rest of the world to think we don’t care, but we DO!  My heart is ripped to shreds and when I picture that press conference, I cannot stop the tears, because I do not understand what the hell is happening. \n\nSo many are already in this fight. Please anyone who sees the protests, share the news, no one else is and the media not reporting is a tool to sow global disconnect. r/50501",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Glittering_Turnip526",
                            "body": "there will be a lot of media coverage if you start shooting.",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "IDOWNVOTERUSSIANS",
                            "body": "> Please know our police and military have significantly more weapons and at this time\n\nThis is not true, by a lot - usa civilians possess around 98-99% of all guns in the country. The rest are held by police and military. Fix this now, it's misinformation at best, disinformation at worst.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Flaky_Calligrapher62",
                            "body": "So glad I clicked on this. How can we learn about these protests? I haven't seen a lot about them online.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "UAVolunteerVeteran",
                            "body": "You know what police and the military DON'T have?\n\nDrone jammers.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "cipheos",
                    "body": "Inb4 \"But Hitler was defeated in the end, so everything will be fine this time as well.\" Guess again.",
                    "score": 123,
                    "replies": [
                        {
                            "author": "serrated_edge321",
                            "body": "If you're not aware already, here's helpful links to spread: \n\nhttps://5calls.org\n\nhttps://www.fiftyfifty.one/\n\nhttps://www.reddit.com/r/50501/s/poqEFy7WGE \n(r/50501)\n\nHelp with the resistance! There's already people protesting, it's just been subdued by media censorship. Get the word out!",
                            "score": 79,
                            "replies": [
                                {
                                    "author": "cipheos",
                                    "body": "My American friends aren't particularly pro-trump either way, but I'll definitely drop the links, thanks!",
                                    "score": 27,
                                    "replies": [
                                        {
                                            "author": "serrated_edge321",
                                            "body": "You're welcome! \n\nI'm just posting this allll over Reddit because I think it's important that people get the word out ASAP. Maybe you can at least help with this much! ✌🏼💪🏼",
                                            "score": 16,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "lonehorse1",
                                    "body": "We are also fighting in r/CANUSHelp, it is much more organized than r/50501",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "serrated_edge321",
                                            "body": "Ok, I'll add that to the list!",
                                            "score": 8,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "americanweebeastie",
                                    "body": "just now reading :: The Project Gutenberg eBook of Simple Sabotage Field Manual",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SilverDad-o",
                    "body": "So, at whom should resistant Americans aim?",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "kmoonster",
                    "body": "Almost every action Trump has taken is tied up in court and either frozen or reversed. I don't think that is making international news, and it's reported so haphazardly in the US that it feels like less than it is. Nearly every action except tariffs and the ceremonial \"name change\" type stuff is reversed or frozen and being duked out in court. But you wouldn't know that by the latest headline quoting Trump's most recent executive order or social media post.\n\n[Litigation Tracker: Legal Challenges to Trump Administration Actions](https://www.justsecurity.org/107087/tracker-litigation-legal-challenges-trump-administration/)\n\nAs of writing this comment there is at least one lawsuit with Ukrainians in the US as complainants in regards to Trump's threat to withdraw their protected status; and at least three other similar suits without Ukrainians but on the same question. None are yet resolved this term, but most of these suits in his first term succeeded in denying the administration the ability to revoke protected status (meaning people could remain in the US).\n\nThat's not to say we couldn't be doing more visible actions, our messaging right now is shit; but if it helps my current read on the situation is that the BIG protest pushes are waiting for something that isn't going to end up in court before you even get your crowd assembled.\n\nIn the meanwhile, the BIG actions are responding to immigration sweeps and protesting *inside* state capitols to smack down the hundreds of bullshit bills Trump's party is trying to pass at the state level. \n\n* On immigration, the agency's stated goal has been 1,500 arrests per day, and thanks to insane organizing and real-time legal interventions they are rarely taking more than 100 per day and often less. This is only making occasional news in the US and I would be surprised if it is breaking through internationally; but make no mistake this is a *massive* undertaking considering the continental US is larger than continental Europe and that every sweep is either unannounced or is known only minutes to hours in advance.\n* In state houses, keep in mind that each state is *almost* its own country in most regards; that's a separate discussion but what it means is that each state can create and enforce its own laws as long as the laws are not involving international relations or immigration. And Trump's party has been bringing bills almost daily in most states, most of the bills are examples/models they want to \"test run\" and eventually introduce in Congress. And they have been failing, miserably, because people show up in hundreds or thousands while the bills are still in committee before even going out for a full vote with the legislature.\n   * Some bills are getting through, obviously, but a stunning number are failing, and often dramatically when the public show up and use public comment to outline all the ways this or that bill would open up the state to lawsuits or that the proposed law could be evaded, that enforcement would require the violation of multiple civil rights, and so on. The bill I sat in on two weeks ago had five *hours* of public comment offered, with each person limited to two or three minutes. No breaks. And hundreds more sat in but did not offer comment except to indicate their level of support for whoever happened to be speaking at each moment.\n* Congress was \"in district\" last week meaning they were at home, and most held community meetings. And a funny thing happened. The larger the vote for Trump in a given district, the more forcefully Republican voters showed up to harass their representatives for letting Trump and Musk have free reign without Congressional pushback. Here is a two minute collection of clips from some of the meetings, but this was happening all over the country last week. It was a pretty wild ride, so much so that the Republican party advised their members to cancel remaining meetings and do them virtually instead: [https://youtu.be/j7lXWNWzmtc?si=MtgnXfouAx0Uu1yy](https://youtu.be/j7lXWNWzmtc?si=MtgnXfouAx0Uu1yy)\n\nThe time for force will come, I have no doubt -- but just because we aren't laying in the streets right now doesn't mean we are sitting around picking our noses.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "UAVolunteerVeteran",
                    "body": "Okay, but fight WHO? Where?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "PanTheOpticon",
            "body": "Doing my part as always and have donated today to the \"Wild Hornets\", \"Ukraine Aid Ops\" and the \"Renegade Relief Foundation\".\n\nAnd I've also invested yesterday nice sums into two European Armaments ETFs.\n\nThe US is not on our side anymore but we're in this together as Europeans and we will come out of this stronger!\n\nThankfully our new chancellor here in Germany seems to understand this new reality so far and will hopefully act accordingly.",
            "score": 108,
            "replies": [
                {
                    "author": "Jet2work",
                    "body": "whilst the american government may be in putins pocket. As a brit i have met americans fighting in ukraine, i have supported, support and will continue to support as much as i can ALL the heroes protecting ukraine...this is the time to let a united strength win... trump is not america or the american spirit, europe is a sleeping giant and this week was the alarm call...i started my own company in ukraine... it is small and struggling but my future plans do not include russia.  i am proud to call ukraine my home and ukrainian people my friends...lets work together",
                    "score": 64,
                    "replies": [
                        {
                            "author": "PanTheOpticon",
                            "body": "Absolutely, I've meant the US government when I spoke about the US because they're sadly the ones that make these horrendous decisions for all Americans right now whether they like it or not.\n\nI absolutely support everyone who is fighting for Ukraine at the front or helping people in Ukraine as volunteers and I admire their bravery.",
                            "score": 21,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Naughteus_Maximus",
                    "body": "+1 for wild hornets. \"The more we kill now, the fewer will our children have to kill\" - R. Ratushniy",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "Majoranese",
                    "body": "Which ETFs?\nI can only find ones with Like 60% us Stocks...",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Saqretair",
                            "body": "I'd like to know too",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Boatsntanks",
                            "body": "I only looked quickly and am not an expert, but \"STOXX Europe Aerospace & Defense ETF\" seems reasonable.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "PanTheOpticon",
                            "body": "The \"iShares STOXX Europe 600 industrial goods & services\" (not completely defense centric but definetively EU centric) and VanEck Defense. Not completely happy with VanEck because there is a lot of US stock in it but my bank won't let me buy \"STOXX Europe Aerospace & Defense\".\n\nI'm of course open to other suggestions!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MajorKabakov",
            "body": "I am a retiree and on a fixed income now. I have been donating a small amount of money monthly since the war started. After watching Trump and Vance ambush president Zelensky and betray Ukraine, I have doubled that. \n\nI apologize I can’t do more, and I am ashamed of my country right now",
            "score": 91,
            "replies": [
                {
                    "author": "Historical_Bag_1788",
                    "body": "Do what you can, we all have our limits.",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "serrated_edge321",
                    "body": "There's a bit more you can do! \n\nhttps://5calls.org\n\nhttps://www.fiftyfifty.one/\n\nHelp with the resistance!",
                    "score": 19,
                    "replies": [
                        {
                            "author": "MajorKabakov",
                            "body": "Thank you!",
                            "score": 9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BrokenFist-73",
                    "body": "Thankyou sir. I appreciate your donation, but above all, your attitide and willingness to make a financial sacrifice however big or small.\nI am sure there must be  tens, if not hundreds of thousands of Americans who think and feel like you do- you must communicate with each other and get the message out, not in a confrontational way as that will just play into their hands but in a logical, factual way. The word needs to be spread. It is time now to stand up and be counted, before it is too late.\nThankyou again, for your efforts.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "MajorKabakov",
                            "body": "My sacrifices are merely financial. Ukrainians pay in blood.",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "BrokenFist-73",
                                    "body": "We all do what we can.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Suyalus22669900",
            "body": "@.America: I thought the NRA was there to fight corrupt govs? Your time has come...\n\n@.Europe: appeasement is over, it never was a thing. it never worked, will never work, especially not with putler. time to REALLY support Ukraine NOW with all of our might. Europe MUST DEFEAT ruzzia NOW. Close the skies, send MASSIVE amounts of ammunition, missiles, tanks, IFV etc, send supporting troops as a first stage, later combat troops that guard the northern border with belaruz for example.\n\n  \nWe must deliver the killing blow now or it will get even worse... ruzzia can never be trusted",
            "score": 53,
            "replies": [
                {
                    "author": "doughball27",
                    "body": "The NRA was captured by Russian influence like so many lobbying groups in our country. \n\nThe NRA pretends to be about “watering the tree of liberty with the blood of tyrants” but they define tyrants as democrats who want universal health care. It’s bonkers.",
                    "score": 28,
                    "replies": [
                        {
                            "author": "Suyalus22669900",
                            "body": "ah damn :/",
                            "score": 9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "kmoonster",
                    "body": "Nearly everything out of Trump's White House so far is either reversed or frozen, but that doesn't make sexy headlines.\n\nPlus, Team Trump spits so much shit, so fast, that you can't even keep up with what they are putting out - never mind where they are being stopped.\n\nYou can track lawsuits here: [Litigation Tracker: Legal Challenges to Trump Administration Actions](https://www.justsecurity.org/107087/tracker-litigation-legal-challenges-trump-administration/)\n\nAs of March 6, there are at least 104 and this tracker is a bit laggy (but still pretty good).\n\n  \nThe NRA was taken over by culture wars and then, literally, by russian propaganda. One of their honeypots was openly making the rounds in the NRA under Trump 1.0. The head of the NRA was ousted, they've been taken to court for fraud, their donations are down to unsustainably low levels (which further raises the spectre of literal russian money being put into the org)...bunch of shit over the last ten years.\n\nThe 2A crowd is pretty brazen about telling you they are all about guns, but my experience is that all segments of the populace are roughly equally armed (except for the superfan types, but those are a wild outlier). At the large scale, gun ownership is pretty even across all groups. Just that most of us have no reason to talk about it or brandish the guns in public. They're tools for most, not a fetish. But you only ever hear about it from the fetish crowd.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ChronicBuzz187",
            "body": "All this talk about \"World War 3\" fails to realize we're already in it. Russia attacked a sovereign state and has already threatened nuclear war multiple times and now the alleged \"leader of the free world\" wants to roll over and give them what they want?\n\nI'm old enough to remember a time where US conservatives would have gone to war with Russia over less than this. Now they're Putin's allies.\n\nI say: Fuck them. All of them. They're TRAITORS to the free world and we should treat them like it. No more groveling at the feet of the US. If they want to isolate, we should not just let them but actively work towards making them pariahs just like Russia.",
            "score": 94,
            "replies": [
                {
                    "author": "ZapAndQuartz",
                    "body": "On Friday and even more so with the announcement of the blockade of military support, I finally stopped denying that this IS world war 3... It is. America and Russia (+ maybe China? Who knows with them) versus Europe, Canada, possibly Mexico, possibly Japan, possibly Australia... \n\nBut it's not like in the movies. It doesn't start with nukes, it ends with nukes. But until then we have years of suffering and frankly, this all wouldn't have happened if Putin didn't have such a tiny dick",
                    "score": 25,
                    "replies": [
                        {
                            "author": "ChronicBuzz187",
                            "body": ">\\+ maybe China?\n\nPretty sure China is going to sit this one out so they are the last superpower that remains once all this shit is over.\n\nThey're probably going \"*It's all going according to our plan*\" while doing a villainous laugh in Peking right now.",
                            "score": 27,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Miserable-Dream6724",
                    "body": "As an American,  I have to support this. The inmates are running the jail (and the government) now. I'm protesting, spreading the word, harassing my reps... really doing everything I can. Many, many of us are, but I fear it's too late. We're already in a constitutional crisis and I think if the administration willfully disobeys a major court order, openly defies congress, or if mass violence erupts, it will seal our fate. In my honest opinion, our only hope is if the military disobeys orders illegal from Trump, but he has placed sycophants everywhere at the top so I don't have much faith.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "ChronicBuzz187",
                            "body": "It's not even a jail, it's the Arkham Asylum at this point.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "davew111",
                    "body": "It wasn't that long ago that conservatives were all about military intervention overseas. \"fight them over there so we don't fight them over here.\" Rush, Hannity, Savage, I heard them all of them make that point. Then Trump comes along and all of a sudden they are isolationist, and they act like they always were.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "jeetjejll",
            "body": "I don’t want to hear this, I don’t want it to be true.\n\nBut it is the painful truth.\n\nWe can use some of your bravery, I know I can, I know nothing about surviving a war. Thank you for sharing.",
            "score": 21,
            "replies": []
        },
        {
            "author": "The_Draken24",
            "body": "The disinformation in America is running so deep. Half my family supports Ukraine and the other half doesn't. When I ask the ones that don't, why, I'm met with Russian talking points. They aren't getting their views from Fox News or other right leaning news sources but from podcasters/YouTubers whose pockets are filled by Russians. I didn't realize how bad it was until Zelenskyy's recent visit.",
            "score": 24,
            "replies": []
        },
        {
            "author": "AnonVinky",
            "body": "Ukrainian flag, covering 'concerning' stickers with my own stickers, stickers on my vehicles.\n\nContacting my party (Volt) to push for agressive aid and to suggest European discussion on a formal declaration of war.",
            "score": 17,
            "replies": []
        },
        {
            "author": "X-East",
            "body": "It would not be uncharacteristic of Trump if he is already leaking Ukrainian intel to russians, for mission security europe should ban US spy planes over their airspace and keep all dealings with ukraine private",
            "score": 29,
            "replies": [
                {
                    "author": "ZapAndQuartz",
                    "body": "Do we have our own spy planes or at the very least capability to build them? What about Radar coverage?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "vms-crot",
                            "body": "RAF flies Rivet Joint out near Ukraine already scooping up information.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "FaderJockey2600",
                            "body": "The E3C Sentry AWACS over Europe are operated by NATO, not by the US.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Veraenderer",
            "body": "As a german, I feel that our politicans are waking up. But there are still many people which are naive.",
            "score": 14,
            "replies": [
                {
                    "author": "Ringo308",
                    "body": "I'm German, too. Germany is always so slow with everything. I hope they're waking up in time. If they do, they can move mountains if they put their mind to it.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Klefaxidus",
            "body": "r/50501",
            "score": 9,
            "replies": []
        },
        {
            "author": "Playful_Device3521",
            "body": "I’m struggling to find rallies here in The Netherlands. I’d like to show my support. \n\nIf anyone has a good suggestion or advice, please let me know.",
            "score": 24,
            "replies": [
                {
                    "author": "CriticalBath2367",
                    "body": "Over Europe's dead body will Ukraine be allowed to fall, if America decides to ally itself with Putin then we will take them down with us.",
                    "score": 20,
                    "replies": [
                        {
                            "author": "UpperCardiologist523",
                            "body": "There is no \"if\" anymore. Even if USA is not yet allied with russia, it's clear we can't rely on them, so the only sensible things to prepare for the worst.",
                            "score": 14,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Jet2work",
                    "body": "donate...give up 1 beer a week... all small ammounts add up",
                    "score": 12,
                    "replies": [
                        {
                            "author": "Playful_Device3521",
                            "body": "Oh, trust me, I sure do! But as we’re in the Netherlands fighting against an extreme right wing party, that’s Russia minded, we need to make it very clear that we’re not selling out to Russia. Never. Traitors need to be exposed, very clearly.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "UnsoundMethods64",
                                    "body": "Vote the fuckers out. The BBB, FVD, PVV, they need to sink back where they came from. Almost ashamed to be part Dutch",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "jeetjejll",
                    "body": "I think Dutch politicians are susceptible to public opinions, write them? And how about we buy Ukrainian+European flag stickers and just keep spreading them? Research says people want Europe to do more, but not their own country doing more, we need to change this. All of us have to help by accepting more taxes go to war, less to ourselves.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Figen91",
                    "body": "If there aren't any events near you, then be the instigator of change.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Kalichun",
            "body": "AMERICANS: if you can sway 5 Republicans in House and Senate to stop this madness there might still be a chance of pushing back",
            "score": 14,
            "replies": []
        },
        {
            "author": "MykolaivBear",
            "body": "Remember friends, no amount of donation is too small, everything counts!",
            "score": 12,
            "replies": [
                {
                    "author": "96tearsand96eyes",
                    "body": "Where is the best place to donate? As an American I want to support you.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Boatsntanks",
                            "body": "united24 is a fine place to start",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "MykolaivBear",
                                    "body": "Agree with this ^",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "oldcatsarecute",
                            "body": "I donated to Ukraine Front Line, my 88 yr old mom asked where she can donate so I shared it with her. Last year I donated to a drone fund ($500 per drone) but I haven't seen it listed recently.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "NewsteadMtnMama",
            "body": "As an American and historian, I have been screaming into the void since 2016 that we are now 1930s Germany. An Auschwitz survivor who lost both parents to the gas chambers would speak to my classes and one thing she kept saying was that when her father wanted to leave Germany in the mid 1930s her mother would say \"This is Germany! We will be fine - the worst won't happen here\". I am afraid that is the mindset of most Americans right now - they are certain \"it\" can't happen here, that our democracy is over 200 years old, that our checks and balances will hold, that Trump isn't as bad as some say, that the midterm elections will save us.\n\nIt IS happening here, he IS as bad as those of us are saying and I am scared to death it is already too late. With the richest man in the world pushing us into autocracy and most billionaires behind him, along with a majority in our Congress and the Cabinet, it IS happening faster than any of us could have believed. Although a few Republicans are starting to have doubts, it is too little and too late - they are Hindenburg and von Papen who thought they could use and control Hitler for their own gains and just like they did, are finding out that they cannot control Trump and the puppet masters like Putin and Musk behind him. \n\nWe are circling the drain here in the US. For all that is still good in this world, all of Europe and Canada MUST stand united for Ukraine and against Russia, and sadly, the US.",
            "score": 16,
            "replies": []
        },
        {
            "author": "_x_x_x_x_x",
            "body": "Likes and reposts don't count.",
            "score": 10,
            "replies": [
                {
                    "author": "doughball27",
                    "body": "And this is the problem with online activism. It doesn’t actually bring people together in a meaningful way. We need real community orgs to do that.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "serrated_edge321",
                            "body": "Here's some links to spread:\n\nhttps://5calls.org\n\nhttps://www.fiftyfifty.one/\n\nHelp with the resistance!",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "_x_x_x_x_x",
                            "body": "Correct. Clicktivism is a pacification mechanism that exploits the same cognitive glitch that planning to do something outside of your comfort zone and then telling someone about it causes. \n\nYour brain perceives you as have already done the thing, so your enthusiasm for it falls drastically, often as youre telling someone about the plan.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "keveazy",
            "body": "Not only Ukraine should switch to a War Economy. All European countries that share a border with Russia should do the same. \n\nHeck i would even suggest, the time to Declare War on Russia is now.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Good-War-569",
            "body": "Thank you for the tips we appreciate your input. What can we do as Americans to boost you financially is there a website that we can go to to donate to the Ukrainian war aside from white stork?",
            "score": 4,
            "replies": [
                {
                    "author": "The-Rare-Road",
                    "body": "Yes, there is a list of registered charities under resources on this sub, however to save you time.. please send help on these official websites also.. UNITED24, Ukraine Aid Ops!\n\nthey all help with defence and the war effort.\n\nalso AZOV ONE.\n\nCome back alive foundation.\n\nthank you for your support!!\n\ntake your pick, from each one they all help.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Historical_Bag_1788",
            "body": "USA is all about money, stop giving money to them. Nothing from Amazon, Kobo is Canadian, switch to that for books. Don't use visa or mastercard if other payment methods can be used. \n\nCan the Zrada app be adjusted for USA companies.  I am going through everything to stop supporting US companies.  I gave up most chocolate consumption for Ukraine.  Now I am seeing what else has to go.  There are always alternatives. \n\nI believe this is the one thing that will scare them but we all have to do it.",
            "score": 12,
            "replies": []
        },
        {
            "author": "taty6",
            "body": "Sen. Tommy Tuberville (R-Ala.), a staunch supporter of President Trump’s, said Russia and the United States will ultimately determine the fate of the war in Ukraine, saying the war-torn democracy’s president, Volodymyr Zelensky, is “not even in the game.\"\n\nhttps://thehill.com/homenews/senate/5173445-tuberville-zelensky-ukraine-war-trump-vance-putin/",
            "score": 6,
            "replies": []
        },
        {
            "author": "klmnopthro",
            "body": "Thank you so much for the input step one done we just recently completed that. Also what can we do as Americans to support you financially do you know of a website that we can go to to donate? I am aware of white stork and donated to that. I'm sure there's a better way to give the Ukraine money to help with the war from Americans. There's so many of us that would want to help.\n\nUSAF Veteran here",
            "score": 3,
            "replies": []
        },
        {
            "author": "maddsskills",
            "body": "I made a post but was notified to come to the mega thread so I hope I am in the right place.  \n\nI’m curious as to what Zelensky has told Ukrainians about going back to the White House to negotiate peace.  It makes no sense to me.  We all know Trump and Putin aren’t going to budge so what is the point of further negotiations?  \n\nIs he going to hand over the mineral rights in exchange for continued support?  That’s not “negotiating for peace” but I imagine Zelensky is using that term as the euphemism it is.  \n\nThere’s no way he’ll agree to Putin’s demands right?  \n\nEither way I am furious at Europe.  They’re the second largest economy in the world, they can afford to support Ukraine and tell the US to screw off.  Ukrainians are dying to protect Europe, the least they can do is give them as much support as possible. \n\nAll that “we’ll never do appeasement to fascists again!” talk was BS.  I’m furious.  \n\nAlso wanted to add: very few Americans understand what is happening here.  I’ve been running around like someone on fire saying how close we are to dictatorship, he’s literally doing it right in front of our eyes.  Trump and Putin are existential threats to the entire world and it is frustrating that people don’t see it.  \n\nBut there are people who know and we’re coming together.",
            "score": 3,
            "replies": []
        },
        {
            "author": "GrapefruitNo3600",
            "body": "Yup. Wer in the middle of crossroads that requires courage to take the right choice.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Major__Factor",
            "body": "Dear Americans, you got your tyranny, that you have been warned about all of your life, right now. Act like it.",
            "score": 4,
            "replies": []
        },
        {
            "author": "sasjaix",
            "body": "As an European: We will stand up. Yesterday's meeting was the beginning. We have woken up and we will come to your aid. We are 450 millioms strong and we feel the urgency to stop this.\nWe know America is out of the game and will be against us. We will be ready to pay that price. \nUkraine will never fall. Ukraine will become our biggest manufacturing and knowledge partner of defence in the future. So we will need you as much as you need us now.\nWe will prevail and become a bigger and better Europe..",
            "score": 4,
            "replies": []
        },
        {
            "author": "Skiddienyc1978",
            "body": "It is by design to cause chaos, disaster and upheaval.  The good people need to unite to ensure democracy and freedom.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Walking72",
            "body": "\"It can't happen here\"\n🇺🇲",
            "score": 2,
            "replies": []
        },
        {
            "author": "Gullible-Tour759",
            "body": "As i have said before, america should already be thinking of ways to remove the clown in the whitehouse. Civil unrest is good but not good enough, a coup maybe be better.",
            "score": 4,
            "replies": []
        },
        {
            "author": "ClownMorty",
            "body": ">To Americans: Get a gun and learn to shoot.\n\nNot to be facetious, but, we already did this step.",
            "score": 3,
            "replies": []
        },
        {
            "author": "JoshIsASoftie",
            "body": "And to Canadians:  don't let the Conservatives gain an inch this upcoming election. They are in bed with musk, tr*mp, and putin. Buy Canadian and European products. Keep supporting Ukraine. ❤️",
            "score": 3,
            "replies": []
        },
        {
            "author": "Confident_Fudge2984",
            "body": "I have been waiting for the American maidan! I’m well prepared!",
            "score": 3,
            "replies": []
        },
        {
            "author": "Ringo308",
            "body": "Fuck Trump. He's three Big Macs away from resting in a box six feet under, but he had to use his remaining time to ruin the world. It's madness.",
            "score": 3,
            "replies": []
        },
        {
            "author": "External_Koala_2042",
            "body": "Do not casually buy a gun. It requires a commitment of time and a high level of personal responsibility.  Don't let your purchase of a gun take away from your activities to resist this authoritarian wave.  A gun is not a passive object to be stored and ignored.  It is a bomb you must constantly be responsible for controlling.  Those who oppose us and those who will fight us if ordered already have many guns. Your gun can easily be taken from you. Owning a gun is not a piece of magic and is an important responsibility. If you are willing to step up, take the necessary training, constantly practice, and make the necessary change in personal responsibility, then carefully evaluate and buy a gun. Always remember that a gun is more likely to kill someone you already know and probably someone you love.  You must always stand guard against that likelihood.  Bringing a gun into your life is a powerful thing to do but is not as powerful as you might expect, and it is more dangerous than most of us are used to having, Don't do it casually.\n\nAll that being said, these are times to be resolute and bold.  We each must act fully and act now.  The time is urgent.  Find what you can do and do it all. Do it now.",
            "score": 3,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "\nПривіт u/Morfolk ! During wartime, this community is focused on vital and high-effort content. Please ensure your post follows [r/Ukraine Rules](https://www.reddit.com/r/ukraine/about/rules).\n\n**Want to support Ukraine?**  [**Vetted Charities List**](https://www.reddit.com/r/ukraine/wiki/charities) | [Our Vetting Process](https://www.reddit.com/r/ukraine/wiki/charities-vetting)\n\n**Daily series on Ukraine's history & culture:**  [Sunrise Posts Organized By Category](https://www.reddit.com/r/ukraine/wiki/sunriseposts/)\n\n**To learn about how you can support Ukraine politically, visit r/ActionForUkraine**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ukraine) if you have any questions or concerns.*",
            "score": 2,
            "replies": []
        },
        {
            "author": "cealild",
            "body": "Completely acting on point 2. European.",
            "score": 2,
            "replies": []
        },
        {
            "author": "testingthrowaway1515",
            "body": "THIS!!!!!!!!",
            "score": 2,
            "replies": []
        },
        {
            "author": "human-redditbot",
            "body": "I am so sorry, Ukraine, that you have to go through all this. \n\nStay strong, and Europe will rise to the occasion.\n\nIt will take time to get the European gears working, but you will not be abandoned! 🇺🇦 🙏🇪🇺",
            "score": 2,
            "replies": []
        },
        {
            "author": "96tearsand96eyes",
            "body": "Thank you!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Practical-Bobcat2911",
            "body": "Good post, also remember you can donate to the various donating initiatives for Ukrainian artilerry shells. This Slovakian initiative already raised almost 5 million euros (!). Makes me proud to be a European. [Ammunition for Ukraine - If not the government, we send](https://www.municiapreukrajinu.sk/en)",
            "score": 2,
            "replies": []
        },
        {
            "author": "Educational-Ear-3136",
            "body": "🇨🇦🤝🏼🇺🇦",
            "score": 2,
            "replies": []
        },
        {
            "author": "Rad_Energetics",
            "body": "Excellent post💪",
            "score": 2,
            "replies": []
        },
        {
            "author": "arthurno1",
            "body": "As a europiean I have been saying this for a long: NATO (EU) has to close the skies over Ukraine and give Ukraine the latest tech needed to win the war and push back Russia out of Ukraine.",
            "score": 2,
            "replies": []
        },
        {
            "author": "MeasureforMeasure2",
            "body": "\nI really appreciate this and I think that there's some truth to what you say. I am not in any way shooting you down. We, as Americans and europeans, must resist. However, I simply do not think that Drumpf and co. could transform the usa into a dictatorship as easily as Hitler could. Hitler was able to do this in 1933 Germany by way of the enabling act.\n\nhttps://en.m.wikipedia.org/wiki/Enabling_Act_of_1933\n\nThis was a law that was a law passed by the Weimar Reichstag. It gave Hitler and his cabinet legal power to rule autocratically. The big cheeto and his DOGE yes-men could not do this. Congress is basically 50-50 now in the US, and so no one is voting him any sort of dictatorial power anything soon.\n\nNow, I don't know agree that 2025 is a sort of attempted coup. They are doing damage, and who's to say who in the military and police would or would jot side with Trump when push comes to shove. But legal power? He still can't obtain that. Dictators need this. For example, Erdogan altered Turkey's constitution when he took power. Now he can't be kicked out. Same can be said for Orbán. I don't know about the head of Ruzzia, but I'm\ngonna take a bet that he probably got legal power somehow.\n\nNow, while Trump has evaded the law regarding his own person, he is yet to change the law to suite the power grab he desperately wants. The US Constitution is still strong enough to prevent him. Trump can't do what Hitler, or any of them, have done. \n\nThis is an article from Vox that backs up my reasoning. I learned a lot of this argument from them and I think that they make a good point. \n\nhttps://www.reddit.com/r/OptimistsUnite/s/FFd840CQoD",
            "score": 2,
            "replies": []
        },
        {
            "author": "MrB1P92",
            "body": "Im asking Ukrainians, now that youve sadly lived it, what can you give me, a canadian, as advice? What should you have done? Move? Money wise? Bug out wise?",
            "score": 2,
            "replies": []
        },
        {
            "author": "JesusMcTurnip",
            "body": "Count me in.",
            "score": 2,
            "replies": []
        },
        {
            "author": "bplipschitz",
            "body": "US citizen here.  While 2A is for everyone here, not everyone needs a gun.  We will need cooks, drivers, folks to make gear, load magazines, etc.  But we're all going to have to wake up.\n\nI'm afraid the US is going to look like The Troubles -- sectarian infighting while the military mostly stands around & watches it happen",
            "score": 2,
            "replies": []
        },
        {
            "author": "BromadGuardian",
            "body": "This post should be blocked for asking Americans to violently uprise against our government... wow.",
            "score": 2,
            "replies": []
        },
        {
            "author": "No_Caterpillar5366",
            "body": "To US: call to arms revolution \n\nTo Europe: Go demonstrate\n\nFirst of all, you can't openly tell people to go pick up weapons and rebel - no matter the situation. What in the world dude?\n\nI fully support Ukraine, but you can't tell people to have an armed rebellion inside their country",
            "score": 4,
            "replies": []
        },
        {
            "author": "Fromatron",
            "body": "American Vet here- Should I learn to fly a drone? I’m not much of a marksman",
            "score": 1,
            "replies": []
        },
        {
            "author": "rumblefish_88",
            "body": "Maybe it’s time Ukraine showed Trump the cards they do have, and make a deal with China for the rare earth materials in exchange for Nuclear weapons and strategic bombers. To sweeten the deal, offer the Chinese a lease for 10 years to station ships in Sevastopol to protect their interests. China will call off North Korea, and put pressure on Russia.. Ukraine can tell Russia to GTFO, and tell Trump he is responsible for forcing Ukraine to play the cards they had.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Adunaiii",
            "body": "News as of March 12 - Trump restores military aid to Ukraine, Europe is remilitarising and on the cusp of sending troops, Russia is still bogged down, with Putin voicing support to cut its military spending in half...\n\nWhere's Ukrainian defeat? It's as if both Trump/Kremlin _and_ liberal media are painting the same picture... which is not reflective of reality. Russia is gonna be invaded a few years after Ukraine gets rearmed, but hush-hush, Ukraine has already fallen, sure...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lagalag967",
            "body": "In the end, just like Ukrainian patriots of the past, the Ukrainians have really no one to rely on but themselves (and God, for those who believe).",
            "score": 1,
            "replies": []
        },
        {
            "author": "HURTz_56",
            "body": "Can't rely on the American people to fix a problem right now. They are the reason Trump is in power.",
            "score": 1,
            "replies": [
                {
                    "author": "KingWaluigi",
                    "body": "Can't ask them or anyone to keep funding a war in another country across the ocean. I support Ukraines right to freedom. I do now support USA, Canada, EU etc, indefinitely funding a war and holding up them at the cost to those and other countries.\n\nUkraine will not keep all it's territory, war sucks, war is vile and Ukraine does not deserve what has happened.\n\nI have believed since 2000's USA is at fault for expanding NATO and in general NATO expanding towards Russia.\n\nI am allowed this opinion, and it does not mean I am a Russian agent. When previous president's were chummy or called Putin intelligent but ruthless, they were not 'on putins' payroll.\n\nYou can think Putin is vile, and the war needing to end does NOT mean the world has to keep pumping money and resources into Ukraine.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "trom-boner",
            "body": "Time to fire up the old British bully bashing war footing me thinks. Outside of donating to the war effort and my taxes, what else can I do bar continuing to stay in shape? I’ve followed this since watching the live stream of Euromaiden square, so very invested in Ukraines future, and all our democratic integrity.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dave758",
            "body": "Uk needs to lead a NATO force into Ukraine. The US should provide air transport.",
            "score": 1,
            "replies": []
        },
        {
            "author": "robs_w23",
            "body": "Regarding point 1: Americans need to be very careful. If there is significant civil unrest, Trump could declare a national emergency (maybe his plan?), which might allow him to expand executive powers in ways that could severely restrict civil liberties. This is similar to how Hitler used the Reichstag Fire Decree in 1933 to justify emergency measures that dismantled democratic institutions and consolidated his control. While the U.S. has stronger institutional checks and legal constraints, history shows that crises can be exploited to erode democracy",
            "score": 1,
            "replies": []
        },
        {
            "author": "Infinity_project",
            "body": "I’m genuinely curious to hear where, when and by whom it was outlined that the US would supply Russia with weaponry?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Honest_Boysenberry25",
            "body": "A Ukrainian should not be advocating for violence in USA.  This is not the answer.  Trump responds to bad publicity and public outcry.  He often reverses his decisions on the following day.  \n\nToday we have the hysteria over 25% tariffs on Canadian and Mexican goods.  Wait and see what happens.  \n\nTrump will release the equipment to Ukraine that is already in Europe but the money flow will stop. \n\n The only viable alternative is for Europe to defend Ukraine.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AlexFromOgish",
            "body": ">\n\n>Get a gun and learn to shoot. As someone who has participated in two revolutions, I can tell you that our situation back then wasn’t as dire as yours is now. Unfortunately, I see no way forward for you without civil disobedience and violent resistance\n\nRussia thanks you for encouraging my US neighborhood to arm itself with even MORE fear and MORE weapons even though my neighbors have not been through military training for discipline, self-control, or command-and-control.  OP as you say you're not an American.  I am...... family has been here since Mayflower came ashore. You're calling for a bunch more guns in although folks here often have toddler level fear and impulse control issues.  They don't have military training. They should NOT have weapons.  But the more guns we buy here, the more Russia loves how we are destabilizing ourselves! \n\nIn the military, you learn discipline before you are issued a weapon. Here, in the USA, you get scared, buy a weapon, and usually *never* get training in discipline. So the last thing we need is folks from other countries - like the OP - urging us to make things even *more* dangerous in our country.  This is what the Russian FSB has been trying to do and the Soviet KGB tried to do before that.  They thank you for contributing to their efforts\n\n(EDITED FOR CLARITY)",
            "score": 0,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -1,
            "replies": [
                {
                    "author": "ukraine-ModTeam",
                    "body": "Hello OP, we have removed your post for being off-topic. While we acknowledge that this war has captured global interest, we want to reaffirm that the purpose of this community is to give space for, and amplify the voice of Ukraine in the global community. For this reason, the mod team will be using their judgment when moderating content that deals with foreign politics, even if they seem peripherally related to Ukraine. We understand this may be disappointing, especially if your post required a lot of time or effort. We encourage you to post this content on a sub that specifically focuses on the foreign politics you are discussing, where it may generate well deserved and on-topic discussion.\n\n[If you would like to gain a better understanding of what is on-topic for this community, feel free to browse our rules, here.](https://www.reddit.com/r/ukraine/about/rules)",
                    "score": 1,
                    "replies": [
                        {
                            "author": "hooligan_bulldog_18",
                            "body": "You are a propaganda page full of beggars",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Hurriedgarlic66",
            "body": "I don’t think the us population has the capacity to revolt now. Luigi was their last chance. The invasion of Canada is just a matter of time now",
            "score": -4,
            "replies": []
        },
        {
            "author": "Engineer-mofo",
            "body": "As a third person reciding in a safe country, I would say Ukraine shouldn't have joined the NATO in the first place look what you did to your people. There obviously would be a diplomatic way out which zelensky obviously  did not see. Since 1991 when USSR broke down into pieces and stopped communism only on one demand that the NATO should not expand further and the west exactly did that, what did you expect from PUTIN? How cruel he maybe you poked him.",
            "score": -8,
            "replies": [
                {
                    "author": "Salt-Librarian-4385",
                    "body": "If you stoped reading Russian fiction you would know that Ukraine dis NOT joinNATO and never has!",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Engineer-mofo",
                            "body": "Who will suffer not trump not zelensky not putin but common man this is so sad.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MrMiAGA",
            "body": "Here's the thing mate. During the years of American support for Ukraine, never once did I see any russians calling for the people in my country to start killing one another.\n\nCalls to action, like yours, are the main reason I'm starting to feel more and more okay with us not supporting you.",
            "score": -2,
            "replies": []
        }
    ]
}