{
    "title": "Turkey: Crimea is Ukraine and we support their territorial integrity and sovereignty",
    "author": "NearOpposite",
    "subreddit": "ukraine",
    "rank": 4,
    "score": 8624,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 169,
    "url": "https://i.redd.it/0w916q0xbfpe1.jpeg",
    "id": "1je1p59",
    "selftext": "Source: Turkish Foreign Ministry, on the 11th anniversary of the illegal annexation of Crimea\n\n [https://www.mfa.gov.tr/no\\_-55\\_-kirim-in-yasa-disi-ilhakinin-on-birinci-yil-donumu-hk.en.mfa](https://www.mfa.gov.tr/no_-55_-kirim-in-yasa-disi-ilhakinin-on-birinci-yil-donumu-hk.en.mfa)",
    "comments": [
        {
            "author": "Gullenecro",
            "body": "Imagine we can count more on turkey than USA lol....",
            "score": 1240,
            "replies": [
                {
                    "author": "inokentii",
                    "body": "No need to imagine it's just a reality. Turkiye plays their own game, but they are honest in it.\nWhile Americans say that they will stand with us as long as it takes but stabbing us in the back at the same time. Turkiye never hid their plans to do business with russians, but at the same time they are investing in our defence and opening drone manufactures in Ukraine",
                    "score": 509,
                    "replies": [
                        {
                            "author": "Consistent-Primary41",
                            "body": "I want Turkiye as a regional power.\n\nIf there's anyone who's going to get the Middle East sorted out once and for all, it's them.\n\nThey're the only country trying to get a solution. They don't want war profiteering. They want refugees gone.",
                            "score": 155,
                            "replies": [
                                {
                                    "author": "frenchsmell",
                                    "body": "I mean, they had a solid 3 centuries of running the place.",
                                    "score": 128,
                                    "replies": [
                                        {
                                            "author": "TheMauveHand",
                                            "body": "And look what they left behind...",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "caribbean_caramel",
                                                    "body": "This isn't the result of Turkey, after the first world war France and UK took over the place.",
                                                    "score": 20,
                                                    "replies": [
                                                        {
                                                            "author": "juxtoppose",
                                                            "body": "Well there’s your problem.",
                                                            "score": 8,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "TheMauveHand",
                                                            "body": "...which they did because the Ottoman Empire (i.e. Turkey) supported the German Empire (*et al*), while simultaneously having been \"the sick man of Europe\" for quite some time prior.\n\nFrance and the UK didn't fuck up the Middle East, the various local empires did. Well, them, and Islam in general.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Szygani",
                                    "body": "> I want Turkiye as a regional power.\n\nThe Armenian, Pontic Greek and Assyrian would object to that if there were still many alive after the genocides Turkey committed.\n\nEdit: Armenia and Greece still exist, obviously",
                                    "score": 111,
                                    "replies": [
                                        {
                                            "author": "im_a_mix",
                                            "body": "You mean the genocides Ottoman Empire commited, the same nation/government which Turkey went to war against in World War 1",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "FourScoreTour",
                                                    "body": "The Ottoman Empire was ruled by Turks, and they're still denying that the Armenian genocide even occurred.",
                                                    "score": 66,
                                                    "replies": [
                                                        {
                                                            "author": "im_a_mix",
                                                            "body": "Turks were ruled by the Ottoman Empire, hence why during WW1 there was a schism to the point where there were assassination attempts at those who tried to fight back against the Ottoman Empire.\n\nAnd no, most Turks are very clearly aware that the Ottoman Empire committed genocides. Our government is unfortunately a big fan of the Ottoman Empire despite me personally finding their last century shameful.",
                                                            "score": 19,
                                                            "replies": [
                                                                {
                                                                    "author": "FourScoreTour",
                                                                    "body": "> Turks were ruled by the Ottoman Empire\n\n\nhttps://en.wikipedia.org/wiki/Ottoman_Empire",
                                                                    "score": 14,
                                                                    "replies": [
                                                                        {
                                                                            "author": "im_a_mix",
                                                                            "body": "I think we are misunderstanding eachother. I'm talking on the matter of governance, you seem to be talking about ethnicity. It wasn't the Turkish blood that drove us to a genocide, it was the government's actions that lead to it. Again no one should deny the existence of the genocide, I just believe that the distinction of which government enacted the genocide is important for historical accuracy.",
                                                                            "score": 15,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "YouMustveDroppedThis",
                                                                                    "body": "Legitimate and recognized successor of a previous regime inherits the wealth, the debt, the apparatus and also the sins. You can't pick and choose, unless you give up the good part.",
                                                                                    "score": 15,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "DifficultySuch5384",
                                                                                            "body": "Just like how we can't get rid of the heinous shit Trump has/is doing.",
                                                                                            "score": 3,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "mightypup1974",
                                                                                    "body": "That’s like saying that Russia doesn’t need to acknowledge the Katyn Massacre because it was the USSR at the time. Or that the UK can shrug off criticism of the Empire.",
                                                                                    "score": 21,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "im_a_mix",
                                                                                            "body": "I'd agree if Russia had fought a war against USSR or ever opposed it, same goes for UK and the Empire. The fundamental difference here is the clear and distinct opposition of one government against another.",
                                                                                            "score": 8,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "randomone123321",
                                                                                                    "body": "There was simultaneously a president of USSR and president of Russia, and Yeltsin wanted very much out of USSR, Gorbachev wanted to keep it, so much so that there was a coup to stop USSR from falling apart and Yeltsin fought against it. I am not speaking about him bombing the parliament, which was the last remnant of USSR in Russia. He was as anti-communist as it gets. Even tho you're factually wrong on Russia and following your logic it absolutely CAN be absolved of USSR's crimes, I find your logic quite childish.\n\nIt is about how current government sees the crimes and in Turkey's case there is outright genocide denial. When Turkey's government comes out and says Armenian genocide is a crime of Ottoman Empire and we condemn it, then we'll have something to speak about. Right now they can't even admit the fact that it indeed happened, even tho it supposed to be a different government's fault.",
                                                                                                    "score": 6,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Jaquemart",
                                                                    "body": "> Turks were ruled by the Ottoman Empire\n\nYou're from a bizarre timeline.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Szygani",
                                                    "body": "The Republic of Turkey (founded in 1923 by Mustafa Kemal Atatürk) emerged as the successor state to the Ottoman Empire, and many of its officials, military leaders, and institutions carried over. The Turkish war of Independence was fought mostly against foreign occupiers, and the Ottoman Sultunate, while still existing during ww1, was largely controlled by european powers. \n\nIn 1922, the nationalist movement abolished the Ottoman Sultanate, and in 1923, the Republic of Turkey was founded.\n\nMost of the world recognizes Turkey as the perpetrator of these genocides, two of which is Armenia and Greece.",
                                                    "score": 20,
                                                    "replies": [
                                                        {
                                                            "author": "stat-insig-005",
                                                            "body": "I would think there weren’t that many institutions really carried over. Rest of the 20s and. 30s were defined by the reforms and overhaul of most parts of civic and legal life.\n\nI’m not really knowledgeable though. Any examples to share?",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "Szygani",
                                                                    "body": "Well like I said the military leaders were ottoman military officers, Mustafa Ataturk himself for instance. Turkeys second president Ismet something was also an ottoman empire officer. \n\nOttoman bureaucrats continued working under the new Turkish state, and civil service, tax collection etc were based on the ottoman systems but modernized. \n\nThe Ottoman laws got an overhaul pretty quickly, but there was a transitional period where the ottoman legal practices had to continue so judges were still former ottoman officials. The school system was also changed a bit later (1930s) but the staff and structure remained the same. \n\nSo it was more like a hybrid transition into the modern day turkey that we know and love today. It's an incredibly rich culture, with a lot of history and not to mention fantastic food",
                                                                    "score": 7,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Abba_Linkola",
                                                                            "body": "That's like saying The United States of America was still British following the American Revolution because the American governors and generals were British.\n\nYou can just read *Nutuk* and get an exact sense of what Atatürk and the nationalists were thinking. They did not consider themselves Ottomans, and had no intention of preserving any part of the Ottoman administrative structure from the beginning. The reforms were implemented slowly because the nationalists recognized that the people didn't fully understand what they were proposing, and implementing them too quickly could jeopardize the stability of the republic.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Szygani",
                                                                                    "body": "I get what you're saying, but comparing Turkey to the US after the Revolution doesn’t really work in my oipinion. The American colonies completely broke away from British rule, but Turkey was basically built from what was left of the Ottoman Empire. Atatürk and the nationalists definitely wanted to leave the Ottoman past behind, but in reality, they still relied on a lot of Ottoman institutions, especially the military, government administration, and legal system, until they could fully replace them. \n\nNutuk makes it clear that Atatürk and his movement had no love for the Ottoman system, yeah, but it also shows that change didn’t happen instantly. The reason things were reformed gradually wasn’t just strategy, it’s also because there just weren’t enough trained people to immediately replace all the Ottoman-era officials. You can’t just wipe the slate clean overnight, as you rightly bring up\n\nSo yeah, Turkey was a fresh start in terms of ideology, but in practice, a lot of early Turkey still ran on Ottoman foundations while the new systems were being built and gradually replaced.\n\nAnd interestingly, modern Turkey under Erdoğan has been embracing more of its Ottoman roots again. He has openly said that Turkey is a \"continuation\" of the Ottoman Empire and frequently refers to Turkish citizens as \"grandchildren of the Ottomans.\" His government has revived Ottoman-era symbols, like the use of the term \"külliye\" for university campuses and even considered bringing back the tughra as an official emblem.\n\nForeign policy under Erdoğan also leans into a neo-Ottoman vision, trying to increase Turkey’s influence in the Middle East and former Ottoman lands. So while Atatürk distanced Turkey from its Ottoman past, the current leadership is actively reconnecting with it in some ways.",
                                                                                    "score": 10,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Abba_Linkola",
                                                                                            "body": "> Foreign policy under Erdoğan also leans into a neo-Ottoman vision, trying to increase Turkey’s influence in the Middle East and former Ottoman lands. So while Atatürk distanced Turkey from its Ottoman past, the current leadership is actively reconnecting with it in some ways.\n\nI'm very aware. My wife is Turkish (I'm American), and we visit frequently. It's disheartening to see what Erdoğan is doing to the country with his attempts to dismantle and wipe out Atatürk's legacy. It's even more disheartening to see the people cheer him on for it without realizing the damage he's doing. We've even talked about retiring early to Türkiye, but at this point that's going to depend greatly on what happens in 2028.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "YouMustveDroppedThis",
                                                                                    "body": "I give you another example. China (PRC) supposedly still owes American debtors money because Qing dynasty borrowed it and then collapsed due to revolution that leads to ROC. The debt is still unsettled because none of the two supposed successor entities, PRC and ROC(now in Taiwan), wants to deal with it. Anyone who claims or recognized as successor is expected to pick up the tab.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "KintsugiKen",
                                                                                    "body": "> That's like saying The United States of America was still British following the American Revolution because the American governors and generals were British.\n\nOne of those governments was on an entirely different continent from the other. It would only fit your comparison if US territory also included Britain and the US capital was London.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "zmbjebus",
                                                    "body": "Modern Turkiye genocided the Cyprus people.",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "author": "im_a_mix",
                                                            "body": "Is that so? What happened in 1963? https://en.wikipedia.org/wiki/Bloody_Christmas_(1963)\n\nWhat were the 13 attempted changes done to the constitution during that time? https://en.wikipedia.org/wiki/Thirteen_Points\n\nA literal ethnic cleansing occurred, acting as if Türkiye aiding the Turks who survived are the ones who are the aggressors is a wild take. I'm sure you have sources to back that up though.",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "Szygani",
                                                                    "body": "I actually didn't know anything about this cyprus stuff, so I'm definitely gonna read up on this thanks",
                                                                    "score": 4,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "zmbjebus",
                                                                    "body": "Nah frankly I'm more uneducated on this than I thought. I'll read up on what you posted in a bit. \n\nI was reciting something I learned a while ago. Always good to double check that meat computer in the head I guess.",
                                                                    "score": 9,
                                                                    "replies": [
                                                                        {
                                                                            "author": "im_a_mix",
                                                                            "body": "Sorry for coming off aggressive, I'm definitely sleep deprived. I appreciate you reacting the way you did.",
                                                                            "score": 6,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "zmbjebus",
                                                                                    "body": "Lol, no problem. We tend to be more agressive when anonymous on the internet. I'm guilty of it too at times, but its nice if we all try to be real as much as we can.\n\nThanks for the links and reality check frend. Get some sleep please.",
                                                                                    "score": 4,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "Sensitive-Emu1",
                                                                            "body": "OMG. I can't believe someone tries to learn on Reddit instead of following headlines. Thank you!",
                                                                            "score": 3,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "halareous",
                                                                    "body": ">Türkiye aiding the Turks who survived \n\nTurkey intervened in July 1974 after the greek junta coup attempt. Its sole obligation as a guarantor would be the restoration of the status-quo. The coup attempt failed immediately, the junta collapsed and democratic order was restored. No one is disputing the legitimacy of the intervention. \n\nIn August 1974, Turkey invaded again, this time occupying the northern 37% of the island. The occupation is still ongoing. During this time, over a hundred thousand became refugees, Turkey stationed over 40,000 troops on the island, shipped hundreds of thousands of settlers from Anatolia (now outnumbering the native Turkish Cypriot population btw), and has seized every single institution and vital function of the occupied territory. \n\nI cannot believe there are people here trying to justify what Turkey has and is still doing, just because they support Ukraine to fulfill their own hegemonic ambitions.",
                                                                    "score": 4,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "KintsugiKen",
                                                                    "body": "> What happened in 1963?\n\nNothing that justifies invading and occupying half the island for over 50 years.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Haplo12345",
                                    "body": "Türkiye _is_ a regional power. They control access to and from the entire Black Sea. \n\nThey are also the only NATO country to shoot down a hostile Russian aircraft since 1952 (put another way, they were the only NATO country with the balls to do so), and they have heavily influenced the outcome of the Syrian civil war, including limiting the largest single partisan group participating in said civil war from claiming their own controlled territory and establishing a new country (the Kurds).",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "AutoModerator",
                                            "body": "Russian aircraft fucked itself.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ukraine) if you have any questions or concerns.*",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Attarissiya",
                                    "body": "Gosh no , turkey helpa ukraine because is enemy of russia. But at the end erdogan and company are the same shit than russia, or worst.",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "Handgun_Hero",
                                    "body": "Authoritarian personality cultist is still an authoritarian personality cultist. Dude still agrees with the Armenian genocide and suppression of Kurdish rights.",
                                    "score": 13,
                                    "replies": []
                                },
                                {
                                    "author": "Id1otbox",
                                    "body": "Erdogan is going full on political Islam. It's not going to end well.",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "North_Church",
                                    "body": ">I want Turkiye as a regional power\n\nGiven their conduct in Syria and elsewhere, as well as the state of their government, I'm hesitant about that",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "Mors_Umbra",
                                    "body": "Doesn't Turkey unnofficially support ISIS outside their borders...? Highly skeptical they're going to do anything positive for the region when they keep friends like that.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "extreme857",
                            "body": "Turkey literally send [700 mrap's](https://www.reddit.com/r/UkrainianConflict/comments/1jd7s7q/ukraine_received_around_700_turkish_mrap_vehicles/) to Ukraine  since start of the war but didn't announced.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "HoereDoc31",
                            "body": "Turks don't even necessarily WANT to deal with the Russian government (funding PKK in the past + debacles in Syria/Libya/Caucasus), I mean look at our shared history. The reality the Turkish government and people accept is that they're dependent on their energy resources. They're not a part of the largest single free market in the world where they can boycott Russia (even though they don't and still import huge amounts of gas). \n\nBeing located where it is forces them to keep all options open no matter what.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "coldbloodtoothpick",
                            "body": "*American government. Don’t be lumping all of us in on this. \nCan’t say enough how angry many of us are with our government.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "inokentii",
                                    "body": "Ok but then it should be American governmentS, cuz during this war we see it continuously starting with Obama's office. And I don't even talk about the past with Chicken Kyiv speech or when we were falsely accused of selling kolchuga systems to sadam.\n\nI know that there are a lot of Americans supporting us and I'm grateful to y'all for help🫶",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "Beldizar",
                                    "body": "Yeah, it's probably 1% of Americans want to stab Ukraine and others in the back.  40% support, and the rest don't care.  The problem is that the 1% convinced 30% of the group that doesn't care to vote for them and the leaders of the 40% suck at their jobs.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "adamgerd",
                            "body": "Turkey plays both sides, yet that is better than the U.S. betraying one for the other",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Longjumping_Ad_1180",
                    "body": "I'm sure no one is relying on Turkey. Sure their help is highly welcome but this is more of an opportunity for them to show which side they want to be one. And its not something that they can exchange for an EU membership either, that should be clear. \n\n  \nThey change sides like the wind, they can't be relied on in the long term. But putting them at odds with Russia is already a good enough win.",
                    "score": 29,
                    "replies": [
                        {
                            "author": "fading_anonymity",
                            "body": "this is about Turkey's (and by extension European/NATO) strategical security, having the russians in crimea undermines the Turkish influence in the black sea and diminishes strategical power projection.\n\nYou can most certainly rely on countries like Turkey as long as you rely on their self-interest to align with your interests.",
                            "score": 36,
                            "replies": [
                                {
                                    "author": "CKF",
                                    "body": "I was half-balking at your first comment before I read your second. Turkey has held the opposite interest of NATO at every possible turn for ages, whether in reality or performatively, to try and leverage a deal to gain their cooperation. \n\nCan you imagine giving up the f35 for the sake of s400 systems?? Along with risking all of the f35's stealth advantages against a country we thought was more than just a paper tiger? Their goal with this negotiation was to get a full tech transfer of the patriot system to be able to build their own versions. Being basically given them wasn't good enough. I mean, at the time we thought s400 was top notch, and it was also at a moment where the patriot was continuing to get more and more and more of a bad rap, but Ukraine has seemed to show the patriot system to be fantastically reliable, even in an \"offensive\" capability. And Russia has had just a horrid air defense showing across the entire campaign. But yeah, with the s400 fiasco we finally said \"fine, we are gonna budge, do it your way,\" and they held to their threat. I still wonder if they were too prideful to back down with their tails between their legs or if they really thought that was a good deal.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "estelita77",
                            "body": "not in this war. Not at all.\n\nPeople may not realise - Turkey and russia share history (IE Turkey also knows russian invasion and russian mindset) and they used to share a border, too. I doubt they really want to go through any of that again. They have been very consistent with their statements regarding UA borders - and yes - they have a far better relationship with UA than russia - not to mention Crimean Tatars.\n\nAnd on top of all of that, they have their own sphere of influence that they are building - mostly with former USSR states. So. Nope. I do not see them flipflopping on this. Turkey knows what is in Turkey's best interests - which is much more than I can say for the US.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "Consistent-Primary41",
                                    "body": "Crimean Tatars are Turkic people.\n\nWho were pogrommed.",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "estelita77",
                                            "body": "Exactly.\n\nAnd perhaps a lot of people don't know/understand/appreciate that Turkey is busy building relationships, closer cooperation and influence with other Turkic language countries - all of whom also happen to be ex soviet states - with experience of russian empire: Azerbaijan, Uzbekistan and Kazakhstan. \n\nSo, in this war, I would be much less surprised if Southern EU countries flip-flopped than if Turkey did a sudden about turn. Turkey is not an issue at all for UA.",
                                            "score": 11,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "adamgerd",
                                    "body": "Turkey literally sold weapons to Russia against Ukraine, do you forget that?",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "author": "Sensitive-Emu1",
                                            "body": "Source?",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "extreme857",
                                            "body": "Turkey didn't stopped trade with Russia cuz Turkey dependent on Russian gas.\n\nbut Turkey never sold any weapons to Russia \n\n\\+Russian pride doesn't let them buy weapons from Turkey, same applies to certain west eu countries.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ultrachem",
                            "body": "L take. Turkey and Russia are historic enemies and their relations can be described as tolerant of each other at best. That may seem so today but Turkey effectively yeeted Russia from Syria, Azerbaijan and is currently at odds with them in Libya, all via proxy. Don't forget that we shot a Russian fighter jet down as well when we warned it not to converge to our borders.\n\nBesides, since this whole ordeal with the US, more EU countries are dropping their objections to Turkey's EU accession.",
                            "score": 57,
                            "replies": [
                                {
                                    "author": "Longjumping_Ad_1180",
                                    "body": "EU accession ain't happening. You can forget about that.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "ultrachem",
                                            "body": "I think I prefer to gauge that based on what actual countries are saying vs. some redditor tyvm",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "Longjumping_Ad_1180",
                                                    "body": "and by all means gague on it.   \nThere are strict rules that a country has to comply with to be nominated for ascension and on top of that there are objections by individual countries that can veto the ascension.   \nYou might get a few to drop their veto but there are still the rules  and requirements that have to be fulfilled. And Turkey is miles away from it.",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "Szygani",
                                                            "body": ">  There are strict rules that a country has to comply with\n\nThey've been a candidate country for decades now, mostly stalling ebcause of the coup attempt in 2016 and potential human rights violations. Them joining anytime soon is unlikely, but it's not certain they won't ever be able to join\n\nThis could be a big step forward in that direction",
                                                            "score": 7,
                                                            "replies": [
                                                                {
                                                                    "author": "im_a_mix",
                                                                    "body": "Our biggest issue is our borders. We just don't have the border security needed on our Syrian border due to the recent events within that region, once we have secure borders and the opposition party wins the elections we could see a world in which Turkey has a genuine chance at becoming a part of EU.",
                                                                    "score": 6,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Szygani",
                                                                            "body": "yeah, the border is a big problem, but hopefully with Syria recently that can be helped.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "vidar_97",
                                                                    "body": "They've been stalled for human rights violations.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "ultrachem",
                                                            "body": "When push comes to shove, you can guarantee the strict rules and regulations will be dropped like a brick to ensure that one of the most powerful countries joins the block. Because as it stands right now, only Poland, Finland and France have credible deterrents within the EU. And you believe the Europeans wouldn't prefer a large, fully developed and battle-hardened army fighting on their side?\n\nHave you heard of Realpolitik?",
                                                            "score": -4,
                                                            "replies": [
                                                                {
                                                                    "author": "Alaric_-_",
                                                                    "body": "EU already has one autocrat blackmailing and extoring benefits for their vote (Orban), one on a express lane to becoming one (Fico) so i'm sorry but EU will not get another to cripple the Union even more.\n\nIf there was a majority-system for voting, Turkey would be welcome but i'm pretty sure at that point Turkey would suddenly stop being interested in it...",
                                                                    "score": 3,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Tsarsi",
                                                                    "body": "Average takes from a Turk from berlin",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "ultrachem",
                                                                            "body": "Ah yes, no counterargument, last resort to the usual ad hominem.",
                                                                            "score": 3,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Longjumping_Ad_1180",
                                                                    "body": "Most of EU and Turkey are both in NATO which is a military alliance. We are talking about military cooperation here, Non of what is happening has anything to do with the EU. The only reason why EU is mentions is because Turkey decided that this year they want in again.",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "mdonaberger",
                                    "body": "Turkey will fight Russia down to the very last Kurd!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Consistent-Primary41",
                            "body": "They won't change sides because if they do, then Kurdish separatists have the argument for independence",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Sensitive-Emu1",
                                    "body": "That goes both way. Contrary instead of Kurdish separatists using it as argument for independence, Turkey can use it to take Mosul and Kerkuk which were originally Turkish cities but UK didn't allow Turkey to get them back. By doing so Turkey can claim Kurds and Turks will live together and merge with Kurdish regions. Turkey already have good relations with Iraq Kurds and they just started required steps to make peace with PKK. PKK's founding leader asked from PKK to drop their weapons and protect Kurdish right as politicians. So no, I don't think that's their reasoning. People forget that Russia is the nemesis of the Turks. While Armenia and Greece sees Turkey as biggest threat. To Turkey they are not big enough to see it as threat.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Longjumping_Ad_1180",
                                    "body": "And that is another valid point. Kurds are a nationless nation, divided up by its neighbouring countries. Just like Poland when it was carved and removed from the face of the earth for 123 years. Do you think that Polish people would have more sympathy towards to Turks here?  \nIt's as likely as them having sympathy to Russia right now.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "badbas",
                            "body": "You have zero idea about Turkey, right?",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Sensitive-Emu1",
                            "body": "With all due respect, Turkey doesn't need to show which side they are on. Europe needs to show which side they are on. In the Korea war, Turkey proved which side they were. Turkey fought against Russia in Syria, and Libya. Can you tell me which one of the great European countries shot down a Russian aircraft?   \n  \nTurkey doesn't change side because Europe never accepted them on their side. What kind of ally wouldn't sell weapons against a terrorist organization? I can count many examples Turkey supported the Western pact. Can you tell me when Western countries supported Turkey? Even now look at your attitude. EU membership is forbidden but you want to use Turkey as support. Personally, I don't want Turkey to join EU. The stance Turkey took in WW2 is the best one. As soon as we get rid of Erdogan, we will be in better condition than most of the European countries.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "AutoModerator",
                                    "body": "Russian aircraft fucked itself.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ukraine) if you have any questions or concerns.*",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Longjumping_Ad_1180",
                                    "body": "its actually the other way around from our perspective.   \nEurope is perfectly fine continuing a military alliance with Turkey (as per NATO membership) but this has nothing to do with EU membership, yet Turkey wants to make it about EU membership.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "That_Experience804",
                            "body": "well well but you can rely on USA there no one changes sides and makes statements every day like a bipolar girl? with news that they are ready to give Crimea to russia.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Longjumping_Ad_1180",
                                    "body": "Of course we cant rely on the US NOW. But we could for the longest time. For how long could Europe reply on Turkey?  \nA sudden change of heart does not make a difference in the long run.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Sensitive-Emu1",
                                            "body": "Ask this question once, Can Turkey rely on Europe ever? What did Europe provide to Turkey? Tell me one good thing Europe did and Turkey didn't pay it back.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Longjumping_Ad_1180",
                                                    "body": "NATO isn't a \"I scratch your back, you scratch mine\" type of a deal. It is a defence pack.   \nIf Turkey were attacked by a non NATO power then there is an obligation to assist.  \n  \nWhat else do you think it is? That you get help from Europe when fighting against Kurdish freedom fighters out of good will?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Sensitive-Emu1",
                                                            "body": "First, we are not talking about NATO; we are talking about Europe. Also, Ukraine is not a NATO country. But if you mean NATO when you say Europe, that was exactly my point. When has Turkey ever failed to support a NATO country attacked by a non-NATO country?\n\nIt's not \"Kurdish Freedom Fighters\"; they are called terrorists—PKK—recognized as such by the UN.  \nTurkey is not receiving support from Europe against the PKK. On the contrary, the PKK is being supported, armed, trained, and funded by Europe. Entirely. Both European and NATO countries stopped selling weapons to Turkey while the PKK took control of entire cities. Thanks to that, Turkey's military production is now at its highest level in history.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "adamgerd",
                            "body": "Yep, Turkey imo can’t be trusted under Erdogan but they’re still an useful ally",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "HoereDoc31",
                                    "body": "Erdoğan gave the EU the most power it ever has had in the Republic of Turkey. The man was jailed until the EU and US pressured the previous government to release him. He's a lapdog who does all the dirty work for you guys. You think the refugees you have now are all that left the middle east and Asia, regions that you guys destabilized? Erdoğan made Turkey a dam for millions of refugees who want to go to the EU, refugees you guys are at least partly responsible for. You guys pay him pennies on the dollar (3 or 6 billion Euro) compared to the cost of housing and feeding literally MILLIONS of people. The Visa part of that deal even fell in the water because something that wasn't even part of the deal. What do the Turkish people get nothing in return but (blatant) racism and the glorious EU countries that think they can lecture us on our own internal politics and our role as a country? \n\nIt's not that I hate countries pursuing their own interests, but there's no people in the world as hypocritical as you guys.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Erruso",
                    "body": "We live in the weirdest timeline",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "LoudMusic",
                    "body": "I'm agreeing with Turkey and hating my own government. What the hell is going on.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Nonamanadus",
                    "body": "Imagine being on the same side as China in a trade war.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Merpchud",
                    "body": "Canada needs to get over there and make a deal with turkey just like they did with France. \n\n\nOnly helps against the secret not so secret usa/russia pact and in turn helps Ukraine.\n\n\nEurope, especially the British, also need to put its big boy pants on instead of hiding in the closet. Far overdue.\n\n\nRussia is extremely weak at the moment any anyone else entering from a second front would be the end of Russia. It would put a major stop on Donald trumps bullshit.\n\n\nUnfortunately Europe is too scared, so somebody somewhere has to stoke the fire, to fully ignite it.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "kermitthebeast",
                    "body": "Things must be really bad for Russia. Turkey wouldn't do this if it wasn't an almost certain outcome imo",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "FireChief65",
                    "body": "No lol needed, say it like you mean it!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "blaxxunbln",
                    "body": "To be fair, Turkey has always been a reliable player in international politics. Domestic not so much maybe.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "AllUrUpsAreBelong2Us",
                    "body": "I dont know much about Turkey, but since Ukraine has been invaded these last \\~10 years, I've learned:\n\nUS, UK, France betrayed Czechs and Poles [https://en.wikipedia.org/wiki/Western\\_betrayal](https://en.wikipedia.org/wiki/Western_betrayal)\n\nUS abandons Kurds [https://apnews.com/article/donald-trump-syria-ap-top-news-international-news-politics-ac3115b4eb564288a03a5b8be868d2e5](https://apnews.com/article/donald-trump-syria-ap-top-news-international-news-politics-ac3115b4eb564288a03a5b8be868d2e5)\n\nUS tests chemical warfare on its own population [https://en.wikipedia.org/wiki/Operation\\_Sea-Spray](https://en.wikipedia.org/wiki/Operation_Sea-Spray)\n\nUS imports nazis [https://en.wikipedia.org/wiki/Operation\\_Paperclip](https://en.wikipedia.org/wiki/Operation_Paperclip)\n\nThe USA is literally a narrative they sell that they are \"the good guys\" - even Trump admitting that berating Z in the white house was a \"tactic\" [https://www.pravda.com.ua/eng/news/2025/03/18/7503375/](https://www.pravda.com.ua/eng/news/2025/03/18/7503375/)",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Gullenecro",
                            "body": "hey, UK and france declares war against the nazi following the attack on poland. My grand father fighted the nazi and has been traumatized by it (being torturrd by gestapo) following that so i will not let you say that uk and France betrayed poland).\n\nCzeck, yes i agree but not poland.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Odi-Augustus13",
                                    "body": "They fought for their own safety interests unfortunately friend that doesn't take away if course from your grandfather and his bravery.  \n\nBut who owned Poland post 1945? Yeah they were betrayed hard. And abandoned.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "TimeVector",
                            "body": "There's literally nothing wrong with Operation paperclip, if you have a genius rocket scientist willing to work for you then you use him. The alternative is losing ground to the Soviets and I think every Central European country is glad that the USA won the cold war.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheRealAussieTroll",
            "body": "Erdogan is *the one guy* Putin doesn’t mess with… he knows Erdogan could make all of Russia’s Turkic regions completely ungovernable overnight.",
            "score": 227,
            "replies": [
                {
                    "author": "Consistent-Primary41",
                    "body": "That's likely to happen anyway.\n\nRussians are apathetic. Ethnic minorities in Russia are a powder keg",
                    "score": 119,
                    "replies": [
                        {
                            "author": "punkojosh",
                            "body": "And every single nation that gets carved out has a seat at the UN and an embassy in any country they want.\n\n...all they have to do is breakaway from Ruzzia.",
                            "score": 37,
                            "replies": []
                        },
                        {
                            "author": "FartPudding",
                            "body": "Chechnya isn't to be fucked with",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ironmaiden947",
                    "body": "Like Erdogan or not, Turkey is the only country ballsy enough to shoot down a Russian jet that violated their airspace. In this instance, you want him as an ally.",
                    "score": 42,
                    "replies": []
                },
                {
                    "author": "Additional_Ring_7877",
                    "body": "You have to be insane or don't know a single thing about the situation to say that. They can't even control the Turks in Germany. Let alone turks that we've cut ties with centuries ago.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "4thafter3bans",
            "body": "Turkiye's crimea stand is almost same last 10 years. Turkey is just not economically strong enough to cut ties with russia and can't trust westerns so acts likes a neutral country.",
            "score": 99,
            "replies": [
                {
                    "author": "YWAK98alum",
                    "body": "Those two positions are completely consistent in an ideal world.  Crimea is Ukraine, and even so, Russia is still far larger than Ukraine and very close to Turkey and their economic relations will be important to Turkey (which is no longer the Ottoman Empire and isn't about to fight Russia for control of Crimea itself).",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "DCLexiLou",
            "body": "**No: 55, 16 March 2025, Regarding the Eleventh Anniversary of the Illegal Annexation of Crimea**\n\nOn the anniversary of the annexation of Ukraine’s Autonomous Republic of Crimea by the Russian Federation through an illegitimate referendum eleven years ago today (16 March), we reiterate that Türkiye does not recognize the de facto situation in Crimea, which constitutes a violation of international law, and that we support the territorial integrity and sovereignty of Ukraine.\n\nWe will continue to closely monitor developments in Crimea, particularly the situation of the Crimean Tatar Turks, the indigenous people of the peninsula, and we will keep them on the agenda of the international community.",
            "score": 53,
            "replies": [
                {
                    "author": "Additional_Irony",
                    "body": "Thank you for posting the full statement, the last time I read it the paragraph about the Crimean Tatars was omitted for some reason though it’s undeniably important.",
                    "score": 14,
                    "replies": []
                }
            ]
        },
        {
            "author": "ProUkraine",
            "body": "Turkey supports Crimea being part of Ukraine, because of the Tatars who are closely related to Turks. Most Tatars want Crimea to be Ukrainian.",
            "score": 120,
            "replies": [
                {
                    "author": "tenheo",
                    "body": "It's more about not having russias navy in crimea to challenge Turkey",
                    "score": 32,
                    "replies": []
                },
                {
                    "author": "shinshinyoutube",
                    "body": "Yeah bro that must be it bro, 900 year old cultural link bro\n\nRussia wants in Turkish waters -> Turkey doesn’t",
                    "score": 45,
                    "replies": []
                },
                {
                    "author": "Pab_Scrabs",
                    "body": "I’d love to believe that but I think in reality turkey would rather Ukrainian ships in the Black Sea over Russian ships. If crimea is restored to Ukrainian hands, Russia won’t be able to use the warm water naval ports in crimea and will have to move ships from the Sea of Azov past crimea, which Ukraine would definitely never allow in the future. \n \nTLDR Ukrainian control of crimea is safer for Türkiye and might even lessen their need for naval presence in the Black Sea",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "CorporateCuster",
            "body": "What stops China from taking over parts of India? Russia from taking over parts of other countries? What stops the USA from taking over parts of Canada or Mexico? What’s stopping India from taking over parts of Pakistan? The list is never ending. It’s called a territorial dispute if it’s being disputed. In This case Russia tried to go to war and hostility take over another country. They failed and are stuck in a little piece of land and now want to own that piece of land as a consolation to failure. They shouldn’t be allowed and should be told to go back accross to their original borders",
            "score": 7,
            "replies": []
        },
        {
            "author": "Extreme_Employment35",
            "body": "Thank you!",
            "score": 7,
            "replies": []
        },
        {
            "author": "delpy1971",
            "body": "Good old Turkey seeing sense!!",
            "score": 7,
            "replies": []
        },
        {
            "author": "Bcoonen",
            "body": "Erdogan is only playing His own game for himself and everybody knows it. He is a opportunist who chooses whats most beneficial for him right now.\n\nAnd Erdogan knows how important the black sea area is.\n\nHe is not friendly or something alike.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Final_Expression_600",
            "body": "I never thought I would say it but I agree with Turkey",
            "score": 8,
            "replies": []
        },
        {
            "author": "Jensen1994",
            "body": "Turkiye - fair play. The only NATO nation in recent times to down a Russian jet.....",
            "score": 4,
            "replies": []
        },
        {
            "author": "snootfull",
            "body": "So wild to think that Erdogan is an icon of liberty and rule of law when compared to the President of the United States.",
            "score": 3,
            "replies": []
        },
        {
            "author": "screenrecycler",
            "body": "Even a broken Erdo is right twice a decade.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Aggravating_Call910",
            "body": "“And, and, we’re NATO members, jagoff.”",
            "score": 5,
            "replies": []
        },
        {
            "author": "Blackthorne75",
            "body": "As much as I *despise* Erdogan, one thing I'll grant him is that he follows through with his statements...\n\n... and subtle threats.",
            "score": 2,
            "replies": []
        },
        {
            "author": "fetissimies",
            "body": "Rare Erdogan W",
            "score": 2,
            "replies": []
        },
        {
            "author": "FassTech",
            "body": "They claim to be defending the integrity of Ukraine 🇺🇦, but Turkey is still occupying part of Cyprus. What hypocrisy! ...",
            "score": 2,
            "replies": [
                {
                    "author": "Sensitive-Emu1",
                    "body": "Again, I am sick of educating people on this.\n\nTurkey's \"occupation\" is legal by the 1960 Treaty of Guarantee. Fact is a fact. Even if the entire world calls it an illegal occupation, it doesn't change the reality. It's accepted that ethnic cleansing was started by EOKA and stopped by Turks. So they had every right to intervene.\n\n>\n\n>\n\n>\n\nBefore the Intervention:\n\n\\- Warnings Before the Coup\n\nTurkey had warned Greece multiple times about its support for EOKA-B, a Greek Cypriot paramilitary group aiming for Enosis (union with Greece).\n\nTurkish officials communicated with Britain, a fellow guarantor power, about the rising tensions.\n\n\\- After the Coup (July 15, 1974)\n\nOn July 17, Turkey's Prime Minister Bülent Ecevit met with British officials in London, urging joint action to restore Cyprus' constitutional order.\n\nThe UK refused military involvement.\n\n\\- Efforts for Diplomatic Talks\n\nTurkey sent diplomatic messages to Greece, urging it to withdraw support for the coup led by Nikos Sampson.\n\nTurkey also sought UN involvement but saw no immediate resolution. Since diplomatic efforts failed and negotiations with the UK and Greece did not lead to a solution, Turkey cited Article IV of the Treaty of Guarantee and launched Operation Attila on July 20, 1974.\n\nAlso again, in 2004 with Annan plan Turks wanted to unite again, Greek Cypriots refused. So I apologize for not letting Greeks to kill Turks. We must be really evil to protect our own. I hate the hypocrisy of Europe.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "im_a_mix",
                            "body": "Thank you, I genuinely appreciate someone actually bringing history to the table instead of talking points in an attempt to rewrite history",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "adamgerd",
                    "body": "I don’t know why you were downvoted, Turkey should withdraw from Cyprus.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AutoModerator",
            "body": "\nПривіт u/NearOpposite ! During wartime, this community is focused on vital and high-effort content. Please ensure your post follows [r/Ukraine Rules](https://www.reddit.com/r/ukraine/about/rules).\n\n**Want to support Ukraine?**  [**Vetted Charities List**](https://www.reddit.com/r/ukraine/wiki/charities) | [Our Vetting Process](https://www.reddit.com/r/ukraine/wiki/charities-vetting)\n\n**Daily series on Ukraine's history & culture:**  [Sunrise Posts Organized By Category](https://www.reddit.com/r/ukraine/wiki/sunriseposts/)\n\n**To learn about how you can support Ukraine politically, visit r/ActionForUkraine**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ukraine) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "WotTheFook",
            "body": "You know that you're in deep shit, if Turkiye is calling you out for your actions.",
            "score": 1,
            "replies": []
        },
        {
            "author": "billiarddaddy",
            "body": "I really, really wish we would get a very confrontation administration that simply wouldnt fuck with Putin anymore and really start squeezing.\n\nBullies cannot be appeased.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Falcrack",
            "body": "That's all fine and good. But is Turkey willing to provide the level of military support that would allow Ukraine to reclaim the lands Russia stole?",
            "score": 1,
            "replies": [
                {
                    "author": "Sensitive-Emu1",
                    "body": "Is any European country willing to do that? Because I didn't see any. Also, I didn't see any of them shooting down a Russian Aircraft. Also I didn't see any of them fought against Russia in Syria and Libya.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "AutoModerator",
                            "body": "Russian Aircraft fucked itself.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ukraine) if you have any questions or concerns.*",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Sensitive-Emu1",
                                    "body": "Good bot.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "KnockturnalNOR",
            "body": "Erdogan's Turkey has often been a thorn in the side of NATO and Europe. Thankfully, their proximity to Russia makes them natural regional power rivals. Turkey has zero interest in letting Russia creep ever closer to it's territory (and sphere of influence which Erdogan believes includes Syria)",
            "score": 1,
            "replies": [
                {
                    "author": "Sensitive-Emu1",
                    "body": "Thorn on NATO's side? How?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "KnockturnalNOR",
                            "body": "Buying Russian AA (as it turns out, not very good AA) which could in theory provide Russia data on Western weapons systems. There was literally no good reason for them to do this. Then it was them blocking Sweden's accession to NATO, leveraging an unrelated military alliance to strong-arm some political prisoners from Sweden. \n\nThey're also actively attacking the American-backed faction in Syria, which doesn't directly have anything to do with NATO, but it's more of the unnecessary infighting they seemingly love.\n\nThey're not nearly as bad as Hungary, which is a Russian puppet. Compared to that, Turkey just doesn't seem to care that much about friendships and loyalties, but at least they don't let Russia steamroll them for no reason like Orban does with Hungary.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Sensitive-Emu1",
                                    "body": "Well looks like Nato should have been sold Patriots to Turkey right? I wonder why Nato did not sell Patriots which only usage is defensive.\n\nMaybe Sweden shouldn' support PKK. Every action Turkey takes as thorn is retalliation.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ivoras",
            "body": "\"Dare to be stupid\" - Weird Al",
            "score": 1,
            "replies": []
        },
        {
            "author": "HeartwarminSalt",
            "body": "Black Sea Union!",
            "score": 1,
            "replies": []
        },
        {
            "author": "North_Church",
            "body": "I will cautiously welcome this statement because fuck Russia and Trump, but it remains a cautious welcome because Erdogan is as trustworthy as a smashed stranger asking to borrow a bicycle.",
            "score": 1,
            "replies": []
        },
        {
            "author": "channdlerBing",
            "body": "he can barely do anything tho",
            "score": 1,
            "replies": []
        },
        {
            "author": "SuspectKnown9655",
            "body": "Don't like or trust Erdogan...but we should take what we can get I guess. It's not like the US is any help.",
            "score": 1,
            "replies": []
        },
        {
            "author": "-Makeka-",
            "body": "I for one welcome Turkey as a great power.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HauntingArugula3777",
            "body": "But where would be play Navy at then?",
            "score": 1,
            "replies": []
        },
        {
            "author": "FatWithMuscles",
            "body": "My respect for turkey has increased immensely",
            "score": 1,
            "replies": []
        },
        {
            "author": "eldenpotato",
            "body": "Ok but what can anyone do about it? Russia has held it for 11 years.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mecklenjr",
            "body": "If Putin gave up Crimea he'd be thrown out a window by the Russian people. Every Tsar who lost territory also lost his throne or his life",
            "score": 0,
            "replies": []
        },
        {
            "author": "Beakstone",
            "body": "Free Kurdistan",
            "score": -5,
            "replies": []
        },
        {
            "author": "BubbhaJebus",
            "body": "So, Turkey, that's good. Now, for the sake of consistency: what about Northern Cyprus?",
            "score": -3,
            "replies": [
                {
                    "author": "Sensitive-Emu1",
                    "body": "Annan Plan 2004. Refused by Greeks.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Any-Morning4303",
            "body": "If Turkey doesn’t like it it’ll have to deal with Russia, North Korea, Iran and US of A!",
            "score": -10,
            "replies": []
        }
    ]
}