{
    "title": "Ukraine Won’t Compromise on Territorial Integrity or Armed Forces Size, Kyiv Official States",
    "author": "UNITED24Media",
    "subreddit": "ukraine",
    "rank": 10,
    "score": 955,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 51,
    "url": "https://united24media.com/latest-news/ukraine-wont-compromise-on-territorial-integrity-or-armed-forces-size-kyiv-official-states-6828",
    "id": "1je93ec",
    "selftext": "",
    "comments": [
        {
            "author": "Skiddienyc1978",
            "body": "And Ukraine should not have to...",
            "score": 136,
            "replies": [
                {
                    "author": "ravnhjarta",
                    "body": "Exactly this, 200%",
                    "score": 34,
                    "replies": [
                        {
                            "author": "B4USLIPN2",
                            "body": "This is their decision. No one else’s to make.",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "ravnhjarta",
                                    "body": "Precisely what we are saying. No one else should decide Ukraine's future but Ukraine.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Skiddienyc1978",
                                            "body": "Of course, it's Ukraine's decision.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "red_hulk1995",
                    "body": "More likely never. You don't know if someone is going to stab you in the back.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ITI110878",
            "body": "Europe will have to stay firm behind this stance.",
            "score": 68,
            "replies": []
        },
        {
            "author": "TK7000",
            "body": "It pains me to say it, but that means that Russia needs to collapse as a country, or Russian forces need to experience such a monumental defeat someone unseats Putin and makes peace with Ukraine by retreating all Russian forces.\n\n\nIt will be long and bloody.",
            "score": 54,
            "replies": [
                {
                    "author": "Archsquire2020",
                    "body": "it would be far more one-sided if the US didn't help the rapist and \"the west\" were united and did more to stop Russia.\n\nLook, i get it. Europe allowed itself to be weak because they believed the US more friendly and believed Russia to be \"of good faith\" in their economic endeavours in the past. But shit has hit the fan (and then some) and Europe needs to find a way to strengthen itself. Helping Ukraine win, whatever it takes, is the cheapest (in both money and blood) solution we have in Europe. Sure, Poland, Romania, Finland should not send too much due to proximity to the aggressor but everyone else can absolutely send more. And everyone should increase their stocks!",
                    "score": 39,
                    "replies": []
                },
                {
                    "author": "North_Church",
                    "body": "As I've learned from Eastern Europeans, in order for this to truly end, Russia needs to undergo a massive decolonization process. Putin is a product of Russian society and the problem isn't going to end when he eventually kicks the bucket.",
                    "score": 20,
                    "replies": [
                        {
                            "author": "sunloinen",
                            "body": "The situation seem to be very weird in russia. I've been watching Vled Vexlers videos about russian sociaty and it's pretty grim and complicated.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Altruistic_Shake_723",
                            "body": "How genocidal of you.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "North_Church",
                                    "body": "Asking for decolonization is genocidal?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Alaric_-_",
                                            "body": "If you look at his comment history, he is spreading Putins propaganda like \"denazifying Ukraine\" and shit like that. Just downvote and move on, shills deserve no extra attention.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Mors_Umbra",
                    "body": "They've needed to collapse as a country since the days of the USSR. russia has been nothing but a blight on the prosperity and dignity of humanity for over a century at this point. It's a shame the collapse of the USSR didn't finish them off as a mindset, and a greater shame the West naiively welcomed and encouraged them during their recovery.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "amsync",
                            "body": "A century? I think there are some that would say for a LOT longer",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Mors_Umbra",
                                    "body": "You're not wrong! My pre-soviet history is pretty lacking however 😅 A century at least seemed like a safe ballpark as a minimum.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "solidlymediocre",
                    "body": "It shouldn't pain you to say it. It's a fact.\n\nPlenty of great people in Russia, but unfortunately even more imperialist, uneducated pigs.\nRussian society desperately needs to be humbled and humiliated in order to rise and evolve into the 21st century.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "_MCMLXXXII",
                    "body": "It's one scenario but far from the only possibility.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Inglorious555",
                    "body": "It shouldn't pain anyone to say that Russia should collapse as a country\n\nI fully welcome it, the world would be better off if Russia were to completely and totally collapse",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Altruistic_Shake_723",
                            "body": "I don't get why people allow themselves to be trained to hate a country that has produced great art and literature.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "Inglorious555",
                                    "body": "They could redeem themselves by standing up against Putin's regime but they won't ever do so\n\nThe only people who deserve praise are the partisans who help Ukraine and those who oppose the war and have fled elsewhere harming Russia's economy\n\nGreat art and literature can come from anywhere",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Alaric_-_",
                                    "body": "And *thousand years* of misery and suffering for russians and neighbors of russia by mass murder, mass rape, destruction of population centers, mass exodus of original inhabitants, mass starvation, genocide in more then one occasion...  \n...but few paintings and operas should just negate all that???\n\nThat's why people do not like russia despite their meager contribution to the arts.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "eldenpotato",
                    "body": "So, unlikeliest of scenarios, basically.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Altruistic_Shake_723",
                            "body": "Wait until they see what really happens.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Brilliant-Important",
                    "body": "Yes. But.  This is the way.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "badazzcpa",
                    "body": "This is unfortunately the only way Ukraine is going to keep all its land.  While I would love for Ukraine to do this, unfortunately this is not the reality of the war right now.  I keep having hope that the tides are changing when Ukraine has Russia held up and recaptures some land, then Ukraine will do a retreat and give up land somewhere else.  \n\nWhile it does appear Russia is starting to exhaust its supply of heavy machinery and long range missiles, they do not, at the moment, seem to be out of troops.  Russia just keeps on sending wave after wave after wave of troops and taking land from Ukraine.  \n\nSo, if Ukraine does not want to give up its land then something drastic needs to change.  First, they have to talk Europe into giving a lot more than they have, both in equipment and money.  Assuming Ukraine is successful in that then they will need a few dominos to fall their way.  They need to either develop or get Europe to give them longer range missiles/ICBM’s and a lot of them.  Ukraine needs to be able to hit the airfields of Russia’s bombers, to push them a lot further from the front lines. Secondly, they need more boots on the ground and the need the west to equip those soldiers.  From what it looks like they have approximately 800k soldiers, they need to get that to 1 - 1.2 million to match Russia.  Currently Zelenskyy appears unlikely to do this.  Lastly, they need to take a more scorched earth approach to Russia.  Meaning Ukraine needs to ramp up its attacks in Russia several fold.  They need to decimate Russia’s ability to fund the war.  Absolutely flatten every single refinery, port, pipeline, and tanker they can find.  Make it impossible for Putin to keep going.  The last one will hurt India, China, and Europe and none of them will be too happy about it. \n\nIf you look across the last several decades at the wars that were fought and “won” and the ones that were fought and stalemated, the country or population that was willing to do whatever it took to win is almost always the one that came out on top eventually.  So either Zelenskyy needs to secure the funding and take the war to a place not even Putin will go or he needs to make the best deal he can and get the war over with.  But slowly retreating like Ukraine has done since the first counter attack is not going to put Ukraine in any better position in the next year or years.  Zelenskyy has to change something in this war or make a deal.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "DummyDumDragon",
                    "body": ">Russia needs to collapse as a country\n\nOk :)",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "imbrie75",
            "body": "Quite fucking right.",
            "score": 24,
            "replies": []
        },
        {
            "author": "Sure-Sea2982",
            "body": "Nor should they.",
            "score": 12,
            "replies": []
        },
        {
            "author": "CaramelCritical5906",
            "body": "100% correct position!!!",
            "score": 10,
            "replies": []
        },
        {
            "author": "North_Church",
            "body": "Why would they? A guarantee from Russia and America is worth less than toilet paper!",
            "score": 10,
            "replies": [
                {
                    "author": "antilittlepink",
                    "body": "That’s an insult to toilet paper, which is always useful for its purpose",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Iamoggierock",
            "body": "If they do then it's a long and bloody downfall, if they don't then it's long and bloody but with a path to victory and freedom.",
            "score": 6,
            "replies": []
        },
        {
            "author": "elmchestnut",
            "body": "Good. Make Trump argue to the world that Ukraine should give up territory to an illegal invasion. That’ll go well.",
            "score": 3,
            "replies": []
        },
        {
            "author": "punkojosh",
            "body": "Crimea being thrown under a bus would be suffient to radicalise me.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ConsiderationBest938",
            "body": "Vladimir Putin says a ceasefire should \"remove the underlying causes of this crisis\". So he’s going to have himself shot, then?",
            "score": 2,
            "replies": []
        },
        {
            "author": "AutoModerator",
            "body": "\nПривіт u/UNITED24Media ! During wartime, this community is focused on vital and high-effort content. Please ensure your post follows [r/Ukraine Rules](https://www.reddit.com/r/ukraine/about/rules).\n\n**Want to support Ukraine?**  [**Vetted Charities List**](https://www.reddit.com/r/ukraine/wiki/charities) | [Our Vetting Process](https://www.reddit.com/r/ukraine/wiki/charities-vetting)\n\n**Daily series on Ukraine's history & culture:**  [Sunrise Posts Organized By Category](https://www.reddit.com/r/ukraine/wiki/sunriseposts/)\n\n**To learn about how you can support Ukraine politically, visit r/ActionForUkraine**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ukraine) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "epic-mentalbreakdown",
            "body": "Then we get another; you don't hold the cards! And US calls off everything and abandon Ukraine. \n\nWe give you a peacedeal but you won't accept it! And you did not say thank you!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wobblycogs",
            "body": "Absolutely right. This is going to upset the orange guy,though, I suspect.",
            "score": 1,
            "replies": []
        },
        {
            "author": "wolfhound_doge",
            "body": "after Trump is done with his experiment/ego trip, EU should sit with UA and finally agree on some specific security guarantees, including boots on the ground. for example EU could defend UA's northern border with belarussia, freeing UA troops, that are currently stationed there, for eastern front. and also deploy some anti-air troops at least in oblasts west from Poltava, Dnipropetrovsk and Kherson.\n\nit's fucking stupid that that orange turd is sabotaging UA right from his inauguration and still has the initiative in \"peace talks\" and other shit. just let him do his thing, if we can't straight up isolate him, but at least don't stand idly and look at the situation to unfold and make something specific.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Foreverett",
            "body": "Russia doesn't get anything out of these deals except for stopping what is causing the collapse of their economy and their entire existence.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Livelydot",
            "body": "Good for them. Hold firm!",
            "score": 1,
            "replies": []
        },
        {
            "author": "SmoothOperator89",
            "body": "\"Reduce your armed forces so we can have an easier invasion next time.\"\n\nDisgusting terms. If any assurance from the US or Russia could be trusted, they would have honoured the nuclear disarmament deal, and the invasion would never have happened in the first place, or foreign troops would have intervened.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jcoronado92",
            "body": "Man I want them to keep all of their territory including Crimea, I just don’t see how this war ends without Ukraine giving up some part of it.. I just hope the USA doesn’t make Ukraine give it up, if they want to continue fighting.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Strontiumdogs1",
            "body": "There is no way they can agree to any change or reduction to their military. \nPutin just doesn't want to end the war.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Confident_Fudge2984",
            "body": "We should demand Russia ends mobilizations and the aid to Ukraine will decrease.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Altruistic_Shake_723",
            "body": "Yes they will.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KptKreampie",
            "body": "Only Chuck Shumer would walk into Nuremberg to try and negotiate for the relese of the prisoners in good faith.\n\n \"We promise you will have safe passage. We'll shake on it.\"-nazi guard.\n\"Good enough for me.\" -Chuck the Cuck",
            "score": 1,
            "replies": []
        }
    ]
}