{
    "title": "What do you guys do before bed",
    "author": "Affectionate-Ad-6884",
    "subreddit": "ADHD",
    "rank": 24,
    "score": 188,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 375,
    "url": "https://www.reddit.com/r/ADHD/comments/1in4pnt/what_do_you_guys_do_before_bed/",
    "id": "1in4pnt",
    "selftext": "I know before bed youre not supposed to use and technology but i honestly dont know what else to do that isnt completely boring. What are some things that you guys do before bed (like an hour before bed) to make sure going to sleep is doable while not being completely bored? P.s. if there is anything else im missing please let me know",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/Affectionate-Ad-6884 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "abraxkadabra",
            "body": "Have anxiety",
            "score": 405,
            "replies": [
                {
                    "author": "donwupak",
                    "body": "I prefer to save my anxiety for the morning before I start my entire day",
                    "score": 86,
                    "replies": [
                        {
                            "author": "abraxkadabra",
                            "body": "Why don’t we have both ?🤷‍♀️🌮🎉",
                            "score": 68,
                            "replies": [
                                {
                                    "author": "Calm_Leg8930",
                                    "body": "Exactly",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ProInvestCK",
                            "body": "That feeling before I open up my calendar to see when the first meeting starts…. In 30 min 😱",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "Sufficient_Row_2021",
                            "body": "You can save it?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "xithbaby",
                    "body": "You make me laugh",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "SL13377",
                    "body": "Oh now in my 40s I’ve traded that pre sleep anxiety with what I call 3 am\nExistential crisis",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Hotdog_Fishsticks",
                            "body": "As it is 0340 here and I am forcing myself to sleep.. i have a 1000 class.. fuck me.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PinkMorrigan",
                    "body": "This. If I’m not on my phone before bed I feel so anxious?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Bells-palsy9",
                            "body": "The phone distracts you from the uncomfortable sensations and feelings most of us are plagued with, so it’s not that the feelings aren’t there you’re just not feeling them directly like you would if your phone wasn’t there.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Decent_Excuse8172",
                    "body": "Yas Queen",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Accomplished-Sky3489",
                    "body": "Works everytime 😎",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "foobarbizbaz",
                    "body": "Checking in! Almost 2am & going strong 👍",
                    "score": 3,
                    "replies": [
                        {
                            "author": "abraxkadabra",
                            "body": "Me too",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AncientPear1515",
                    "body": "I lol’d a little too hard at this",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "hikingma13",
                    "body": "I only let mine out at 4am so if I don't fall back asleep with 10 mins my sleep cycle, and my day is totally screwed. Fun times.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "abraxkadabra",
                            "body": "So fun",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "yonbot",
                    "body": "Hmmm this is true. I wonder why though, is there a connection between adhd and anxiety?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "abraxkadabra",
                            "body": "There is!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "NathanLonghair",
                    "body": "…ow.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "realFuckingHades",
            "body": "Doom scrolling and imagining me beating up people that wronged me 10 years ago.",
            "score": 279,
            "replies": [
                {
                    "author": "Inevitable_Dark3225",
                    "body": "This is the way.",
                    "score": 34,
                    "replies": []
                },
                {
                    "author": "unsteadywhistle",
                    "body": "I’m absolutely reliving conversations in which I absolutely won and the other person knew what they did wrong and corrected their behavior because my dressing down was so effective.",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "sauteer",
                    "body": "Love me some revenge dreams",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "Accomplished-Sky3489",
                    "body": "One of us! One of us! ✊🏼",
                    "score": 21,
                    "replies": [
                        {
                            "author": "demondisguisedangle",
                            "body": "Yea everyone here is",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ninepasencore",
                    "body": "oh you get me",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "chrliegsdn",
                    "body": "I don’t do the doom scrolling, but I do imagine harassing people that have wronged me. The way I do it is I imagine I’m standing at the edge of a cliff and all the people that have wronged me just standing there and I have super powers that makes them float in the sky where I can just move them around at will while they freak out. I know it’s silly and immature but it makes me feel better.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Mac_Attack1994",
                    "body": "Once the end of the world is here, our imagination will finally come to real life. The hunt is on!",
                    "score": 2,
                    "replies": [
                        {
                            "author": "realFuckingHades",
                            "body": "Ha ha. I tell my wife, if the civilization ever breaks down. I will be hunting some people with a double sided axe and a Kangal Shepherd dog.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Organicpoems",
                                    "body": "Hunting people? How does your soul feel ok even thinking this? It’s not funny in any way, actually concerning.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "realFuckingHades",
                                            "body": "Ones that wronged me and the ones that are scums who deserve it. Not innocent people.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "t0ldyouso",
                    "body": "real",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "P33PEEP0OP00",
            "body": "Crosswords? Nytimes app. If you threaten to cancel, they give you a good deal. It’s not scrolling, but it is technology. It uses your brain though!",
            "score": 77,
            "replies": [
                {
                    "author": "skmtyk",
                    "body": "There are other games that are very similar to the NYT ones and are 100% free (just in case op isn't in US/Europe, so even a few dollars can be expensive)",
                    "score": 15,
                    "replies": [
                        {
                            "author": "Impressive_Serve7196",
                            "body": "Where",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "skmtyk",
                                    "body": "If I share it publicly they light take it down so I DMed you the link\n\nEdit: pretty much all you have to do is to look up the new York Time game titles and Google \"game name + free\" or \"game name + unlimited\"",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "CyberNeonAbyssHacker",
                                            "body": "Would you be so kind and send it to me as well? :) I'd appreciate it! Thank you!",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "skmtyk",
                                                    "body": "I tried to message you but apparently it's not working for some reason. Please send me a message",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Soldierpeetam",
                                            "body": "Please dm me too :)",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Old-Career-7790",
                    "body": "yes and the connections! I love to do this at some point in the day",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Impressive_Serve7196",
                    "body": "Same",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "demondisguisedangle",
                    "body": "Kind of the same thing tho",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "pippitypoop",
                    "body": "OMG you just reminded me that I love doing crosswords before bed",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "pothoslovr",
                    "body": "printable sudoku and crossword puzzles are free online, if you have access to a printer it's preferable to being on your phone and sudoku+tv show in the background is a nice combo",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "lunesereine",
            "body": "Reading and stretching",
            "score": 53,
            "replies": [
                {
                    "author": "demondisguisedangle",
                    "body": "Impostor? Who with adhd would stech and reed before going to bed Sorry if im wrong",
                    "score": 36,
                    "replies": [
                        {
                            "author": "SwatsBlockman",
                            "body": "I think you’re just making a joke, but this type of fatalistic mentality is far too prevalent in this sub. ADHD comes in many different degrees, and it makes life difficult, but it doesn’t make life impossible. \n\nI try to read and stretch before bed too. It makes falling asleep soooo much easier. \n\nReading, exercising, meditating, eating healthy, drinking water, and avoiding screens as much as possible are essential for us if we want to level the playing field. ",
                            "score": 55,
                            "replies": [
                                {
                                    "author": "PeaceAndJoy2023",
                                    "body": "Not who you responded to, but thank you for this reminder.  Frankly, my diagnosis has given me an excuse to not push myself and that sucks.  I'm not so tough on myself now, but like, I could use *a little* tough love from myself!  Just a little!",
                                    "score": 24,
                                    "replies": [
                                        {
                                            "author": "SwatsBlockman",
                                            "body": "I think you're totally right! After coming to terms with my diagnosis I would frequent this sub. I found myself  making excuses, and just blaming all of my shortcomings on ADHD. I honestly think that most of my shortcomings *are* at least exacerbated by ADHD, but this is the hand I was dealt, and it's the only one I'll get. Might as well make the most of it. We need to balance giving ourselves some grace with accountability.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "PeaceAndJoy2023",
                                                    "body": "Well said.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "plurpanda",
                                    "body": "This so much. When I'm really on top of my shit I don't use a screen for an hour before bed (other than maybe setting an alarm). stretching is a great wind down and I've enjoyed reading as well but tbh solving a rubiks cube actually is my fave. Almost feels as if I'm conditioned to get sleepy after solving it a few times lol.\n\nI find the best time for me to read is first thing in the morning. My body naturally wants to move slow and my brain wants stimulus, plus its the main time of day I can actually fucking sit still long enough to read lol.\n\nSeriously though, I view not using my phone for an hour in the morning as almost crucial to having any decent executive function for the day.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "criticalnom",
                            "body": "Stech and reed 💀",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "Opposite-Border6654",
                            "body": "Someone who has found a hyperfocus activity and will stop doing it after 3 months?",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "monsters_studio_",
                            "body": "I stretch as a form of working out bored energy at night (while watching tv and stuff)",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Intrepid_Zucchini858",
                            "body": "My first thought was “damn how healthy. Why can’t I do that”. Then I read this and laughed. But we can all dream!!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "demondisguisedangle",
                    "body": "Sorry if im wrong",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ProfessionalArm8256",
            "body": "Meet with my demons in an anxiety showdown till sun rise",
            "score": 47,
            "replies": [
                {
                    "author": "Sufficient_Row_2021",
                    "body": "\"Thank you all for coming...\"",
                    "score": 3,
                    "replies": [
                        {
                            "author": "ProfessionalArm8256",
                            "body": "“Hey demons, it’s your boy again.”",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Kuandohan",
            "body": "I literally cannot sleep in silence. I will lay awake for hours. I usually put on a vod of a streamer who I find calming and not too crazy (simpleflips is a go to for my wife and I). I usually watch YouTube videos of YouTubers I don't have to think to hard about the content they make (stuff I'm not interested in to the point of using brain power, or mildly amusing) and will watch until I'm nodding off. Otherwise I will stay up all night until I crash. There are a few YouTubers I have a backlog of their videos and they make content often enough that I don't run out of sleep material lol.",
            "score": 28,
            "replies": [
                {
                    "author": "kemide22",
                    "body": "I haven’t slept in silence in over 30 years. I discovered listening to thrash music did the trick before opting for talk radio which was pretty much the staple until I got fed up of hearing the same ads and the time checks, news bulletins which reminded me how few hours I had left until  I had to get up. I switched to podcast playlists I would set up every night but I kind of got bored of that after about 6 years and recently it’s been YouTube videos about conspiracies, corruption, government, religion, Epstein, the banking system etc etc. I don’t necessarily buy all that stuff but it’s the way those things are narrated that allows my mind to switch off and sends me to sleep.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Kuandohan",
                            "body": "You know, listening to constantly loud and aggressive music also puts me to sleep? Obviously when I'm in the mood to listen to it, it's great, but it can actually put me to sleep too. I used to listen to hardcore death metal bands to doze off. Not really sure what that means. Lol maybe it's an ADHD thing.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "kemide22",
                                    "body": "Absolutely. Metal can hype and calm me. Maybe it’s the right level of certain frequencies that makes something click in the brain?",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Admirable-Angle-3633",
                            "body": "i hope you dont mind but di you have some good talk rado recommendations. that kind of stuff puts me to sleep but i can never find ones that arnt \"the world is ending\" feer mongering shit. thanks",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Affectionate-Ad-6884",
                    "body": "Dude i fucking love simpleflips and the mario 64 runs, back in prime 2018 he was my goto YouTuber",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Kuandohan",
                            "body": "He's still making great content now, I still recommend him. Watch his Walkies series. My wife and I were on the edge of our seat every week during that series  He's also lost an insane amount of weight. You'll wonder if it's the same guy.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Purple_Ground855",
            "body": "I play blockblast or watch an old anime until I fall asleep. I feel you bc I will lay wide awake and just talk to myself for hours if I have nothing to do.",
            "score": 19,
            "replies": [
                {
                    "author": "Timely_Evidence5642",
                    "body": "What anime?",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Purple_Ground855",
                            "body": "Right now I’m watching Ookiku Furikabutte and in the past I’ve watched Lovely Complex, Durarara, and OHSHC",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Timely_Evidence5642",
                                    "body": "Ok cool",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SubjectBrick",
            "body": "I find I can use technology if its not too stimulating. Like watching a TV show or playing video games = no sleep. But I can read wikipedia or the paper on dark mode and still fall asleep. Wikipedia I still have to be careful not to fall into a rabbit hole though.\n\nBut really reading a physical book is the best. If its a good book it'll be fun, and if its boring it'll put you to sleep!",
            "score": 15,
            "replies": [
                {
                    "author": "xithbaby",
                    "body": "Wikipedia how was math invented?",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Raelah",
                    "body": "I can't do books before bed. If it's good, I'll stay up all night. If it's boring, it can't even hold my attention long enough for it to put me to sleep.\n\nI wish I could do books before bed though. It's so much better for your sleep cycle than screens.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "These_System_9669",
            "body": "I usually clean, do dishes, get my lunch ready for the next day, get my clothes, ready for the next day, then take my dog for a walk. Pretty much the same routine every day.",
            "score": 16,
            "replies": [
                {
                    "author": "Affectionate-Ad-6884",
                    "body": "This is hard to do unless i get used to it so this is very considerable and i appreciate it",
                    "score": 9,
                    "replies": [
                        {
                            "author": "These_System_9669",
                            "body": "It gets you away from technology and it makes your next day easier smoother and more efficient so it’s a win-win",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "thecorkontheocean",
                    "body": "I had no idea that people picked out their clothes the night before until a couple of years ago when a coworker said she does this. I've only ever done that for special occasions, like a job interview or planned type thing. \nHonest question: did your parents teach you this?",
                    "score": 8,
                    "replies": [
                        {
                            "author": "These_System_9669",
                            "body": "No, just learned it over time. I get every single thing ready the day before so I just wake up, drinki my breakfast shake, walk dog and put the door.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "Choice-Combination-6",
                            "body": "Same lmao",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "aloethereitsjustme",
                            "body": "Not who you replied to but saw this and had to say my parents tried so hard to teach me this... unsuccessful at my actual doing it, but they did teach me how impactful it is. I see so much value in it now that I'm a parent too, but I can't actually get myself to do it 😂",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Hotdog_Fishsticks",
                            "body": "I've started putting my clothes out for the next day.. it has helped me streamline my mornings and take the decision factor out for me.\nI've gotten lazy lately, but it definitely helps!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Chokomonken",
                    "body": "Wow this has been my dream for my entire adult life.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "These_System_9669",
                            "body": "If it’s hard for you to do, what helps me is to write down that I’m going to do it earlier in the day on a piece of paper. Then, in addition, I like to set a timer to add some level of stress to it so that I get it done in a certain amount of time. When I do it this way it has a certain level of stress that makes it very engaging.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Hotdog_Fishsticks",
                    "body": "Feck, i need to start doing this. I'm gonna try.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "usersnamesallused",
            "body": "Everything, all at once, everywhere",
            "score": 14,
            "replies": [
                {
                    "author": "i_t_s_c_e_e_j_a_y_y_",
                    "body": "100% this",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Hungry-Crow-9226",
            "body": "Read, journal, stretch.",
            "score": 11,
            "replies": []
        },
        {
            "author": "marvthegr8",
            "body": "I read for an hour or so every night. A habit I've had since quite young. It's almost impossible for me to sleep without doing that.",
            "score": 9,
            "replies": [
                {
                    "author": "themadesthatter",
                    "body": "This, I read physical books. Mostly sci-fi/fantasy. And I have for over 20 years now, long before I had a diagnosis. It’s the only tool that will shut my brain down.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Brii1993333",
                            "body": "Preach. I agree.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Zealousideal-Earth50",
            "body": "I watch (or listen to) a comedy show that I’ve seen a million times, on low volume. I know what’s going on so my mind isn’t activated so much that I’m wanting to find out what happens next (I already know what’s happening with my eyes closed) but it occupies my mind enough to drown out obnoxious worries.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Slight_Respond6160",
            "body": "If I’m being good me. Reading or Ukulele. If I’m being bad me, a big joint and a screen. Hopefully fall asleep watching so I’m not up too late. Lately it’s Minecraft and some of the time I don’t even bother sleeping.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Mochinpra",
            "body": "Read the most boring news post on reddit for like 10-15 mins. This usually does a decent job at making me sleepy and not interested in the outside world at all. Also to make sure you have stretched before going to bed. The act of stretching and slightly warming up my muscles, before laying down for awhile has been doing a good job at really getting me sleepy for bed.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Wrong-Damage1222",
            "body": "If I’m alone, jerk off without porn (so no screen time) Sometimes a warm shower first if I’m really anxious about falling asleep before an early morning/important day.\n\nEdit: I play more relaxing music or a podcast when I shower so I’m not hyped up. Sometimes the podcast regardless of the shower helps too… as long as it doesn’t get me worked up.",
            "score": 12,
            "replies": [
                {
                    "author": "xithbaby",
                    "body": "How do you even finish, are you on any meds? If I tried this at my age I’d be doing it all night and end up pissed off i got no sleep and didn’t go anywhere.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Wrong-Damage1222",
                            "body": "I guess it’s just never been an issue for me (37/M). I’ve been taking Adderall since senior year of high school. Only times I’ve had issues with that is if I’m on round 5 or higher for the day… not that I do it that often everyday, but I certainly have! 😂",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "xithbaby",
                                    "body": "Im 42 and was just diagnosed two weeks ago. Im on 5mg of adderall once a day. So this issue goes away then?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Wrong-Damage1222",
                                            "body": "Well I’ve never had an issue with finishing or getting it up, so I can’t say for sure if it’ll go away for you. How long have you been having this problem?",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "xithbaby",
                                                    "body": "Im female, and this started after I was put on Lexapro but I quit that about 3 weeks ago. I thought it was adderall doing it now. Im also 42",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "PitchOk5203",
                                                            "body": "I'm also a woman in my 40s, and have been on Adderall or Ritalin for the last nine months. No problems whatsoever with sex/orgasms on either of these medications (they're the only ones I take). My money's on the Lexapro, it can take a while for things to level out after you quit taking it so hang on in there!",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "Wrong-Damage1222",
                                                                    "body": "Yep. I have two friends (one woman) who told me it took them over a month to really feel like they were done with withdrawal symptoms.",
                                                                    "score": 3,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Hotdog_Fishsticks",
                                                                    "body": "Mine is also on Lexapro as someone who used to take it and also had no libido. \nI just take Adderall and a mood stabilizer now and I can get horny and orgasm.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Wrong-Damage1222",
                                                            "body": "I think lexapro is known to cause this problem. At least I have friends who have said that. That must be so frustrating!",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "SnooRobots7776",
                                                                    "body": "For sure the Lexapro, I SUFFERED in numerous ways on that stuff. Wellbutrin was the miracle one.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "xithbaby",
                                                    "body": "Sorry already said my age",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Affectionate-Ad-6884",
                    "body": "Yeah jerking off is not the way to go at least in my current life lol but the rest are good th",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Wrong-Damage1222",
                            "body": "Haha understandable. I hesitated to say it, but it actually helps me, so figured I should be honest! Sex helps even more, probably because it’s more like a workout, but obviously that requires someone else to help, which isn’t always an option even in the best relationships 😂",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "These_System_9669",
                            "body": "Don’t knock it until you jerk",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "EACshootemUP",
            "body": "Legit craziness but like 2 hours before sleep is when I have the most motivation to go workout kuzz I get bored of YouTube and house-stuff. New trend. I’d finish workouts at like 7pm prior to this new found motivation.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Wise_woman_1",
            "body": "Put on music, lay out next day’s outfit, (try to remember to move clothes from washer to dryer, if it’s gonna get done, this is the time), turn down the heat, stretches & EST, take a hot bath, wash face, brush teeth,  get comfy pjs on, double check that both alarms are set, start one of the sleep hypnosis you tube videos and listen until I fall asleep.",
            "score": 5,
            "replies": []
        },
        {
            "author": "StonyHiker",
            "body": "Get sufficiently stoned",
            "score": 8,
            "replies": [
                {
                    "author": "gifsfromgod",
                    "body": "Far out",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "WesternGatsby",
            "body": "Shower, read, meditate, zzz",
            "score": 4,
            "replies": [
                {
                    "author": "Fresh-e-licious",
                    "body": "This is the way!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Neither_Ad_5599",
            "body": "Take a bath, read, journal. It will feel boring at first but you’ll learn to appreciate the calm it brings",
            "score": 3,
            "replies": []
        },
        {
            "author": "OkTaste9872",
            "body": "i like to journal",
            "score": 5,
            "replies": []
        },
        {
            "author": "empathic_psychopath8",
            "body": "I’m working on eliminating scrolling completely, when I’m in bed about to sleep. I find that regardless of the emotional impact (sad, funny, rage, cute, food, etc) short form content makes my mind get stimulated, enough to feel less sleepy and throw off the quality of it\n\nWhat I’ve found great success with is longer form content:\n1. Podcasts with a specific agenda that is productive (usually somewhat monotone which helps make me drowsy)\n\n2. Video game playthroughs. Usually very long, brainless to watch, puts me to sleep\n\n3. Background music/sounds of your choice. The Calm app has some great stuff, and there are also plenty of channels on YT for this as well. \n\nFor any of these, I can set a timer on my phone to turn off everything and hopefully be asleep by then. But most of the time my eyes start to close sooner and I’ll just shut it off myself",
            "score": 4,
            "replies": []
        },
        {
            "author": "lauressia",
            "body": "daydreaming! i do it basically every time i have a spare thought so i just lie in bed making up stories or mentally write fanfiction or have a discussion in my head about a topic i‘m interested in. from daydreaming to nightdreaming!",
            "score": 3,
            "replies": []
        },
        {
            "author": "tecknonerd",
            "body": "Audio books. Boring ones that I've read before.",
            "score": 3,
            "replies": []
        },
        {
            "author": "SassyPantsPoni",
            "body": "Oh existential crisis, internal conflict, Avoidance, discomfort, and the never ending thought spiral that won’t ever slow down or stop no matter how hard I try! \n\nOh, and usually shower or wash my face, moisturizer, deodorant, face mask and earplugs and doom scrolling ✌🏻",
            "score": 3,
            "replies": []
        },
        {
            "author": "mm21053",
            "body": "I try to read when I have the mental energy, but normally, I play some puzzle type game on my phone until I fall asleep. I know you're not supposed to do that, but I have ti be practical about my needs. I can't sit there with nothing, and I don't always have the mental energy to read. So instead of doom scrolling, I play a game.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Dry-Squirrel-1666",
            "body": "I don’t lol. That’s my answer! I lay in bed on my phone until I either fall asleep using it, or feel tired enough I know I can fall asleep",
            "score": 3,
            "replies": []
        },
        {
            "author": "AdventureMissy",
            "body": "Breathwork, as long as I go to bed by 11pm. This is a great YouTuber I found and think is awesome https://youtube.com/@breathewithsandy?feature=shared - I also journal if I remember.\n\nI always wash my cafetiere and fill the kettle up, get my cup and meds/vitamins ready for the morning and occasionally do a light task, like putting a couple of bits away, if I can be bothered. Let dog out and play with kitty for 20 minutes.\n\nIf it's a night where I missed my go to sleep window, I stay awake until 1-2am and then go to sleep worrying about only having 5-6 hours sleep and wishing I'd listened to myself better 🙈",
            "score": 3,
            "replies": []
        },
        {
            "author": "Prior_Researcher_492",
            "body": "I regret most everything I did/didnt do that day while coloring and drinking a cup of coffee 🫠",
            "score": 3,
            "replies": []
        },
        {
            "author": "Lady_Irish",
            "body": "I make a pillow nest and snuggle down with a book when I start getting tired. No risk of getting lost on social media or wikipedia for hours because \"I just gotta check one thing\" with a novel lol\n\nI use a little gooseneck booklight I got ages ago instead of ky bedside lamp, so I can literally just switch it off and drop it on the bed next to me when I'm ready to pass out. The less I do when I'm ready, the more likely it is to stick lol",
            "score": 3,
            "replies": []
        },
        {
            "author": "AmyVeeee",
            "body": "Put night mode on my iPad and read a book on the kindle app. Smuttier the better. \n\nDoom scroll on my phone. Find a new famous person to stalk and wish I had 1 smidge of their income so I could buy some cool shoes. \n\nFind an online course in something random and not needed for my career and hyper fixate on it until 2am.\n\nHave a shower so I’m all warm and cuddly and climb straight into bed with any of the above options. Get me drowsier :)",
            "score": 3,
            "replies": []
        },
        {
            "author": "Arkansas_Drug_Sloot",
            "body": "Cry",
            "score": 3,
            "replies": []
        },
        {
            "author": "ShinyBeetle0023",
            "body": "Scroll Reddit.",
            "score": 3,
            "replies": []
        },
        {
            "author": "BudSticky",
            "body": "Fuck around on my phone obvi",
            "score": 3,
            "replies": []
        },
        {
            "author": "harmonicfrieght",
            "body": "Scrolling Reddit which usually leads to porn 🤦🏽‍♂️",
            "score": 3,
            "replies": []
        },
        {
            "author": "AquaMoonTea",
            "body": "I read Reddit…. ideally I listen to an audiobook or read manga before bed, but some nights my brain has questions and demands answers.",
            "score": 3,
            "replies": []
        },
        {
            "author": "sailorharmony",
            "body": "cry",
            "score": 3,
            "replies": []
        },
        {
            "author": "Key-Hyena5292",
            "body": "Wait you guys actually sleep at night? , I nap during day for 2 to 3 hours and here we go",
            "score": 3,
            "replies": []
        },
        {
            "author": "nborders",
            "body": "Read.   Specifically a book. 😴",
            "score": 3,
            "replies": []
        },
        {
            "author": "photo83",
            "body": "![gif](giphy|sgJOO0yKLbho8n8GY4|downsized)",
            "score": 3,
            "replies": []
        },
        {
            "author": "dubessa",
            "body": "Set up the sleep vibe - pjs, lavender spray, humidifier, unmake bed, put away any distracting clutter for max zen\n\nSkincare - I have a concoction of products I use and will apply while doing a facial massage. Will also use body lotion and jojoba on my nails \n\nHair - scalp massage with hair oils/treatment \n\nOccasionally I’ll throw in a bedtime stretch. \n\nThe final whammy: \nI take magnesium/melatonin supplements. Then turn on a Spotify playlist for sleep - like rainstorm sounds, binaural beats, or soft ambient music. Knocks me out to sleep quickly every time and helps to override any scattered thoughts",
            "score": 3,
            "replies": []
        },
        {
            "author": "maybe-hd",
            "body": "I mean it's nearly midnight where I am and I'm stood in front of my sink supposedly getting ready for bed, but I'm here replying to this comment instead, so I guess that's what I do",
            "score": 3,
            "replies": []
        },
        {
            "author": "New_Y0rker",
            "body": "Usual ritual of taking a swig of vodka and swishing it around my mouth like mouth wash because I feel that's easier than brushing my teeth, then i swallow it. Then I let my dog out to take a quick piss. Then I stretch and wash my face. then I put lotion on my face and balls (must preserve them) then I piss, then I get into bed, then I remember I forgot to grab a bottle of water so I go downstairs for the water and take another swig of vodka, then I get back into bed and doom scroll for 20 min, then I put on a mundane podcast or YouTube vid to fall asleep to, set my alarm, and fall asleep in 5 min or so.",
            "score": 3,
            "replies": []
        },
        {
            "author": "aspinator27",
            "body": "Revenge bedtime procrastinating.",
            "score": 3,
            "replies": []
        },
        {
            "author": "koolloser",
            "body": "Physical book. I have multiple study guides and primarily read horror.\n\nI use a screenless Bluetooth audio block with wired earbuds for audio(audio books). My phone stays locked in a timed locker—accessible for calls but not for scrolling.\n\nA small TV constantly plays old shows on Plex for background noise, though it’s too far to watch. Thus, I don't count it as a screen. \n\nI am looking for a turn table that stops when the record ends so I can fall asleep to my records.\n\nAlso I do light exercise, I have weights and a treadmill near my bed. \n\nSome ideas, based on years of struggling to fix my sleeping schedule, so my meds can give me their 100%.",
            "score": 2,
            "replies": []
        },
        {
            "author": "owl-overlord",
            "body": "I play Microsoft Solitaire until I feel sleep, on the lowest setting my phone will go. There's dim, then there's extra dim. My favorite is spider currently. Otherwise my brain doesn't turn off",
            "score": 2,
            "replies": []
        },
        {
            "author": "Financial_Holiday533",
            "body": "I 100% watch TV every night. Then at sleep time I put it on a show I've seen a ton of times, to fall asleep",
            "score": 2,
            "replies": []
        },
        {
            "author": "Horror-Scratch-2406",
            "body": "Probably should just read",
            "score": 2,
            "replies": []
        },
        {
            "author": "TreeHawk1111",
            "body": "Drink calming tea, read non fiction inspirational.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Old-Career-7790",
            "body": "I like to clean my room and play Pokémon😂. I know it’s better than social media scrolling and I’m working towards getting off my phone. I also have the sleep schedule set on my phone to remind me to start getting ready for bed. I have to force myself to shower 30 minutes before I go to sleep.",
            "score": 2,
            "replies": []
        },
        {
            "author": "JamesLilian",
            "body": "My therapist recommended taking magnesium before bed and it has really helped with my sleep.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Somerset76",
            "body": "Read",
            "score": 2,
            "replies": []
        },
        {
            "author": "Same_Compote_7230",
            "body": "doom scroll",
            "score": 2,
            "replies": []
        },
        {
            "author": "cigbreaths",
            "body": "On a good day I take a shower and do skin care. Then I lie down and watch some comfort youtube videos until i fall asleep",
            "score": 2,
            "replies": []
        },
        {
            "author": "stoutlikethebeer",
            "body": "I listen to audiobooks. It keeps my mind engaged without overstimulating it and without looking at the screen.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Feisty-Ebb6601",
            "body": "Relaxing Podcasts ( or Audiodramas). So No screens & it helps me to sleep.",
            "score": 2,
            "replies": []
        },
        {
            "author": "somewhereonfullerton",
            "body": "Try to read, fail at reading, meditate, fail at meditating, go to bed",
            "score": 2,
            "replies": []
        },
        {
            "author": "didibreakdonnel",
            "body": "Books don't work for everybody, but I like learning about ADHD so nowadays I read a book about ADHD. My smartwatch has a box breathing feature that I use before bed too. Using a screen that has no internet access has been good for me because it's less distraction potential.",
            "score": 2,
            "replies": []
        },
        {
            "author": "wbrigdon",
            "body": "Lay in bed, doomscroll, imagine being a regular human, realize that would suck, imagine being a bird, that’d be pretty cool, but so would being a manatee or something, manatees are cool, sucks I can’t touch them, It’s a good thing so I shouldn’t, but they’re so majestic, and… how long has this video been looping?",
            "score": 2,
            "replies": []
        },
        {
            "author": "body-jernal",
            "body": "I go to bed watching (mostly listening) about all kinds of stuff i can find on astronomy. Its interessting enough to keep me engaged but boring enough (when they get really scientific) to fall asleep.\n\nOnly issue (and win) is that it created a new hobby for me haha. Love everything about astronomy now",
            "score": 2,
            "replies": []
        },
        {
            "author": "anuski00",
            "body": "Shower, podcast, reading a book, mindfulness and breathing exercises",
            "score": 2,
            "replies": []
        },
        {
            "author": "No_Difference8088",
            "body": "Technology till I pass out. Might be better to do something else but it seems to work for me 😂sometimes I turn off the screens and listen to something while I fall asleep which helps too",
            "score": 2,
            "replies": []
        },
        {
            "author": "patdashuri",
            "body": "Read a book. I used to read every night before bed. It took me a while to get back into it. I started off (again) by reading poems and other simple and short things. I had to train myself to focus again. Keep the poem books nearby in case the longer one you’re starting is too much for tonight. I learned to avoid books that dealt with crafts or hobbies I like. They would give me a desire to get on the phone to look things up or buy shit. Or they’d have me getting out of bed to look into what I already had. I read fantasy and science fiction, political philosophy, and history mostly.",
            "score": 2,
            "replies": []
        },
        {
            "author": "rainy_in_pdx",
            "body": "Between 9:00-10:00 I start my nightly routine. Let the dog out, wash face, brush teeth, and empty litter box. Depending on how I’m feeling I’ll journal and/or read on my kindle paperwhite. There’s no real backlight on it so it doesn’t keep me awake. Usually I drift off after reading a chapter or so",
            "score": 2,
            "replies": []
        },
        {
            "author": "FocusedDrifter",
            "body": "Melatonin, clondine, vitamins, cold shower, get in bed nude, Noise cancelling earbuds listening to pod casts. Fall asleep easy.\n\n- Extreme scenarios I’ll add a sleeping pill. \n- If I had done exercise that day I usually fall asleep faster.\n- I don’t eat sugar and very limited/if any carbs at dinner.\n\n\nI wake up looking for my earbuds.",
            "score": 2,
            "replies": []
        },
        {
            "author": "spv420",
            "body": "keep a journal. helps you stay organized, let out some of your emotions, remember better, and an easy routine. keep a notebook by your bedside. every night, before you go to bed, pick up a pen, pencil, whatever the first writing utensil you see is. write down the date, and whatever you think of. does breakfast come to mind? write about breakfast. do you not know what to write? write that. i want you to brain vomit onto that page until you feel exhausted and want to sleep. then sleep.",
            "score": 2,
            "replies": []
        },
        {
            "author": "SubjectOrange",
            "body": "I go through spurts of reading or wordsearchs. I want to think I should read always, I grew up without a lot of technology so reading was my jam. But then I would just stay up all night reading...",
            "score": 2,
            "replies": []
        },
        {
            "author": "Glittering_Sorbet512",
            "body": "Light a candle and get under my heated blanket. Once I start getting drowsy. I blow out the candle and fall asleep",
            "score": 2,
            "replies": []
        },
        {
            "author": "pansie",
            "body": "Utilise my second wind (really, it's the first wind) / burst of energy and clean my house while listening to music... then wonder why I can't relax enough to sleep  \n\n\nBut real answer, if I'm being good (rare): screens away, shower/clean teeth/skincare, get in bed, give kitty treats to lure him to bed also, write in my journal, read my book, lights out. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "FlemFatale",
            "body": "Absolutely anything I can do to stop me from going to bed? My bedtime procrastination is very bad, but I'm trying to get out of the habit of it and go to bed the same time every night.  \nModes and routines on android is great and really helps when I have enough self-control to not turn it off.  \nI also read a book once I'm in bed and then put my sleepy time plasylist on to actually fall asleep.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Felein",
            "body": "My time has come!\n\nI have spent A LOT of time hyperfocusing on this, so here we go. This is my ideal routine; in practice, I don't hit every point every evening, but I do my best, and it has helped me immensely in improving my sleep.\n\n* I have two alarms on my phone, one goes 2 hours before I want to start sleeping, another one an hour later.\n* When the first alarm goes, I make myself a cup of tea. If my stomach feels empty, I take a light snack too, something with little-to-no sugar. I also dim the lights in the living room.\n* From this moment on, I am no longer allowed to do things that fire up my brain. No doomscrolling, no long Reddit-comments, no thrillers or detectives or First Person Shooters or complicated crocheting patterns. Only light-hearted, easy-to-digest series or Youtube videos or something. And I watch these on TV, not my phone. Basically, anything that gives 'cosy', 'soft', 'hygge'.\n* Usually I'll do my bullet-journal evening review while something silly is playing on tv. I'll also do my Duolingo lessons if I haven't done them yet. If I notice that my brain is still racing at this time, I take 15 minutes to do a braindump / long-form journaling / worry-journal. I basically just write down everything that's spinning around in my head, until nothing new comes up. Then I check if there's anything I can do right now to ease/fix any of the things. If so, I do them. This usually helps with anxiety/stress.\n* When my second alarm goes, it's time to go to bed. In winter I make a hot-water bottle to bring to bed. I leave my phone downstairs, put my hot-water bottle in bed, then go to the bathroom to brush my teeth, wash my face and go to the toilet. Then I go upstairs, lay out my clothes for tomorrow and get into bed.\n* I have one of those sunlight alarms next to the bed, which I can also set to mimic sunset. I aim to be in bed half an hour before I want to start sleeping, and set the clock to go dark at that time. Then I read in bed (some easy/light fiction) until the clock goes dark.\n\nUsually with this routine I can fall asleep within 15 minutes of lights-out (30 minutes if I'm not exhausted) and have a decent night's sleep. Sometimes I wake up in the middle of the night. When that happens (or when I have trouble falling asleep) I try to do some breathing exercises (4-7-8). If that doesn't help and I've been awake for over half an hour, I get up. I'll have water or tea, go to the toilet if I need to, and do some journaling or reading (by dim light, no full brightness) until I feel sleepy.\n\nSome other things: no caffeine or alcohol 3 hours before sleeptime, no naps during the day, no sleeping in too late regardless of how the night went, and my phone has a night-time mode where it automatically applies a blue-light filter after sunset.\n\nI hope this helps!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Wide_Appointment_474",
            "body": "Doom scroll till I pass out",
            "score": 4,
            "replies": []
        },
        {
            "author": "Nearby_Jellyfish4579",
            "body": "Fix my blanket about 1000 times until it sits the right way and feels the right way; try to focus on a single point and trick my body into thinking we are falling asleep by not moving at all lol \n\nIn all seriousness: i just do skin care routine and a short meditation to help my body calm down (takes about 30 mins)",
            "score": 2,
            "replies": []
        },
        {
            "author": "august401",
            "body": "i use technology",
            "score": 1,
            "replies": []
        },
        {
            "author": "tinkerballer",
            "body": "Listen to an old Game Grumps Zelda playthrough on Youtube with a sleep timer set at 45 minutes. And then when it goes off I put it back on another sleep timer set, and so on",
            "score": 1,
            "replies": []
        },
        {
            "author": "thecorkontheocean",
            "body": "First off, always late to bed no matter what. Then scrambling to do last minute stuff. Jump into bed tired and wired. Turn on the white noise machine. Then the real magic: Harry Potter audio books, all of them, on repeat, to drift me off to dream land. Forever and ever, amen.",
            "score": 1,
            "replies": []
        },
        {
            "author": "i_t_s_c_e_e_j_a_y_y_",
            "body": "I find that if I know that I’m ready for the next day: breakfast planned, lunch made for work, kitchen is tidy (not spotless, just not a messy nightmare), meds are out beside my coffee maker, outfit or choice of outfits ready, my bedroom is tidy (nothing strewn about, doom piles put away, but also not spotless & perfect) - these all help me to be ready for bed. I also walk my dogs before doing bedtime hygiene. A bit if fresh air and exercise helps calm my mind and body.  I’ve got books piled beside my bed that I intend on reading. And sometimes I do read them. Lol I also have word searches, in book form. I try really hard not to do tech before bed. But I’ve been off work for a month and I’m starting to develop some bad bedtime habits. So perhaps this post is a good reminder for me to do a bedtime reset 😊",
            "score": 1,
            "replies": []
        },
        {
            "author": "miguste",
            "body": "Reading! From 9pm onwards it's only books for me. I even go in bed with my e-reader (I need to distract my brain to fall asleep), I won't read anything that excites me too much when in bed (novels instead of self-help books).",
            "score": 1,
            "replies": []
        },
        {
            "author": "Goldenleavesinfall",
            "body": "I read a physical book. I can’t do books on my phone cuz I’ll just end up scrolling. You *should* get bored at bedtime. You don’t want to do anything too stimulating. Sometimes if I’m reading a book that’s too exciting I won’t fall asleep so I always keep something a little more boring nearby just in case.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Old-Presentation4816",
            "body": "I have a terrible time sleeping taking Concerta, even if I take it early, it's effective for 12 hrs, then it's another 5-6 to get out of my system, that sets me up for disaster the next day , any ideas?",
            "score": 1,
            "replies": []
        },
        {
            "author": "QuirkyQuokka6789",
            "body": "Watch the good ol' telly",
            "score": 1,
            "replies": []
        },
        {
            "author": "KatTheKonqueror",
            "body": "* Puzzle Books\n* Coloring Books\n* Reading\n* Journaling\n* Any hobby you can do with your hands could work, such as knitting.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Business_Werewolf_92",
            "body": "I play guitar, write songs. Often, I do the dishes at that time. I often struggle to put my phone down for the last time. I always read at least a little bit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Eranon1",
            "body": "I have games I play when I take my sleeping meds that I can just shutdown and dip.   Guild wars 2. Roguelikes. Sifu.  Hitman.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Funny_Tutor3018",
            "body": "Play video games until I pass out and wake up 3 times. Then I say \" welp, better go to bed\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "citizencamembert",
            "body": "I play video games, watch a film or trawl through YouTube videos. I have insomnia so I can’t sleep whatever I do before bed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Slight_Heron_5639",
            "body": "Read. Also journaling is very good for your mental health. Especially reflecting your day and listing what you’re grateful for. Sounds hokey but as someone in recovery from drugs, alcohol and severe depression/ suicidal, journaling has saved my life and would benefit everyone/ anyone.",
            "score": 1,
            "replies": []
        },
        {
            "author": "thebegoniaman",
            "body": "I’ve started doing my nighttime routine in candle light, I call it analogue hours. If I do feel that itch for my phone I try not to watch or play anything, and just stick to podcasts and audiobooks instead. \n\nI’ve found that being in candle light while I wash my face, brush my teeth and put on pajamas actually connects me to how tired I am and that pre-bed boredom kinda becomes peaceful sleepiness! \n\nADHD is a cruel mistress, without my analogue hours I don’t “feel” tired until 4 am and until then it’s just this gnawing restlessness. \nGood luck soldier, hope you get some sleep.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tight_Cat_80",
            "body": "I recently switched from reading the kindle app on an iPad, to reading on a kindle. Noticed I’m not randomly waking up in the middle of the night like I used to. Reading is how I get calm before bed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "turnup4flowerz",
            "body": "Wait to go to bed",
            "score": 1,
            "replies": []
        },
        {
            "author": "oldbluesneakers",
            "body": "I put on white noise with the Calm app. \nI read a book on my Kindle. It doesn’t have the blue light, but it is lit so I don’t need an actual lamp on.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ishouldbeasleepnow",
            "body": "Audiobook and soduku",
            "score": 1,
            "replies": []
        },
        {
            "author": "ninepasencore",
            "body": "suffer",
            "score": 1,
            "replies": [
                {
                    "author": "ninepasencore",
                    "body": "but in terms of what i try to do: read books, watch movies, listen to the shipping forecast to relax",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "shouldstoplurking",
            "body": "Manga. Anime.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Schlitz-Drinker",
            "body": "I mean it's ok to be bored for a lil bit. I hate falling asleep because it takes forever for me and it's boring. I found the best thing to do is to try and accept the boredom. I've been trying to get better at dealing with boredom, though sometimes I will listen to music or maybe a relaxing podcast. [Drifting Off with Joe Pera](https://www.patreon.com/DriftingOffwithJoePera) is a good one for that. But it does take longer to fall asleep so again, for me the best thing to do if I want to fall asleep in a timely manner, is just be bored.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Deedee5901",
            "body": "I leave my comfort show in the background on a timer so I fall asleep to it",
            "score": 1,
            "replies": []
        },
        {
            "author": "the_natis",
            "body": "Used to have anxiety and freak out. Now I take an edible, some Beam Sleep and listen to headphones for about 2 hours with a face mask on and I’ve been getting solid sleep. I have a dedicated music player so I’m not using my phone.",
            "score": 1,
            "replies": []
        },
        {
            "author": "xoxo_juniper",
            "body": "comfort show on exactly the right volume + phone scroll until I’m sleepy or mentally ready for go to bed\n\nI only experience true “sleepiness” when I need naps, I’ve never been someone who just gets sleepy around bedtime, probably some ADHD circadian rhythm thing",
            "score": 1,
            "replies": []
        },
        {
            "author": "Baddicka",
            "body": "Check my list for the day to make sure anything critical is complete so I don’t wake up at 3 a.m. realizing that I missed something.\n\nStand in my bathroom for a while because it’s the warmest room in the house and winters in my area are terrible.",
            "score": 1,
            "replies": []
        },
        {
            "author": "chattycatty416",
            "body": "\nWrite your to-do list down for tomorrow.  Just write out all the things so your brain doesn't churn on and on about them.  And then some box breathing to fall asleep.                                                                              Honestly can't say if this works because I haven't actually tried this. But it sounds great.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Imagination_6216",
            "body": "this is so real lmao",
            "score": 1,
            "replies": []
        },
        {
            "author": "Agitated_Ad_1093",
            "body": "Could listen to audible books, or podcasts (telepathy tapes is intriguing)",
            "score": 1,
            "replies": []
        },
        {
            "author": "xikbdexhi6",
            "body": "I find that getting completely bored is essential for falling asleep.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Locaisha",
            "body": "I started reading on my Kindle so that I could fall asleep because the screen isn't as bright as a phone. But I know a lot of people with ADHD have a hard time reading. I have also done my nightly routine like showering picking up my room a little bit, setting my clothes out for the next day. Or getting my night time chores done like dishes cleaning the litter box. \n\nI'm also usually not successful LOL. But the Kindle reading has been helping quite a bit, although sometimes it keeps my mind a bit too active for before bedtime",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lisnya",
            "body": "I keep saying I'm going to start reading before bed, even if it's on my tablet but I'm too exhausted to do anything other than doom scrolling, tbh.",
            "score": 1,
            "replies": []
        },
        {
            "author": "somethingwitty94",
            "body": "I watch a show that I like but have seen before. It gives me something to focus on but that I don’t have to pay attention to.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jegoan",
            "body": "I find that there's a difference for me between using the smartphone in bed and using the tablet. On the tablet I read more and engage in less visually stimulating things. So with a tablet I get sleepy sooner, then I put on a podcast on timer, and sleep.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Polar-squirrel",
            "body": "Video games and drinking a code red.  Usually pretty calm afterwards and sleep well.  No code red can’t sleep",
            "score": 1,
            "replies": []
        },
        {
            "author": "WoodsWalker43",
            "body": "I lay down on the couch, turn off the lights, and put something on tv. Ideally something I've seen before so I can just close my eyes and listen. Mixed results. I still only get like 6 hours/night on a good night. Closer to 4-5 for the last couple weeks. \n\nI also cut out caffeine 4-5 years ago. At first it was just no caffeine after noon, but I just cut it out entirely eventually. Never looked back.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TH1813254617",
            "body": "I fall asleep on the sofa, wake up, then fail to sleep for 3 hours.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Main_Regret_9097",
            "body": "I like watching asmr videos",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fabulous-Web7719",
            "body": "Stress out and procrastinate mainly. You?",
            "score": 1,
            "replies": []
        },
        {
            "author": "pizzapanda89",
            "body": "I take a shower. Do these exercise/stretches to help my brain and body relax. Read a physical book. I also have an alarm clock so I don't look at my phone.",
            "score": 1,
            "replies": []
        },
        {
            "author": "0wlBear916",
            "body": "I use technology lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "trav161",
            "body": "Try to occupy my mind with things that get me away from my phone. Playing the keyboard, working around plants ect. The phone can lead to bad habits, distraction and overthinking",
            "score": 1,
            "replies": []
        },
        {
            "author": "tired-gremlin06",
            "body": "Yeah screens are kind of part of my nightly routine lol. Writing, watching movies, playing a game, late night work project. Sometimes I'll read but I've preferred audiobooks lately.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dawn9800",
            "body": "I watch the simpsons lol.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CanBrushMyHair",
            "body": "After my night routine, I tidy up and shut down the house.",
            "score": 1,
            "replies": []
        },
        {
            "author": "thestrawbarian",
            "body": "I read on my kindle until I literally can’t keep my eyes open anymore and fall asleep midway through a chapter",
            "score": 1,
            "replies": []
        },
        {
            "author": "katie4799",
            "body": "YouTube, queue up some videos that are 2-6 hours. It always takes me an hour to get to sleep minimum. Use a sleep timer. I like to watch Alveus Sanctuary, Pirate Software, Secret Sleepover Society, Real Wild. I wake up sometimes during the night so I'll wake up, tune in for a bit then go back to sleep.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Visual_Society5200",
            "body": "Ideally I would listen to music because I find it calming. But I usually just watch tv or scroll through my phone.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PMcOuntry",
            "body": "Play games. Watch TV. Doomscrolling. If I'm being good I craft.",
            "score": 1,
            "replies": []
        },
        {
            "author": "myiahjay",
            "body": "take a gummy cause that’s the only way my brain is going to shut up 🤣",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mundane_Diamond3230",
            "body": "I just tried posting my solution and it was auto removed by a bot but people post about porn 😂. \n\nI posted about trees, if you catch my drift. If you want more information, you can PM me OP. 🌿",
            "score": 1,
            "replies": []
        },
        {
            "author": "InconvenientBoners",
            "body": "Get distracted and stay up entirely too late",
            "score": 1,
            "replies": []
        },
        {
            "author": "SillyRomanZombie",
            "body": "I like to fall asleep to a good documentary",
            "score": 1,
            "replies": []
        },
        {
            "author": "RxMeta",
            "body": "Podcast on. Phone down across the room. Lay down.",
            "score": 1,
            "replies": []
        },
        {
            "author": "criticalnom",
            "body": "Sudoku!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Throwaway_Big_D",
            "body": "My medication (Concerta) helps me sleep, so about 10pm I make a chamomile tea and by 10:30pm I’m sound asleep.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SantiDaPug",
            "body": "My kindle is the best sleep aid. Just be sure to re read books you’ve read or some based in movies you’ve already watched so it is not too engaging. Some nights I read for hours but most days I can nearly manage a couple of minutes. Also use it in dark mode and lowest light level you can comfortably do.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Grab_Proper",
            "body": "Ik it’s still blue light but I watch fun educational videos on YouTube that are about topics I enjoy. The educational aspect of it helps to wind my brain down, but my actually being interested in the topic helps to keep my brain from wandering.",
            "score": 1,
            "replies": []
        },
        {
            "author": "L_Rambo",
            "body": "Diamond painting! Or reading",
            "score": 1,
            "replies": []
        },
        {
            "author": "MentallyDivergent123",
            "body": "I play an anagram word game while wearing amber colored blue light blocking glasses.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MatheAPro",
            "body": "Just play with my dong ![img](emote|t5_2qnwb|35055)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Old-Presentation4816",
            "body": "Don't know if this is appropriate post for this thread but, I been wondering why I been feeling so weird all week, but I have ADHD and bipolar, and I can't take caffeine, and I erroneously ordered a case of Celcius which I have been drinking all week , da!?",
            "score": 1,
            "replies": []
        },
        {
            "author": "XxNaRuToBlAzEiTxX",
            "body": "“Research”",
            "score": 1,
            "replies": []
        },
        {
            "author": "Original_Giraffe8039",
            "body": "Phone for maybe ten-twenty mins then some ASMR while I'm dozing off. My antidepressant takes care of any issues falling asleep.",
            "score": 1,
            "replies": []
        },
        {
            "author": "thatoneblunt",
            "body": "I honestly don’t pay heed to what doctors/scientists say regarding technology before bed. For me, my phone, laptop and TV actually make me sleepier at a point.",
            "score": 1,
            "replies": []
        },
        {
            "author": "moniqferreira",
            "body": "I read",
            "score": 1,
            "replies": []
        },
        {
            "author": "JustoneInuk",
            "body": "I use the Headspace app and do a quick deep breathing exercise (really helps calm the inevitable anxiety), and put on one of their daily meditations and it almost always helps me fall asleep. I can’t sleep without it, or if I try, I sleep miserably.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PineappleBanjo",
            "body": "I’ve started doing stretching routines before bed and recently added using a Theragun to relax my muscles. In all it takes up 15-30 minutes. Still working on getting the routine to classically condition my body to know it’s time for sleeping soon.",
            "score": 1,
            "replies": []
        },
        {
            "author": "kaceefacee",
            "body": "I listen to ASMR",
            "score": 1,
            "replies": []
        },
        {
            "author": "saalego",
            "body": "If I have the time and I really can’t put off showering any longer, I’ll take a warm shower right before I go to bed with the lights off. That pretty much knocks me out - I have to get ready for bed before that because after I can barely keep my eyes open.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheBigCheese400",
            "body": "I should probably do this myself but you can watch boring yet informative documentaries. You'll be so tired that you'll forget everything and then you can watch it again the next day.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Other-Squirrel-8705",
            "body": "Listen to meditations or sleep hypnosis",
            "score": 1,
            "replies": []
        },
        {
            "author": "crabby_playing",
            "body": "Read, paint.",
            "score": 1,
            "replies": []
        },
        {
            "author": "princesssdemon666",
            "body": "I listen to a podcast for multiple reasons:\n- It’s entertaining so i dont get bored.\n- It’s a way to still ‘do’ something while also not going to sleep too late.\n- You can just lay down and chill with ur eyes closed as you listen.\n- Eventually it make you sleepy so you fall asleep with no trouble :)! \n\nI used to have a hard time falling asleep bc of my thoughts or bc i wasnt tired at all. And doomscrolling on my phone would just keep me up super late. But this way i can lie down at a normal time and easily fall asleep in an entertaining way!",
            "score": 1,
            "replies": []
        },
        {
            "author": "CruSea2",
            "body": "Watch weird history and nature videos to fall asleep so I don’t think about life",
            "score": 1,
            "replies": []
        },
        {
            "author": "fhockey4life",
            "body": "Daydream about what my life would be like if xyz happened, think about who would be the best speakers at my funeral, overthink about what I need to do the next day, write entire research articles in my head, and occasionally sing/act the entire Hamilton musical in my brain",
            "score": 1,
            "replies": []
        },
        {
            "author": "Vegetable-Garden4745",
            "body": "I read or play cross words or word searches. You can buy books with them at Walmart for $1 a book.",
            "score": 1,
            "replies": []
        },
        {
            "author": "llamarightsactivist",
            "body": "I've gotten back into reading a book or sketching/drawing what I feel that day or that moment.",
            "score": 1,
            "replies": []
        },
        {
            "author": "klr24",
            "body": "Any or all of the below: \n- spiral. \n- journal. \n- watch king of the hill. \n- scroll.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WednesdayAddams1975",
            "body": "I read when I can stand it (lol which is odd because I love reading, and when I force myself to do it, I really enjoy it and tend to stay awake longer if I do it but thats neither here or there). Mostly I listen to a podcast and color on my phone using a coloring app. Also watch ASMR if I am really struggling to wind down.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mimi23833",
            "body": "My phone is always on dark mode and before bed I put on a blue light filter also.. But I play a game called Cody cross that for some reason always puts me to sleep.. It is one of my favorite games I've been playing it for years but I always play before bed and it helps me fall asleep usually pretty quickly.. Even if I play during the day no matter how awake I am it has the same effect I think my brain just associates it with sleep now because I've been in the right before bed habit for at least 5 years with it..",
            "score": 1,
            "replies": []
        },
        {
            "author": "dearisla_1001",
            "body": "I sketch a few faces and then sleep. If you're not an art person, you can listen to some music that soothes you and makes you sleepy. Or, you can play sudoku or crossword puzzles or hidden pictures. But most of the time I doom scroll lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Butters77771",
            "body": "I smoke a large bowl of indica and then chill out watching tv till I fall asleep",
            "score": 1,
            "replies": []
        },
        {
            "author": "RavenousMoon23",
            "body": "I make a cup of tea and watch something then I read, reading makes me sleepy and normally takes me about an hour of reading till I can fall asleep. If I don't read I will just toss and turn for hours.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cate_The_Bean",
            "body": "I shuffle my playlist and put it very quietly through headphones. That or find something to read while I listen to something.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Butwhatshereismine",
            "body": "Take my night time meds and make sure they go down with a butt tonne of water. Floss. Brush teeth. Pee. Go to bed. Bum around on the internet. Pee again. Go to sleep.",
            "score": 1,
            "replies": []
        },
        {
            "author": "og_jynt",
            "body": "yeah i use my phone up until i fall asleep every night. every other option is boring and unsatisfying.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Brii1993333",
            "body": "Audio book !!! Hearing someone else ramble on and on keeps my mind quiet because I have for focus and listen to someone else. \n\nIts also fast paced enough that I’m not bored, and eventually become invested in the story line.\n\n(Find a fiction / novel! Do not do non fiction. I don’t ever read fiction but for this sleep purpose it’s 1000000/10)\n\nWooo enjoy a small win! \n(I love knowing I’ve dozed off and missed some story, feels like a trophy. 🏆 then just rewind to what you last heard night before).",
            "score": 1,
            "replies": []
        },
        {
            "author": "SKGurl101",
            "body": "Read a book",
            "score": 1,
            "replies": []
        },
        {
            "author": "Concentric_Mid",
            "body": "Read.\nOk I'm lying. I tell myself I should be reading but I'm instead checking out Reddit and responding to posts like these",
            "score": 1,
            "replies": []
        },
        {
            "author": "Express_Nebula_6128",
            "body": "Apparently it’s not the light from the screens that keeps us awake, but the degree of how interesting and engaging the activity is. Have anyone else heard that?\n\nI don’t have receipts on that, heard it on Sleep Cycle app. I will research that later, but probably will forget to comeback here to edit 🤣",
            "score": 1,
            "replies": []
        },
        {
            "author": "lukajam",
            "body": "Read ebooks on my phone; fiction and nonfiction. The blue light keeps me awake so I’d like to switch to paper, but haven’t followed through yet.",
            "score": 1,
            "replies": []
        },
        {
            "author": "olliegarcki",
            "body": "I try to make up stories that require my brain to only focus on that. Otherwise, i’ll put on a show that I can listen to without having to see it to know what’s going on.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jessegirl602",
            "body": "ASMR",
            "score": 1,
            "replies": []
        },
        {
            "author": "hdroadking",
            "body": "Of course I’m lying in bed scrolling Reddit, so this answer is completely hypocritical. 😂\n\nBut, Kindle PaperWhite with a good book is a great way to decompress that doesn’t send me down rabbit holes. \n\nUnless of course it’s a history novel and then I start Google facts about some random detail about Abraham Lincoln. \n\nStick with a good fiction book. I’m read The Road by Cormick McCarthy at the moment. Pretty intense and does a good job sucking me in so the distractions aren’t as tempting. \n\nBut of course I found that book recommended in some random Reddit thread when I was doomscrolling last week. \n\nIt’s a vicious cycle! 🤦🏻‍♂️",
            "score": 1,
            "replies": []
        },
        {
            "author": "NoSun694",
            "body": "Watch a TV show with Amber lens blue light blocking glasses. The sleep doc I consulted with after getting diagnosed recommended them and it’s a game changer.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GingerSchnapps3",
            "body": "Read",
            "score": 1,
            "replies": []
        },
        {
            "author": "davisriordan",
            "body": "I've honestly found it's not an issue compared to other factors, although with caveats like, no screens in bed or bedroom, consistent daily bedtime, and daily exercise.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dapht",
            "body": "I was having a hard time going to sleep. Watching TV or doomscrolling until way too late. Recently, I switched to playing podcasts on a speaker in my bedroom and it's been able to keep my brain engaged without the light from a screen keeping me up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alchia79",
            "body": "Doomscrolling until the early morning hours and then being pissed off at myself because now I get to have three or four hours of sleep instead of 6-8.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gifsfromgod",
            "body": "I need a solid 4-5 hours of quiet scrolling, reading via the phone, watching a TV show on YouTube\n\n\nEssentially, decompressing from the day",
            "score": 1,
            "replies": []
        },
        {
            "author": "AdMindless6275",
            "body": "I usually read manhwa or watch TikTok and Netflix before I go to bed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Main_Preparation_281",
            "body": "Read Reddit or lay there trying to make up a story in my head.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WhiskersAndWHYskers",
            "body": "Word searches & a specific type of youtube show or documentary. Most nights it works , eventually. Other nights nothing does.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BurntRussian",
            "body": "I've been wearing blue light filtering lenses on my glasses for 5 years or so now. That changed my sleep. I also only use the bedroom for bedtime activities, so my brain basically says \"bedroom = sleep\".\n\nWhen I lay down I'm out within a minute. I also have a consistent bedtime that works for me. I never would have thought I'd go to bed at 9pm, but waking up at 4am gives me so much time before work to get stuff done.",
            "score": 1,
            "replies": []
        },
        {
            "author": "raggedyassadhd",
            "body": "This",
            "score": 1,
            "replies": []
        },
        {
            "author": "DevKim",
            "body": "Scroll the entire Internet while watching some series until I fall asleep around 6/8am. If I really want to sleep, I put music on 30min timer",
            "score": 1,
            "replies": []
        },
        {
            "author": "SirStocksAlott",
            "body": "Isn’t boring the point? If it not boring it’s going to keep your attention and will be hard to wind down to fall asleep.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ShiverMeTimbers_png",
            "body": "Watch albert camus videos because current hyperfixation 😋",
            "score": 1,
            "replies": []
        },
        {
            "author": "dieorlivetrying",
            "body": "Fret",
            "score": 1,
            "replies": []
        },
        {
            "author": "aisling-s",
            "body": "I keep a book by my bed that I read before I sleep. I also take 1mg melatonin and my anxiety med about an hour before bed, so that's kicking in while I'm reading.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Flimsy-Imagination44",
            "body": "I can't sleep without something else stimulating my brain so I always put on a show on Netflix (it used to be Friends before Netflix took it off) so when I close my eyes, my brain will just focus there and I can actually focus on falling asleep. The only way I can sleep right away after going to bed is if my brain is tired. But if it's just my physical body that is tired (which is the case more than 50% of the time), my brain needs to be distracted / stimulated in a structured manner (hence, a show) lolol. Otherwise, if it's too quiet, I'd be lying awake for hours on end thinking about so many things and questioning everything there is to question and wonder about everything I can wonder about haha. It's just so active especially when I have nothing else to do but just \"lie in bed to sleep\".\n\nSo TV in my bedroom is a MUST for me. Good luck to my future partner haha. Or I can prolly use earphones/headphones then since some latest TVs allow that already.\n\nMusic does not cut it because my brain goes to analyzing mode (like I focus on instruments, etc).\n\nPS. The show must be something I have already seen a thousand times OR something that's really brain stimulating / hard to follow plotwise if it's something I haven't seen yet. If it's too feel good, that would catch my full attention haha.\n\nPPS. My brain is like a separate human entity from me haha",
            "score": 1,
            "replies": []
        },
        {
            "author": "pixiesunbelle",
            "body": "I read for fun on my kindle or a physical book",
            "score": 1,
            "replies": []
        },
        {
            "author": "ComplexLost9395",
            "body": "Play on the switch then try and sleep but end up just remembering some embarrassing moment that happened ten years ago.. fun fun fun👍🏻",
            "score": 1,
            "replies": []
        },
        {
            "author": "The_Doors0210",
            "body": "Wondering why it only took 30 seconds for my wife to fall asleep. I've been reading on kindle, it's easy to fall asleep to when you brain is tired.",
            "score": 1,
            "replies": []
        },
        {
            "author": "musiciansfriend11",
            "body": "Imagine having money lol. Right now I’m learning about the first BTC rewards credit card dropping",
            "score": 1,
            "replies": []
        },
        {
            "author": "shawtystrawberry",
            "body": "I journal for a bit and just reflect on the day I had. maybe  do a crossword puzzle for a bit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Aniriteron",
            "body": "Do something that fulfills you. Draw something maybe or do a hobby and when you feel satisfied it's easier to sleep",
            "score": 1,
            "replies": []
        },
        {
            "author": "Less_Campaign_6956",
            "body": "I need medicinal assistance to get sleepy. Melatonin, hydroxyzine an  antihistamine are  two non scheduled meds I use sometimes.\n\nI am rarely sleepy. Since adolscence. .my primary doc started me in Xanax in my late teens.l bc I had my first full-time day job and could NOT wake up rested to start my day before 7am. It was brutal. \n\n Been on and off Benzos into adulthood. I cannot wind down my busy mind. Every boyfriend I've ever been in a relationship with falls deeply asleep in like 30 seconds. Im typically next to them switching channels or googling whatever I need info about for HOURS.\n\n Thankfully now I don't need a job so I sleep whenever I want to. But still need a sleep aid med to start the process going. \n\nIf I go outside daytime and do some exercise, especially if it's cold outside, yeah that makes me sleepy naturally. But I'm slender and don't prioritize working out much. I hate going to the gym. My friends go and encourage me to, but I flat out refuse bc I'll got one week then quit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Comfortable_Gold7210",
            "body": "what i like to do an hour before i go to bed is preparing for the next day to make it easier for myself in the morning. so setting out my clothes, accessories, makeup, etc, even a bowl for cereal, and also putting my meds and water bottle right next to my bed. to me, it's healthy, setting me up for success, and doesn't involve a screen! so i'd recommend it",
            "score": 1,
            "replies": []
        },
        {
            "author": "DemonScourge1003",
            "body": "Aimlessly scroll on my phone, sometimes rub one out, watch the jelly in my lava lamp, occasionally I’ll watch something that calms me down. Weird as it may sound, race car engines have a calming effect on me",
            "score": 1,
            "replies": []
        },
        {
            "author": "greenhairedhistorian",
            "body": "I've started (at least some nights) charging my phone outside of my bedroom, BUT I have Bluetooth earbuds that will still connect to my phone from my bed without it being in there, so I will queue up either ASMR videos or meditation or something like that to listen to and help wind down for bed. Sometimes I do cheat and actually watch videos/TV shows in bed as well but I try not to do it too much.\nI figure having the audio only version is a good compromise to not using screens right before bed, especially for ASMR videos I've watched many times and remember the visuals of, they tend to make me sleepy out pretty easily",
            "score": 1,
            "replies": []
        },
        {
            "author": "CogzThaBeast420",
            "body": "Having amazing sex with my partner and snuggles is honestly the best relaxation. Also my night time meds. The two are a good combo 🤣🤟",
            "score": 1,
            "replies": []
        },
        {
            "author": "jaydenszekely",
            "body": "Red Lights Only (RGB bulbs) - changed to having these from non-rgb lighting about a month ago, and I don’t know if it’s a placebo, but I swear it makes me sooo calm!\nIf you have an Apple TV reduce white point and Turn on Light Sensitivity. I just got some blue light glasses today, so will see how that goes. But I’ve found today since wearing them, my brain seems less stimulated from all the screens.\nHot Beverage (ie Ginger Tea)\nIf you have a candle or a diffuser, that’s great too!\n\nI also find I sleep better with faux-silk pillow cases? Might just be me though. \n\nMelatonin also helps me a tonne if I feel a bit busy even while I’m winding down. My doctor prescribes me these (but if you’re in the states, I’m not sure how much these would be!)\n\nSometimes I find if my brain is super active when I go to bed, playing city noises on a speaker or headphones are great. But any Brown Noise is great if that’s not your thing.\n\n\nLots read before bed, but I tend to read non-fiction only so that makes my brain more active and curious.  If I’m watching TV, I make sure it’s a more downbeat show like the Crown, House of Cards, Mad Men, etc. \n\nHope that helps!",
            "score": 1,
            "replies": []
        },
        {
            "author": "armoured_lemon",
            "body": "deppresive spiral into rock bottom",
            "score": 1,
            "replies": []
        },
        {
            "author": "Soggybot",
            "body": "Read! It's insanely boring and took so long to train myself to stop going on my phone, but reading is perfect because it's so boring I fall asleep quickly usually. Even if I don't sleep, it still feels better and reduces anxiety",
            "score": 1,
            "replies": []
        },
        {
            "author": "yawolloh7",
            "body": "Cry",
            "score": 1,
            "replies": []
        },
        {
            "author": "Background-Risk8352",
            "body": "I usually knit, do sudokus or read a book",
            "score": 1,
            "replies": []
        },
        {
            "author": "kv4268",
            "body": "I read a book. It keeps my brain from finding something to be anxious about while I wait for my meds to kick in.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CatInABurlapBag",
            "body": "Meditate. Read. Write.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CalligrapherFun3511",
            "body": "The office one episode then tv off, count to 1000 then if not asleep then try the 30 word challenge, figure out a word for each letter of one word then the last letter of the word is the first letter of the next word then if not asleep then just leave tv on quietly in back ground",
            "score": 1,
            "replies": []
        },
        {
            "author": "GoldieDoggy",
            "body": "I either need complete silence & darkness, or something on the tv/my phone to listen to if I want sleep. Usually, I put on a YouTube channel (idk why, but currently? Horror game gameplays seem to be perfect. Specific ones, though. Minimal screaming or anything, and dark. It means I don't always have to lower the brightness, and the gamer is usually on the quieter side. [this](https://youtu.be/dz-amDytos0?si=q7E5KtOauOXYoGcg) was the last one I fell asleep to (watched some of it, looks like an interesting game! Not one I'd play, personally, but interesting. Basically, another take on the backrooms games. Very liminal. That dude talks, but rarely ever yells or anything, which is perfect)). After I get a video up, I lower the brightness on my TV (I have it preset, currently. Movie mode is my everyday, and dynamic (which is right above it) is set to the darkest settings possible), get completely under my blanket, and read a little bit of a fanfic (I do read physical books, too, just kinda hard to do that under my blanket without ruining the book, lol) until I feel tired. Usually, that only takes a chapter or two, unless it's a REALLY good one. Then I feel tired AND energized. My phone is turned off, I block out as much light as possible, and sleep.",
            "score": 1,
            "replies": []
        },
        {
            "author": "andiloveandlemonade",
            "body": "Write a to do list, shopping list and check diary for appts to be ready for.. then meditate doing a body scan technique and voila \nHope this helps 🙏💚✨",
            "score": 1,
            "replies": []
        },
        {
            "author": "WhiteMenEnergy",
            "body": "Come up with imaginary scenarios where I wish I would’ve said cool shit instead of what I actually said. (Ppl scare me)",
            "score": 1,
            "replies": []
        },
        {
            "author": "hikingma13",
            "body": "I read a book on my Kindle paper-white on dark mode. It's not reflective at all and I usually fall asleep in 30 mins or often much less. Good luck! I had to commit to not look at my phone after I brushed my teeth. Took a while to get used to but now it's not a temptation. Good luck! You'll figure out what works for you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mentallyillraccoon1",
            "body": "Use technology but instead of scrolling i have an e-book on my phone lol so i guess i read before bed? Haha",
            "score": 1,
            "replies": []
        },
        {
            "author": "velocitious-applepie",
            "body": "I read. It’s great. The hard part is getting away from hyper focusing on tech for the hour before bed when my bf will permit the light on in bed. Otherwise if I wait til he’s ready for bed than I have to put the phone on charge and read in the office then go to bed",
            "score": 1,
            "replies": []
        },
        {
            "author": "godzillabobber",
            "body": "Read physical books. If you are having difficulty, read books that are collections of factoids like Guiness Records. Or read novels from favorite TV shows where you know the characters",
            "score": 1,
            "replies": []
        },
        {
            "author": "Smoke_Water",
            "body": "Get a pet, spend that hour with them. Not only is it relaxing for you, but it calms the mind.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Intrepid_Zucchini858",
            "body": "Sleepy bookshelf podcast when I’m on top of my shit. Other times… nytimes games, doom scrolling, *insert 1pm snack*, sudoku, Reddit, repeat.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Princess-Platypus584",
            "body": "Audible or usually read with a candle and cozy vibes",
            "score": 1,
            "replies": []
        },
        {
            "author": "Admirable-Angle-3633",
            "body": "Shower, brush my teeth, and imagine what it would be like if I drove off a bridge into the water with my family inside, as the car sinks panic starts to set in as we unbuckle but one of them is stuck, if we wait any more we will die but he will too so we make the choice to abandon him, as we brake the window his sobbing fills my ears, imagining that I'm the one stuck and them abandoning me the feeling of death just around the corner. Then I prepare my bed and doom scroll until I sleep. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "NoxiousAlchemy",
            "body": "I go against that advice and read fanfiction on my phone in bed 😂 Blue light protection on, the brightness switched to the lowest possible. It actually helps me fall asleep, who would have thought. 🤷‍♀️",
            "score": 1,
            "replies": []
        },
        {
            "author": "On_Too_Much_Adderall",
            "body": "Drink wine",
            "score": 1,
            "replies": []
        },
        {
            "author": "turquoisestar",
            "body": "Podcast - the fireside. It's Irish mythology and folklore. Then white noise. This has * really really helped my insomnia. And speaking of that, 🌛 gnight!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Odd-Leader9777",
            "body": "Put phone in kitchen, out on audiobook podcast or music on ear buds and go to bed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "aph-maple-leaf",
            "body": "Reading fanfiction. I usually read just one chapter or a one-shot and then I'm sleepy enough to fall asleep. (Let's pretend I don't go to bed at midnight and am tired regardless)",
            "score": 1,
            "replies": []
        },
        {
            "author": "gregorydarcy8",
            "body": "Reading thru emails I sent that day & wondering how good I sounded",
            "score": 1,
            "replies": []
        },
        {
            "author": "_9x9",
            "body": "Bed?",
            "score": 1,
            "replies": []
        },
        {
            "author": "iffyabouteverything",
            "body": "For the last two weeks, I have been consistently trying to read before bed to get back into the habit of reading. I used to read before bed as a child until college, so it’s also helping me set the habit because it’s a designated time. I am also reading physical books to cut down tech/app distractions. Also, picking books that’s fun for me- so FICTION!\n\nBut every 10 mins, I doom scroll for 10 and then feel guilty and go back to read for 10 more mins. 🙈",
            "score": 1,
            "replies": []
        },
        {
            "author": "LolEase86",
            "body": "I have a bedtime routine where I shower by candle light to wind down for bed. Depending on the time of the month this could involve some relaxing  mindfulness orrrrrr uncontrollable negative thoughts, ruminating on the thing my partner did to wrong me..  Needless to say one is decidedly more effective than the other for actually getting to sleep.\n\nA $2 sudoku or crossword book is pretty good too",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sea-Witch-77",
            "body": "Play relaxing music while reading, then listen to the music to fall asleep.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mike_oxlong7741",
            "body": "read wattpad",
            "score": 1,
            "replies": []
        },
        {
            "author": "patternpatternp",
            "body": "I usually read a chapter of a book, sometimes breathing exercises and always a cuddle with my gf to relax\n\nedit to say that if you don't have another person to cuddle with, a weighted blanket also works wonders",
            "score": 1,
            "replies": []
        },
        {
            "author": "maximumplague",
            "body": "Oscillating fan and audio books. And I cannot stress this enough, shower early and go to bed as soon as you get sleep signals. If you flop onto bed instead of on the couch at the end of the day, your brain starts connecting bed = sleep good, feel better. You can scroll in bed, just make it part of your routine. Set a timer and then when it beeps tell yourself \"I can stop now. The internet will still be here in the morning\". Save your page or take a screenshot shot if you really want to pick up where you left off.",
            "score": 1,
            "replies": []
        },
        {
            "author": "noneuclidiansquid",
            "body": "If I don't have some sort of familiar noise on I get anxiety and don't sleep. Old tv shows, audio books and the like. I also like to play gentle video games like stardew valley or pokemon  - I get bored and fall asleep.",
            "score": 1,
            "replies": []
        },
        {
            "author": "abbynormal64",
            "body": "1. Find hyperfixation \n2. Purchase book about hyperfixation topic\n3. Take melatonin \n4. Read hyperfixation book until melatonin kicks in",
            "score": 1,
            "replies": []
        },
        {
            "author": "mynameisdiscodisco",
            "body": "I usually run around looking for my fucking glasses case",
            "score": 1,
            "replies": []
        },
        {
            "author": "DILIGAF-RealPerson",
            "body": "I actually scroll mindlessly through Reddit and FB groups I belong to. It allows me to hyper focus on nothing important and actually tires me out. The moment my hand starts to drop the phone because I’m falling asleep, phone is off put down and I’m out like a light.",
            "score": 1,
            "replies": []
        },
        {
            "author": "saccerzd",
            "body": "Charge my phone downstairs, use timers and night mode, never take it into the bedroom, read a book in bed. Made a big difference.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bl0ss0ms",
            "body": "I usually choose a movie to watch on my phone that I like, but that I’ve seen previously. It relaxes me and I can listen to it as I doze off. It’s not something I get too interested in bc I know the ending and I won’t make myself stay awake to watch to the end, which defeats the purpose.",
            "score": 1,
            "replies": []
        },
        {
            "author": "kilmister80",
            "body": "Scrolling Reddit till I can’t sleep.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BlueWolf4316",
            "body": "I don’t know about you guys but reading before bed is even worse for me sometimes because I can be so absorbed in the lecture I can’t fall asleep until I grab my phone. It’s funny but it works. I try to not heavily rely on it of course but it’s hard not to.. I just can’t help it if I see it actually helps me to sleep.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bandashee",
            "body": "I do get on my phone but I will play boring/relaxing games. Nothing that requires much brain power but absolutely nothing with energy in it. No shooter games, logic games, etc. The more brain power, the more awake. I will go for things like monograms/pixel puzzles or basic card games like solitaire, free cell, spider solitaire, etc. I'm still physically doing something, but I'm making my brain bored enough to shut off and save itself from boredom.",
            "score": 1,
            "replies": []
        },
        {
            "author": "phenomenomnom",
            "body": "I fall asleep in my chair",
            "score": 1,
            "replies": []
        },
        {
            "author": "continueclimbing",
            "body": "i started reading but i don’t think i should do that either because i end up finishing the whole book and get too excited to sleep..",
            "score": 1,
            "replies": []
        },
        {
            "author": "DementedDemention",
            "body": "2000mg taurine an hour before I go to bed. I sleep like a rock. 1000mg of magnesium glycinate stops the nightly ruminating that caused 40 years of chronic insomnia.",
            "score": 1,
            "replies": []
        },
        {
            "author": "lovetoknit99",
            "body": "I do easy crossword puzzles. Not on my phone. I buy books. There is something soothing about using a pen to fill in the puzzles. But they have to be easy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Brave-Conclusion-281",
            "body": "Rub one out ?",
            "score": 1,
            "replies": []
        },
        {
            "author": "izziedays",
            "body": "I dragged out my old kindle and repurchased all my favorite books. Easy and addictive like scrolling but the e-ink doesn’t keep me awake or give me headaches at night.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Laylayaz",
            "body": "Everything i procrastinated doing the hours before",
            "score": 1,
            "replies": []
        },
        {
            "author": "xalygatorx",
            "body": "I *should* do a little bit of yoga and read for an hour.\n\nBut...I don't. Instead, I throw on an old YT series I like (nothing new because I'll pay too much attention to that) and mess around on my phone or play Stardew on my Steam Deck until my eyelids get heavy. \n\nI also have a melatonin gummy (0.5mg because I have the medication/herbal tolerance of a 5-year-old) and a cup of sleepytime tea about an hour before I'm ready to go lie down. I think the ritual of the tea helps more than the tea itself. This, I just started doing a couple months ago and it does make a difference (for me).\n\nI just set Screen Time limits on my phone a few days ago as well because I was doomscrolling and it's helping a little. I still sometimes pick \"ignore limit\" on a site or app when I shouldn't, but it at least makes me stop and think about what I'm doing. lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "PitchOk5203",
            "body": "hold my phone three inches from my eyeballs and stare at it until i pass out. every night. Sorry op, I'm right there with you",
            "score": 1,
            "replies": []
        },
        {
            "author": "bi-mom-yeah",
            "body": "I can't do the no noise of no tech so I listen to the \"sleep with me \" podcast. \nHowever my bed time routine is very dependent on my kid, we read then bush teeth with a video, then read a chapter book , then listen to a kids sleepy podcast with night light on , then switch to sleep with me with lights off and so normally in a hour and 45 mins from start to finish we are asleep, but if my kid is with other family I have a hard time starting this routine and staying off my phone screen. \nSo a bit ago I put timers on my apps so by bed time I have no apps that 'work'.",
            "score": 0,
            "replies": []
        },
        {
            "author": "EmmaOK95",
            "body": "I just fall asleep to a twitch stream or a series on my phone. Sometimes it plays the whole night and I just sleep through it. Its all about pushing myself to go to bed early. Clean myself up, set my alarm and lie down. I need something that's fun enough to motivate me to gó to bed. I don't care what the rules say, I've noticed that light and sound don't bother me when sleeping but I just have to be engaged enough by the video to NOT MOVE. Because the act of relaxing and not moving your muscles increases melatonin and when I'm not engaged I always move. It works for me so I'm just sticking to this routine",
            "score": 0,
            "replies": []
        },
        {
            "author": "PurposeFighter",
            "body": "I leave my phone in another room, and have my HomePod play a podcast and just lie in bed until I falls asleep with cold air on.",
            "score": 0,
            "replies": []
        },
        {
            "author": "ewhit78",
            "body": "Podcasts to help my mind stop racing.",
            "score": 0,
            "replies": [
                {
                    "author": "ewhit78",
                    "body": "I also find that turning on airplane mode seems to help.... Probably just in my head thoygh",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "comradekitty__",
            "body": "Reddit. I usually don't go on Reddit any time other than before bed. After a few minutes reading I pass out with my phone in my hand. If I use Reddit any other time, there's a good chance I'll pass out. If I want to take a nap during the day I'll go on Reddit.\n\nAny routine you decide on won't necessarily work right away. Just make sure it's the same routine every night and eventually your brain will associate that task with sleep.",
            "score": 0,
            "replies": []
        },
        {
            "author": "angelapoll",
            "body": "I set myself a \"bed time\" do what ever in the evening that needs to be done, at my \"bed time\" (generally give myself an hour to fall asleep) I Read a paper book, and hope that I actually fall asleep \"on time\"",
            "score": 0,
            "replies": []
        }
    ]
}