{
    "title": "2-3 hours after taking my medication I easily get a feeling of hopelessness..",
    "author": "saabarthur",
    "subreddit": "ADHD",
    "rank": 44,
    "score": 36,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 22,
    "url": "https://www.reddit.com/r/ADHD/comments/1inbpdv/23_hours_after_taking_my_medication_i_easily_get/",
    "id": "1inbpdv",
    "selftext": ".. like I'm getting overwhelmed how my life have become. Like I'm staring into the abyss and it's staring back at me. After an additional hour this feeling goes away and I'm stable, a bit numb, and usually a bit tired.\n\nAfter totally 6-7 hours I can get the same feeling again, when the medication leaves my system I would imagine. \n\nI've pondered about this, because these feelings of hopelessness usually leaves me not being  productive, because it dampens me. The feeling of total sadness lingers and I just want to become happy, but you're not really able to on the medication.\n\nI've brought this up with my physician but they're having a hard time understanding, because they want to say it's anxiety from the medication. But I don't have heart palpations, sweating, feeling any rush or whatever. I don't really feel anything except for a soothing calmness and this some times these bouts of hopelessness.\n\nAm I just plain wrong?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/saabarthur and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Snagtooth",
            "body": "That's very relatable, and your physicians response is somewhat concerning depending on how you explained it.\n\nOne thing that is crucial to understand about ADHD is that it is part of The Big Three. Anxiety, ADHD, and Depression are all interlinked.\n\nFor instance, my family has a history of all three. By brother got anxiety and ADHD, i got Depression and ADHD.\n\nIt's common that ADHD meds can worsen or better the other two problems. For me it actually helps my depression.\n\nWhen I'm not on my meds, I am exactly as you describe but slightly worse. I've found Stimulants help me focus on life instead of wandering off into oblivion, but these meds affect everyone differently!\n\nSo, it's entirely possible you are getting a negative affect from it, and I would nip this in the bud NOW so it doesn't get worse.\n\nMaybe lower doasage, use a more gradual release, or try a different med.",
            "score": 14,
            "replies": []
        },
        {
            "author": "Ok-Debt-3495",
            "body": "Is your medication Vyvanse? ",
            "score": 7,
            "replies": [
                {
                    "author": "saabarthur",
                    "body": "Yes.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Ok-Debt-3495",
                            "body": "I am not sure if there's a proper explanation, but I had same issue, and while googling around I saw a few other people mention similar symptoms. For me - Vyvanse just suddenly started making me very, very sad, hopeless, and kinda empty? \n\n\nIt wasn't just at the end of the day, when the medication stops working - it was the medication *working* that made me feel that way. \n\n\nOther people said that Adderall helped them better, and I'm on it now - just a week in, so too early to tell, but no feeling of doom and misery (or not more than usual) so far. So maybe you should try switching medications? ",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "saabarthur",
                                    "body": "> I am not sure if there's a proper explanation, but I had same issue, and while googling around I saw a few other people mention similar symptoms. For me - Vyvanse just suddenly started making me very, very sad, hopeless, and kinda empty? \n\nFor me it wasn't suddenly, but more gradually, but you didn't really realize it before you've been on your dosage for a while and you realize some stuff is either gone, like your happiness, or feelings like this hit you.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "BroDudeBruhMan",
            "body": "I’m not a doctor, but it could just be the comedown. ADHD meds are a stimulant drug you’re taking and when the meds wear off then your body’s chemicals go back down to your natural levels.\n\nIt’s like drinking coffee. You’re adding something to your body that amplifies the firing of chemicals in your body that make your mind and body active. Those meds wear off and you feel that drop in “good feeling” chemicals.",
            "score": 4,
            "replies": [
                {
                    "author": "saabarthur",
                    "body": "Right, but the feelings arrives first after taking the medication.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "BroDudeBruhMan",
                            "body": "Oh ok sorry I misread. 5 or so minutes after I take my medicine I feel this kinda numbing brain fog feeling for a little bit, but I eventually break out of it and I feel “normal”. It’s like if you took the feeling of getting woken up from a nap and stretching that sensation over the course of a few minutes. The feeling of hopelessness though I’m not sure about and may just be an individual thing.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ArmadilloWorldly9376",
            "body": "If it makes you feel that hopeless and what you’re staring into avoid, you should not be on that medicine I would get better doctors and talk to them about it and have them get you off of it, but I wouldn’t wait. I would get in right away, feeling blackness and avoid can cause people to commit suicide and if this medication is making your brain body and emotions feel that way, I think there should be a different medication to try you end up committing suicide you make sure you promise yourself if you ever feel that way no matter what time a day or night it is you get into an ER immediately if you don’t feel right. \n\nOther thing I can think of is when you feel that void in that hopelessness make sure you’re outside in the sunshine and nature or listening to super happy music or praying to God for peace and love ,  and if those type of things don’t help that feeling go away, I would definitely taper off of that medication with Dr. snowing and helping I sure hope you feel better. You’re in my prayers. 🌌🍃🕊️",
            "score": 3,
            "replies": []
        },
        {
            "author": "ExternalSelf1337",
            "body": "Those are the wrong meds for you, pal. Don't take them again, ask to try different meds, there are many different kinds that can help.",
            "score": 2,
            "replies": [
                {
                    "author": "saabarthur",
                    "body": "Right? I've said this before and then they wanted to counteract this feeling by going higher, but then you're shut off emotionally.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ExternalSelf1337",
                            "body": "You may need a new doctor. My doctor is happy to immediately stop any medication as soon as it's clear it's not good for me.\n\nIf this is your regular doc and not a psychiatrist they probably just don't know what they're doing with ADHD.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "august401",
            "body": "this used to happen to me when my dose wasn't high enough, I forget how many mg but I was taking less than 30 mg of vyvanse and I could never reach a steady state of peace i kept getting waves of the hopeless lazy feeling that i feel while unmedicated it drove me crazy, thankfully they upped it for me though (even though im on adderall now bc vyvanse wasn't lasting all day)",
            "score": 1,
            "replies": [
                {
                    "author": "AgentAccurate3107",
                    "body": "What dose of adderall are you on now that works? This sounds like exactly my problem and I’m on 20 mg xr twice a day and still not helping :(",
                    "score": 1,
                    "replies": [
                        {
                            "author": "august401",
                            "body": "i'm on 15mg ir twice daily, it mostly works but I am also dealing with anhedonia rn from lexapro so I have no idea if it should be working better or worse",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "AgentAccurate3107",
                                    "body": "I have that too, I’m on Prozac but idk if it’s from that or the adhd. Sigh",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "saabarthur",
                    "body": "This has been the conjecture before and the feeling doesn't really appear as often at a higher dosage - but the 'not feeling part' does expand at a higher dosage and makes it kind of hard to function.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mysterious_Salad7593",
            "body": "SAME ughhh maybe its because the dossage is too high… it started happening when i upped from 30 to 40 then from 40 to 50… im thinking about going down to 30",
            "score": 1,
            "replies": [
                {
                    "author": "saabarthur",
                    "body": "I've been thinking about that too, but it seems like this is most evident when I decrease the dosage. It's like that feeling shines through easilier on a lesser dosage. Which seems counterintuitive.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ceyy_00",
            "body": "I felt the exact same when I started my ADHD medication, and quickly realized I needed to be put back on my antidepressant to be taken along with it. I thought for sure if my adhd symptoms were handled, it would take care of the underlying depression as well. & although I believe my depression stemmed from my adhd, it doesn’t just go away that easily with treating the adhd only. Maybe ask about a low dose depression or anxiety med to take with it?? I’m not a doctor, and I’m not giving medical advice, but that is just my experience! Good luck finding the right fix!😌",
            "score": 1,
            "replies": []
        }
    ]
}