{
    "title": "I can remember every time I've put my foot in my mouth but I can't remember to do fucking laundry.",
    "author": "lotsofsweaters",
    "subreddit": "ADHD",
    "rank": 5,
    "score": 175,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 28,
    "url": "https://www.reddit.com/r/ADHD/comments/1inmh7x/i_can_remember_every_time_ive_put_my_foot_in_my/",
    "id": "1inmh7x",
    "selftext": "Before I got diagnosed I spoke without thinking so much and sometimes it was really embarrassing. I can't seem to forget those moments, but remembering to take a shower, or take out the recycling, things going on now, I fall behind all the time. I hope that at least it's not only me. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/lotsofsweaters and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "blamejaneshui",
            "body": "It’s not only you, but you need to find little way to integrate reminders… set an alarm? Post-it notes?\n\nWith regard to putting your foot in your mouth, love your weirdness!! As long as you weren’t oppressing others dignity, its okay to be different 💓\n\nThe title made me giggle",
            "score": 15,
            "replies": [
                {
                    "author": "lotsofsweaters",
                    "body": "I've had a post-it to take out the recycling on my door for like a week 🤣 maybe setting a specific time is better.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "CanadianDude86",
                            "body": "Firstly thank you for your post/reminder for my laundry. Mundane tasks are mundane, and even though you might remember each time your feet were in your mouth, the conversation was engaging you. As per the feet situation, not knowing yourself at all, it took me years to re-learn socializing and knowing what works for me to know when to keep quiet and listen. Laundry is boring, but there are plenty of people with plenty of techniques that can help!   \n   \n\nEDIT: Also /u/blamejaneshui is very correct, \"love your weirdness\" the more you try to struggle or get angry with your self the harder it is. Rather than that learn to work with it, and develop strategies to manage it.  \n   \nEDIT2: [good analogy from the west wing](https://www.youtubetrimmer.com/view/?v=ehC5aYj2xNc&start=0&end=54&loop=0)",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "tragicvector",
                            "body": "Timers are better. Audio cues seem to do it because I'll just become blind to visual cues.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Comprehensive_Ant984",
                    "body": "Bestie, if reminders alarms and post its worked with any kind of regularity or reliability for most of us, adhd prob wouldn’t be a diagnosis. Being able to use all of the tools you mentioned still requires adequate working memory to do so, and not all of us have that. So maybe we plan to set an alarm but get distracted by a notification when we go to unlock our phone, and then we forget. Or maybe the alarm goes off, but you just happen to get an email or someone stops by your office to chat then. Just saying. It’s incredibly condescending to post, especially here of all places, this kind of overly simplistic advice, as if we haven’t all already tried the basics.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "blamejaneshui",
                            "body": "You say this as though I don’t struggle with it myself. ADHD manifests differently in people and therefore not safe to assume that everything you’ve tried - everyone else has tried. Thanks for man-splaining bestie 🫶",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "CanadianDude86",
            "body": "OMG, on a very side note, you just reminded me my laundry is done! THANK YOU!",
            "score": 5,
            "replies": []
        },
        {
            "author": "Eyesontheprize_178",
            "body": "See if you can attach each boring job to a (different) song that makes you feel so good you involuntarily start dancing. \n\nAssociate the song with the task via repetition. \n\nSet the alarms for that task to play that song. The song activates the motor part of the brain just enough to get me off my toosh. All I have to do is START. Sometimes I play the song again to finish the task. It’s like having dessert during dinner 🤭\n\nI have different ones for showering, teeth, meds, kitchen etc..",
            "score": 3,
            "replies": [
                {
                    "author": "faith-fine-6472",
                    "body": "Pairing a song with a task through repetition really does wire your brain to just *do it*. I’ve used this for workouts, but never thought about it for chores might have to try it for dishes and laundry.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "linzielayne",
            "body": "My husband does ALL the the laundry and I do a lot of the cooking and cleaning stuff, but he still does some of that. I just hate laundry from the bottom of my heart for some reason. My husband has never cleaned the bathroom (but would probably if I asked him), I would just rather clean a toilet than do laundry.\n\nIt's too many steps with waiting in between - I hate that.",
            "score": 2,
            "replies": [
                {
                    "author": "AdPrize3997",
                    "body": "I thought i was the only one who hated laundry.. didn’t realize it might be an adhd thing",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Cute_Ad4970",
                            "body": "Hate laundry too and 7 out 10 times I forget the laundry in the machine and have to wash them again lol",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "AdPrize3997",
                                    "body": "Been there done that for many years. Finally hired someone to just dry my laundry 🤪 money well spent",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "MarkedOne1484",
            "body": "Yep. It sux.",
            "score": 2,
            "replies": []
        },
        {
            "author": "b0nes5",
            "body": "I was going to share my latest tip to crack washing. \n\nThen I looked around and realised that I'm stood in about 2 sq metres of floordrobe next to a massive sack of washing.\n\nI'll keep it to myself.",
            "score": 2,
            "replies": [
                {
                    "author": "Eyesontheprize_178",
                    "body": "Nooooo please don’t keep it to yourself! We ALL need more ways for when the novelty wears off on our current hack!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "jesshow",
            "body": "Ah crap. I forgot to do my laundry.",
            "score": 2,
            "replies": []
        },
        {
            "author": "tivofanatico",
            "body": "I like to hang up my laundry to dry after the washer. Before that, I could wash, dry and fold the laundry, but I REALLY didn't want to unfold it and put it on hangers or put it in drawers. If it's t-shirts on hangers on the shower rod, you can't ignore it. It's in the way, and it's super easy to move to the closet. There's always a way to make chores okay. I HATE washing dishes by hand, but if I watch a show or YouTube on my iPad, the dishwashing becomes a background activity while my attention is on the screen. I was diagnosed when I was 21, and I'm still figuring it out at age 46.",
            "score": 1,
            "replies": []
        },
        {
            "author": "The_Grimm_Weeper",
            "body": "Over sharing was the worrst for me! As for chores\nMake a list that needs to be done. Then break it down into the smallest task possible! Put coffe cup on the sink.\nYou don't even have to clean it. You can just put a\nPretty check by it.\nSlowly bigger tasks wont look so hard.\nJust break it down",
            "score": 1,
            "replies": []
        },
        {
            "author": "myzand",
            "body": "My husband does almost all the weekly chores himself like vacuuming, laundry, cleaning, dishes, etc. I do spontaneous things that don't matter when they are done. So tidying up the rooms, sorting out the kitchen cupboards, folding my own clothes (I have a very specific way of putting my clothes in the closet), suddenly emptying the entire attic at once and organizing it. (And maybe give up halfway) We also have a blackboard that contains todos, so when I feel like cleaning, I know what needs to be done. \n\nI'm very happy I've found someone who doesn't blame me if I don't succeed and sees it as something that just has to be done. If he does 90% of the cleaning, and I do 10%, it doesn't matter to him. I don't know what would have become of me if I lived alone.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ConsiderationLeft226",
            "body": "I know wtf. Where is the manual override. I don’t want to remember every embarrassing moment I’ve ever had I just want to remember to drink water.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Competitive_Till_950",
            "body": "Relatable. I also have demand avoidance. Its a real bitch.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheAimlessPatronus",
            "body": "I have had a lot of success working through my shame, and it made those shame memories take up less space in my head. When I avoid a shame spiral, I have way more mental energy to tackle other things.\n\nHow to Keep House When Drowning was a huge help as well.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheGreenJedi",
            "body": "LMAO \n\n\nOdds of you successfully remembering all the times are pretty small, but it definitely feels like that doesn't it",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheGreenJedi",
            "body": "Alexa reminders at the \"right\" time where you're gonna listen to them and switch over the laundry.\n\n\nWon't help you fold or put it away but not wasting water and washer time is a good first step",
            "score": 1,
            "replies": []
        }
    ]
}