{
    "title": "How do you stop interrupting people in conversations?",
    "author": "boulie-bubbles",
    "subreddit": "ADHD",
    "rank": 37,
    "score": 2,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/ADHD/comments/1inud0p/how_do_you_stop_interrupting_people_in/",
    "id": "1inud0p",
    "selftext": "Sounds simple enough, you would think. But oh man I (27 female) have a hard time not blurting out my own thoughts in conversation, interrupting them. \n\nShort background: I never noticed this was a problem until I became an adult. As kid I was intensely shy and didn’t speak much to people so I only had a few friends and my parents (or anyone really) never told me it was rude to interrupt people (lets just say I had zero help with my mental health growing up and was given no tools to help - my parents believed i’d grow out of it.) So this basically went unchecked until college, when I became somewhat more socially aware, had more friends, talked more.\n\nIn conversations with other people, most people don’t interrupt me. I’m mad at myself because I can’t seem to give them that same respect. It would probably bother me if I were them, so how the heck do I stop? Ugh, im worried people won’t want to talk to me if I’m like this - I don’t want them to feel like I’m not paying attention to them or that I don’t care. \n\nI will sometimes catch myself doing it but sometimes its too late and at point I’ve already ruined their flow by making a noise or looking like I have something to say (different issue just not being able to control my facial expressions - idk if this is because I was socially stunted being so freaking shy lmao - it also sucks) And now I have a newish problem - if I don’t interrupt - it is genuinely hard to concentrate on what they are saying because my brain hate me and its like an itch to say what I want to say. Fuuuuckking hell\n\nDo other people struggle with this? If so how have you been able to improve yourself? How do you stop that itch in your brain? ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/boulie-bubbles and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "panicked_goose",
            "body": "I struggle so hard with this. My husband 3D printed me a spinner ring (like a fidget ring) that I subtly spin like a crackhead while I wait for my turn to speak. Before he made me the ring, I would literally bite my own tongue (not hard), just enough on the tip to keep my tongue from flapping without my brains permission lol. Hubs said it made me look funny in social situations which is why he made the ring lmfao",
            "score": 1,
            "replies": []
        },
        {
            "author": "HyperBites",
            "body": "I don’t have a good answer for live interaction. But in phone and video calls I have a pen and paper so I can write down everything I want to say so my brain does not explode.",
            "score": 1,
            "replies": []
        }
    ]
}