{
    "title": "How many of you are dating or married to someone on the autism spectrum?",
    "author": "No-More-Rubbish",
    "subreddit": "ADHD",
    "rank": 21,
    "score": 265,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 237,
    "url": "https://www.reddit.com/r/ADHD/comments/1in4aa8/how_many_of_you_are_dating_or_married_to_someone/",
    "id": "1in4aa8",
    "selftext": "My partner is autistic and I recently met another adhd person who is married to an autistic person. I also know of two YouTube couples where one is autistic and one has adhd. Is this a common thing? I would love to hear how many of you have autistic or adhd partners!\n\nMan I have to type more to be able to post here so here are some other words...",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/No-More-Rubbish and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "JustStayAlive86",
            "body": "My husband is AuDHD, I’m ADHD, and he’s the only person I’ve ever dated who’s been utterly calm and kind in the face of my chaotic ADHD. He says he’s not “tolerating” me, that it genuinely doesn’t bother him, and after 11+ years I’m starting to believe him.",
            "score": 107,
            "replies": [
                {
                    "author": "No-More-Rubbish",
                    "body": "Oh this made me well up, that's so sweet! 🥹",
                    "score": 22,
                    "replies": []
                },
                {
                    "author": "Eyesontheprize_178",
                    "body": "I’m ADHD (C) and my unflappable, caring hubby would never receive a diagnosis despite his many positive markers because he has what I like to describe as an Autism Spectrum ENHANCEMENT.  🤭\n\nHe sees straight past my mayhem behaviours to the logistics that trigger them. If it’s viable he steps in with the minimum ‘fix’ for whatever crisis - but magically knows if I need to be cuddled or left alone to calm down. Once I’m calm,  he’ll gently ask if he’s guessed the cause correctly (a game for us both), and  if confirmed, suggest  a clever way to avoid a repeat. Surprises and delights me every time! No judgement, just wants me to be happy, so he helps without pushing. Blows my freaking mind.  I wasn’t diagnosed until recently but he’s been doing this for fifteen years 🤷‍♀️.  So happy I wriggled out of all the ‘almost okay’ relationships that seemed better ‘on paper’. Go me! 🙌",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "TheEggEngineer",
                    "body": "Hahaha my single ass doesn't have a partner but my coworker is adhd hyperactive. I'm adhd inattentive and people think I'm hard at work but really I'm quietly fighting for my life as I try to remember the 3 measurements I have to make. He thinks he bothers me and puts wheels in my bike by going too fast and making mistakes I have to fix but fixing his shit is easier to me than doing the whole thing.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Inevitable_Tell_2382",
                    "body": "Same",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "m_guerard",
            "body": "ADHD married to an autistic woman and couldnt be happier. Definitely different ways of communicating however. Can take a lot more work to understand eachother at times. I would say we mostly compliment eachother though.",
            "score": 77,
            "replies": [
                {
                    "author": "StoicNortherner",
                    "body": "How are you able bridge the gap in communication styles?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "m_guerard",
                            "body": "Ultimately a lot of patience for both. Her bluntness helps alot to get down to the point and broach difficult topics I would rather distract from. I had to realize she wouldnt pick up on my body language or subtle hints, particularly when i wanted out of a conversation. I thrive in chaos, love clutter and am very vague, while she needs order, minimalism and a defined schedule. Separate bedrooms is a huge help here, but I understand how that can be difficult or weird for a lot of couples. I would say the main thing is having a sense of humor about our funny little abnormalities and teasing eachother rather than reprimanding eachother for behaviors that we cant much control.",
                            "score": 32,
                            "replies": [
                                {
                                    "author": "Bright-Boot634",
                                    "body": "Totally agree with you though I suspect us both having adhd and autism (only adhd is diagnosed until now). It's constant hard work, especially if someone has issues with empathy and the other is highly sensitive to rejection. Sometimes the break down of a big topic into \"well then, just change it\" is not the most helpful xD",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "rufflayer",
            "body": "My partner has not been officially diagnosed as autistic, but he has been thoroughly peer reviewed.",
            "score": 279,
            "replies": [
                {
                    "author": "haileyesque",
                    "body": "I love this phrasing, I'm definitely letting my husband know he's been peer reviewed now 😂",
                    "score": 52,
                    "replies": []
                },
                {
                    "author": "YourMominator",
                    "body": "Same.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "Responsible-Shake-59",
                    "body": "🤣🤣👏👏👏",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "The-Fanta-Menace",
                    "body": "Lmao those peer reviews are no joke 😂",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "justlurkingimbored",
                    "body": "Hahaha same",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "elleisnotmyname1",
                    "body": "That’s so good. Same here.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "thedesignedlife",
                    "body": "Same 😂",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Nellie_blythe",
                    "body": "Mine too!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "adrani",
                    "body": "Yep. Same here :)",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Lethologica_",
                    "body": "Same lol",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Particular-Yak-1984",
                    "body": "Omg, same! And, yes, it's helpful - we can both relate to the like, intense overwhelming feeling from processing overload.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "UncleDread3444",
            "body": "Autistic people are awesome. They say exactly what they mean, there's no guessing games. Not dating one, but friends with quite a few.",
            "score": 164,
            "replies": [
                {
                    "author": "saddbabydadd",
                    "body": "It definitely is an awesome part about dating someone with it, the straightforward realness helps me feel so safe and secure 🥰",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "ikoabd",
            "body": "Both of us are AuDHD, both found out in our 30s after we had already been together for over a decade. All of our close friends are some flavor of ADHD/ASD. I've found we tend to gravitate towards one another.",
            "score": 28,
            "replies": []
        },
        {
            "author": "Adventurous-17",
            "body": "Divorced two 😕",
            "score": 23,
            "replies": [
                {
                    "author": "HairyWeight2866",
                    "body": "Married to one and it’s hard work.",
                    "score": 16,
                    "replies": []
                }
            ]
        },
        {
            "author": "FeralFloral",
            "body": "Married to an AuDHD.",
            "score": 54,
            "replies": [
                {
                    "author": "I_am_Bearstronaut",
                    "body": "🙌🏽",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Disaster_Core",
            "body": "I'm AuADHD and hubby is Autistic. It makes for easy clear conversations or extremely confusing ones. Nothing in between. 🤣. He's been my heart though for 30+ years",
            "score": 60,
            "replies": []
        },
        {
            "author": "Grouchy_Chard8522",
            "body": "I suspect my partner of 24 years is autistic. Sometimes we are so far apart in our approach that it's like each of us is speaking a language the other doesn't know. Most of the time, we compliment each other very well.\n\nThe best work team I was ever on was 2 ADHDers, someone with autism and someone with neither. We had big creative ideas and executed them flawlessly.   Such a great mix.",
            "score": 13,
            "replies": []
        },
        {
            "author": "Slight_Respond6160",
            "body": "The girl I’m seeing is autistic. We just seem to vibe on a lot of things. We understand a lot of the quirks as we each have similar or comparable quirks.",
            "score": 28,
            "replies": [
                {
                    "author": "Osmirl",
                    "body": "Is just met someone and its almost scary how similar we are. Lots of same or similar interests. Been a long time since i found someone like that lol. I just hope we are compatible haha cause i somehow have a problem if somones personality is to similar to mine haha",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ninjasaysrelax",
            "body": "ADHD married to AuDHD. It’s common in friendship circles too. I suppose we attract and surround ourselves with like minded people.",
            "score": 20,
            "replies": [
                {
                    "author": "Character_Spirit_424",
                    "body": "Its like how theres the \"one gay friend\" trope but in reality its the \"one straight friend\" in queer friend circles, I've seen it happen with adhd/autism etc too",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Correct_Standard_579",
            "body": "This is in no way scientific, but I’ve always thought that really ADHD and autism are on the same spectrum",
            "score": 8,
            "replies": [
                {
                    "author": "Frisk1123",
                    "body": "It feels that way to me to.  This is also purely anecdotal:  \n  \nI am autistic and my husband has ADHD.  I have put in a lot of time studying ADHD to understand my husband better and this has muddied the waters of my understand of ASD.  There is so much crossover.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "-Kalos",
                            "body": "My girlfriend does the same. You guys are queens",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Fit_Possibility8496",
                    "body": "Because they are both newly discovered, especially ADHD, we deffo don’t have a complete understanding of both and I believe in the future we will see way more combining of diagnosis and treatment as it’s soooo common to have both, it makes sense that they’d be in the same spectrum",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "mistymaryy",
            "body": "Both auDHD and queer. It's a match made in heaven.",
            "score": 7,
            "replies": [
                {
                    "author": "No-More-Rubbish",
                    "body": "That's awesome! We're both bisexual, it's awesome having such an open and accepting partner, makes for some fun conversations!",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "DelightfulGiraffe",
            "body": "Late-diagnosed ADHD girlie here, my husband was diagnosed with Autism last year. Married for almost 13 years and our diagnoses have been kind of fascinating to navigate together. So many things make sense in retrospect, and we make each other feel seen. It also feels like we know how to care for each other better now that we know how we’re wired. We also have overlap when it comes to getting overstimulated or being in hyper focus mode, so we can respect those needs in each other. We have many pairs of Loops earplugs between us, he knows I will spend hours on a jigsaw puzzle, I know what food textures will send him into deep distress. (Most vegetables.)",
            "score": 7,
            "replies": [
                {
                    "author": "spacerobot33",
                    "body": "Same boat here - Did you find it hard to unmask/accept your wiring once knowing? Or how are you getting through to better caring for yourself and your husband?   \n  \nI think I am still trying to figure that out for both of us and myself.   \n  \nI have lost myself in people-pleasing/validation land for too long and trying to climb out of the deep caverns I have dug for myself. It is a slow process.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "DelightfulGiraffe",
                            "body": "Oh we are kindred spirits! My masking/people-pleasing tendencies are compounded by the fact that I grew up evangelical, so it was a lot of obedience and keeping social norms, never rocking the boat. I have been unpacking that since my early 20s so my diagnosis was like a continuation of that work — like “oh ok no WONDER I have been neglecting my own needs and trying to make everyone else happy all the time.” Add RSD to that, and so much makes sense - and I am comforted by the fact it’s not just me! It’s been a journey in trusting myself and listening to what I need - and then giving myself what I need instead of trying to power through without it.\n\nSomething my therapist said recently really hit home: I questioned whether I should figure out how to cope without my ADHD meds, because I did so for decades before. She said, “imagine the childhood version of yourself, in elementary school, and you’re doing poorly in class, even though you work so hard. Your peers are doing fine and you are feeling so discouraged, but you just keep trying and trying. Then one day, you get your eyes checked and it turns out you need glasses. With your glasses, everything comes into focus, and you realize what everyone else was able to see the whole time. Would you ever tell that little girl not to wear her glasses?” \n\nI cried when she said that. And that’s what I try to remember when I feel inadequate for my messy house, or when I feel frustrated if my husband shuts down in a moment of overstimulation. We both need our glasses — meds, space to calm down, grace and forgiveness from each other when we are at our limit, jigsaw puzzles 😂 It’s not a flaw, it just is. And everything works so much better when we accept it as wiring instead of trying to fight it or rewire it. \n\nWow that was so long, sorry 😂 and I don’t even know if it’s helpful but that’s my own experience.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "spacerobot33",
                                    "body": "No apologies needed this was great to read and hits home. I really appreciate you sharing. Your therapist sounds like a good one.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "g-a-r-n-e-t",
            "body": "He’s not diagnosed but I’ve long suspected that my husband is somewhere on the very high functioning end of the spectrum. He’s very direct, can be very black and white in his thinking sometimes, has a couple of special interests with a VERY deep knowledge that he could go on about for hours, etc etc. Can have outbursts at highly emotionally charged moments or when overwhelmed or overstimulated. \n\nHis mom is a retired social worker who used to work specifically with special needs kids and she agrees with me on this, his dad never allowed her to take him for testing but she’s always thought it was the case. \n\nWe definitely had our issues in the beginning but after being together for almost seven years were to a point where we can support each other and understand what makes the other person tick. A big part of it was just figuring out how to communicate effectively, I had to learn how to slow down and make sure he understood all the leaps I was taking instead of just going ‘A + 427 x Blue = Zebra, come on it’s not that hard’ and once he figured out that I’m NOT intentionally ignoring the dishes until he does them out of frustration a lot of our friction disappeared. Overall he’s a great husband and one of my favorite people!",
            "score": 7,
            "replies": []
        },
        {
            "author": "Jeeefffman",
            "body": "I have ADHD (combined) and I am in a relationship with an amazing girl with autism. \n\nWe have a great time together and I love her to the moon :)\n\nThe only thing I have trouble with is her need for alone time, which is very understandable. But it also includes her need for solo travel, which I find hard to be comfortable with.\n\nBut I want to make that work, because besides that I see myself growing old with her! :) tips are always welcome tho",
            "score": 6,
            "replies": [
                {
                    "author": "No-More-Rubbish",
                    "body": "My partner is the same, he really really loves being alone. He does also like being in the same room with me as we do different things, so I might join him when he is watching tv and just paint or crochet. Then I get bored and start jumping around and annoying him XD",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Robofeather",
            "body": "Yep! Been with my partner ten years. Love her more than anything ❤️ \n\nShe was actually the one to first bring up my ADHD symptoms back when I was completely uneducated, struggling, and thought it was something only misbehaving white boys had. (cringe i know)",
            "score": 20,
            "replies": [
                {
                    "author": "uuzag",
                    "body": "Same about the partner bringing up ADHD. I was still having bad attention issues despite by depression being well managed (a previous psychiatrist attributed my attention issues to severe depression). My partner said “I think you have ADHD. You act similar to my ADHD cousin.” Couple years later and now I have a diagnosis.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok-Commission-7825",
            "body": "I'm married to one and looking back I suspect my exs may have been undiagnosed autistic as well. I also so think I've spotted that as a trend in others.\n\nTheir seems to have been an opposites attract situation going on at the beginning of the relationship but at the same time bonding over very similarly traumatic school and work experiences. Also in day to day life we tend to compensate for each others weaknesses pretty well. \n\nI have to say we are on the rocks now though primarily due to her autistic meltdowns turning into deeply personal emotional attacks, my ADHD untidiness and her refusing to accept that's not a deliberate choice and my ADHD urge to be active and try new thing clashing her autistic wanting to never leave the same routine.",
            "score": 11,
            "replies": [
                {
                    "author": "jleahul",
                    "body": "My wife and I clash over tidiness as well. Then she watched a TikTok that said \"Some people need to clean before they can relax, and some people need to relax before they can clean, and those people marry each other.\" \n\nI think seeing it framed that way has made her more accepting to let things be a little messy, and that I mean it when I say \"I'll get to it.\"",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "PaleontologistNo858",
                    "body": "I ADHD, have same problem with my autistic husband, he likes to live in a routine predictable same all the time, whereas l get extremely bored and depressed with that.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "UncannyVeganTaco",
            "body": "Yes my husband is diagnosed with ASD! I don’t remember where I heard it, but people ADHD and ASD can often attract each other since each represents what the other (stereotypically) lacks. Like someone with ADHD might want structure (but not too much) and struggles to create it, while someone with ASD prioritizes things being regimented and consistent. Likewise someone with ASD might crave a bit more excitement and spontaneity but not be able to create it themselves, but an ADHD person can provide it pretty naturally.\n\nI’m mostly generalizing and there are lots of different ways this can be true and untrue, but I thought it was fascinating when I first heard it!",
            "score": 5,
            "replies": [
                {
                    "author": "Eyesontheprize_178",
                    "body": "Yes. This 🙌",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "BackstabButterKnife",
            "body": "My partner has autism and I have ADHD so it's like the psych people say - ADHD and autism go hand in hand",
            "score": 13,
            "replies": []
        },
        {
            "author": "poetduello",
            "body": "Married an autistic girl, also got to be around when she found out that her parents had hidden her autism diagnosis from her for years.",
            "score": 4,
            "replies": [
                {
                    "author": "No-More-Rubbish",
                    "body": "That's shocking! I hope she has healed from that, that's some trauma fuel right there.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sequince69",
            "body": "It is funny that people with attention focus have to use a lot of words to create a post.  I met my wife online in an MMORPG (EverQuest), she's got asperger's syndrome.  Have been together 10\\~15 years quite happy all the way.",
            "score": 4,
            "replies": [
                {
                    "author": "Frisk1123",
                    "body": "Everquest really takes me back.\n\nI graduated from highschool with no plan, no friends, and certainly no self esteem.  I lived in my parents house for many years with their constant disappointment in me.  But I was allowed to have some time to myself on Everquest.  It allowed me to practice being social, practice making friends, practice maintaining friendships (still struggle with this).  \n\nMy time playing Everquest gave me just the right amount of people skills and just a smidge of self esteem needed for me to get my life going and face my fears.  MMORPGs gave me a kind of social education that was completely lacking in highschool.  These games taught me how to work in a team.  In Everquest, people liked me.  I was never picked on or put down.  \n\nI was able to go to college in year 2005.  I finally managed to graduate in 2016.  I could not have done it without the experiences that I had with Everquest.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Sequince69",
                            "body": "Really interesting seeing other people's paths in life with the ADHD adventures.  I did the college thing over 3 times 2 taking the same course because I just barely got by the first time and had to learn life skills before going back a bit more seriously.\n\nJust remember, you're not behind, you're where you're supposed to be.  Everyone has things that they fight through, lots of good things in life, and lots of stuff only they ever see.  You're doing great!  Keep pushing and learning!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "uuzag",
            "body": "My husband is autistic and I was undiagnosed AuDHD until very recently. Known each other about 10 years now and together for 6 of them.",
            "score": 11,
            "replies": []
        },
        {
            "author": "jape2116",
            "body": "Married to an autistic woman. We both figured this out later in life. It can cause some communication issues, but since we’ve embraced our quirks, it’s pretty amazing.",
            "score": 5,
            "replies": []
        },
        {
            "author": "PiesAteMyFace",
            "body": "*Raises hand* Married to a classical ASD, my AuADHD rolls off of him like water off of a duck's back.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Purple_Ad3427",
            "body": "We’re both AuDHD, though neither of us were diagnosed (or suspected. Just “different”) when we met",
            "score": 3,
            "replies": []
        },
        {
            "author": "DareEast",
            "body": "As many others, dating an autistic girl and probably best relationship I've had in terms of communication and connection. We're both recently diagnosed as adults and we're navigating the world through this new optic together. Quite fun tbh.",
            "score": 3,
            "replies": []
        },
        {
            "author": "silverwolf127",
            "body": "My fiancée is probably on the spectrum and they have dated exclusively people with adhd",
            "score": 3,
            "replies": []
        },
        {
            "author": "xMend22",
            "body": "Married - AuDHD.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Immediate_Bad_4852",
            "body": "My boo and I are both AuDHD and its the best relationship ever. No fighting, no intentional hurting of the other, no offense, we can say things directly and we hear it without attaching anything to it, we're considerate of eachothers sensitivities and stimulations.",
            "score": 3,
            "replies": []
        },
        {
            "author": "riceandbeefandbeans",
            "body": "Wife/partner of 27 years diagnosed with autism two years ago. After realising my kids have adhd/autistic traits I did a bit of a delve and realised I have ADHD and so many things fell into place. We find each other for sure…",
            "score": 3,
            "replies": []
        },
        {
            "author": "hipnotron",
            "body": "Erm... here? I am an autistic girls magnet",
            "score": 3,
            "replies": []
        },
        {
            "author": "robinc123",
            "body": "My partner is autistic! They r the one who figured out I have ADHD. After I had a meltdown over losing my wallet last week they quietly sat down next to me and asked me to get assessed.",
            "score": 4,
            "replies": [
                {
                    "author": "ecodrew",
                    "body": "Interesting. My wife was getting help for anxiety and pointed me towards something maybe going on with me too (she worded it better, but my memory sucks). Went to a therapist myself - and, ADHD.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Purple_Silver_5867",
            "body": "My husband and I have been together for 16 years but we recently found out 3 years ago that I have adhd and autism and then we understood he was on the spectrum too so he got his diagnosis last year. So we unknowingly found a person on the spectrum 🤷",
            "score": 2,
            "replies": []
        },
        {
            "author": "ChartreuseZebra",
            "body": "My spouse has big unacknowledged ASD signs but doesn't believe that ASD or ADHD are legitimate diagnoses so that's working out great.",
            "score": 2,
            "replies": []
        },
        {
            "author": "jerenstein_bear",
            "body": "My partner is autistic 🙋",
            "score": 2,
            "replies": []
        },
        {
            "author": "spacerobot33",
            "body": "My husband is autistic, I have been diagnosed with ADHD. (But I also might have a bit of the autistic spice myself, not fully diagnosed on that though.) We have been together for 18 years married for 7. We were diagnosed during covid.\n\nIt is an amazing + struggle bus chaotic adventure for each of us individually and together. But I would not choose anyone else. Some of my friends are also diagnosed with ADHD",
            "score": 2,
            "replies": []
        },
        {
            "author": "dirk_funk",
            "body": "my wife thinks she is. but it doesn't seem to be the funny or adorable kind of autism that some of the people commenting here mention. it is more of a complete inability to empathize combined with an extreme amount of entitlement toward being empathized with.",
            "score": 2,
            "replies": [
                {
                    "author": "No-More-Rubbish",
                    "body": "I think people with autism are actually extremely empathetic, bending over backwards to try and please everyone and do things \"right\". That's what I have experienced with my partner anyway. They might not get social cues or understand the subtleties of language and that can cause a lot of confusion and hurt, but it's not intentional on their part. The thing I found really helped us was couples therapy and learning how to communicate with each other effectively. Once those doors opened, we could let go of some of the hurt and understand one another better, it is like night and day, we barely argue at all.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheFatPurplePenguin",
            "body": "My husband and I both are diagnosed with ADHD. I’m pretty sure my husband has Autism or even AuDHD. Just like u/rufflayer said, he’s been peer reviewed.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Theseus_The_King",
            "body": "Both of us are auDHD!",
            "score": 2,
            "replies": []
        },
        {
            "author": "saddbabydadd",
            "body": "I did an autism questionnaire for my kid, and realized my partner checked so many of the boxes 😅 ten years in, you'd think I would notice loool",
            "score": 2,
            "replies": [
                {
                    "author": "PaleontologistNo858",
                    "body": "No because that happened to me too, l didn't really realise my husband was autistic until l'd finished being busy with the kids and work etc, only when they all left home and l got diagnosed with ADHD and was talking with a psychologist about him , then it became obvious he was on the spectrum.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "drallace",
            "body": "my husband is diagnosed adhd and i am diagnosed adhd but suspecting audhd now that i am medicated and see more autistic traits present with the adhd being medicated…we are best friends and inseparable lmao",
            "score": 2,
            "replies": []
        },
        {
            "author": "Empty_Plankton_7",
            "body": "My partner is autistic. I suspect that in addition to ADHD, I am also autistic. Our autistic power is very powerful together",
            "score": 3,
            "replies": []
        },
        {
            "author": "100SacredThoughts",
            "body": "My fiancé is probably autistic, hes in diagnostic waiting line right now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fun-Cryptographer-39",
            "body": "My sister (undiagnosed ASD but all of us are ASD so unlikely she's not) is engaged to a guy with ADHD. I'm AuDHD myself, don't think any I've dated were diagnosed either way tbf, but most of my friends are on the ASD and/or ADHD spectrum.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wise_woman_1",
            "body": "I could see why two people who think similarly and gave similar struggles would be drawn to each other. The differences (lack of taking in social cues vs over aware of them) could also be a benefit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Becks5773",
            "body": "Yes, it’s actually quite common. Not only was my first husband autistic but turns out so are my best friends. My kids are combos of the two. My adhd daughter’s husband and besties are all autistic. Something about the black and white and predictability of autism works with our hamster wheel brains.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SquirrelEnthusiast",
            "body": "My partner is. It works. It's like where I fall off he picks up and vice versa.",
            "score": 1,
            "replies": []
        },
        {
            "author": "HeyPartyPeopleWhatUp",
            "body": "I am dating someone now who is diagnosed with autism.\nAnd looking back, I think all of my previous serious partners may have been undiagnosed audies 😅",
            "score": 1,
            "replies": []
        },
        {
            "author": "moerker",
            "body": "Ex got her Audhd diagnosis a few weeks ago.   \nOn dating apps i have 90% matches with ADHD ppl. Diagnosed or undiagnosed  :D",
            "score": 1,
            "replies": []
        },
        {
            "author": "IslandOrganic5637",
            "body": "i am the one on the spectrum & my partner has adhd lol very common",
            "score": 1,
            "replies": []
        },
        {
            "author": "seaskyroisin",
            "body": "I'm audhd and my husband is inattentive so.. I guess he's with me? Lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "bigblackkittie",
            "body": "i am!! he is a lovely lovely man",
            "score": 1,
            "replies": []
        },
        {
            "author": "Puzzled_Vermicelli99",
            "body": "Yup. I’m Audhd, husband is Autistic. I was ADHD dx when we met, then ASD later. He was just dx Autistic and now everything in our life makes sense.",
            "score": 1,
            "replies": []
        },
        {
            "author": "preaching-to-pervert",
            "body": "Married to AuDHD - an old, undiagnosed one. But he is for sure AuDHD :)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ranku_Abadeer",
            "body": "My wife and I both have AuDHD. Thankfully our symptoms present in a way that we both understand each other better than we do pretty much anyone else.",
            "score": 1,
            "replies": []
        },
        {
            "author": "83Isabelle",
            "body": "☝🏻",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nebulous2024",
            "body": "Me probably. He's not diagnosed, but I'm pretty sure he's on the spectrum.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ashoncouch",
            "body": "my boyfriend is slightly autistic, and i think it just goes really well together. he is very understanding of my symptoms and it’s one of the things he’s really interested in, so he has been a great help in me figuring out how to deal with it, get doctors, etc. our communication is slightly rough sometimes, as i am more unintentionally closed off and he can read my language wrong, but overall i think it was a great pairing because we understand how these affect our own lives and how to help the other one out in those areas the best",
            "score": 1,
            "replies": []
        },
        {
            "author": "ewhit78",
            "body": "Married 5 years - both of us. Wouldn't have it any other way.",
            "score": 1,
            "replies": []
        },
        {
            "author": "blauerschnee",
            "body": "20 years back, me with undiagnosed ADHD and she probably autistic. It lastet 7 years.",
            "score": 1,
            "replies": []
        },
        {
            "author": "B00-Ima-Ghost",
            "body": "Me me!",
            "score": 1,
            "replies": []
        },
        {
            "author": "LCaissia",
            "body": "I'm level 1 autistic. I was also diagnosed with autism in childhood. Relationships are beyond me",
            "score": 1,
            "replies": []
        },
        {
            "author": "Familiar-Virus5257",
            "body": "I have ADHD (diagnosed, possibly Autism) and my husband has Autism (diagnosed, possibly ADHD).",
            "score": 1,
            "replies": []
        },
        {
            "author": "reddit_custard",
            "body": "We tend to find and stick with each other since we have a much easier time relating to one another. I didn't find out I had ADHD/possible autism until my late 20s, but I already had several friends with ADHD and a couple with autism. Even thinking way back to who I was hanging out with at recess it was the same deal. Here's hoping I find my autistic baddie soon lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Either-Celebration48",
            "body": "I am not but I wanted to share my experience. I had like 1 crush in my whole life and this person is autistic. I also noticed that I am more attracted to people who are autistic. Maybe it's the part in me which craves direct communication which is provided by them. They also seem to be so much more in touch with their emotions , which i think is a very attractive quality too. Also they are always ready to listen and they might not always say the right things but with feedback they do great.\nHopefully I will marry someone like that so they get my struggles.",
            "score": 1,
            "replies": []
        },
        {
            "author": "my_little_shumai",
            "body": "Married to my husband with ASD/lvl 1. Figured it all out after our child’s diagnosis but I always knew something was there…",
            "score": 1,
            "replies": []
        },
        {
            "author": "beachpellini",
            "body": "I'm ADHD, my partner is AuDHD. She's mentioned that I tend to exhibit enough tendencies that I might be on the low end of the spectrum as well, though 🤔",
            "score": 1,
            "replies": []
        },
        {
            "author": "JetSpeed205",
            "body": "Lol me and my lifelong partner are both severely adhd but we compliment each other so well and help look after each other 😆",
            "score": 1,
            "replies": []
        },
        {
            "author": "Midnight_tater_tots",
            "body": "I’m adhd and my wife is autistic 🙋‍♂️ Makes some things easier snd others reeeeeeally hard lol.",
            "score": 1,
            "replies": []
        },
        {
            "author": "International-Emu-55",
            "body": "Married to a wonderful full fat AuDHD and loving it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ClydeV1beta",
            "body": "Nuerospicy people flock together. Every partner I've had has been on the spectrum 🤷‍♀️",
            "score": 1,
            "replies": []
        },
        {
            "author": "StormzysMum",
            "body": "My love is ADHD (he was diagnosed as a child) and we think I’m undiagnosed.  I think he’s pretty together considering his issues, we are not so sure about me 🤦🏼‍♀️",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lazy-Particular3093",
            "body": "My parents. \nBoth are undiagnosed because of cultural issues, but my sister and I have our ASD and ADHD diagnosis, and we see the same things in them.\nMom is ASD and dad has raging ADHD.\nThey have the healthiest, most loving marriage out of all the family members in their generation.",
            "score": 1,
            "replies": []
        },
        {
            "author": "maggie250",
            "body": "I'm ADHD (diagnosed 4 months ago) and he's likely autistic (undiagnosed), possibly some adhd. I didn't know this when we started dating. \n\nHe is a wonderful partner. He loves me and all my quirks, and I love him and all his, too. We've gotten to a point where we understand and respect each other's needs/ways for communicating. \n\nIt feels amazing to be my odd self and be totally accepted without judgment.",
            "score": 1,
            "replies": []
        },
        {
            "author": "smudgethomas",
            "body": "Dating. Still early days but it's definitely the least effort I have ever had to put in to have a good relationship.",
            "score": 1,
            "replies": []
        },
        {
            "author": "more-le-gore",
            "body": "I've dated 2 guys and when I myself got my AuDHD diagnosis, I noticed that both of them were/showed adhd/ spectrum traits. I am now in another (the best so far) relationship and my man is fully aware that he's autistic af. He's also told me about some of his issues and behaviors that are akin to my ADHD bullshittery. I also subconsciously get along with people who have these conditions like it's some weird selection my brain does.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Frisk1123",
            "body": "I am autistic.  My husband has ADHD.\n\nI have severe social anxiety.  My husband is an expert at social situations and he is my social situation translator.\n\nI have a sound processing disorder where I become easily overwhelmed when there are too many sound sources or sound reverberations.  My husband has extremely fine hearing.\n\nI have a visual processing disorder - it takes me a *very long* time to visually process a scene.  My husband's visual processing is out of this world - he has the widest peripheral vision of anyone that I have ever met.\n\nI am very good at math.  My husband hates math with a passion.\n\nI stim with my hands and by bouncing on the balls of my feet to music.  My husband stims by rocking forward and backward while sitting or by chewing his fingernails.\n\nWe both have terrible executive function issues and we both cope with very strong coffee.  However, I take my coffee hot and my husband likes iced coffee.\n\nWe often joke that were are total opposites of each other and we both acknowledge that opposites attract \\^.\\^",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kwazy-Cupcakes",
            "body": "I'm diagnosed with ADHD, but strongly suspect that I'm AuDHD... I'm willing to bet our house that my hubby is AuDHD as well.\n\nMy sister is autistic, and we (me and her) are convinced her partner has ADHD. Him and my hubby get on like a house on fire 😂",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fire_enchanter87",
            "body": "My husband and I both have ADHD, both his sons have autism. Husband is possibly on spectrum? It’s awesome, messy but awesome",
            "score": 1,
            "replies": []
        },
        {
            "author": "FrugalBastard187",
            "body": "Yes. And 4 of our best friends are also in Adhd/aut couples.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BunnyAfricanGuy",
            "body": "I'm diagnosed Adhd and unofficially on the autism spectrum (both my mental health professional and psychiatrist agree on it, just haven't gotten an official test) and my gf is diagnosed adhd. I'd say we're doing pretty well but my social issues and tendency to isolate can strain things some times.",
            "score": 1,
            "replies": []
        },
        {
            "author": "eat-the-cookiez",
            "body": "Yep. I’m audhd and husband is adhd \n\nThe autistic part of me doesn’t like his adhd messiness or unfinished tasks.  It’s where we clash",
            "score": 1,
            "replies": []
        },
        {
            "author": "Metal_Fairy_Princess",
            "body": "I'm diagnosed with adhd and my partner is autistic, I didn't get my diagnosis until 3 ish years into dating, he was diagnosed as a child. My partners close friend found out she is autistic at 23 and she was and still is dating someone with ADHD. I think we just have a way of finding each other! 😂",
            "score": 1,
            "replies": []
        },
        {
            "author": "ranmachan85",
            "body": "My wife is not, but 3 of my best friends are autistic, and my son too. I feel like I'm more connected with my son because he's autistic. My autistic friends and I were talking about why we get along so well and one reason we agreed on was that they and I (I'm just ADHD) don't feel the pressure to mask our personalities around each other. For very different reasons, my friends and I will stim, have challenges with everyday life things, and can express ourselves in ways we've learned to police around others. So I think hanging out with each other is more relaxing. I'd imagine with your partner, it's a better relationship when you don't have to worry so much about masking things that make you you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mothra712",
            "body": "Wow so many people! I'm adhd woman with autistic husband! We have diagnosed ourselves long time after we met. That should be opinion in dating app 🤣",
            "score": 1,
            "replies": []
        },
        {
            "author": "torpac00",
            "body": "both of us are both, me being a little more “both” 😂",
            "score": 1,
            "replies": []
        },
        {
            "author": "LetReasonRing",
            "body": "I hablve ADHD and I'm not partnered with one, but virtually all of my friends are ADHD, autistic or both.\n\nThe funny thing is, I came to be friends with almost all of them long before any of us were diagnosed and I eventually started realizing that I seem to have a pretty specific kind of person I get along with really well.",
            "score": 1,
            "replies": []
        },
        {
            "author": "YourMominator",
            "body": "Late diagnosed ADHD-C at age 58, hubby never diagnosed but if I've ever seen a person with autism it's him. This weekend we are celebrating 33 years together. Our best friends are a couple where one is autistic, and the other is very introverted. We all understand each other, it's great!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cherry_Honey_Blossom",
            "body": "lol. I have ADHD, and the love of my life has Autism. He is absolutely brilliant, and so beyond talented. Plus, he is a literal genius. It’s not even me being biased either, but even if he wasn’t the most talented at his craft, which he is, I would still be his biggest cheerleader. 📣 I am his biggest fan, and he is my biggest fan too. There are literally millions of people competing for that spot, but it is mine. He is mine, and I feel so blessed! 🥲",
            "score": 1,
            "replies": []
        },
        {
            "author": "peeaches",
            "body": "pretty sure im on the spectrum at least a *little* bit and after a few years of being with my wife we're pretty sure she's adhd too lol\n\nwe all tend to stick together for some reason",
            "score": 1,
            "replies": []
        },
        {
            "author": "King_Dead",
            "body": "We're both audhd lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "PeregrineTopaz06",
            "body": "My husband and I have been together for over 20 years. Both with late diagnoses of autism and ADHD, respectively.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Historical_Ad5200",
            "body": "My friend and her boyfriend!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sewer_salami_6000",
            "body": "I'm somewhere between ADHD and autism (and lets throw tourrettes in there - gotta catch 'em all)-- and my partner is hyperactive adhd. She's the talker, I'm the Spock-like buzzkill,  it's like a damn sitcom over here. We both get hyperactive at different times of day and it usually doesn't line up, but when it does align, we're prone to impulsively starting a big creative project we'll never finish, singing random made up songs, and living in a blissfully goofy state.  Sure, the house is a mess, sure we misundertand each other, and SURE we can both get heated about stupid shit. But, we both have giant bombastic physical sense's of humor, we talk in tangents and stories, if one person doesn't remember a conversation, it's never taken personally; we just get each other and that's nice. I was previously married to a very orderly, moralistic person and holy (insert your god here) it's a night and day difference. Never having to feel guilty for simply existing has been the best thing that's ever happened to me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "shouldstoplurking",
            "body": "My wife AuDHD, and I, ADHD, have been together 24 years. \n\nI was diagnosed late, just a year ago. My wife has always known about her ADHD, but we discovered her Autism recently. The realization came as a result of our middle child being diagnosed with autism. \n\nThe relationship isn't without its challenges. My wife's sensory issues relating to touch, and my RSD have been a bad mix in the past. \n\nAs with any relationship, communication is above and beyond the most important thing. Being understanding of your partner's limitations and triggers will help you navigate life together. \n\nUltimately my wife and I have grown and learned together. We are able to share compassion for each other's struggles with greater understanding and empathy due to your shared experiences. \n\nAt the end of the day us ADHD/Autistic folks tend to gravitate to each other. Who's better qualified to understand us than, well...us. learn about yourself and through your own journey discover understanding and empathy for your partner.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SenseiObvious",
            "body": "Yuppers.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SpiffyCabbage",
            "body": "I've sadly choen to stay single until I get proper coaching. I'm 45 now, been waiting 30 years, but hopefully on the 4th, I've finally vito'd enough that they might actually do it.\n\n  \nThe NHS here in UK only really cover the medication and partial psyciatriac help and that's it, but its a 2 fold thing where coaching is needed too.\n\n  \nAlot like a person missing a limb (traumatic in a different way), but we need it as we have parts missing that need propping up and need help doing that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PM_ME_UR_DaNkMeMe",
            "body": "Yup. Neither of us are diagnosed but, well, yeah. He's basically like, I don't fully understand your ADHD but I love your brain, I could just cry man hope is real\n\nWe do say what we mean, which is weird to me because I've always had anxiety talking to people but, others don't say what they think. maybe it's because we just have a lower tolerance for BS lol. Everyone has their limits &in this case it seems like a benefit. That being said I have to stay LOCKED IN into at least trying, or, visibly trying to be clear, which is good but was hard at first for sure\n\nI watched this YouTuber when I was struggling who was autistic with ADHD wife, married for years, they had kids. Literally as I'm emotional and trying to save my relationship watching him to cope, they fucking break up. Like video posted 8 hours ago divorced. Mine is great now but Jesus the timing on that KILLED ME LOL😭😭😭",
            "score": 1,
            "replies": []
        },
        {
            "author": "whereisbeezy",
            "body": "I believe my husband is.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Difficult-Tangelo236",
            "body": "My fiance has Asperger’s and I’ve found he’s very understanding of me and I’ve of him since we’re both more empathic  people. I also enjoy that we act like kids together without judgement.",
            "score": 1,
            "replies": []
        },
        {
            "author": "fritzkoenig",
            "body": "Right now I feel like I ain't got any spare time for dating",
            "score": 1,
            "replies": []
        },
        {
            "author": "sloshmixmik",
            "body": "My ex was autistic and in some ways I do wonder if our differing diagnoses was what, ultimately, caused our relationship to breakdown. I only say that because I’m now currently dating a man with ADHD and find it a lot easier (in that we have similar personality traits and annoyances). My autistic ex was very rigid and organised, was never late and was, I felt, inflexible to change. I’m more “laid back” and feel pressure when someone is asking ‘what’s the plan? When are we going? Where do we park?’ - it makes me feel frazzled and gives me anxiety. I’m a people pleaser and my ex was one of those people that was straight to the point and often came across as ‘rude’. My current ADHD bf is also a people pleaser and I find it easier to have him around my friends and family because I know he won’t come off as ‘rude’. \n\nAll this to say, my ex is still to this day my best friend, and someone I rely on a lot, after they got their autistic diagnosis and then I got my diagnosis we had a lot of ‘lightbulb’ moments of ‘ahhh, that makes sense why we never ‘fit’ right’. All in all, I find it easier to date my ADHD bf just because I’m also ADHD. So we don’t panic about being late, or being a bit messy, neither of us are rigid or super organised and so we understand each other better. We fly by the seat of our pants daily and that sort of mindset caused a lot of anxiety in my ex.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JadeBlueAfterBurn",
            "body": "i'm the Tism/ ADHD partner in all my relationships. I warn them beforehand too and they always think i'm joking or being funny till they see it for themselves. they either embrace it or run. either way. i'm fine.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Emotional-Box-6835",
            "body": "I am and almost all partners I've ever had have been.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fit_Possibility8496",
            "body": "AUDHD here, with an AUDHD partner neither of us knew we had ADHD or Autism when we met 😭",
            "score": 1,
            "replies": []
        },
        {
            "author": "Moonjinx4",
            "body": "My husband was diagnosed ADHD in his childhood. He helped lead me to my own diagnosis. I think we attract each other because we understand each other. “Ugh, I hate how I have to sit and pump myself up to get anything done.” “I know right?!” “The moment I sit down, I’m gonna run out of steam and will not be able to move for the rest of the day, if you want something done, tell me now.”\n\nAll real conversation snippets I’ve had with my husband that I didn’t think were unusual until I started researching my disability.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nyhkia",
            "body": "I have adhd and my husband were pretty sure is autistic with adhd. More spectrum of autism for him. We are a great match",
            "score": 1,
            "replies": []
        },
        {
            "author": "AnonymousScientist34",
            "body": "Haha I didn’t know that was a thing! But yes I’m ADHD and my bf is on the Autism spectrum!",
            "score": 1,
            "replies": []
        },
        {
            "author": "AnonymousScientist34",
            "body": "Only thing I’ll say that’s a negative is that my autistic bf has to know the “why” of everything so sometimes it feels like I have to convince him (not to use the same towel 7 days in a row, etc things that seem “obvious” to me) but communication is key and hard work. Been together 3 years can’t imagine life without him",
            "score": 1,
            "replies": []
        },
        {
            "author": "lhobs_",
            "body": "I have audhd and my partner is autistic.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Osmirl",
            "body": "Well the girl im currently seeing isn’t officially diagnosed but from my experience with autism (basically all my friends have it or adhd lol) im like 80% sure that shes on the spectrum too.\n\nSaw her pics on the dating app Boo and was like mh she doesn’t look great but a bit dorky…? \nIdk how i can see that someone might have autism from a picture but like that was the reason i wrote her in the app. Asked her about something vegetarian vs vegan and then later if she wanted to meet in discord and play something together lol.",
            "score": 1,
            "replies": []
        },
        {
            "author": "evypasketti",
            "body": "we’re both audhd \n\n\nit’s freakin awesome",
            "score": 1,
            "replies": []
        },
        {
            "author": "Chaosinase",
            "body": "My partner hasn't been diagnosed officially. But he's like text book. Also I'm pretty sure my type is autism looking back. No one else seems to understand me lol. I have ADHD and I actually question if I have autism as well but I'm a masking king apparently.",
            "score": 1,
            "replies": []
        },
        {
            "author": "D-1-S-C-0",
            "body": "Not me but my friend is married to a woman with autism and they're both in denial about it. They've mentioned people suggesting she has it like it's the most ludicrous assertion imaginable.\n\nExamples are she's extremely literal, blunt, gets overwhelmed in busy/noisy environments, and she controls their lives, including when and how they socialise, because things have to be exactly how she likes them or she feels anxious.\n\nThey're happy together and my friend's content having his life planned for him. I just don't understand why they ignore the obvious.",
            "score": 1,
            "replies": []
        },
        {
            "author": "stegosaurid",
            "body": "I (late-diagnosed ADHD) would bet a significant amount of money that my almost-ex spouse is on the spectrum, with a healthy splash of ADHD. \n\nIn hindsight, I can see how untreated ADHD/autism contributed to the marriage breaking down. I think we would have been much more forgiving of each other if we’d known we weren’t being deliberately messy/late/slow/rigid/disorganized/weird, etc. \n\nOddly, we’re now getting along better than we have in many, many years.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sorry-Two-6434",
            "body": "Together 12 years!! I’m officially adhd, he’s hasn’t been officially diagnosed though",
            "score": 1,
            "replies": []
        },
        {
            "author": "redpatcher",
            "body": "Yes",
            "score": 1,
            "replies": []
        },
        {
            "author": "thjuicebox",
            "body": "I suspect we’re both AuDHD but I think I reflect ADHD (and BPD/C-PTSD) traits more strongly and she reflects autistic traits more\n\nWe struggle because of our respective traumas and trauma responses but for the most part I think we have the most amazing dynamic and intuition for each other!",
            "score": 1,
            "replies": []
        },
        {
            "author": "IGotMyPopcorn",
            "body": "I am going to get downvoted to hell for this, but why is everyone now autistic?  Why is this now the new *social anxiety or literal thinking*?   Just my own observation, but it is really downplaying the challenges those with non-verbal and semi-verbal autism face.  I get it’s a spectrum, but that doesn’t mean everyone *has a touch of the tism*.\n\nI say this as the mother of a child with severe Autism who will never live on his own, let alone be in a relationship with someone.",
            "score": 1,
            "replies": [
                {
                    "author": "billymillerstyle",
                    "body": "I think it's like ADHD. A lot of people have always had it but now more people are learning about it and finding out that there's a reason they've always been different and had struggles. It's a good thing. It's getting less stigmatized and people are learning that it's not their fault, that there's a reason behind their struggle.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "IGotMyPopcorn",
                            "body": "People like my son are still very much stigmatized unfortunately.  This isn’t helping them at all.  It’s minimizing them.\n\nEdit:  Autism is classified as a Disability whereas ADHD is a neurodevelopmental disorder.  They are extremely different and have different levels of impact on both he individual and their families/ caregivers.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "justlurkingimbored",
            "body": "My husband has never been officially diagnosed but I am convinced (along with so many internet quizzes/articles) that he’s on the spectrum.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Upstairs_Ad138",
            "body": "Yeah! His autism nicely balances my ADHD. \nOne of our first arguments was because I rearranged the furniture while he was at work. Our most recent argument was about when \"now\" was in the context of a conversation. 😆😆\nHe's probably why I don't live in van with a cult because their robes are glittery.\nBALANCE!",
            "score": 1,
            "replies": []
        },
        {
            "author": "RSG337",
            "body": "Haha me!",
            "score": 1,
            "replies": []
        },
        {
            "author": "mrjowei",
            "body": "Me. It seems I always had a type. That type was autistic.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kooky-Tap-7529",
            "body": "If you're a heterosexual female this will be approx 100%",
            "score": 1,
            "replies": []
        },
        {
            "author": "Octoblerone",
            "body": "I am the adhd'er married to the autistic. Most of my friend's are also autistic. I'm almost always party face. It's like being the avatar, suspended between two worlds, not totally fitting in to either one.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Master_Zombie_1212",
            "body": "My partner is on the spectrum. I have ADHD so we seem to work well together.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jleahul",
            "body": "I've definitely got my suspicions about my wife. She's extremely literal, blunt, and has absolutely no sarcasm detection.\n\nMy favorite was when I told her she was \"my lobster\". She didn't get the Friends reference, so I explained that on the show they call each other their \"lobster\" because, supposedly, lobsters mate for life.\n\nHer response? \"Well I find that highly unlikely! Their brains are miniscule!\"\n\nI married Amy Farrah Fowler and I couldn't be happier.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sufficient_Excuse_81",
            "body": "My husband was diagnosed with ADHD back in 2017 when we were dating. I was diagnosed with ADHD in 2020 and then diagnosed with autism as well a few months ago in October 2024. I encouraged him to also get tested and he was diagnosed less than two months ago. So we’re both AuDHD 😬. A lot of our friends have ADHD and we have a theory that people with ADHD and autism are attracted to each other like moths to lights.",
            "score": 1,
            "replies": []
        },
        {
            "author": "The-Fanta-Menace",
            "body": "My ex was on the spectrum but pretty mild. We got a long great, sex was amazing… I bounced cause of her drinking, had nothing to do with either of our mental health issues.",
            "score": 1,
            "replies": []
        },
        {
            "author": "The-Fanta-Menace",
            "body": "Is ADHD + Autism the new chocolate + peanut butter? \n\nSeems like it could be a wonderful combination…",
            "score": 1,
            "replies": []
        },
        {
            "author": "CarbonAlpine",
            "body": "My wife is.",
            "score": 1,
            "replies": []
        },
        {
            "author": "underw0rlder_",
            "body": "my husband is on the spectrum and I’m ADHD! bestie for the restie and love of my life for almost 8 years ❤️",
            "score": 1,
            "replies": []
        },
        {
            "author": "BurntRussian",
            "body": "My gf has not been officially diagnosed, but her therapist believes she has the tism. We started suspecting it a few years back. I was also undiagnosed back then but I do have an official diagnosis.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThenCryptographer477",
            "body": "My partner is ADHD and autistic. Diagnosed with ADHD as a child but only just diagnosed as autistic this past year. And I got diagnosed with ADHD about a year and a half ago. I've also been thinking of going to get tested for autism myself.\n\nBeen together for 12 years now and we had a very very rocky start because of course I didn't know I had ADHD back then and I didn't really understand what it was or what it meant to have it. And my partner didn't know they had autism back then or what it meant to have that.\n\nOver the years we learned and became more patient and tolerable of behaviors now that we both know that those behaviors can't always be helped and aren't either of our faults. We are in a great place now but I still wish we knew back then, what we know now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gingiwinz",
            "body": "I'm diagnosed, my parents are not, but I've peer reviewed them and I'm pretty sure my mum is adhd and dad is autistic. They make a great couple mostly",
            "score": 1,
            "replies": []
        },
        {
            "author": "YourMomTheNurse",
            "body": "Neither one of us had any idea about any diagnoses until we were in our 50s, but I have always said that he brings stability to my life, and I bring excitement to his.",
            "score": 1,
            "replies": []
        },
        {
            "author": "chaotixinc",
            "body": "My husband is autistic and another ADHD person I know is married to someone with AuDHD so yeah, it seems common",
            "score": 1,
            "replies": []
        },
        {
            "author": "Impossible_Dog7335",
            "body": "I’m Autism heavy AuDHD and my partner is ADHD heavy AuDHD. It works 😅",
            "score": 1,
            "replies": []
        },
        {
            "author": "chowdan131",
            "body": "ADHD here, wife and been together for 15 years and she's my life partner.\n\nShe's unofficially diagnosed auADHD - 31 years to get to this point and ongoing of figuring it out. \n\nIts brought a lot of clarity so far and been very helpful",
            "score": 1,
            "replies": []
        },
        {
            "author": "psykezzz",
            "body": "Yup, I’m adhd with a side of au and she’s au with a side of adhd.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Character_Spirit_424",
            "body": "I (diagnosed with ADHD) am engaged to a man who is diagnosed autistic, but I have suspicions we are both AuDHD",
            "score": 1,
            "replies": []
        },
        {
            "author": "flying_samovar",
            "body": "Yes my husband is autistic, and I think we complement each other very well. It's like our dysfunction lines up - he is good at things I am not, I am good at things he is not. We give each other space to do the things we are good at doing. Together we make one functional adult lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "relative_void",
            "body": "My husband was diagnosed with autism shortly before we started dating and I got my ADHD diagnosis shortly after. Since then he’s also been diagnosed with ADHD and we’re pretty sure at this point that I’m also autistic lmao",
            "score": 1,
            "replies": []
        },
        {
            "author": "zombienomms",
            "body": "Adhd/asd and married to an adhd haha",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alternative3lephant",
            "body": "I am the AuDHD partner",
            "score": 1,
            "replies": []
        },
        {
            "author": "Quinlov",
            "body": "I think most gay couples are like this",
            "score": 1,
            "replies": []
        },
        {
            "author": "psychedelic_owl420",
            "body": "My partner got the ADHD diagnosis in the year I was born and they were the reason I got diagnosed (another comment mentioned peer-review, which is oddly fitting). After two years of relationship, I also got diagnosed with autism.\n\nCalmest, most stable and respectful relationship I've ever had!",
            "score": 1,
            "replies": []
        },
        {
            "author": "HooverMaster",
            "body": "I'm dating someone on the spectrum. She has it in her family and her mannerisms are dead on",
            "score": 1,
            "replies": []
        },
        {
            "author": "rnarynabc",
            "body": "I’m AudHD and my partner is ADHD.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DawnaldDuck92",
            "body": "Adhd as fuck. Autistic partner. Not the first autistic partner I've had, but I've been with this one for some time and we live together, so I think they probably want to keep me. \n\nThe only non-regretable relationships I've had have always been with someone autistic. It is definitely a trend imo",
            "score": 1,
            "replies": []
        },
        {
            "author": "Eyesontheprize_178",
            "body": "This might be my favourite thread on all of reddit 🥰",
            "score": 1,
            "replies": []
        },
        {
            "author": "Inevitable_Tell_2382",
            "body": "I have adhd, married to a guy with mild OCD, son has adhd and aspergers.   It's all in the genes, baby!  But I would not swap either of them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "godzillabobber",
            "body": "My wife is likely on the spectrum. We work together and it's a great match. She tends to be ocd and a great organizer. I do the creative stuff. She is the most mildly affected of her three siblings.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ISUCKMOMMYTHIGHS",
            "body": "My gf got ADD diagnosed, but suspects to also have autism.\nNever had better communication with anyone.\nShe is so smart and sensitive and I love listening to her. She always explains me stuff about history (her studies). \nWe've been together for almost 3 years now and I think thats because of our clear communication.",
            "score": 1,
            "replies": []
        },
        {
            "author": "spinningnuri",
            "body": "I'm AuDHD, husband is ADHD. We just get each other so well.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TerribleBread1964",
            "body": "I have adhd, my husband has autism. I wouldn't have it any different 💜",
            "score": 1,
            "replies": []
        },
        {
            "author": "leavethegherkinsin",
            "body": "Not that she'd admit it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Calm-Divide184",
            "body": "my partner and i both have both, on different places in both spectrums!! it’s chaotic and kind and safe and fun!",
            "score": 1,
            "replies": []
        },
        {
            "author": "CrazyProudMom25",
            "body": "ADHD agender person married to an autistic genderfluid person for seven years, started dating twelve and a half years ago.\n\nWe couldn’t be happier. We communicate well, because that’s always been one of our top priorities. We hardly even argue. The closest we get to arguments is bickering over fictional characters.\n\nWe also have complimenting strengths, I’m better at coming up with plans, they’re better at follow through. They’re good about the chores I’m not, and when I’m having a hard time with phone call anxiety; they’ll sit with me and make the call.\n\nAlso we can ramble to each other for hours and then happily let the other ramble, it’s so much fun to be that way.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Important-Emotion-85",
            "body": "My wife is autistic",
            "score": 1,
            "replies": []
        },
        {
            "author": "BothOrganization6713",
            "body": "I was wondering this myself! I’m adhd, he’s the one with autism.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Money-Lifeguard5815",
            "body": "My spouse and I have been together for over 5 years. I’m pretty sure we’re both AuDHD and I couldn’t be with someone who wasn’t. My only other relationship that lasted more than 4 months was my ex of 10 years who was diagnosed ADHD, but I suspected AuDHD, especially when considering his parents, who are amazing people.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Narciiii",
            "body": "My husband suspects he is autistic. His dx is next on our list.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MaxScar-",
            "body": "I'm dating someone on the spectrum. Hopefully married in the near future. \n\nPerson on the spectrum, not \"an autistic person\".",
            "score": 0,
            "replies": [
                {
                    "author": "druunavt",
                    "body": "Most autistics, myself included, prefer identity first language—I’m autistic—not a “person on the spectrum.” Some of us, myself included, also dislike “on the spectrum” as it feels like a euphemism rooted in ableism.\n\nI’m AuDHD and so is my partner.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "Frisk1123",
                    "body": "I am autistic.  I'm great with being referred to as:\n\n\\-person on the spectrum  \n\\-autistic person  \n\\-the autist  (this one is my favorite)  \n\\-person with the ASD condition  \n\\-the person with autistic spectrum disorder  \n\\-the person on the autistic spectrum\n\nand just about any combination you can think of along these lines.  This is because either way you have said it, you have directly acknowledged my source of *weirdness* and that makes me feel safe.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Eyesontheprize_178",
                            "body": "Having a creative streak and a fair dose of geeky, I’m going with ‘Autist’ when I get my (pending) Dx  Just love it. Nice one 🙌",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "HeyPartyPeopleWhatUp",
                    "body": "Hey, I dont want to seem ignorant, but I'd rather seem that way than stay that way.\n\n\nWhat is the difference? ",
                    "score": 5,
                    "replies": [
                        {
                            "author": "MaxScar-",
                            "body": "One is claiming that person as being autistic vs. being a person-first who happens to have autism. Identity- first vs person- first. This is a relativity new change. The idea is to humanize them instead of placing them in the handicapped basket. I've been on numerous classes recently in order to become a DSP. So this is the politically correct way to say it. Now, my boyfriend is 33, so older and used to the old terms, and says he doesn't care either way. I would stick with the safe way vs assuming they won't be disrespected.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Cold-Print4626",
            "body": "My sister says everyone has autism or are somewhere on the spectrum",
            "score": -1,
            "replies": [
                {
                    "author": "LCaissia",
                    "body": "Your sister is absolutely right at the moment. Everyone seems to be claiming to have autism these days and many of them do not meet the diagnostic criteria. It's ridiculously easy to purchase an autism diagnosis a the moment. My sister purchased one for my niece. It cost her $1500 and the whole assessment was conducted via telehealth and a few online questionnaires. The 'assessor' never even met my niece and spoke only to my sister. My niece has age appropriate social skills and friendships. She only yantrums when my sister does not limit her screen time. That's not autism. My sister just wanted NDIS - self managed, of course. My GP told me that she is now autistic abd claims that women don't meet the diagnostic criteria because autism presents differently in girls. I'm female. My autism was diagnosed in childhood. If autism presents differently in girls then I should have the 'female' type, too. So yes, at the momebt everyone does have autism since it seems acceptable that anyone can have it if they want it.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}