{
    "title": "Why do some parents want to respond to adhd traits in a verbally or physically abusive way?",
    "author": "HardAlmond",
    "subreddit": "ADHD",
    "rank": 56,
    "score": 56,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 51,
    "url": "https://www.reddit.com/r/ADHD/comments/1in6int/why_do_some_parents_want_to_respond_to_adhd/",
    "id": "1in6int",
    "selftext": "This is one of the main things that horrifies me about undiagnosed (or even diagnosed ADHD) a lot of the times, especially in countries like Japan or South Korea. There’s a lot of people who think that responding to a child’s poor planning, procrastination, or bad grades in a way like “good job, you f*cked it up”, “I’m not going to say your name anymore, moron would be better”, or the belt/paddle is somehow okay or even honorable.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/HardAlmond and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Interesting-Help-421",
            "body": "Because it’s seem as a behavioural issue that needs firm parent and there is a lack of understanding. That how my principal in grade 3 (1992 ) views my AuADHD traits \n\nHow many people on this sub  went through frankly abusive conduct at either home or school because they were undiagnosed? \n\nI was subject to restrains and isolation rather than treatment because I was undiagnosed and things were not understood . \n\nIt’s that simple it’s not viewed as real or understood .",
            "score": 65,
            "replies": [
                {
                    "author": "Pitiful_Gap4427",
                    "body": "Absolutely,  beaten senseless by dad . And still no understanding of the disorder. I cut my family off today. 30 years of it and I'm done.",
                    "score": 29,
                    "replies": [
                        {
                            "author": "Interesting-Help-421",
                            "body": "terrible I so sorry",
                            "score": 11,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "unkn0wnNumbr",
                    "body": "Yeah the amount of time I spent isolated or ostracized by teachers just for being myself is insane. They presumed I was acting with malice or something, like, no bitch I feel like I'm holding my breath when I try to just sit still and concentrate, let me breath damn",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "Impossible_Office281",
                    "body": "even after i was diagnosed i experienced it. my adhd traits have been met with “what the f is wrong with you” and calling me a pig since i was old enough to talk.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "GoldieDoggy",
                            "body": "🫂",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "jsteele2793",
                    "body": "I was diagnosed at 7 and I STILL got the ‘why are you so lazy!’ ‘Why don’t you just act more like so and so’ diagnosis is definitely a long way off from understanding. It’s so frustrating.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "xithbaby",
                    "body": "I was just ignored. I was the youngest of 4 and my dad put me in front of a computer (Im 42). Teachers basically gave up on me. I couldn’t do math or retain information, I was considered a problem child and was bullied relentlessly. I had to “turn the other cheek” and watched my bullies get away with it. I snapped at 13 and became violent, ended up dropping out of school and the rest is history.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok_Stable4315",
            "body": "Grew up with a tiger mom, was beaten until I was 10 and my sister was probably 14. Left me with PTSD, was diagnosed with severe depression in end of high school. Got later diagnosed with ADHD at 27/28 and she still couldn’t understand what it was and asked when I’ll be off meds. Ended up in psychosis 2020 as Covid hits. After she seen me in psychosis she found comfort in saying I have ADHD now lol. ",
            "score": 23,
            "replies": []
        },
        {
            "author": "Potat_Dragon",
            "body": "I was frequently grounded, yelled at for hours, and in some cases just purely emotionally attacked and abused for my character as a person when I would come home with Fs from the moment homework became a thing. \n\nI was a model student in regard to how I behaved, my exams, and did everything asked of me AT school (beyond full attention). Yet somehow I was this lazy and stupid POS that was going to be “a whore popping out as many babies as possible to just cash in on government checks so I can be as lazy as possible” (actual attack when I was ELEVEN)\n\nI sunk pretty hard into depression in general because of other abuses but those interactions were a core part of my self view for a long time.\n\nI wasn’t diagnosed till 31 so not a single adult during those years bothered to wonder if there was a reason. (Then again they also ignored all the signs of abuse too)",
            "score": 24,
            "replies": []
        },
        {
            "author": "biglipsmagoo",
            "body": "This is such a nuanced question and I bet there are a million different answers. \n\nSome parents are abusive, narcissists, sociopaths, etc. Some parents have their ego tied to their kids and take everything personally bc you *must* bc trying to hurt them when you fail. \n\nSome of it is cultural. Some of it is pressure. Some of it is fear bc a parent is scared their kid will suffer. Some of it is low emotional IQ. \n\nSince we now know that ADHD is hella genetic, and Dr. Barkley has stated that if a kid is dx then the parents should be screened, we can also assume that the traits in ADHD kids are the traits that parents hate about themselves and it “triggers” them.\n\nNo matter the cause it’s never OK to abuse a child.",
            "score": 22,
            "replies": [
                {
                    "author": "CorgiKnits",
                    "body": "It’s also possible the ‘flavors’ of ADHD are incompatible. I had a student with ADHD playing with something today. It was harmless, it was in an elective that’s really chill, and normally I wouldn’t care. But it was big, so it caught my eye constantly, and it was making a noise all the time. I finally called him over and told him he had to stop, or move to the back of the room, out of my immediate eyesight. Nothing wrong with what he’s doing, and I’m sure he’s using that thing as a fidget toy and it’s really soothing to him, but it’s driving MY ADHD up the freaking wall.\n\nDeep inside, where I’ve learned control thanks to years of therapy, the ADHD-rage I feel sometimes was simmering because what he was doing was overstimulating me, even though it was small and stupid.\n\nI can imagine a parent who’s got their own issues with their own behavior, plus that overstimulation meltdown that makes no sense, freaking out over normal ADHD behaviors and sometimes not even understanding way. (Reason, NOT excuse.)",
                    "score": 12,
                    "replies": [
                        {
                            "author": "literal_moth",
                            "body": "Yes, absolutely. This was definitely an issue with my dad who without question had undiagnosed ADHD. He did not abuse us, but he’d frequently snap at my sister and I for being loud/running around the house/leaving our toys everywhere, and now as an AuDHD parent with Au/DHD kids myself, I strive to do better but I completely understand how constantly overstimulating it is.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "lurker99123",
                    "body": "Worth noting, we're also more likely to have a narcissistic parent because of genetic overlap/comorbidities. Or a parent with unmedicated BPD rage issues for the same reason. My mother had both and possibly adhd, my audhd father was attracted to her. I've noticed this \"audhd marries narcissist\" combination is surprisingly common...",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "beautyfashionaccount",
            "body": "Aside from the fact that it's seen as a behavioral issue, a lot of people with ADHD have undiagnosed ADHD and/or autistic parents who have spent their lives masking and carrying a deep sense of shame about it, and seeing the same traits in their children is triggering. That on top of the fact that a lot of them never actually learned how to regulate their emotions and triggers, just suppress them, and you get a lot of emotional abuse. Some of them are exhausted from masking all day out in the world and feel entitled to unleash at home - the attitude that \"If you love me, you'll accept my quirks\" but the quirk is being abusive when they get overwhelmed or neglectful when they don't have the cognitive capacity to manage parenting on top of their other responsibilities. Or the parents don't have any disabilities themselves but carrying trauma from their own dysregulated ADHD/autistic parents and associate those traits with the abuse they experienced.\n\nPeople without ADHD might be casually ableist most consistently but IME no one is crueler about my ADHD traits than an undiagnosed person struggling with internalized ableism when they really do lash out.",
            "score": 20,
            "replies": [
                {
                    "author": "TinyAd1924",
                    "body": "That internalized abelism is the worst",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "TinyAd1924",
            "body": "My parents beat me, until I was big enough to fight back--then they called the cops and had me arrested for not letting them hit me, without fighting back.\n\nI am a free range parent, that has never yelled at, or punished my children. My children have never been in trouble with the law, and all graduated at the top of their high school class, and are doing well in college/ a career. \n\nIt's not hard to be a parent--just don't suck",
            "score": 8,
            "replies": [
                {
                    "author": "-Kalos",
                    "body": "Parents who beat their kids just teach their kids that violence is the way to solve problems.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "beachpellini",
            "body": "It's definitely seen as a behavioural issue that needs to/can be fixed via punishment as opposed to a neurological diagnosis that needs treatment.\n\nThink of the usual characteristics of ADHD in the most unflattering way possible: lazy, unmotivated, forgetful, overly chatty *or* overly quiet...\n\nA lot of people think that things like this are a choice as opposed to symptoms of a deeper issue and treat it as thus. I've seen that most older folks tend to continually dismiss confirmed ADHD diagnoses as well.",
            "score": 8,
            "replies": []
        },
        {
            "author": "brettdavis4",
            "body": "Thankfully, my folks weren't abusive.  I probably got held to an unrealistic expectation.  \n\nI got grounded quite a bit for bad grades in high school.  When I got to high school, it was a rough time for me.  I had my social issues with my peers.  I also couldn't focus in class and it just seemed like everything was going too fast for me.\n\nThis always got my folks thinking that I wasn't trying hard or I was being lazy.  \n\nUnfortunately, back in the 90s, it was looked down upon to work with a therapist.  My folks could be excessively frugal, so due to it costing money they might not have wanted me to get therapy.  Another thing that sucked about having conservative parents, my folks might have thought the youth pastor was just as good as a therapist.",
            "score": 7,
            "replies": []
        },
        {
            "author": "ADHDK",
            "body": "Becuase they likely also have it, being it’s genetic, and they find outward displays of something they had beaten out of them and weren’t allowed to display triggering. They never learnt healthy coping mechanisms so don’t have healthy skills to hand down.\n\nThat’s why working to break the cycle is so important. Worlds going the other way though apparently with pride in regression.",
            "score": 7,
            "replies": []
        },
        {
            "author": "theycalledmechad",
            "body": "A lot of people, myself included, often immaturely and shamefully turn to such tactics as a coping mechanism when they feel hopeless frustration. They become blind to the person who has the disorder and focus inward on what they are dealing with, further harming the actual person struggling with the disorder. It's understandable, but still despicable. I have ADHD. As do 2 of my daughters. Sometimes I say the wrong things too. Nothing major, but I say things I shouldn't say.\n\n\"I asked you to clean your room 2 hours ago. What have you been doing?\"\n\n\"Sit still!\"\n\n\"Why aren't you turning in your assignments on time?\"\n\nI'm not abusive, but I still know better. I haven't broken the cycle... yet. I'm working on it.  I need to learn how to stop saying those things to myself first, though.",
            "score": 6,
            "replies": []
        },
        {
            "author": "midnightlilie",
            "body": "The problem is that in the short term this can work, stress hormones are stimulants\n\nThere's a cycle that starts with a kid telling you that they can't, the adult gets mad because the task seems trivial, the kid cries, and because they're so stressed the task becomes doable\n\nLong term it destroys the kids mental and emotional well-being.",
            "score": 5,
            "replies": [
                {
                    "author": "AdComprehensive960",
                    "body": "Yup. Went through that cycle WAY too many times",
                    "score": 2,
                    "replies": [
                        {
                            "author": "midnightlilie",
                            "body": "And as it goes on the kid stops communicating their limits to avoid being yelled at, but they still need some form of pressure to do the thing, so the adult keeps getting mad at the kid for not moving, which allows them to move",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Johhnynumber5ht2a",
            "body": "Hurt people, hurt people.  And cultural influence.  ADHD is heavily genetically influenced so odds are the parents who decide to parent this way are adhd themselves and raised in a similar manner.  Someone has to recognize it and break the cycle.  \n\nI am the youngest child, after being diagnosed at 40, the rest of my family realized they all have it too.  And it explains a lot.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ladyxhyper",
            "body": "My parents are immigrants who had no grasp or understanding on mental health. One of my siblings is mentally disabled. We grew up in a very violent household, with me taking the brunt of the beatings… including the ones meant for my brother, because I knew better and understood none of it was his fault that he didn’t understand. \n\nI’m 40 now. Got diagnosed last year. \nMy father and I are on better terms. He heard me out and when I told him I have been in and out of therapy for a good portion of my adult life I watched his entire body and demeanor crumble. \n\nMy father apologized to me. He also told me he knows now that the way he raised me was not correct, and he did not know better because … that’s literally all he knew. It wasn’t an excuse and he kept saying it isn’t (I know). That meant the world to me.\n\nMy mother on the other hand, whatever she tells herself to sleep at night I guess. \n\nI see ADHD traits in them both.",
            "score": 5,
            "replies": []
        },
        {
            "author": "DireRaven11256",
            "body": "Some people are afraid that if they don’t come down hard on their ADHD persons’ “symptom slippage”, the ADHD person will then stop making an effort to mitigate the effects of their ADHD on other people. Especially if they, themselves, have the same issues and have made efforts to hide it from the world. (IE the thought “if I can’t get away with [x], then you shouldn’t be able to either!”)",
            "score": 5,
            "replies": []
        },
        {
            "author": "emmajen",
            "body": "Because they were mistreated for those same behaviours and get triggered into fight or flight when their child does them. My husband and I both have adhd, as does our 5 year old, and this is something my husband is working through in therapy. ♡",
            "score": 3,
            "replies": []
        },
        {
            "author": "sharkfinned",
            "body": "my dad responded to my adhd traits by trying to beat it out of me. when i got diagnosed as an adult, the doctor said that maybe (she said she cannot diagnose him without meeting him, so it was a big maybe) that he also had adhd, and that parents with undiagnosed adhd sometimes get overwhelmed and lash out like this (she was not saying that it was normal or good, but it was just the way it was sometimes).",
            "score": 3,
            "replies": []
        },
        {
            "author": "Seexbeast",
            "body": "I was told I was “stupid” and would never be anything other than a “labourer” in school. In fact I have reports from teachers suggesting I just had a low iq. Strangely enough virtually everything could be linked to adhd traits, which no one ever picked up on. My parents (especially my dad) were very much into the strict parenting style and would constantly yell at me or hit me. \nNow I have a bachelors degree, and am in law school! Would love to meet some of my old teachers.",
            "score": 2,
            "replies": []
        },
        {
            "author": "thjuicebox",
            "body": "Brought up in a southeast Asian family with HEAVY generational trauma and undiagnosed mental illnesses everywhere you look\n\nMy mum would regularly tell me it’s better to have given birth to a piece of char siew (roast pork) than to have given birth to me\n\nSo that was a GREAT confidence booster\n\nSorry I’m not answering your question — I don’t know WHY they do it and I think it’s probably sth they learnt from their parents + their own internalized shame and ableism",
            "score": 2,
            "replies": [
                {
                    "author": "Scared_Ad_7469",
                    "body": "Omg 生嚿叉烧好过生你 hahaha relatable",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lucky-Necessary-8382",
            "body": "Because they are tired to deal with this",
            "score": 1,
            "replies": []
        },
        {
            "author": "ExternalSelf1337",
            "body": "Sometimes because those parents also have undiagnosed ADHD and we're verbally abused by their parents for the same reason.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WisteriaKillSpree",
            "body": "TL;DR: UnDX'd parents sometimes take their self-loathing out on their kids.\n\nI was not Dx'd until 30s. No one else iny family was Dx'd (except my daughter, right before me.\n\nI think my late father was just impatient and - like a lot of parents w/unDx'd kids, couldn't understand my difficulties. As a fairly quiet girl in the 1970s, I would not have even been considered for an ADHD Dx, so there wasn't a good explanation for my failure to \"live up to my potential\".\n\nHe was a fairly normal, stable guy, overall, though he was occasionally over-harsh and humiliating, and was an old-school spanker.\n\nMy late mother, OTOH, had even *worse* ADHD symptoms, as an adult, than I did - even pre-Dx - though I'm quite certain she would have cut off her leg before admitting it, had the possibility ever been presented to her.\n\nShe also exhibited intractable behaviors and attitudes that suggest BPD and/or NPD (Borderline and Narcissistic Personality Disorders), and was quite often verbally - and sometimes physically - very abusive toward me, even as a small child. \n\nHer inconsistencies made it even harder for me to rein in my focus, and I think she sometimes deliberately derailed me when I was doing well. \n\nWhy? Because she hated *herself* - but not being able to admit she wasn't perfect, she had to have somewhere to put all that loathing. \n\nThat place was me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BlueSkyla",
            "body": "I had a teacher scream at kids that failed to bring in HW or work on assignments. Literally scream. Her yelling and screaming put me on nerves and it made me do so much worse in her class. She even made me cry a few times, the horrid bitch. My mom would complain and the school did nothing. It was 6th grade and my mom dismissed all the bad grades she gave me cause I refused to do as she said.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BunnyKusanin",
            "body": "I'm Russian and in primary school I was told Paganini's father locked him in the basement and made him play the violin until it started to sound right, and look what genius he turned out to be. I wasn't luckily locked anywhere but I was left to do my homework for ages by myself. Why? I guess because my father was treated the same way when he was a child and my mother was convinced kids were supposed to do homework without help.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ExtraResolution6579",
            "body": "My mom back in my home country would say “everyone feels that way, but we all manage”, whenever I came to her with a struggle or failed at something that I didn’t understand at the time but now realize was probably due to my untreated/ badly managed ADHD.\n\nNo, mom. Everyone does not feel that way. YOU feel that way because you also have ADHD! Glad you managed, but if it’s all the same to you, I’ll take the extra help.",
            "score": 1,
            "replies": []
        },
        {
            "author": "xithbaby",
            "body": "I was just diagnosed two weeks ago. My daughter is 11 years old. She acts just like me, and until I knew what I know about me. I will shamefully admit that her father and I were harder on her than we ever should have been. She is also showing signs of exactly what I went through as a kid and I didn’t put 2 and 2 together until recently.\n\nShe has a doctors appointment Thursday and is being tested for adhd, if the doctor doesn’t think it’s this, next step is autism or Asperger‘s testing. But my doctor is totally on board with helping her and her and I can learn all of this together.\n\nI think a lot of it is due to shame, shame to admit your kids are different or have mental issues. It’s why my dad hid my diagnosis from me. It could also be ignorance.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Old-Presentation4816",
            "body": "Yes, go figure?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Next-Cow-8335",
            "body": "I was born in 1971.\n\nIn the 6th Grade, in US schools, I started having trouble with math. I was so afraid of my drunken, physically abusive father, who also had undiagnosed ADHD, that I stole Liquid Paper from a store, due to my almost complete lack of impulse control klepto phase, and changed the grades on my Report Card, and forged my mother's signature on it. That only worked for 2 Report Card periods.\n\nInstead of pondering what was going on, I was a miscreant, lazy, manipulative, and indifferent in my parent's eyes. And this continued my entire public school career. Still no thought to \"Why is this happening?: from my parents. I spent half of my life at that time grounded, and punched more that once by my father.\n\nI flunked my senior year, and got my GED a year or two later. Humorously, my home town's GED organization wanted to give me a certificate for scoring so high on the GED....\n\nI left public school convinced I was stupid, and crazy. I checked myself into psych wards 3 times before I was 30, suicidal, because I couldn't \"Get it together.\" I was misdiagnosed as Bipolar 2.\n\nIn my mid 30's, my father, who finally realized something was really wrong with me, convinced me to apply for disability. Surprisingly, it went right through, due to my long history of psych problems. And I've been on it since, for almost 20 years. But that will end, soon, probably, with the current administration's cruelty.\n\nIt wasn't until my mid 40's, after watching a video by Dr. Russell Barkley that I knew what was wrong with me. Much, much too late to mitigate my traitor brain.",
            "score": 1,
            "replies": []
        },
        {
            "author": "saltyavocadotoast",
            "body": "Executive function issues like in ADHD are often seen as moral failings such as not trying hard enough. I wish people would learn that it’s really quite the opposite and we are trying harder than anyone all the time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "enjoyskyblue_",
            "body": "Where did you get the idea this is \"especially\" in japan/SK? Plenty common in USA, UK, and other western countries too. Shame is a powerful motivator, it's just you can't control what it motivates a kid too, and it is also traumatising. Parents don't care - they were treated that way and they've done alright, so of course they can treat their kids that way, right?",
            "score": 1,
            "replies": []
        },
        {
            "author": "torako",
            "body": "Because the group of people protected from criticism by this sub's filters are defective.",
            "score": 0,
            "replies": []
        }
    ]
}