{
    "title": "My family told me I’m weak cause i turned to medication",
    "author": "AbiesHalva7",
    "subreddit": "ADHD",
    "rank": 8,
    "score": 38,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 45,
    "url": "https://www.reddit.com/r/ADHD/comments/1inq6yb/my_family_told_me_im_weak_cause_i_turned_to/",
    "id": "1inq6yb",
    "selftext": "I’m legit here just to vent.\n\nI was explaining to my sister and a cousin what is ADHD and what is Dyslexia cause I was recently diagnosed with ADHD and a low key autism and prior to that I haven’t talked much about dyslexia.\n\nFor context, I live abroad for half of my life and I don’t go back often so I’m not really up to date on family nor do they really know me as an adult. \n\nAnother context, I reached out psychiatrists when I started having problems at work due to my adhd. It’s extremely tiring both for everyday life as well as professional, I just couldn’t stand it anymore.\n\nI was very happy to share I’ve found a fantastic therapist to accompany me along side with medication i will get from my psychiatrist (in 2 weeks). Like, I’m really working on it guys 😂\n\nThe response I’ve got was “there, you see, you are immediately turning to medication when these things can perfectly be fixed with a good therapist. I think you should change the therapist and just pull your shit together and focus”\n\nPull your shit together and focus… \n\nCan someone please give me a sanity check here?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/AbiesHalva7 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "WMDU",
            "body": "ADHD is not weakness.  \n\nIt is a medical condition.\n\nADHD is a neurological al (brain) disorder, that you are born with and have your entire life, every day of your life, all day.\n\nHavjng medication for ADHD is no different to wearing glasses for vision problems, or a hearing aide for hearing problems.",
            "score": 43,
            "replies": [
                {
                    "author": "AbiesHalva7",
                    "body": "Literally…",
                    "score": 12,
                    "replies": [
                        {
                            "author": "WMDU",
                            "body": "Perhaps try those same words on your parents.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "DD-Amin",
                                    "body": "You're not going to change stupid. My advice for OP - ditch your family. You don't need them. Life is better without them.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MEGoperative2961",
                    "body": "I get good grades so my parents dont give a single shit about my adhd. It sucks.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Dvork",
                            "body": "It was the same for me. So I got a late diagnosis now when im in my 30s. It sucks, a lot of suffering, a lot of time lost.... but at least life is better now.  Sometimes parents suck. It is what it is :(",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Geeky-resonance",
            "body": "Might as well call a nearsighted person “weak” for wearing eyeglasses. Or call someone with diabetes weak for using insulin as prescribed along with regular exercise and a healthy diet. Or call someone with hypothyroidism weak for taking their prescribed thyroid hormone. \n\nLots of people just don’t know a whole lot about ADHD, especially with respect to more recent (I.e., within the last couple of decades) research findings. \n\nCheck out the pinned resources on this sub. \n\nGood luck!",
            "score": 13,
            "replies": [
                {
                    "author": "brydeswhale",
                    "body": "My mom knew this chick who was aware that her kids needed glasses, but chose not to get them, because “they needed to work through their bad past life deeds that caused them to need glasses”. \n\nSome people are just assholes. ",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "fretsore",
            "body": "My wife and I have similar struggles, and a common joke we have when we can see the other is desperately trying to get some basic task started is to say (in a stupid idiot voice) \"just do it!\" because honestly that's what everyone who doesn't struggle with this shit sounds like when they offer advice.   \n  \n\"Why don't you just do it now instead of leaving it till the last minute\" sounds just as clueless as \"why didn't you just karate chop the robber instead of giving them your wallet\"",
            "score": 8,
            "replies": [
                {
                    "author": "Apprehensive-Bat-416",
                    "body": "Ha. I love this. \n\n\nI instantly got a vision of Adam Scott as one of his jerk characters roasting me.  \n\n\n\"Hey AH, ever try just not losing your keys?\"",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "deadhand31",
            "body": "You don't need your sanity checked, this is normal for people who don't understand. \n\nTrying to fix an ADHD brain while suffering the hindrances of ADHD impossible. It's like someone telling a person whose heart pumps at 30% capacity that they should be able to run a marathon simply because they know their heart isn't working properly.\n\nThe truth is that the change doesn't come because of the medication. It simply puts your brain in a state where you can actively choose to do things better.",
            "score": 7,
            "replies": []
        },
        {
            "author": "JunahCg",
            "body": "Rest easy in the knowledge that your family is ignorant and hateful. You can't fix it for them, but you can feel superior",
            "score": 3,
            "replies": []
        },
        {
            "author": "PaleontologistNo858",
            "body": "Yeah unfortunately there are still uneducated people who think they know better, don't take any notice.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Storytella2016",
            "body": "Do any of them wear glasses? Take medications for diabetes, high blood pressure, menstrual pain, or even to prevent pregnancy? If so, then they should STFU.",
            "score": 4,
            "replies": []
        },
        {
            "author": "BotherAggressive5560",
            "body": "Fuck their opinion on the matter. ADHD is a constant neurodevelopment disorder. It’s a non stop battle. \nIt’s like calling a deaf person weak for getting hearing aids or a visually impaired person weak for getting glasses.\n\nThey need to realize that it isn’t something that can just be will powered away. It’s not a state of mind, your brain is literally wired differently.",
            "score": 3,
            "replies": []
        },
        {
            "author": "AnxiousCheesehead",
            "body": "How strong of you to realize that you needed pharmaceutical help for your medical condition, especially when you have judgmental opposition to it. Being weak would be caving to your family’s uninformed position on medicine. I hope your treatment helps you thrive and be the person you want to be.",
            "score": 3,
            "replies": []
        },
        {
            "author": "lokipukki",
            "body": "You are not weak. Would they tell someone who needs glasses they’re weak? No. Phrase it like you’re putting glasses on your brain. If that still doesn’t convince them, then tell them they’re talking shit about someone who has an executive function disorder which is a learning disability. If they still talk shit, don’t talk to them unless you absolutely have to. You are not weak. If anything turning to medications to treat your learning disability is what is best for you and a medical professional agrees.",
            "score": 3,
            "replies": []
        },
        {
            "author": "DinoGoGrrr7",
            "body": "Your family is weak for being assholes. 🤷🏻‍♀️",
            "score": 2,
            "replies": []
        },
        {
            "author": "taylianna2",
            "body": "Tell them to go break their leg and instead of going to a doctor to set the break and put a cast on it, to just walk it off.",
            "score": 2,
            "replies": []
        },
        {
            "author": "sacredtones",
            "body": "From what I understand, ADHD isn't something that typically responds well to therapy because it's literally a neurodevelopmental condition. No amount of therapy is going to change the way our brains are wired. Meds AND therapy for finding coping mechanisms is where it's at.\n\nI personally dgaf about anyone who thinks I'm \"weak\" for using medication. There's no awards for living life on hard mode when a perfectly viable solution exists. And honestly, life is still hard even with meds, just not AS hard. It still requires strength.",
            "score": 2,
            "replies": [
                {
                    "author": "AbiesHalva7",
                    "body": "Precisely. That’s why there is a difference between a psychologist and psychiatrist but people just don’t seam to get that it’s not a personality trate…",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Relaxmf2022",
            "body": "You are not weak!\n\nask them if you would be weak to put a cast on a broken arm or band-aid on a cut?",
            "score": 2,
            "replies": []
        },
        {
            "author": "adistantrumble",
            "body": "Chances are your family are also suffering and are just in denial about it.  It's really not their business that you are on medication so stop sharing it with them.",
            "score": 2,
            "replies": []
        },
        {
            "author": "PineappleBanjo",
            "body": "After giving those family the double middle finger, try to brush it off. If they don’t understand why you would use medication for ADHD and pass judgement upon you for it, my guess is that they wouldn’t be opening to learning by really listening to what you are going through.\n\nHopefully your family can brush it off as well and not make it a permanent bone to pick with you and instead maintain a loving relationship with you. Family is family and in my experience, it is rate that everyone 100% on board with everyone else’s life choices. You just hope that at the end of the day they can understand that they are your life choices.",
            "score": 1,
            "replies": []
        },
        {
            "author": "midnightlilie",
            "body": "There is no shame in taking effective treatment, no one will give you a medal for doing things the hard way, you're the one who has to live with the consequences of your treatment choices, and many of us see very little improvement from just therapy, but if medication works for you it can cause major improvements and make therapy more effective.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jaf872",
            "body": "you can just find shit ton of evidence that that approach wouldn't work, then if they still deny scientific studies, leave it be. unfortunately often times elder generation is much more rigid in their world view, so you can just ignore it and do what's best for you. it's not like you lose access to your medication because of critique. you only should know why you're using it and have enough reasons. your parents are not living your life so they have no idea what it's like. just keep going at this point.",
            "score": 1,
            "replies": []
        },
        {
            "author": "productivediscomfort",
            "body": "Please, please, please don’t listen to them! You DESERVE to not have to constantly struggle to function. You do not have to rawdog your way through life! Your brain works differently, and no therapist can give you a different brain. Coping skills, sure, but they’re not a substitute for medication. \n\nThese meds are life saving, they are effective, and there are decades of studies behind their use for people with ADHD. \n\nI started meds after years and years of agonizing and shame, after feeling like I was just doomed to be constantly struggling to function, and it was one of the best decisions I’ve ever made. \n\nIt’s helped my work-life balance, it’s helped me to regulate my sleep schedule, and it’s even helped me make more progress in therapy because I don’t have to focus on trying to maintain basic functioning… I am (in comparison) functioning well. Obviously I still use a lot of tips, tricks , and hacks to stay on top of things, but medication has made it easier to implement those and to use them effectively. \n\nTLDR - Fuck them, your brain is different and you can’t struggle your way to a new brain! ADHD meds are exactly that— medicine. Life is excruciating as it is! Give it a try, and ignore people that don’t know what the hell they’re talking about. \n\nSending you courage and support, friend!!",
            "score": 1,
            "replies": [
                {
                    "author": "productivediscomfort",
                    "body": "P.S. Your medical decisions are none of their business unless you want them to be involved. They do not “deserve to know” because they are your family, and you can make the choice of whom you want to tell, or not. \n\nFor instance, I was diagnosed as an adult, and one of my parents grew up in a culture that is very distrustful of the medical field. They believe in just gritting your teeth and powering through, and were taught that taking medication or having ongoing mental and physical health issues are all signs of moral weakness (??!)\n\nUnderstandably though sadly,  I chose not to disclose to them, even though I love them, because I don’t need any of that judgmental bullshit in my life. \n\nMy other family members, know and support me, even if they don’t always understand ADHD or how it works. ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Chokomonken",
            "body": "I was completely convinced about adhd medicine when I read about exactly what is happening in the brain.\n\nThe explanations about focus and energy and whatever are just examples of the results of that, and not descriptions of adhd itself.\n\nThere are things that are and aren't happening in the brain of a person with adhd that differ from those without it. A therapist can do nothing about that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CharliePixie",
            "body": "Fuck em. None of this stuff is a moral failing, and that's how they're framing it. They would tell Michael J. Fox to hold still, they shouldn't be telling you to focus.",
            "score": 1,
            "replies": []
        },
        {
            "author": "-PinkPower-",
            "body": "Would you tell someone that has glasses that they are weak for choosing glasses? \nOr tell a diabetic person that they are weak for taking insulin?",
            "score": 1,
            "replies": []
        },
        {
            "author": "NikkiRex",
            "body": "Once you get your meds (assuming they work) let them know you feel like you can really pull your shit together and focus now",
            "score": 1,
            "replies": []
        },
        {
            "author": "ceryniz",
            "body": "They should cure cancer with their suggestions. No chemo no surgery. Just get your shit together and cancer be gone.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dvork",
            "body": "They dont know anything about ADHD clearly. \n\nLike ADHD is in the very architecture of your brain and cannot be fixed with the power of will. It can only be managed (to a varying degree) with either therapy or medication. But medication is, by far, the most effective at managing the issues with concentration or procastination etc. Etc. That ADHD can bring.  \n\nYOU are being the responsible ony by realising this and doing what you can to improve your life. You are not lazy, you are honest and realistic. They need to learn more about ADHD and become more realistic.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cassiareddit",
            "body": "Loook they have no idea what they are talking about. Medication is literally the first line treatment for adhd (in UK anyway). Good for you looking after yourself!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Loonesga",
            "body": "I’m so sorry your family are misinformed and judgmental. So many people have no idea how challenging ADHD can be. I’m so happy you’ve found a therapist you’ve clicked with and are being followed by a psychiatrist! \n\nYeah for getting meds for yourself. I was diagnosed at 61 and started taking meds then. It was life changing.\n\nPS meds haven’t kicked in yet this AM hope this is coherent. lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "NullPointerExpert",
            "body": "Do any of them depend on insulin?  If they’re Type 1, then it’s comparable.\n\nIf they’re Type 2, it’s from a total lack of self control…",
            "score": 1,
            "replies": []
        },
        {
            "author": "CuriousGeorgette9",
            "body": "Hop on 'roids and show them who the real weaklings are!\n\n[No, but jokes aside, this sucks and sorry to hear you're not finding support within your own family.]",
            "score": 1,
            "replies": []
        },
        {
            "author": "AuntieEms",
            "body": "ADHD literally means you're going to struggle with focus, so your families advice might as well have been \"have you tried not having ADHD?\" Lol they are clueless",
            "score": 1,
            "replies": []
        },
        {
            "author": "scrambled-black-hole",
            "body": "Odds are that they’re scared of going to a psych or starting meds so they’re taking it out on you. This stuff runs in families. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "jujuscroll",
            "body": "Tell them they're weak for wearing glasses/getting surgery/wearing orthopedic shoes/etc.\n\nI guess it's possible they've gone through life without needing ANY intervention, but I doubt it. \n\nReturn that energy",
            "score": 1,
            "replies": []
        }
    ]
}