{
    "title": "Google maps: 45 minutes to reach destination, Me: What about 30 minutes?",
    "author": "angrypanamanian",
    "subreddit": "ADHD",
    "rank": 42,
    "score": 1,
    "upvote_ratio": 0.57,
    "num_comments (reported by reddit)": 10,
    "url": "https://www.reddit.com/r/ADHD/comments/1insat0/google_maps_45_minutes_to_reach_destination_me/",
    "id": "1insat0",
    "selftext": "Well, yeah.\n\nI tend to go over the speed limit a lot. Probably because I always want to have \"more\" time so I try to reach my destination as fast as possible.\n\nBad part is that I also love speed but I try not to overdo it. Also, the kind of music I usually listen (drum and bass) doesn't help lol.\n\nHow do you guys deal with speeding?\n\n  \nEdit 1: Nothing besides 140 km per hour. I only do it when I know I'm alone on the road and I reduce the speed in high density areas. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/angrypanamanian and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "syncpulse",
            "body": "Listen to something with a lower bpm. I read about a study that suggested aggressive music can lead to aggressive driving.\n\n\nOther than that honestly you're probably not going to curb the habit until you get a costly ticket. Then you'll have a reason to slow down. ",
            "score": 3,
            "replies": [
                {
                    "author": "angrypanamanian",
                    "body": "Funny thing is that I already have 2 tickets because of it, both of them unpaid (paying them this month). \n\nAnd the thing about slow bpm is that it can make me sleepy :(",
                    "score": 1,
                    "replies": [
                        {
                            "author": "syncpulse",
                            "body": "For me it was a ticket that I procrastinated paying until they suspended my licence. ",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Key_Calligrapher6337",
                            "body": "No music then",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Licensed-Grapefruit",
                    "body": "I can tell you from personal experience. If i start listening to rock music or metal I’m driving about 10-15 mph over the limit and impatient. I started to listen to jazz and softer music and rarely do I go over 5mph and I’m much more patient.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "jordanshaw89",
            "body": "Alas, another speed demon ADHDer! jokes aside I started out driving fast when I was younger but after my partner had several accidents (he’s totes fine) I decided I needed to slow down. It sounds dumb, but if you ever played GTA, and tried to drive all perfectly in the game like you were an NPC, but this is exactly how I slowed myself down lol I just pretend I’m a GTA NPC 🤣\n\nGranted it only works when you remember the game 😅😂",
            "score": 2,
            "replies": []
        },
        {
            "author": "TheAimlessPatronus",
            "body": "Please drive safely.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ade231035",
            "body": "Maybe what you can do is turn not speeding into a game, like every time you are about to pass one of those signs that tell you how fast you’re going, you try to slow down to match its speed or something line that",
            "score": 1,
            "replies": []
        }
    ]
}