{
    "title": "Balancing life and finding the right medication",
    "author": "noodledoodleloodle",
    "subreddit": "ADHD",
    "rank": 57,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 1,
    "url": "https://www.reddit.com/r/ADHD/comments/1invpve/balancing_life_and_finding_the_right_medication/",
    "id": "1invpve",
    "selftext": "I am a recently diagnosed f27 and currently working with my psych to find the right meds to help me function day to day better.  I have a very busy high stress job, my boyfriend and I recently adopted two puppies who have had a slew of issues, and of course the day to day family stress and stress from just existing.\n\nI recently tried Jornay PM, which was great at first. After a week or so though, it made me incredibly sedated and then depressed.  Tomorrow I'm starting on Azstarys and after the last med, and I'm a bit nervous.\n\nHow have you all balanced working out your meds while also having to work a professional career? I go to therapy weekly and my partner is incredible supportive, but im also at the busiest time of the year with my job and I'm nervous about keeping up if I'm experiencing negative side effect after negative side effect.  Im contemplating putting off finding the right meds until things have calmed down, but my normal symptoms have been causing me to be overwhelmed with my job as well so I was hoping starting meds would help.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/noodledoodleloodle and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        }
    ]
}