{
    "title": "Do we have brain damage?",
    "author": "Difficult-Tangelo236",
    "subreddit": "ADHD",
    "rank": 59,
    "score": 1,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/ADHD/comments/1invgo0/do_we_have_brain_damage/",
    "id": "1invgo0",
    "selftext": "Sometimes I feel like I have literal brain damage. Sometimes I also think my mom may have caused it by taking pills while I was in the womb or I may have caused it my self by experimenting with drugs at 16. I literally don’t know if that’s a reasonable thought. Just letting it out there. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/Difficult-Tangelo236 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tuletidec",
            "body": "ADHD doesn’t really have anything to do with brain damage afaik so if you feel like you have brain damage it would be something else. Also depends on what drugs you\\your mom took",
            "score": 2,
            "replies": []
        },
        {
            "author": "Temporary_Refuse7955",
            "body": "No, if your issues were due to brain damage then you wouldn’t have ADHD (because one of the requirements of ADHD is that the issues are not caused by other, biological, factors).",
            "score": 1,
            "replies": []
        },
        {
            "author": "Anthro_guy",
            "body": "ADHD runs in families with high heritability so I'd be surprised if it was due to drug use, either your mother's medication or your experimentation. From my readings of scientific literature suggests that your drug use may be a symptom of ADHD rather than the cause of it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "palpatineforever",
            "body": "hmmm, there is a correlation, thought to possibly be some form of causation between adhd and traumatic birth.   \nNot that a traumatic birth can give you adhd exactly. Rather it might just be the final catalyst if you are already genetically predisposed to it.",
            "score": 1,
            "replies": []
        }
    ]
}