{
    "title": "Sip & Spill Daily Discussion Thread",
    "author": "AutoModerator",
    "subreddit": "popculturechat",
    "rank": 0,
    "score": 6,
    "upvote_ratio": 0.8,
    "num_comments (reported by reddit)": 62,
    "url": "https://www.reddit.com/r/popculturechat/comments/1je0mjq/sip_spill_daily_discussion_thread/",
    "id": "1je0mjq",
    "selftext": "**Grab your coffee & sit down to discuss the tea!**\n\nThis space is to talk about anything pop culture or even off-topic.\n\n*What are you listening to or watching? What is some minor tea that doesn't need its own post?  How was your date? Why do you hate your job?*\n\nPlease remember [rules still apply](https://www.reddit.com/r/popculturechat/wiki/index/rules/). Be civil and respect each other.\n\n**Now pull up a chair and chat with us.** ☕",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Welcome to r/popculturechat! ☺️\n\nAs a proud BIPOC, LGBTQ+ & woman-dominated space, this sub is for [civil discussion only.](https://www.reddit.com/r/popculturechat/wiki/index/rules/civil-discussion-only/) If you don't know where to begin, start by participating in [our Sip & Spill Daily Discussion Threads!](https://www.reddit.com/r/popculturechat/search/?q=Sip%20%26%20Spill%20Discussion&restrict_sr=1&sr_nsfw=&include_over_18=1&sort=new)\n\n###No bullies, no bigotry. &#9994;&#127999;&#9994;&#127998;&#9994;&#127997;&#9994;&#127996;&#9994;&#127995;&#127987;&#65039;&#8205;&#127752;&#127987;&#65039;&#8205;&#9895;&#65039;\n\nPlease [read & respect our rules](https://www.reddit.com/r/popculturechat/wiki/index/rules/), [abide by Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette), and [check out our wiki](https://www.reddit.com/r/popculturechat/wiki/index/)! For any questions, [our modmail](https://www.reddit.com/message/compose?to=%2Fr%2Fpopculturechat) is always open.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/popculturechat) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dizzy-Pollution6466",
            "body": "So many of the comments on that Sabrina thread. Smfh. I wish Reddit never learned the term “male gaze”.",
            "score": 35,
            "replies": [
                {
                    "author": "xyzzy826",
                    "body": "Sl*t shaming but make it woke",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "arsenicandoldspice",
                    "body": "all the \"it's giving sexy baby, she's doing a little girl aesthetic\" is so insane. like a) y'all giving pizzagate qanon trying to label everything as CSA and b) she is fully 25 years old and wearing pinup clothes, oh my god.",
                    "score": 26,
                    "replies": [
                        {
                            "author": "Bridalhat",
                            "body": "She’s also, like, womanly! Curvy and trying to look more like Betty Boop than a little girl.",
                            "score": 14,
                            "replies": []
                        },
                        {
                            "author": "angryaxolotls",
                            "body": "they act all self-righteous but those are the idiots who infantilize women by thinking being 25 is equivalent to being 12, and being 30 is barely 18. They're creating and perpetuating the problem.\n\n   I think it's because they're insecure.",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "Hot_Contact_7206",
                                    "body": "God that always kills me! “Her frontal lobe isn’t developed so actually she can’t even be making these decisions” about a GROWN WOMAN. People are insane",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "angryaxolotls",
                                            "body": "RIGHT!?! like, most people who attend college have graduated by that age, and a lot of people get married and have children around that age. They are ADULTS! \n\n   That \"oh they're a kid\" shit goes out the window sometime around age 21 for me, personally.",
                                            "score": 9,
                                            "replies": []
                                        },
                                        {
                                            "author": "arsenicandoldspice",
                                            "body": "Why can't we just call it loser behavior to date a woman half your age? We don't have to infantilize grown women to do this, we can just point out that few to no well-adjusted people are starting long term relationships with people in completely different life stages than them. Draw your own conclusions.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "anthonystank",
                    "body": "Best part is they didn’t actually learn what it means, they just think it means “horny men looking at things”",
                    "score": 18,
                    "replies": [
                        {
                            "author": "Bridalhat",
                            "body": "How many straight men are even watching Sabrina Carpenter concerts?",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "echoesandripples",
                                    "body": "I doubt her shtick is that appealing to straight men anyway, they tend to be very insecure about funny, good looking women",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Bridalhat",
                                            "body": "Right? Also lost in this conversation is a lot of this is just her being funny. Like it’s easier to imagine a woman who has been in the industry for a decade being exploited and oversexualized by evil producers than that she’s joking.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "echoesandripples",
                                                    "body": "I doubt her horny jokes are meant to seduce the audience or anything tbh. loke she's a beautiful young woman, i'm sure she can and will be sexual with people she wants to be, on a personal level. people who she knows lol\n\n\nthe performance thing is an act. cheeky, sure, but not that different from singers performing romantic ballads with their dancers. it's not real.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Carolina_Blues",
            "body": "why are people clutching their pearls about the sabrina carpenter video from paris? she always does the positions thing during juno and she’s in paris so of course she’s going to make an eiffel tower joke. if she didn’t it would’ve been such a missed opportunity. it’s a joke and it’s funny and not that serious. she’s a master at getting yall to talk about her and her tour\n\nhad to say all this here cause the other post got locked. some people really can’t handle when grown women own their sexuality",
            "score": 33,
            "replies": [
                {
                    "author": "Hot_Contact_7206",
                    "body": "No I agree. At this point posts about women just make me sad because the comments are so disgusting and hateful. And people always pretend to come at it from a “I’m just trying to protect other women from this over sexualization!” Misogyny won.",
                    "score": 19,
                    "replies": [
                        {
                            "author": "Carolina_Blues",
                            "body": "like i’ll never argue that women aren’t oversexualized in our society because they definitely are but acting like sabrina is doing this just to appeal to men is kinda insulting. women get to express their sexuality only to a certain point where it must be viewed as socially appropriate and after that it’s bad. the whole thing is supposed to be cheeky and funny. ive made eiffel tower jokes before and it wasn’t to appeal to men, i just thought it was funny. \n\npeople don’t like this or her and want to criticize it and found that they can do it under the guise of feminism.",
                            "score": 10,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DefinitionCharming48",
                    "body": "i usually avoid any sabrina posts cause it goes downhill sooo quickly. but as a fellow shorty, i gots to support my people. \ni’m just baffled by the irrational hate she gets. Her music and persona are unserious and cheeky. so idk why everyone takes everything she does to heart. nothing she does is outrageously vulgar. and she very much gears to young adults, specially women 18+. \nwhat really pisses me off the most is that soooo many people infantilize her cause of her height. like why can’t short adult women be sexy? i think it’s reflects more on the commenters when they immediately assume a short woman wearing corsets and lingerie is going for THAT aesthetic. cause like why did your mind instantly go to that?",
                    "score": 15,
                    "replies": [
                        {
                            "author": "Carolina_Blues",
                            "body": "right? as a fellow short woman who still has a bit of a baby face even at 30, i feel this strongly. people keep trying to say she’s doing the sexy baby thing but she’s really not, her whole aesthetic is much more pinup. she’s just very short. it’s weird to see a grown woman in sexy clothing and think she looks like a little girl",
                            "score": 12,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "arsenicandoldspice",
                    "body": "the culture is becoming weirdly puritan ('everyone is beautiful and no one is horny') and feels like bush era 2.0\n\nWhen it warms up I will be combatting this by wearing crop tops and maybe even showing some cleavage. Maybe even do voluminous hair instead of a clean girl bun, totally wild😜",
                    "score": 30,
                    "replies": [
                        {
                            "author": "JoleneDollyParton",
                            "body": "Bush 2.0 was surprisingly h*rny though compared to now.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "AdDecent5237",
                                    "body": "Low-key feels more like Regan era 80s more than anything, very reminiscent of when Madonna caused people to almost have a heart attack over the Like A Prayers music video. My mom lived through that one and told me that where she lived you would be treated horrible for listening to her music, my great aunt was seen as the devil for letting her niece’s listen to her. \n\nSuch an irony now because people are using that song for worship, which is so weird but hilarious like do they not realize what it’s about 😂🤦‍♀️",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Bridalhat",
                            "body": "…the way I feel like clean girl is vaguely fascist coded.",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "echoesandripples",
                                    "body": "here in brazil we lowkey have been having this debate for a few years. the clean girl aesthetic (beige blazers, paleness, heavily done hair) are a huge contrast to local beauty standards.\n\n\nthe whole concept of telling women they are only taken seriously if they wear a third piece and have coiffed hair, never get any sun spots or anything and don't wear color is completely insane in tropical weather.\n\n\nthus, applying only to people who have air conditioner (rare), buy clothes from international retailers, drive their own cars to work and get dermatologist treatments, given that the UV index is 7 on a chill day.\n\n\neven the og privileged aesthetic here is very different (think farm rio patterned dresses, beachy waves, tans, flip flops, random rich girls from ipanema who don't really work and wear bikinis all day). but the clean girl era contrasts that, putting women's value in looking \"professional\", but unassuming at all costs.\n\n\nit has been incredibly annoying, like you have career coaches saying that you're not gonna get a job if you don't wear your hair a certain way and dress like a zara mannequin. the repetition, unfortunately, has made it happen: now you can go anywhere, from coffee shops to hair salons, and the casualness has been replaced by overly corporate style.\n\n\ni hate it so much",
                                    "score": 10,
                                    "replies": []
                                },
                                {
                                    "author": "arsenicandoldspice",
                                    "body": "yeah I can't disagree with you there, it's definitely a look that celebrates being thin and white :/. To me it's also similar to the 'model off duty' look of the 2000s. Both are rooted in the idea that your beauty (again, the one specific kind of beauty being celebrated) speaks for itself and your clothes and makeup are secondary. \n\nboth ideas are complete bullshit, of course, but the clean girl one sucks especially to me because it feels like people are forgoing personal style for looking bland and marketable. To model is to be a blank slate for someone elses ideas, and with the clean girl look, it's  like they're staying clean so they can go viral, get that #sponsor, and push someone else's ideas. It straight up sucks.",
                                    "score": 11,
                                    "replies": []
                                },
                                {
                                    "author": "Cynicbats",
                                    "body": "It is;\nhttps://nyctastemakers.com/the-clean-girl-aesthetic-predicted-the-rise-of-fascism/\n\n(I had a better article I'll post if I find it again)",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "maelstron",
                    "body": "I always ignore her shenanigans",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Hot_Contact_7206",
            "body": "Saw novocaine last night and I have to say it was a good time! Really funny, a twist I didn’t see coming, and cool stunts.",
            "score": 7,
            "replies": [
                {
                    "author": "Bridalhat",
                    "body": "I need to see that this week. Pleasantly surprised there are two good sub-95 minute movies in theaters this week (Black Bag is good!) and not at all surprised they are struggling financially.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "iliketoomanysingers",
            "body": "Saw Mickey 17 last night!!!! I thought it was good overall, Pattinson of course was incredible and so was the woman who played Nasha. I do worry it kinda tried to put too much in it (presumably trying to stay faithful to the book while still adding it's own unique stuff? But I haven't read it so I can't confirm) but not enough to completely bother me the whole time or anything.",
            "score": 4,
            "replies": [
                {
                    "author": "Summerof5ft6andahalf",
                    "body": "I liked the actress who played the other soldier type person (the brunette).",
                    "score": 3,
                    "replies": [
                        {
                            "author": "iliketoomanysingers",
                            "body": "I wish we saw more of her tbh!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "anonbeekeeper12",
            "body": "My intuition was right with my coworker. I always felt uncomfortable around her. Something just told me to stay away from her. I learned from my other coworker that she was getting drunk everyday.\n\nThis was to the point that she would fight people and say some extremely rude things like homophobic slurs to my queer friends. She was even routinely trying to get my boss fired (which happened) because she didn't get promoted like she wanted.\n\nTwo nights ago, she totaled her car and left the scene of the crash after getting hammered. \n\nI'm literally shocked as hell. She called out of work and lied that her kid broke her knee, but it was because she fkd up her car. I'm actually very concerned about her well-being. Though, she doesn't know that I know that she totaled her car. I'm gonna see if I can get her a recovery coach.",
            "score": 8,
            "replies": []
        },
        {
            "author": "HauteAssMess",
            "body": "teaching antigone, planning my vegas trip to all the boujee restaurants in my head. help.\n\ni secured rezzies at carbone, bouchon, mother wolf, and delilah's!!!",
            "score": 4,
            "replies": []
        },
        {
            "author": "Caninetrainer",
            "body": "I read Careless People and it is so much worse than you can imagine.  Mark Zuckerberg and friends need to be in prison.  Please go and read it!",
            "score": 5,
            "replies": []
        },
        {
            "author": "Waystar_BluthCo",
            "body": "you know how some women have a tragic love of line cooks? I have a tragic love of frat boys. backwards baseball cap wearing idiot men. it borders on feral. very embarrassing type to have. \n\nall of this to say that I do in fact find Travis Kelce hot and yall are welcome to throw tomatoes at me for that bc I probably deserve it",
            "score": 10,
            "replies": [
                {
                    "author": "yeehaw908",
                    "body": "My biggest shock as Taylor fan when they started dating was how many people thought he was ugly😭like I knew him as the hot nfl player that my college roommate had a celebrity crush on",
                    "score": 12,
                    "replies": [
                        {
                            "author": "Waystar_BluthCo",
                            "body": "I think some people dislike the hyper masculine dudebro thing and while I *get that,* I am also a midwesterner raised to treat football like the gospel so it’s exactly up my alley lmao",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "yeehaw908",
                                    "body": "I didn’t grow up in a football culture like that at all but a tall bearded man will always do it for me I fear",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "Brilliant_Stick418",
                                    "body": "I love that for you. I personally do find him and the dudebro type you’re talking about super unattractive but that just means more for you! lol",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AdDecent5237",
                    "body": "Omg you are so real for this, I don’t personally find Travis hot but I definitely get having a type you shouldn’t have bad boys are my kryptonite and that’s led to mess for me in the past 🫣",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "thestoryofme23",
                    "body": "lol i mean the dude was considered one of the hottest guys in the nfl for years and that was before taylor. Now everyone acts like hes hideous or something because of who he is dating. And it’s fine if he’s not your personal taste obviously, but the complete 180 from some is obvious and sadly hilarious ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Waystar_BluthCo",
                            "body": "Yeah I’ve gotten used to prefacing any positive Taylor or Travis comment I make here with disclaimers lol. Some people are just BEC about the both of them. Which I understand, but it gets old hearing it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "FriendlyDrummers",
                    "body": "He's very conventionally attractive. I feel like most people would agree tbh",
                    "score": 6,
                    "replies": [
                        {
                            "author": "echoesandripples",
                            "body": "yeah, he isn't my type (buff athletes aren't), but he is obviously conventionally attractive, it makes sense\n\n\nbut i find him charming, i think it's because when he and jason talk about the girls, he seems cute. ",
                            "score": 10,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "nizey_p",
                    "body": "I'm not gonna waste any tomatoes because I too find him cute. Esp now with the 90s boyband hair.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "maelstron",
                    "body": ">all of this to say that I do in fact find Travis Kelce hot and yall are welcome to throw tomatoes at me for that bc I probably deserve it\n\nBut he is hot. \n\nPeople just say he is ugly because h is dating Taylor. Look how Alwyn nowget praised because he is Taylor ex\n\nWe have to stop being ashamed of men thst looks like men. \nGays were having a lot of fun on Jason Kelce posts.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "buzzfeed_sucks",
            "body": "My work crush is back in the office for the first time in 2 months. I randomly noticed when I walked past him. Lord help me",
            "score": 7,
            "replies": []
        },
        {
            "author": "FriendlyDrummers",
            "body": "Tbh, I don't listen to country music, but even I was angry when the Jason Aldean controversy happened. If I listened to him before, I would have remembered. That said, let's say Chappell didn't know. Sure, fair\n\nBut I think it's her responsibility to have a media team vet her interviews from now. I know people like that she has no media training, but all that was needed was for someone to go through the video to proof read before it's published. Like Jason Aldean has a song about shooting BLM protestors. That's pretty bad",
            "score": 4,
            "replies": [
                {
                    "author": "echoesandripples",
                    "body": "i was at the Cincinnati zoo in summer 2023 and saw more than one person with pro-Aldean tshirts (the typical anti-woke shit). there's no way she didn't know.\n\n\nI remember being like wtf and very spooked by this situation as a foreigner. lime why the hell are people buying shirts to defend this man?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "FriendlyDrummers",
                            "body": "At the time I wasn't that aware of pop culture controversies but he truly pissed me off 🫤🫤🫤 glad I didn't see dumb ass shirts. What idiots\n\nI really don't know how she wouldn't know. I understand listening to problematic artists, but I know why they're problematic. And she seems terminally online. She needs a PR team; this could have been avoided if they watched the interview first.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "echoesandripples",
                                    "body": "i mean, maybe like her mom wouldn't know, but she's gen z, chronically online and seems to be a fan of country artists in general, so I imagine someone as big as him creating controversy would be in her radar. \n\n\ni know sometimes we miss these kinds of pop culture concerns, like, I personally rarely know who are the assholes in media I don't follow, so it isn't impossible to happen, but still",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Chance_Taste_5605",
            "body": "Andrew Garfield is so unbelievably charming he even makes being in a Sky TV ad cute. Also how is he in his 40s??? ",
            "score": 5,
            "replies": []
        },
        {
            "author": "nizey_p",
            "body": "Thank goodness for redditors giving so much tea about Sarah & Andrew Kim. I'm deep deep down the rabbit hole.",
            "score": 3,
            "replies": [
                {
                    "author": "Chance_Taste_5605",
                    "body": "Could you ELI5? I need a new rabbit hole lol",
                    "score": 1,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Own-Importance5459",
            "body": "One of my favorite universal acts of Karma, is when terrible people start to become progressively uglier. Its like the universe is showing us their true colors.",
            "score": 0,
            "replies": []
        }
    ]
}