{
    "title": "‘Sex Lives of College Girls’ Canceled After Three Seasons at Max",
    "author": "SafeBodybuilder7191",
    "subreddit": "popculturechat",
    "rank": 13,
    "score": 152,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 69,
    "url": "https://variety.com/2025/tv/news/sex-lives-of-college-girls-canceled-max-1236340564/",
    "id": "1jeaz0y",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Welcome to r/popculturechat! ☺️\n\nAs a proud BIPOC, LGBTQ+ & woman-dominated space, this sub is for [civil discussion only.](https://www.reddit.com/r/popculturechat/wiki/index/rules/civil-discussion-only/) If you don't know where to begin, start by participating in [our Sip & Spill Daily Discussion Threads!](https://www.reddit.com/r/popculturechat/search/?q=Sip%20%26%20Spill%20Discussion&restrict_sr=1&sr_nsfw=&include_over_18=1&sort=new)\n\n###No bullies, no bigotry. &#9994;&#127999;&#9994;&#127998;&#9994;&#127997;&#9994;&#127996;&#9994;&#127995;&#127987;&#65039;&#8205;&#127752;&#127987;&#65039;&#8205;&#9895;&#65039;\n\nPlease [read & respect our rules](https://www.reddit.com/r/popculturechat/wiki/index/rules/), [abide by Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette), and [check out our wiki](https://www.reddit.com/r/popculturechat/wiki/index/)! For any questions, [our modmail](https://www.reddit.com/message/compose?to=%2Fr%2Fpopculturechat) is always open.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/popculturechat) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "kgal1298",
            "body": "Annoying, but saw it coming. With the long break between seasons and Renee heading out it was a bit of doom moment for the show. I don't think the writing was going to save them.",
            "score": 1,
            "replies": [
                {
                    "author": "ananthropolothology",
                    "body": "Definitely. I honestly thought it had been cancelled before the whole third season aired because of how it seemed to abruptly end!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "benderwater",
            "body": "I think we all saw this coming. The 3rd season really wasn't that good. Too bad, though, because I did really like the show overall.",
            "score": 261,
            "replies": [
                {
                    "author": "Key-Beginning-8500",
                    "body": "The storyline completely nosedived which is tragic because S1 was hilarious and incredible ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "procrastinating_b",
                    "body": "I really disliked this season and really hated any route they tried to go with the football.....but I really wanted to see them through college",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "GregMadduxsGlasses",
                    "body": "They can spin off the show by giving Pauline’s character an internship in Paris where she works as Emily’s assistant.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "sloppy-mojojojo",
            "body": "most S3 scenes were under 1 minute long, and half the runtime was spent on aerial transitions with shitty pop music over it. not surprised really",
            "score": 1,
            "replies": [
                {
                    "author": "Kallisti13",
                    "body": "Yes! It was basically unwatchable. Such a weird editing decision.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "anonyaccount1818",
            "body": "The sub r/SexLivesCollegeGirls predicted this. To be fair the 3rd season was a bit rough",
            "score": 1,
            "replies": [
                {
                    "author": "hayypeachyy",
                    "body": "i didn’t even finish the 3rd season and i LOVED s1 and s2.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Far-Imagination2736",
                            "body": "I only made it to the episode up to when Leighton leaves. Renee Rapp made the show for me.\n\nI didn't like S2 much either way to try and stick out a whole other season",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Carolina_Blues",
                    "body": "i feel unpopular that i actually really liked it. there was a lot of growth from the characters and some interesting storylines they were exploring. the finale was also really good imo",
                    "score": 1,
                    "replies": [
                        {
                            "author": "longlisten527",
                            "body": "The finale felt like a Disney tv show 😭",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Carolina_Blues",
                                    "body": "oh i liked it. i thought it was sweet 🤷‍♀️",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "BlueJeanMistress",
                                    "body": "Did the finale feel like a series finale like the writers knew it was going to be cancelled?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "throwawayamasub",
                    "body": "They actually did wow",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "doormouse1",
            "body": "I think they majorly overcompensated when Rapp left the show. This past season could’ve been good, but felt so rushed and vague in its intentions with the characters.",
            "score": 1,
            "replies": [
                {
                    "author": "pennysoap",
                    "body": "Yeah the storyline of Bella coming out as bi felt really weird and forced. As a bi person I found it super cringey. Like we lost one gay main character let’s just force one. It was really out of the blue. I feel like they could have built that storyline better. It felt half asses",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "felicitybenevidez",
            "body": "First season was good but the second one was a mess.",
            "score": 1,
            "replies": [
                {
                    "author": "kyliejennerslipinjec",
                    "body": "The writing after the first season was a disaster",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Itstimeforcookies19",
            "body": "It really fell off after the first season. 2 was just ok. Never ever bothered with 3.",
            "score": 1,
            "replies": []
        },
        {
            "author": "girlabides",
            "body": "![gif](giphy|OHrAbtNndYOEtDhQWy|downsized)\n\nI miss Bella already",
            "score": 1,
            "replies": [
                {
                    "author": "tsabin_naberrie",
                    "body": "We needed to see her living her best >!bi!< life",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Carolina_Blues",
            "body": "noooo. the season finale was really good, i was wanting to see at least one more season 😭",
            "score": 18,
            "replies": []
        },
        {
            "author": "mrgnfnn",
            "body": "And Just Like That… get behind me!",
            "score": 1,
            "replies": [
                {
                    "author": "texasjkids",
                    "body": "Is And Just Like That good? No. Do I remember a single thing that happened last season? Also no. Will I be tuned in the day it drops? Absolutely.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Houdini-88",
                    "body": "This show has gotten better they said voiceovers will be back in season 3 \n\nThe first season was bad though \n\nI think Sarah will push for one more season before pulling the plug at least",
                    "score": 1,
                    "replies": [
                        {
                            "author": "GregMadduxsGlasses",
                            "body": "She’s gotta convince Kim Cattrall to show up and do a proper episode.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Couldnotbehelpd",
            "body": "I loved the show but Renee Rapp leaving was clearly the death knell. It wasn’t as good without her.",
            "score": 1,
            "replies": [
                {
                    "author": "A_Person_From_Canada",
                    "body": "I have to agree with you. I binged the show not too long ago and was definitely less invested in S3, ans I have to attribute it to Renee not being in the show anymore.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AdDecent5237",
            "body": "![gif](giphy|6gLyE15StAs3C)\n\nDAMN YOU MAX, YOUR TAKING EVERYTHING GOOD OFF THE PLATFORM 😭😭",
            "score": 1,
            "replies": []
        },
        {
            "author": "mcon96",
            "body": "Oh man, Renee Rapp leaving really killed the show. I actually thought S3 was pretty good tbh. Not quite as good as the first two, but definitely still fun. I’m actually pretty surprised because I’m not involved in the show discussions at all and assumed it was still pretty popular.",
            "score": 1,
            "replies": [
                {
                    "author": "Houdini-88",
                    "body": "It was already dead in the water when Gavin left to be honest",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "skyewardeyes",
            "body": "This show had such massive pacing issues—they would build stuff up, resolve it in 2 minutes randomly, and never speak of it again.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CrusaderLyonar",
            "body": "Im little surprised it lasted this long",
            "score": 1,
            "replies": [
                {
                    "author": "FriendlyPace3003",
                    "body": "I stumbled upon season 1 recently, binged it, and enjoyed it and then it rolled into season 2 and it got so freaking bad! Like the most extreme unrealistic caricatures of themselves. Not surprised it didn’t last.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ls7eveen",
                    "body": "That's what she said",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "jam048",
            "body": "I really liked season 3 after Renee left. The Taylor storyline was random but the new roommate was funny and loved all the original girls’ stories. \n\nSad!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lolah15",
            "body": "It started good, but the lack of continuity in the storyline made it really bad.",
            "score": 1,
            "replies": []
        },
        {
            "author": "aclaws0617",
            "body": "this makes me sad but i totally understand it. i LOVED the first season and had so much hope for the series but it declined rapidly. I just really wanted Bela and Eric to reconcile </3",
            "score": 1,
            "replies": []
        },
        {
            "author": "plantbay1428",
            "body": "Amrit accidentally called it the series finale instead of the season finale in her post for the last episode of the third season. She edited it after people called it out but I think the cast already knew it’d be the last season. \n\nHoping they can still be a part of the Mindy universe and maybe be in Running Point or any new productions. Alyah Chanelle Scott is too good between SLOCG and Reboot (wish that was renewed as well) - I can’t wait to see her new play. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "SugarShock94",
            "body": "Not surprising but still sad. I enjoyed S3 and it ended on a great note.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Traditional-Joke3707",
            "body": "I don’t understand why’d you cast Rene or her brother in s1 with weak contracts ? It’s not like back in those days where Ashton Kutcher or Kathy bates would replace main cast and keep going on about it",
            "score": 1,
            "replies": []
        },
        {
            "author": "yeehaw908",
            "body": "That ending made me think they knew it was over. I will say watching that first season while it aired was everything it was sooo good",
            "score": 1,
            "replies": []
        },
        {
            "author": "natur_al",
            "body": "NOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO",
            "score": 1,
            "replies": []
        },
        {
            "author": "trulyremarkablegirl",
            "body": "I loved season 1, but every single character became completely insufferable in season 2. I haven’t even bothered to watch season 3 bc of Renee leaving.",
            "score": 1,
            "replies": []
        },
        {
            "author": "aintgoinbacknforth",
            "body": "Ughhhhhhhhhhh. I loved this show 😭",
            "score": 1,
            "replies": []
        },
        {
            "author": "BakedPlantains",
            "body": "Season 3 wasn't great for a variety of reasons, but the cast is barely believable as college students. Seems like they're naturally aging out of their roles",
            "score": 1,
            "replies": []
        },
        {
            "author": "RogueKitteh",
            "body": "Too bad. First two seasons were INCREDIBLE. So funny, quick, smart. Every scene with Bella was gold 😂.\nGuess it really couldn't survive without Reneé Rapp",
            "score": 1,
            "replies": []
        },
        {
            "author": "nonsensestuff",
            "body": "It was a fun show to throw on casually— but I felt like when Renae left, it really lost its footing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NoCoFoCo31",
            "body": "This makes me sad. Was season 3 great? No. But it was one of the more fun and unique shows on TV.",
            "score": 1,
            "replies": []
        },
        {
            "author": "echoesandripples",
            "body": "i'm in the minority because i disliked s2 and liked s3, as I hated Leighton\n\n\nbut i'm gonna miss Bela and Whit, along with some awesome side characters, which were a great part of this show, often overlooked in other ensembles. Kimberly, however, was awful.",
            "score": 1,
            "replies": []
        },
        {
            "author": "tsabin_naberrie",
            "body": "*damn*",
            "score": 1,
            "replies": []
        },
        {
            "author": "fromyoutheflowers",
            "body": "Leighton Murray you will always be famous",
            "score": 1,
            "replies": []
        },
        {
            "author": "islandgyalislandgyal",
            "body": "renee leaving truly destroyed the show",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hooplapooplayeah",
            "body": "Only saw s1 and I had fun. Is s2 worth it??",
            "score": 1,
            "replies": [
                {
                    "author": "NoCoFoCo31",
                    "body": "All seasons are worth it IMO. I’d rank them in the release order.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ConsistentAd5004",
            "body": "😭😭😭",
            "score": 1,
            "replies": []
        },
        {
            "author": "reticencias",
            "body": "As someone whos not on twitter this is extremely jarring to me",
            "score": 1,
            "replies": []
        },
        {
            "author": "prinxcess12",
            "body": "my shayla 💔",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dry_Accident_2196",
            "body": "I’m not a college girl so I wasn’t the demo audience but the show sucked. It simply wasn’t realistic in any way shape or form and that annoyed me so much. \n\nBut women seem to like it, so glad they got a show that catered to that demographic. We all deserve a piece of the TV pie.",
            "score": 1,
            "replies": [
                {
                    "author": "Key-Beginning-8500",
                    "body": "I’m guessing the writing was ridiculous and humorous on purpose, it certainly wasn’t going for an accurate portrayal of anything ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Dry_Accident_2196",
                            "body": "Yeah, I assumed that as well. Didn’t land for me but it’s a shame it went downhill because it had a lot of love online",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ok-Yogurtcloset3467",
            "body": "I tried the first episode of this sometime this year and was genuinely shocked it had an audience",
            "score": 1,
            "replies": []
        },
        {
            "author": "fastingslowlee",
            "body": "Hard for a show like that to succeed with 0 hot actors",
            "score": 1,
            "replies": [
                {
                    "author": "Far-Imagination2736",
                    "body": "I'm such a bitch but i kept being taken out of the show from Kimberly being the hottest girl of the group to every guy they met\n\nAnyway Renee Rapp and the actress for Whitney are v hot wdym 😭",
                    "score": 1,
                    "replies": [
                        {
                            "author": "NoCoFoCo31",
                            "body": "Straight guy here: that’s how it always works. Almost like guys have at least some preference on personality and “aura” over just looks.\n\nGoofy, smart girl, with big boobs and cute face? That’s like everyone in real life’s dream girl.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Traditional-Joke3707",
            "body": "About time …",
            "score": 1,
            "replies": []
        }
    ]
}