{
    "title": "Uk amazon threatening me to pay after I did a chargeback",
    "author": "Professional_Lake335",
    "subreddit": "LegalAdviceUK",
    "rank": 2,
    "score": 330,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 84,
    "url": "https://www.reddit.com/r/LegalAdviceUK/comments/1je4mw5/uk_amazon_threatening_me_to_pay_after_i_did_a/",
    "id": "1je4mw5",
    "selftext": "For more info I ordered AirPods that never arrived all I got was an empty box so I went to their chat service to get a refund they told me to go and file a police report after I had a chance to they told me my refund wasn’t going to happen because I had another refund a few months back and a return \n\nSo then I went to Reddit to see what I could do and I filed a chargeback from my bank and got this email telling me to payback the amount or theyll charge any valid card on the account . What can I do from here? I deleted all the saved cards on the account after seeing this so what will happen?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n---\n###Welcome to /r/LegalAdviceUK\n---\n\n\n**To Posters (it is important you read this section)**\n\n* *Tell us whether you're in England, Wales, Scotland, or NI as the laws in each are very different*\n\n* If you need legal help, you should [always get a free consultation from a qualified Solicitor](https://reddit.com/r/LegalAdviceUK/wiki/how_to_find_a_solicitor)\n\n* We also encourage you to speak to [**Citizens Advice**](https://www.citizensadvice.org.uk/), [**Shelter**](https://www.shelter.org.uk/), [**Acas**](https://www.acas.org.uk/), and [**other useful organisations**](https://reddit.com/r/LegalAdviceUK/wiki/common_legal_resources)\n\n* Comments may not be accurate or reliable, and following any advice on this subreddit is done at your own risk\n    \n* If you receive any private messages in response to your post, [please let the mods know](https://www.reddit.com/message/compose?to=%2Fr%2FLegalAdviceUK&subject=I received a PM)\n\n**To Readers and Commenters**    \n\n* All replies to OP must be *on-topic, helpful, and legally orientated*\n\n* If you do not [follow the rules](https://www.reddit.com/r/LegalAdviceUK/about/rules/), you may be perma-banned without any further warning\n\n* If you feel any replies are incorrect, explain why you believe they are incorrect\n\n* Do not send or request any private messages for any reason\n\n* Please report posts or comments which do not follow the rules\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LegalAdviceUK) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Super_Chayy",
            "body": "Nothing, they could try and charge another card, but you'd have the same chargeback rights.\n\nUltimately, you'll keep the money, but liklihood is that Amazon will ban you from using their products and services until you pay it back.\n\nThis can have further reaching consequences than you'd like to imagine, old customer of mine found they were unable to get Uber taxis anywhere due to a chargeback their friend did against an Ubereats order a year prior.\n\nThis, however, does not change that you're entitled to that chargeback and the missing item is a claim for them to make with the delivery firm if not themselves.",
            "score": 438,
            "replies": [
                {
                    "author": "trumbulubaboobo",
                    "body": "\\>same chargeback rights\n\nMore chargeback rights. That's a blatant unauthorized transaction.",
                    "score": 175,
                    "replies": [
                        {
                            "author": "Scot_Survivor",
                            "body": "Criminal theft as well at that point, surely?",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "Happytallperson",
                                    "body": "No, because you'd fail at the dishonesty element.",
                                    "score": -13,
                                    "replies": [
                                        {
                                            "author": "Recent-Plantain4062",
                                            "body": "I don't actually think you would - we're in a post-Ghosh world and the reasonable person would consider it to be dishonest to charge a card without authorisation.",
                                            "score": 16,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "LegalAdviceUK-ModTeam",
                            "body": "**Unfortunately, your comment has been removed for the following reason(s):**\n\nPlease only comment if you know the legal answer to OP's question and are able to provide legal advice.\n\n[Please familiarise yourself with our subreddit rules](https://www.reddit.com/r/LegalAdviceUK/about/rules/) before contributing further, and [message the mods](https://www.reddit.com/message/compose/?to=/r/LegalAdviceUK) if you have any further queries.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "CountryMouse359",
            "body": "The correct thing to do was really to quote the Consumer Right Act re passing of risk, and note that the goods were not in your physical possession and therefore still the responsibility of Amazon. You could have reported it to the police, though technically not your responsibility as you are not technically the victim, Amazon is.\n\nIf there is no valid card on the account, if Amazon want the money they will need to take civil action against you. I would raise a complaint with Amazon about their handling of the situation.",
            "score": 244,
            "replies": [
                {
                    "author": "bunnyslippers69",
                    "body": "This doesn't work. I've gone this route before (consumer rights, passing of risk, police report, complaint) and they eventually stop responding to emails. They don't care in the slightest if it's their responsibility.",
                    "score": 57,
                    "replies": [
                        {
                            "author": "Electrical-Injury-23",
                            "body": "Thanks. Every day my decision to bin amazon is confirmed as the right one.",
                            "score": 40,
                            "replies": []
                        },
                        {
                            "author": "IdioticMutterings",
                            "body": "Thats when you send a letter before action to their EU head office, giving them 14 days to make good, and then you hit them with a MCOL, which they will probably ignore, so you hit them with an enforcement notice, and send in the Bailiffs. When the bailiffs turn up with the enforcement notice, and start removing goods, thats when they finally pay attention.",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "coldharbour1986",
                                    "body": "Have you actually ever done this though?",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "IdioticMutterings",
                                            "body": "Once, but not with Amazon. With ebay, actually. The net result was that I got my money back, but ebay then permbanned me from using ebay.",
                                            "score": 21,
                                            "replies": [
                                                {
                                                    "author": "OneDonut2664",
                                                    "body": "Tell me more about ebay. I'm having trouble with them at the moment as a buyer - bought a hard to find car part from a guy 5 miles from me so was ideal .Ultimately he couldn't find it and as it was over 30 days Ebay weren't interested.",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "EponymousTitus",
                                            "body": "I have. To the old mobile company Orange.  Such an utterly disfunctional company they literally ignored everything until the bailiffs turned up at their offices.  Oh then suddenly  they did have a legal department and they wanted to talk. F’ing idiots.",
                                            "score": 21,
                                            "replies": []
                                        },
                                        {
                                            "author": "turnstileblues1",
                                            "body": "I've done this with Amazon, after multiple nonsense requests for police reports. \nI wasted some police time by gaining a crime reference number, but they were unwilling to write a crime report and told me that Amazon were the ones who were a victim of crime, not me. \nSo I filled in the MCOL forms. \n\nAmazon replied faster than I expected and settled the dispute rapidly. \nI expected my account to be closed, but it wasn't.",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "Esperanto_lernanto",
                                            "body": "I personally haven't, but the cost of going to small claims court in England is very low and I do know people who have successfully resolved similar matters that way.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "CountryMouse359",
                            "body": "It depends who you chat to, and probably the value of the item, but it's best to make it clear that you know your rights before going for a more nuclear option.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Professional_Lake335",
            "body": "Thanks for all the comments and advice seriously much appreciated I can’t reply to everyone but I’ve read them all so thanks again for the heads up",
            "score": 76,
            "replies": []
        },
        {
            "author": "OneSufficientFace",
            "body": "Write back to them quoting the UK consumer rights act, which they must obide to operating in the UK as it is the law here. It is for them to report to the police and for them to take on responsibility.  Until the product is physically in your hands it is entirely for Amazon to deal with. Tjey just don't want the loss/ the work. Tell them anymore communication on the matter, other than a proper resolution, will result in you reporting them for herrassment and trying to duck out of their legal responsibilities,  of which you can report to trading standards as you also have the evidence of it.\n\nYou can also raise the issue with resolver.\n\nhttps://www.resolver.co.uk/",
            "score": 64,
            "replies": [
                {
                    "author": "SKYLINEBOY2002UK",
                    "body": "I had to do this recently with American company but they sent from UK warehouse but wanted me to return to usa. \n\nArgued why because the box had uk warehouse on it. \n\nQouted our uk rights at them (literally copy paste) and they gave in \"this time, after speaking to manager as goodwill bs\".",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "PartHerePartThere",
            "body": "When Amazon screwed up and you couldn’t get anywhere with CS you used to be able to email Jeff at Amazon .com - it never actually got to Bezos but the issue would be handled by a team that had a decent amount of clout. You could still try and see what happens.",
            "score": 17,
            "replies": []
        },
        {
            "author": "Key_Database6091",
            "body": "To be honest, I have started avoiding Amazon where possible due to this. John Lewis price match Amazon electrical and have better customer service.",
            "score": 15,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 14,
            "replies": [
                {
                    "author": "LegalAdviceUK-ModTeam",
                    "body": "**Unfortunately, your comment has been removed for the following reason(s):**\n\nYour comment was an anecdote about a personal experience, rather than legal advice specific to our posters' situation. \n\nPlease only comment if you can provide meaningful legal advice for our posters' questions and specific situations.\n\n[Please familiarise yourself with our subreddit rules](https://www.reddit.com/r/LegalAdviceUK/about/rules/) before contributing further, and [message the mods](https://www.reddit.com/message/compose/?to=/r/LegalAdviceUK) if you have any further queries.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 9,
            "replies": [
                {
                    "author": "LegalAdviceUK-ModTeam",
                    "body": "**Unfortunately, your comment has been removed for the following reason(s):**\n\nYour comment was an anecdote about a personal experience, rather than legal advice specific to our posters' situation. \n\nPlease only comment if you can provide meaningful legal advice for our posters' questions and specific situations.\n\n[Please familiarise yourself with our subreddit rules](https://www.reddit.com/r/LegalAdviceUK/about/rules/) before contributing further, and [message the mods](https://www.reddit.com/message/compose/?to=/r/LegalAdviceUK) if you have any further queries.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Prefect_99",
            "body": "I had an almost identical issue with an empty CPU. I filed a police report despite it not being my obligation then gave them ample opportunity to refund before making a section 75 claim. Police report helped add weight to the claim. I informed Amazon any further attempt by them to charge I would consider and report as fraud. They shut up and never did with no impact on any other services.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Desperate-Calendar78",
            "body": "Did the airpod box arrive and they are missing from the Apple box or was the airpod box missing from the Amazon box?\n\nI worry when say you've got 5 boxes coming to you, the driver hands over 4, you don't say anything because you only know you are getting a delivery, not how the items were packed, and you've given the passcode over for the 5th box that you never received.",
            "score": 18,
            "replies": [
                {
                    "author": "Professional_Lake335",
                    "body": "Missing from the Amazon box",
                    "score": 14,
                    "replies": [
                        {
                            "author": "Desperate-Calendar78",
                            "body": "Cheers, was that the only item in the box, assuming it was?",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Professional_Lake335",
                                    "body": "Yeah it was I ordered 2 things but they were in separate boxes and I got both boxes",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "Desperate-Calendar78",
                                            "body": "That's crappy, I wish you luck with that, assist from over lockdown I rarely see the same driver for more than a month.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AlexJamesHaines",
                    "body": "I've actually always worried about this myself so I insist on knowing which box the code is for. That one then gets opened.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "akat224",
            "body": "I had the exact same issue! Ordered AirPods 2 years ago and the case was empty. If you search on google, you will find that lots of people have the same issue. Once i sent Amazon a link of this happening elsewhere , they returned my money.",
            "score": 6,
            "replies": []
        },
        {
            "author": "IdioticMutterings",
            "body": "Never order anything from Amazon anymore, if you can't afford to just throw that sum of money away.",
            "score": 3,
            "replies": []
        },
        {
            "author": "yurifivekay",
            "body": "I'm surprised as Amazon is normally quite good with customer service. If you don't report things missing they will refund. I'm guessing you have claimed money back before? The problem is like the rest have said, they will ban you. If you can live without amazon, don't worry about it.\n\nFight them.\n\nTell them to take you to small claims court I didn't recieve my item you don't recieve your money.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Intrepid-Tourist3290",
            "body": "Why does it matter if you had a refund recently? that's never stopped me getting refunds from Amazon for any reason. That's bizarre.",
            "score": 3,
            "replies": [
                {
                    "author": "GumiiDuck",
                    "body": "OP was identified by Amazon as a customer that may be trying to abuse the returns system. Based on previous behaviour/refund requests.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Intrepid-Tourist3290",
                            "body": "I understand that, but why? I've had all sorts of issues this year with many many delivery failures and I think I must have had about 7 refunds this year... twice in the last week. I have no idea how delivery drivers keep their jobs. The system is against them but the job doesn't get done properly",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "GumiiDuck",
                                    "body": "Honestly depends on the exact types of issues and products you encounter. For example ordering an expensive iPhone and saying it arrived without a phone is a high risk type of issue. But a customer complaining about a book arriving damaged is a normal occurrence with low risk of return abuse. Of course I don't know the exact factors, but this is one for sure.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Intrepid-Tourist3290",
                                            "body": "That's very true. Nothing I'd had issues with were high value items",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Unimatrix_Zero_One",
            "body": "How many times did you contact Amazon? The competence of their customer care team varies significantly depending on who you speak to. I’ve had situations where one agent had admitted a fault on their end and the next day another agent is denying it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "jimbojetset35",
            "body": "Apple Air Pods??... if so, they come factory sealed with tamper proof tabs!!!",
            "score": 2,
            "replies": []
        },
        {
            "author": "StuPat78",
            "body": "I’ve been on the Amazon prime subreddit for a while and this seems to be a common problem with them lately. So many people getting empty boxes, Amazon ask them to send it back and then deny a refund because they sent back an empty box. People then do a chargeback and get banned.",
            "score": 2,
            "replies": []
        },
        {
            "author": "T3CH42",
            "body": "In the future if this ever happens or you have trouble getting the refund email jeff@amazon.com they’ll sort it out pretty quickly",
            "score": 2,
            "replies": [
                {
                    "author": "GumiiDuck",
                    "body": "As it is UK amazon this will not really help. Amazon is divided by domain so in this case they need amazon.co.uk email",
                    "score": 2,
                    "replies": [
                        {
                            "author": "T3CH42",
                            "body": "Nope I’ve had to do this a few times and I’m definitely in the uk .com is what I used",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "GumiiDuck",
                                    "body": "Fair enough. Perhaps ECR is better at transferring to correct domain. Does make sense. But generally using the correct domain right away increases the chance for a response",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "T3CH42",
                                            "body": "Yeh I was being ran round the bushes making police reports then was told a crime number isn’t a police report and they need a written document, emailed that email and within 30 mins I had the refund confirmation, the item was £600+ so probably why they were being funny about it",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "jesus_mooney",
            "body": "I did a charge back to amazon about 10 years ago when i got a vape that was fake from them that i then had to return to China cos it was a 3rd party seller. Never got a refund. Did a charge back. My email and phone number are blacklisted by amazon. I'm all the better off for it. But can't access some kindle books and audible aduio books that i had bought.",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "LegalAdviceUK-ModTeam",
                    "body": "**Unfortunately, your comment has been removed for the following reason(s):**\n\nPlease only comment if you know the legal answer to OP's question and are able to provide legal advice.\n\n[Please familiarise yourself with our subreddit rules](https://www.reddit.com/r/LegalAdviceUK/about/rules/) before contributing further, and [message the mods](https://www.reddit.com/message/compose/?to=/r/LegalAdviceUK) if you have any further queries.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "author": "LegalAdviceUK-ModTeam",
                    "body": "**Unfortunately, your comment has been removed for the following reason(s):**\n\nYour comment was an anecdote about a personal experience, rather than legal advice specific to our posters' situation. \n\nPlease only comment if you can provide meaningful legal advice for our posters' questions and specific situations.\n\n[Please familiarise yourself with our subreddit rules](https://www.reddit.com/r/LegalAdviceUK/about/rules/) before contributing further, and [message the mods](https://www.reddit.com/message/compose/?to=/r/LegalAdviceUK) if you have any further queries.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -3,
            "replies": [
                {
                    "author": "LegalAdviceUK-ModTeam",
                    "body": "**Unfortunately, your submission has been removed for the following reason(s):**\n\nYour submission has been removed as it has not met our community standards on speaking to other posters. \n\nPlease remember to speak to others in the way you wish to be spoken to.\n\n[Please familiarise yourself with our subreddit rules](https://www.reddit.com/r/LegalAdviceUK/about/rules/) before contributing further, and [message the mods](https://www.reddit.com/message/compose/?to=/r/LegalAdviceUK) if you have any further queries.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "f-class",
            "body": "Reporting it to the police would have been a reasonable request - did you do that?\n\nIt doesn't matter what cards etc you've deleted, the chargeback is handled by the bank - and they'll just reverse it if Amazon provides the evidence that they have done everything correctly. When you get money from a chargeback, there is always a strong possibility that it will be reversed as the case progresses.\n\nThey won't charge other cards - it will be the one that has the chargeback associated with it.\n\nDepending on the amount, Amazon could also try to sue you in civil court. They're unlikely to do this unless you have persistently been a suspicious customer and/or they have clear evidence that you are lying.",
            "score": -76,
            "replies": [
                {
                    "author": "MythicalPurple",
                    "body": "> Reporting it to the police would have been a reasonable request - did you do that?\n\nWhy would OP report a theft that happened to Amazon to the police? Amazon should be reporting that.\n\nUntil the AirPods entered OP’s physical possession, they were essentially still Amazon’s property, and it’s up to Amazon to report a theft of their property.\n\nCompanies pull this all the time, and it’s just an attempt to put up artificial barriers to customers getting a refund. There’s zero legal recourse for OP here if someone at the Amazon warehouse or the delivery company stole from an Amazon box before it got to him, because nobody stole *from him*.\n\nIt’s *Amazon* who was the victim of a crime in that scenario. \n\nThey’re telling OP to report it as theft because they’re hoping whoever is at the desk or on 101 when he does will tell him “sorry, no crime was committed against you” so they can use the lack of a crime number to try to convince OP they’re not legally entitled to a refund when they are.\n\nIt’s scammy, abusive behavior and not only is it not “reasonable” it actively requires mis-interpreting the law. This isn’t the place to advise that.",
                    "score": 63,
                    "replies": [
                        {
                            "author": "bighairyferretuk",
                            "body": "Not up to the OP to report this to the police. It would be Amazon to do so. This has been documented here and in the national press (Guardian/Observer) before that this reporting as theft from Amazon is just a way for them to dodge their responsibility to the customer. \n\nIt is not reasonable to suspect the OP as non compliant at all, that is rubbish. OP can and should do a chargeback but Amazon will likely close their account but it's doubtful they will take this any further than that.\n\nPersonally I'd email Amazon CEO (Google CEO emails) and put a complaint in via that way. And also do a chargeback as well. I'd put in the complaint it is not your responsibility not is it legal for Amazon to push you to report this to the police and they are infringing on your consumer rights.",
                            "score": 23,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MyNameIsMrEdd",
                    "body": "Is it not Amazon's responsibility to report it to the police? Why has the customer suddenly taken on this responsibility? Amazon's job is to get the product into the customer's hands, and they've failed to do that here.",
                    "score": 63,
                    "replies": [
                        {
                            "author": "Desperate-Calendar78",
                            "body": "Didn't Amazon struggle to give the drivers details to the police when a pedestrian got driven over recently?  I don't think they'd care for a crime number, agreed it's not the customers job to flag post this to anyone other than Amazon, responsibility over.",
                            "score": 16,
                            "replies": []
                        },
                        {
                            "author": "f-class",
                            "body": "No - because the item has been accepted and Amazon has evidence that it was delivered, likely with photographs and GPS timestamps.\n\nDon't sign for or accept items that you haven't inspected/are happy with.\n\nOn the balance of probability, most reasonable people would consider that the item has been delivered unless the contrary is proven. \n\nIt is suspicious that a genuine customer would not want to cooperate by reporting the loss or theft of a high value item to the police, particularly after being asked to do just that. It doesn't sound like they were against making a refund themselves, so long as you made the report.",
                            "score": -50,
                            "replies": [
                                {
                                    "author": "2ABB",
                                    "body": ">Don’t sign for or accept items that you haven’t inspected/are happy with.\n\nDo you unwrap every amazon parcel before you accept it? Opening the product itself, past the security seal, to check it hasn’t been replaced with a rock? While the courier is standing there?",
                                    "score": 30,
                                    "replies": [
                                        {
                                            "author": "f-class",
                                            "body": "If it's an expensive item, yes. It can annoy the courier, but most understand. It takes less than a minute.",
                                            "score": -34,
                                            "replies": [
                                                {
                                                    "author": "MythicalPurple",
                                                    "body": "You are under zero legal obligation to do this, and not doing it doesn’t affect your statutory rights.\n\nThe fact you *choose* to do so doesn’t make it a legal requirement to do so.\n\nThis is legal advice, not “anecdotal advice”. ",
                                                    "score": 37,
                                                    "replies": [
                                                        {
                                                            "author": "Brandaman",
                                                            "body": "Not to mention 99.9% of the time, any Amazon parcel delivered to me is just left on my doorstep with no notification it’s even there. No knock, no doorbell rung. Can’t exactly inspect it before “accepting” that.",
                                                            "score": 19,
                                                            "replies": [
                                                                {
                                                                    "author": "2ABB",
                                                                    "body": "Or if the courier hands it to you, they take a picture of it in your hands and jog off.",
                                                                    "score": 11,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "Aggravating_Ad5632",
                                                                    "body": "This is exactly what I experience most of the time, despite the fact that my safe place is 4 steps from the front door and delivery instructions are on my account. I've had numerous refunds from them without any problems; if there's no proof of delivery, I win the case, and if the proof shows the item left by my front door, that's also a win for me because that spot is clearly visible from the pavement and anything left there is a free gift for the taking.",
                                                                    "score": 10,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "MythicalPurple",
                                    "body": "> No - because the item has been accepted and Amazon has evidence that it was delivered, likely with photographs and GPS timestamps.\n\nYou are completely incorrect here. The law is extremely clear. The *item you ordered* has to enter your physical possession. Not an empty box. Not some other item. \n\nYou do not give up any of your statutory rights if you don’t inspect the item at the time of delivery.\n\nCan you please cite the legislation or case law you are relying on for your “advice”?",
                                    "score": 30,
                                    "replies": []
                                },
                                {
                                    "author": "YammyStoob",
                                    "body": "We've got some drivers that will ring, leave it on the step and be well on their way before I've answered the door. No-one signs for parcels these days, the driver just takes a photo.",
                                    "score": 10,
                                    "replies": []
                                },
                                {
                                    "author": "RepresentativeNo3680",
                                    "body": "You have no idea how UK law works, don't post misinformation",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "LonelyKuma",
                                            "body": "I haven't signed for an amazon package in years. Usually, they just ring the doorbell and leave it there. They are already back in the van by the time I get to the door.",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "On_The_Blindside",
                    "body": ">Reporting it to the police would have been a reasonable request - did you do that?\n\nWhy? Do you not understand the law in the UK?\n\n>They won't charge other cards - it will be the one that has the chargeback associated with it.\n\nI'd hope not, that's an unauthorised transaction and illegal. If they did this OP would be able to, successfully, sue them.\n\n>Depending on the amount, Amazon could also try to sue you in civil court. \n\nFor what?",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "Competitive_Buy6402",
                    "body": "But doesn’t the distance selling act provide legal protection for this chargeback if it was reported immediately that the product bought is not the product received. Provided the parcel is returned as received.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "gobuddy77",
                            "body": "That's an interesting approach. You ordered ipods, you got a carrot - that's different to the product advertised so you are returning it. Or you ordered ipods, got a carrot and you're just returning it under the right to refuse. Both approaches do rely on having evidence that the carrot was what we received though. I have taken to doing unwrapping videos of high value items from Amazon for that reason.\n    \nYou (we) all run the risk of Amazon blacklisting us. There is no absolute right to Amazon deliveries.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "f-class",
                            "body": "That isn't how distance selling works. You are claiming that the item never arrived. Distance selling relates to the right to return items etc. You appear to be saying that you do not have the ability to return the item, as you claim you haven't received it.\n\nAmazon is saying it did arrive and either you're lying or there's been a criminal offence and it's been stolen. \n\nYou're saying you're not lying - so Amazon asked you to report it to the police, (which would have taken about 30 mins of your time to do). \n\nAmazon is probably wondering why you are refusing to report it to the police, compounded by the fact that you seem to have had a previous incident requiring a refund.",
                            "score": -18,
                            "replies": [
                                {
                                    "author": "cjeam",
                                    "body": "Yes, indeed Amazon are asking the customer to report that something was stolen _from Amazon_, which is why Amazon needs to be the one making that criminal report.",
                                    "score": 21,
                                    "replies": []
                                },
                                {
                                    "author": "RepresentativeNo3680",
                                    "body": "It's not your responsibility to go to the police, of you do they will just say no crime has been commited against you... it happens all the time it's well known at this point how can you be so wrong so confidently",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -10,
            "replies": [
                {
                    "author": "LegalAdviceUK-ModTeam",
                    "body": "**Unfortunately, your comment has been removed for the following reason(s):**\n\nPlease only comment if you know the legal answer to OP's question and are able to provide legal advice.\n\n[Please familiarise yourself with our subreddit rules](https://www.reddit.com/r/LegalAdviceUK/about/rules/) before contributing further, and [message the mods](https://www.reddit.com/message/compose/?to=/r/LegalAdviceUK) if you have any further queries.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}