{
    "title": "My landlord is asking for money back after sending us our full deposit",
    "author": "Prestigious_Tea_9545",
    "subreddit": "LegalAdviceUK",
    "rank": 13,
    "score": 7,
    "upvote_ratio": 0.77,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.reddit.com/r/LegalAdviceUK/comments/1jef3gj/my_landlord_is_asking_for_money_back_after/",
    "id": "1jef3gj",
    "selftext": "Hey there, I've recently moved house and our landlord at our old property sent us the full deposit amount from one of the deposit scheme companies and is now turning around and trying to say we owe him part of the deposit back and that we agreed to pay that portion.\n\nMy question is as he skirted around removing that money through the deposit company do we need to pay him? My ex-flatmates believe that we're fine and that as he didn't use the legal means he's just trying to take money from us (Which is believable, he was a horrible landlord, who broke several laws in our time there we were just young and naive.) however the whole situation just has me really stressed, I can't seem to stop thinking about it and I guess I just wanted some advice on what to do and whether I should just send him the money? Based in Scotland by the way.\n\nTLDR\n\nLandlord sent us full deposit back through deposit company,\n\nHe's saying we owe him a portion for damages sustained during our time living there,\n\nI'm wondering what I should do as its stressing me out a bit.\n\nBased in Scotland, and thank you in advance for anyone willing to lend some advice!\n\n  \nEarly update\n\nIt seems pretty clear my flatmates were correct, thank you everyone! I kind of felt like this was the case however my brains pretty anxious about these things so sincerly thank you.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "\n---\n###Welcome to /r/LegalAdviceUK\n---\n\n\n**To Posters (it is important you read this section)**\n\n* *Tell us whether you're in England, Wales, Scotland, or NI as the laws in each are very different*\n\n* If you need legal help, you should [always get a free consultation from a qualified Solicitor](https://reddit.com/r/LegalAdviceUK/wiki/how_to_find_a_solicitor)\n\n* We also encourage you to speak to [**Citizens Advice**](https://www.citizensadvice.org.uk/), [**Shelter**](https://www.shelter.org.uk/), [**Acas**](https://www.acas.org.uk/), and [**other useful organisations**](https://reddit.com/r/LegalAdviceUK/wiki/common_legal_resources)\n\n* Comments may not be accurate or reliable, and following any advice on this subreddit is done at your own risk\n    \n* If you receive any private messages in response to your post, [please let the mods know](https://www.reddit.com/message/compose?to=%2Fr%2FLegalAdviceUK&subject=I received a PM)\n\n**To Readers and Commenters**    \n\n* All replies to OP must be *on-topic, helpful, and legally orientated*\n\n* If you do not [follow the rules](https://www.reddit.com/r/LegalAdviceUK/about/rules/), you may be perma-banned without any further warning\n\n* If you feel any replies are incorrect, explain why you believe they are incorrect\n\n* Do not send or request any private messages for any reason\n\n* Please report posts or comments which do not follow the rules\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LegalAdviceUK) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "VerbingNoun413",
            "body": "Tell him to jog on. If he persists, block him.\n\nIf he attempts to reclaim the money via court, he will lose. The courts take a dim view of landlords wasting court time trying to eschew the protection scheme.",
            "score": 30,
            "replies": []
        },
        {
            "author": "mindstarrising",
            "body": "He should have made his claim before the money was paid back to you... He going to struggle to get it back from you now.\n\nLeave him to it and if he raises a court action you can seek legal advice.\n\nBut given it is for a couple of hundred pounds he is unlikely to do that.",
            "score": 14,
            "replies": []
        },
        {
            "author": "damianvandoom",
            "body": "Block his number and move on. \n\nDo not respond. Forgot about it.",
            "score": 12,
            "replies": []
        },
        {
            "author": "bossleve1",
            "body": "You owe him nothing. Explain politely that the whole point of the deposit protection scheme is to deal with any such issues. Since he himself agreed to return the full deposit to you there isn’t anything else to be discussed and nothing owed. Ignore all communications from that point forward.",
            "score": 3,
            "replies": [
                {
                    "author": "oldvlognewtricks",
                    "body": "Or don’t explain anything because it’s the landlord’s job to know this stuff. Block and move on.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "newfor2023",
            "body": "If you did the same would they pay? No.",
            "score": 2,
            "replies": []
        }
    ]
}