{
    "title": "It looks like the tariffs on Mexico will not be implemented.",
    "author": "Ok-Musician3580",
    "subreddit": "LateStageCapitalism",
    "rank": 490,
    "score": 2549,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 202,
    "url": "https://i.redd.it/aajr355n3yge1.jpeg",
    "id": "1igs3le",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "IntrinsicCarp",
            "body": "Assuming this is going to happen, it makes sense for Claudia as someone who already promised to attack the cartels. while it keeps in line with her policies i feel for the people of mexico forced to escalate militarization",
            "score": 1364,
            "replies": [
                {
                    "author": "Appropriate_Ant_4629",
                    "body": "> as someone who already promised to attack the cartels\n\nEven [the ones partnered with the US](https://archive.ph/iepDy)?",
                    "score": 247,
                    "replies": [
                        {
                            "author": "Macefire",
                            "body": "From the article you posted. \n\n >> The period when the relationship between the DEA and Sinaloa was supposed to have been the closest, between 2006 and 2012, saw a major surge of violence in Mexico, and was the time when the Sinaloa cartel rose significantly in prominence.",
                            "score": 146,
                            "replies": [
                                {
                                    "author": "clubmedschool",
                                    "body": "May Calderón never know a minute of peace for the rest of his life",
                                    "score": 47,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "marketingguy420",
                    "body": "Me, personally, I love the Tobias Funke approach to domestic and international politics. Has foreign military escalation ever worked to do anything good in South, Central, or North America? No. But I think it'll work this time.",
                    "score": 296,
                    "replies": [
                        {
                            "author": "m0o",
                            "body": "How can it work. We yell “cartel” but the military weapons that arm the cartel comes from US weapons manufacturers.\n\nThen there’s the long history of the CIA militarizing the drug cartels. ",
                            "score": 250,
                            "replies": [
                                {
                                    "author": "Boneless-",
                                    "body": "Ig it wouldn’t be entirely wrong if Trump targeted and dismantled the CIA",
                                    "score": 38,
                                    "replies": [
                                        {
                                            "author": "maroger",
                                            "body": "Hahahaha! Dismantle the CIA? The CIA is an extra-governmental terrorist organization that will murder anyone in power questioning its existence.",
                                            "score": 30,
                                            "replies": [
                                                {
                                                    "author": "alexxxor",
                                                    "body": "This sounds like a win-win situation then.",
                                                    "score": 13,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "marketingguy420",
                                            "body": "He appears to have just totally defunded USAID, which has long just been a CIA front.",
                                            "score": 50,
                                            "replies": [
                                                {
                                                    "author": "Boneless-",
                                                    "body": "Ok now you’re just getting carried away, the USAID has done a lot of good for some people.",
                                                    "score": -19,
                                                    "replies": [
                                                        {
                                                            "author": "mofrappa",
                                                            "body": "Wrong. It's a CIA front like he said.",
                                                            "score": 24,
                                                            "replies": [
                                                                {
                                                                    "author": "palebluekot",
                                                                    "body": "He's not wrong. It has provided legitimate aid to people. It has also coordinated with and served as a front for CIA agents. Both things can be true. Please use some nuance instead of a black-and-white worldview.",
                                                                    "score": 33,
                                                                    "replies": [
                                                                        {
                                                                            "author": "tokrazy",
                                                                            "body": "Glad to see this. They push the interests of the Government and the Oligarchs, but sometimes that means actually helping people.",
                                                                            "score": 5,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Boneless-",
                                                                    "body": "Ok interesting, what are yalls thought on the MIC?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "mofrappa",
                                                                            "body": "It runs the country. Ike was right.",
                                                                            "score": 8,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "mykineticromance",
                                            "body": "my tinfoil hat theory is that he'll try to dismantle it when the full MLK, RFK, and JFK assassination info comes out in a few months (mostly joking but it would be funny if it happened)",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "squirtdemon",
                                    "body": "Well, narcos are capitalists too. I guess CIA prefer to have armed narcos instead of armed communists.",
                                    "score": 17,
                                    "replies": []
                                },
                                {
                                    "author": "heartbeats",
                                    "body": "It’s Sicario irl",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ShowsTeeth",
                            "body": "Americans lived through a middle class golden age on the backs of a wide variety of foreign military escalations...",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ZaxOnTheBlock",
                    "body": "hi working class mexican here. This \"deal\" about the 10k troops at the border is basically unsubstantial to mexican politics or everyday life  or anything of the like. \n\nTo be honest its kinda late to feel for the mesxican people for a forced escalation on militarization, that should have been in '08 lol. \n\n  \nOur relationship as a whole with the military is pretty solid and it hasn't affected us as it has been  almost 20 years since mexico got heavily militirized. \n\nBut we are all rolling our eyes, as this whole thing has been just a big charade and this 10k troops at the border ain't doing shit, we all know it, you guys must know it, is jus a waste of resources and fopr Donny this is just a stunt for fox news and his whole weird ass fanbase.",
                    "score": 97,
                    "replies": [
                        {
                            "author": "panait_musoiu",
                            "body": "i think you underestimate the situation but maybe i\\`m in the wrong as i\\`m far away; but i think he just needs to be able to say 'see, i\\`ve tried through negotiations and it didn\\`t work, the\\`re in bad faith, slap those tariffs hard and deploy drones all over the border.'\n\n  \n\\`cause we need to account for the fact that 2025 cheap drones can do things impossible in \\`08.",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "killerzeestattoos",
                                    "body": "I read something before that the 10,000 troops that she's sending are exactly what she promised Biden last year. So nothing's changed, it's just been all for show",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "panait_musoiu",
                                            "body": "hence the bad faith i was mentioning; i mean if u and me know this i think trump knows it too.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "killerzeestattoos",
                                                    "body": "Yeah he's 2-faced",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "IntrinsicCarp",
                            "body": "ok good to know, i always worry when people are mobilized how it is affecting them. ",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "IoGibbyoI",
                            "body": "I just realized that’s 5 troops per mile of the mix can border. If you asked me and 4 friends to cover a mile looking for folks, we wouldn’t find anyone.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Tonylolu",
                    "body": "Eh I don’t think we will see further militarization. There’s already plenty of presence of the army and they don’t really bother citizens much.",
                    "score": 25,
                    "replies": []
                },
                {
                    "author": "DevanteWeary",
                    "body": "Question from someone who hasn't really been following politics in Mexico...\n\nWhat has she done to attack the cartels since she got elected?",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Exact-Quote3464",
            "body": "On a side note: there’s no way he wrote that himself, it’s too coherent, no caps, no abuse of punctuation…",
            "score": 1071,
            "replies": [
                {
                    "author": "thekingswitness",
                    "body": "Agreed, there is no way he knew “wherein” was a word",
                    "score": 443,
                    "replies": [
                        {
                            "author": "Exact-Quote3464",
                            "body": "That’s also the word that immediately made me think he didn’t write that, yup!\n\nAs a non-native English speaker, tbh I didn’t know this word myself, and I thought “If I don’t know this word, neither does Trump” because frankly, I suspect I speak English better than he does lol",
                            "score": 187,
                            "replies": [
                                {
                                    "author": "miserylovescomputers",
                                    "body": "From your comment I can already tell your grasp of the English language is significantly better than his.",
                                    "score": 65,
                                    "replies": [
                                        {
                                            "author": "Exact-Quote3464",
                                            "body": "That’s nice of you to say, I appreciate it! The bar is low with Trump but the thought that I likely speak English better than a native English speaking President is still satisfying haha So, thanks!",
                                            "score": 30,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Notabagofdrugs",
                                    "body": "I’d bet my life savings on it that you do!",
                                    "score": 29,
                                    "replies": []
                                },
                                {
                                    "author": "turquoise_amethyst",
                                    "body": "I couldn’t tell that you *weren’t* a native English speaker from your posts! But yes, I suspect you DO probably speak, read, and write English more fluently than he does!\n\nWhat is your native language if you don’t mind me asking? French?",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Exact-Quote3464",
                                            "body": "Thank you! Glad to know that I can bamboozle people into thinking I’m a native English speaker if needed lol (I can only dupe people online though, my accent 100% betrays me).\n\nThat’s right, oui, French!",
                                            "score": 10,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "fartypartner",
                            "body": "100% he doesn’t know about and has never used that word.",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "babadum",
                            "body": "Bigly",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Acrobatic-Fun-3281",
                    "body": "I guess it wasn't meant for the functionally-illiterate MAGAts to read",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Busy_Pound5010",
                    "body": "he typed it on the xitter machine elmo gave him",
                    "score": 24,
                    "replies": []
                },
                {
                    "author": "jessiephil",
                    "body": "He definitely would have misspelled the people in his cabinets names.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "FighterOfEntropy",
                    "body": ">>On a side note: there’s no way he wrote that himself, it’s too coherent, no caps, no abuse of punctuation…\n\nThere is an abuse of punctuation, though. There are quotation marks around the word deal. Maybe it’s not really a deal, but something that looks like a deal.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "cobaltsteel5900",
            "body": "Created a problem that didn’t have to exist, and then “fixed” said problem. \n\nClassic",
            "score": 700,
            "replies": [
                {
                    "author": "michealcowan",
                    "body": "The best part is that this will probably have little to no effect of drugs coming from Mexico to the US. Most drugs come in through official points of entry, and more soldiers won't make a difference",
                    "score": 222,
                    "replies": [
                        {
                            "author": "Avril_14",
                            "body": "The \"war on drugs\" it's always a charade. Nothing better than low cost drugs to keep the masses in check.",
                            "score": 104,
                            "replies": [
                                {
                                    "author": "eu_sou_ninguem",
                                    "body": "Not just that, but the war on drugs + the US's shenanigans in Central and South America for most of the last 100 years are directly responsible for the border crisis. You don't get to destabilize countries and let cartels run rampant without making people want to flee from all that.",
                                    "score": 41,
                                    "replies": [
                                        {
                                            "author": "Avril_14",
                                            "body": "It's like here in europe when they say \"stop economic immigration\".....dude WE are the reason why there's economic immigration.",
                                            "score": 21,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Artistic_Button_3867",
                            "body": "Ever give a toddler an unplugged controller? This is the global politics version of that",
                            "score": 16,
                            "replies": []
                        },
                        {
                            "author": "Acrobatic-Fun-3281",
                            "body": "Imagine how the MAGAts would react if interdiction policies--they've been around since Nixon, and dope is as cheap and easy to get as ever--were in fact successful.  They might even have to start cooking meth again.  I can hear the meth-labs exploding already",
                            "score": 26,
                            "replies": []
                        },
                        {
                            "author": "fetus-wearing-a-suit",
                            "body": "There's even what's called \"blind mules\". People that cross the border get a package hidden on the bottom of their cars or in their trunk and they unsuspectingly cross the drugs.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "michealcowan",
                                    "body": "I didn't know that, but that's honestly an innovative way to smuggle drugs.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Unfounddoor6584",
                            "body": "Yeah but then they get to blame \"the democrats\"",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "michealcowan",
                                    "body": "Dudes crashing the global economy to own the libs",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "DeeperShadeOfRed",
                            "body": "Yep. If I've learnt anything from my guilty pleasure of watching BorderSecurity (Australian show following their Border Force officers), its the unbelievable lengths (and undeniable creativity) people go to, to hide Fentanyl in random objects they send through the mail...",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "IoGibbyoI",
                            "body": "Most fentanyl and opioids in the US comes from prescriptions. The call is coming from within the room.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ECircus",
                    "body": "Same with the Colombia migrant transports. Trump just went back to transporting them the same way Biden did hundreds of times. As airline passengers. That's all Colombia asked for and Trump caved. \n\nTrump fixed the problem he made up.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "cl0ckwork_f1esh",
                    "body": "A manufactured crisis. Way to swoop in and fix your own problems. /s  He’s such a piece of shit.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "That_annoying_git",
                    "body": "Funny isn't it? BOTH tariffed countries managed to push back tariffs for 30 days at the mercy of Trump on the same day? Not planned at all!! /s\n\nTrump is such a poser. Sorry loser.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "yellowcroc14",
                    "body": "He’s pretty damn good at it",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Gon_777",
                    "body": "Hegel staring into the window sickos style \"Haha yes, yes!\"",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "DevanteWeary",
                    "body": "Illegal immigration into the US from Mexico in the amount of 20mil~ in the last four years is a problem that didn't exist?",
                    "score": -3,
                    "replies": [
                        {
                            "author": "cobaltsteel5900",
                            "body": "See but here’s the issue with this framing. \n\nAmericans aren’t taking these jobs, and they’re frequently hours/conditions/pay that Americans cannot survive on or believe they’re too good to do. Obviously subjecting anyone to those conditions is wrong, but when the left says “company should have less profits and pay workers more” you also don’t agree with that either. You can’t have it both ways. \n\nIf you want to have people immigrate legally and then have to pay them American wages/benefits which companies are obviously trying to avoid by hiring undocumented folks, while also having a worker shortage bc of how long it takes to legally immigrate, prices of food is gonna skyrocket bc they won’t have people doing the work in the meantime. \n\nAs it currently stands the US is using them as cheap labor in poor conditions that wouldn’t be tolerated by you, who seems so eager to volunteer for their jobs. However, like I said, when anyone on the left says “hey pay people more” yall cry communism. In reality, we want to give people more time and ability to enjoy their life, and not live to work, but rather, work to live as was intended.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "DevanteWeary",
                                    "body": "Not trying to be rude but what are you talking about? Why did you start talking about jobs?\n\nAnd the left simultaneously cries \"pay people more through force\" whilst also saying \"don't deport illegals because they're willing to do the slave labor\".\n\nEverything else you said seems to be all over the place. I'm just not sure how you pulled the jobs argument out of saying Trump invented illegal immigration.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "cobaltsteel5900",
                                            "body": "Because you’re framing it as if they’re evil for coming here when generally US intervention in regions causes destabilization leading to migration of the citizens. \n\nDeporting all these people as you seem to want to, without drastically overhauling how we compensate people, simply means the jobs will not get done. There isn’t exactly a line of Americans ready to do farm work. This has been seen historically, too. Americans won’t do the work that they’re currently doing and that we rely on for food so yes, we should force companies to pay their employees more (look at the times American working class families were doing the best, it was also when corporate taxes and income taxes on highest brackets were the highest). Glad we’re on the same page. Forcing companies to maximize shareholder value above all else is the stupidest concept from a long term perspective. \n\nTrump’s solution is to put them in labor camps to do the work for free while enriching the private prison industry, so get out of here with the “oh I care about them” bullshit.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "DevanteWeary",
                                                    "body": "Sir and/or madam, you may want to check your dwelling for any carbon monoxide leaks.",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "cobaltsteel5900",
                                                            "body": "It’s always this, rather than actually addressing your worldview. \n\nYou’re too far gone.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "DevanteWeary",
                                                                    "body": "It's always this. Telling someone to kill themselves because... I don't even know what... you went off to lala land so I chose not to engage any further?\n\nParty of inclusiveness and tolerance right here. lol",
                                                                    "score": -1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "cobaltsteel5900",
                                                                            "body": "Yeah I don’t think we should be inclusive or accepting of people who support putting immigrants in camps. Pretty sure we’ve seen how the putting people in camps have gone, and how history views it. \n\nYou know what they call a Nazi who only sympathized with their values of hating immigrants (or Jewish people) because they believed they hurt the economy? That’s right. Nazi. It doesn’t matter what your reasoning is, the very foundational principle is rotten. \n\nIf you want to be included or accepted, maybe don’t be a bad person, there’s always time to change your mind :)",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "cobaltsteel5900",
                                                                            "body": "Idk what you’re getting at here w/ the first part? You must be talking about someone else.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "DevanteWeary",
                                                                                    "body": "Haha he edited the post I replied to essentially telling me to kill myself.  \nThese people can't even stick to their guns lol",
                                                                                    "score": -1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "cobaltsteel5900",
                                                                                            "body": "Are you okay???",
                                                                                            "score": 2,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "author": "cobaltsteel5900",
                                                                                            "body": "I think you might want to check for a carbon monoxide leak.",
                                                                                            "score": 2,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "rekjensen",
            "body": "The US' position used to be that China was the major source of fentanyl, what happened to that?",
            "score": 72,
            "replies": [
                {
                    "author": "Meritania",
                    "body": "He’s blaming Canada now.",
                    "score": 33,
                    "replies": [
                        {
                            "author": "rekjensen",
                            "body": "Despite [all evidence to the contrary](https://www.forbes.com/sites/andyjsemotiuk/2025/01/31/tariff-on-canada-not-justified-by-us-immigration-and-drug-claims/).\n\nMoney laundering is more our thing.",
                            "score": 11,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "northwestwade",
                    "body": "Remembering a San Jose police \"union\" executive was arrested for smuggling fentanyl into the US like 2 years ago",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "appalachian_spirit",
                    "body": "China supplies the recipe and necessary ingredients to the Cartels for the manufacturing of Fentanyl and Methamphetamine.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Quiet_Wars",
                    "body": "The story goes Chinese organised crime imports the precursors from China based labs. Fent is made in illicit labs in Mexico.\n\nUS government assumes because their ruling class and organised crime groups have a history of drug trafficking as a means of social control in their enemies counties, that’s what China is also doing.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sure-Selection-3278",
            "body": "I know someone IRL who said he voted for Trump because \"countries were scared of us\" under him yet he's getting dogwalked by Scheinbaum every step of the way (and it's beautiful).",
            "score": 360,
            "replies": [
                {
                    "author": "Salt-Cable6761",
                    "body": "Yes because she's an incredibly educated woman 😅",
                    "score": 123,
                    "replies": []
                },
                {
                    "author": "Frito_Pendejo",
                    "body": "lol our PM at the time was making fun of Trump at fundraisers\n\nThat's so delusional I don't even know where to begin",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "VoketaApp",
                    "body": "How is this being dogwalked?",
                    "score": -35,
                    "replies": []
                }
            ]
        },
        {
            "author": "CaptinACAB",
            "body": "Watch her come right out and say”no I fucking didn’t “",
            "score": 558,
            "replies": [
                {
                    "author": "klako8196",
                    "body": "She confirmed it, but she also added that the US agreed to work to stop illegal arms trafficking into Mexico. Trump is trying to sound like Mexico folded when in reality, both the US and Mexico made concessions to reach a deal.",
                    "score": 770,
                    "replies": [
                        {
                            "author": "MKIncendio",
                            "body": "Propaganda moment",
                            "score": 316,
                            "replies": [
                                {
                                    "author": "klako8196",
                                    "body": "The funny thing too is that Trump was likely the one who backed down here. He was the one who was gung-ho about tariffs and trade wars, and probably only reversed course because the market was crashing this morning as a result of his tariffs. He probably came to the negotiating table, now from a weaker position because of the markets, and quickly made a deal to stop the bleeding.",
                                    "score": 202,
                                    "replies": [
                                        {
                                            "author": "I_Won-TheBattleOLife",
                                            "body": "Or he's crashing the market on purpose. He's probably telling all his friends when he's going to announce the deal to cancel the tariffs.\n\nI bet the insider trading of Trump's orbiters is the biggest we've ever seen.",
                                            "score": 87,
                                            "replies": []
                                        },
                                        {
                                            "author": "quiddity3141",
                                            "body": "He doesn't care about winning, so long as he can spin it as a win.",
                                            "score": 18,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "DankeBrutus",
                                    "body": "Time for yet another doublethink moment amongst the MAGA crowd.",
                                    "score": 22,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "h4nd",
                            "body": "By the end of this term, those Mexican border guards will be stopping Americans from trying to illegally cross into Mexico.",
                            "score": 29,
                            "replies": []
                        },
                        {
                            "author": "SovietCharrdian",
                            "body": "Same thing happened with Colombia.",
                            "score": 17,
                            "replies": []
                        },
                        {
                            "author": "Acrobatic-Fun-3281",
                            "body": "Without weapons flowing south, and dope flowing north, what's left of the red-state economy?",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "VadersSprinkledTits",
                            "body": "Yep, it’s all propaganda for the base to eat up. They love eating that shit up like it’s a nestle product.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Unfounddoor6584",
                            "body": "That's how the world figured out how to deal with trump. Give him a propaganda victory and he'll go away.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "itsnobigthing",
                            "body": "A deal that could have been made without all the fucking tarrif nonsense if he’d just said what he wanted to begin with",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Neon2266",
                            "body": "So... we're saying the threat of imposing tariffs worked, bc both parties are better off than before? Right?",
                            "score": -100,
                            "replies": [
                                {
                                    "author": "klako8196",
                                    "body": "I'm sure they could have reached a deal like this without Trump unnecessarily crashing the market and making us look like a liability as a trade partner.",
                                    "score": 99,
                                    "replies": [
                                        {
                                            "author": "bored_typist",
                                            "body": "And also it's been reported on since his first term that the vast majority of drugs including fetynal come in through legal ports, not in the pockets and backpacks of people looking to feed their families or escape violence or grinding poverty",
                                            "score": 38,
                                            "replies": [
                                                {
                                                    "author": "Neon2266",
                                                    "body": "Who's selling Fent in Cali?",
                                                    "score": -38,
                                                    "replies": [
                                                        {
                                                            "author": "snowcow",
                                                            "body": "Probably Americans. Same people smuggling it",
                                                            "score": 29,
                                                            "replies": [
                                                                {
                                                                    "author": "Neon2266",
                                                                    "body": "No way to find that out. We need to keep guessing.",
                                                                    "score": -24,
                                                                    "replies": [
                                                                        {
                                                                            "author": "huskEKcultist",
                                                                            "body": "Well conservatives are allergic to facts and reason so lets just keep on using our feels shall we?",
                                                                            "score": 20,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Neon2266",
                                                                                    "body": "Yes, clearly I'm conservative. \n\n[https://www.youtube.com/watch?v=URfCwT3UQy4&t=1722s](https://www.youtube.com/watch?v=URfCwT3UQy4&t=1722s)  \n  \nStart at 33:00.",
                                                                                    "score": -3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "huskEKcultist",
                                                                                            "body": "“American funded Chinese companies working with the Mexican cartels” sure sounds like Americans selling it with some extra steps put in for plausible deniability so thanks for that info",
                                                                                            "score": 11,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Neon2266",
                                                                                                    "body": "There's always a way to make fit into the reality that you want to live in, sure.",
                                                                                                    "score": -4,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "snowcow",
                                                                            "body": "Actually we do know",
                                                                            "score": 6,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Neon2266",
                                                                                    "body": "Yet your guess.",
                                                                                    "score": 0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "bored_typist",
                                            "body": "He's a self-serving drama queen in drag as strong man.",
                                            "score": 23,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Lethkhar",
                                    "body": "If you consider a highly militarized border to be \"better off\" and want to see the deterioration of US trade relationships, credibility, and soft power globally then yeah it was awesome.",
                                    "score": 36,
                                    "replies": [
                                        {
                                            "author": "Neon2266",
                                            "body": "Apparently that's \"better off\" in the world of the deal-makers. I'm not judging the outcome from my perspective but from the deal-makers' perspective, which are not congruent.",
                                            "score": -17,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "riku32191",
                                    "body": "No because the tariffs weren't necessary. America could've reached a deal without shooting itself in the foot",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "inthebushes321",
                    "body": "I wouldn't be mad at her if she did it. Sheinbaum's not an idiot like Trump - kneecapping your country and causing a bunch of problems with the US to send a message on principle wouldn't be a good move for Mexico, much better to send 10k troops to dick around at the border than have these tariffs and tension.",
                    "score": 42,
                    "replies": [
                        {
                            "author": "Dragons_Malk",
                            "body": "And we'll see people still claim \"tHe ArT oF tHe DeAL\" as if he's some master tactician.",
                            "score": 15,
                            "replies": []
                        },
                        {
                            "author": "Neon2266",
                            "body": "Exactly, which is showing that the US has leverage they are now using. Which is the whole point of threating to imposing tariffs.\n\nWorked with Columbia, Mexico and will work with any nation the USA has a trade deficit with.\n\nHard to understand how this isn't obvious to anyone.",
                            "score": -28,
                            "replies": [
                                {
                                    "author": "inthebushes321",
                                    "body": "Of course the US has leverage, that's the problem with the whole situation, they're like a really big, strong idiot waving around a really big stick with blades sticking out of it.\n\nMy point is, her taking the bait and being an idiot would be engaging in a trade war, which she has no hope of winning.\n\nInstead, she did the smart thing and probably can play Trump a bit(or a lot, depending on how well she plays him) to get better terms for Mexico than these dumb tariffs based on nothing but feelings. Now he's the stupid one (like usual), for posturing about Mexico and now being placated like a small child - and it'll be funnier the longer it continues. Hopefully it can continue...",
                                    "score": 24,
                                    "replies": [
                                        {
                                            "author": "Neon2266",
                                            "body": "So Trump got what he wanted, but was played by her. Bro. Please stop with this copium BS. You can not like Trump and still see that this make a lot of sense to do.",
                                            "score": -15,
                                            "replies": [
                                                {
                                                    "author": "inthebushes321",
                                                    "body": "What copium, that's what I said????? \n\nI don't like Trump (I'm on this sub, right?). What he wanted was not to put tariffs on Mexico. What he really wants is to exercise/consolidate/have power and reputation. The tariffs are a submission move to exercise/consolidate power. \n\nThe point at the heart of this discussion is that Trump does, in fact, think that he got what he wanted. But everyone else can see that, while Mexico was supposed to end up looking weak/browbeaten from this, they're ALREADY making Trump backpedal. He thinks he looks good, but other countries will realize the opposite - classic Trump dumbassery. \n\nSo, yes, he got what he wanted. It doesn't look good for us, it's not good for the US, and Mexico's move is both hilarious and it just makes us look dumber. It went from \"US power move\" to whatever we're on now.",
                                                    "score": 18,
                                                    "replies": [
                                                        {
                                                            "author": "Neon2266",
                                                            "body": "\"What he wanted was not to put tariffs on Mexico\" - Yet you're saying he's backpedaling. \n\nHe's backpedaling on smth. he was planning to backpedal on, yet you believe that's a W for Mexico.\n\nThis was literally his strategy for all his life. Threaten smth. that you're not willing to do anyway when you have tremendous leverage and then walk it back when you get what you wanted.",
                                                            "score": -7,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "SummerEmergency4103",
            "body": "Trump lies and has zero comprehension.",
            "score": 76,
            "replies": []
        },
        {
            "author": "None",
            "body": "Sheinbaum needs to start deporting all the illegal gringos in Mexico. Thousands have overstayed the visa.\n\nFight fire with fire",
            "score": 55,
            "replies": [
                {
                    "author": "tobotic",
                    "body": "The country with the most illegal immigrants in Mexico is the USA. It's thought that there could be up to a million of them, with maybe 90% of all Americans in Mexico being there without the proper documentation.",
                    "score": 28,
                    "replies": [
                        {
                            "author": "None",
                            "body": "Absolutely. I was an expat working in Mexico for several years, and the company i worked for took this shit seriously. \n\nThe bureaucracy in Mexico is no joke and if you don't jump thru a million hoops, you don't get your paperwork. \n\nKick them all out.",
                            "score": 17,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DevanteWeary",
                    "body": "Yes, illegal immigrants *should* be removed back to the country of origin. Why should it be a fight? Just follow the law independently of what others are doing.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "WestCoastMan888",
            "body": "\"DEAL\"",
            "score": 49,
            "replies": [
                {
                    "author": "monstargaryen",
                    "body": "So embarrassing, man.",
                    "score": 17,
                    "replies": []
                }
            ]
        },
        {
            "author": "TinFoilBeanieTech",
            "body": "so the tariff chaos was just to distract from Elon raiding the treasury?",
            "score": 21,
            "replies": []
        },
        {
            "author": "R0D18",
            "body": "Not the time for appeasement....",
            "score": 39,
            "replies": []
        },
        {
            "author": "Pitiful_Concert_9685",
            "body": "Mexico is able to send 10000 troops to the border to observe US troops at the border without arousing suspicion. The flow of fent in the US probably isn't going to slow down because drug cartels have supply networks set up all already.\n\nI think conservatives are going to think this is a win when really it's just the status quo plus defending against any kind of movement on the ground.\n\nImagine being Mexico and you see active and reserve units coming to your border after cartels were designated as terrorists entities. These concessions basically allow the Mexican government to probably react to any American attempts at invasion. One month is enough time to set up defensive positions, arrange fires, etc. \n\nOr it could just be a concession",
            "score": 41,
            "replies": [
                {
                    "author": "YoungNasteyman",
                    "body": "The vast majority of drugs come directly through checkpoints. This was a propanda move from the get go so that Trump can \"deliver\" on promises.\n\nConservative sub is sucking themselves off talking about winning.\n\nAs if 10k soldiers covering 1950miles means ANYTHING in reality.\n\nNot only that but this tweet was obviously not even posted by him.",
                    "score": 21,
                    "replies": [
                        {
                            "author": "Pitiful_Concert_9685",
                            "body": "Exactly. Also who the fuck would actually know how many soldiers they put there  Mexico could do whatever it wants too as they should. Why fuck would a soldier risk their life to stop drugs from going out of the country.\n\nThe US threatened to invade Panama and Greenland and is risking war with Mexico. 10000 soldiers or 15000 or 20000 no ones keeping track. you can rightfully set up defense positions, monitor troop movements, and probably even feed information to the cartels on where not to go.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "squishysquash23",
            "body": "Canada also promised something similar but Trump said no. Very odd",
            "score": 15,
            "replies": [
                {
                    "author": "Independent-Stick244",
                    "body": "Canada should have responded with 50% tariffs and redirected oil exports to Europe.",
                    "score": 32,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "Independent-Stick244",
                                    "body": "Southbound orientated we can close, east and westbound use for suggested purposes.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Comfortable-Tap-8497",
                    "body": "Trump hates Trudeau..",
                    "score": 11,
                    "replies": [
                        {
                            "author": "4-HO-MET-",
                            "body": "We all do!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "tummateooftime",
            "body": "The tariffs were never going to start until March anyways. Trump is acting like this is a win. I watched Hasan predict this exact thing would happen a week ago.",
            "score": 51,
            "replies": [
                {
                    "author": "MercurySpectre",
                    "body": "I thought they were starting on February, now they're starting on March, will they start on April next?",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "EmploymentOk9151",
            "body": "Keep the price of avocados flat until the SB",
            "score": 12,
            "replies": []
        },
        {
            "author": "Here-Is-TheEnd",
            "body": "Why is deal is quotes? Is it not a deal?\n\n..oh right, it’ll be a list of outrageous demands designed to enrich Trump and friends..",
            "score": 13,
            "replies": []
        },
        {
            "author": "utter_chuff",
            "body": "Plot twist: Trump and government cronies use diplomatic immunity and Airforce One to start importing illegal drugs into the U.S. knowing that their actions have crippled normal drug-routes through Mexico.  All existing drug lords have to bend the knee and work for the new Trump cartel.",
            "score": 9,
            "replies": []
        },
        {
            "author": "uncen5ored",
            "body": "Assuming this is true, this and Panama not renewing their Belt & Road Initiative with China really paints a grim reality for not just Latin America, but even the US. Not only does this mean that the US is creating precedent of blatantly strong arming countries to their demands (reasonable or unreasonable), but Trump supporters will say his strategies work. I recognize the dangers of fighting it out, but I think the dangers of “reaching agreements” with Trump’s methods of aggression will not bode well for LatAm or the rest of the world. It truly does not feel like they’re sovereign countries. \n\nI know a lot of this has always been true behind the scenes, but to see it on open display like this….truly depressing",
            "score": 64,
            "replies": [
                {
                    "author": "rekjensen",
                    "body": ">US is creating precedent of blatantly strong arming countries to their demands \n\nRead a history book. This goes back to at least the Perry expedition in 1853 – \"gunboat diplomacy\". And maybe look into how many democratically elected governments the US has overthrown to install American business-friendly dictators.",
                    "score": 56,
                    "replies": [
                        {
                            "author": "uncen5ored",
                            "body": "Yes. I’m Latino and fully aware of our history. In my lifetime, this is the first time it’s felt it’s this blatant on the world stage. I’m fully educated on Allende, Arbenz, Contra, Bosche, Monroe Doctrine, Operation Condor, etc.",
                            "score": 19,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Saralentine",
                    "body": "Panama has been defunding BRI projects since 2019 and never intended to renew in the first place. This is just theatre from the US side to look like they won a battle. Panama’s newest president was never on good terms with China. Plus the US has a so-called Clinton List that threatens to prosecute any Panamanian that goes against US interests.\n\nhttps://dialogue.earth/en/business/34472-has-chinas-winning-streak-in-panama-ended/",
                    "score": 9,
                    "replies": [
                        {
                            "author": "uncen5ored",
                            "body": "Thank you for sharing, it’s hard to navigate what’s political theater with all thats happening",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "mazdapow3r",
                    "body": "trumpers are already saying this was a genius move by trump to get exactly what he wanted and was the plan all along.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "VagueAssumptions",
            "body": "Yooo what! U.S. President that has openly talked about acquiring sovereign nations. A Mexican President that mentioned support so long as sovereignty is maintained. And an act that would typically be seen as a hostile act. Mexico seems like its protecting the border, but not from the cartels.",
            "score": 7,
            "replies": []
        },
        {
            "author": "ueda76",
            "body": "So basically he is already backpedaling, as the economy is already going wrong, and the military that goes to the border probably are the ones bringing the fentanyl to America. Let them eat cake",
            "score": 5,
            "replies": []
        },
        {
            "author": "Golrend",
            "body": "Trump has no real bargaining chips. She knew that. Now Trump knows that. All Trump has done is make the US an even BIGGER laughing stock on the global stage.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Magick_mama_1220",
            "body": "I feel like he's going to back down from it all but make it seem like the other side is cowering. But I can't help but think a lot of this is just a distraction to keep us busy talking about this bullshit instead of the fact that one unelected man is completely taking over all of our government.",
            "score": 5,
            "replies": []
        },
        {
            "author": "hadoken12357",
            "body": "Glad to see Trump back down.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Calibexican",
            "body": "Im sure President Sheinbaum getting ready to ditch American, GMO corn made him blink.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Hyper-Sloth",
            "body": "So what's going to happen when a white American citizen ferrying fentanyl across the border at an official crossing (i.e., how the vast majority makes it across) is stopped, frisked, and ultimately jailed or possibly killed by Mexican MPs?",
            "score": 4,
            "replies": [
                {
                    "author": "Vedicgnostic",
                    "body": "Most fentanyl coming into America are by American citizens with passports 💀. We are going too see Americans rot in Mexican prisons if this mounts too anything but given that corruption runs deep in the army they’re most likely gon look the other way or maybe even help the flow since some American border patrol are paid off too. And the soldiers most likely gon be guarding the empty parts of the borders not pulling over tourists or stop and frisking tourists for fentanyl this won’t do anything lol Trump is a clown 🤡.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "slutcouple420",
            "body": "So now Mexico has full operational control of the border?",
            "score": 5,
            "replies": [
                {
                    "author": "Suariiz",
                    "body": "Yup. And he called it a Victory.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "DemandTheOxfordComma",
            "body": "Those who know any recent history at all will remember that Trump doesn't keep his end of most deals. The only deals he even partially keeps are the ones get fought in court for 5 years and eventually settle.",
            "score": 4,
            "replies": []
        },
        {
            "author": "ineedhelpbad9",
            "body": "Thank God he's saved us from the problem he created.",
            "score": 3,
            "replies": []
        },
        {
            "author": "toumei64",
            "body": "Awesome, conservatives think that Trump is solving a problem, but it's a problem he caused and Mexico's actions are probably just performative anyway. Then, we get to do this shit all over again in a month",
            "score": 4,
            "replies": []
        },
        {
            "author": "idfkmanusername",
            "body": "If I were the leader of Mexico I’d want more of my military protecting against the US border as well. Mostly because the US seems so unstable.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Hate_Manifestation",
            "body": "really? that's all it takes? he was looking for any reason to cancel these tariffs.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Mister-Ferret",
            "body": "She probably told him on the phone that he is so handsome and super duper smart and all the world leaders respect him sooooo much",
            "score": 3,
            "replies": []
        },
        {
            "author": "stormdressed",
            "body": "Trump is a total bully. Do what he says or he'll beat you up and take your lunch money. No tact or skill. Just a thug. In the short term it works but he's creating resentment everywhere he goes with people he's strong armed into action against their will",
            "score": 3,
            "replies": []
        },
        {
            "author": "rainofshambala",
            "body": "Lol is trump just saying tariffs to appear like a strongman where he could have just talked and came to the same deals?.",
            "score": 3,
            "replies": [
                {
                    "author": "None",
                    "body": "The art of the con, my friend, is to make it appear as if you are the hero.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "iambkatl",
            "body": "She was already doing this",
            "score": 2,
            "replies": []
        },
        {
            "author": "TheTalentedAmateur",
            "body": "So...10,000 troops on the border directing traffic and saying \"Norte\"?\n\nCool.  Yet another victory/ s",
            "score": 2,
            "replies": []
        },
        {
            "author": "TK-Squared-LLC",
            "body": "Are these the exact same 10,000 troops she offered Biden or a different 10,000 troops? Mexico offered the same thing they've been offing all along and he capitulated and claimed victory.",
            "score": 2,
            "replies": []
        },
        {
            "author": "gartstell",
            "body": "Well, the National Guard had 118,000 members in 2022 and is expected to have 150,000 members this year.\n\nIn the northern border states of Mexico, 18% of the population lives. Assuming the National Guard is evenly distributed across the country, there should already be more than 20,000 members in those states. However, since border areas are particularly problematic (trafficking, customs, etc.), I wouldn’t rule out the possibility that there are even more.\n\n(The National Guard is a militarized police force that was created during the previous administration.)",
            "score": 2,
            "replies": []
        },
        {
            "author": "niagaemoc",
            "body": "Get ready for the fentanyl spike.",
            "score": 2,
            "replies": []
        },
        {
            "author": "MLHC85",
            "body": "Hahahahahaha he's already the shit the bed",
            "score": 3,
            "replies": []
        },
        {
            "author": "ironwatchdog",
            "body": "I just had a funny thought of 10,000 cardboard cutouts along the border.",
            "score": 2,
            "replies": []
        },
        {
            "author": "SnooStories6852",
            "body": "Coward-in-Chief. Have we not learned he rarely does what he says?",
            "score": 1,
            "replies": []
        },
        {
            "author": "BaldyLoxx66",
            "body": "Yet…",
            "score": 1,
            "replies": []
        },
        {
            "author": "goosupreme",
            "body": "US can't bully anyone anymore and he knows it, he just has to paint himself as a winner",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kharv911",
            "body": "He went from White House to waffle house real quick",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jmich96",
            "body": "Sounds reasonable wnough, given who's in office. What does Canada need to do to get the same treatment?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Artistic_Mobile337",
            "body": "Yet*",
            "score": 1,
            "replies": []
        },
        {
            "author": "LuisMataPop",
            "body": "She even quoted Benito Juárez \"Between individuals as well as between nations, respect for the rights of others is peace\" and instead of making immediate retaliation she said to \"keep a cool head\" and make negotiations that benefit all",
            "score": 1,
            "replies": []
        },
        {
            "author": "qiaozhina",
            "body": "So he was talking about load of shit that he had no intention of ever following through on.....shocking/s",
            "score": 1,
            "replies": []
        },
        {
            "author": "lankymjc",
            "body": "Is it just me or does this read like it was written by someone else? Seems like someone’s finally been able to start managing his social media!",
            "score": 1,
            "replies": []
        },
        {
            "author": "holla5387",
            "body": "I thought the tariffs were going to eliminate our taxes!?",
            "score": 1,
            "replies": []
        },
        {
            "author": "LunarMuphinz",
            "body": "Lying ass. The Mexican president went on air to say and show the fentanyl comes from the US, and the US does nothing about it. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Vegetable-War-117",
            "body": "No shit. He's so fucking stupid.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CascadeNZ",
            "body": "Is it a little odd to threaten a country - then celebrate when they put 100k soldiers on your border?",
            "score": 1,
            "replies": []
        },
        {
            "author": "destenlee",
            "body": "I've made business decisions based on these tariffs. What is going on?! How can he just keep changing stuff?",
            "score": -10,
            "replies": []
        },
        {
            "author": "marketingguy420",
            "body": "Awesome. One soldier for every five miles of border. This will be extremely effective. Very smart Mr. Presdint!!!!",
            "score": -12,
            "replies": [
                {
                    "author": "Leftleaninghaggis",
                    "body": "The US Mexico border isn't 50,000 miles long though",
                    "score": 10,
                    "replies": [
                        {
                            "author": "marketingguy420",
                            "body": "I can't believe you've done this and checked my math. 😔",
                            "score": -8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -30,
            "replies": [
                {
                    "author": "Apbuhne",
                    "body": "Sheinbaum was already ramping up her national guard to seize fentanyl and attack the cartels long before Trump got into office.",
                    "score": 14,
                    "replies": [
                        {
                            "author": "Florolling",
                            "body": "O yea of course. That’s convenient.",
                            "score": -21,
                            "replies": [
                                {
                                    "author": "snowcow",
                                    "body": "Facts don’t care about your feelings",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Florolling",
                                            "body": "I know it stings a little. It’s ok.",
                                            "score": -12,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Apbuhne",
                                    "body": "It means Trump got nothing in return for his Tariffs since Mexico was doing this anyway lmao",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Florolling",
                                            "body": "![gif](giphy|XBRGdJMaO2f5aoRWkV)",
                                            "score": -7,
                                            "replies": [
                                                {
                                                    "author": "SweetDoris",
                                                    "body": "you good?",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Apbuhne",
                                                    "body": "Doing better now that Trump isn’t going to tank the economy - yet",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Equal-Ruin400",
            "body": "Mexico folded like a lawn chair. Can’t wait to see how Trudeau gets on his knees.",
            "score": -7,
            "replies": []
        }
    ]
}