{
    "title": "Burkina Faso has passed a bill to nationalize and transfer land ownership to the state.",
    "author": "Ok-Musician3580",
    "subreddit": "LateStageCapitalism",
    "rank": 426,
    "score": 2154,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 78,
    "url": "https://i.redd.it/rh122yblqfhe1.jpeg",
    "id": "1iisrpw",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "TypicalCringe",
            "body": "Thomas Sankara memory will live on",
            "score": 405,
            "replies": []
        },
        {
            "author": "future_old",
            "body": "About time. Their viable farm land has been brutalized into monocrop plantations, notably cotton, and devastated the local population's ability to sustain itself on traditional food crops. This pattern has also resulted in younger generations leaving to find opportunities in distant population centers. Anyone from the american rust belt knows what that looks/feels like. Pierre Rabhi wrote a book about it in the 80's for anyone interested: [https://archive.org/details/asinheartsoinear00rabh](https://archive.org/details/asinheartsoinear00rabh)",
            "score": 96,
            "replies": []
        },
        {
            "author": "Agent398",
            "body": "American coup incoming",
            "score": 601,
            "replies": [
                {
                    "author": "Beginning-Display809",
                    "body": "They’ve already tried several times, our man is channeling his inner Fidel",
                    "score": 378,
                    "replies": []
                },
                {
                    "author": "XelaIsPwn",
                    "body": "Isn't Elon Musk currently actively fucking around with the mechanism by which the US would normally do this",
                    "score": 170,
                    "replies": [
                        {
                            "author": "Mr_P3anutbutter",
                            "body": "And he failed to overthrow Evo Morales in Bolivia a few years ago. Remember his “we can coup whoever we want” tweet?",
                            "score": 139,
                            "replies": [
                                {
                                    "author": "eu_sou_ninguem",
                                    "body": ">Remember his “we can coup whoever we want” tweet?\n\nSo I was thinking this was a year ago but it was in 2020. I have no concept of time anymore.",
                                    "score": 90,
                                    "replies": [
                                        {
                                            "author": "mikony123",
                                            "body": "We all expected the world to explode in 2012. Nobody knows what's going on anymore and we're getting too tired to care lol",
                                            "score": 29,
                                            "replies": [
                                                {
                                                    "author": "zenzendesu28",
                                                    "body": "Should have ended that year",
                                                    "score": 14,
                                                    "replies": [
                                                        {
                                                            "author": "GreatEmpress",
                                                            "body": "maybe it did...",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "author": "zenzendesu28",
                                                                    "body": "so we truly living in a simulation huh",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "iriririr93939393",
                                    "body": "I remember it was around the time the mask fell off that dems weren't like trump because Chris Murphy tweeted that coup attempts weren't wrong but their methods were",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "Broken clock is attempting to privatize color revolutions",
                            "score": 46,
                            "replies": [
                                {
                                    "author": "destro_raaj",
                                    "body": "Hi, what are these color revolutions?? I'm not a Westerner, so a google search gives me results specific to my country. So, please point me in the right direction. TIA.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Way0ftheW0nka",
                                            "body": "Attempts to overthrow a disobedient foreign government, which could be by funding/arming/organizing street rioters, bribing the military, bribing politicians and judges...color revolution typically refers to the variety with street rioters (could be genuine local protests infiltrated by paid local agitators/thugs and foreign militants/intelligence assets).",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "destro_raaj",
                                                    "body": "So, Tiananmen Square is one of these color revolutions which ultimately failed!! Understood. Thank you.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "aPrussianBot",
                    "body": "The CIA doesn't have the same juice that it used to. The continued presence of Maduro in Venezuela proves that. If they could have couped him, they would have, and the one time they might have tried it was the most hilarious and pathetic thing I've ever seen.",
                    "score": 60,
                    "replies": [
                        {
                            "author": "Longshanks123",
                            "body": "It’s crazy how much the liberal and conservative media both helped keep that disastrous failure so quiet … most people don’t even know it happened",
                            "score": 36,
                            "replies": [
                                {
                                    "author": "TheLago",
                                    "body": "Share links!",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "Longshanks123",
                                            "body": "https://en.m.wikipedia.org/wiki/Operation_Gideon_(2020)\n\nAll US agencies denied anything to do with this of course",
                                            "score": 8,
                                            "replies": []
                                        },
                                        {
                                            "author": "bfdawson63",
                                            "body": "Indeed!",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "Geikamir",
                                            "body": "RemindME! 2 days",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Redshoe9",
                            "body": "Remember when Trump tired and then ditched the guys he put up to it \n\nhttps://www.rollingstone.com/culture/culture-features/venezuela-operation-gideon-coup-jordan-goudreau-1098590/",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Chucking100s",
                    "body": "I think they're okay until this gets repealed - and then we'll send in the CIA. \n\n\"Burkina Faso is eligible for preferential trade benefits under the African Growth and Opportunity Act. U.S. exports to Burkina Faso include machinery, vehicles, and rice. The top U.S. import from Burkina Faso is gold. Investment possibilities include Burkina Faso’s energy, mining and communications sectors. The U.S. has signed a trade and investment framework agreement with the West African Economic and Monetary Union, of which Burkina Faso is a member.\"",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "PhantomEagle777",
                    "body": "Also known as Democratic Tour for the Oily need.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "future_old",
                    "body": "More like French speaking UN “peace keepers” mysteriously delivering pallets of machetes to the small but well organized political opposition within the military, and doing some “cut the tall grass” bullshit. That’s the colonial French west Africa playbook",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheJunKyard147",
            "body": "fk yeah, hoping for a better future for both Burkina Faso & Vietnam, their flag kinda resembles our National Front for the Liberation of South Vietnam's flag <3",
            "score": 151,
            "replies": []
        },
        {
            "author": "Ok-Albatross899",
            "body": "🔥🔥🔥",
            "score": 27,
            "replies": []
        },
        {
            "author": "Sniperking-187",
            "body": "I don't know enough about all this to speak on it but I wish the best for the people 🤝",
            "score": 73,
            "replies": []
        },
        {
            "author": "Suariiz",
            "body": "Vive Sankara! Vive Traoré! Vive l'Afrique libre!",
            "score": 72,
            "replies": [
                {
                    "author": "No_Cheetah_7249",
                    "body": "La force!",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "acaciaone",
            "body": "Can’t wait for the US to come in and show them true freedom! /s",
            "score": 85,
            "replies": [
                {
                    "author": "Rhodes_Warrior",
                    "body": "Yay!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "b_hc99",
            "body": "Still going strong. I’m scared to see how the IMF, World Bank and WTO will react. But, seeing how the US is being so reactionary with the tariffs now, they won’t have a leg to stand on. That said, France may still play the role of the villain here as they have done for hundreds of years against their former colonies out of nothing but pure spite.",
            "score": 10,
            "replies": []
        },
        {
            "author": "Elssz",
            "body": "Can't seem to find this article (or much else about the situation) online? Do you have a link?",
            "score": 16,
            "replies": [
                {
                    "author": "Ok-Musician3580",
                    "body": "\"Dr. Aboubakar NACANABO. \" Through this bill, it is planned that the land will now belong to the State ,\" he maintains\"\n\nSource: https://burkina24.com/2025/02/05/reorganisation-agraire-et-fonciere-vers-une-reprise-en-main-par-letat/",
                    "score": 27,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 14,
            "replies": [
                {
                    "author": "future_old",
                    "body": "Most of their farmland goes to cash crops like cotton that get directly exported leaving the population very little space or resources to grow their own food. It’s sub Saharan Africa and relatively underdeveloped outside of the capital, so not exactly a bread basket. In pre colonial times, farm land was a community enterprise, so the idea of nationalizing agricultural production is more in line with their cultural values anyway.\n\nThe government has tried land distribution in the past and been couped or corrupted out of it. Thomas Sankara was a really interesting leader there in the 80s before he got Lamumba’d. ",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "Full-Contest1281",
                    "body": "> I dont understand\n\nOne day you will",
                    "score": 1,
                    "replies": [
                        {
                            "author": "EulsSpectre",
                            "body": "Oh the irony",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Full-Contest1281",
                                    "body": "Oh the irony",
                                    "score": -2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "dimod82115",
            "body": "Based Burkina Faso",
            "score": 14,
            "replies": []
        },
        {
            "author": "analgerianabroad",
            "body": "He can’t stopping winning",
            "score": 3,
            "replies": []
        },
        {
            "author": "everynameistaken43",
            "body": "Burkina Faso stays winning, keep it up",
            "score": 3,
            "replies": []
        },
        {
            "author": "rrunawad",
            "body": "The way people constantly feel the need to joke about Burkino Faso getting couped is honestly fucking stupid. It's like people want for another socialist experiment to end just so they can be jaded and cynical little Westerners who believe in absolutely nothing.",
            "score": 18,
            "replies": [
                {
                    "author": "Pallington",
                    "body": "Eh. Like, the coup attempts and color revolutions are a constant reality, whether or not they're reported on. Just keeping that in mind isn't \"Wanting\" the experiment to end, it's sober recognition that 1. we're not going to make the difference from our seats in a day regardless and 2. there will be BS on the horizon.\n\nIt's just as much a reminder to be cognizant of any reporting you see on them being \\[insert atrocity here\\] as anything.",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "iriririr93939393",
                    "body": "It's probably a protection mechanism. It can be hard to have hope for change in this world. ",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "Numerous-Ad-8743",
            "body": "France still practices brutal neocolonialism in this region, with heavy American help and support. They won't like this.\n\nCoup incoming in 3...2...",
            "score": 7,
            "replies": [
                {
                    "author": "future_old",
                    "body": "Hutu Power Radio has been replaced with things like targeted Facebook propaganda, which worked in elections in the Philippines, although I’m not convinced that same playbook gets as much traction in French west Africa. We’ll see though. The western powers still think the only response to socialism is a bombing campaign and/or disappearing a popular leader.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "m0_m0ney",
            "body": "Can we get a source for this please?",
            "score": 2,
            "replies": [
                {
                    "author": "Ok-Musician3580",
                    "body": "\"Dr. Aboubakar NACANABO. \" Through this bill, it is planned that the land will now belong to the State ,\" he maintains\"\n\nSource: https://burkina24.com/2025/02/05/reorganisation-agraire-et-fonciere-vers-une-reprise-en-main-par-letat/",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dude_from_Kepler186f",
            "body": "Can you link the source please? I can’t find it.",
            "score": 1,
            "replies": [
                {
                    "author": "Ok-Musician3580",
                    "body": "\n\n\"Dr. Aboubakar NACANABO. \" Through this bill, it is planned that the land will now belong to the State ,\" he maintains\"\n\nSource: https://burkina24.com/2025/02/05/reorganisation-agraire-et-fonciere-vers-une-reprise-en-main-par-letat/",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Dude_from_Kepler186f",
                            "body": "Thank you!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 2,
            "replies": [
                {
                    "author": "Ok-Musician3580",
                    "body": "Land reform is actually good. \n\nCope somewhere else.\n\nEdit: If he meant foreign interference then never mind. \n\nI couldn’t quite tell.",
                    "score": 18,
                    "replies": [
                        {
                            "author": "destiper",
                            "body": "I think they meant something about foreign interference",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -23,
            "replies": [
                {
                    "author": "jcgenen",
                    "body": "Bro quoted amazon",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "Ok-Musician3580",
                    "body": "No, private land ownership is always bad. \n\nWhy would you support commodifying something as important as land?\n\nEdit:\n\nApparently, if the government plants a tree, it can’t last long enough for your grandchildren to see it. \n\nHow idiotic.",
                    "score": 30,
                    "replies": []
                },
                {
                    "author": "LateStageCapitalism-ModTeam",
                    "body": "Rule 4 - No capitalist apologia, anti-socialism, or liberalism. This is a left wing subreddit.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -45,
            "replies": [
                {
                    "author": "Ok-Musician3580",
                    "body": "You are an idiot and an elitist. \n\nHe actually does have an education (he attended the University of Ouagadougo). \n\nAlso, he is incredibly popular with the Burkinabé masses coming out and calling for his term to be extended when it was about to run out: https://x.com/marcus_herve/status/1794504288783225211\n\nBourgeois democracy is actually the BS system where every politician is bought out, such as Ruto in Kenya. \n\nGet lost.",
                    "score": 62,
                    "replies": [
                        {
                            "author": "Fate_Cries_Foul",
                            "body": "These are one of the most based words uttered by man, peak.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TypicalTear574",
                    "body": "I wish Burkina Faso a future without neocolonialism and complete autonomy.\n\n\n\n\n\n\n\nI don't think settler-colonists, or neocolonists are the best people to be weighing in on what's best for ex-colonies.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "LateStageCapitalism-ModTeam",
                    "body": "Rule 4 - No capitalist apologia, anti-socialism, or liberalism. This is a left wing subreddit.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -12,
            "replies": [
                {
                    "author": "Ok-Musician3580",
                    "body": "What?",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "LateStageCapitalism-ModTeam",
                    "body": "Troll posts will be deleted. Many troll posts also include violations of other rules such as rules 4, 5, 6, and 7.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lastrevio",
            "body": "This can be a good thing. Land should not be a commodity to be bought and sold, nor a good to be privately owned. The only way this could go wrong is if the regime will turn into another 'state capitalist' system where the state would try to generate profits/rents based on the land, instead of distributing it based on need.",
            "score": -9,
            "replies": [
                {
                    "author": "Ok-Musician3580",
                    "body": "The \"state-capitalist\" countries you are talking about are good and were actually socialist, such as the USSR.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "LifesPinata",
                    "body": "Can you give us an example of what state capitalist is?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "PatBenatari",
            "body": "I though he already was an American coup.   US forces trained him right?",
            "score": -41,
            "replies": [
                {
                    "author": "Ok-Musician3580",
                    "body": "No, that was the guy before him (Damiba).",
                    "score": 60,
                    "replies": []
                },
                {
                    "author": "rkaminky",
                    "body": "They trained him wrong on purpose, as a joke.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "spraggara",
                            "body": "Explains the squeaky shoes he's always wearing",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}