{
    "title": "Remember when liberals pretended to hate fake news and false information?",
    "author": "rrunawad",
    "subreddit": "LateStageCapitalism",
    "rank": 349,
    "score": 4613,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 58,
    "url": "https://i.redd.it/9h07zlufs6ie1.jpeg",
    "id": "1ilqm61",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "TemptingPi",
            "body": "Hitler was a communist don't you know /s",
            "score": 491,
            "replies": [
                {
                    "author": "Expert-Emergency5837",
                    "body": "Umm ACKSHULLY a Socialist.\n\nYou have to use accurate terms if you want to be taken seriously on Reddit.",
                    "score": 179,
                    "replies": [
                        {
                            "author": "Upstairs-Region-7177",
                            "body": "Hi, the German studies here. The title of national socialist was true, but in practice it was not. Hitler privatized public services, which is exactly what Elon and Trump are doing. In fact, this is a key characteristic of fascism.",
                            "score": 173,
                            "replies": [
                                {
                                    "author": "Expert-Emergency5837",
                                    "body": "I should have been more clear about my sarcasm. \n\nYou're obviously correct, but my point was Reddit snark.\n\n(ACKSHULLY + correct terms)",
                                    "score": 87,
                                    "replies": [
                                        {
                                            "author": "Upstairs-Region-7177",
                                            "body": "No, it’s OK. I was coming on really strong.\n\nI just really wanna get the word out. I think the stress is getting to me. I’ve been talking to so many people since the inauguration trying to calm everyone down and taking action. I’ve made a bunch of political cartoons and a pamphlet to hand out to the public. \n\nWe need to push harder, especially with boycotting informing unions we need to create a system outside of what’s currently going on.\nFascism is an unstable system. If we have a community network in the wings waiting when the government collapses, we can supplant it.",
                                            "score": 56,
                                            "replies": [
                                                {
                                                    "author": "Expert-Emergency5837",
                                                    "body": "You've got energy.\n\nTake it somewhere OFF of Reddit.\n\nThis place is only two things:\n\n1. Already convinced of what you're saying.\n\n2. Choosing to ignore it.\n\nDo your work on the streets.",
                                                    "score": 19,
                                                    "replies": [
                                                        {
                                                            "author": "Upstairs-Region-7177",
                                                            "body": "Yeah, I already have. I think online I’m trying to fill in for people the historical context. Knowledge is power. \n\nMAGA is not the target audience. They cannot be reformed. Don’t even bother.\n\nThat’s why I’m here talking to people who are actually concerned online and people in my life who are afraid to talk about what’s going on. I’ve been doing my work, what have you done?",
                                                            "score": 24,
                                                            "replies": [
                                                                {
                                                                    "author": "Expert-Emergency5837",
                                                                    "body": "Dude.\n\nI'm trying to tell you in a nice way.\n\nI'm on your side.\n\nYou are getting pissed at your allies.\n\nCalm down. \n\nThis is REDDIT.",
                                                                    "score": -17,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Upstairs-Region-7177",
                                                                            "body": "I’m not really that angry. I think you’re projecting that onto me. But now I am annoyed. Goodbye.",
                                                                            "score": 19,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Expert-Emergency5837",
                                                                                    "body": "\"What have you done?\" \n\nAt the end of your manifesto says different.",
                                                                                    "score": -18,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Upstairs-Region-7177",
                                                                                            "body": "Yeah what have you done? \n\nI told you what I did, and you said that I should do my work in the streets and I have.",
                                                                                            "score": 13,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Expert-Emergency5837",
                                                                                                    "body": "Dude.\n\nI made a SNARKY COMMENT for jokes.\n\nI'm not going to get into a dick measuring contest with you about who has better Bona Fides.\n\nLog off.",
                                                                                                    "score": -13,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "Upstairs-Region-7177",
                                                                                                            "body": "It sounds like you need to log off too, I’m not angry at you or even think what you said was wrong. But you’re being pretty emotional.\n\nI was filling in information for context, because some people legit do make that argument and others can take it at face value. I’ve seen a lot of misconceptions about the holocaust and Nazism, so I fill in when I can. \n\nPropaganda works both ways, it’s important to point out exactly what’s going on, which is the formation of a oligarchy cooperating with the fascist overthrow. \n\nYou can keep making snarky comments and having fun, but I’m gonna be over here informing the public what’s going on in the streets and off the streets.",
                                                                                                            "score": 11,
                                                                                                            "replies": []
                                                                                                        },
                                                                                                        {
                                                                                                            "author": "buttersalesman1",
                                                                                                            "body": "Peak reddit. Humor doesn't translate well over the Internet. Let's all accept the misunderstanding and collectively move on goddamn lmao.",
                                                                                                            "score": 5,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "ElliotNess",
                                                            "body": "You can line up all your chakras\n\nChannel all your Qi\n\nBut unless you get up off that mat homie\n\n[that's all it's gonna be](https://youtu.be/jq1jzR5v-c8)",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "1491Sparrow",
                                    "body": "Kinda like no country that has the word democratic in its name has ever been democratic.  German Democratic Republic? Democratic People's Republic of Korea? Democratic Republic of Congo? Not many free and fair elections in any of those. ",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "TemptingPi",
                            "body": "National Socialist German Workers' Party....it's in the name, it must be true.",
                            "score": 29,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "therealBen_German",
                    "body": "He was a national *socialist* after all! /s",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "Loud-Ad-2280",
            "body": "Even as capitalism forces Technogarchy down our throats liberals will blame communism",
            "score": 244,
            "replies": [
                {
                    "author": "Straight-Razor666",
                    "body": "they serve the same master: capital.",
                    "score": 54,
                    "replies": []
                },
                {
                    "author": "gs87",
                    "body": "The kind slaver and the cruel slaver are still both slave owners—just two faces of the same oppression, dressed up for show.",
                    "score": 36,
                    "replies": []
                }
            ]
        },
        {
            "author": "Upstairs-Region-7177",
            "body": "Capitalism and fascism go well together. A key characteristic of fascism is the privatization of public services.",
            "score": 123,
            "replies": [
                {
                    "author": "kylefield22",
                    "body": "The term privatization was literally coined to describe what Hitler did in nazi Germany.",
                    "score": 54,
                    "replies": [
                        {
                            "author": "Upstairs-Region-7177",
                            "body": "You can say it for Vladimir Putin as well. Boycott when you can!",
                            "score": 11,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "mayito35",
                    "body": "Fascism is forced capitalism.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "Inner-Mechanic",
                            "body": "No fascism is capitalism in crisis ",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "klippklar",
                    "body": "Another key characteristic is solidarity with the elite.",
                    "score": 19,
                    "replies": []
                }
            ]
        },
        {
            "author": "Wonkybonky",
            "body": "Ah yes, the communism bad scapegoat. This does nothing for anyone, it's just another way for elitist lapdogs to move the target off capital. \"It's not our fault, it's really [fill in the blank's] fault. Only our brand of capital is good, any other dissenting political brand that isn't neo-liberal fascism is bad or a communist. Vote for us we will make sure to only send 40% of the bombs killing third world denizens. It's better ethically, less people die, we're the good guys!\". \n\nFuck off capital parasite. Let's call it what it is, right wing fascism as far from left wing, communist socialism as possible. Far right extreme nationalism, I think we ended a world war about that 80 years ago.",
            "score": 31,
            "replies": []
        },
        {
            "author": "Ok_Vermicelli4916",
            "body": "Funny how in the West and Western influenced world, nobody knows what those words (Capitalism, Communism, Socialism) even mean. Not even people who identify themselves with those words know it.",
            "score": 46,
            "replies": [
                {
                    "author": "JimDa5is",
                    "body": "Come on, they know what those words mean: The Best Thing Evar, Very Bad Like Soul Sucking Awful, and Really Bad  (just in case /s)",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 13,
            "replies": [
                {
                    "author": "LateStageCapitalism-ModTeam",
                    "body": "Reddit site wide rules - We had to remove this to keep the subreddit from being nuked",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "b0bx13",
            "body": "Communism is when I don’t like a thing",
            "score": 24,
            "replies": []
        },
        {
            "author": "bumholesgivemelife",
            "body": "Ah yes, the richest man in the world is a communist. Makes perfect sense",
            "score": 23,
            "replies": []
        },
        {
            "author": "dobbyslilsock",
            "body": "OBFUSCATE. OBFUSCATE. OBFUSCATE. \n\nIf we can’t define communism we’ll never be able to achieve it.",
            "score": 33,
            "replies": []
        },
        {
            "author": "Thirsty-Sparrow",
            "body": "I want to see what his skull looks like with entry and exit holes",
            "score": 9,
            "replies": []
        },
        {
            "author": "NewTangClanOfficial",
            "body": "Yeah, it sure is interesting how in the west it's always \"This bad thing is just like [insert random communism here]\", and never \"This bad thing is just like nazi Germany\".",
            "score": 12,
            "replies": []
        },
        {
            "author": "Low_Pickle_112",
            "body": "Communism is when capitalism, exhibit #58204",
            "score": 11,
            "replies": []
        },
        {
            "author": "bearkin1",
            "body": "I found the movie \"Oppenheimer\" really commented on this well. Throughout nearly the entirety of the movie, the evil German nazis were attempting to conquer all of the Europe and the Mediterranean, as well as perpetuating the Holocaust against European Jews, and yet still, the American brass were still more scared of the \"evil\" communists, who are their Russian allies at that point.\n\nWhile it's new for a lot of us, me especially, it's apparently been understood for at least a century now by the rich capital that they can maintain power themselves in a representative democracy as if it were an oligarchy, and that the biggest threat to their control is socialism. I thought it was a thing of past decades, not at least a century. Obviously goes back to some degree as far as history goes, but back then, it was monarchs, not rich capitalists in a plutocracy trying to maintain the facade of democracy.",
            "score": 4,
            "replies": []
        },
        {
            "author": "enricopena",
            "body": "I’m absolutely certain of what Chairman Mao would have done to the tech CEOs",
            "score": 3,
            "replies": []
        },
        {
            "author": "Otrada",
            "body": "I mean, makes sense. The Nazis did call themselves national socialists. Fascism loves using the veneer of communism to disguise it's evil intentions.",
            "score": 13,
            "replies": [
                {
                    "author": "Upstairs-Region-7177",
                    "body": "Exactly that’s what they’re doing right now. Mussolini said that capitalism and fascism go well together, or something like that. Putin did the same thing. Elon and Trump are privatizing public services, a key aspect of fascism.",
                    "score": 17,
                    "replies": []
                }
            ]
        },
        {
            "author": "Strong-Highlight-413",
            "body": "I wouldn’t call the hill.com “press”",
            "score": 3,
            "replies": []
        },
        {
            "author": "Purple_Plus",
            "body": "Political literacy seems to be at its lowest point for quite some time. But maybe that's just because I've been paying more attention to US politics than usual.\n\nBut I'm also not surprised. Decades of propaganda there, and here in the UK, have basically made people think that socialism = bad. Like how anything bad that happens in a socialist country was because of socialism, whereas anything bad that happens in a capitalist country always has excuses. \n\nYou even have people hating on our weakened unions in the UK. Unions without which we'd still be in a worse position than we already are. Boo hoo there are strikes. Maybe if people started actually doing shit themselves there wouldn't need to be.",
            "score": 7,
            "replies": []
        },
        {
            "author": "TuvixWillNotBeMissed",
            "body": "I support the theory that Obama's election broke the conservative brain but I think the second Trump election broke the liberal brain. I just wonder if it's going to be a permanent thing. Listening to Republicans talk is obviously exhausting, but I'm already fed up of Democrats failing to clap back in any meaningful way from their fantasy world.",
            "score": 3,
            "replies": []
        },
        {
            "author": "HildredCastaigne",
            "body": "I mean, in order for it to be fake **news** it has to present itself as **news**. It's an opinion piece by a rando George Mason professor. And if you don't know George Mason University, they have a law school named after Anton Scalia.\n\nCall it propaganda. Call it racist. Call it absolute dogshit. That's all true! It ain't fake news, though.\n\n(I know this seems pedantic and it probably is. However, it annoys me that \"fake news\" was originally used to mean completely fictional articles made to clickbait on Facebook and then Trump called a reporter he didn't like \"fake news\" and now everyone just sort of accepts that any media we think is wrong is \"fake news\".)",
            "score": 4,
            "replies": []
        },
        {
            "author": "None",
            "body": "Liberals get the wall",
            "score": 2,
            "replies": [
                {
                    "author": "SilverBolt52",
                    "body": "You communists sure are silly.\n\nWhat we really need are some well written think pieces to show them how funny their shaved head look. That'll show them.\n\nCHECKMATE SOCIALISTS",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Moderatorslickba11s",
            "body": "Great. Bots talking to bots",
            "score": 2,
            "replies": []
        },
        {
            "author": "Critical-Carrot-9131",
            "body": "Or Truthiness: remember when they prided themselves on putting facts over feelings?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Guy_Incognito97",
            "body": "He’s literally the least communist person in the universe. Like, not hyperbole, that’s an actual fact.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JimDa5is",
            "body": "You mean like they pretended it wasn't genocide until a couple of weeks ago?",
            "score": 1,
            "replies": []
        },
        {
            "author": "throwRA_157079633",
            "body": "To me it now seems that being a socialist is considered worse than being a Nazi",
            "score": 0,
            "replies": [
                {
                    "author": "SilverBolt52",
                    "body": "Always has been in their eyes. \n\nThe police always attack socialists rallies. The Nazis never get attacked by police.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "PxyFreakingStx",
            "body": "oh idk, this is just a random contributor's opinion piece. and liberals never liked communism anyway",
            "score": -2,
            "replies": []
        },
        {
            "author": "LeBertz",
            "body": "Fucking read the article instead of reacting to the title.\nIt is a good article that identifies the threats of having young kids doing stuff that is ruining institutions that were created to safeguard democracy in the USA. It isn't even about communism.",
            "score": -3,
            "replies": []
        }
    ]
}