{
    "title": "Can’t we all just sue Elon Musk in small claims courts?",
    "author": "friskyintellect",
    "subreddit": "LateStageCapitalism",
    "rank": 356,
    "score": 23,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/gallery/1imclf9",
    "id": "1imclf9",
    "selftext": "It’s 134.00 here in Dallas. If Jamie Raskin can file a class action suit against him what’s stopping us from taking him to small claims courts? It’s $20,000 max here in Texas and you can request a jury trail.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Straight-Razor666",
            "body": "Anyone can take anyone else to court if they make a filing and pay the fees.  However, without some type of plausible claim, judges will likely just toss it out as frivolous.  I like the concept, however.  People don't really know just how easy it is to go to court.  It's not as \"spooky\" as they want the sheeps to believe it is.\n\nWhere I am the max is under $10,00 and the filing fee is 300+.  It's very much not \"people friendly\", but that's by design.",
            "score": 11,
            "replies": []
        },
        {
            "author": "anti-depressed",
            "body": "I think that's just outside the scope of small claims. Depends what you're suing him for",
            "score": 5,
            "replies": []
        },
        {
            "author": "Proust_Malone",
            "body": "Seems pretty high for a small claim. Imagine your landlord screwing you out of $600 and you have to pay $130’in fees and your time for a judgement which you then have to try and collect yourself.",
            "score": 4,
            "replies": []
        },
        {
            "author": "cam_coyote",
            "body": "I never trust the AI overview, so I'd take that info with a grain of salt",
            "score": 1,
            "replies": []
        }
    ]
}