{
    "title": "Capitalists accidentally being based",
    "author": "lightiggy",
    "subreddit": "LateStageCapitalism",
    "rank": 287,
    "score": 12597,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 93,
    "url": "https://i.redd.it/i063zgbumqie1.png",
    "id": "1invfpc",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "lightiggy",
            "body": "\"President of Burger Corp. proposes that certain basic human rights become mandatory.\"\n\nhttps://preview.redd.it/ymgkludymqie1.png?width=1170&format=png&auto=webp&s=3e4ce7ebe66a5f8de7bfc0fd50014b8c45a5132b",
            "score": 1545,
            "replies": [
                {
                    "author": "Volantis009",
                    "body": "Look at that communist propaganda.\n\nAmericans don't know their own history, it's sad.  I as a Canadian have always been inspired by your history and you guys want to erase it as your president would say....SAD.\n\nIf you knew your history you would expect a lot more of yourselves your forefathers sure thought so, they would be so disappointed.\n\nTbh this is actually right in line with American history I just didn't think you were that stupid, sorry for those that get hurt but I have faith in some of your institutions still.  Also sorry for Musk",
                    "score": 389,
                    "replies": [
                        {
                            "author": "maghau",
                            "body": "> I as a Canadian have always been inspired by your history\n\nWhy? Amerika is a terrorist state built on genocide.\n\n>they would be so disappointed.\n\nAre you *sure* the slave-owning Founding Fathers would be disappointed?",
                            "score": 169,
                            "replies": [
                                {
                                    "author": "tenantofthehouse",
                                    "body": "Founding fathers were a bunch of alcoholic edgelords in their 20s, they would be stoked as hell",
                                    "score": 107,
                                    "replies": [
                                        {
                                            "author": "ThisIs_americunt",
                                            "body": "Who fled the EU because they didn't want to pay taxes",
                                            "score": 27,
                                            "replies": [
                                                {
                                                    "author": "AyoJake",
                                                    "body": "Yes fled the EU in 93 was it?",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "author": "tenantofthehouse",
                                                            "body": "Haha Britain wasn't even in the EU back then, ever heard of Brexit dumbass. Farage and Cromwell left the EU so they could write the Magna Carta on the back of a ten pound note",
                                                            "score": 15,
                                                            "replies": [
                                                                {
                                                                    "author": "greycomedy",
                                                                    "body": "You shouldn't be getting this flak, this is god-tier shitposting.",
                                                                    "score": 12,
                                                                    "replies": [
                                                                        {
                                                                            "author": "tenantofthehouse",
                                                                            "body": "Nobody learns history anymore",
                                                                            "score": 7,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "None",
                                            "body": "Yeah they enjoyed raping women too.  Didn’t George Washington rape some of his slaves and have babies with them or was that a different president? Or all of them?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Inside-General-797",
                                    "body": "There was a time where the US could have lived up to its potential and done what it could to right those wrongs. We could have provided robust reparations and programs to preserve the history of and enrich the lives of those who were effected by the the most historical low points in our history.\n\nSadly I think that ship sailed many decades ago.\n\nWe've had inflection points where socialists could have won. More than a few. But yes the capital owners have always won in the US. The settler colonial project and the tendrils of capitalism run deep in our society along side the generational trauma its caused.",
                                    "score": 29,
                                    "replies": [
                                        {
                                            "author": "Middle_Class_Twit",
                                            "body": "It's easier to destroy than build. \n\nPolitically dissociated, 'status-quo-at-all-costs' Americans, which is to say the bulkhead of them - love it easy.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Purple_Plus",
                                    "body": "Yeah I don't get it either.\n\nThe US has had a white nationalist problem for basically ever. Sure at times it was more simmering under the surface, but it's always been there. They had a fucking civil war over slavery. And then they had Jim Crow.\n\nWhile most of the West moved away from religion, they built empires of mega-churches preaching vile evangelism. Preaching the \"prosperity gospel\", which is pure bullshit used to denigrate the poor, ill and disabled. \n\nThey have sponsored coups of democratically elected leaders for decades. They made sure that Central and South America could never \"challenge\" them. \n\nAnti-intellectualism isn't new in the US either. No other western country seems to be so happy to ban and burn books.\n\nThey waited until they were attacked to join WW2 and then go on and on about how they saved everyone. \n\nThey started and pushed the war on drugs, which has been a complete failure. In the UK we had a good model going, but we were forced to stop it by the US. Funnily enough, drug use and drug deaths rose steadily after that...\n\nThey repressed socialist movements (very democratic), hiring private security companies (the Pinkertons) as strike breakers. These strike breakers executed people. \n\nThey bullshitted about WMDs to start a pointless war on terror that achieved basically nothing.\n\nThen there's the treatment of Native Americans. \n\nThe list goes on and on.\n\nNo country is perfect, but the US propaganda machine has done such a good job at painting them as the good guys, when they never have been.\n\nI'd ask people, what exactly are they proud of? Even the revolutionary war was about wealthy capitalists and slave owners. Most of the founding fathers were not nice people.\n\nFuck the US, the mask is off but none of this is new (see the business plot).",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "Volantis009",
                                    "body": "History is fluid, you can't make perfect the enemy of the good.\n\nWe strive for perfection, it takes a lot expecting it to come easy and overnight is just as selfish as the capitalists.\n\nWe need to build the systems to embrace the change.  America has come a long way.\n\nAs a Canadian I am very proud we have returned a major landmass directly to the indigenous people because I can't expect the world order to change overnight.  Unfortunately this landmass will only become super valuable due to climate change and that's a whole other topic.  It's the small changes, we aren't at the end of history yet.",
                                    "score": -19,
                                    "replies": [
                                        {
                                            "author": "maghau",
                                            "body": "Good? Are you referring to the racist slave-owners or Amerika?\n\nAmerika hasn’t come a long way at all. It has always been a dictatorship of the bourgeoisie, even though libs are just waking up to it - of course, only blaming Trump and Musk.",
                                            "score": 29,
                                            "replies": [
                                                {
                                                    "author": "gators-are-scary",
                                                    "body": "People thought things were on the up and up because life was good for the white middle class and the burgeoning black middle class, and only for a couple decades. Imperial expansion never ended; slavery never ended; the genocide of the Native Americans still hasn’t ended; reconstruction was never finished; we’ve abandoned most efforts at renewable energy; wealth continues to be funneled to the upper classes; the list goes on.",
                                                    "score": 11,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "dr_shark",
                                            "body": "Speaking as a fellow Canadian you are speaking out of your ass and your dreams of what the US claims to be from Hollywood media. Canada should directly hand itself over to the indigenous people and stop profiting off colonialism but they'll never do that. It's a show stop being naive.",
                                            "score": 16,
                                            "replies": []
                                        },
                                        {
                                            "author": "shoheiohtanistoes",
                                            "body": "> History is fluid, you can't make perfect the enemy of the good.\n\ngood is a nation that only exists because they genocided the peoples who lived on the land? good is a nation that has spent at least 100 years destroying half the planet for their own gain? good is a nation in which slavery is still legal in 2025?",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "flactulantmonkey",
                            "body": "You sounded sorta smart until you started talking about our forefathers. They did want to ban monarchy, but as altruism goes, most of the rest of their reasoning could be viewed as fairly self serving. Small federal government with strong wealth holder rights would have suited them.",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "Volantis009",
                                    "body": "Do you see how stupid most human beings are?  To get everyone on board isn't easy.  You can't just proclaim a system and expect it to work.  Fuck sakes but it also doesn't mean you don't fight for better.  Anyways I have to go help some people fill out some forms for government assistance cause some still need to live in this world.",
                                    "score": -7,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "darkwingdankest",
                            "body": "whenever I talk about how billionaires shouldn't exist and I'm arguing with a bootlicker I just ask them if they remember FDR",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "karatekid430",
                            "body": "Wow just to start off Christopher Colombus was a murdering genociding maniac. How is any of that inspiring?",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Volantis009",
                                    "body": "I also think everyone should have access to a good education, then you would be able to use reading comprehension to understand my comment.\n\nYes I agree with FDR.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "jonnystunads",
                    "body": "This is just amazing.\n\nThese rights would seem like the world was yours if you had them.  And I believe at one point in this country’s history, we did.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "neutral-chaotic",
                    "body": "The [Four Freedoms](https://en.wikipedia.org/wiki/File:%22Freedom_of_Speech%22_-_NARA_-_513536.jpg) are as American as apple pie.\n\n(note the third one).",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "Real_Key9245",
                    "body": "Impressively enlightened stuff.\nDid any of that actually get implemented?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 521,
            "replies": [
                {
                    "author": "Stephm31200",
                    "body": "and drinkable water, and free transport, and energy....",
                    "score": 246,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 136,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 40,
                                    "replies": [
                                        {
                                            "author": "Sorry-Let-Me-By-Plz",
                                            "body": "how dare you think of society as all people and not just the most significant spenders among them",
                                            "score": 18,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Stephm31200",
                                    "body": "I'm with you on this, comrade",
                                    "score": 26,
                                    "replies": []
                                },
                                {
                                    "author": "AyoJake",
                                    "body": "Mental heath care is health care.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Kyrottimus",
                    "body": "Been working 30 years. I'm tired, boss. Real tired.",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "sabin357",
                    "body": "You shouldn't even require a job in this equation, because people should be able to exist regardless.\n\nYou skipped clean water, education, & medical care, but kept job. We gotta break that mentality that we have to work, because we're already dealing with too many people struggling to find jobs that match their education level & it's only going to exponentially get worse in the next decade or two.",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "Idle_Redditing",
                    "body": "Even better is a universal, unconditional basic income that does not require working at a job.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "lasercat_pow",
                    "body": "Imagine the things we could build together if we weren't forced to see each other as competition. Imagine all the new artists and geniuses that could shine like stars in the global south if hunger and poverty were eliminated.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Purple_Plus",
                    "body": "Capitalism is such a great system!\n\nJobs need to be done, but tough shit, that job won't pay for your basic human needs. \n\nHow anyone can support that I'll never know. So much bullshit about \"unskilled jobs\", even if a job is \"unskilled\" (which is bullshit anyway) that doesn't mean that it shouldn't be enough to live on. \n\nIt's a completely failed system, which we are seeing now as the US moves to tech-feudalism. \n\nIt's funny because for all the talk of university and education being taken over by \"Marxists\", maybe if people actually read Marx they'd see how prescient his and Engels' writing was.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Chance-Deer-7995",
                    "body": "I agree, and it is especially true if you are working.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Seculi",
            "body": "Healthcare isn\\`t Communism. (It\\`s just a normal component of a normal (un-ist) society.)\n\nIf your car is broken you also don\\`t make the Communistic decision to call the Communist to get it fixed.",
            "score": 154,
            "replies": [
                {
                    "author": "BayouQueen",
                    "body": "When oil corps get billions in subsidies AND are posting record profits, I have to ask, \"what the actual fuck?\"\nOr \"too big .to fail\"?\nCongress are not representing citizens, just money grabbing.",
                    "score": 34,
                    "replies": []
                },
                {
                    "author": "Sugbaable",
                    "body": "What's un-ist?  A country running on UN ideals? :))",
                    "score": 7,
                    "replies": [
                        {
                            "author": "flactulantmonkey",
                            "body": "The intent of whatever they were trying to say holds. Modern societies have an objective obligation to provide for their members. All their members. No large machine can run at 100 percent efficiency, and the more complex machines get the less efficiently they run. Societies are large and insanely complex machines. The inefficiencies often directly convert into joblessness, mental health issues, economic immobility, environmental contamination, and the list goes on. This is outside of the control of those in the society, yet the society requires this “fat” in order to run the way it does. To blame the victims for the circumstance of the socioeconomic construct they have no control over is simply distracting from the actual problem: too much money is being sucked out of the system elsewhere. The needs of the few are eclipsing the needs of the many, and they’re making us think it’s each others’ fault’s for not being able to make rent and buy food, when in reality they are the class refusing to raise our wages and their contributions.",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "Seculi",
                            "body": "No ism, as in no commun(ism), no capital(ism), no fasc(ism), ... others.\n\n  \nJust regular family/friendly/logical-business people making sure that people are taking wel care off so they can go back to do nice/productive things.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "scavagesavage",
            "body": "Disgusting.\n\nI think we should all grovel in the shit of life to earn a crumb of healthcare, job, food, housing from our great leaders.\n\n/s\n\n![gif](giphy|l2JdXhkMuBUlsyeOs)",
            "score": 72,
            "replies": []
        },
        {
            "author": "md5md5md5",
            "body": "This is kind of a side note but it pisses me off that politicians in the USA brag about how many jobs they've created and what's even sicker is their definition of creating jobs is giving our tax dollars, our money to corporations to open factories and offices. Seriously rather than saying I've reduced the number of starving people or people forced to sleep in the streets they brag about giving money to corporations.",
            "score": 62,
            "replies": [
                {
                    "author": "way2odd",
                    "body": "Right?\n\n\nFood and housing are not scarce. A community having an abundance of resources and not enough ways to \"earn\" them via labor should be a good thing! It should mean that people don't have to work as hard, that everyone's needs can be taken care of even if we can't find busywork for them. \n\n\nWith automation and industrialization being what they are, we're needing to find more and more useless shit to spend productive power on for people to \"earn\" enough to get by. Capitalism has been around for too long, and things are starting to get weird.",
                    "score": 16,
                    "replies": []
                }
            ]
        },
        {
            "author": "axethebarbarian",
            "body": "Guys list is even more basic necessities than healthcare.",
            "score": 42,
            "replies": [
                {
                    "author": "appalachiancascadian",
                    "body": "\"What's next. people will want the right to BREATHE?! Give me a break.\"",
                    "score": 21,
                    "replies": []
                }
            ]
        },
        {
            "author": "Footbeard",
            "body": "Yes Joe..\n\n\n..humans should have human rights",
            "score": 24,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 21,
            "replies": [
                {
                    "author": "RepulsiveLocation880",
                    "body": "They want you to be a show monkey jumping through firey hoops to even have a chance at a job that pays enough to live comfortably. That, or get lucky with the birth lottery of having a wealthy family with connections.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "0ff_The_Cl0ck",
                    "body": "That's what gets me the most... If we don't have the right to any of the other stuff on the list, at the VERY least everyone should have the basic fucking guaranteed right of having a job so we can \"earn\" the other shit that we need to survive.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Admirable_Boss_7230",
            "body": "Based. Uncritical support to comrade Walsh on this issue.",
            "score": 14,
            "replies": []
        },
        {
            "author": "Citaszion",
            "body": "The U.S is the only developed country that doesn’t consider healthcare a human right… I guess everybody else is crazy for thinking that!",
            "score": 20,
            "replies": []
        },
        {
            "author": "LessThanSimple",
            "body": "I welcome Comrade Walsh to the fold.",
            "score": 7,
            "replies": []
        },
        {
            "author": "appalachiancascadian",
            "body": "How dare people think they have a right to food and a home! PEASANTS!",
            "score": 7,
            "replies": []
        },
        {
            "author": "rekjensen",
            "body": "IIRC the rights to work, food, and shelter are all enshrined in the Declaration of Human Rights, which his country has not ratified.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Friendly_King_1546",
            "body": "Did he ever pay his child support or is he still fighting that?",
            "score": 7,
            "replies": []
        },
        {
            "author": "DemoniteBL",
            "body": "\"Everybody deserves a good life.\"\n\n\"EW THAT'S COMMUNISM!!\"",
            "score": 6,
            "replies": []
        },
        {
            "author": "ApocalypseYay",
            "body": "Yes",
            "score": 6,
            "replies": []
        },
        {
            "author": "BayouQueen",
            "body": "Yes you are.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Taco_Force",
            "body": "Yes. And if you don't give it then we should take it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Macharius",
            "body": "To his credit, Joe Walsh has actually recanted a lot of his former positions and admitted he was wrong -can't link to other subreddits from here but if you search on PoliticalDiscussion it's there",
            "score": 4,
            "replies": []
        },
        {
            "author": "someoldguyon_reddit",
            "body": "I liked him better when he was with The James Gang.",
            "score": 7,
            "replies": []
        },
        {
            "author": "VeryDrunkCarpenter",
            "body": "Is there a subreddit for capitalists praising inadvertently communism ?",
            "score": 3,
            "replies": []
        },
        {
            "author": "jihadJoe76",
            "body": "I hate the fuckin eagles man",
            "score": 2,
            "replies": []
        },
        {
            "author": "Supyloco",
            "body": "Joe Walsh has always been one of the strangest people in politics.",
            "score": 1,
            "replies": []
        },
        {
            "author": "hellzyeah2",
            "body": "Yes, actually",
            "score": 1,
            "replies": []
        },
        {
            "author": "cita91",
            "body": "Agreed but let's cross one bridge at a time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Crusty_Magic",
            "body": "Actually, yes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "scenestudio",
            "body": "Interesting take, shows a different perspective on American history.",
            "score": 1,
            "replies": []
        },
        {
            "author": "blixabloxa",
            "body": "Yes, yes, yes and yes!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Effective-Rub-712",
            "body": "now he's getting it",
            "score": 1,
            "replies": []
        },
        {
            "author": "big_dick69x420",
            "body": "I see Joe Walsh and think of the musician and am sadly disappointed",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lythieus",
            "body": "It's like 'What do you want next? Basic human rights?'",
            "score": 1,
            "replies": []
        },
        {
            "author": "inhidro",
            "body": "A broken clock gives the right time twice a day",
            "score": 1,
            "replies": []
        },
        {
            "author": "Adventurous-Rip8958",
            "body": "New sentence alert: Joe Walsh....is totally right 🤯",
            "score": 1,
            "replies": []
        },
        {
            "author": "LimitedBoo",
            "body": "🗣️🗣️GOVERNMENT EXISTS TO SERVE ITS PEOPLE 🗣️🗣️",
            "score": 1,
            "replies": []
        },
        {
            "author": "RoyalChihuahua",
            "body": "![gif](giphy|luXdvPlTCf4IgUQcnK)",
            "score": 1,
            "replies": []
        },
        {
            "author": "ChocolateDiligent",
            "body": "The more things change the more they stay the same.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Straight-Razor666",
            "body": "I don't see this as \"based\" at all.  I don't have access to the audio/video to hear this person actually speak the words and the intonations used to say them.  However, I'd likely guess this person means, \"If we give them heathcare, then they're gonna want everything else, too...something we can't allow.\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "I_done_a_plop-plop",
            "body": "Please say that is the rocking Joe Walsh (not the Eagles haitus)",
            "score": 1,
            "replies": []
        },
        {
            "author": "NineNinetyNine9999",
            "body": "The fuck, YES!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Real_Key9245",
            "body": "Not when a rich minority only want themselves healthy. \nThe rest of us can keep giving them our power and money, or die!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Real_Key9245",
            "body": "One thing is sure from a lot of these groups and posts.\nAll victims of factions they can't see clearly.\n\n\nAnd that America, like the times of Julie's Ceasar is FUCKED by the same populism, fake news, and undoing of checks and balances.\n\n\nI really don't think working class America will ever recover from the rabbit holes they seem to keep vanishing down these days. \n\n\nPutin and Xi Ping will be LOVING it, as their troll farms have done their job.\n\n\nYou're all attacking each other on behalf of factions and people you can't see. Of business you can't pin down or hold responsible or you get accused of communism, socialism, anarchism, terrorism etc.\n\n\nThe REAL radical extremists  own the world and love seeing you lot talking all this shite.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NearbyAd493",
            "body": "What? Being pro commie isnt based, thats the opposite of being base, no?",
            "score": 1,
            "replies": []
        },
        {
            "author": "casualLogic",
            "body": "BIASED\n\nNobody is basing anyone.  One has a *bias* towards one side or the other",
            "score": -6,
            "replies": [
                {
                    "author": "yfa17",
                    "body": "https://www.urbandictionary.com/define.php?term=based",
                    "score": 10,
                    "replies": []
                }
            ]
        }
    ]
}