{
    "title": "A young Libyan, Mohamed Alnaas, produced a boycott video delivering a clear message, urging people to boycott products that support Israeli apartheid",
    "author": "Nomogg",
    "subreddit": "LateStageCapitalism",
    "rank": 204,
    "score": 243,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 4,
    "url": "https://v.redd.it/eryirw3fnxje1",
    "id": "1isi8ss",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "spletharg2",
            "body": "List of products?",
            "score": 12,
            "replies": [
                {
                    "author": "Erdeem",
                    "body": "There are a few apps that I like to use, my favorite one is called CheckBDS, no ads, easy to use search, largest database brands, explains why it's boycotted and suggests alternatives to the boycotted brands/products.  \nThere are a few others like Boycat that look nicer, but they aren't as comprehensive.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "ShakimTheClown",
                    "body": "[https://boycott-israel.org/boycott.html](https://boycott-israel.org/boycott.html)",
                    "score": 6,
                    "replies": []
                }
            ]
        }
    ]
}