{
    "title": "Why?",
    "author": "haloarh",
    "subreddit": "LateStageCapitalism",
    "rank": 197,
    "score": 20,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 10,
    "url": "https://i.redd.it/k8175grl67ke1.jpeg",
    "id": "1itmpis",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "OldHoneyPaws",
            "body": "Money.",
            "score": 19,
            "replies": []
        },
        {
            "author": "jemmylegs",
            "body": "Seriously who cares. She was barely relevant as VP and as a candidate. I forgot she existed.",
            "score": 22,
            "replies": [
                {
                    "author": "cretintroglodyte",
                    "body": "I think it's important to highlight where the priorities are of the person we were told we had to vote for her despite her involvement and support for an ongoing genocide, because she was supposedly so opposed to Trump. Meanwhile when Trump is actually in office she's going for the Obama retirement plan despite her complete lack of charisma and failing miserably in her presidential election campaign (which she never had to primary for because her predecessor lied about having dementia, which she presumably helped cover up.)",
                    "score": 15,
                    "replies": [
                        {
                            "author": "toomuchpressure2pick",
                            "body": "She was the FIRST to drop in the 2020 primary. No one wanted her then, no one wanted her in 2024.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "JimDa5is",
                                    "body": "You're mistaken. The DNC wanted her. Just like they wanted Hillary in '16. Sooner or later you'd think they'd see the pattern",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "haloarh",
                    "body": "Which is exactly why I'm confused why a talent agency would sign her.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "FartsArePoopsHonking",
                            "body": "I guess it's a corporate flex to have her address your pharmaceutical convention.",
                            "score": 9,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "haloarh",
            "body": "[SOURCE](https://variety.com/2025/biz/news/kamala-harris-caa-1236312527/)",
            "score": 6,
            "replies": []
        },
        {
            "author": "Tasty-bitch-69",
            "body": "The same reason Hilary Clinton and Barack Obama have Grammies. US politics is a clown show.",
            "score": 2,
            "replies": []
        }
    ]
}