{
    "title": "Panhandling at a Drake Concert",
    "author": "MackDaddy1861",
    "subreddit": "LateStageCapitalism",
    "rank": 188,
    "score": 53,
    "upvote_ratio": 0.73,
    "num_comments (reported by reddit)": 17,
    "url": "https://i.redd.it/pu90cqqy9bke1.jpeg",
    "id": "1iu0vwk",
    "selftext": "Don’t really know what to say other than how this reflects on our current society. At a Drake concert no less…",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "CHiZZoPs1",
            "body": "Lottery, GoFundMe, and begging stars at concerts. What amazing bootstraps we have at our employ here in the mighty US of A.",
            "score": 15,
            "replies": [
                {
                    "author": "foreignne",
                    "body": "This happened in Australia: https://www.the-independent.com/arts-entertainment/music/news/drake-sydney-tour-fans-begging-money-photo-viral-b2702042.html",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sc4rl3tPumpern1ck3l",
            "body": "Dude's a freak ",
            "score": 19,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 9,
            "replies": [
                {
                    "author": "Happy_Chimp_123",
                    "body": "Yeah, it is. Don't know why you're getting downvoted. Look at their weird distorted faces. The person in the bottom left hand corner only has three fingers on each hand.\n\nWhat's the point in even posting this fakery?",
                    "score": 10,
                    "replies": [
                        {
                            "author": "-ExDee-",
                            "body": "Ai image generators don't generate words like this, especially at the scale of dozens of different posters in the same shot.\n\nIt's a low res photo taken on a phone, posted on Twitter, and reposted here. Not everything is AI.\n\nFor an example of an ai image, here is what ChatGPT made with the following prompt. This prompt is comparatively simple and the result is still poor.\n\nhttps://preview.redd.it/zvh495ac3kke1.jpeg?width=1024&format=pjpg&auto=webp&s=dd6c08a9b5939b84d3a864996d1eeb41c23384ab\n\n\"Make a photorealistic image of a concert crowd. The image should look like it was taken from above the crowd. Several people in the crowd should be holding signs that read \"marry me\" and \"I love you\".\n\nIt *could* be edited using a \"real\" version of this photo as the base, then using Photoshops generative fill, combined with general Photoshop stuff for all the text but like..it would be hours of effort for literally no reason. It was also posted the same evening the show happened, so I don't think someone would have time to do that.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "Neoliberal_Nightmare",
                            "body": "Must be edited though, AI can't usually write.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MrCheezeTacoIV",
            "body": "I heard he’s a 69 god. So… keep your eye on that maybe…",
            "score": 1,
            "replies": [
                {
                    "author": "MittenstheGlove",
                    "body": "Why did you get downvoted? Lol",
                    "score": 2,
                    "replies": [
                        {
                            "author": "MrCheezeTacoIV",
                            "body": "Them predators moves in flocks 🤣",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ProphetSide",
            "body": "Drake will start the revolution",
            "score": -25,
            "replies": []
        },
        {
            "author": "pauloeusebio",
            "body": "And yet they still can afford tickets and probably an iPhone. Yeah, they're really suffering.",
            "score": -9,
            "replies": []
        },
        {
            "author": "Legitimate_98",
            "body": "Where is the panhandling?",
            "score": -40,
            "replies": [
                {
                    "author": "MackDaddy1861",
                    "body": "Did you read the signs?",
                    "score": 19,
                    "replies": [
                        {
                            "author": "AvenueLiving",
                            "body": "Signs? Signs. Everywhere a sign. Do this, don't do that. Can't you read the sign?",
                            "score": -11,
                            "replies": []
                        },
                        {
                            "author": "Legitimate_98",
                            "body": "That ain't panhandling. \n\nPeople have had signs like that for decades at concerts. I remember going to a concert in 2006 where people had signs that said buy me a house. \n\nThat's like saying we need to take the ladies who had signs and shirts for MJ to marry them in the 90s seriously.",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "o_dani",
                                    "body": "People panhandled for decades at concerts*",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}