{
    "title": "Against All Odds",
    "author": "Maz_mo",
    "subreddit": "LateStageCapitalism",
    "rank": 131,
    "score": 0,
    "upvote_ratio": 0.35,
    "num_comments (reported by reddit)": 10,
    "url": "https://www.reddit.com/r/LateStageCapitalism/comments/1iyobab/against_all_odds/",
    "id": "1iyobab",
    "selftext": "As she sifted through a stack of documents from her boss, Leila’s eyes caught a set of financial records that didn’t belong.\n\n At first glance, they looked like just another infrastructure budget report.\n\nBut as she read further, a chill ran down her spine.\n\nThe files detailed billions of taxpayer dollars allocated to a massive road system.\n\nAccording to the reports, the project was fully operational.\n\nExcept, it didn’t exist.\n\nNo roads. No construction sites. No records beyond these neatly printed figures.\n\nHer pulse quickened.\n\n Had her boss meant for her to see this? Or was this a massive mistake?\n\nShe then slid them in her purse and continued her work.\n\nThat evening, as she stepped into their cozy apartment, the weight of the discovery pressed on her.\n\nHer husband, Aidan, sat at the kitchen table, scrolling through his phone.\n\nTheir two kids were in the next room, their laughter drifting through the hallway.\n\nShe placed the documents on the table. \"I found something today. Something big.\"\n\nAidan looked up, sensing the seriousness in her voice.\n\nShe explained everything, from the missing roads to the billions gone without a trace.  \"I'm posting it on Mseli app.\"\n\nHis expression darkened. \"Babe, think about this. What if they find out it was you? What if it ruins us? We're doing fine. The kids—\"\n\nShe reached for his hand. \"I wouldn’t be able to live with myself if I ignored this. My boss will assume someone stole the files. He lets so many people in and out of his office.\"\n\nAidan exhaled sharply, rubbing his temple.\n\nThen, without another word, he pulled her into a hug. She clung to him, feeling the quiet fear in his embrace.\n\nTheir children ran in, giggling. \"Family hug!\"\n\nLeila forced a smile and opened her arms.\n\nAs the four of them held each other, she closed her eyes, trying to ignore the nagging thought in the back of her mind.\n\nLater that evening, with the kids fast asleep and Aidan absorbed in a football match, Leila curled up beside him and opened the Mseli app.\n\nThe familiar interface greeted her with soft blue hues.\n\nShe checked her father’s status first: I had a very good day.\n\nA small smile tugged at her lips. She sent a quick, no-reply message: Have a good night.\n\nNext, she opened her mother’s memorial page.\n\nOn top it was written: 57 people remembered Amy 97 times today.\n\nShe pressed the “I remember Amy” button. It dimmed instantly, a message appearing below it: You can press again in one hour. The 97 turned into 98.\n\nLeila closed her eyes for a moment, whispering in her heart, I miss you, Mom.\n\nAidan jolted beside her, nearly spilling his drink as the football game took a dramatic turn.\n\nShe chuckled softly and continued checking statuses, scrolling through updates from her siblings, cousins, friends, celebrities, social group etc.\n\nOnce she was done, she went to her status page.\n\n On top it was written: 45 people remembered you today.\n\nScrolling through the no-reply messages, she smiled at the simple but thoughtful words from friends and acquaintances.\n\nFinally, she posted her night status: I had a long day, but I’m fine.\n\nThen, she took a deep breath.\n\nHer fingers hesitated before she tapped the search icon and typed: Good Government page.\n\nThe results loaded within seconds and she clicked the page with 2 million + daily remembers.\n\nGood Government was a page used to expose corruption in the country and ensure those responsible face the fury of the law.\n\nIt was managed by the online direct democracy of the Mseli app.\n\nBefore the page loaded, an advertisement popped up of an ad picture written: Browns sugar proudly supports Good Government and the fight against corruption.\n\nLeila snorted. “Yeah, like you wouldn’t pay a bribe if it helped your company.”\n\nWith a dismissive tap, she closed the ad and the main page loaded.\n\nAt the top, a banner read: 2,432,395 people (20% of the country) remembered Good Government 3,345,056 times today.\n\nBelow that was a profile picture of the countries national flag and below that were three icons: Message, Expose, Bills.\n\nAnd below that was written: Collective funds: $2,543,876.\n\nAt the bottom was a single button: I Remember Good Government.\n\nShe tapped it and then took a steadying breath before turning to Aidan. “I’m about to send the pictures.”\n\nHe put his arm around her and pulled her close, his warmth grounding her.\n\nLeila pressed Expose. A new screen appeared.\n\nAt the top was an area to upload a file, followed by a text box, and beneath that, the \"Expose\" button.\n\nShe selected the documents, watching as they uploaded one by one. Then, in the text box, she wrote a concise explanation of what she had found.\n\nAidan watched in silence, his jaw tight.\n\nWhen she hit Expose, there was no immediate reaction.\n\nJust a subtle loading symbol before the screen went back to the main page.\n\nShe exhaled and leaned into him. “I hope they accept it.”\n\nAidan squeezed her shoulder. “They will. With thousands of people reviewing it, they can’t all be system informants.”\n\nLeila nodded, but as she closed the app and set down her phone, an uneasy feeling settled in her chest.\n\nThere was no turning back now.\n\nThe next morning, Leila woke up, brushed her teeth, and unlocked her phone, the soft glow illuminating her face.\n\n She tapped open the Mseli app and posted a quick status: Woke up fine.\n\nAs she scrolled through the familiar list of people who had checked on her, her stomach clenched.\n\nBoss viewed your profile – 30 minutes ago.\n\nShe stared at the words. It could be nothing. Just a coincidence. Or it could mean everything.\n\nBefore she could spiral further, Aidan’s voice cut through the silence. “Leila, the kids’ lunch boxes.”\n\nPushing the thought aside, for now, she rose from bed and headed to the kitchen.\n\nWhen she arrived at the office, it felt different. Tighter. Heavier.\n\nLeila had barely settled at her desk when a message flashed across her screen.\n\nMandatory meeting. Conference room. Now.\n\nHer fingers went cold.\n\nShe followed the quiet shuffle of employees filing into the room, forcing herself to move at the same unbothered pace.\n\nThe boss stood at the front, arms crossed, his expression unreadable.\n\n“Someone,” he began, his voice unnervingly calm, “stole something from my desk.”\n\nThe air in the room grew dense, tension tightening around them like a noose.\n\nHis gaze swept over the employees, pausing, just for a second, on Leila before moving on.\n\n“I have cameras,” he continued, his tone sharper now. “I saw everything. Whoever took it should come clean.”\n\nSomeone shifted uncomfortably. A chair creaked.\n\nFinally, an intern raised her hand hesitantly. “Uh… I took a pen. Mine wasn’t working.”\n\n “That’s not what I’m talking about,” he said, his voice a blade against the quiet.\n\nLeila kept her expression blank, her hands folded neatly in her lap. Inside, her pulse pounded against her ribs.\n\nAfter a few minutes, the boss exhaled through his nose, slow and deliberate. “Fine. If they don’t confess, I’ll expose them myself.”\n\nWith that, the meeting was over.\n\nChairs scraped against the floor as people filed out in uneasy silence. Leila stood too, careful not to move too quickly.\n\nFor the following week, every morning, Leila checked the Good Government page, hoping to see her exposé accepted.\n\nEach time, she was met with disappointment.\n\nThen, one morning, she woke up as usual, stretching lazily before reaching for her phone.\n\nA red notification dot blinked at her from the Mseli app.\n\nThere was no reason to believe it was anything special. A message from a friend, perhaps.\n\nBut a feeling, deep and insistent, told her otherwise.\n\nHer fingers hovered over the notification, but instead of checking, she went straight to Good Government page.\n\nThe moment the page loaded, her breath hitched.\n\nAn advertisement of thumbnail of a video about her exposé.\n\nShe clicked.\n\nThe screen filled with moving images, bold text, and a narrator’s voice that was clear, powerful and cut straight to the point.\n\nShe felt a shiver run down her spine. She then scrambled out of bed and rushed to the living room.\n\n“Aidan!”\n\nHer husband, still groggy, replied. “What’s wrong?”\n\n“Come. Now.” She grabbed his arm, practically dragging him to the couch.\n\nThey watched the video together, their hands clasped tightly.\n\n The production was slick and emotionally gripping.  And at the end of the video, a call to action appeared:\n\nA new page, called corruption case, has been created to remember this corruption case until justice is served. Until officials resign. Until the money is returned.\n\nLeila’s chest swelled with something between relief and disbelief as she finally remembered to check the number of people who have already viewed the video. 1 million views.\n\nShe tapped into the corruption case page link and it quickly opened.\n\n 900,000 people had already remembered it.\n\nWith a trembling hand, she pressed the I remember corruption case button.\n\nAidan turned to her, a slow smile forming on his lips. “You did it.”\n\nShe shook her head. “Mseli did it. Good Government did it. The people did it.”\n\nHe chuckled. “You’re too humble.”\n\nShe smiled but said nothing.\n\nThe rest of the morning blurred by in a rush of routine; getting the kids ready, dropping them off ad heading to work.\n\nAt the office, her boss was on edge. More and more of his allies filtered in throughout the day.\n\nLeila remained quiet, working as though nothing had changed.\n\nIn the afternoon, she checked Mseli again.\n\nThe video had spread beyond Good Government.\n\nThe people in the Calandia page had voted to put it as the status.\n\n Calandia was the name of the country and Calandia page was the most remembered national page, where over 6 million people remembered it daily.\n\nIt had also been posted in the statuses of influencers who were remembered by 10 million or more people, inside and outside the country.\n\nShe checked the stats on the video and saw that the views had ballooned to 50 million.\n\nShe then checked the corruption case page and it had now been remembered by 17 million people.\n\nIn the evening, while watching the news, she saw an official government statement on the TV: We have launched an investigation and will ensure full transparency as we determine what has taken place.\n\nShe stared at the official uttering the words, letting them sink in.\n\nAidan leaned against the doorframe, arms crossed. “They’re scrambling.”\n\nShe nodded slowly.\n\nHe walked over, stood her up and pulled her into a hug.\n\nShe rested her head against his chest, letting herself sink into the warmth of the moment.\n\nThe next morning, soft sunlight streamed through the window as Leila sat on the edge of her bed, her eyes fixed on her phone.\n\nShe instinctively opened the corruption case page, but before the profile fully loaded, a status of a poll appeared.\n\nIt asked: Would you participate in a boycott of all luxury goods until those responsible step down and the money is returned?\n\nThe list was long: alcohol, sodas, biscuits, chocolate, clothes, accessories, and even outings.\n\nLeila’s finger hovered over the options. A boycott like this meant sacrifice, a collective stand that could hurt everyone, not just the guilty.\n\nBut after a long breath, she clicked the “I will participate” option.\n\nA message popped up, and her eyes widened: 1,456,384 people have pledged to participate in the boycott.\n\nAt the office, the atmosphere had shifted.\n\nThe bosses moved with unease and everywhere she turned, whispers filled the space.\n\nShe overheard one colleague mutter with a nervous glance, “Do you think it was her? The one who exposed everything?”\n\nLeila’s heart skipped a beat as she turned quickly to face them. “What are you talking about?”\n\nThe other colleague, turned to her, their eyes scanning her with suspicion.\n\n“Is it you?” the first one pressed, their voice filled with doubt. “You know; you’ve been pretty quiet these last few days.”\n\n “No,” she said firmly, swallowing her unease. “It wasn’t me.”\n\nThe colleagues exchanged looks.\n\nOne of them laughed bitterly. “Yes. You’re too weak to do something like that.”\n\nShe just smiled politely.\n\n “She’s probably a spy, anyway. Better not say anything more around her,” said one as the other nodded knowingly.\n\nLeila fought to keep her face neutral. The words stung, but she let them go.\n\nAs she walked away, her thoughts drifted to her boss.\n\nHe’d always been kind to her, trusted her, showed her nothing but love.\n\nBut he left her no choice. The things he had done, the corruption, the lies, were just wrong.\n\nThat evening, Leila and Aidan collapsed onto the couch, exhaustion settling into their bones.\n\n As they scrolled through the news together, their eyes widened at the headlines.\n\nThe boycott was already starting to bite.\n\nBusinesses were reporting drops in sales and customers, and the chatter among the public had grown louder.\n\nA few days later, Leila opened the corruption case page as she had become accustomed to, seeing the numbers rise each day.\n\nThe page was now remembered by over 7 million people, a staggering 70% of the country, and the messages in the page’s forum were more frequent than ever.\n\nIn the afternoon, after having lunch, she sat at her desk, absentmindedly scrolling through the app, when she felt a shift in the air.\n\nShe looked up, her heart immediately racing.\n\n The doors to the office opened, and in walked a group of police officers, their uniforms sharp and their expressions serious.\n\nBehind them trailed a few journalists, cameras flashing as they moved through the office.\n\nA few minutes later, Leila’s eyes locked onto her boss as they led him out.\n\n His face was pale, his jaw clenched.\n\nAn urge to smile nearly overcame her. But she didn’t. Instead, she stayed silent, staring back as they locked eyes.\n\nThe whole office went eerily quiet. Her colleagues watched in disbelief, whispering among themselves, some still too afraid to speak openly.\n\nA few moments later, Leila’s phone buzzed in her hand. She unlocked it quickly and found a notification from the corruption case page.\n\nThe government had released a statement that they had caught the corrupt officials, recovered the stolen money, and were proceeding with plans to build the road.\n\nLeila’s heart pounded in her chest. This was it. The truth had won. The people had triumphed.\n\nShe exhaled deeply, her body feeling like it had been holding its breath for days.\n\nJust then, her phone rang. It was Aidan.\n\n“Leila, we did it. It’s over. They’ve got them.”\n\n “We’ll talk later.” she said, her voice thick with emotion.\n\nShe hung up and returned to the page. They officially put an end to the boycott and the page was being dissolved.\n\nIt was over. The people had made their voices heard, and the government listened.\n\nLater that evening, once the kids had fallen asleep, Leila and Aidan celebrated with a quiet dinner at home.\n\nThe house was filled with warmth, their laughter echoing off the walls.\n\nAs they shared a glass of wine, Leila’s phone buzzed again.\n\nShe glanced at it, surprised. “I’ve received money in my account.”\n\nAidan’s eyebrows shot up. “It must be from the collective fund of the Good Government page,” he said, a smile tugging at the corner of his lips.\n\nLeila frowned, shaking her head. “I don’t deserve it.”\n\n But Aidan, always the supportive partner, reached across the table, taking her hand in his. “You deserve more than that.”\n\nA blush crept up Leila's neck, coloring her cheeks a soft pink as a smile tugged at her lips.\n\nThe End.\n\nThank you for reading this story.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "LTS_FR",
            "body": "https://preview.redd.it/j38hklyu1ile1.jpeg?width=3000&format=pjpg&auto=webp&s=499836afe5627eb900002948479f2b4bfb7b6778",
            "score": 7,
            "replies": []
        },
        {
            "author": "squeezingthelemon12",
            "body": "Really great writing. My heart was sinking towards the end just waiting for the bad news to hit. I could 100% imagine this universe too.",
            "score": 4,
            "replies": [
                {
                    "author": "Maz_mo",
                    "body": "Thanks, this means a lot",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "eyerulemost",
            "body": "Tldr",
            "score": 5,
            "replies": [
                {
                    "author": "Apostasyisfreedom",
                    "body": "No worries - there are finger paints and comic books on the bottom shelf.",
                    "score": -8,
                    "replies": [
                        {
                            "author": "askouijiaccount",
                            "body": "Stfu",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "rutherfraud1876",
            "body": "Very cyberpunk",
            "score": 0,
            "replies": []
        },
        {
            "author": "Apostasyisfreedom",
            "body": "A great read and very timely.  Many ordinary people are about o have their morality tested in various ways as christo-fascists deform democracy and decency in America.",
            "score": -3,
            "replies": [
                {
                    "author": "Maz_mo",
                    "body": "Thank you.",
                    "score": -2,
                    "replies": []
                }
            ]
        }
    ]
}