{
    "title": "Biggest threats to capitalism: free healthcare, world peace, and ending hunger.",
    "author": "Hacksaw6412",
    "subreddit": "LateStageCapitalism",
    "rank": 86,
    "score": 947,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 33,
    "url": "https://v.redd.it/xrwha18t1qle1",
    "id": "1izm5ng",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "JonoLith",
            "body": "I can't tell if this is meant to be a parody or an actual Prager U video.",
            "score": 57,
            "replies": []
        },
        {
            "author": "Admirable_Boss_7230",
            "body": "But GDP? Nobody thinks about GDP anymore!",
            "score": 42,
            "replies": [
                {
                    "author": "Interesting-Sign2678",
                    "body": "GDP: Grand Devil Project, bringing the seven sins to a civilisation near you! We've got:\n\n* Greed (billionaires)\n\n* Lust (hookup culture)\n\n* Envy (influencers, fast fashion...)\n\n* Gluttony (have you seen the price of eggs?!)\n\n* Wrath (hi Israel!)\n\n* Sloth ( C A R S )\n\nAnd last, but certainly not least...\n\n* Pride (identity politics!!!)\n\nDon't miss it! Participate in the Grand Devil Project today! (Only available while ~~the entire fucking ecosystem~~ supply lasts.)",
                    "score": 22,
                    "replies": [
                        {
                            "author": "enderofgalaxies",
                            "body": "But wait, there's more! 1% of all proceeds are donated to the Second Coming of Christ Foundation! You can rest easy knowing that your hard earned dollars are being spent helping us bomb brown children of differing faiths. Call now!",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "DisapprovingCrow",
                                    "body": "Jesus is gonna need that cash when he comes back though!!\n\nDo you expect him to wear dirty sandals and ride around on a donkey?!?\n\nJC needs his stretch hummers and gold plated M16s!!  (He also needs me to have a private jet, *cash* )",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "NormieSpecialist",
            "body": "Huh. Santa would be a socialist.",
            "score": 15,
            "replies": [
                {
                    "author": "Some_nerd_named_kru",
                    "body": "What’s that video where kgb agents are interrogating Santa and let him go after deciding he’s on their side",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "orignalnt",
                    "body": "There’s a REASON he wears RED!!!!!!!",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "mr_warhamster",
                    "body": "Funny enough i have an npc in my dnd campaign, which is communist santa, called comrade claus",
                    "score": 2,
                    "replies": [
                        {
                            "author": "NormieSpecialist",
                            "body": "Love it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -64,
            "replies": [
                {
                    "author": "sakodak",
                    "body": "Edit:  for when the op inevitably gets removed for liberalism, it said: \n\n\n>Cuba has all that. Why aren’t people rushing to get there?\n\n\nBecause they've been subject to a cruel blockade since the 1960s.\n\n\nThe US cannot afford a thriving socialist country right off its coast, so it has to artificially suppress their economy. \n\n\nAnd make no mistake, if the sanctions were lifted they would thrive.",
                    "score": 100,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -39,
                            "replies": [
                                {
                                    "author": "sakodak",
                                    "body": "We currently have the richest man in the world running roughshod through the American government specifically to make himself even richer, and you're fixated on imaginary inequality in a country that we won't even allow basic household appliances in. \n\n\nYou need to gain some perspective, friend.",
                                    "score": 46,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[deleted]",
                                            "score": -27,
                                            "replies": [
                                                {
                                                    "author": "sakodak",
                                                    "body": ">Europe and Asia have no blockade on Cuba. \n\n\nYou don't know what you're talking about.  The US has all kinds of rules in place that effectively prevent other countries from trading with them. \n\n\nEvery year for decades the UN takes a vote to remove the sanctions, and every year it's unanimous to remove them -- except for the US and Israel.  And since the US has a veto the sanctions remain in place.\n\n\n>Brainwashed and ignorant \n\n\nI didn't insult you, you can fuck off with this terminally online asshole behavior.",
                                                    "score": 36,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[deleted]",
                                                            "score": -10,
                                                            "replies": [
                                                                {
                                                                    "author": "sakodak",
                                                                    "body": "Ah, so you're just a bog standard Internet troll.\n\n\nToodles.",
                                                                    "score": 26,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Thereisonlyzero",
                                                    "body": "Hearing someone point for point stochastically parrot propaganda then turn around in the same thought and call anyone who disagrees with them \"brainwashed\" is:\n\n![gif](giphy|3o7aCWJavAgtBzLWrS|downsized)",
                                                    "score": 20,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "CMao1986",
                    "body": "https://preview.redd.it/qot3hb3dkqle1.png?width=985&format=png&auto=webp&s=1618b6decadaefa52b20457f99025e4a8e59a3c1",
                    "score": 44,
                    "replies": []
                },
                {
                    "author": "Puzzleheaded-Coast93",
                    "body": "Probably because of the sixty year long embargo devastating their economy.",
                    "score": 57,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -30,
                            "replies": [
                                {
                                    "author": "Puzzleheaded-Coast93",
                                    "body": "Have you been? Or are you just spouting random nonsense you’ve heard.",
                                    "score": 12,
                                    "replies": []
                                },
                                {
                                    "author": "Temporuim",
                                    "body": "Why would you talk shit about Castro? Dude was based as fuck. Btw, just try to talk shit about the pedophile Charles III in the UK",
                                    "score": 29,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "HorseForce1",
                    "body": "Cuba has world peace?",
                    "score": 17,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -11,
                            "replies": [
                                {
                                    "author": "HorseForce1",
                                    "body": "World peace means eighty assassination attempts by the world’s largest super power and an embargo from the rest of the world for no reason?",
                                    "score": 28,
                                    "replies": [
                                        {
                                            "author": "Hacksaw6412",
                                            "body": "640 assassination attempts *",
                                            "score": 27,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Amon-Verite",
                    "body": "US economic war",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "Inconspicuouswriter",
                    "body": "Do you have something against universal Healthcare and offering every human a decent life?",
                    "score": 7,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Inconspicuouswriter",
                                    "body": "How is that a response to my question?",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "onespicycracker",
                    "body": "Fuck. This guy is an actual idiot.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "Admirable_Boss_7230",
                    "body": "It is never easy migrating to socialist countries. This world has finite resources and a overpopulation problem, better we solve problems from ours own countries. \n\n\nIf they help everyone living on capitalist countries, like US and Latin America, problem will never be solved - problematic countries will keep delivering excess people. We need changing ours home countries.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "AccordingComposer852",
                    "body": "They have it in Western Europe. People do rush here.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Virtual_Revolution82",
                    "body": "There isn't enough space for everyone",
                    "score": -6,
                    "replies": [
                        {
                            "author": "Mlch431",
                            "body": "Says who? The oligarchs who run the show?",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "wunderud",
                                    "body": "OC sucks, but Cuba is an island and would likely struggle to accept the 835k members of this sub especially under the above discussed US sanctions. I believe Virtual Revolution was pointing out that Cuba is small and is not in a current state to accept and care for many immigrants.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Mlch431",
                                            "body": "I interpreted it as catching up to Cuba. Thanks for potentially clarifying though.\n\nI just tire of arguments that we need to reduce our global population drastically or limit births in light of all of our advancements, such as healthcare. I read it as not everybody should receive healthcare because then we would have too many people — likely incorrectly looking back at the thread.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}