{
    "title": "My boomer friend never continued education past high school, bought a very nice house decades ago that he still lives in, and is now comfortably retired",
    "author": "ChongTheCheetah",
    "subreddit": "LateStageCapitalism",
    "rank": 81,
    "score": 991,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 24,
    "url": "https://www.reddit.com/r/LateStageCapitalism/comments/1izx3yi/my_boomer_friend_never_continued_education_past/",
    "id": "1izx3yi",
    "selftext": "Meanwhile, my university degree and I are currently looking for an apartment to rent that’s at least somewhat livable without breaking the bank and also planning a retirement that may not even happen. I’m just glad my older friend is actually in touch with what’s going on in this modern US economy and fully acknowledges how much harder it is… even though life is technically supposed to be easier… but having that conversation just ignited so much anger in me (to be clear, not at him at all!) and I just had to share it somewhere. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "wastingtoomuchthyme",
            "body": "On '92 I got a job at a university I was married and supported a family of four.. two cars. Apartment.. and we are pretty comfortable all on 47.5 k USD.. rent was 650. Utils were 50. Cable 25  groceries were about 200..etc.\n\nIn 2008 I left the corporate world and got a similar job at the same University.. 57.6k usd..\n\nRent 1900 utils 350 cable/internet 150 food 400+. Etc\n\nMost people who work at the University can't live in the town of the University",
            "score": 412,
            "replies": [
                {
                    "author": "ChongTheCheetah",
                    "body": "Wow some nice welcome back from old employer.",
                    "score": 88,
                    "replies": [
                        {
                            "author": "wastingtoomuchthyme",
                            "body": "It's a Union gig.. workers get to eat s***.. whereas the administration with titles like Vice Chancellor for student engagement and successories get paid 200-400k with retention bonuses",
                            "score": 53,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Straight-Razor666",
                    "body": "47k in 92 is about 115 +/- now.  See the real cause?",
                    "score": 39,
                    "replies": [
                        {
                            "author": "Jacostak",
                            "body": "I believe that was the point...",
                            "score": 26,
                            "replies": []
                        },
                        {
                            "author": "ScaleneWangPole",
                            "body": "For additional context, the $57.6k in 2008 is ~$87k in 2005 money.\n\n10k more was worth about 20-40k less in just 16 years",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Straight-Razor666",
            "body": "Poverty is a necessary and consequential result of capitalist extraction.  The fundamental contradiction to capitalism (IMO, and there are many others) is the fact that it creates poverty for the masses faster than it creates wealth for the parasitic few.  This means that each successive generation is - and is guaranteed to be - worse off than the previous one.  Capitalism ensures that more people move down the ladder than up it and is the root cause of pretty much all of our problems as a society.",
            "score": 131,
            "replies": [
                {
                    "author": "someoldguyon_reddit",
                    "body": "That's called trickle down economics.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "AndReMSotoRiva",
            "body": "I always think , why us.  And also the repercussions of living in a difficult economy, it is hard to find a partner because peoples expectations are too high, it is hard to make friends because corporate life  is very dynamic, every year people are leaving until one day you will leave too and no true friendships are made, everyone hate each other because instead of seeing that the problem comes from up everyone fall to the propaganda and blame the people right at their side. Just had a horrible discussion with my father because I said things are going to get hard in the US to which he answered  \"Thats Biden's fault, Trump is going to fix it\", this stupid media have brainwashed everyone at that include my parents and now it is so insufferable to talk to them.",
            "score": 98,
            "replies": [
                {
                    "author": "NickDrake1979",
                    "body": "Same here. The world my parents knew doesn't exist anymore and they are coping as they can",
                    "score": 27,
                    "replies": []
                },
                {
                    "author": "mayday_justno823",
                    "body": "Not to make it about me, but I can relate…my neglectful maga worshipping father went to law school and had numerous financial handouts from his grandparents. Not to mention them rescuing him when he has straight up purposefully done fucked up shit. He doesn’t give a fuck about his own children or grandchildren with medical issues. He certainly doesn’t care about the vast majority of the human race and looks down on anyone “other”. I’ve tried for years to get through to him, tried to get through once more by sending info about Yarvinism and just how we have been fucked over by capitalism in general. He won’t read anything and claims he likes what they are doing. Yet he spams me so much bullshit, I’ve had to mute him! I’m sorry you are also dealing with this nonsense. ",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "feed_me_tecate",
            "body": "Yep, shit sucks.",
            "score": 21,
            "replies": []
        },
        {
            "author": "Tall_Investigator611",
            "body": "There are boomers that are very aware that it's completely F-ed for the young people growing up here. This high cost of everything and low wages is so wrong. It's a rigged game for the working people to lose and never get ahead. We need new leadership. County, State, and National govt. Big mistake screwing the working people... 😠",
            "score": 15,
            "replies": []
        },
        {
            "author": "Templar388z",
            "body": "Then we called fucking entitled for expecting the same path as them. Baby boomers didn’t even work for what they got, their parents did. FDR did all the work, and the children and grandchildren benefited the most yet did the least. Someone working as custodian could maintain a family of five, buy a house, a car, vacations. Now? Pfft, you want to make rent? Yet that’s entitlement.",
            "score": 7,
            "replies": []
        },
        {
            "author": "commie_1983",
            "body": "and idiots keep voting for it...",
            "score": 22,
            "replies": []
        },
        {
            "author": "oak_and_clover",
            "body": "My boomer uncle sold *paper towels* to grocery stores. No college degree. Retired around age 60 with a very nice pension and a large house in the suburbs. His wife never worked. They take vacations to Europe every other year.",
            "score": 2,
            "replies": [
                {
                    "author": "ChongTheCheetah",
                    "body": "So wild…",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DanTheBiggMan",
            "body": "Went to university for a semester, didn't like it and withdrawal. \n\nTook a trade ~12 years ago, now have 3 trades licenses and on track (half way) to being a millionaire. \n\nSometimes you have to follow the money.",
            "score": -1,
            "replies": [
                {
                    "author": "Ironicbanana14",
                    "body": "I think its not easy enough anymore, things go too quick. You can go for a trade and then by the time you finish that apprenticeship the money hops to an adjacent one, you repeat the cycle again. What do you do? The money seems to go toward different electronic/mechanical repairman jobs. Things like cell towers, wind farms, solar panels.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "ChongTheCheetah",
                    "body": "Guess you were the actual educated one here.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": -23,
            "replies": [
                {
                    "author": "Kindly_Ad_7201",
                    "body": "lol. No way this isn’t a bot",
                    "score": 11,
                    "replies": []
                }
            ]
        }
    ]
}