{
    "title": "Look at my trans representatives, dawg…",
    "author": "Hacksaw6412",
    "subreddit": "LateStageCapitalism",
    "rank": 24,
    "score": 1083,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 55,
    "url": "https://i.redd.it/ou8mpsxahlme1.jpeg",
    "id": "1j31vfr",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Anti_colonialist",
            "body": "Race, gender, sexual orientation mean nothing once they represent the oligarchy. They all serve the same interests",
            "score": 529,
            "replies": [
                {
                    "author": "fatastronaut",
                    "body": "this is why identity politics is a dead end for anyone with an ounce of foresight. of course we want diversity in our elected representatives, but as soon as you prize identity over ideology, the ruling class will find a black trans disabled veteran to help gut social security and sell the next war.",
                    "score": 105,
                    "replies": [
                        {
                            "author": "melody_magical",
                            "body": "And then the ruling class convinces the masses that the war was started by DEI, which convinces them to vote for reactionaries instead of organizing against The Establishment.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Chaetomius",
                            "body": "\\> but as soon as you prize identity over ideology,\n\n  \nwhich nobody ever did.\n\n  \nexcept republicans who do all the time.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "unlimitedestrogen",
            "body": "https://preview.redd.it/7n38cw4ixpme1.jpeg?width=1080&format=pjpg&auto=webp&s=d6dafc43f046d9df160ea6d80aa43e08defc274e\n\nDAMN SHE'S CHEAP",
            "score": 752,
            "replies": [
                {
                    "author": "Threewisemonkey",
                    "body": "Sold out for Kia Sorento money",
                    "score": 388,
                    "replies": [
                        {
                            "author": "kingkongbiingbong",
                            "body": "https://i.redd.it/fs5zuh906sme1.gif",
                            "score": 42,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "RedHotFries",
                    "body": "Those are declared lobbying. We can never know the deals done in secret rooms by elites.",
                    "score": 97,
                    "replies": []
                },
                {
                    "author": "ChicoSam21",
                    "body": "It looks like her '23-'24 contributions from AIPAC are 10k (unless I'm reading it wrong on the website, and if so please correct me). Sad she's sold out for basically nothing.",
                    "score": 54,
                    "replies": []
                }
            ]
        },
        {
            "author": "JonoLith",
            "body": "MORE. \\*clap\\* TRANS. \\*clap\\* WAR CRIMINALS! \\*thunderous applause.\\*",
            "score": 529,
            "replies": [
                {
                    "author": "Beer-Milkshakes",
                    "body": "Who thought that in 2014 when we proposed more women bomber pilots we would get trans war criminals only 10 years later.  💫PROGRESS💫  I am so proud of us",
                    "score": 108,
                    "replies": []
                }
            ]
        },
        {
            "author": "ZrxXII",
            "body": "The only trans \"representative\" in this fucking country and she's pro genocide. She doesn't represent me",
            "score": 175,
            "replies": [
                {
                    "author": "Sad_Page5950",
                    "body": "I'd estimate that she doesn't represent 95% of us",
                    "score": 36,
                    "replies": []
                },
                {
                    "author": "askouijiaccount",
                    "body": "Uhhhhhhhhhhhhh don't look to dc for your personal representation or you will be deeply disappointed for the rest of your life. ",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "20191124anon",
                    "body": "My representatives live in cabins, doing things.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "rationalempathy",
                    "body": "Agreed. She doesn’t care about the people she represents—let alone her constituents. I am disappointed and disgusted by her actions.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 199,
            "replies": [
                {
                    "author": "Straight-Razor666",
                    "body": "lol",
                    "score": 26,
                    "replies": []
                }
            ]
        },
        {
            "author": "Low_Pickle_112",
            "body": "Has there ever been any entity in the history of the world who said \"Those people's existences are negotiable, but don't worry, we won't come for anyone else later\" and that actually happened?  Because my understanding is that once you decide that one group isn't human and doesn't deserve to live, it tends to not end there.",
            "score": 130,
            "replies": [
                {
                    "author": "NeverQuiteEnough",
                    "body": "a lot of people forget this, but some of the first people Hitler killed were his own fascist thugs.\n\n[https://en.wikipedia.org/wiki/Night\\_of\\_the\\_Long\\_Knives](https://en.wikipedia.org/wiki/Night_of_the_Long_Knives)\n\nliterally no one is safe, it's a death cult all the way to the top.",
                    "score": 52,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ninlilizi_",
            "body": "Imagine going to work in a place where nobody thinks you should even be allowed to use the toilet with dignity, and still simping for their entire regime.",
            "score": 161,
            "replies": [
                {
                    "author": "NeverQuiteEnough",
                    "body": "fascists are incapable of imagining a better world.\n\nthe only avenue to safety they can envision is through becoming an oppressor.\n\nbeing in more danger only makes them more desperate to step over others faster.",
                    "score": 44,
                    "replies": [
                        {
                            "author": "Familiar_Invite_8144",
                            "body": "Part of the reason is they are ultimately cowards. Terrified of a world they know they would be impotent to face without overwhelming domination",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "brokegaysonic",
            "body": "Yeah I was very suspicious about her when she very easily capitulated to the attacks against her. She sort of threw the community under the bus by being like, showing people that a \"good trans\" is supposed to shut up.",
            "score": 51,
            "replies": []
        },
        {
            "author": "StrangeNecromancy",
            "body": "As a trans woman myself, she can go fuck herself.\nWorking class trans women have been saying time and time again NOT IN OUR NAME.",
            "score": 83,
            "replies": []
        },
        {
            "author": "lazerctz",
            "body": "To be given even the remotest access to the levers of power you must prove you're no threat in using them. Any person, of any demographic, that is absorbed into the machine is expected to keep the engine running with minimal interruptions or be rejected like a transplanted organ.",
            "score": 17,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 36,
            "replies": []
        },
        {
            "author": "Firefly-ok",
            "body": "Even trans people can have terrible views and uphold dangerous systems of oppression.\n\nJust like recognizing that feminism is needed and that women are oppressed by patriarchy doesn't negate the fact that women being given power within a dangerous system won't change that dangerous system (having a CEO girlboss doesn't do anything on its own to dismantle capitalism and indeed upholds that structure), having trans people in positions of power, on its own, won't dismantle the harmful systems of power (as we can see here with Rep. McBride).\n\nTrans people won't really be free until we dismantle capitalism. The kind of representation we need is trans people helping lead the revolution. I think we need to do all we can to make our leftist spaces as welcoming to trans people as possible (and all marginalized groups) so that trans people feel safe to be a part of the revolution that we need.\n\nFred Hampton had the right idea and I think we should be following his example. We can all defeat capitalism together by creating communities that can exist outside of the racist (and trans-phobic) capitalist structure as much as possible.",
            "score": 17,
            "replies": []
        },
        {
            "author": "ArcticShamrock",
            "body": "![gif](giphy|2SBvv58qaLptK|downsized)",
            "score": 25,
            "replies": []
        },
        {
            "author": "HixWithAnX",
            "body": "So stunning and brave!",
            "score": 27,
            "replies": [
                {
                    "author": "chuuckaduuck",
                    "body": "Buckle up buckaroo!",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "TolPM71",
            "body": "Liberal coopting of \"representation for empire\", is exactly why it's so easy for reactionaries to sell the notion that any representation at all is just another bourgeoisie wank. It's why \"Kamala is for they/them. President Trump is for you\" was such a successful slogan when she gave only the most milquetoast support for Trans people. \n\nDitto for \"BLM Boulevard\" and other idiocies, it sells the notion that caring about minorities at all is just a thing that people from big cities in nice suits pretend to do every couple of years.",
            "score": 12,
            "replies": []
        },
        {
            "author": "Yuval_Levi",
            "body": "Me: When we getting universal, single-payer, healthcare?\n\nRethuglicans & Demonrats: Never. It's just culture wars from now till armageddon.",
            "score": 5,
            "replies": []
        },
        {
            "author": "pheco",
            "body": "She became your representative thanks to that AIPAC money dog",
            "score": 10,
            "replies": []
        },
        {
            "author": "cutmesomeflax",
            "body": "This is why I can't stand liberals",
            "score": 23,
            "replies": [
                {
                    "author": "Sad_Page5950",
                    "body": "Yeah libertarians are selfish pieces of shit",
                    "score": -7,
                    "replies": [
                        {
                            "author": "askouijiaccount",
                            "body": "Both liberals and libertarians are pieces of shit, yes. Sorry if you're one of those and your feelings are hurt. ",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "Sad_Page5950",
                                    "body": "Depends on what you mean by liberal. We don't use that term in Australia to describe ethical, empathetic lefties",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "author": "askouijiaccount",
                                            "body": "We don't use it that way in the US either. You're pretty confused actually. ",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "Sad_Page5950",
                                                    "body": "Liberals are conservatives here. It's all backwards. Sorry for the confusion 😄",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "askouijiaccount",
                                                            "body": "They are here too. Apologize to yourself. ",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "GordEisengrim",
            "body": "When supporting Trans rights, we also must support Trans wrongs.",
            "score": 11,
            "replies": []
        },
        {
            "author": "TerranceBaggz",
            "body": "Sellout. Jesus. This fealty to ANY country over the US should be treated as treason. Be it Russia or Israel or whatever.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Live_Ad8316",
            "body": "Biggest bruh moment of my life",
            "score": 4,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -38,
            "replies": [
                {
                    "author": "ardent_wolf",
                    "body": "The ethical thing would be to resign or confess, not succumb to blackmail. This isn't much of a defense.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "SymbolicWhiteHorse",
                    "body": "source?",
                    "score": 23,
                    "replies": [
                        {
                            "author": "Benyano",
                            "body": "This has nothing to do with Epstein, that’s conspiratorial, and arguably rooted in antisemitism. This has everything to do with the way lobbying and campaign fundraising works in this country. If the option is to either receive 10s of thousands of dollars for your campaign or having hundreds of thousands be used to primary you, the choice is pretty simple for those not truly rooted in their values and communities.",
                            "score": 17,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -17,
                            "replies": [
                                {
                                    "author": "SymbolicWhiteHorse",
                                    "body": "Source: “Do your own research!” \n\nAs far as I know, Epstein is dead. Saying no to money is allowed.",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "entropygoblinz",
                    "body": "If the threat is \"not getting truckloads of money\" then yeah I guess",
                    "score": 5,
                    "replies": []
                }
            ]
        }
    ]
}