{
    "title": "Long live the Sahel revolutions.",
    "author": "Ok-Musician3580",
    "subreddit": "LateStageCapitalism",
    "rank": 5,
    "score": 182,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 5,
    "url": "https://v.redd.it/qvepo1afgwme1",
    "id": "1j47dju",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "##Welcome to r/LateStageCapitalism\n\n This subreddit is for news, discussion, memes, and links criticizing capitalism and advancing viewpoints that challenge liberal capitalist ideology. That means any support for any liberal capitalist political party (like the Democrats) is strictly prohibited.\n\n LSC is run by communists. This subreddit is not the place to debate socialism. We allow good-faith questions and education but are not a 101 sub; please take 101-style questions elsewhere.\n\n We have a zero-tolerance policy for bigotry. Failure to respect the rules of the subreddit may result in a ban.\n\n\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/LateStageCapitalism) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "CMao1986",
            "body": "Captain Ibrahim Traoré is the kind of leader that I would gladly fight for, look out for us and we will look out for you!",
            "score": 20,
            "replies": []
        },
        {
            "author": "manticorllc",
            "body": "Finally some real progress, Africans deserve a dignified life and freedom from colonization",
            "score": 19,
            "replies": []
        },
        {
            "author": "greekscientist",
            "body": "Burkina Faso even made it's first homegrown vehicle recently. Generally the three countries of Sahel have embarked in a path of liberation and sovereignty. I hope that socialism will be adopted by the there countries in the future.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Ill_Reflection4578",
            "body": "Viva viva!!!",
            "score": 1,
            "replies": []
        }
    ]
}