{
    "title": "For the movie Thunderpants (2002) they used the wrong photo for Rupert Grint's character because they were too lazy too google what his character looked like",
    "author": "schoensmeerpijp",
    "subreddit": "shittymoviedetails",
    "rank": 5,
    "score": 20436,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 480,
    "url": "https://i.redd.it/idn2tsxokfpe1.png",
    "id": "1je2fkd",
    "selftext": "",
    "comments": [
        {
            "author": "BurlyZulu",
            "body": "Was this whole movie’s marketing just \"kid from Harry Potter.\"",
            "score": 5589,
            "replies": [
                {
                    "author": "schoensmeerpijp",
                    "body": "Not initially, but when Rupert became famous they went all in. He's not even the main character!",
                    "score": 3126,
                    "replies": [
                        {
                            "author": "thePinguOverlord",
                            "body": "That’s like all those straight to dvd films with Adrian Brody, Bruce Willis or even Eric Roberts. Where they have one scene and that makes them the top billed actor of the film.",
                            "score": 995,
                            "replies": [
                                {
                                    "author": "Fools_Errand77",
                                    "body": "These sort of things always remind me of the poster for Scream (1996). Odds were pretty good that anyone who saw it had never seen any of the actors on it except for Drew Barrymore. You know, the actress most prominently featured on it, and whose character was killed off in the first 10 minutes.",
                                    "score": 350,
                                    "replies": [
                                        {
                                            "author": "MyHamburgerLovesMe",
                                            "body": "That was the twist.  The internet was young and it was harder for people to spoil movies for you.\n\nEveryone thought Drew was going to be the MC.  Killing her off early really set the pace for the rest of the movie and truthfully helped relaunch Drews career.\n\n(simular to how Pulp Fiction relaunched Sam Jackson, Travolta, and Bruce Willis's careers a year or two before)",
                                            "score": 300,
                                            "replies": [
                                                {
                                                    "author": "Samurai_Meisters",
                                                    "body": "Pulp Fiction was more like the launch of Samuel L Jackson's career rather than a relaunch. He was in stuff, but no one knew who he was before PF. Unlike Travolta or Willis.",
                                                    "score": 84,
                                                    "replies": [
                                                        {
                                                            "author": "dragtheetohell",
                                                            "body": "He had decent roles in Menace to Society, Jurassic Park & True Romance all in 93, the year before Pulp Fiction. I would say his star was definitely on the rise regardless of Pulp Fiction, though it no doubt solidified his career given the best supporting actor Oscar nomination he got from it.",
                                                            "score": 32,
                                                            "replies": [
                                                                {
                                                                    "author": "The_News_Desk_816",
                                                                    "body": "I was gon say, Menace was the first thing I remembered him in.\n\nIt's funny, as often as it's referenced by the general population, most people not from the hood have never actually seen Menace. A lot of times people think they're referencing Boyz N Da Hood. Cracks me up",
                                                                    "score": 10,
                                                                    "replies": [
                                                                        {
                                                                            "author": "InfiniteRaccoons",
                                                                            "body": "Don't Be a Menace to South Central While Drinking Your Juice in the Hood",
                                                                            "score": 7,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "The_News_Desk_816",
                                                                                    "body": "That's what I mean tbh. Idk how many people I had to explain to that it wasn't solely a Boyz parody, it was multiple hood movies, a lot of which they'd never seen",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Samurai_Meisters",
                                                                                            "body": "I think they even say \"hood movies\" at one point in Don't Be A Menace.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "jstiegle",
                                                                    "body": "He's my favorite character in Jurassic Park! All the Jurassic Park IT stuff really got me into computers and now I'm an IT guy.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "TheMythofKoalas",
                                                                            "body": "I was always saddened that he got killed off offscreen. Thought he was fun.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "torrinage",
                                                            "body": "Always laugh when I watch Do The Right Thing - he was the DJ!",
                                                            "score": 7,
                                                            "replies": [
                                                                {
                                                                    "author": "The-disgracist",
                                                                    "body": "He was a hobo who robbed macdowels in coming to america.",
                                                                    "score": 21,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Marx_Forever",
                                                                            "body": "Still insane watching Samuel Jackson get his ass handed to him by Eddie Murphy.",
                                                                            "score": 8,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Orthas",
                                                                                    "body": "I bet eddie still brings it up.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "ScreamingNinja",
                                                                            "body": "Oh wow. I have to see that movie again, its been years.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Ninjaflippin",
                                                            "body": "Hey now,  he was a crackhead in Coming to america..  Shoulda got an oscar!",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "JaneksLittleBlackBox",
                                                                    "body": "Deserved the Andre Royo “street Oscar” he received for playing Bubbles on The Wire; his homeless heroin addict costume and makeup was so believable that a real heroin addict gave him some actual heroin because he thought Andre needed the fix even worse than he did.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "JaneksLittleBlackBox",
                                                            "body": "Yeah, he was the “hold on to your butts” grumpy chain smoker in Jurassic Park, then Pulp Fiction and Die Hard with a Vengeance happened, teaming up Butch and Jules in some fine Die Hard fashion that put Die Harder to fucking shame, and suddenly everyone remembered Sam Jackson’s “Monday through Friday, monkey-fighting” name!",
                                                            "score": 2,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "K_Linkmaster",
                                                            "body": "Naw that's fucking bullshit...checks imdb....well fuck, I agree with you. There is nothing super noteworthy prior to pulp fiction. After pulp fiction it's insanity levels of good roles.",
                                                            "score": 2,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "ArtPeers",
                                                            "body": "People who watched Spike Lee movies and Menace to Society **definitely** knew who we was before *Pulp Fiction*: he chewed up every scene.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "aseedandco",
                                                            "body": "Wash your mouth out!",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "JackorJohn62392",
                                                    "body": "It didn't take long for the internet to catch on. Correct me if I'm wrong but I remember reading that the script to Scream 2 got leaked online after they started filming. \n\nThey had to shuffle actors around and have them play different characters and changed the ending. They also had to be secretive about who the killers were and didn't let the actors know until the day of filming the reveal.",
                                                    "score": 8,
                                                    "replies": [
                                                        {
                                                            "author": "PeriodicGolden",
                                                            "body": "And that made it into the script for Scream 3",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "stanfan114",
                                                    "body": "Psycho did the same thing in 1960, everyone assumed Janet Leigh was going to be the main character but gets killed almost right away.",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "MyHamburgerLovesMe",
                                                            "body": "Yep - definitely one of the better movie twists.\n\nWhen Hitchcock was on fire he made great films.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Jumpin-jacks113",
                                                    "body": "Executive Decision is the same way.   Steven Seagal was still a name in 1996.  They killed him off right when they were getting in the plane, where the setup was finishing and the action part of the movie was starting.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "ThatFuckingGeniusKid",
                                                            "body": "Yeah, but that was cause he was so much of an asshole that they wanted to get rid of him as soon as possible",
                                                            "score": 5,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Ephieria",
                                                            "body": "They changed the script because the plane would not take of with seagal.",
                                                            "score": 3,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "MyHamburgerLovesMe",
                                                            "body": "I thought Seagal was supposed to have had a larger part in Executive Decision, but then I ran across this\n\n>Various reasons have been bandied about for why Steven Seagal had so little screentime in the finished film, despite being prominently promoted in the trailers and promo art. These possible reasons include Warner Bros. \"punishing\" Seagal because of his antics on the set of On Deadly Ground, his primadonna behavior, or both. In actuality, Seagal's character (Travis) was always meant to die in the finished film. The earliest draft of the script (written in April 1991) had Travis die in the exact same way, with the only difference being that he didn't have a final line telling Grant to keep the team safe, and the team originally used the umbilical of a refueling airplane instead of a stealth jet to get onto the plane.\n\nhttps://tvtropes.org/pmwiki/pmwiki.php/Trivia/ExecutiveDecision",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "RyanfaeScotland",
                                                    "body": "My god, Scream was '96 and Pulp Fiction was '94!? I always they there was a gulf between these movies! Like Pulp is '91 and Scream is 2003!?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "JaneksLittleBlackBox",
                                                            "body": "I feel the same way about early aughts movies. The terribly schlocky American Outlaws as a star-making vehicle for the Irish hunk Colin Farrell was released only 18 months before the worst filmed adaptation of Daredevil with Farrell’s godawful interpretation of Bullseye. \n\nSo many *big* and great movies were released in 2002 that it almost seems impossible that the timing between those two movies was only 18 months. Raimi’s Spider-Man was notably one of those 2002 movies that revitalized Daredevil’s production and got its budget raised; Farrell was also in the much better Minority Report and Phone Booth in 2002. \n\nBut so much good shit came out between American Outlaws in 2001 and Daredevil in 2003 that it really does feel like a vast ocean of time between the two, not simply 18 months, which is like a blink of the eye when you’re over 20. \n\nThere was also one of those silly li’l space opera Star Wars movies released in 2002 that apparently made quite a bit of money; whodathunk it ¯\\\\\\_(ツ)_/¯",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "StrobeLightRomance",
                                                    "body": "I feel like Drew's career never really dipped below what she wanted to be doing. She's always felt very over exposed and spotlight hungry, like just the most Hollywood kid possible, but that without Scream, she would have had roughly the same amount of opportunity because she throws herself in front of anything that she hears about. The fact a lot of her work is legit is purely by accident in the same way that Nic Cage is considered successful. If you do enough projects strictly for clout, some of those projects will be awesome, and others will just be unwatchable.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "MyHamburgerLovesMe",
                                                            "body": "I guess she went from being a \"working\" actor (one who got enough parts to live on) to a string of hit movies.\n\n* Scream - 1996\n* The Wedding Singer - 1998\n* Ever After: A Cinderella Story - 1998\n* Home Fries - 1998\n* Charlie's Angels - 2000\n* Donnie Darkom- 2001",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "StrobeLightRomance",
                                                                    "body": "Boys on the Side was actually a huge movie in 1995, and she had a bit part in Batman Forever that same year.  \n  \n By contrast, it's clear you have no idea what you are talking about because you included Home Fries (nobody ever spoke of this movie again) but left off Never Been Kissed.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "JaneksLittleBlackBox",
                                                    "body": "And then Travolta looked at all the money and roles being offered him after that career-saving lifeline, only to turn to Xenu and say, “It’s about time someone did your story right!”\n\nTravolta‘s ability to keep getting *awful* fucking roles following Battlefield Earth, keeping him somehow relevant enough to convince him that *he’s* the natural choice to bring John Gotti to the silver screen in one of **the** worst crime biopics committed to film is absolutely baffling. \n\nMaybe there is something to Scientology\\* given Travolta and Tom Cruise’s careers surviving their very public and very embarrassing devotions to that cult. Cruise is especially surprising, because his 2005 antics after firing his publicist that kept a lid on his crazy pissed Steven Spielberg off so much that he swore to never work with Cruise again; that’s stayed true 20 years on, and he only directed Cruise twice in Minority Report and War of the Worlds. Paramount specifically blamed his 2005 meltdown on Mission: Impossible III not performing as well as expected, so they broke up with him and Paula Wagner for five years until he was unexpectedly announced to be reprising his role as Ethan Hunt in Ghost Protocol. \n\nBut the new hotness, Jeremy Renner, was being rumored as a potential successor to the face of the franchise, so it kinda made sense that Paramount would being Cruise back for one more “passing the torch” movie. 14 years and almost four box office successes later, he’s still Ethan Hunt and Renner had to tap out of the franchise because he was kinda tied up in another massive franchise thanks to a little indie hit released five months after Ghost Protocol: The Avengers. \n\nStill amazes me how easily both destroyed their careers for what seemed like forever, but both are still relevant in that industry, one *very* fucking much so. \n\n&nbsp;\n\n\\*money and illegal coercive tactics aside, I mean, because that’s already an obvious explanation.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Fools_Errand77",
                                                    "body": "Twist/Deceptive marketing. Potato/Potato",
                                                    "score": -43,
                                                    "replies": [
                                                        {
                                                            "author": "Warm_Month_1309",
                                                            "body": "Absolutely not.",
                                                            "score": 14,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "SuperBackup9000",
                                                            "body": "Pretty big difference when the entire movie is meta. \n\nHer dying means you don’t know what to expect, but then at the same time, you have a side character telling you exactly what to expect but why would you believe him when the formula already fell apart?",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "exceptyourewrong",
                                            "body": "What? Courtney Cox was SUPER famous - Friends had been out for a couple of years. Neve Campbell, and David Arquette were well known, too. \n\nKilling off the \"Star\" of the movie in the first scene was an intentional choice that set Scream apart from other horror movies. Killing her killed \"plot armor.\"",
                                            "score": 144,
                                            "replies": [
                                                {
                                                    "author": "ponderingcamel",
                                                    "body": "I believe Drew was suppose to be Sydney but had to back out because of another commitment but they were still able to use her for one the most iconic horror cold opens.",
                                                    "score": 18,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Fentwizler",
                                                    "body": "Killing off the \"star\" was also a head nod to psycho where they killed Janet Leighs character in the first part of the movie, since Scream loves stuff like that.",
                                                    "score": 15,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "CandidHistorian4105",
                                                    "body": "Seriously I am betting many new Campbell and Skeet from The Craft that had come out before this!",
                                                    "score": 20,
                                                    "replies": [
                                                        {
                                                            "author": "Ganoes_Stabro_Paran",
                                                            "body": "I knew Matthew Lillard from Hackers. Hell, everyone my age and gender watched that movie because Angelina Jolie manic pixie dream girl, topless in a leather jacket.",
                                                            "score": 18,
                                                            "replies": [
                                                                {
                                                                    "author": "AbbyKadavvy",
                                                                    "body": "Thanks for reminding me to rewatch Hackers.",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "The-disgracist",
                                                                            "body": "Don’t hack the planet too hard",
                                                                            "score": 5,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "Natty-Bones",
                                                                    "body": "My VHS copy of Hackers suffered from significant demagnetization around that scene...",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "ShesASatellite",
                                                            "body": "Campbell was on Party of Five - she was really popular already!",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "justafanboy1010",
                                                                    "body": "Oh I remember that show. It was pretty good",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "ShesASatellite",
                                                                            "body": "It wasssss!",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "justafanboy1010",
                                                            "body": "Lol right",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "monkeygoneape",
                                                    "body": ">Killing off the \"Star\" of the movie in the first scene was an intentional choice that set Scream apart from other horror movies. Killing her killed \"plot armor.\"\n\nPyscho did it first",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "bateKush",
                                                            "body": "yeah but scream did it extra meta",
                                                            "score": 5,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "ABHOR_pod",
                                                    "body": "There was a lot more division between TV actors and Film actors back then. These days the lines are almost non-existent but back then TV actors getting cast in a movie was views as a \"Big break\" and you'd try to get off the small screen and onto the big screen. Tv actors were definitely viewed as lesser, and honestly the quality difference in what directors would accept from TV vs film actors was readily apparent back then. \n\nSo yeah, Friends was 2 seasons in and Cox was a main character on a fairly popular tv sitcom, but Drew Barrymore was a child movie star from a multi-generational family of actors and hollywood royalty who had been in the news and tabloids nonstop for like a decade at that point. In terms of celebrity she was by far the biggest one in the film at the time.",
                                                    "score": 8,
                                                    "replies": [
                                                        {
                                                            "author": "Neveronlyadream",
                                                            "body": "You're right. I always think of David Caruso when he quit NYPD Blue thinking he could launch a movie career. He ended up doing a couple of really low budget movies and it never really worked.\n\nIt was pretty frequent back then for TV stars to attempt to break into movies and fail and it wasn't necessarily good for marketing even if you got a popular TV star in your movie.\n\nHow many failed or mediocre movie projects did the cast of Friends, even at the height of its popularity as the biggest show on television, star in and fail? It just didn't translate back then.",
                                                            "score": 2,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Fools_Errand77",
                                                            "body": "This exactly. A classic example is Bruce Willis. When he was cast in Die Hard, he was best known for co-starring in Moonlighting and in wine cooler commercials. His casting was initially deemed a bad risk, because he was associated with television. The successful transition from TV to movies wasn’t all that common. \n\nWhile Im still typing, I might as well point out the general lack of overlap between the target demographics of a Wes Craven horror film and Friends/Party of Five back in 1996.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "anonanon5320",
                                                    "body": "From what I remember, it was Drew’s choice. She liked that idea.",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Gadzooks739",
                                                    "body": "Is it killing plot armor if they were never meant to be in the plot?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "exceptyourewrong",
                                                            "body": "It is if the audience doesn't know that",
                                                            "score": -1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Digit00l",
                                            "body": "Iirc it was her own idea to make her the face of the movie in spite of dying immediately, not entirely sure about how that worked though",
                                            "score": 20,
                                            "replies": [
                                                {
                                                    "author": "KingEnmaJr",
                                                    "body": "She was actually attached to be Sydney. A few weeks before filming started she went to the director and producers and told them she had the idea to play the girl in the opening scene instead. Wes Craven had already rejected being the director multiple times and only, eventually, agreed because Drew was going to be his lead. When she wanted to stop being the lead, he almost dropped out and had to be convinced that continuing would be a good idea.",
                                                    "score": 11,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "malexich",
                                            "body": "It was always meant to be a reference psycho ",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "Illustrious-Stay968",
                                            "body": "Drew Barrymore's character being killed off early was like what Hitchcock did with Janet Leigh's character in Psycho.   I have never seen anything where Craven saying it was homage to Hitchcock, but that is how you \"subvert expectations\".  It wasn't a bait and switch, it's a way for the director to give a real surprise to the viewer.",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "Green_Mikey",
                                            "body": "I was literally Randy the video store guy when this movie came out (I got better, film was an eye-opening mirror of sorts) and we for SURE had endless debates about this as the movie gained very decent popularity. I still stand by my assessment that it was an intentional \"twist\" gimmick rather than a \"big billing\" promotion.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "ShesASatellite",
                                            "body": ">Odds were pretty good that anyone who saw it had never seen any of the actors on it except for Drew Barrymore\n\nWhat on earth are you talking about?? Lol\n\n-Neve Campbell was on Party of Five before Scream \n-Courtney Cox was on Friends before Scream\n-David Arquette was in Buffy the Vampire Slayer (movie) and Airheads before Scream, *and* came from a family of entertainers. His sister, Patricia, was a very well-known actor at the time\n-Skeet Ulrich was known from Boys and The Craft before Scream\n\nI was a tween when this movie came out. I knew who all the actors were because they were all popular at the time for either their network tv shows or movies released prior to the movie. Plus, it was Wes Craven - everyone was following what he was doing at that time. People knew who these actors were lol.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "ClosetDouche",
                                            "body": "Yes. It's hard to believe, but in 1996 no one had ever heard of Courtney Cox.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "OneWholeSoul",
                                            "body": "That was the point, though. They didn't fall into the cliche, they weaponized it.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "BillytheMagicToilet",
                                            "body": "I like how Skeet Ulrich had a goatee in the poster that he didn't have in the movie.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "biglyorbigleague",
                                            "body": "Courtney Cox was pretty famous",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Grabthar-the-Avenger",
                                            "body": "Drew just didn't want to be there in the first place, hence the barely existent part. She was cast largely because a producer was buddies with her agent, and when she tried to get out of it the Weinstein's stepped in and the compromise was to put her in a bit part that could be filmed quickly, which they got the absolute most out of.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "TheCrowing817",
                                            "body": "Scream was one of the first movies to kill a A Lister in the first 10 minutes and she was prominently billed to \"subvert expectations\" and blow people's minds when it happened. And it worked.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Fools_Errand77",
                                                    "body": "A-lister would be a stretch at that time. She was a former child star slowly trying to get ahead in the industry after years of rehab and small roles in direct to video stuff. That said, she’s been in some decent stuff over the years. It’s good she got her act together.",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "duralyon",
                                                    "body": "Have you heard of the movie Psycho? It's kinda famous for doing that a bit earlier than Scream.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "PepperAnn1inaMillion",
                                            "body": "That was deliberate though. Hitchcock did the exact same thing with Janet Leigh in *Psycho*. It’s a deliberate trick to make the audience think, “Oh wow. If *she* can die in this movie then no characters are safe!”",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "frikifecto",
                                    "body": "I highly doubt Eric Roberts would be used like that. XD",
                                    "score": 28,
                                    "replies": [
                                        {
                                            "author": "thePinguOverlord",
                                            "body": "Yeah lol. He’s just one that came to mind. He’s the straight to DVD king. With his rule of being relatively cheap and requires not being killed off. Or something like that lol",
                                            "score": 33,
                                            "replies": [
                                                {
                                                    "author": "MattheqAC",
                                                    "body": "Formerly the telemovie king",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "author": "clutchthepearls",
                                                            "body": "Formerly the music video king",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "author": "Tr3dders",
                                                                    "body": "See there's the Brightside",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "brother_of_menelaus",
                                                    "body": "Yeah, but these are 2 entirely different things. Eric Roberts is the guy you cast in a completely no-name production to give the film a sense of legitimacy. “Oh I’ve seen that guy before!” and he’s in like 2 scenes or so. \n\nThe Thunderpants marketing is entirely different, that’s a movie that was made full of nobodies and probably sat on a shelf until Rupert Grint became famous from Harry Potter and then they used him as the face of the marketing despite his character’s relevance in the movie itself. Kinda like found money, you just stumbled into something.",
                                                    "score": 5,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Accomplished-Ad-2612",
                                                    "body": "Through the 90s, a friend and I had the theory that every movie had Eric Roberts in it (We used to watch a massive amount of late night cable TV while drinking), it eventually turned into a game where we would either drink when we saw him in a film, or we would just pick a random actor and say they were Eric Roberts disguised with effects makeup and then drink when we saw that actor. We were young and drank way too much. We came up with a lot of weird theories back then.",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "clermouth",
                                                            "body": "https://www.reddit.com/r/movies/comments/2r9r5a/what_is_the_new_cainehackman_theory/",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Accomplished-Ad-2612",
                                                                    "body": "I remember that from PCU, I actually saw that in the theatre. For a while there through the 90s I would've said Eric Roberts and C. Thomas Howell were solid contenders to take the mantle after Caine and Hackman. The other thing i liked about PCU was the fact that George Clinton and the P-funk Allstars were in it at the end.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Illustrious-Stay968",
                                                    "body": "Yeah, kind of weird how straight to video was always C and D list actors back in the 60's, 70's, 80's and 90's.  \n\nNow so many \"straight to video\" movies have A list actors in them.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "AramFingalInterface",
                                            "body": "He was in the Dark Knight with Heath Ledger",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "GrandmaPoses",
                                                    "body": "Yeah he was also in *A Talking Cat!?!*.",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "author": "MillsyMB",
                                                            "body": "Two ethereal pieces of art that changed movies forever",
                                                            "score": 7,
                                                            "replies": [
                                                                {
                                                                    "author": "AramFingalInterface",
                                                                    "body": "He knows how to pick em!",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "gravelPoop",
                                                            "body": "Also in DOA (the best video game movie). He wore sunglasses that gave him fighting skills.",
                                                            "score": 3,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "catsareniceactually",
                                                            "body": "...which used a photo of a cuter cat on the DVD cover than the one that's actually in the film.\n\nA little like the photo of Rupert Grint for the poster for Thunderpants...",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "dazeychainVT",
                                            "body": "You've clearly never seen A Talking Cat?! Where Roberts gives a voice performance that sounds literally phoned in",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Graega",
                                    "body": "I love that The Fifth Element is always billed as starring Luke Perry. And Bruce Willis was already well known at the time!",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "ladylucifer22",
                                    "body": "Plan 9 from Outer Space, starring Bela Lugosi",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "Comfortable_Bird_340",
                                            "body": "To be fair, he’s hardly in the movie, since he died and was replaced by a double",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "Illustrious-Stay968",
                                            "body": "Pull the string.   Pull the string!!!!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "jmrene",
                                    "body": "I think that, accounting the demographic weight of people below 40, most people today only know Eric Roberts as the guy from that The Killers’ music video.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Cutebrute",
                                            "body": "He’s probably the mobster guy from The Dark Knight first and then as The Killers’ video guy. \n\nCan’t say I’ve seen him in much since. ",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "Illustrious-Stay968",
                                                    "body": "Mr. Brightside was 15 years ago, I know I am also having an existential crisis, so most young people on this site have no clue who Eric Roberts is.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "JCVideo",
                                            "body": "Time to dust off a box of Best of The Best vhs tapes and spread the gospel",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "katsujinken",
                                                    "body": "Love that movie",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "skillmau5",
                                    "body": "Eric Roberts is literally just top billed in a bunch of extremely shitty movies though, not because he is in one scene. I agree with your point but want to share the beauty of those films where he plays a murdering doctor, they are so fucking funny.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Positive_Position_48",
                                            "body": "He never has a haircut to suit the character, even though they would do it for him....for free. I think he just turns up on the day and is good to go.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Bartek-BB",
                                    "body": "Like this Skullface guy in 7Samurais with Keanu",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Isakmannen",
                                    "body": "Zendaya for Dune 1 comes to mind… she had like 2 min of screen time but almost all promo coverage",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "christopia86",
                                    "body": "Designed to trick older gentlemen into watching them.  I've heard them referred to as \"geezer teasers\".",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "f7f7z",
                                    "body": "The Party at Kitty and Stud's",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Maleficent-Walrus-28",
                                    "body": "Tom Hanks DnD movie is a prime example",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Prozenconns",
                                    "body": "Arnold Schwarzenegger appearing for like 90 seconds in the first Expendables and getting his name on all the marketting beside Stallone even though the stacked cast was like the entire point of that movie",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Cripnite",
                                    "body": "It Predators with Lawrence Fishburne who was in like 2 minutes of the movie.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "ghandi3737",
                                    "body": "Mila Kunis in Extract.\n\nAll the ads had her in them. Very short amount of time in the film.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "The_Flying_Jew",
                                    "body": "Like those VHS copies of the original Little Shop of Horrors from 1960, Starring Jack Nicholson, even though Nicholson is only in the movie for a brief scene",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "hellscompany",
                                    "body": "Those Planet Terror movies spoof this. Bruce Willis is never on screen with another actor. Maybe due to funding, but the way I understand it. The film was purposely edited this way, to give the low budget but one B-lister villain vibe, that so many crap horror movies have templated. Lot of little Easter eggs in those movies if you go looking",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "sanchower",
                                    "body": "Home Alone 3, Starring Scarlett Johansson",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "The-disgracist",
                                    "body": "Had an Indonesian friend that would come back with loads of dvds every time he went home. 90% of them had Tony jaa on the cover whether he was in the movie or not. He was in the cover of the copy of mystic river. Was very surprised Sean penn did no Muay Thai for the entire movie",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "ImitationButter",
                                    "body": "I thought Alec Baldwin was going to play a much larger part in Glengarry Glen Ross",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "JustMark99",
                                    "body": "Not direct to DVD, but they also do that with DVD releases of the original The Little Shop of Horrors.\n\nhttps://preview.redd.it/oamj7f8q1hpe1.jpeg?width=541&format=pjpg&auto=webp&s=618a4813c0dea9c4f67a6ce2ebb35be65440ee76",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Plank_With_A_Nail_In",
                                    "body": "Rupert has more screen time and lines than the Thunderpants, he's a significant character in the film, OP has no idea what they are talking about.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "livinglitch",
                                    "body": "Leprechaun 1, a horror movie, has Jennifer Anniston in it before she was famous. The company that sells the VHS and DVD copies of it went back to redo the covers just to show her on it.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "0ver9000Chainz",
                                    "body": "There was an obscure film with Zach Galifinakis that did the same exact thing",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "JaneksLittleBlackBox",
                                    "body": "Thank you for reminding me that the first movie I ever saw Joseph Gordon-Levitt, Matthew McConaughey, Adrian Brody, Dermot Mulroney *and* Neal McDonough in together was Angels in the Outfield. \n\nHadn’t seen that movie in like 18 years when my youngest nephew started watching it on streaming back around Christmas. I had so many, “Holy shit, how fucking *stacked* was this cast for 1994?” reactions. *So* fucking many future megastars in that cast about angels helping a professional baseball team cheat; it’s almost too ridiculous to be believable!",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Dronizian",
                                    "body": "Reminder that Mark Hamill did that for The Force Awakens. In one scene, got top billing.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Malabingo",
                                    "body": "The worst example is a movie with Jackie chans face on the cover, and he was just a background stunt double or something :-D",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "JemmaMimic",
                                    "body": "Apocalypse Now, starring Harrison Ford!",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "K_Linkmaster",
                                    "body": "You can totally leave Eric Robert's off that list. He knows exactly who he is and doesn't turn down roles often. He has been this way his whole career.\n\nThis happens a lot and I have watched a lot of really bad movies because of it.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Horbigast",
                                    "body": "Or Little Shop of Horrors (1960).  Any case I've seen it in has Jack Nicholson's face plastered on it, despite him being in the film for two minutes at best.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "xenelef290",
                                    "body": "People who worked on those movies Bruce Willis did just before he retired said that they would not have been made without him being involved.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "durrtyurr",
                                    "body": "Say what you will about Eric Robert's films, but he actually seems like he gives half a shit about the rolls he plays and he'll be in anything that pays $10,000 a day.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "meowzertrouser",
                                    "body": "Or drive away dolls. Featuring Matt Damon and Pedro Pascal, the latter of whom is killed within seconds of movie starting, and both collectively share about 5 minutes of screen time",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Dzharek",
                                    "body": "Or those old early Bud Spencer films that got new syncronisations.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "TheAnswerToYang",
                            "body": "Just got flashbacks to that one Godzilla movie during the Breaking Bad era where all the promotional stuff was Bryan Cranston, but he died in the first 10 minutes. The rest was generic dude actor.",
                            "score": 59,
                            "replies": [
                                {
                                    "author": "Illustrious-Stay968",
                                    "body": "I actually like that Godzilla movie.  Good monster fight at the end. Action was pretty solid throughout, only problem is they abused the fuck out of the \"monster is not in frame so no one else sees it\" mechanic.   Like when Godzilla arrives at the Hawaiian airport and the first thing people see is a wave wash up on the runway, and the camera pans over 5 feet and Godzilla is standing right there, but nobody noticed him walking up.... lol.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "Otiosei",
                                            "body": "The movie was rightfully criticized for not having enough monster action on screen. I like the whole \"monster is off screen\" thing--it's basically what the original Godzilla was like, but that was 70 years ago and every person going to a Godzilla movie already knows what the monster looks like.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Digit00l",
                                    "body": "Tbf, generic dude actor did try a career in action movies and the next year he died in an Avengers movie, playing brother to the actress who played his wife in Godzilla\n\nHe was also named as a possible James Bond actor for a while, and he did marry his groomer",
                                    "score": 25,
                                    "replies": [
                                        {
                                            "author": "clutchthepearls",
                                            "body": "He was also Kick-Ass",
                                            "score": 16,
                                            "replies": [
                                                {
                                                    "author": "PotatoGamerXxXx",
                                                    "body": "His best role imho",
                                                    "score": 8,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "animedeathspiral",
                                                    "body": "I can never remember his name, so I just call him Kick-ass",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "phdemented",
                                                            "body": "He's a \"that guy\"... will never remember his name...",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "ark_keeper",
                                            "body": "Aaron Taylor-Johnson?  From Bullet Train, Nosferatu, Tenet, and most recently Kraven?  I don't think he's \"trying\".",
                                            "score": 20,
                                            "replies": [
                                                {
                                                    "author": "HilariousMax",
                                                    "body": "I thought I must be going mad. He's not an unknown actor.",
                                                    "score": 13,
                                                    "replies": [
                                                        {
                                                            "author": "ark_keeper",
                                                            "body": "He's going to be the main guy in 28 Years Later too.",
                                                            "score": 7,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "moveslikejaguar",
                                                    "body": "He definitely tried it with his dead wife if you know what I mean",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Illustrious-Stay968",
                                                    "body": "I like Aaron, but when he hits 40, he wont be in any big movies anymore.  He'll be regulated to straight to video crap and other minor roles. \n\nSame with Glen Powell, he's trying really hard to become an A list star, but he's gonna fade away.   Hollywood is fucking brutal.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "ark_keeper",
                                                            "body": "I don't think Glen Powell is \"trying really hard\" to be anything, he's just getting roles after Top Gun blew up.  He'll be 37 when Running Man comes out in November, so I doubt much will change in the next few years.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "WarmAd7053",
                                            "body": "aaron taylor johnson is a horrible actor and he was so fucking bad in godzilla lol",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "OGPresidentDixon",
                                            "body": "You mean Kick Ass?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Digit00l",
                                                    "body": "In my defence, I haven't seen that movie",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "xanxas41",
                                    "body": "I was just about to comment that I also had that memory",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "regularhumanbartendr",
                                    "body": "Ryan Reynolds (before people started to dislike him) in the movie Life.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "icebeancone",
                                            "body": "Wait. People dislike Ryan Reynolds?",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Hold-My-Butterbeer",
                                    "body": "Same with Scream and Drew Barrymore.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Nrksbullet",
                                    "body": "He actually dies at the 45 minute mark, although it was disappointing.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "BurlyZulu",
                            "body": "Lmfao.",
                            "score": 198,
                            "replies": []
                        },
                        {
                            "author": "sandwichcandy",
                            "body": "He’s barely in the fucking thing. Getting this at blockbuster was the first time I felt cheated for the time I wasted.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "Funkycoldmedici",
                                    "body": "I have not seen it, but from my experience renting goofy-looking low-budget kid movies, I suspect you might have felt that way regardless.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "Shankman519",
                                    "body": "I mean I don’t wanna revisit it or anything but I remember his role being fairly substantial, like him and the other kid were co-leads",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "EuanThePooan",
                            "body": "The James Mcavoy in Dune effect ",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "WhoSc3w3dDaP00ch",
                            "body": "Milla Jovovich was prominently featured in promos for Dazed and Confused. She was in it for maybe 5 minutes?",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "Meme_Pope",
                                    "body": "Wild there was a time in our nation’s history where she was a big get",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "pbjcrazy",
                            "body": "Josh Herdman, who played Goyle, is also in the movie.  I just watched the trailer lol.  Its so bad i need to watch it.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Plank_With_A_Nail_In",
                            "body": "Harry Potter and the Philosopher's Stone: Released 4 November 2001\n\nThunderpants: 24 May 2002\n\nIt used this marketing from the start due to Rupert already being massively famous, the poster for the movie (you used one from the DVD) has Rupert bigger than Thunderpants too.\n\nhttps://upload.wikimedia.org/wikipedia/en/8/8c/Thunderpants.jpg\n\nThey may or may not have cast Rupert knowing he was playing a significant role in the Harry Potter films, I can't find any information on when filming started for it but I find it hard to believe they didn't know.\n\nRuperts character Alan A. Allen has more screen time and lines that Patrick Smash (thunderpants), while not the main character he very much is a main character. \n\nMovie was a box office failure.\n\nNearly 1 and a half thousand upvotes for a post that is factually incorrect well done reddit.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "GrapheneBreakthrough",
                                    "body": "👍 good stuff",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "TurboFool",
                            "body": "When I was 13 I had a lead role in a crappy, low-budget underdog basketball film with several Sandlot actors. It was garbage in every possible way, but someone had a friend of a friend connection to Beau Bridges, and during reshoots they got him to be in three films. Naturally the cover of the DVD was almost exclusively Beau Bridges.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "HilariousMax",
                            "body": "It worked, kinda. Without the advert campaign I wouldn't know this movie existed. I say \"kinda\" because I still haven't seen it and have no intention of watching it, but I know it exists.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "youlleatitandlikeit",
                            "body": "The probably used that photo since you can barely recognize it's Rupert Grint in the actual photo.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Pyorrhea",
                                    "body": "Filming for the Thunderpants movie was from April to June 2001, before the release of the first Harry Potter film in November. Basically right after the filming for Harry Potter ended in March 2001.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Kaellpae1",
                            "body": "Reminds me of Charlie Bartlett's marketing that made it seem that RDJ from Ironman was starring in the movie when he was in a supporting role.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Handleton",
                            "body": "If I had the rights to a movie with his name on it, you'd bet that I'd be selling the fuck out of it, too.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "DrHem",
                            "body": "This happened a lot with Jackie Chan when he became famous in the US and Europe. They would take old movies for the 70s where he was a minor character and in the movie for a scene and re-relese them with Jackie Chan on the cover as if the main character.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Lin900",
                    "body": "\"Featuring Dante from Devil May Cry\"",
                    "score": 206,
                    "replies": [
                        {
                            "author": "Digit00l",
                            "body": "Tbf, that was kinda a big deal, as DMC is owned by a completely different company as SMT, it was one of the first major video game crossovers between 2 of the main video game producing companies (Sega and Capcom), though apparently it was only the European release to do it",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "TobytheRam",
                                    "body": "Sega didn't own Atlus until 2013 though. It was just Atlus and Capcom collaborating.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Digit00l",
                                            "body": "My bad, still an unusual crossover event, in a time cross company crossovers weren't really a thing",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "CaioXG002",
                                    "body": "How did you manage to get the obscure old 2000's trivia right but somehow get wrong the companies involved?",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "OneWholeSoul",
                                    "body": "And the demon designer for SMT, Kaneko, did the Devil Trigger designs for Dante and Virgil around that time.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Ready_Philosopher717",
                    "body": "https://preview.redd.it/5i5unkna6gpe1.jpeg?width=1080&format=pjpg&auto=webp&s=9dd3d681cf31358ab7819091f314da4ee8eb9c00\n\nSame vibes",
                    "score": 97,
                    "replies": [
                        {
                            "author": "schoensmeerpijp",
                            "body": "This is hilarious",
                            "score": 30,
                            "replies": [
                                {
                                    "author": "GrinchStoleYourShit",
                                    "body": "Plenty of people WATCHED Shrek, only a great few SAW Shrek",
                                    "score": 19,
                                    "replies": []
                                },
                                {
                                    "author": "AgreeableSurround111",
                                    "body": "Oh I how I needed this laugh ❤️",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "HeronShot7019",
                                            "body": "Jolly and whimsical response ",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Minimum-Tear4609",
                            "body": "\"From the producers who saw Shrek.\"\n\nLmao! I want more taglines like this!\n\n\"From the director who had The Matrix playing in the background while making dinner.\"\n\n\"From the studio adjacent to the one that recorded Gone With The Wind.\"\n\n\"From the executives who had Labyrinth poorly explained to them.\"",
                            "score": 22,
                            "replies": [
                                {
                                    "author": "EnlightenedSinTryst",
                                    "body": "> \"From the executives who had Labyrinth poorly explained to them.\"\n\nI mean, who hasn’t?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Ready_Philosopher717",
                                            "body": "In fairness, Labyrinth can be a bit wild",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Intelligent_Oil4005",
                            "body": "From the producers who *saw* Shrek? Not even worked on the movie they just watched it?\n\nI mean, yeah, I'm sure most people who worked on animated movies have.",
                            "score": 34,
                            "replies": [
                                {
                                    "author": "Schnidler",
                                    "body": "That’s the joke ",
                                    "score": 10,
                                    "replies": []
                                },
                                {
                                    "author": "Ready_Philosopher717",
                                    "body": "Their eyes took in the frames from watching it and immediately knew what to do!",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "AgreeableSurround111",
                            "body": "Lmao thank you!",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "OneWholeSoul",
                            "body": "\"I've never watched the movie but I was once in the vicinity while it was playing.\"",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "migvelio",
                            "body": "Was the text AI generated? Oh wait, must be Norwegian.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Djamalfna",
                                    "body": "It's Spanish apparently, based on Don Quixote.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "WpgMBNews",
                                            "body": "The title being \"Donkey Xote\" is pretty clever",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "LooseSeal88",
                    "body": "It was straight to DVD in the US and that was how they marketed the DVD here, but I wouldn't say they \"marketed\" the movie here beyond \"Ron is on the DVD box art.\" It just showed up at Blockbuster one day.",
                    "score": 41,
                    "replies": []
                },
                {
                    "author": "rickyhatespeas",
                    "body": "Yeah, it worked on me as a kid in blockbuster but the movie sucks serious ass, even 7 year old me understood fully that I got swindled of my time.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "justafanboy1010",
                    "body": "Just like OP response, I bet it was",
                    "score": 17,
                    "replies": [
                        {
                            "author": "Vitolar8",
                            "body": "Despite? That's what they're saying.\n\nEdit: Ok screw you that edit is kinda funny.",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "Reason_Choice",
                                    "body": "Despite that being exactly what they’re saying, i bet it was.",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "creedokid",
                    "body": "There is zero chance they messed this up on accident",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "GwerigTheTroll",
                    "body": "Reminds me of the marketing for the Gnomemobile, which proudly advertises that it has the kids from Mary Poppins in it.\n\nhttps://preview.redd.it/06owqn2v5hpe1.jpeg?width=1403&format=pjpg&auto=webp&s=316b391d2d41859baeb8fed46d2d66936a6c0cca",
                    "score": 2,
                    "replies": [
                        {
                            "author": "BurlyZulu",
                            "body": "\"Those ‘Mary Poppins’ kids\" LMFAO 😂",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "JK-Kino",
                    "body": "Harry Potter and the Thundering Trousers",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "No-Comment-4619",
                    "body": "No, it also relied on farting.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "PauperJumpstart",
                    "body": "and its clearly still working...",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "madferret96",
                    "body": "More like his whole movie carrier Id say",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Kwumpo",
                    "body": "If I remember correctly, this was filmed before the first Harry Potter, so he wasn't known yet. The movie sat for a couple years because it's obviously terrible, then Harry Potter came out and they rushed out a release to capitalize on Grint's newfound fame.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Debalic",
                    "body": "Hell, the kid blasting off like like Dudley.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Puzzleheaded_Step468",
            "body": "Jurassic park, starring samuel l. Jackson from \"Pulp fiction\"",
            "score": 522,
            "replies": [
                {
                    "author": "Supro1560S",
                    "body": "Hold on to your butts!",
                    "score": 71,
                    "replies": [
                        {
                            "author": "Happy_Peak_7818",
                            "body": "\"We have all the problems of a major theme park and a major zoo and the computer's not even on its feet yet.\"- DOGE",
                            "score": 34,
                            "replies": [
                                {
                                    "author": "Supro1560S",
                                    "body": "I HAVE *HAD* IT WITH THESE MOTHERFUCKIN’ DINOSAURS ON THIS MOTHERFUCKIN’ ISLAND!",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "Mr-Sister-Fister21",
                                            "body": "Arnold: DOES. JOHN HAMMOND. LOOK LIKE A BITCH?!\n\nNedry: NO!!\n\nArnold: Then why you try to fuck him like one?! \n\nNedry: he didn't say the magic word!\n\nArnold: Yes he did, Ned! Yes he did!!",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Roflkopt3r",
                            "body": "\"But you know what's on my mind right now? It ain't the coffee in the gene lab. It's the dead Nigersaurus in my garage.\"",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "30FourThirty4",
                    "body": "Eventually Sam realized his middle name is actually Eye. Like Homer Jay Simpson",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "paparoach910",
                    "body": "Imagine the poster is just like Gone Fishin', but with Samuel L. Jackson and Wayne Knight, and a few dinosaurs in the back.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TacTurtle",
                    "body": "Starring Newman from Seinfeld!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "bbobeckyj",
                    "body": "Pulp Fiction trivia related to this post, they did the publicity photographs after shooting the film, Sam Jackson doesn't have the jheri curls hairstyle in them.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "jtomatzin",
                    "body": "Jurassic Park came out before Pulp Fiction",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Robcobes",
            "body": "This movie proves he was the best actor out of the 3 main characters from Harry Potter. Without Rupert, Thunderpants wouldn't be the cinematic masterpiece we all know and love.",
            "score": 1997,
            "replies": [
                {
                    "author": "EntertainmentDue5749",
                    "body": "What's up with Harry Potter stars and making movies about flatulence?",
                    "score": 339,
                    "replies": [
                        {
                            "author": "Aggressive-Owl2043",
                            "body": "Shit, sounds like a fun movie marathon.  So Thunderpants, Swiss Army Man.. does Emma Watson have a fart movie? We need to complete the trilogy",
                            "score": 145,
                            "replies": [
                                {
                                    "author": "IberionFarinha",
                                    "body": "There is one. The Beauty and the Beast.",
                                    "score": 170,
                                    "replies": [
                                        {
                                            "author": "a_professional_fuck",
                                            "body": "Booty and the Beans",
                                            "score": 90,
                                            "replies": [
                                                {
                                                    "author": "gene100001",
                                                    "body": "The original lyrics from Beauty and the Beast are oddly fitting:\n\nTale as old as time\n\nTrue as it can be\n\nBarely even friends\n\nThen somebody bends\n\nUnexpectedly",
                                                    "score": 26,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "TwoFartTooFurious",
                                                    "body": "😂👍🏻",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "OhImNevvverSarcastic",
                                            "body": "I can confirm that the experience of watching the live action beauty and the beast is on par with expelling a particularly angry fart.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "slammybe",
                                                    "body": "At least expelling a fart gives some relief afterwards",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "thefirecrest",
                                                    "body": "It wasn’t terrible. It just… Didn’t give anything. Also the auto tune was so obvious. Love Emma, but I wish they cast an actual musical theatre professional. There are *so many* talented brunettes in musical theatre!!",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "velcroaddict",
                                    "body": "we gotta convince her to make it happen",
                                    "score": 21,
                                    "replies": []
                                },
                                {
                                    "author": "ComradeJohnS",
                                    "body": "Does this is the end have a fart scene?",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Mr-Sister-Fister21",
                                            "body": "Well, there is a scene where something happens with that part of the body.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "flying87",
                                    "body": "Does \"This Is The End\" count ?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "hrf3420",
                            "body": "Lmao Swiss army man was absurd.",
                            "score": 65,
                            "replies": [
                                {
                                    "author": "nufcPLchamps27-28",
                                    "body": "You have to give it to Daniel for flicking through hundreds of scripts and managing to pick out the strangest ones.",
                                    "score": 49,
                                    "replies": [
                                        {
                                            "author": "propolizer",
                                            "body": "Don’t forget that one with his gun hands.",
                                            "score": 17,
                                            "replies": [
                                                {
                                                    "author": "CreepinJesusMalone",
                                                    "body": "Guns Akimbo. *Surprisingly* enjoyable movie lol. Like, I'm probably never going to watch it again, but I had zero expectations going in watching it on a whim and it was really a really fun surprise.",
                                                    "score": 20,
                                                    "replies": [
                                                        {
                                                            "author": "SolomonRex",
                                                            "body": "That movie lost me when they had a scene establishing that the kick-ass lady character was really good at killing people, but then she shows up to kill Radcliff and misses every shot.\n\nI understand \"plot armor\", but her inability to land an easier shot than what she just did in a previous scene really too me out of it and I didn't finish the movie.\nPerhaps if I gave it another shot (ha) I'd feel differently.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Draaly",
                                                    "body": "That movie was unironicly pretty solid",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "No-Good-One-Shoe",
                                            "body": "Him and Elijah Wood make some of the best bizarre movies. ",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "LickingSmegma",
                                                    "body": "Reminiscent of how Leonardo DiCaprio didn't receive an Oscar for 'Titanic', presumably because he was an obvious teenage heartthrob — so pretty soon he said 'fuck you' and started picking films like Woody Allen's 'Celebrity', 'Gangs of New York' and such.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "punkminkis",
                                                            "body": "Gangs of New York is one of my favorite movies with him",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "fhota1",
                                            "body": "Man likely has more money than he could ever need. May as well just do whatever seems interesting to you at that point.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Djamalfna",
                                            "body": "> Daniel \n\nDid they merge?",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "BigRhyme69",
                                                    "body": "They joined and became a gigadirector, once all other daniels in the world are assimilated they will reach their final form.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "apple_kicks",
                                    "body": "For a film about a farting corpse i still cried at the end",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "42Mavericks",
                                    "body": "That is a strange way to write masterpiece",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "HilariousMax",
                            "body": "bro, a movie with Emma Watson passing gas would do billions.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "JammieDodgers",
                            "body": "If I had a nickel for every time a child star from Harry Potter starred in a movie about somebody who farts so much they are used as a power source, I would have two nickels.\n\nWhich isn’t a lot, but it’s weird that it happened twice.",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "livinglitch",
                            "body": "They have enough money that they dont have to work any more so they choose to have fun with working.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "tantan35",
                            "body": "It’s called ‘fuck you’ money. Not ‘I’m gonna keep making safe movies’ money.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ComfyFrame2272",
                            "body": "It's all the hot gas they had to deal with by being around J. K. Terfling. 🤮",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LakeEarth",
                    "body": "It's actually a cute movie... a cute movie about kid who farts so much his father leaves his family. Yes that's a thing that happens.",
                    "score": 23,
                    "replies": [
                        {
                            "author": "ImpracticalApple",
                            "body": "Don't they try to execute him at one point?",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "CalculonsPride",
                    "body": "All jokes aside, he actually was quite fantastic in that Knock at the Cabin movie that came out a year or two back.",
                    "score": 18,
                    "replies": [
                        {
                            "author": "rinkydinkvaltruvien",
                            "body": "Thunderpants genuinely is great, though. Absolutely absurd and hilarious, but you can feel that it was made with love",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "HoneyBadgerC",
                    "body": "Nah Daniel is a fantastic actor but they never gave him much to do other than just stand there pointing a wand or trying to tell someone that Draco is a c***",
                    "score": 18,
                    "replies": [
                        {
                            "author": "FunkyHowler19",
                            "body": "\"Ok Dan, let's do the 'Expelliarmus' line again, but this time with more vigor\"",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "wonkey_monkey",
                                    "body": "I've said *Wingardium Leviosa* so many times the words have lost all meaning!",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "docsyzygy",
                                            "body": "Hey Monkey - happy happy Cake Day!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Flimsy-Shake7662",
                            "body": "I wish he is, but he isn't.\n\n\"he was their friend!\" \\*bares teeth\\*\n\nGrint is easily the best of that duo. Especially for a child actor",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "lydocia",
                    "body": "I genuinely loved him in Sick Note.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Brotonio",
            "body": "Even as a child I knew this movie would suck, but for a different reason.\n\nMy dumbass just thought \"Those idiots got the wrong kid, that's not Harry Potter.\"",
            "score": 1104,
            "replies": [
                {
                    "author": "schoensmeerpijp",
                    "body": "let's be fair, a whole movie centered around a kid's farts isn't exactly high kino either\n\nBut if it was the actual harry potter? Funniest shit ever.",
                    "score": 339,
                    "replies": [
                        {
                            "author": "StrongBad_IsMad",
                            "body": "And yet, Daniel Radcliffe did eventually star in a movie as a farting corpse so perhaps Thunderpants wasn’t so far off after all….",
                            "score": 161,
                            "replies": [
                                {
                                    "author": "IV-TheEmperor",
                                    "body": "WHERE IS EMMA WATSON'S PASSING GAS MOVIE? I NEED IT RIGHT NOW!!!",
                                    "score": 58,
                                    "replies": [
                                        {
                                            "author": "justafanboy1010",
                                            "body": "![gif](giphy|B7B53XRstgpE9f4gAm)",
                                            "score": 31,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": -7,
                                                    "replies": [
                                                        {
                                                            "author": "schoensmeerpijp",
                                                            "body": "What in the hell.",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "author": "MegaloblasticNamur",
                                                                    "body": "What did he say?…",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "schoensmeerpijp",
                                                                            "body": "A lot of creepy shit basically roleplaying someone smelling farts and making it sexual. It was a loooong message.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "MegaloblasticNamur",
                                                                                    "body": "[Was it this?](https://www.reddit.com/r/copypasta/s/qZsaIncFLS)",
                                                                                    "score": 4,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "schoensmeerpijp",
                                                                                            "body": "Yeah it was. Kinda bad under a post about a film where a child farts though...",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "author": "justafanboy1010",
                                                                                            "body": "yes! it was exactly that!🤣🤣",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "googlyeyes93",
                                                            "body": "https://preview.redd.it/td8a5nczygpe1.jpeg?width=1179&format=pjpg&auto=webp&s=059b6a9c710dbaa8d65ac9c884159c5833396091",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "HeemeyerDidNoWrong",
                            "body": "The actual Harry Potter is in the cinematic masterpiece Troll (1986). But Troll 2 is the real experience even if HP is not in it.",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "justafanboy1010",
                            "body": "I know for certain I would’ve watched it too",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "therealhlmencken",
                            "body": "Salo?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Lin900",
                    "body": "It's a decent kid movie. Or so I thought 15 years ago. I haven't seen it ever since.",
                    "score": 49,
                    "replies": [
                        {
                            "author": "LeagueOfLegendsAcc",
                            "body": "I know you said 15 years ago but you know how time goes, are you sure you meant 2010?",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "guilty_bystander",
                                    "body": "2010 was 5 years ago",
                                    "score": 26,
                                    "replies": [
                                        {
                                            "author": "Lin900",
                                            "body": "And Thunderpants was released last year",
                                            "score": 9,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "MilkTrvckJustArr1ve",
                            "body": "Paul Giamatti called this movie one of the high parts of his career, so that's... something",
                            "score": 10,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "litboyfrommalaysia",
                    "body": "If it's any consolation Daniel Radcliffe took up a very similar role as a corpse of a soldier who farts out his built up corpse gases to propel himself across water",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "Lord_Phoenix95",
                    "body": "I remember seeing this movie and I think I watched it 3 times. Was a funny movie cause farts.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "MiddleofCalibrations",
                    "body": "It’s actually not a bad movie. It’s ludicrous but a lot of effort was put into it",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Brilliant_Towel2727",
            "body": "This movie also featured Paul Giamatti, Keira Knightley, and Stephen Fry, and somehow got a 67% rating on Rotten Tomatoes.",
            "score": 272,
            "replies": [
                {
                    "author": "thepoopnapper",
                    "body": "Also Oscar nominee Ned Beatty",
                    "score": 38,
                    "replies": [
                        {
                            "author": "jimmyhoffasbrother",
                            "body": "Yup, the cast of this film collectively has 5 Oscar nominations between them.",
                            "score": 38,
                            "replies": [
                                {
                                    "author": "99999999999999999989",
                                    "body": "????????????????\n   \nWHY????????????\n  \nThis is a 100% serious question.\n  \nNed Beatty, Paul Giamati, Rupert Grint, Keira Knightley, and Stephen Fry.  In a kid's movie about saving the world by farting.\n  \nIf I were an actor, I would immediately fire any agent that suggested reading for this.  Grint hit the Life Lottery head on with Harry Potter.  He was swimming in cash at this point.  Why the FUCK would he agree to be in this obvious shit movie?  Why the FUCK would any of those actors agree to it?  Honeslty WHY would anyone even consider making such a dumb sounding movie?",
                                    "score": 21,
                                    "replies": [
                                        {
                                            "author": "FUPAMaster420",
                                            "body": "Money, in some way, is the answer",
                                            "score": 14,
                                            "replies": [
                                                {
                                                    "author": "99999999999999999989",
                                                    "body": "Yeah, obviously.  I guess my question is how the fuck were any of those actors hurting for it?  I suppose one might excuse older actors.  I have no idea how they handled their finances over the years.  They could have pissed it away and need to pay the mortgage I suppose.\n  \nBut...Grint?  Seriously?  His initial earnings were a million dollars, BUT he also took a percentage of the movie's profits.  How the hell does going from the single largest modern time kid's movie series to playing a supporting role in some obvious shlock garbage about farting?  His parents must have been wading in media offers of all types after HP was released.  And somehow this was the best one?  After taking in literally a million dollars plus box office percentage?\n  \nOne could argue that they might have considered the potential for boosting his image seeing as how he was the...<ahem>...red headed stepchild of the HP crowd.  But holy hell.  If you want to boost a star's potential, putting them in a fart movie just doesn't seem like the best move.\n  \n*Hey, today on 'Stars Are More Important Than You' we're talking with Rupert Grint whom we all know played Ron Weasley in Harry Potter!  Hi, Rupert and welcome to the show.*\n  \n*Hi, its great to be here.*\n  \n*So Rupert, now that you've played a major role in a global box office smash, what could be next for you?  An action thriller?  Broadway?  A sequel?  Music perhaps?*\n  \n*Well funny you should ask because I've just signed on for Thunderpants.*\n  \n*...and that is...*\n  \n*A movie where I play a side character (again) in which the main actor saves the world by farting.*\n  \n...\n  \n...\n  \n*Annnnnnnnd...we'll be back after these messages!*",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "EllieIsDone",
                                                            "body": "I like to think that he chose to do it because he was a kid and found the concept hilarious.",
                                                            "score": 7,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "ChunkyLaFunga",
                                                            "body": "Why does *anyone* with a comfortable income and retirement fund continue to earn or risk even more money?\n\nJust the human condition bro. Too much and never enough.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "TempestRave",
                                            "body": "The priorities of 10 year old Rupert Grint clearly aren't aligned with yours.",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "99999999999999999989",
                                                    "body": "YEAH!",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "jimmyhoffasbrother",
                                            "body": "It's actually a pretty fun absurd kids' movie once you get past the insane premise. It's not high art or anything (obviously), but it's funny and cute and has a nice message. It was also written and directed by Peter Hewitt, who had had some success prior to this movie with films like Bill & Ted's Bogus Journey, Tom & Huck, and The Borrowers.\n\nI can see why an actor wanting to take a break from serious projects would find it interesting.\n\nPaul Giamatti continues to rave about it to this day.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Spastic__Colon",
                                            "body": "He wasn’t swimming in cash lmao he was one movie deep",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "99999999999999999989",
                                                    "body": "> swimming in cash\n\nA one million dollar plus royalties payday seems like a large swimming pool to me.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "shirpaderp",
                                            "body": "Thunderpants came out about a year before the first HP movie, he wasn't swimming in cash at the point he took that. They just swapped the advertising up to promote him more after he became well known for HP",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Tony_Lacorona",
                    "body": "Paul Giamatti was cooking with those bad kids movies in this era (big fat liar anyone?)",
                    "score": 80,
                    "replies": [
                        {
                            "author": "LooseSeal88",
                            "body": "Neither Big Fat Liar nor Thunderpants is a bad movie, sir.\n(This is not sarcasm, they're both great)",
                            "score": 41,
                            "replies": [
                                {
                                    "author": "Hungry_Woodpecker_60",
                                    "body": "I remember Red Letter Media watched it on Best of the Worst and disqualified it for being too good.",
                                    "score": 28,
                                    "replies": []
                                },
                                {
                                    "author": "Lord_Phoenix95",
                                    "body": "Big Fat Liar was a solid story.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "Mr-Sister-Fister21",
                                            "body": "Frankie Muniz, Amanda Bynes, and Donald Faison were great, but Paul just takes it to another level.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "HCOONa",
                                    "body": "but they both had bad kids",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "GrapheneBreakthrough",
                                    "body": "> those bad kids movies\n\nmy brain read that as 'movies about bad kids' (like for example- dennis the menace)",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "LooseSeal88",
                                            "body": "Such a bad kid making Christopher Lloyd eat the beans",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Lucifur142",
                                    "body": "Hi Boss? Ya lowest common denominator? Yup I found them!",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Kaboose666",
                            "body": "Giamatti also considers this film to be one of his career highlights.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "jorgespinosa",
                            "body": "What are your talking about? Big fat liar is a masterpiece",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AnduwinHS",
                    "body": "It's a good children's film, watched it multiple times as a child",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Nathan-Cola",
                    "body": "This movie does not have Keira Knightley\nEdit: Omg it does, as a very small uncredited role lmao",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "WJMazepas",
                    "body": "Everyone starts somewhere",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "PM_me_ur_claims",
                    "body": "Just goes to show",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "djturdbeast",
            "body": "He looks like Kate McKninnon",
            "score": 109,
            "replies": [
                {
                    "author": "schoensmeerpijp",
                    "body": "I will never unsee this",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "HeemeyerDidNoWrong",
                    "body": "Richard Ayoade",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "daturavines",
                    "body": "Sydney Sweeney",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "CutlerAF",
            "body": "If I'm going to watch fart kino with an actor from Harry Potter it's going to be Swiss Army Man.",
            "score": 44,
            "replies": [
                {
                    "author": "writers_block",
                    "body": "If I had a nickel for every time...",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "EnlightenedSinTryst",
                    "body": "r/brandnewsentence",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Latro2020",
            "body": "Ron doing his best Doctor Who cosplay",
            "score": 19,
            "replies": [
                {
                    "author": "JakeArrietaGrande",
                    "body": "I thought this was just how British people looked",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "SuspectKnown9655",
            "body": "He kinda carries that movie ngl",
            "score": 36,
            "replies": []
        },
        {
            "author": "Normal-Pie7610",
            "body": "Back in 2002 I was still researching stuff for school at the library because it was faster than asking Jeeves",
            "score": 16,
            "replies": []
        },
        {
            "author": "RealmJumper15",
            "body": "The most hilarious part about the marketing is that it would give you the impression that Rupert Grint played the main character but not only was that not the case he doesn’t even look like how he does on the poster.\n\nEdit: I feel like you guys are missing the point that I’m reiterating the same information in the post intentionally. It’s a shitty details sub.",
            "score": 134,
            "replies": [
                {
                    "author": "NachoChedda24",
                    "body": ">> he doesn’t even look like how he does on the poster.\n\nIsn’t that the whole point of this post?",
                    "score": 69,
                    "replies": [
                        {
                            "author": "DLottchula",
                            "body": "I love the internet",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "JakeArrietaGrande",
                                    "body": "I kinda hate it",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "pussy_embargo",
                            "body": "Yes. But we're dealing with redditors here. Somehow even this went beyond their notice",
                            "score": 17,
                            "replies": []
                        },
                        {
                            "author": "alphazero925",
                            "body": "No, the point of the post is that he doesn't even look like how he does on the poster while the point of that comment is that he doesn't even look like how he does on the poster",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Jackal_6",
                    "body": "The most informative part about your post is that it explains how the marketing would give you the impression that Rupert Grint played the main character but not only was that not the case he doesn’t even look like how he does on the poster.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "nomoreteathx",
                            "body": "I appreciate that OP took the time to explain how the marketing would give you the impression that Rupert Grint played the main character but not only was that not the case he doesn’t even look like how he does on the poster.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "OneWholeSoul",
                    "body": "It's so blatant when you realize that they would have had to specifically set up, like, makeup, wardrobe and a photo shoot just to get images of him looking like Ron in a suit so that they could market   on the mislead more effectively.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "GrouchyAppointment70",
                    "body": "I might have missed the point because I didn't get it and your post was genuinely helpful lol.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Eheheehhheeehh",
                    "body": "\\> Edit: I feel like you guys are missing the point that I’m reiterating the same information in the post intentionally. It’s a shitty details sub.\n\nit was missing a punchline or something.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AugustusCheeser",
            "body": "This has the distinction of being the best actual film ever watched on Best of the Worst. And I don’t mean Miami Connection best…they thought this was an actual quality film and it’s well made.",
            "score": 11,
            "replies": []
        },
        {
            "author": "j3tt",
            "body": "no i think they did that on person they wanted him to look as much like he did in Harry Potter",
            "score": 7,
            "replies": [
                {
                    "author": "greg19735",
                    "body": "Also, how would they google him for thr movie when they're the one making the marketing materials.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "stuck_in_the_desert",
                    "body": "It certainly explains why he’s wearing the exact same clothes as the character shot",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "veiligheidsspeld",
            "body": "Still waiting for thunderpants 2: electric boogaloo",
            "score": 10,
            "replies": [
                {
                    "author": "spongepipeshortdong",
                    "body": "Good one.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "nymphymixtwo",
                    "body": "This was so fucking stupid I couldn’t help the audible laugh that busted out of me. Yall have no idea how badly I needed these laughs, too having just got out the hospital",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "froggison",
            "body": "Tbf, in 2002, it would've taken about ten minutes to download that image. And that's only if your mom didn't receive a phone call halfway through.",
            "score": 5,
            "replies": []
        },
        {
            "author": "SuperMouthyDave",
            "body": "I can never escape this movie since learning of its existence",
            "score": 4,
            "replies": []
        },
        {
            "author": "TheBlitzkid46",
            "body": "He looks exactly like Stuey Gluck from Freaked (1993)\n\nhttps://preview.redd.it/37zparjn4gpe1.jpeg?width=600&format=pjpg&auto=webp&s=13e0c55311cc4bfaddc57dea6bd2ed202d3cda00",
            "score": 4,
            "replies": [
                {
                    "author": "Benn578",
                    "body": "First thing that came to mind for me also",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MrDrPrNyanPhD",
            "body": "To, too, and two. Learn the difference, people.",
            "score": 3,
            "replies": []
        },
        {
            "author": "previously_on_earth",
            "body": "Great film",
            "score": 7,
            "replies": []
        },
        {
            "author": "duckchukowski",
            "body": "thunder thunder thunder thunder PANTS (brrrrraaaaaaaapppppp)",
            "score": 3,
            "replies": []
        },
        {
            "author": "kapn_morgan",
            "body": "now that is shitty",
            "score": 3,
            "replies": []
        },
        {
            "author": "LilMissBarbie",
            "body": "Schoensmeerpijp\n\nWat de neuk is a Shoe polish pipe??",
            "score": 3,
            "replies": [
                {
                    "author": "veiligheidsspeld",
                    "body": "Een pijp om overig schoensmeer te verwijderen na het poetsen van je schoenen, Dit weet toch iedereen?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lord_Phoenix95",
            "body": "It's funny to think that Daniel Radcliffe did a similar role to the Thunderpants Kid.",
            "score": 3,
            "replies": []
        },
        {
            "author": "YangusMVP",
            "body": "It's the \"Featuring Dante from the Devil May Cry series\" of movies.",
            "score": 3,
            "replies": []
        },
        {
            "author": "BdsmBartender",
            "body": "This movie still got rented twice a month up until at least 2012 at everu blockbuster in the country. Its fart joke the movie.",
            "score": 3,
            "replies": []
        },
        {
            "author": "NuAngel",
            "body": "Well, since they pivoted the marketing to \"that kid from the Harry Potter movies!\" you want the version on the poster to be recognizable!\n\nBut more importantly: this post title makes no sense. How you gonna Google the character and find a photo when the movie isn't even out yet? You're making the movie poster. Google has no results for \"[Alan A. Allen](https://www.imdb.com/title/tt0283054/characters/nm0342488/?ref_=tt_cst_c_7)\" yet!",
            "score": 4,
            "replies": [
                {
                    "author": "VeryVeryVorch",
                    "body": "and google wasn't as prevalent in 2002.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "NahYoureWrongBro",
                    "body": "Ask Jeeves",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "schoensmeerpijp",
                    "body": "you see: that is part of the joke.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "NahYoureWrongBro",
                            "body": "Post hoc rationalization",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Facu_Baliza",
            "body": "It's funny but think of it as a marketing exec, who fucking cares who's the character in this stupid movie? We have to pump the marketing with the kid from Harry Potter, use the pic where we see his face, not the one with the dumb glasses",
            "score": 2,
            "replies": []
        },
        {
            "author": "whiterunguard420",
            "body": "Expensive patrolium!",
            "score": 2,
            "replies": []
        },
        {
            "author": "MindControlExpert",
            "body": "Those who smelt it is who dealt it. This gives both of them plausible deniability.",
            "score": 2,
            "replies": []
        },
        {
            "author": "pressurepoint13",
            "body": "Back when google was the shit. \n\nNow it’s just shit. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "kkwa2",
            "body": "Elegantly done lmao",
            "score": 2,
            "replies": []
        },
        {
            "author": "BioTools",
            "body": "Too lazy to google, back in 2002.",
            "score": 2,
            "replies": []
        },
        {
            "author": "dmc2008",
            "body": "Back then they would've been too lazy to look it up on Yahoo",
            "score": 2,
            "replies": []
        },
        {
            "author": "Bandrbell",
            "body": "If I was the poster designer for \"Thunderpants\" I wouldn't give a shit either tbh",
            "score": 2,
            "replies": [
                {
                    "author": "schoensmeerpijp",
                    "body": "Just a fart?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mufti_Menk",
            "body": "You can tell this post was made by a teenager because they think googling was a common thing in 2001",
            "score": 2,
            "replies": [
                {
                    "author": "schoensmeerpijp",
                    "body": "That was part of the joke. Why would the designer google their own character? \n\nSincerely, a 27 year old.\n\nHappy cake day though!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "joined_under_duress",
            "body": "Reminds me of this DVD cover they made for this *1985* movie, where it seems like they mocked up the cover using much more recent photos of Helen Hunt and SJP (I'm pretty sure Hunt's role isn't main in it either but here she is joint top billing).\n\nhttps://preview.redd.it/qzrqag7ragpe1.png?width=1864&format=png&auto=webp&s=2f62a2b02ecadf7b81d68be957c22dfbe394486c",
            "score": 2,
            "replies": []
        },
        {
            "author": "Lunaborne",
            "body": "Reminds me of how Jack Nicholson had a minor role in the original Little Shop Of Horrors before he was a big name. And now he's probably the most well known actor in the film.",
            "score": 2,
            "replies": []
        },
        {
            "author": "theodo",
            "body": "It looks like the kid is farting on an \"in memorium\" picture of Grint",
            "score": 2,
            "replies": []
        },
        {
            "author": "ColdMeatStick",
            "body": "I assume my comment will be lost, but this reminds me of an ancient (web?) series I saw 20 years ago: [Laser Fart](https://www.imdb.com/title/tt0478870/)",
            "score": 2,
            "replies": [
                {
                    "author": "schoensmeerpijp",
                    "body": "This was made by Dan Harmon what the hell?!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ColdMeatStick",
                            "body": "I actually had the same reaction when I was looking it up!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "LadyJane17",
            "body": "My brother loves this movie for some reason and ordered the movie poster, which he than gave me to me. Why?! Because he's a 50 year old man who loves fart humour and thinks this is top tier entertainment.",
            "score": 2,
            "replies": []
        },
        {
            "author": "__Joevahkiin__",
            "body": "It always pleased me that the pun in the title works the same way in both my main languages. In Dutch, it's \"Donderbroek\", 'donder' meaning 'thunder', 'broek' meaning 'pants' and 'onderbroek' meaning 'underpants'.",
            "score": 2,
            "replies": [
                {
                    "author": "schoensmeerpijp",
                    "body": "Holy shit gast, hoe heb ik dit niet eerder doorgehad....",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "harpoonGat",
            "body": "Not sure if it's been said yet or not, but the trailer for Up in the Air, starring George Clooney, heavily featured Zach Galifianakis because this was right around the same time as The Hangover. It's really implied he has a major part in the movie, and he's basically in one scene.\n\n\nIt's weird too because even outside of Clooney, it had a pretty big cast, and the movie was very well received. Not sure why they tried to sell Zach so hard",
            "score": 2,
            "replies": []
        },
        {
            "author": "Chummers5",
            "body": "The budget was really low so they couldn't afford the 15 minutes to research the correct picture.",
            "score": 3,
            "replies": [
                {
                    "author": "ihaveacrushonmercy",
                    "body": "I think everyone is missing the point here. I bet the studio deliberately chose that picture because it looked like the character from Harry Potter to sell more tickets/videos.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "resisting_a_rest",
                            "body": "It says “Harry Potter” right in the cover!  With certain words in red so they blend in to the background and make it look like Harry is actually in the movie.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Funk5oulBrother",
                    "body": "Misread picture as posture, and thought you held credentials in correct farting procedure.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "pooeygoo",
            "body": "How could they Google something that hadn't been made yet?",
            "score": 2,
            "replies": []
        },
        {
            "author": "TheJasonaut",
            "body": "So you’re saying the studio that made the movie, their marketing/media team, in 2002, would somehow need to “Google” what the character looked like…from the movie they just made. This also assumes they somehow did this in ERROR and not on purpose, which it seems very likely they intentionally used a more Harry Potter-recognizable.",
            "score": 2,
            "replies": [
                {
                    "author": "schoensmeerpijp",
                    "body": "I suggest looking what sub this is",
                    "score": 1,
                    "replies": [
                        {
                            "author": "That_Calligrapher341",
                            "body": "I was also wondering if you were referring to a streaming service making the thumbnail. \nThanks for clarifying",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "faajzor",
            "body": "Google? more like Yahoo or your country’s local search engine (cadê in Brazil). good times",
            "score": 1,
            "replies": []
        },
        {
            "author": "Crazyripps",
            "body": "I saw this in theaters!",
            "score": 1,
            "replies": []
        },
        {
            "author": "cheepypeepy",
            "body": "I think it’s pronounced “Grimpert”",
            "score": 1,
            "replies": []
        },
        {
            "author": "propolizer",
            "body": "That’s some great hair, ngl.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FirstNameAsALast",
            "body": "r/shittymovie",
            "score": 1,
            "replies": []
        },
        {
            "author": "Stevie_Steve-O",
            "body": "Windfartium legliftgosah",
            "score": 1,
            "replies": []
        },
        {
            "author": "ciano",
            "body": "No they photoshopped a bow tie onto his old headshot because he looked more like Ron Weasley in that picture.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Either_Vermicelli805",
            "body": "Wow, what a blast from the past",
            "score": 1,
            "replies": []
        },
        {
            "author": "StillReading28",
            "body": "Lol, his character is still on the cover, so that was definitely just advertising",
            "score": 1,
            "replies": []
        },
        {
            "author": "FamousFangs",
            "body": "In 2002 Google was still kinda new yet. Other search engines were still in the game. I think that was right around the time Google turned down Yahoo's offer to buy  them.\n\nGoogle image search certainly didn't exist. \n\nI love it when kids complain, but yeah... someone STILL sucked at their job.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Curri189",
            "body": "\"It was the greatest day of my life...\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "VillagerJeff",
            "body": "When this movie came out, Google Images wasn't even a year old and was much more rudimentary. There's a decent chance this was the only picture they could find",
            "score": 1,
            "replies": []
        },
        {
            "author": "FunZ23",
            "body": "I don't think google was mainstream in 2002 like you think it was.   Internet was a different landscape back then.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MercyfulJudas",
            "body": "Why would they have to Google it? Don't they all work together? \"Hey put Gint on the poster.\" \"Okay. Can you get Debra from Art Production to send me over a photo to use?\" \"Just Google it.\"\n\nRight.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WeirdMerc",
            "body": "They did the same thing with Nic cage on the dvd cover of Deadfall.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sleddoggamer",
            "body": "Y'all had Google back in 2002?",
            "score": 1,
            "replies": []
        },
        {
            "author": "A_Heckin_Squirrel",
            "body": "Jesus christ",
            "score": 1,
            "replies": []
        },
        {
            "author": "despotidolatry",
            "body": "This movie is marketed as the “kid from Harry Potter” but they pulled Paul Giamatti for this. I know this was during his down period, between Man on the Moon and American Splendor, but still.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Plagueofzombies",
            "body": "He's also barley in the movie! He's in the first 20 minutes or so, then dissappears until one of the last scenes",
            "score": 1,
            "replies": []
        },
        {
            "author": "kh_ram",
            "body": "Why did Rupert Grint fall off so much. Out of those 3 actors at the time the one that I could see having real start potential was Grint, but he seems to have been the least active out of them in the end.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GlumCamp",
            "body": "I don’t think it was laziness. Whatever picture looked closest to Ron, They were going to smack on the cover.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Neighborhood8714",
            "body": "Here’s a probably fun fact\n\nGoogle Image wasn’t widely available when this film was in production. It was launched just before theatrical release and Google was still indexing images to their platform.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThirtySecondStorys",
            "body": "Happy to see that Rob Pattinson & Dan Radcliffe aren’t the only Harry Potter stars out there pursuing passion projects.",
            "score": 1,
            "replies": []
        },
        {
            "author": "uranthus",
            "body": "Ah this movie was my childhood. I’m a little hesitant to ever rewatch it because I think i might cringe way too much.",
            "score": 1,
            "replies": []
        },
        {
            "author": "danondorfcampbell",
            "body": "Wait, how were they supposed to \"google\" what his character looked like for the movie that wasn't out yet?",
            "score": 1,
            "replies": []
        },
        {
            "author": "chichiryuutei56",
            "body": "I’ve said it before and I’ll say it again — This movie is a fantastic showcase of The Hero’s Journey in a way that can speak directly to kids. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Longjumping-Tale-352",
            "body": "Nah they didn’t use the wrong picture, they absolutely used that on purpose cause he looks more like Ron there and people know him as that, probably thought they wouldn’t realise it’s him in his character",
            "score": 1,
            "replies": []
        },
        {
            "author": "natedogg1271",
            "body": "How did this get made did an episode on this movie lol.",
            "score": 1,
            "replies": [
                {
                    "author": "Wouldyoulistenmoe",
                    "body": "It was a great episode! Almost made me want to watch this movie haha",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "SubstantialRemote724",
            "body": "Lmao, was google searching even common back then? I don't think so.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ionic_Noodle",
            "body": "I think it was intentional.",
            "score": 1,
            "replies": []
        },
        {
            "author": "akarenger",
            "body": "You're a wifart, Ron",
            "score": 1,
            "replies": []
        },
        {
            "author": "chilseaj88",
            "body": "lol everyone was too lazy to Google anything in 2002. Took too damn long to connect to the dial-up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Eshneh",
            "body": "I've legit watched this film over 50 times, as a Kid I had a portable DVD player with some films burned onto a CD and would just watch them on repeat while falling asleep",
            "score": 1,
            "replies": []
        },
        {
            "author": "Spastic__Colon",
            "body": "Nah they were capitalizing on his Harry Potter casting",
            "score": 1,
            "replies": []
        },
        {
            "author": "SenorSnout",
            "body": "I like to think Thunderpants takes place in the Harry Potter universe and the main kid is just a weird type of wizard, and no one can convince me otherwise.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TarkovskyAteABird",
            "body": "Doubt they knew what google was",
            "score": 1,
            "replies": []
        },
        {
            "author": "fuzzywu61",
            "body": "I always thought this movie was a fever dream",
            "score": 1,
            "replies": []
        },
        {
            "author": "Starbucks__Lovers",
            "body": "They were going to kill the main kid by firing squad because he murdered his bully with his farts",
            "score": 1,
            "replies": []
        },
        {
            "author": "jeonteskar",
            "body": "He looks like Richard Ayoade's long lost son.\n\n![gif](giphy|zyclIRxMwlY40)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Organic_Meat_6030",
            "body": "Back then science was real crude. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "StrategyCheap1698",
            "body": "Yeah, they did that because they were \"lazy\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "FearlessFreak69",
            "body": "His name is Rupert Grimpert.",
            "score": 1,
            "replies": []
        },
        {
            "author": "myusernameisalsoapun",
            "body": "Google says that in 2002 it was the 3rd most popular search engine. Yahoo was 2nd. Explorer was 1st. \n\nI'm pretty old and this seems correct.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Feeling-Ad-3104",
            "body": "I remember this movie, good times",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok-Teaching363",
            "body": "I used to watch this movie on repeat as a kid. Not even kidding. Cinematography was on point.",
            "score": 1,
            "replies": []
        },
        {
            "author": "blackberu",
            "body": "I’m not sure Google allowed to look for pictures in 2002.",
            "score": 1,
            "replies": []
        },
        {
            "author": "crabcord",
            "body": "Google? I don't think Google had an image search back then.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Vladmerius",
            "body": "I think that's him in the bottom left so they put that big head shot of him at the top to make sure people at the $5 dvd bin at Walmart knew it was him. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "THCv3",
            "body": "Is this British comedy?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tubagal2022",
            "body": "god that movie was a fucking fever dream",
            "score": 1,
            "replies": []
        },
        {
            "author": "Shliggie",
            "body": "And you're too lazy to spellcheck ooooooo...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Overall_Raccoon_8295",
            "body": "Nah fam I’d be asking Jeeves",
            "score": 1,
            "replies": []
        },
        {
            "author": "GrimMilkMan",
            "body": "This movie brought up some memories I didn't know I had.",
            "score": 1,
            "replies": []
        },
        {
            "author": "veganstraycat",
            "body": "I loved this movie as a kid. It's so bad hahaha",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sweet_Cell3520",
            "body": "Arnold got duped into doing Red Sonja the same way. They told him he would be a cameo and then they edited and advertised the entire movie around him, making it look like a Conan sequel.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrWright62",
            "body": "Now I need Kate McKinnon to cosplay as him lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fhugem",
            "body": "It's wild how they marketed it, banking on Grint's fame while he barely shows up. Classic case of misleading advertising.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheSystem08",
            "body": "Bro, 2002.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None_too_Soft",
            "body": "2002? Lol do you mean ask Jeeves? Or maybe lycos?",
            "score": 1,
            "replies": []
        },
        {
            "author": "doctorduck3000",
            "body": "I have a poster for this movie",
            "score": 1,
            "replies": []
        },
        {
            "author": "fnaaaaar",
            "body": "Aren't they just ripping off Jonny Fartpants from Viz?",
            "score": 1,
            "replies": []
        },
        {
            "author": "RealLightDot",
            "body": "They used this photo on purpose so people would recognize him.  \n  \nThinking \"they used the wrong photo for Rupert Grint's character because they were too lazy too google what his character looked like\" is just a tiny bit too naive, IMHO.",
            "score": -2,
            "replies": [
                {
                    "author": "regularhumanbartendr",
                    "body": "Do you know what sub you're on, son?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "RealLightDot",
                            "body": "RMS Titanic?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Starbucks__Lovers",
                    "body": "/r/lostredditors",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}