{
    "title": "Am I bugging?",
    "author": "mochimochi12",
    "subreddit": "badroommates",
    "rank": 7,
    "score": 139,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 38,
    "url": "https://www.reddit.com/r/badroommates/comments/1jdkw2x/am_i_bugging/",
    "id": "1jdkw2x",
    "selftext": "My roomate wakes up at 4am and sits in the bathroom watching cartoons until 6am every single morning. If either me or my wife is in there at that time she says she has to shit  and rushes us out.  I would mind it less if she washed her hands and didnt leave the toilet smelling straight up like rotting flesh.  Additionally if we wake up and need to use the bathroom early in the morning and she is in there, she will leave the bathroom and sit outside watching cartoons loudly on her phone until we get out so she can go back in.  AM I BEING WEIRD ABOUT THIS? This bugs the hell out of me!",
    "comments": [
        {
            "author": "lyingdogfacepony66",
            "body": "Yeah, that's f-d up. She ain't right",
            "score": 88,
            "replies": []
        },
        {
            "author": "xombae",
            "body": "I had a roommate that I needed to put a limit on the bathroom, no being in there for an hour at a time. They would be in there for like an hour and a half. It's a 4 bedroom house with one bathroom. Then she would spend an hour, to the minute, in the bathroom, go sit in her room for ten minutes, and then go back into the bathroom for an hour. When she got out there would be an inch of water on the floor and sink counter. Fucking infuriating.",
            "score": 58,
            "replies": [
                {
                    "author": "Kaiju-daddy",
                    "body": "What was she doing in there",
                    "score": 16,
                    "replies": [
                        {
                            "author": "Adventurous_Ad_6546",
                            "body": "Water aerobics, apparently.",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "Stop__Being__Poor",
                                    "body": "Water aerobics, *obviously*. \n\nFIFY",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Adventurous_Ad_6546",
                                            "body": "I do feel a little silly now. Because duh.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "xombae",
                            "body": "I honestly wish I knew. It certainly wasn't using the toilet because she left a bucket of *piss and toilet paper* in her room when she left.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "mochimochi12",
            "body": "To add a layer to this. She brings a glass of water with her to drink on the toilet.  And then leaves it in the bathroom .  And if we dont leave the bathroom the moment she knocks she will take one of our cups and piss in it. (She has her own cups but chose to use ours)",
            "score": 24,
            "replies": [
                {
                    "author": "sam8988378",
                    "body": "Pour it on her bed, but tell her in advance that if she uses your cups, you're going to do this. You all pay the same rent. She doesn't pay extra to hog the bathroom.",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "Longjumping_Scale721",
                    "body": "Wut",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Adventurous_Ad_6546",
                    "body": "🤢",
                    "score": 5,
                    "replies": [
                        {
                            "author": "No_Appointment_7232",
                            "body": "Literally!\n\nI'm a human who loves a lot & read in the 'loo.\n\nBut not when my habits mean others can't use it as needed.\n\nThis is not standard roommate behavior. \n\nLet her know it stops now.\n\nShe can use scheduled time in 15 minute timeblocks.\n\nNo kitchenware in the 'loo.\n\nNo missing in your cups.\n\nBuy her a giant plastic cup from the dollar store. \n\nFFS, this is just too much weird.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Abject_Director7626",
            "body": "Turn off the WiFi as soon as she goes into the bathroom. She won’t be spending forever in there without it.",
            "score": 18,
            "replies": [
                {
                    "author": "parmesann",
                    "body": "no, no, then she'll just automatically switch to data on her phone. you have to set up a QoS page to specifically throttle the internet speeds for her devices so her phone stays connected to the wifi but can't load anything.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Fine_Position5063",
                            "body": "How does one accomplish such a task. Asking for a friend.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "sam8988378",
                                    "body": "Google it. The web is full of helpful people",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "devandroid99",
                                            "body": "But not you, apparently.",
                                            "score": -6,
                                            "replies": [
                                                {
                                                    "author": "Valuable_Impress_192",
                                                    "body": "Jesus christ just look it up why you gotta act helpless",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "parmesann",
                                                            "body": "random internet stranger! I've decided you owe me an explanation of whatever I want! don't delay! it is YOUR responsibility to cater to what I want!",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Valuable_Impress_192",
                                                                    "body": "Excuse you?! What do you MEAN ‘google it’?! How can I ever google anything if you haven’t explained what my search would have told me right here and now?",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "sam8988378",
                                                    "body": "You presume my lack of knowledge is indifference",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "parmesann",
                                    "body": "another comment recommended Googling it and I would advise that partly because it might look a bit different depending on who your ISP is. I have Spectrum so I can't set up a whole QoS, but I can go onto the Spectrum website to pause internet access for specific devices. you should be able to google \"set up QoS for \\[YOUR ISP\\] router\" and quickly find info to get you started!",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "No_Astronaut_9481",
            "body": "So strange and annoying. If a person i lived with left the bathroom stinking like a corpse after being in there i COULD NOT MANAGE.  YUCK.",
            "score": 42,
            "replies": [
                {
                    "author": "Adventurous_Ad_6546",
                    "body": "Especially when I *have* to go in to get ready or lose my job.",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sea_Yesterday_8888",
            "body": "May be out of left field, but I had a roommate with crazy early morning habits. Hogged the bathroom, was in the backyard if someone else was in there. Turned out to be heroin.",
            "score": 11,
            "replies": [
                {
                    "author": "parmesann",
                    "body": "I don't think it's outlandish to think drugs may be involved tbh! not the only explanation but far more common than one might think",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "cin6785",
            "body": "Drugs",
            "score": 11,
            "replies": []
        },
        {
            "author": "hondakller",
            "body": "Ya you gotta flush right when that bad boi goes under. Helps greatly with smell. My son on the other hand could care less. I'm like dude I don't want to taste your shit in the living room.",
            "score": 9,
            "replies": [
                {
                    "author": "FarAdministration321",
                    "body": "Couldn't care less. Could care less makes no sense at all.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lisa_Knows_Best",
            "body": "Start taking really long showers with the radio on.",
            "score": 17,
            "replies": []
        },
        {
            "author": "CaptainKook13",
            "body": "Looks like she has bad tummy issues",
            "score": 19,
            "replies": [
                {
                    "author": "No_Budget_7856",
                    "body": "Her stomach issues or poor diet don’t have anything to do with her genuinely crap behavior or attitude towards others",
                    "score": 27,
                    "replies": [
                        {
                            "author": "CaptainKook13",
                            "body": "The stomach issues are not excusing the behavior but yeah, they probably have everything to do with it lol",
                            "score": 16,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Jean19812",
            "body": "Buy her a bottle of Poo-Pourri. It puts a oily film on top of the toilet water - So all the smell is captured in the water.",
            "score": 6,
            "replies": [
                {
                    "author": "parmesann",
                    "body": "I have a feeling that a roommate being this inconsiderate isn't going to bother with using that",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Phuc_train",
            "body": "Turn the wifi off.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Krillkus",
            "body": "Do people not courtesy flush? Like the second your shit leaves your body, you flush, especially if you can tell (you can) that it'll be a doozy. If it has to be a process that takes time, you flush again the next time more leaves. I mean don't go full ham and flush the toilet over and over because that's kinda wasteful, but that's when you pack it up and go \"I'll get the rest of ya out later\" since we can't just live on the toilet haha. Of course the answer here is more fibre, but if that isn't the case, courtesy flush!\n\nAlso 2 hours is way too much. I have my own ensuite so I don't have to worry about anyone else needing it, and have been known to need a bit more time on days where I haven't gotten enough fibre into myself, but goddamn, never 2 hours lol.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Far-Veterinarian9487",
            "body": "Does she take meds? Has she stopped taking said meds?? Nutter",
            "score": 1,
            "replies": []
        },
        {
            "author": "Please_Dont_Run",
            "body": "You buggin'",
            "score": -1,
            "replies": []
        }
    ]
}