{
    "title": "How to tell a future would-be roommate that it's not gonna happen",
    "author": "FitzyII",
    "subreddit": "badroommates",
    "rank": 19,
    "score": 6,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 7,
    "url": "https://www.reddit.com/r/badroommates/comments/1jdqo7l/how_to_tell_a_future_wouldbe_roommate_that_its/",
    "id": "1jdqo7l",
    "selftext": "Tl;dr, how do I maintain a friendship when I've decided before signing anything that we won't be good roommates, with about 45 days till set move in date. This will not strand her with no options, as she lives with her parents, but we are having the convo in person and I fear my decision might blindside her and it might get emotional.\n\n\nI guess my root question is looking for advice on how to approach and go about this difficult conversation I've got to have while hopefully maintaining a friendship\n\nLong story long, we'd  been planning to move in together, it's been a vague plan for about 2 years and a more set plan as of the last 6 months. \n\nOriginally we were looking for march 1st, but we've moved to May 1st. This is reasonable as she lives with her parents and I am on a month to month and the current roommate I'm trying to get away from got a bit more manageable since he got a girlfriend to keep him accountable for cleaning. \n\nThe reason we pushed it is she simply wasn't ready or engaged. Sending listings over budget, not attending viewings with me, being picky about factors our budget doesnt allow like room size and kitchen colour, and generally taking days to respond to anything.  Feb 7th i realized how close march 1st was approaching and, after speaking to my therapist about my existing concerns, he suggested maybe she just wasn't familiar enough with how it works, and wasn't being distant on purpose. \n\nSo when I told her I'd be okay waiting till may 1st, she was basically like *thank God. I'm anxious about it and I still have to tell my parents which I'm gonna do this weekend* . \n\nThat made me worry more.you mean you were gonna move out march 1st but it's a week into Feb and you haven't told your parents? \n\nAnyways. I'd hoped it would get better but it got worse. Taking multiple days to respond. Sending places we'll over budget and out of our agreed location radius. Sending non-pet friendly places when it's literally for her dog that we need pet friendly. \n\nI think she's got higher hopes than out budget calls for which is *fine* because her home life is decently peaceful, so i can imagine she doesn't wanna move into a tiny room or something. \n\nAbout a week and a half ago (march 8) I send her a long text saying like, hey, I don't have a backup here, and I'm starting to worry. We need to have a clear convo about how serious this is. \n\nShe basically put off that conversation, after even more prompting from me, until yesterday when she told me she wanted to meet up and discuss it. And *no she hadn't told her parents yet* \n\nSo i was like, great, I'm already exploring other options and this must mean you've realized you don't wanna move together. This is gonna be easy and we can keep our friendship. \n\nBut we've agreed to meet and talk tomorrow, and since the last convo she's been sending places still. So I feel this convo might blind side her. I got confirmation from another friend that I believe will be a good fit that he's down to look for a place with me. I have faith in this cause we both know struggle and desperation, and the above friend is a bit more sheltered and privileged. \n\nI genuinely don't think she realizes how serious and time-crunch this is, I really think this is more an issue of ignorance than selfishness.\n\nI recognize that if it gets explosive, then she's not a friend and I shouldn't keep her around. I do think I'm on the logical and rational side of the argument(I'll provide any more context yall want)\n",
    "comments": [
        {
            "author": "MaryBitchards",
            "body": "Sounds like your gut is telling you this is a bad idea and I always recommend listening to your gut. It also sounds like her unfamiliarity with anything apartment-related would most likely extend to the necessity of paying rent and utilities in a timely fashion every month. I would tell her I'm afraid we wouldn't end up being friends anymore if she moved in and I don't want to risk that.",
            "score": 7,
            "replies": []
        },
        {
            "author": "AnonymousFruit69",
            "body": "Don't move it with them.\n\nThe way they are acting it seems like they don't want to, they keep putting it off and making excuses and not turning up.\n\nThis person seems too unreliable. If thry are lime this now, hoe can you relie on thrm when it comes to cleaning, house chores, and paying bills and rent? I wouldn't relie on them for anything.\n\nJuat move in with someone else or on your own.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Two-Theories",
            "body": "\"I value your friendship and I know this will come as a shock and is disappointing news but I've made the decision that moving in together now is not the right decision for me and I am going to focus my search on a place for myself, with or without X friend, because X and I are more aligned on this issue.\" \n\nThen give her space if she wants space or let her share her feelings, and listen to her and validate her feelings. However, her feelings do not have to change your decision. If she asks for specific reasons - just say that you have a strong feeling of being more comfortable (or that the right decision for you now, is) to move alone  or with X friend who is in a similar position to you. It is not something that are be argued against because you already recognise how great it would be to share with her but unfortunately, it is not worked out this year. You'd hope that she'll respect your feelings and decision, even if she doesn't understand them, but will understand if she wants space etc..",
            "score": 3,
            "replies": []
        },
        {
            "author": "Anxious-Routine-5526",
            "body": "Take a deep breath and be honest.\n\nThey're being flaky/unrealistic and aren't showing any indication that they're ready to move out from their parent's. \n\nYou don't have time to play around anymore, so you're moving on without them. If this is a real friend, your friendship will survive.  If they aren't, it's better to find out now *before*  moving in with them and getting screwed.",
            "score": 3,
            "replies": [
                {
                    "author": "mladyhawke",
                    "body": "exactly,  moving is really stressful and her lack of urgency coupled with her inability to be realistic when suggesting apartments is adding stress to the process and you don't have time to screw around. ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AlivePassenger3859",
            "body": "Its better for your friendship to have this speedbump that you can potentially recover from than move in together and potentially never speak to each other again.",
            "score": 1,
            "replies": []
        },
        {
            "author": "curiousity60",
            "body": "She sounds...unready. You need an adult who is and will be independently reliable and responsible for their share of the responsibilities of independent living. You are still establishing your own independent and supportive adult lifestyle. Taking on a roommate with an adolescent mindset, no independent living experience, and still enmeshed and poorly communicating with the parents who support her would be a huge drain on your energy and resources.\n\nYou need and deserve a roommate who is already a fully functional adult.",
            "score": 1,
            "replies": []
        }
    ]
}