{
    "title": "Pets allowed, but roommate brought home unregistered pet",
    "author": "rockykb",
    "subreddit": "badroommates",
    "rank": 17,
    "score": 3,
    "upvote_ratio": 0.71,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/badroommates/comments/1jdwhk9/pets_allowed_but_roommate_brought_home/",
    "id": "1jdwhk9",
    "selftext": "When we first moved into our place, we both had to register our dogs (each have one) with the management company. My dog is an ESA and actually in training to become a service animal so they waived the pet fee and deposit for me. My roommate still had to pay the deposit and pays $25 a month for a pet fee.\n\nOnly a couple months into the lease, she brought up the idea of getting a new puppy. I quickly shot it down and told her absolutely not because the one she currently has still pees on everything. Which of course, did not go over well. But was (and still is) the truth. \n\nFast forward several months and we no longer get along at all. She has not been civil towards me and has been extremely nasty. I ended up having to remove my dog from the house and send her to go live with family because she was no longer getting cared for in the house while I was at work. (I forgot to preface this with: we both work opposite shifts  and had mutually agreed to take care of one another’s dogs while we were at work). So once my dog was removed from the house, she apparently thought that gave her the opportunity to bring home a puppy.\n\nSo now she has two dogs in our house, both of which are hardly potty trained, and one of them is an illegal pet. I am not okay having this puppy in the house. My dog does not like all other dogs and I do not believe it is fair for her to put both myself and my dog in this situation. I never agreed to having three dogs in the house nor did the property manager. \n\nWould I be a complete asshole if I notified the management group? Our lease says a $60 fee per day will be charged for each day the unregistered pet is present. My roommate will know it is me that notified them, because who else would’ve said anything? Should I risk it? I do not want to lose my security deposit or be held liable in any sort of way for her illegal pet. But I’m afraid that will happen since both of our names are on the lease.",
    "comments": [
        {
            "author": "hautedabber",
            "body": "I’m not super knowledgeable in this sort of thing but there’s a chance you could do an anonymous tip about the dog. Say you’re a neighbor and noticed a third animal and was curious about it being registered? If not that; do you guys constantly pick up the poop? If not the apartment complex would usually get upset and threaten to take the poop and analyze it and charge whoever’s registered animal the amount they would and since it’s a non registered animal that’d be an issue. I don’t know. Sorry for not having a definitive answer or help. Just my thoughts.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Revolution_of_Values",
            "body": "Tell the management asap. You do not want to be held responsible for letting this illegal pet go unnotified for any longer, and 60 bucks a day is fricking expensive. Keep documenting every day and keep reporting to the office every week. Also, it seems like you both are no longer compatible as roommates (if you ever were, I guess), and since it's like your roommate is going to blow up if she gets in trouble, then I would start locking everything you own and care about in your room and get a camera for your room. And start looking to move and/or find a replacement roommate. Best of luck!",
            "score": 1,
            "replies": []
        }
    ]
}