{
    "title": "Roommate is charging me extra because I use the shower more",
    "author": "Inside_Trainer3842",
    "subreddit": "badroommates",
    "rank": 5,
    "score": 117,
    "upvote_ratio": 0.86,
    "num_comments (reported by reddit)": 169,
    "url": "https://www.reddit.com/r/badroommates/comments/1jdxwba/roommate_is_charging_me_extra_because_i_use_the/",
    "id": "1jdxwba",
    "selftext": "I split utilities 50/50 with 4 roommates in college. My roommate is charging me more money because I take more showers. I shower twice a day 10-15 minutes each time. Is it fair that he charges me more? All the other roommates don’t agree, because if we really wanted to nickel and dime people he uses the TV and stove more. \n\nHe is charging me 40% of the utility cost and 10% for himself and 25% for the other 2 roommates ",
    "comments": [
        {
            "author": "Philadelphia2020",
            "body": "Stop paying the 40% bro? Give him the 25% and tell him to kick rocks",
            "score": 209,
            "replies": [
                {
                    "author": "TrooperXYZ",
                    "body": "Exactly.  Do they have access to your bank account.  Cut them a check for the 25%, or Venmo them the 25% and that's it.  You only pay 40% if you go along with it.",
                    "score": 32,
                    "replies": []
                },
                {
                    "author": "stelamo",
                    "body": "Yer coz £30 a month on showers is nothing ! 8kw shower half an hour a day at 25p kWh",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Euphoric_Fail_6675",
            "body": "Hilarious! He has no legal ground to stand on. 🤣😁😅",
            "score": 249,
            "replies": [
                {
                    "author": "Inside_Trainer3842",
                    "body": "He’s policing my showers. I’m not policing his showers or his TV time or him using the stove. He’s bullying me into paying more by being passive aggressive",
                    "score": 103,
                    "replies": [
                        {
                            "author": "its-just_me-",
                            "body": "So ignore the passive aggressiveness & just live your life?",
                            "score": 120,
                            "replies": [
                                {
                                    "author": "Interesting_Sock9142",
                                    "body": "Exactly. Who cares.!?",
                                    "score": 22,
                                    "replies": []
                                },
                                {
                                    "author": "mrw4787",
                                    "body": "That’s not really how life works. ",
                                    "score": -34,
                                    "replies": [
                                        {
                                            "author": "xela364",
                                            "body": "That’s kinda exactly how life works? I work in an operating room. Surgeons are some of the most passive aggressive or outright aggressive people I’ve met. You know what I do to them when they’re just straight asses? Ignore them. My old roommates used to be annoying? Ignored. Parents say something to me I don’t like? I’m an adult, get Ignored. \n\nRoommates are some of the easiest to ignore I’d argue",
                                            "score": 20,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "MysteriousFootball78",
                            "body": "Why don't u say this to him? Do u not see the problem in this? It should be 25% for each of u instead he's making u pay an extra 15% and instead of everyone paying 20% while u pay 40% he's just making u pay the majority of his portion...",
                            "score": 29,
                            "replies": [
                                {
                                    "author": "roadfood",
                                    "body": "It's rather convenient how this split only benefits him.",
                                    "score": 25,
                                    "replies": [
                                        {
                                            "author": "Ok_Cycle_185",
                                            "body": "That's the part that helps op eliminate any legitimacy if you went the argument route",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Euphoric_Fail_6675",
                            "body": "Stare at him. Not a fun situation to be in; that’s for sure. I’m wondering if he moved into a place he couldn’t really afford.",
                            "score": 15,
                            "replies": []
                        },
                        {
                            "author": "De-railled",
                            "body": "Seems a bit pervy to be monitoring your shower times..",
                            "score": 20,
                            "replies": []
                        },
                        {
                            "author": "PhysicalCranberry962",
                            "body": "Ignore the people telling you to just ignore the passive aggressiveness and who cares are being highly insensitive. Please don’t take that on board it’s clearly an issue, and it’s extremely uncomfortable. You’re super valid for this.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "solveig82",
                                    "body": "Listen to Physical Cranberry. What your roommate is doing is insane and a bizarre form of harassment.",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Btender95",
                            "body": "Yeah he can't do that legally. As long as you're all on the lease start sending him 25% and if he says anything that's too bad.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Expensive_Plant_9530",
                            "body": "You know what'll really get under his nerves?\n\nIf you just live your life and ignore his passive aggressiveness.\n\nPay him the agreed upon 25% split.\n\nAlso even if that were true, and you did cost more utilities, why does ***HE*** get the 10% while the other roommates have to pay their 25% shares? Why doesn't he split the remaining 60% three ways?\n\nBecause he's a greedy cheap AH, and he's taking advantage of all of you.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "cabo169",
                            "body": "Frankly, I wouldn’t ignore it. I’d clearly point out, just as you have here, that he uses more electricity and washes more dishes and in turn there should be no one paying more of less out of all of you. \n\nIf “he” wants to be petty and nickel and dime you, clearly, turn around is fair play.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Unhappy_Energy_741",
                            "body": "Grow a backbone, man.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "No_Influence_4968",
                            "body": "Ask to see the difference your showers are having on the power bill.\n\nSome places have cheap setups with instant electric heaters attached to the shower system, and things can get expensive real quick.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "No_Influence_4968",
                    "body": "I had a flat mate like this once - 2x 20 min hot showers a day, doubled our power bill. We were locked into higher price plan for that buliding with no other provider options.\n\nI had to ask the flat mate at the time to shorten his showers, I'm not paying $100's extra per month just so a flat mate can shower longer, get real.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "stelamo",
                            "body": "Yer and the same people walk around turning lights off !",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "CupKind6245",
            "body": "If the other roommates agree that you shouldn’t be charged more then maybe a non-confrontational house discussion should be had. \n\nIt’s your home too you shouldn’t be bullied in a space you live in ESPECIALLY one you help pay for. If you need your roommates to help back you up you should ask them.",
            "score": 56,
            "replies": []
        },
        {
            "author": "De-railled",
            "body": "ROFL, \n\nTime to install coin-operated shared appliances.\n\nI mean, why stop at the washing machine?\n\nCoin showers, coin tv, coin toilets\n\nWant to sit on the sofa? Well, there's a usage fee for that too....\n\n\n\n/S if it's not obvious",
            "score": 48,
            "replies": [
                {
                    "author": "lovesahedge",
                    "body": "I literally had a couple I was living with approach me together to explain I could no longer use the fridge or washing machine as I \"didn't contribute to the costs enough\". I was the one paying the power bill (we split the cost).",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "wengelite",
            "body": "Ask to see the bills, pay your 25%, tell him to fuck off.",
            "score": 15,
            "replies": [
                {
                    "author": "Greeno2150",
                    "body": "This is the way",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SpecialModusOperandi",
            "body": "That’s not appropriate - if he wants to be petty, then go with then ‘you should pay more electricity, gas, water  because you use the TV more and cook more’.  Refuse to pay more than 25%.  \n\nIf you were costing disproportionally more then the 60% should be split across the 3 not just him.",
            "score": 14,
            "replies": []
        },
        {
            "author": "snow-haywire",
            "body": "So it would be different if you took one 20 minute shower a day?  \n\nPay him your 25% and tell him to go pound sand.  Your shower activity, if it makes a difference on your water bill is going to be minimal.  \n\nWhat a tool.",
            "score": 10,
            "replies": [
                {
                    "author": "TheHighBuddha",
                    "body": "A water heater is a significant energy consumer, often second only to heating and cooling, accounting for about 18% of a household's energy use.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "snow-haywire",
                            "body": "This person taking the equivalent of a 20-30 minute shower every day does not equate 40% of the utility bill.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "comesinallpackages",
            "body": "Just say no",
            "score": 9,
            "replies": []
        },
        {
            "author": "Verbenaplant",
            "body": "Don’t give him extra. You pay equally.",
            "score": 11,
            "replies": []
        },
        {
            "author": "Kind-Lie854",
            "body": "Is he the landlord to be charging you additional? He can’t dictate what you pay if he’s not the one who owns the property. Split share between the 4 and that’s it. No ifs or buts.",
            "score": 8,
            "replies": []
        },
        {
            "author": "7625607",
            "body": "No. You each pay 1/4 of each utility bill.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Cautious_Section_530",
            "body": ">All the other roommates don’t agree, because if we really wanted to nickel and dime people he uses the TV and stove more. He is charging me 40% of the utility cost and 10% for himself and 25% for the other 2 roommates\n\nWhat an idiot. This is not your fault in any way. He probably sees you as the easiest target to enforce his BS on .You all should just team up together and pay the 75% and tell whosoever in charge that \"this particular roommate\" is late on payment. Plus he has no right to charge you extra for showering more if there's no direct consequences in it like water finishing due to wastage and so on. Tell the fucker to fuck off already",
            "score": 8,
            "replies": []
        },
        {
            "author": "thatruth2483",
            "body": "Id ask for an itemized breakdown of the exact amount of water each person uses during their daily showers. \n\nWithout that, he has no proof of how much anyone should be charged.",
            "score": 6,
            "replies": []
        },
        {
            "author": "ring_tailed",
            "body": "Giving himself 10% tells you all you need to know. Ridiculous request",
            "score": 7,
            "replies": []
        },
        {
            "author": "Perimentalpause",
            "body": "\"I have two ten-fifteen minute showers. How long are your showers? Double that? We're even.\"\n\nTell him you'll pay the agreed upon split and if he has a problem with it, he can talk to the landlord.",
            "score": 3,
            "replies": []
        },
        {
            "author": "furkfurk",
            "body": "There is zero chance I would pay this.\n\nImmediate war, aka I’m timing his showers, I’m timing his TV usage, I’m coming up with data that shows he is using more electricity. And then I’m charging him 90%.\n\nNo really though I would just band together with the other roomies and refuse, because who has time to track people? Utilities are split equally, that’s how it works.",
            "score": 3,
            "replies": []
        },
        {
            "author": "PuzzleheadedRegret67",
            "body": "two fifteen minutes shows EVERYDAY is definitely crazy ngl, but he has no right or authority to be charging you( or your roommates) any extra money, who’s to say he isn’t pocketing it? you never know",
            "score": 17,
            "replies": [
                {
                    "author": "TrixriT544",
                    "body": "How so? Wake up and shower, because a lot of people get nasty sweating in bed lying for 8 hrs, plus it wakes you up. Then you work all day and if you say go to the gym, well then you definitely have to shower. Skip either one of those and you’re either smelly at work or your bed becomes gross. If it was longer than 15 mins each then yeah that’s quite inconsiderate to others in the house.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Relevant_Ingenuity85",
                            "body": "Maybe in the summer but if OP lives somewhere with a winter I really don't see how the bed becomes \"gross\" if you shower before going into. Just change the sheets regularly and you are good. Reduce the heat and you are good to go.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "TrixriT544",
                                    "body": "Well winter is only one season.  \n\n“Reduce the heat” is a nice thought, but who knows if that’s an option depending on roommates.  Wars have been fought over ambient indoor temperature settings.\n\nI also recommended showering before bed? You’re basically agreeing with my train of thought..",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Relevant_Ingenuity85",
                                            "body": "I don't see how it's necessary to shower twice a day, if you only do fitness once a day. Just shower after your session and you are good.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "TrixriT544",
                                                    "body": "I mean if you have a beard, take a daily morning shit, or just like to be refreshed to start the day, showering prior to work is a must.  Idk about you but I prefer not to walk around with smelly asshole all day. But to each their own lol",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Relevant_Ingenuity85",
                                                            "body": "I don't know if you are trying to imply I'm a \"smelly asshole\" because I shower once a day and not two but good for you if it makes you feel better 👍",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "TrixriT544",
                                                    "body": "I mean if you have a beard, take a daily morning shit, or just like to be refreshed to start the day, showering prior to work is a must.  Idk about you but I prefer not to walk around with smelly asshole all day. But to each their own lol",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Relevant_Ingenuity85",
                                                            "body": "I don't know if you are trying to imply I'm a \"smelly asshole\" because I shower once a day and not two but good for you if it makes you feel better 👍",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Choice-giraffe-",
                            "body": "15 mins is a long shower. It’s unnecessarily long.",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "LemonCollee",
                                    "body": "Not when you have insane long curly hair and have to shave and groom. Not it isn't.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "TrixriT544",
                                    "body": "What do you deem appropriate? I just took one and timed myself, 12 mins. Not racing a marathon speed just making sure everything is clean 🧼",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "PumpernickelJohnson",
                    "body": "2 showers is \"crazy\"?",
                    "score": 12,
                    "replies": [
                        {
                            "author": "ipeezie",
                            "body": "its selfish as fuck as well. look at what is recommended.",
                            "score": -4,
                            "replies": []
                        },
                        {
                            "author": "LastLibrary9508",
                            "body": "2 “fifteen minute” showers is crazy. You don’t need to overstrip your skin. There’s a good chance OP aid guesstimating and they’re actually closer to 20-25 per shower. My roommate had time blindness and would frequently take 25 min showers thinking it was just 10. When we had one bathroom, it was annoying as hell. She said I could always just come in and use the bathroom when she was in there but no way, I want my privacy.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "EstablishmentOk7859",
                                    "body": "dude even if it was 20-25 minutes, it’s bullshit to make them pay 40% while he pays 10%\n\nridiculous",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "LastLibrary9508",
                                            "body": "Lol why the Downvote when I didn’t say anything about the 40. I agree it’s weird to charge like that. But OP seems a little young and is a little overboard on his shower routine and isn’t the angel roommate either 🙂",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "EstablishmentOk7859",
                                    "body": "dude even if it was 20-25 minutes, it’s bullshit to make them pay 40% while he pays 10%\n\nridiculous",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "GreatChicken231",
                            "body": "30 minutes of blasting water and occupying the bathroom every day? it’s a bit much. where i’m from, we’re told to take one four-minute shower a day. i think that’s too short to stay consistent with, especially when treating hair, but it’s definitely doable.",
                            "score": -16,
                            "replies": [
                                {
                                    "author": "bluepieceofshit",
                                    "body": "Ew",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "briomio",
            "body": "It sounds like with three other roommates that he is charging you to discourage all this showering - are you hogging the shower and preventing others from using the bathroom?",
            "score": 10,
            "replies": [
                {
                    "author": "Inside_Trainer3842",
                    "body": "He is charging me 40% himself 10% and the other roommates 25% each",
                    "score": -16,
                    "replies": [
                        {
                            "author": "CrazyCoderOutThere",
                            "body": "Doesn’t answer the question bro. @briomio was trying to be helpful by asking a question that’s worth thinking about",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "starksdawson",
            "body": "I’m sorry but 30 minutes a day is insane. I don’t disagree with your roommates paying less - but he is taking advantage of the other two and being cheap by only paying 10%. Literally paying less than half of the other two, what a jerk.\n\nI’d say, maybe 30 for you and divide it evenly among the rest",
            "score": 11,
            "replies": []
        },
        {
            "author": "Rakana3223",
            "body": "When you have your own place, you can spend the whole day showering, but when you share a house with other tenants, you need to be considerate.\nWe are in winter, so 1 shower a day is enough.",
            "score": 6,
            "replies": []
        },
        {
            "author": "SELamby",
            "body": "Do you guys pay for cold water where you rent? Or just to heat the water?\n\n I live with 8 other people, and I'd prefer they shower, so they don't stink. My showers are 15-20 with haircare but sometimes I do my hair in the kitchen sink first depending on what treatment I'm doing etc...\n\n If I was working out at the gym, I'd shower there. Could you shower where you practice?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Technical_Shoulder44",
            "body": "Just say I'll contribute a bit more to the water bill but by the same logic let's make sure you contribute more to the electrical.",
            "score": 2,
            "replies": []
        },
        {
            "author": "WillRikersHouseboy",
            "body": "It’s obviously impossible to pin down bc of the variables but in the US but a viable estimate using average prices (which is the middle of a*very* wide range) is about **$1 per shower**… a number that surprised me.*\n\nSo my initial response was that the double shower routine was a negligible cost. But it actually could be **$30/month**… or even higher in maybe places like California.\n\nIt’s stupid to change a percentage difference for that, and it’s OUTRAGEOUS to charge himself just 10%.  So we know he is being disingenuous nevertheless.\n\nThe only way to do this would be to get local pricing, estimate *everyone’s differing habits for everything*\nand go from there.\n\nIs one of the roommates a gamer with a big PC rig that he leaves on all the time? That is shockingly expensive, too.\n\n*Sources: Google it yourself.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Chile_Chowdah",
            "body": "You should attend a better college, splitting with four people isn't 50/50.  On another note, your roommate is a douche and wouldn't get a penny more from me.  You're also kind of a douche, is college really so demanding that you're sweating all day and need another shower? Give your skin a break, one shower a day is good.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ForcedEntry420",
            "body": "I’d pay him an even split of the utilities and that’s gonna be the end of it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "daddypez",
            "body": "“Charging you more”? \n\nNo reason to accept that. If you’re paying more, you’re deciding to do that. \n\n“Nope. I’m paying my 25% of the utilities just like you are.” \n\nSimple.",
            "score": 2,
            "replies": []
        },
        {
            "author": "shenemm",
            "body": "obviously he's just cheap, but honestly two medium-length showers a day would kind of piss me off, especially if water is expensive where you are (idk if it is there). if he uses a lot of gas/electric just start policing him on that, otherwise don't pay the extra utility price lmao",
            "score": 2,
            "replies": []
        },
        {
            "author": "Individual-Code5176",
            "body": "Absolutely not! You’re showering a normal amount",
            "score": 2,
            "replies": [
                {
                    "author": "Ken-Popcorn",
                    "body": "30 minutes a day in the shower is not a normal amount. That said, I’d tell the other guy to kick rocks",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Individual-Code5176",
                            "body": "2 10ish min seems normal to me..I work in restaurants so I pretty much have to take 2 showers, sometimes a 5 min rinse but I’m definitely in there 2 times",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Appropriate_Edge7385",
            "body": "I would pay my part and move on. No way I’m paying 40%",
            "score": 2,
            "replies": []
        },
        {
            "author": "KamIsFam",
            "body": "Short answer, you shouldn't pay any extra.\n\nLong answer, he's fucking delusional. It's ridiculous to try and nitpick everything people do to try and calculate what they should pay for. The only thing that should be different is rent amount when people have different sized rooms. All he's doing is creating conflict in the house.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Expensive_Plant_9530",
            "body": "How does the lease look with this setup? Are you all on the lease? Do you all have separate leases for your bedrooms? Does one person have the lease and the rest of you are their roommates?\n\nGenerally speaking, utilities are split equally among roommates. Why are you \"allowing\" him to charge you more? Ask to see the bill, and pay your equal share. Don't give him anymore money.",
            "score": 2,
            "replies": []
        },
        {
            "author": "mrcrude",
            "body": "Tbh two 15-minute showers a day is pretty absurd. Why do you need to shower for that long? Such a colossal waste of water. I’m with your roommate.",
            "score": 14,
            "replies": [
                {
                    "author": "Johnny_Poppyseed",
                    "body": "15 min shower is still less water used than even a smaller sized bathtub bath. \n\n\nYou can pry my 15 minute showers from my cold dead hands. Or warm and bloated hands probably because I died in a nice long hot shower. ",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "Inside_Trainer3842",
                    "body": "I’m a college athlete. I take a cold shower when I get up and one after practice. No offence but how dirty/lazy are you?",
                    "score": -12,
                    "replies": [
                        {
                            "author": "osamabinluvin",
                            "body": "Idk why you are getting hate, 2x15min showers a day for someone who trains is normal.",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "Jendelinek",
                            "body": "Lazy? It doesnt take longer then 5 min to cover all body in soap and wash it off.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "Inside_Trainer3842",
                                    "body": "I have Afro curly hair that takes time to maintain with products. 10 minutes is not a long shower",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "Technical_Annual_563",
                                            "body": "Do you wash your hair both times? It seems the pre practice shower could be shorter, I mean you’re literally just quickly stepping into the cold stream, right? Also, you didn’t answer the important question you were asked earlier about if from your roommates’ perspective you overuse the shower as a resource, preventing others from being able to access and use it when they need.",
                                            "score": 9,
                                            "replies": []
                                        },
                                        {
                                            "author": "LemonCollee",
                                            "body": "Curly girl here, I think most of these times are completely unrealistic. Especially if doing hair. There's a whole other level of maintenance for curly/afro hair.",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "SunstoneDaemon42",
                                            "body": "I'm slightly concerned by how little time people are saying they're taking for their showers. It takes me longer than 5 minutes to wash my hair the way you're supposed to properly, and I actually take the time to wash my skin and exfoliate when needed. The amount of time you take to shower is fine if it's what your body and hair type need. Others have to recognize that 5 minutes just isn't enough for most people if they're actually taking their time to get all the dirt and sweat off their skin lol.\n\nI swear some people treat showering like it's a race. It's dumb your roommate wants to charge you more for 20-30 minute showers a day. It does make me wonder how much you all are paying for your water bill monthly, though.",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "author": "1-2-3RightMeow",
                                                    "body": "If you’re taking two showers a day, one could be a quick soap up rinse off (5 minutes or less) and the other could be the proper shower with hair care, exfoliating etc. If there’s only one bathroom I could see the other three roommates getting annoyed with how long OP is spending in the bathroom every day. Cause like, the showers are 15 minutes, but is there 10 minutes before for going to the bathroom and 20 minutes after for moisturizing, blow drying etc? These “15 minute” showers could easily be monopolizing the bathroom for up to an hour. OP has been very cagey about answering questions so I’m assuming this is coming into play. \n\n\nEvery roommate should be paying 25% of the utilities regardless, but they may need to have a house meeting about hogging the bathroom",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "ilovemusic19",
                                                    "body": "It’s people with short hair that don’t know shit",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Relevant_Ingenuity85",
                                                    "body": "You are not supposed to wash your hair everyday anyways, so most showers during the week are only for the skin and yeah it takes 5minutes to shower your skin.",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "ilovemusic19",
                                                            "body": "Everyone’s hair is different, I have really greasy hair and wash it daily cause it’s already greasy the next day.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "LastLibrary9508",
                                                    "body": "You don’t need to exfoliate twice a day, let alone every day! It hurts your skin.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "SunstoneDaemon42",
                                                            "body": "I never said you did, I said everyone's skin and needs are different.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "DantesDame",
                                                    "body": "Yeah, but EVERY day? That's just overkill.",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "author": "ilovemusic19",
                                                            "body": "OP said in the comments they are an athlete",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Frosty_Corgi_3440",
                                            "body": "Don't listen to these nasty fucks, 15-minutes for a shower is normal.....What they're talking about is a quick rinse, I can't imagine the noxious body odor they carry with them. \n\nAs for the roommate trying to charge you more, tell him to eat shit 🤣",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "GreatChicken231",
                                                    "body": "mate, it really doesn’t take too long to 1) get everything wet, 2) soap everything up, and 3) scrub everything down. guarantee you if you actually tried doing it quickly it would take less than five minutes, possibly even two. hair is another thing. \n\ni think you’re projecting your own stank",
                                                    "score": -6,
                                                    "replies": [
                                                        {
                                                            "author": "bluepieceofshit",
                                                            "body": "You probably stink a lot if you think you can shower in two minutes",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "Frosty_Corgi_3440",
                                                                    "body": "Probably? It's guaranteed that guy stinks to the point your nostrils would flare up when he's within a 15-foot radius. \n\nI remember an old guy at the gym who would smell up an entire section just by being there....That's what this kangaroo fucker's like.",
                                                                    "score": 0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "GreatChicken231",
                                                                    "body": "again, you're projecting. i am actually known to smell good, lol. \n\nfour minutes is the recommended time here in australia, and yeah it gets sweaty here. we manage. don't get mad just because you can't clean quickly!",
                                                                    "score": -6,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Jendelinek",
                                            "body": "Life hack: Get yourself wet, turn off water for time you aply your products, wash it of. You get time your hair need, but water is running only when realy needed. Everyone will be happy",
                                            "score": 0,
                                            "replies": []
                                        },
                                        {
                                            "author": "DastardlyCreepy",
                                            "body": "Well you have no natural oils as your washing it too much",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "author": "ilovemusic19",
                                                    "body": "Everyone’s hair is different, I wash mine daily and still end up with oils, I’m a greasy person naturally and my hair gets all greasy overnight",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "ilovemusic19",
                                    "body": "Says the guy with short ass hair, as a woman with long hair 10-15 minutes is average when you factor in washing your hair (which you clearly don’t wash properly)",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Wise_Change4662",
                            "body": "Well said. I'm a 2 shower a day minimum. I can't get over how gross the majority of humans are when it comes to this subject.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "ilovemusic19",
                                    "body": "You do not need to shower twice a day, once is enough unless you are an athlete like OP is, your are probably ruining your hair.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "mrcrude",
                            "body": "I sometimes shower twice a day too, as I usually go to the gym in the evenings. But that doesn’t mean I shower 15 minutes each time. 5 minutes is sufficient to get thoroughly clean. 15 minutes is just excessive.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "wouldashoudacoulda",
                            "body": "15 minutes! You can get whatever you need to get done in 3 minutes. What does being an athlete have to do with increased shower length? I’d assume you are fit and agile, so you should be able do everything very quickly.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "ilovemusic19",
                                    "body": "You were never taught how to properly wash you hair if you are done that quick if you think that’s reasonable. I have really long hair and it takes a bit to rinse out product and such so stfu.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ilovemusic19",
                            "body": "That makes sense, you don’t want to go around smelly after practice.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Choice-giraffe-",
                            "body": "It’s the 15 mins. Even if you cut down to 10 mins per shower. How long does it even take to wash your hair and body!",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "ilovemusic19",
                                    "body": "OP said they have an Afro, not everyone has short hair like yours that rinses quickly and is simple. 🤦🏼‍♀️🤦🏼‍♀️",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "DastardlyCreepy",
                            "body": "Then take it at school. Were the shower is completely free",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "LastLibrary9508",
                            "body": "Bro but why aren’t you showering at the gym after practice? Going home when you’re already sweaty is gross. \n\nAlso you say you have a long hair care routine. That’s cool. Textured hair takes a lot of work that people don’t see. But you should not be washing your hair twice a day and even less for textured hair. I shower twice a day in the summer and it’s one quick one when I feel sweaty and and another quick one when I feel sweaty toward the night? They’re maybe 7 min top with specialized body rinses. As a girl with long hair that does get greasy more quickly now that I changed birth control, I still wash it once every two days. You’re not supposed to over wash your hair. I imagine washing it twice a day is doing harm to it.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "psymeariver",
            "body": "No, that’s bullshit, water costs very little as does heating it.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Shot_Molasses_5881",
            "body": "he has no reason to charge you more. you aren’t even spending a crazy amount of time in the shower since it’s like maybe 30 minutes a day?\nalso if it’s not disrupting anyone i don’t see the issue.",
            "score": 3,
            "replies": [
                {
                    "author": "Jendelinek",
                    "body": "30 min in shower is crazy",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Shot_Molasses_5881",
                            "body": "i don’t think it’s that crazy lol. granted mine are usually 15 but if i do an everything shower it will be closer to 30",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Jendelinek",
                                    "body": "Well, with shaving, its close to 30, but without shaving is anything over 10 waste of time. Man, washing a whole car takes 10 min. And my body is a lot smaller than a car",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Shot_Molasses_5881",
                                            "body": "i get that but he has two 10-15 minute showers not one 30 min. but my point is that even a 30 minute showers isnt that insane. i’d rather my roommate shower too much than too little 😭",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Jendelinek",
                                                    "body": "Ok, but still, water dont have to be running whole 10-15 min. 30 min of running water for 1 person everyday is a lot. Shower is 5-9 liters of water per minute. 30 min shower is 150+ liters of water. In my country average usage of water is around 100 liters per person per day including shower, toilet, washer, dishes. So OPs usage is probably double of average.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "ilovemusic19",
                                            "body": "You must be very slow at shaving",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Choice-giraffe-",
                    "body": "If all housemates did that, the bathroom would be backed up for 2 hours every morning and 2 hours every evening. That’s insane.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Brilliant-Force9872",
            "body": "If he was going to charge you more he needs to get the water bill and have everyone put down there exact amount of time of shower use and water use then figure out the percentage for each person. Then when someone uses a light tv or stove calculate that time as well. In all seriousness I could see charging more for water if you do use it twice as much as everyone else.",
            "score": 2,
            "replies": []
        },
        {
            "author": "D_Jayestar",
            "body": "Cut your showers to under 10 mins each. Tell them no, but compromise. You have to live with these people .",
            "score": 2,
            "replies": []
        },
        {
            "author": "aLizardinSomeTrash",
            "body": "Twice a day for 15 minutes is absurd. Genuinely, why?",
            "score": 2,
            "replies": [
                {
                    "author": "ilovemusic19",
                    "body": "OP said they are a college athlete in the comments",
                    "score": 1,
                    "replies": [
                        {
                            "author": "aLizardinSomeTrash",
                            "body": "Ok, I mean I guess that makes a lil more sense but a 5 min rinse for one of those showers seems way reasonable",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "jibaro1953",
            "body": "Get a water saver shower head with a navy button",
            "score": 1,
            "replies": []
        },
        {
            "author": "Comfortable_Dust3967",
            "body": "whose place is it? lease under their name?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Quick-Maintenance-67",
            "body": "This is bs, why would he only pay 10%? If you're being charged 40%, if you were truly using so much more water than anyone else and the other roommates are using the appropriate amount of water, the other housemates would pay 20%, with this BS scenario he would effectively be charging your other housemates too much money as well. Friend or not your roommate needs a wake up call, you guys are not there to pay his way. He is not the boss, and you guys need to have a roommate meeting. Make sure to schedule it during his TV time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Choice-giraffe-",
            "body": "If he’s splitting based on shower usage and he’s put himself down to just 10%, dude needs to start showering more often.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ill-Vehicle-9907",
            "body": "The  p",
            "score": 1,
            "replies": []
        },
        {
            "author": "InterestingTrip5979",
            "body": "Batshit crazy",
            "score": 1,
            "replies": []
        },
        {
            "author": "Power_of_the_Hawk",
            "body": "Just water board them until they agree to stop charging you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FigTechnical8043",
            "body": "A 10 minute shower is 31p to 40p. So £1.20 per day maximum. £36 a month. Ask to see the bill to see if it's moved at all between when you moved in and what it is now, outside of price rises and ask him if he's aware that there was a price rise in October and January and has he applied for the best tarif he can get or done a gas/electric comparison, because it may well just be time to move company. You aren't having baths which makes the water bill less and you aren't adding to the gas bill which is higher, unless it's somehow a gas heated shower. If someone's putting the heating on frequently, that's more likely to boost the bill than your showers. Plus, your 25% if it doesn't cover your showers, what exactly is it covering? Lights, cooker, heating, some tv. Surely this is a case of swings and roundabouts. At worst he could've asked you for an extra tenner, not 40% and lowering everyone else's payments. Especially if everyone else is happy to pay 25% and it's just him.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Thunkwhistlethegnome",
            "body": "Does he have it in writing? If not look around for things to charge him on and present him a bill. \n\nIt’s the Wild West of demands and fees if nothing is in writing and things can change on a whim.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NoAppointment3062",
            "body": "What do your other roommates think? Like even if this was a sane way of thinking, he only gave himself the discount?????",
            "score": 1,
            "replies": []
        },
        {
            "author": "DreamingOfDragons23",
            "body": "No. Start policing his TV watching, stove-using, etc. If he wants to be a passive aggressive cvnt do it right back.",
            "score": 1,
            "replies": []
        },
        {
            "author": "allblackerrrythang",
            "body": "Pay 1/4th like you’re meant to and not a dime more.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Intelligent-Sign2693",
            "body": "Nope.  You can't nickel and dime utilities. Make him pay 25%!",
            "score": 1,
            "replies": []
        },
        {
            "author": "MaximumGibbs",
            "body": "The only advice you ever need to hear is, you don't need to pay that shit, and since he's tried that, match his energy. ANYTHING that's yours is off limits to him. Anything you shared before that it back. See how long he wants to be a dick about pointless things then",
            "score": 1,
            "replies": []
        },
        {
            "author": "yesIateallthepizza",
            "body": "I used to live with someone who would take a 2 hour shower every day. Literally would turn the shower on and start doing chores for 30 min then would go in there and do whatever else for the next 30 before finally being actually in the actual shower for the other hour. That's someone who deserved to be charged more not you taking a total of 30 min a day.",
            "score": 1,
            "replies": []
        },
        {
            "author": "kenmlin",
            "body": "Why is he only paying 10%?  Does he not shower?\n\nAsk to see the bills.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dependent-Stuff-8574",
            "body": "Actually insane. Pay 25% and tell him to move back home with mommy. Why the hell does he get to pay the least ? Lmfao",
            "score": 1,
            "replies": []
        },
        {
            "author": "KamIsFam",
            "body": "Short answer, you shouldn't pay any extra.\n\nLong answer, he's fucking delusional. It's ridiculous to try and nitpick everything people do to try and calculate what they should pay for. The only thing that should be different is rent amount when people have different sized rooms. All he's doing is creating conflict in the house.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cseckshun",
            "body": "Take a look at the bill with him and show him how much is surcharges and fees and how much is actually based on usage. Typically it’s a small portion of the bill that is for actual usage and most of the bill is static and doesn’t change no matter how much water you use. If not, then look up flow rate for your shower head and calculate how much water you are using and how much it costs every month to give an idea of how petty this roommate is being.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bustaone",
            "body": "Ask to see the actual bill.\n\nNot too tough to read the shower head and multiply that by time of use to get an accurate number.\n\nI'd guess the cost of a 2nd 15m shower a day is probably somewhere around $3 per month. Electricity or internet will be way more expensive... But that does depend on location.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mammoth-Giraffe-7242",
            "body": "Calc the water usage. Not hard. Showerhead has gal/minute rating. I would wonder though why two showers every day but that’s OPs preference for sure.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mr-narwhalington",
            "body": "What a knob, pay your share (25%) and if he tries anything get the college involved as I doubt he has any legal grounds to stand on.  \n\nDoubt the college would appreciate a student acting like this to others, seems a bit extortionate to me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Akira_Kaioh",
            "body": "I think you guys should sit down with the bill and talk it out. In some areas (like where I live) water can be pretty expensive.\n\nBut it would be something to agree upon as a group, not something one person decides on their own. \n\nIf water is high in your area, you could take one of the showers at the gym or if you have access at work/school, as a compromise. \n\nBut you could go over all the bills, you can meter certain electronics in each room (if your roomate is feeling pedantic) and I'd bet the roomate uses more electricity or something too.\nIf they want to charge like that, they may as well take all the bills into consideration..",
            "score": 1,
            "replies": []
        },
        {
            "author": "chrissymad",
            "body": "Ask to see the bill, pay 25% - and tell them to fuck off.",
            "score": 1,
            "replies": []
        },
        {
            "author": "B3r6h",
            "body": "If you shower twice day. That means you use more water and electrisity then others in the house. Showers cost money. So you are probably spending a few bucks a day extra",
            "score": 1,
            "replies": []
        },
        {
            "author": "LittleMikan",
            "body": "How can everyone here just ignore that the other two roommates still pay 25% and that asshole himself 10% wtf?! He's literally just scamming you lol.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rotating_pebble",
            "body": "Wait and you said yes? The guy is taking you for a ride.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Badbadbobo",
            "body": "Idk about you, but my electric is usually way more than my water bill. I would tell him that's a great idea! So great he though of it, and you should do that with the other utilities, and he can pay 40% of the higher bill. Thanks for the suggestion, a-hole.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fandethar",
            "body": "It should be split equally and if he's really worried about the water bill because you take a longer shower, just throw him an extra $20 a month and tell him to shut the fuck up!",
            "score": 1,
            "replies": []
        },
        {
            "author": "angel777888",
            "body": "No, he shouldn’t be charging that much, but I imagine having four people using the shower often, plus dishes, plus laundry if you have an in unit, plus miscellaneous water use probably runs the bill up a bit and depletes the hot water (it does in our three person household w/ two ‘long’ showerers, me included) so MAYBE he’s doing it out of frustration?\n\nOut of curiosity, could you take your after training shower at the gym facilities without it being, like, super inconvenient? Or even just make one of them shorter? You said it takes that long because of your hair (I get it, I do not have extremely textured hair but it is thick & dense) but are you washing your hair twice daily? It’s annoying, but sometimes living with people means making weird or annoying compromises instead of fighting for the entirety of the arrangement, you know? 🤷🏻‍♀️\n\nOr he’s just a dick in general, you know your roommate better than me, obviously, and you can tell him to shove it completely!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Best_Photograph9542",
            "body": "Just to keep the peace maybe suggest roommates split an efficiency water shower head. \n\nOr to be petty suggest that you buy it but to discount the bill since it was your idea and you bought it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Process-8478",
            "body": "Why do you have to shower twice a day? Do you shit your pants daily?",
            "score": 1,
            "replies": [
                {
                    "author": "ilovemusic19",
                    "body": "OP said they are a college athlete in the comments",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Inside_Trainer3842",
                    "body": "Nah cause I get bitches unlike you, gotta stay fresh",
                    "score": 1,
                    "replies": [
                        {
                            "author": "No-Process-8478",
                            "body": "Right",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Suicideseason_666",
            "body": "If your a collage athlete why don’t you shower at the gym once and at home once and your problem is solved. 15 is a long time for both though, maybe a 5 and a 15",
            "score": 0,
            "replies": []
        },
        {
            "author": "ipeezie",
            "body": "Thats alot of extra unneed water. 5 mins in the shower is what recommended to be a good person who conserves.",
            "score": -4,
            "replies": []
        },
        {
            "author": "OMG-WTF_45",
            "body": "Nope!  Start making his stuff disappear until the bill evens out. Or, start charging him extra for the other stuff.  If it’s your wifi, change the password and block him out. Actually, change all the passwords on all streaming services if he’s not on them to make up for the water bill!!  I’m evil that way!!\n\nEdit:  look at the bill and just give him your forth. Nuf said!  Same with all the bills.",
            "score": 0,
            "replies": []
        }
    ]
}