{
    "title": "Is this bad enough to tell an RA?",
    "author": "Weird_Pea1247",
    "subreddit": "badroommates",
    "rank": 9,
    "score": 2,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.reddit.com/r/badroommates/comments/1je442h/is_this_bad_enough_to_tell_an_ra/",
    "id": "1je442h",
    "selftext": "I'm a college student and rooming with one person. They're not a bad person per say and honestly I feel like I'm overreacting. But there's been a lot of small things that've happened and kind of piled up and I'm not sure if I should be telling someone, like an RA, about this to get a mediator to help problem solve. They've done things like:\n\n* Eat almost all of my food. We shared food in the sense that we would say \"oh please feel free to take some things!\" to each other. But I didn't get to eat a solid 90% of the snacks/meals/drinks I brought because my roommate ate them. They apologized for this and said that they forgot what belonged to who which is why they ate so much of my stuff. But they also asked me to buy more microwaveable food \"for the dorm\" (aka them, now that I look back on it) and also for me to buy milk/snacks/food/etc for them. No paying back either\n* Give me the silent treatment for anywhere from hours to days and then blow up at me. They would  ignore me and show hostile body language (glaring, frowning, etc) and it would be obvious that something was wrong but they wouldn't say what it is. Then they would bring it up passive aggressively to straight up aggressively. A variation of this has been them not saying anything about xyz issue and then bringing it up in a much later conflict even if that conflict has little/nothing to do with xyz issue that they brought up. They also shouted at me once for me letting my girlfriend open the door to the room for me; they apologized for this later as well as the silent treatment. It got better for a while but now they're doing it again\n* Almost always turn to the defensive when I brought up an issue on my end. For example I asked them once to please use earbuds/headphones instead of playing their music/shows/etc out loud (this was immediately after I woke up to them watching some kind of show) and they refused, saying that I shouldn't be able to hear what they were watching/listening to because the volume was low enough. I guess they never wondered why I would ask them to put earbuds/headphones in the first place. They also recently blew up at me for something that I did; it would've been justified if it was something I had actually done. When I texted them a long message trying to untangle a sequence of events and conversations that led to this misunderstanding, they didn't read the text and hurled more accusations at me. Once they realized the contents of my text, they apologized for jumping to conclusions in their initial accusations and responding without reading my text\n* Ignore me when I would greet them when they walked in through the door/when I walked in through the door. This is a fairly recent development as we've been friends and would say hi when seeing each other in the dorm. But lately I've been saying my hi's and hello's and getting ignored. I feel like this is a relatively small thing though\n\n  \nEDIT: wrote this post in a scrambled state of mind and forgot to add that eating my food and the silent treatment were issues that we talked through before! I don't bring food anymore to the dorm (and try to hide it whenever I do) so that relevancy faded and the point I want to emphasize is how in the past (and I think still right now) they've maybe felt some entitlement to my money/also time, with them asking me to buy stuff for them. Also with them putting the focus off themself by claiming I'd be buying it \"for the dorm\". Silent treatment got better for a time after we talked about it and agreed it wasn't a healthy or effective means of communication but it's come back now and this is kind of in conjunction to them ignoring me. When they've communicated passive aggressively/aggressively in the past they've apologized but the behavior doesn't change\n\nI don't think they're a bad person per say and I think they just might need help with communication. I've been trying to never raise my voice, make it clear that any issue on my end isn't a personal attack on them, even resorted to being a bit of a doormat by saying things like \"oh it's okay if you keep doing {} thing it's not a big deal!\" and just accepting whatever they ask me to do even if I don't like it just so that they don't blow up at me or silent treatment me. But they still do and I don't know what more I can be doing and lately I've been intentionally avoiding our dorm because of how uncomfortable it is. Is it reasonable to talk to my RA about this to see if they can help us reach a solution? I can't help but feel that it's my fault given how my roommate seems to bring up a problem every other week and usually blow up at me/be passive aggressive to me while doing it. I'm trying really hard to be a good roommate and I'm hardly in the dorm anymore on purpose to give them space, I don't know what else to do and it's exhausting",
    "comments": [
        {
            "author": "howdyhowdyshark",
            "body": "I disagree. You are no longer comfortable in your temporary home. Speak up. It's difficult living with someone who's unstable and if you're intimidated by saying anything it's bc you're scared. It isn't okay to feel scared in your own home. Ask about moving rooms.",
            "score": 3,
            "replies": []
        },
        {
            "author": "7625607",
            "body": "Some of these are the issues that tend to happen when people are sharing space who haven’t previously had to share their space.\n\nSome of these are both of you not knowing how to communicate. Sounds like your roommate is afraid of conflict and doesn’t mention issues until they boil over, and doesn’t know how to deal with criticism (very common, especially among a young human who is away from home for the first time). \n\nTalk to your RA and ask if the RA can mediate a conversation about these issues.",
            "score": 2,
            "replies": []
        },
        {
            "author": "legalize_chicken",
            "body": "Yes and no. Some of the stuff you mentioned are just personal stuff, but the food and speaker issues could potentially be violations depending on your policies.\n\nBefore you talk to the RA, make some effort on your end to compromise with her. Label your food or separate it so that she can't use an excuse. Try sleeping with ear plugs and see if it suits you. If your food keeps getting stolen or you still aren't able to sleep through the speakers, then escalate this to an RA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pannaga_S",
            "body": "I agree, I think it is your fault that you kept quite and not raised concerns about these tiny issues before. Not that I'm being rude here, same thing happened with me. You're not alone 😭.",
            "score": 1,
            "replies": [
                {
                    "author": "Weird_Pea1247",
                    "body": "Forgot to mention that we have talked about these issues! Silent treatment is the most recent one that hasn't gotten better; I talked to them before about how it made me feel and they apologized and agreed it wasn't a healthy way to communicate. It got better for a time but now it's come back",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Pannaga_S",
                            "body": "You know, we should just make money and move out and get our own places! That's THE win!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Secure-Major1637",
            "body": "Sweetie, these incidents are not little things.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok-Implement-1263",
            "body": "Talk to the RA. You pay to live there, and deserve to be comfortable. \n\nI would note to your RA you are worried about retaliation though. Just because this person seems to go nuts on you a lot. \n\nI was an RA and this person sounds like someone you should cut ties with. These students tend to never really grow up and always blame everything around them for their own actions.",
            "score": 1,
            "replies": []
        }
    ]
}