{
    "title": "Ross Ulbricht has just been pardoned",
    "author": "Pineapple_Sasa",
    "subreddit": "Libertarian",
    "rank": 0,
    "score": 2874,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 520,
    "url": "https://i.redd.it/rvmuszbyrfee1.png",
    "id": "1i6xfkd",
    "selftext": "",
    "comments": [
        {
            "author": "Banesmuffledvoice",
            "body": "Well.  The son of a bitch did it.",
            "score": 919,
            "replies": [
                {
                    "author": "csx348",
                    "body": "Have to admit I was skeptical but he followed through",
                    "score": 170,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 153,
                            "replies": [
                                {
                                    "author": "HonkyTonkBluesYEAH",
                                    "body": "If the Republican party expands, one of these two things will happen. Either they will double down on Trump's big government ideas, or they will create big factions in the party. One side being populist / protectionist, while the other is Libertarian and non-interventionist. There is already a strong mandate for a less interventionist foreign policy. Trump ran as a peacemaker and won, the problem is that he is threatening with war right now which would break that promise. There is a mandate for peace but he may end up continuing the same neo-con policies.\n\nRemember, Republicans have voted for more Libertarian sounding candidates before. Reagan used a lot of Libertarian rhetoric, \" The government is not the solution, the government is the problem \" but the problem was that he increased spending instead of cutting spending. He spoke like a Libertarian but acted like a Authoritarian, the mandate was there for more of those  ideas but he just didn't follow through on them unfortunately. We are seeing them talk about the spending problem, but we'll have to see if they actually go through with it (it's a pretty common tactic for both sides to complain about the debt only to expand it). If DOGE can cut a trillion in wasteful government spending, that's a absolute huge win.\n\nTL;DR: There is a pretty strong mandate for Libertarian ideas in America. People have voted for smaller government, gun rights, non-interventionist foreign policy. If you can bring in a charismatic candidate who is ready to actually deliver on those ideas, there will be a big movement for the Libertarians in America.",
                                    "score": 77,
                                    "replies": [
                                        {
                                            "author": "garnorm",
                                            "body": "Well said",
                                            "score": 11,
                                            "replies": []
                                        },
                                        {
                                            "author": "sadson215",
                                            "body": "I'm all for non intervention foreign policy.  However where the plan fails is when we're attacked.  Then we go off kicking a lot of ass and then the military industrial complex starts getting money and the hose of violence can be pointed almost anywhere.\n\nGiven our position if we want to be non interventional we do need to advocate for peace and be serious about it while at the same time make anyone who attacks us pay dearly.  You hit our boat we destroy your Navy.  You kill our soldier we kill your head of state.  That type of shit.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "Warm_Feed8179",
                                            "body": "\"Charismatic\" always seems to be the real key.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "ILIKE2FLYTHINGS",
                                            "body": "\\^Ross\n\nWe need someone charismatic AND motivated to dismantle the state",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Forsaken_Ad7241",
                                            "body": "When you say Trump ran as a peacemaker and won, but now he is threatening war, what exactly do you mean by that? Are you referring to any specific actions or statements?",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "RedStellaSafford",
                                            "body": ">If the Republican party expands, one of these two things will happen. Either they will double down on Trump's big government ideas, or they will create big factions in the party. One side being populist / protectionist, while the other is Libertarian and non-interventionist.\n\nI don't see the latter happening. The GOP under Donald Trump is a cult that has one purpose: Serving and appeasing their orange-faced lord. The \"big tent\" of the GOP is gone.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "rushedone",
                                    "body": "Nah, demand End the Fed at the next LP Convention or no deal. 🤠",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "vonnick",
                                    "body": "lol",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "AlternativeMessage18",
                                    "body": "Isn’t the guy a drug dealer and hired contract killers? Why is he so important to the libertarian movement?",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Beaten_But_Unbowed96",
                                    "body": "Unless he pardons Luigi, DJ means nothing to me other than just another “hot button” topic used by big media to distract from real world issues plaguing the ENTIRE WORLD rather than some petty squabbling between morons.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Upset_Front104",
                                    "body": "I generalize trumps first term as a win up until 2020. I really enjoyed his presidency and policies until his response to Covid. This second term he’s doing all the right things for Americans. For America. And I’m happy with that. He’s already on a good start before presidency with aiding in the ceasefire. And now making EOs to strengthen America. I fucking love it",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "IXPrazor",
                                    "body": "When he prosecutes H clinton, Obama (and others) ends the UA war; with more meaning than this ceasefire.  Along with 5-10 other basic things he promised.  I will on his dick quicker than my grandma gets on you.  Trump is cuming\n\nAmen!",
                                    "score": -1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "trav1829",
                    "body": "This makes me optimistic 👍",
                    "score": 135,
                    "replies": []
                },
                {
                    "author": "Thencewasit",
                    "body": "Man I feel like chanting USA!",
                    "score": 44,
                    "replies": [
                        {
                            "author": "Pristine-Nectarine44",
                            "body": "Happy cake day",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "markadillo",
                    "body": "I was very worried after yesterday and nothing so this is good to hear.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ComfortablyNumb___69",
                    "body": "Who’s Ross? I wiki’d him and it’s just about how he was arrested for selling narcotics on the silk road.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "shabusnelik",
                            "body": "He wasn't selling on silk road. He created and ran the site.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "ComfortablyNumb___69",
                                    "body": "Reddit’s my only social media and I don’t watch cable news, you could be cool about it and fill me in or you could be a dick.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "WizardFumblemore",
                                            "body": "Apparently you’re not cool enough for the club, sorry bud 😎",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "PonyBoyLong",
            "body": "Do Snowden next.",
            "score": 781,
            "replies": [
                {
                    "author": "nekohumin",
                    "body": "And Julian",
                    "score": 379,
                    "replies": [
                        {
                            "author": "epoch-1970-01-01",
                            "body": "Julian is very critical of the Zionist corruption machine in the USA , so if he pardons him that would be a surprise; a good surprise...",
                            "score": 121,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "epoch-1970-01-01",
                                            "body": "This will be the bellwether for true change, if it happens.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "poopooonyou",
                                    "body": "Julian's also not American! How can you be a traitor to a country you're not a citizen of?",
                                    "score": 19,
                                    "replies": []
                                },
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": -9,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "RentsBoy",
                            "body": "Pompeo (Trump's pick) was the one pontificating on assassination attempts of Assange so that would be very, very interesting. Also the media has charged up a lot of negative sentiment with pro-Trump veterans over Assange. \n\nIt's his last term though so who knows what he'll end up deciding to do.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "Please god please let Snowden free, my boy ain't done nothing wrong except snitching on the feds for sucking balls.",
                    "score": 121,
                    "replies": [
                        {
                            "author": "Appropriate_Sale_233",
                            "body": "OG warrior against deep state corruption. Trump oughta love the guy.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Orwells-own",
                            "body": "I could get behind this",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "oMarlow99",
                    "body": "Snowden wouldn't return to the US even with a pardon. Three letter agencies don't operate under the law...",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "cyclorphan",
                    "body": "A Snowden pardon would be amazing. What better blow to the deep state intelligence apparatus than to take their persucatory teeth out?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "s1m0hayha",
                    "body": "Ew, no. He ran to our two biggest adversaries and spilled TS information that will likely lead to future American deaths. He can stay in Russia or enjoy our super max prison. \n\nThis guy was a victim. Snowden isn't, he's a traitor. ",
                    "score": -112,
                    "replies": [
                        {
                            "author": "TravisKOP",
                            "body": "Snowden is the reason we know the NSA spies on American citizens and sacrificed his own liberty to do so. Mans a fuckin hero",
                            "score": 124,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": -14,
                                    "replies": [
                                        {
                                            "author": "Butane9000",
                                            "body": "To give Alex credit he's been slandered to high hell by the deep state where most have accepted the conspiracy theorist label to delegitimize him and anything he says. \n\nThe same can't be said for an actual government agent who leaked the crimes the government was committing and ran for his life.\n\nNo idea on Bill Cooper.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "the_blueberry_funk",
                                                    "body": "Behold a pale horse is a very interesting read",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "CriticalRegrets",
                                                    "body": "Bill Coopper was the OG. I suggest grabbing his book \"Behold a Pale Horse\" and skimming around thru his shortwave radio podcast he ran for years, [Hour of the Time](https://archive.org/details/MiltonWilliamCooper-HourOfTheTime)",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "s1m0hayha",
                                    "body": "If he gives information that gets future soldiers killed, I don't call that a hero. \n\nI call that a traitor and an enemy of the state. ",
                                    "score": -10,
                                    "replies": [
                                        {
                                            "author": "EndDemocracy1",
                                            "body": ">I call that a traitor and an enemy of the state\n\nBased! The founding fathers were traitors and enemies of the British state",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "saggywitchtits",
                                            "body": "We wouldn't have soldiers being killed if we just stopped trying to be the world's police. Bring our boys back home.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "rushedone",
                                            "body": "Found the Fed.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Ya_Boi_Konzon",
                            "body": ">He ran to our two biggest adversaries\n\nWell yeah, cause we tried to lock him up.",
                            "score": 73,
                            "replies": [
                                {
                                    "author": "s1m0hayha",
                                    "body": "Still doesn't justify giving intel to our enemies that will get Americans killed. \n\nHe's a traitor. Only one thing should happen to traitors, and it ain't breathing oxygen. ",
                                    "score": -13,
                                    "replies": [
                                        {
                                            "author": "Ya_Boi_Konzon",
                                            "body": "You can't betray those who consider you an enemy.\n\nNot that Russia has to be our enemy either.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Wizard_bonk",
                            "body": "“He ran to our adversaries”\n\nYeah. Because the US government was gonna kill him for spilling the beans that the government was spying on all of America.",
                            "score": 47,
                            "replies": [
                                {
                                    "author": "s1m0hayha",
                                    "body": "So you justify giving information that will lead to young American soldiers dying is ok bc he told the American people our intelligence agencies were collecting on Americans?\n\nHe should have put out the info and taken the consequences. Within a decade he would have been pardoned. \n\nBut he went to China and Russia and told them way more than just our spying. \n\nHe's a modern day Benedict Arnold. Should he find himself at the end of a rope then so be it. ",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "author": "NaturalCarob5611",
                                            "body": "> He should have put out the info and taken the consequences. Within a decade he would have been pardoned. \n\nBullshit. He would have been \"killed himself\" in jail before he ever got to trial. He did what he had to do when a corrupt government came after him for exposing their corruption. I'm not going to shed a tear for the agents of that corrupt government who got hurt in the process.",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "Wizard_bonk",
                                            "body": "Lick boot harder. Seriously. The man points out that the US government is corrupt. And you think that'll be solved by him being given a life sentence. Mind you. Treason is punishable by death. But his \"treason\" was proving that our government was acting unconstitutionally. Are you the type of person to say \"George washington shouldve just licked boot and ate the taxes\". Wtf",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "MichaelSquare",
                            "body": "Feel like you're confusing Bradley/Chelsea Manning with Snowden.",
                            "score": 33,
                            "replies": [
                                {
                                    "author": "s1m0hayha",
                                    "body": "No, he should still be in prison as well. ",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "AlphaTangoFoxtrt",
                            "body": "He exposed the governments unconstitutional mass surveillance network. The man is a hero.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "thetechnolibertarian",
                            "body": "Man are you on drugs?",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Anonymous_Fishy",
                            "body": "Idk why you’re getting downvoted. His leaks DID lead to americans overseas that were undercover getting executed. He didn’t just choose to leak the NSA surveillance program but a ton of other TS information that lead to exceptionally grave damage to the United States.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "Julian Assange was behind the bullshit Russian propaganda that got Trump elected in 2016 too...no one ever reads the Mueller report, it's quite eye opening. I find it kind of funny that everything always has ties to Russia...🤷",
                            "score": -4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Nalsa-",
            "body": "As a frequent user of silk road back in the day. Happy for the guy.",
            "score": 140,
            "replies": [
                {
                    "author": "Low-Acanthaceae-5801",
                    "body": "I hope he brings it back tbh 🤣🤣",
                    "score": 30,
                    "replies": [
                        {
                            "author": "TheIronGnat",
                            "body": "That would be some madlad shit, and truly hilarious.",
                            "score": 34,
                            "replies": []
                        },
                        {
                            "author": "ThiqSaban",
                            "body": "theres dozens of alternatives currently doing better than SR was. Ross can retire",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "The_Bourgeoisie_",
                            "body": "😂",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Joe_mother124",
                    "body": "Genuine question, didn’t he try to murder people? Why do you guys want him pardoned?\n\nUnless I misunderstand or I’m wrong. I genuinely don’t know",
                    "score": 3,
                    "replies": [
                        {
                            "author": "ThiqSaban",
                            "body": "he was never charged for that, i believe that was speculation or hearsay",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "ScabberDabber25",
                                    "body": "He did do it. He wasn’t charged for it though because it was corrupted officer who were pretending to be Hitmen for him so I think entrapment applied though (though the officers weren’t using this to imprison him they were just I pocketing the money)",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Creamofwheatski",
                    "body": "He's rich and free, hes very lucky. Why freeing this guy who enabled sex and weapons traffickers to sell their wares is deserving of a pardon is beyond me. If he stopped at the drugs Id have no problems. But silk road enabled all sorts of criminals.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "ScabberDabber25",
                            "body": "Another thing to remember is that the argument that it’s “Consenting Adults selling drugs to eachother” isn’t really valid because the fact that the buying and selling happened anonymously means that a lot of customers where probably kids",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "z0uary",
                                    "body": "Its the parents job",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "WoollenMercury",
                                            "body": "Dude Shut up with that Parents cant moniter their Kids 24/7 365 days \n\ni hate this argument Cause sure you can watch your kids but what happens if someone else's parents dont?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "z0uary",
                                                    "body": "Dont have kids",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "WoollenMercury",
                                                            "body": "Dude You Know thats.... not how things work \n\nWhy do you think so many People are Stupid nowadays? Its cause people never actually cared about whats proven to sabotage Lives",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "ScabberDabber25",
                                                            "body": "If we make it ever harder to have kids we’ll exacerbate the issue of depopulation",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Bigleyp",
                                                    "body": "You can put parental controls on devices. By the time they circumvent it, they are gonna be mature enough to know what they are consenting to.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "WoollenMercury",
                                                            "body": "Your Not Reading What im Writing \n\neven if you do What happens if your kid is friends with someone who's parents Doesnt",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "blacklipsmatter",
            "body": "https://i.redd.it/25v7jmu82gee1.gif",
            "score": 116,
            "replies": []
        },
        {
            "author": "RedditorSinceTomorro",
            "body": "I didn’t think this would happen for decades when we got a more progressive president. Insane that he actually did it on “day one”",
            "score": 173,
            "replies": [
                {
                    "author": "SanduskyTicklers",
                    "body": "*tips glasses* well akshually it took him until hour thirty of his presidency. Complete and utter campaign failure",
                    "score": 58,
                    "replies": [
                        {
                            "author": "cttime",
                            "body": "First full day I guess 🤣",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "PangeaDev",
                            "body": "apt description of the average redditor",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "OwlRevolutionary1776",
                    "body": "Yet the “progressive” “tolerant” leftist are screaming that this is a bad thing. That Trump freed a man who brought in the most fentanyl ever. They are truly mentally ill and also a little regarded. The CIA is the kingpin of drug traffickers.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "webguynd",
                            "body": "What's interesting to me is to witness the cultural zeitgeist change. Back during the time of silk road, and his arrest, I distinctly remember more libertarian ideals being popular, even in more leftist circles. \n\nI grew up in and around tech, and freedom was king in the circles I participated in - open source, open hardware, free software movements, free speech for all was still important, etc.\n\nI can't pinpoint exactly when it changed, but within the last 5ish years for sure, the popular opinion has shifted drastically toward authoritarianism on both sides. Meritocracy was no longer viewed as a good thing, free speech was no longer good if your speech went against whatever that particular community held as important (whatever happened to \"I may not agree with what you say, but I'll defend to the death your right to say it.\"), and certain freedoms were seen as harmful instead of freedom being the goal.\n\nI'm as far from \"conservative\" as you can get, yet my views also aren't popular in the leftist zeitgeist now, even though they used to be. It's been interesting to witness the change, and I often wonder what the catalyst was that caused it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "nekohumin",
                    "body": "Reagan would be rolling in his grave to see his party is now the party of pardoning those scary drug traffickers",
                    "score": -9,
                    "replies": [
                        {
                            "author": "ShichonPapa",
                            "body": "Ross was not a drug trafficker.  He got fucked for literally nothing.  All he did was create and maintain a site.",
                            "score": 45,
                            "replies": [
                                {
                                    "author": "nekohumin",
                                    "body": "It wasn’t for nothing. It was so the vindictive shitheads could make an example out of him to advance their war on drugs",
                                    "score": 27,
                                    "replies": [
                                        {
                                            "author": "ShichonPapa",
                                            "body": "Then they took his $3bn in bitcoin too.  It is literally insane.",
                                            "score": 28,
                                            "replies": []
                                        },
                                        {
                                            "author": "ShichonPapa",
                                            "body": "Yep.  Fucking ridiculous",
                                            "score": 8,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "None",
                                    "body": "I mean...there was a pending case in MD that was dropped when he was convicted that included a murder for hire charge that was pretty gnarly on the details. I'm all for his pardon but let's not act like he wasn't breaking laws....",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "ShichonPapa",
                                            "body": "Pretty sure that was debunked and the victim is and remains a Ross supporter.",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "It wasn't debunked it was dropped when the other case convicted...the guys he set up to murder someone were corrupt federal agents who got in trouble stealing Bitcoin while working the case..\n\n\n[There are transcripts of him giving up the name and address of a guy with a family though 😂](https://www.wired.com/2015/02/read-transcript-silk-roads-boss-ordering-5-assassinations/)",
                                                    "score": 12,
                                                    "replies": [
                                                        {
                                                            "author": "ShichonPapa",
                                                            "body": "Well, the more you learn!  Thanks for this!",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "It's all out there to find and form an opinion on before blindly supporting something because \"libertarianism is good!\"...not trying to throw shade, just wish more people took an interest in the facts instead of letting headlines dictate their opinions. \n\n\nYou are welcome though! There is just a lot of \"pro-trump\" stuff going around and I refuse to glaze the dude blindly..🤷",
                                                                    "score": 9,
                                                                    "replies": [
                                                                        {
                                                                            "author": "robtimist",
                                                                            "body": "Thank you for your comments",
                                                                            "score": 5,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "ShichonPapa",
                                                                            "body": "I still agree with his pardoning.  Two life sentences and 40 years when murderers and rapists don’t always get that is unacceptable.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "None",
                                                                                    "body": "Brother...there are so many unacceptable sentences out there, innocent folks sitting in prison, violent offenders get released to rat out other violent offenders to keep the prosecutor's record of conviction looking good, sexual predators and child diddlers get some of the lightest jail sentences...white collar crimes serve virtually no time but someone busted selling LSD at a grateful Dead concert does 20+ years...",
                                                                                    "score": 7,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "not_today_thank",
                            "body": "A younger Joe Biden would be shocked to see the current democrar party too.  He was pretty much the Senate leader of the drug war in the 70s, 80s, and 90s.  He was a sponser of basically all the major crime bills and civil asset forfeiture bills.  He pushed Reagan to increase drug related incarceration.",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "nekohumin",
                                    "body": "And here he is pardoning a bunch of drug offenders as president. Times have changed",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "xr650r_",
                            "body": "\"Ahhh look over there those adults are having consensual exchange of goods that aren't approved! Quick go shoot them or something! We can't let this happen!\"-Reagan, Probably",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "legal_opium",
                                    "body": "Wait til you hear the tapes where nixon wanted to create a bio virus to attack poppy plants in foreign countries",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "the_seed",
            "body": "Now THAT'S a win!!!",
            "score": 299,
            "replies": [
                {
                    "author": "1Rab",
                    "body": "Ross Ulbricht was a not a Luigi. He was a net negative on society. Silk Road ruined more lives than it helped.\n\nBlack men have been jailed for years for weed or crack possession, yet this guy can create the largest digital drug empire in history and get away with it. This sends a horrible message and shows your priorities. Fight for average people.",
                    "score": -21,
                    "replies": [
                        {
                            "author": "Usykgoat62",
                            "body": "He spent over a decade in person. I wouldn’t call that getting away with it.",
                            "score": 62,
                            "replies": []
                        },
                        {
                            "author": "Whitezombie65",
                            "body": "Yeah and those \"black men\" should be out of prison too, what point are you making?",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "ChinoMaynardHomme",
                            "body": "Dude just did 11 years, he didn’t ’get away’ with anything. \n\nRoss being jailed for facilitating drug purchases and black men being jailed for weed or crack possession are both shitty things. Why make this about race? \n\nAs a libertarian, I believe people should be able to put whatever they want in their bodies so long as they don’t harm others.",
                            "score": 27,
                            "replies": []
                        },
                        {
                            "author": "ly5ergic",
                            "body": "Or maybe people shouldn't have been thrown in prison to begin with for drug possession?",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "TJJ97",
                            "body": "He created a truly free marketplace",
                            "score": 52,
                            "replies": [
                                {
                                    "author": "Heraldic4",
                                    "body": "The convenience of buying people couldn’t be beat. Hopefully the price goes back down",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "saggywitchtits",
                            "body": "Ross wasn't selling the drugs, he wasn't buying the drugs. Your argument is the same as if a landlord was responsible for a tenant growing and selling weed on their property.",
                            "score": 32,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": -9,
                                    "replies": [
                                        {
                                            "author": "saggywitchtits",
                                            "body": "It's illegal gambling when the government doesn't get it's cut.",
                                            "score": 14,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "T_nooky",
                            "body": "He didn’t get away with anything, 11 years in prison.",
                            "score": 14,
                            "replies": []
                        },
                        {
                            "author": "CriticalRegrets",
                            "body": "Any overdoses caused by goods sold on Silk Road are dwarfed daily by what the FDA allows big food and big pharama to get away with.\n\nSilk Road is hardly a blip on the graph compared to the other.",
                            "score": 24,
                            "replies": []
                        },
                        {
                            "author": "Ok-Block-6344",
                            "body": "Are you saying Luigi was not net negative on society?",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "matthewjohn777",
                            "body": "Are you seriously arguing that someone who committed murder is a net positive on society?\n\nReassess your priorities. Unreal",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "Ok_Elevator_7352",
                            "body": "Shut up",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "luckac69",
                            "body": "Luigi wasn’t a net negative on society?",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "DisorientedPanda",
                                    "body": "First degree murder good when you don’t like person!",
                                    "score": 20,
                                    "replies": [
                                        {
                                            "author": "According_Candy3510",
                                            "body": "Welcome to the Democratic Party!",
                                            "score": 8,
                                            "replies": []
                                        },
                                        {
                                            "author": "Enough_Wallaby7064",
                                            "body": "*Hillary gives side eye*",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "mainlydank",
                            "body": "I think your in the wrong sub buddy if you think Ross was a negative in society or silk road ruined lives.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "ackbladder_",
                            "body": "Even if someone thinks drugs should be legal they should wince at the double standard. If the life sentences are fake then they should be reviewed by the courts and thrown out but he still facilitated a chunk of the drug trade which trump just declared another war on.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Additional-Fun5499",
                            "body": "Trump already pardoned all the black guys his first term for being affected by the Democrat’s crime bill. What do you want bro?",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "According_Candy3510",
                            "body": "Luigi is a violent murderer that should never see daylight again. Ross created a marketplace that aided the sale of illegal substances and has already spent 10 years in prison.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "StunningIgnorance",
                            "body": "stupid take. the actual drug dealers that sold drugs on silk road got less time than Ross. They've been out of prison for years.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "avd51133333",
                            "body": "Youre right he wasnt a “Luigi” (murderer). He is much more deserving of a pardon than that dumbass",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ClapDemCheeks1",
                            "body": "Lol acting like Luigi was a net positive. In complete violation of the NAP. Smooth brain over here.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "hexmasx",
                            "body": "It objectively reduced the amount of people who were arrested or killed as a result of the illicit drugs trade and war on drugs. Made it a lot safer for the people involved. There were guides on safe drug usage, a review system, and guides on how to safely transport drugs. He set it up for moral reasons in the first place. Like he was on the side of those black men you speak of and others who are victims of the war on drugs.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -1,
                    "replies": [
                        {
                            "author": "yansen92",
                            "body": "I'm 12 and what is this",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -6,
                    "replies": []
                }
            ]
        },
        {
            "author": "itsmontoya",
            "body": "As a Trump hater.. I'm impressed. Now give us a Snowden pardon and I'll keep my damn mouth shut.",
            "score": 18,
            "replies": [
                {
                    "author": "Imaginary-Win9217",
                    "body": "Right there with ya!",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "TheMcWhopper",
                    "body": "If he pardons Snowden, would you be a trump lover?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "itsmontoya",
                            "body": "No, but I'd at least be able to defend some of his actions. It would take A LOT for me to love a President.",
                            "score": 13,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Historical-Flamingo6",
                    "body": "how about STFU period.",
                    "score": -3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Wide_Application",
            "body": "Finally, a big bipartisan win.",
            "score": 99,
            "replies": [
                {
                    "author": "Pineapple_Sasa",
                    "body": "I’ve seen people on all sides of the political spectrum support this. It’s a big win for not only Ross Ulbricht but also the Overton Window.",
                    "score": 68,
                    "replies": [
                        {
                            "author": "Wide_Application",
                            "body": "honestly anyone who doesn't support this is either incredibly misinformed or a fed bootlicker.",
                            "score": 43,
                            "replies": [
                                {
                                    "author": "vlasp01",
                                    "body": "Or just doesn’t like people who attempt to hire hitmen…",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Wide_Application",
                                            "body": "He almost certainly didn't though.  Multiple feds had admin privileges to the SR and were controlling DPRs account.  There was an enormous amount of fuckery going on by corrupt feds behind the scenes.\n\nThe guy he \"hired\" to kill has also come out saying it wasn't Ross.\n\n[https://freeross.org/false-allegations/](https://freeross.org/false-allegations/)\n\nTwo of those feds were charged with stealing and laundering Millions in bitcoin.\n\n[https://freeross.org/corruption/](https://freeross.org/corruption/)",
                                            "score": 49,
                                            "replies": [
                                                {
                                                    "author": "RentsBoy",
                                                    "body": "Free Ross project saying he didn't actually try to kill the former vendor AND scammer? Wow what a shocker. \n\nThose messages were dated much earlier before his capture by law enforcement. There were absolutely dirty feds that had dollar signs in their eyes, that's not shocking. Is there better evidence you can show that the feds were the ones who sent those messages rather than Ulbricht's defense that there were many different Dread Pirate Roberts? \n\nWe don't need to paint Ulbricht as a saint who made no ugly mistakes in order to agree that this pardon is an overall good and the Silk Road was an overall good for harm reduction.\n\nEdit: the former vendor saying he didn't do it is definitely his own speculation, and it seems clear that the feds had control of the former vendors devices after he got involved with the feds to set-up the fake murder. The evidence they had against Ulbricht as well as the enormity of the drug conspiracy charges was enough to drop what could've probably been argued as entrapment\n\nAlso I don't even think this mentions the second murder attempt against the Canadian former vendor which was set up to scam Ulbricht",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "TrainWreck43",
                                                            "body": "Why is this a good thing? It feels insane that a president would pardon a drug kingpin.",
                                                            "score": -1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "redroverster",
                                                    "body": "Ulbricht literally had a photo of a supposed dead guy on his laptop. Was that planted?",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Sarkoon",
                                            "body": "He was never charged or convicted of anything related to any supposed hitman. Innocent until proven guilty, so he should be free if that's your only issue with his release.",
                                            "score": 29,
                                            "replies": [
                                                {
                                                    "author": "John_Galtt",
                                                    "body": "Not only that, but this was the most serious allegation made against him.  10 years jail is standard for murder-for-hire schemes where no one is murdered",
                                                    "score": 15,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "bruticuslee",
                    "body": "I'm honestly confused how this is a bipartisan win? Biden could have done this 2 days ago along with the over 8000+ he granted.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "PangeaDev",
                    "body": "I bet your ass no democrat redditeurs will talk about it",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "masterwad",
                    "body": "Ross was a drug dealer on the dark web who wanted to put out hits on people. But Mexican cartels are “terrorist” organizations? Trump can’t have it both ways. Wait till Trump finds out if “fentanol” (that’s how Republicans pronounce it, it’s fentanyl) was sold on Ross’s marketplace.",
                    "score": -6,
                    "replies": [
                        {
                            "author": "StunningIgnorance",
                            "body": "oh golly what do you think he'll do when he finds out??",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "NeonxGone",
            "body": "Promises made, promises kept.",
            "score": 399,
            "replies": [
                {
                    "author": "Apprehensive-Catch31",
                    "body": "People on reddit act like what he’s all doing is a complete surprise, yet he’s just doing what he said he’d do and why people voted for him",
                    "score": 138,
                    "replies": [
                        {
                            "author": "rai1fan",
                            "body": "Politicians be lying usually",
                            "score": 143,
                            "replies": [
                                {
                                    "author": "Apprehensive-Catch31",
                                    "body": "True shit",
                                    "score": 56,
                                    "replies": []
                                },
                                {
                                    "author": "deathnutz",
                                    "body": "Trump isn’t a professional politician.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "DontCopeAndSeethe",
                                            "body": "And there in lies the reason for the extreme attacks on him. \n\nFor a carrier politician actual action is the worst possible option out of every option, because that means they are going to be accountable for something if it goes wrong..\n\nTrump scares the shit out of them, cause the status quo is not sustainable anymore and a lot of actions needs to be taken to course correct.",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "StunningIgnorance",
                                                    "body": "i think this is 100% true and something i've told other people. Politicans hate Trump because he's not part of their little group, yet he showed up and kicked their asses. Recall that even Republicans hated Trump at first (and then fell in line)",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "DontCopeAndSeethe",
                                                            "body": "I see Trump as largely outside the kinda dumb lens of left and right, what ever it takes to be great again using common sense. \n\nsome stuff from the right, a bit from the left, and a pinch from the middle moderates. \n\nAnd that one of my personal belief, that the middle is most often the right way, to much to the right or left and you end up with niche policy doing no favour for the majority that needs it.\n\nCome to think of it, I should maybe stay on this sub some more, seems like I found a place with a lot of like minded individuals, rare on reddit.\n\ndid the quick test in the sidebar before pressing post, yeah Im gonna stay.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Maltoron",
                                                                    "body": "Now that the DNC shills have ran out of campaign money it's probably better again.  Place was raided to the gills with naysayers for the last year or so.  I'm probably coming back as well.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "DontCopeAndSeethe",
                                                                            "body": "The funny thing is that their so blatant about it too, just around when the election started to kick off, boom, 5-10 extremely low populated sub suddenly on the front page of /all everyday with the same narratives at the same time. \n\nWatching reddit switch in real time after biden dropped out and proclaiming the worst 2020 dnc candidate the almighty saviour was something. \n\nI do hope Trump gets around to reddit, its the only one I use because it still kinda facilitate old school forum style discussions, at least when i joined here some 10+ years ago.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Maltoron",
                                                                                    "body": "They were swarming here since this is a political sub with a mix of die-hard Libertarian or bust voters and libertarian-leaning moderates/strategic voters.  When the Libertarian party fielded Chase Oliver, I'm fairly sure that the DNC realized he's such a lame duck that a ton of the more strategic voters were unlikely to \"throw away their vote\" and would instead divert to Trump. So any time anyone brought up voting for him for any reason, they got absolutely *dogpiled* in the comments.  Very grating, and getting into slap-fights every day was a greater drain on my time than I felt was allowed (beyond the normal Reddit waste).\n\nTrump won't get around to the majority of Reddit.  Reddit has been taken over by leftist propagandists in the form of heavy handed moderators dominating the vast majority of the large subs.  There's a couple moderately safe havens from the greater ecosystem, but they're all but guaranteed to never become the norm so long as Reddit admins/powermods are on the other side holding the levers to power.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "DontCopeAndSeethe",
                                                                                            "body": "Interesting, I think that was one of the main points of the swarm, tire people until we simply dont want to waste our time anymore and then they control the narrative, annoyingly effective.\n\nWhen I say get around to, it would be quite easy, just do as biden, throw the government machine at reddit until its owners comply. But in this case its just about bringing back normalcy and not creating the same echo chamber on the opposite side of the spectrum(hopefully, and x and now meta does give me some hope). \n\nA quick brainstorm, bring back the old algorithm before /theDonald broke it, one upvote is one upvote, remove all the insane mods and just keep keeping an eye on the extremist/radical ones, and some more minor stuff, to me its simply a matter of will of the owners here, so Trump just gotta play hardball.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Hot_Most5332",
                                    "body": "I mean this costs him nothing, so it shouldn’t be surprising that he did it.",
                                    "score": 22,
                                    "replies": [
                                        {
                                            "author": "MiltonFury",
                                            "body": "You forget the battle to get here. It nearly cost him his life.",
                                            "score": 27,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "sadson215",
                                    "body": "I didn't vote for Trump in 2016 or 2020... But after we actually pulled out of Afghanistan under Biden I was amazed as much of a disaster it was.  \n\nI didn't care about his wall but I genuinely appreciated the fact he shut down the government for a long damn time to get funding for his promise.\n\nI also liked the fact that he put the word out that you're fucked if you hurt Americans in the middle east then followed through.\n\nI'm happy with the progress in Gaza so far.  Yeah he said he's going to unleash all hell in the middle east but that's really what would have had to happen.  It's basically bully tactics.  \n\nNow I'm looking forward to see how he handles the border and Ukraine.\n\nI'm fine with open borders after we eliminate public schools and the rest of the welfare state as well as have regulated legalized drugs that aren't taxed to shit.  This would diminish the cartels to basically nothing.  I don't see any USSF intervention having a lasting impact on the cartels.  Even if successful new ones will rise so long as there remains an avenue for them to make money in the US",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "free_is_free76",
                            "body": "I'm surprised that you're not surprised that a politician kept their promise",
                            "score": 41,
                            "replies": [
                                {
                                    "author": "VeterinarianCold7119",
                                    "body": "As an outsider looking in, its going to be hilarious if trump does all the stuff he said he will and goes down as the only politician to do so. Haha",
                                    "score": 43,
                                    "replies": [
                                        {
                                            "author": "yancey2112",
                                            "body": "I mean you’re describing his first term here too",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "JustanotherTechSuppo",
                                                    "body": "Don't forget he lied about building a full wall. /S",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "International_Newt17",
                            "body": "The average reddit user would rather eat glass than say anything positive about Trump.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "DrCarter90",
                            "body": "lol the bias is crazy",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "KingGorilla",
                            "body": "I'm worried he's actually gonna pull off the tariffs",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "-Powdered-Toast-",
                                    "body": "I still think it’s a negotiating tactic. Which ultimately could turn into a game of chicken. But I think if it comes to that he will have the upper hand once it begins to cut into the bottom line. Might get a little worse before it gets better but I’m cautiously optimistic, and very interested to see how it plays out.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "sonofamusket",
                                            "body": "It very much is,  he even talks about it in one of his books. Make a big show and then be more sane when you actually negotiate.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "Jest_Dont-Panic_42",
                                                    "body": "Fr, so many don’t seem to understand this. It’s all a game of chess to him and grandiose banter is just a tactic.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "International_Newt17",
                            "body": "The average reddit user would rather eat glass than say anything positive about Trump.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Morten14",
                            "body": "The thing is, Trump usually don't do what he says he'll do. So of course people are surprised.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "soulself",
                            "body": "No one is surprised. They are just pissed that he is doing what he said he would do.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Son_of_Sophroniscus",
                    "body": "That appears to be the case.",
                    "score": 52,
                    "replies": []
                },
                {
                    "author": "MichaelSquare",
                    "body": "But he said day 1 and this was day 2. Promise broken /s",
                    "score": 57,
                    "replies": [
                        {
                            "author": "Butane9000",
                            "body": "I mean the inauguration took up quite a bit of the day. A whole lot of pomp and waste we could cut.",
                            "score": 15,
                            "replies": []
                        },
                        {
                            "author": "SavageCaveman13",
                            "body": "He did say day one, which could be counted as today since it's the 1st full day. Yesterday would be day zero.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Lanky-Strike3343",
                            "body": "Well first full day so there's that",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "GeneticsGuy",
                                    "body": "Lmao, that's right, it was within 24hrs. He got appointed President at 1pm, and word of the pardon being issued came early this morning :)",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "MattytheWireGuy",
                            "body": "Well if those commie journos didnt ask him dumb fuck questions every 10 seconds, he might have been able to get to it sooner.",
                            "score": 47,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "NichS144",
                    "body": "Half his promises kept.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "IXPrazor",
                            "body": "So he made 4 promise?  1 made 1 not.  2 more?  Go Trumpy Go baby!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "indyjones8",
                    "body": "He also promised to put a libertarian in a cabinet position, but did not. So he's 1/2. For a politician that's not bad.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "VFT202",
                            "body": "If they nominated him and they didn’t ",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "indyjones8",
                                    "body": "Hmm are you sure? Did that also apply to the Ross promise?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Sun_Bro96",
                            "body": "Tbf he does have RFK in there who is the best thing to a libertarian without actually being one.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Additional-Fun5499",
                                            "body": "Marco Rubio being more libertarian than RFK?!! You lost all credibility with that statement.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Carlose175",
            "body": "This is good news. Not a fan with everything trump is doing, but some stuff is good too. Glad this injustice has been corrected.",
            "score": 62,
            "replies": [
                {
                    "author": "Bigtexindy",
                    "body": "He is running about 80% positive with me a moment.  After the shit show of last 4 years I'll take it",
                    "score": 10,
                    "replies": [
                        {
                            "author": "blacklipsmatter",
                            "body": "After all shit he has been through, seen the evil of the deep state, and no longer has to worry about trying to make a comeback, he's going to go full throttle with everything he said he would do, this as a great example.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "1hero_no_cape",
            "body": "Now, how about Edward Snowden?",
            "score": 41,
            "replies": [
                {
                    "author": "Automatic-Mountain45",
                    "body": "he never promised that.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "CityDweller19",
                    "body": "I think he will. Ulbricht’s pardon gives him an opening to do that, he practically has the same justification “Snowden is a victim for exposing the same weaponized federal government that has gone after me” spiel ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Funny_Window7344",
                    "body": "^^^",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "HooiserBall",
            "body": "Yes!",
            "score": 45,
            "replies": []
        },
        {
            "author": "luxurious-tar-gz",
            "body": "I thought there would be no chance. And yet here we are.",
            "score": 12,
            "replies": []
        },
        {
            "author": "Ranger89P13",
            "body": "Wow! Actually agreeing with a move a by Trump",
            "score": 23,
            "replies": []
        },
        {
            "author": "movieguy2004",
            "body": "![gif](giphy|11ISwbgCxEzMyY)",
            "score": 11,
            "replies": []
        },
        {
            "author": "matthewjohn777",
            "body": "There will still be never trumpers who come to this thread and say how this is not a win.\n\nThose people are blinded by emotion.\n\nA huge, resounding W",
            "score": 240,
            "replies": [
                {
                    "author": "NeonxGone",
                    "body": "“Win” or “no win”, it was just the right thing to do. Politics be damned.",
                    "score": 110,
                    "replies": [
                        {
                            "author": "LikesBlueberriesALot",
                            "body": "This. I’m a never-trumper and am pretty far on the left. That said, I’m very glad he did this.",
                            "score": 40,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DiscontinuTheLithium",
                    "body": "Not a trump fan at all but this is great news. Ross deserved it no matter who issues the pardon.",
                    "score": 29,
                    "replies": []
                },
                {
                    "author": "nekohumin",
                    "body": "Ross was locked up over bullshit long before Trump even came to the political scene. Never expected him to be pardoned at all, let alone in only about a decade by some random celebrity like Donald Trump who wasn’t even libertarian",
                    "score": 53,
                    "replies": [
                        {
                            "author": "WaltKerman",
                            "body": "There are a lot of libertarians involved in the current Trump campaign",
                            "score": 22,
                            "replies": []
                        },
                        {
                            "author": "MattytheWireGuy",
                            "body": "Trump is small L libertatrian.  Hes become more so as he was attacked by that huge government machine.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "ExtensionCake6",
                                    "body": "Wouldn’t call him a Libertarian per say, more of a national populist. He’s definitely not a full blown far-right conservative like most of the left claims.\nI’d actually say he’s the least conservative Republican president ever especially when it comes to social issues like gay marriage and abortion, but considering he still likes to spend money on things that we shouldn’t be spending money on, I wouldn’t call him a Libertarian either",
                                    "score": 29,
                                    "replies": [
                                        {
                                            "author": "MattytheWireGuy",
                                            "body": "I called him small L for a reason, by the time you get to actual Libertarian, youre just in denial of being an anarchist.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "sadson215",
                                                    "body": "Small l libertarian already has a meaning.  It means you're libertarian proper as you said in denial of being an anarchist but have nothing to do with the big L which is the Libertarian party.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "MattytheWireGuy",
                                                            "body": "Then we have different terms.  Rand Paul is small L, Ron is big L.  The party itself is cucked, Im talking about actual doctrine and ideology.",
                                                            "score": 4,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "TrainWreck43",
                                            "body": "He literally got Roe v Wade ended!! How can you say that?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "ExtensionCake6",
                                                    "body": "Roe v Wade is not a ban on abortion, it puts the power in the hands of the states which is a populist stance, not a conservative one \nA real, old fashioned conservative would’ve overturned Roe and then introduced a law to ban abortion nationwide\n\n\nHe’s stated explicitly that he believes in the exceptions which hardcore conservatives do not",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "thatguyyoustrawman",
                                            "body": "I think actually the left would agree with you.\n\nHe is the least republican president but republicans now are sort of flip floppy on stances and beliefs. Its why there was a split between older conservatives and Maga.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Union_5-3992",
                    "body": "I've never been a Trump guy but good news is good news.",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "libertinian",
                    "body": "Not a Trump fan for many reasons, but big kudos to him for this. This is a promise he kept. And of course I'll continue to call him out for all the other anti-freedom policies he pursues",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "pancada_",
                    "body": "Orange man bad but huge news \n\nSo happy for ross",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Whiplash50",
                    "body": "Thought they were all ANTIFA? Why’d he free the provocateurs!?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ninja8ball",
                    "body": "It's can be a \"W\" and Trump is still a fascist.",
                    "score": -12,
                    "replies": [
                        {
                            "author": "matthewjohn777",
                            "body": "Hate to break it to you, but 99% of all people think you’re a huge loser. They most likely bite their tongue and don’t say it. But in 2025.. *still* saying trump is a fascist, I can promise you people roll their eyes and make fun of you behind your back. Hopefully this is a wake up call",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "cows-go-moo19",
                            "body": "Trump is not a fascist",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "yoemejay",
                                    "body": "He is.",
                                    "score": -20,
                                    "replies": [
                                        {
                                            "author": "cows-go-moo19",
                                            "body": "“If I label him what they labeled the nazis, people won’t vote for him! I’m smart!” 🤓\n\nHe’s an open Zionist with a Jewish daughter, who is in bed with Netanyahu, the president of Israel. \n\nGet smarter",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "author": "MainSqueeeZ",
                                                    "body": "Got it. He just sleeps with fascists, isn't one himself.",
                                                    "score": -9,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Marlin_Grin",
                                                    "body": "Bruh, the feds went through Melania’s underwear drawer and look what he’s about to do to them. I’d leave her out of this if I were you.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "airassault_tanker",
                    "body": "It's a lower case w at best.",
                    "score": -33,
                    "replies": []
                },
                {
                    "author": "Chesus42",
                    "body": "Not to Ross, his family, and those who have supporting his release.",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "airassault_tanker",
                    "body": "Oops. I misread.  For some reason, I was thinking matthewjohn777 was referring to voting Trump into office. I'll take my downvotes and leave my other comment as a testament to my stupidity and inability to read.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "Chesus42",
                    "body": "Honest mistake. A Trump win is exceptionally lower case indeed, but he did get this one right at least.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "curtainedcurtail",
            "body": "Nice 👍",
            "score": 27,
            "replies": []
        },
        {
            "author": "TheWastelandWizard",
            "body": "Credit where it's due, I'm surprised he followed through. Congrats to Ross and his family, I hope they live a happy and prosperous life.",
            "score": 30,
            "replies": []
        },
        {
            "author": "Flying_Aardvark85",
            "body": "Great success!",
            "score": 19,
            "replies": []
        },
        {
            "author": "theworldsaplayground",
            "body": "You fucking legend. ",
            "score": 20,
            "replies": []
        },
        {
            "author": "BaptizedByBitches",
            "body": "DGAF who did it. Glad he’s finally free.",
            "score": 19,
            "replies": [
                {
                    "author": "OratoryGorgias",
                    "body": "It should matter who did it",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "askalmeqt98533",
                    "body": "Trump did it homie. Give some cred.",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "RunAndPunchFlamingo",
            "body": "Really happy for Ross, and I’m glad Trump followed through on this.",
            "score": 14,
            "replies": []
        },
        {
            "author": "Sun_Bro96",
            "body": "Of all the ridiculous shit he said he would do, this was the most unlikely thing. Massive W",
            "score": 7,
            "replies": []
        },
        {
            "author": "Cuz1",
            "body": "I honestly never saw this happening. Absolutely nuts but such a big win",
            "score": 13,
            "replies": []
        },
        {
            "author": "aibnsamin1",
            "body": "The fact that Trump has had to pardon so many people shows how broken the Justice system is. It's time to change it.",
            "score": 31,
            "replies": [
                {
                    "author": "KittenFondler",
                    "body": "Yeah the two tiered system really is broken. Good thing the felon will fix it 😂",
                    "score": 1,
                    "replies": [
                        {
                            "author": "aibnsamin1",
                            "body": "Right now he's just letting his friends out. Change has to be systematic and include poor people",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "CouldofhadRonPaul",
            "body": "Y’all give Angela her dues. This is the LPs biggest accomplishment ever.",
            "score": 30,
            "replies": [
                {
                    "author": "Marlin_Grin",
                    "body": "…did they do something here?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "CouldofhadRonPaul",
                            "body": "Yes, this doesn’t happen if she didn’t negotiate with the Trump campaign when he came to the LP convention. She’s the one who brought this to Trumps attention and set it as a major issue for him to get the libertarian vote.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "Enough_Wallaby7064",
                                    "body": "I remember the LP convention booing Trump.\n\nWhen someone who actually stood a chance to win an election came to speak and listen to us,  we couldn't get our head out of our own ass.\n\nGlad he followed through none the less",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Stoic-Spectre",
            "body": "W! Let’s fucking go America 🥳",
            "score": 14,
            "replies": []
        },
        {
            "author": "cwtlegend",
            "body": "I can't believe he actually did it! That's amazing",
            "score": 10,
            "replies": []
        },
        {
            "author": "Conservatarian76",
            "body": "A glorious day! Thank you Trump!",
            "score": 10,
            "replies": []
        },
        {
            "author": "ecleipsis",
            "body": "This is great now but saying the libertarian movement supported him strongly is a stretch. He was literally booed when he came to speak at the national convention",
            "score": 64,
            "replies": [
                {
                    "author": "Solar_Nebula",
                    "body": "National convention definitely did their part to help Trump win...",
                    "score": 52,
                    "replies": [
                        {
                            "author": "XR171",
                            "body": "We certainly didn't do our part to help ourselves win.",
                            "score": 37,
                            "replies": [
                                {
                                    "author": "Numbersguy69420",
                                    "body": "One of the most humble comments I’ve seen. I also have casted my doubts but dang it man it’s looking good!",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "XR171",
                                            "body": "I'm honestly happy he got his long overdue pardon but at the same time we don't do enough to support our ideals.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "None",
                                    "body": "Because you can't by yourself. Your best bets to make a subfaction within the main party(s)",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Marlin_Grin",
                                            "body": "It’s what MAGA did. They crawled inside the rotten husk of the Republican Party and started working its arms. And now it’s theirs. Take note.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "Solar_Nebula",
                                                    "body": "Tea Party tried it first. Their quiet disappearance still disturbs me. Forgotten before they were even gone, blackholed by the media.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "EasytheGoon",
                    "body": "well the libertarian party got 2.8 percent in 2020 and less than a percent this time around so i'd say libertarians strongly supported him.",
                    "score": 49,
                    "replies": [
                        {
                            "author": "airassault_tanker",
                            "body": "I'd say the Libertarian Party candidate didn't energize the base. A Gary Johnson/Spike Cohen ticket would have garnered more libertarian votes.",
                            "score": 21,
                            "replies": []
                        },
                        {
                            "author": "LeGoat333",
                            "body": "Jo ran an actual campaign, Chase Oliver was invisible.",
                            "score": 36,
                            "replies": [
                                {
                                    "author": "EasytheGoon",
                                    "body": "Because he didn't have the support. Tbh the delegates embarrassed the entire party last convention. Chase was never going to be seriously considered by the majority of libertarians.",
                                    "score": 24,
                                    "replies": []
                                },
                                {
                                    "author": "itsnotjackiechan",
                                    "body": "Angela has said in interviews that this was not an accident and that she made a deal with Trump to not campaign in competitive or Republican states in exchange for Ross’s freedom. ",
                                    "score": 12,
                                    "replies": []
                                },
                                {
                                    "author": "Z3roTimePreference",
                                    "body": "He only got the nomination through a backroom deal that pissed off the controlling faction of the party.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ecleipsis",
                            "body": "I disagree. If you vote Republican then you’re a Republican.",
                            "score": -14,
                            "replies": [
                                {
                                    "author": "EasytheGoon",
                                    "body": "That thinking can get you less than a percent of the vote. It's not winning anyone over to the cause of liberty.",
                                    "score": 13,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "legal_opium",
                    "body": "He means Dave Smith and the mises crowd supported him",
                    "score": 31,
                    "replies": []
                },
                {
                    "author": "the_duck17",
                    "body": "I was saying \"Boo-urns\"",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "nimbusnacho",
                    "body": "This is what he does, he doesnt give a shit about Ross he's throwing a bone to one group at a time and saying they love him for it. To be fair people eat that shit up so I guess he's not really wrong.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "boreDudex",
                            "body": "Doesn't matter if he gives a shit about him. Most politicians make promises and never keep them. If he didn't pardon him he wouldn't of lost sleep nor would he of lost any support. Yet he did it.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "nimbusnacho",
                                    "body": "Sure I'll give him that, it's a promise he kept. Idk its hard to care beyond this action when the total tally of promises kept aren't particularly great.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "mkygod",
            "body": "He promised to free him day one but did it in day two. smh",
            "score": 27,
            "replies": [
                {
                    "author": "Numbersguy69420",
                    "body": "Ran out of ink lol but jokes aside I’m glad this happened.",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "Psycosteve10mm",
                    "body": "Considering the speed and efficiency of the government it was still damn fast.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "CouldofhadRonPaul",
                    "body": "Better than him rotting in prison for the rest of his life. So who the fuck cares.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "SanduskyTicklers",
                            "body": "I think it was a joke",
                            "score": 16,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "IBentMyWookiePeen",
            "body": "Promises kept.  What a novel political moment",
            "score": 8,
            "replies": []
        },
        {
            "author": "vikesinja",
            "body": "Now Snowden!",
            "score": 7,
            "replies": []
        },
        {
            "author": "Support_Mysterious",
            "body": "Finally.",
            "score": 5,
            "replies": []
        },
        {
            "author": "cluskillz",
            "body": "NGL, Tears came to my eyes reading this. So happy for Ross and Lyn.",
            "score": 3,
            "replies": []
        },
        {
            "author": "RobertoPequeno",
            "body": "I hope he does some kind of podcast or writes a book. Would love to get his version of events and his perspective of things",
            "score": 3,
            "replies": []
        },
        {
            "author": "HK_GmbH",
            "body": "That is awesome and I'm glad to hear but isn't that the same guy constantly talking about executing drug offenders?",
            "score": 33,
            "replies": [
                {
                    "author": "StoneAgeModernist",
                    "body": "Yes. Trump has no ideological commitments or consistency. He just does what he thinks will make his base happy or make his opponents mad. Sometimes the things he does will be wrong or stupid, but sometimes he will stumble into doing a good thing. And this is one of those good things. It doesn’t justify the bad things though. Credit where credit is due, and criticism where criticism is due.",
                    "score": 56,
                    "replies": [
                        {
                            "author": "ResponsibleAd2541",
                            "body": "I think he’s directionally a bit better on the foreign policy front for this reason, he’s aware of how unpopular war is.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "Ruijerd566",
                                    "body": "I think Trump's main goal is to have a good legacy.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "LoD_Remi",
                                            "body": "i think his main goal is to blow up and act like he don't know nobody hah ah ah",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "ResponsibleAd2541",
                                            "body": "Yeah, and he’s certainly on the record talking about Iraq for instance, and he’s not really changed his position. As a guy who builds buildings it makes sense he see destroying a city skyline and impressive architecture as offensive. \n\nIt’s a pretty common point of discussion talking about labor, capital and value in libertarian circles, and making weapons of war and actually using them is the opposite of a beneficial economic activity. It’s worse than digging holes and filling them in.",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "Agent_Orange_Tabby",
                                            "body": "Wondering how historians will one day look back on the thousands of J6 pardons, especially the violent & seditious conspiracy ones",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Ruijerd566",
                                                    "body": "I'm not saying that violent offenders should've gotten pardoned but many weren't and were still imprisoned when they shouldn't have been. \n\nOverall I don't think J6 was even that big of a deal and I think most Americans would even agree with me right now.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Agent_Orange_Tabby",
                                                            "body": "Can’t claim familiarity with details of all 1,700 cases, but as event trained on overturning election results by violent force, tacitly endorsed by losing candidate at that, I don’t know how you could file it under anything but seditious, much less write off as not “even a big deal.”",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "Ruijerd566",
                                                                    "body": "From the vids I've seen it just seemed like pure chaos. In the end no one on the other end was killed and only government property was damage. So that's the reason why I just don't rly give a shit. \n\nEspecially when I see ppl compare it to 9/11.",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Fr33PantsForAll",
                                    "body": "You could be right, but back in 2016, your average gen X or boomer con probably thought intervening militarily throughout the world was a swell idea. He really differentiated himself from the rest of the Republican contrnders.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "desyhope",
                            "body": "His ideological commitment is whatever makes him the most money and keeps him and his family in power. \n\nThat’s it.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "itsnotjackiechan",
                    "body": "Um, do you have a source for that?  I’ve seen him talk about executing members of vicious cartels.  “Drug offenders” is pretty broad.  I wouldn’t put it past him to say something like that, but I’m gonna need a source. ",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "legal_opium",
                    "body": "Yes",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "nimbusnacho",
                    "body": "At this point though i think you should understand he only means Mexican or 'foreign' ones. Even then if he can win easy political points he'll about face on any particular stance",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Automatic-Mountain45",
                    "body": "trump is consistent with one thing and one thing only. give him something, he'll give you something. \n\nHe's the most transactional president I've ever seen. \n\nIf liberals supported him and said they wanted Universal Healthcare, I don't doubt he'd try to do it despite bashing it for the last 15 years.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "troy_caster",
                    "body": "Drug dealers.   Not offenders.   Ross wasn't a dealer.  You missed the boat.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "masterwad",
                            "body": "Ross was a drug dealer, he sold shrooms on his own SR1, which he ran out of a public library. And he facilitated the sale of any other illegal drug. Way to be misinformed.\n\nSome states have now legalized psilocybin mushrooms, but Ross also wanted to put out hits on people.\n\nTrump bashes Mexican cartels & fentanyl out of one side of his mouth, & pardons the guy who let anyone buy fentanyl in their jammies out of the other side of his mouth. Does Trump even know that Ross made a website to let people buy heroin online? While Trump praised Duterte who executed drug dealers?\n\nDo you think Trump talked about invading Mexico because he wants to legalize all drugs? No. If the Republican Party believed in decriminalization or legalization, then they couldn’t use “fentanawl” as a club to gin up fears of poors at the southern border.\n\nTrump has no principles, he thinks “Will this make people love me?”",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "brasileiro",
                                    "body": "> Ross also wanted to put out hits on people.\n\nWow, if only the prosecution hadn't actually withdrawn these charges",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "Bro he ran the world's biggest drug website at the time, maybe try to stay serious?",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "MrGreenChile",
                                    "body": "That doesn’t make him the dealer. If a drug deal happens in the parking lot of a grocery store, it’s like he was the owner of the store.",
                                    "score": -1,
                                    "replies": []
                                },
                                {
                                    "author": "Patti_____Mayo",
                                    "body": "If he built the store for the purpose of facilitating drug deals in the parking lot.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BattlerUshiromiyaFan",
                    "body": "Trump is wild and unpredictable. He’ll do a lot of good, but then he’ll turn right back around and do something stupid. Despite all of that, though, I think he is absolutely a better option than someone like Harris.\n\nHe isn’t always consistent. Take his position on TikTok and H1Bs as an example. I think as of recently, what he was talking about was targeting illegals that are drug traffickers.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "drakanx",
                            "body": "Trump is all about reciprocity...if you support him, he'll support you...if you like him, he'll like you.  The tik tok generation came out to support him...and he saved tik tok.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Agent_Orange_Tabby",
                    "body": "Just the brown ones",
                    "score": -2,
                    "replies": []
                }
            ]
        },
        {
            "author": "HelloImTheAntiChrist",
            "body": "Ross is incredibly lucky. I'm shocked. May he enjoy his life.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Village-Idiot-savant",
            "body": "Wonder how many bitcoins that cost ole Ross?",
            "score": 7,
            "replies": [
                {
                    "author": "Maltoron",
                    "body": "Zero, libertarian swing votes paid for it.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "im_intj",
            "body": "Promise kept, this is great news!",
            "score": 15,
            "replies": []
        },
        {
            "author": "Sledgecrowbar",
            "body": "You know what?  Good.  If we get one thing, this is all right by me.  Millions of people have been fucked over and ruined, yes, but we managed to be heard about one who everybody knew about, and it got fixed.\n\nI dont even know where he is, but if it was close, I'd give him a ride home.",
            "score": 6,
            "replies": []
        },
        {
            "author": "eddington_limit",
            "body": "I was beginning to think he wouldn't do it. I'm glad he can finally go home to his family.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Historical-Flamingo6",
            "body": "Libertarians now just realizing that Trump meant business when he invited them to his cabinet only to boo him and be left as a do-nothing afterthought of a party once again.",
            "score": 11,
            "replies": [
                {
                    "author": "None",
                    "body": "The party just lost status in my state and instead of being listed as a Libertarian on the voter rolls, it will now say Other - Libertarian… what a laughing stock.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Historical-Flamingo6",
                            "body": "I'm a libertarian leaning republican and I can't stand the libertarian party or its members! They live in fantasyland almost as much as democrats. Deep down they enjoy losing just so they can say \"Don't blame me I voted libertarian\". They have no real urge to wield real political power. They just want to finger point and bitch.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BazelBuster",
                    "body": "The pardon really means nothing when his policies that actually have effect on the country are the antithesis of libertarianism",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Historical-Flamingo6",
                            "body": "libertarians will never learn. im actually embarassed that i considered myself a libertarian for a while. this party and its voters are clueless.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "satosh_sushi",
            "body": "Big T is shaping up to be a man of his word. Fulfilling campaign promises on only the first full day of his presidency. Fuckin’ A!",
            "score": 3,
            "replies": []
        },
        {
            "author": "Complete_Serve8947",
            "body": "Trump is a man of his word. The left crazies will find a way to make this negative.",
            "score": 3,
            "replies": [
                {
                    "author": "Marlin_Grin",
                    "body": "https://www.reddit.com/r/Libertarian/s/EakWasow0w",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "exoninja88",
            "body": "Ross finally got pardoned, let's fucking go!!!!!!",
            "score": 3,
            "replies": []
        },
        {
            "author": "freshmoves91",
            "body": "Wow....did not see that coming..",
            "score": 5,
            "replies": []
        },
        {
            "author": "Exciting_Vast7739",
            "body": "It's always good to see justice served, and to highlight a system that can easily be abused. \n\nThough I did not vote for President Trump, I'm glad that he has experienced unfair targeting from the legal system. Maybe that will lead him to some wisdom or compassion for all the little people who have also been unfairly targeted by the legal system. It's always good to shine a light on the problems with our legal system.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Jt4180189",
            "body": "FUCK YEAAA",
            "score": 3,
            "replies": []
        },
        {
            "author": "M3taBuster",
            "body": "https://preview.redd.it/3u3ijrzr4gee1.jpeg?width=1534&format=pjpg&auto=webp&s=1311c9834e65880264855b4b66a782860e62b5c9",
            "score": 3,
            "replies": []
        },
        {
            "author": "jankdangus",
            "body": "Holy shit, I honestly was kinda expecting to be let down.",
            "score": 4,
            "replies": [
                {
                    "author": "SPedigrees",
                    "body": "These days not many campaign promises are kept, but this was a pleasant surprise.  Here's to a promise kept, and to freedom.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "VexLaLa",
            "body": "Kudos to that orange man for pulling through and keeping the promise.\n\nSNOWDEN NEXT! Snowden did nothing wrong and everyone with a brain knows that!",
            "score": 4,
            "replies": []
        },
        {
            "author": "emeric1414",
            "body": "👌",
            "score": 2,
            "replies": []
        },
        {
            "author": "GTfan27",
            "body": "In honor of the pardon, I need documentary suggestions about Ross",
            "score": 2,
            "replies": [
                {
                    "author": "HooiserBall",
                    "body": "Count Dankula video on him.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Wafflebot17",
            "body": "About fucking time",
            "score": 2,
            "replies": []
        },
        {
            "author": "KingTyrionSolo",
            "body": "![gif](giphy|Sv9KTxL2E5wCQUCGdi|downsized)",
            "score": 3,
            "replies": []
        },
        {
            "author": "squawk_vfr",
            "body": "Amazing!",
            "score": 4,
            "replies": []
        },
        {
            "author": "None",
            "body": "I’m all for this, as a lover of drugs. But… it’s crazy to me he can say “drugs are bad” and then free the guy who ran a massive drug site like this.",
            "score": 4,
            "replies": [
                {
                    "author": "Resident-Rutabaga336",
                    "body": "He has no convictions, he just acts according to who supports him and who’s against him. Still, this is a massive win and I’ll take it. Thank you President Trump.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "None",
                            "body": "Actually he has like 34 convictions!",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Sea_Journalist_3615",
                    "body": "A lot of libertarians exchanged votes for a hostage. That's what happened.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "nimbusnacho",
                    "body": "if trump is consistent on one thing it's that he's not consistent in anything",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "KnameLes",
            "body": "Alright, feeling confused why this guy is a hero. \nI just read that Leonard Peltier had been released and I've been tickled about it all day. Didn't have many people in my life to share it with, so i let my folks know. They said that that's worth some research, but they should free Ross Ulbrecht or Ian Freeman. Never heard of them. Checked out some basic stuff, thought it was kind interesting if not shifty. Then i see this post here, i guess y'all know something i don't. I wouldn't compare the 2 people in a report, but I'm curious what the big deal is about this guy.",
            "score": 3,
            "replies": [
                {
                    "author": "masterwad",
                    "body": ">I'm curious what the big deal is about this guy.\n\nRoss created an onion site on the dark web to let anybody buy any illegal drug online, which he openly discussed on the BitcoinTalk forums, and he wanted to assassinate a few people, so (anarcho-) libertarians think he’s a “hero.”\n\nBut wait till Fox News learns that he built the Amazon for heroin and pills (although IIRC based on some other subreddit, the most trafficked drug was weed).",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Somhairle77",
            "body": "O frabjous day! Callooh! Callay!”",
            "score": 3,
            "replies": [
                {
                    "author": "TargetOfPerpetuity",
                    "body": "The Mome Rath ain't been born who can outgrabe me!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "cluich1",
            "body": "Yessssss",
            "score": 3,
            "replies": []
        },
        {
            "author": "fareastcoast",
            "body": "Completely fuck Donald Trump, but this is awesome...",
            "score": 3,
            "replies": [
                {
                    "author": "Enough_Wallaby7064",
                    "body": "Trumps like 80. Why you wanna fuck him?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "fareastcoast",
                            "body": "Don’t kink shame me…",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "sjuskebabb",
            "body": "🏴‍☠️✊🏻✊🏻\n\nWhichever end of the spectrum you are on, I think he has paid his dues after 11 years in prison. And all of those years knowing everyday he will be in there for life— it adds a dimension of punishment.\n\nLet’s keep prisons as a place to lock up people who are a danger to the public, there are enough of those already",
            "score": 2,
            "replies": []
        },
        {
            "author": "trade_my_onions",
            "body": "![gif](giphy|l1J9PgYklopyf6uw8)",
            "score": 2,
            "replies": []
        },
        {
            "author": "KietsuDog",
            "body": "Good news. This never would have happened if any neocon or leftist had won. Trump is built different.",
            "score": 2,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 3,
                    "replies": [
                        {
                            "author": "KietsuDog",
                            "body": "Trump deserves credit for the simple fact that he said he would do it and could have lied when getting into office, as so many politicians do, but he kept his word. I don't expect redditors to show much appreciation to Trump for this or any of the great things he has done or will do, but their tiny voices don't matter much. What does matter though politically is when Ulbricht himself thanks Trump for the pardon, and when those on the left with TDS speak against it because they can't stand Trump getting a win. \n\nIt will increase the popularity of Trump, and again show how deranged the left has become. The left being insane is a huge reason why Trump won of course; so a win for him and his supporters.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "StunningIgnorance",
                                            "body": "Do they not allow truth bombs on this sub?",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "lumpiaandredbull",
            "body": "This is a good thing. Let's just hope it's not a distraction from his intentions to step up the war on drugs.",
            "score": 4,
            "replies": [
                {
                    "author": "troy_caster",
                    "body": "He mostly focusing on fetanyl.   I don't belive I've ever heard him mention Marijuana,  cocaine.... or any other drug by name i don't think.  Not very often anyway.    He has said fetanyl a million times though.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "vegas84",
                    "body": "I’m pretty sure he’s listing the cartels as terror entities so he can apply pressure to Mexico. He hinted at doing this in his last administration and was able to get Mexico to stop the previous migrant train at their southern border due to it. I don’t think this will be another war on terror/drugs but I guess it remains to be seen.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "pbr4me",
                    "body": "Again,,, I thought we'd determined the outcome of this war long ago. And many times.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Connect-Internal",
            "body": "Now pardon every black male that has been jailed for weed possession.",
            "score": 2,
            "replies": [
                {
                    "author": "StunningIgnorance",
                    "body": "i thought that already happened? \n\nhttps://apnews.com/article/biden-marijuana-pardons-clemency-02abde991a05ff7dfa29bfc3c74e9d64",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Anxious-Educator617",
                    "body": "Calm down, my gosh go outside",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "indyjones8",
            "body": "No libertarian in a cabinet position, which was one of his promises. But this is good.",
            "score": 1,
            "replies": []
        },
        {
            "author": "thinksolidarity",
            "body": "Didn't we not endorse him?",
            "score": 1,
            "replies": []
        },
        {
            "author": "skurarr",
            "body": "Big W, cant imagine how happy he is right now",
            "score": 1,
            "replies": []
        },
        {
            "author": "elguapojefe",
            "body": "I can get behind this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Valarie117",
            "body": "I never thought I would see the day. God bless them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Critical-Syrup5619",
            "body": "Holy shit",
            "score": 1,
            "replies": []
        },
        {
            "author": "The_Derpening",
            "body": "Something actually happened?!?!?!",
            "score": 1,
            "replies": []
        },
        {
            "author": "theSpringZone",
            "body": "W",
            "score": 1,
            "replies": []
        },
        {
            "author": "Impossible-Poetry-80",
            "body": "Ulbright?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rolmegax",
            "body": "Holy shit",
            "score": 1,
            "replies": []
        },
        {
            "author": "bethechaoticgood21",
            "body": "\"...which supported me so strongly...,\" didn't we boo him off the stage at the LNC?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Koala_Hands",
            "body": "This is incredible news! One of the worst travesties of justice in recent memory! #FreeRossUlbricht has finally come true! 🙌\n\nhttps://preview.redd.it/u74wukg6cjee1.jpeg?width=4096&format=pjpg&auto=webp&s=ccbadb82b44720877a669ac39c63dbd4978ea411",
            "score": 1,
            "replies": []
        },
        {
            "author": "ogMackBlack",
            "body": "Trump ia seriously cooking right now...wow.",
            "score": 1,
            "replies": []
        },
        {
            "author": "alllovealways",
            "body": "about time. best thing trump has ever done imo",
            "score": 1,
            "replies": []
        },
        {
            "author": "blanketshapes",
            "body": "is he allowed to use the internet? is this in any way “parole”? is his record expunged?",
            "score": 1,
            "replies": [
                {
                    "author": "Sexypsychguy",
                    "body": "And go right back to do what he wants just like that weapons smuggler from Russia that Trump complained about being released..... I don't agree with either by the way it's just the narcissist's desire to be liked by everyone.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "czarface404",
            "body": "I want my 3.5 BTC back Ross!",
            "score": 1,
            "replies": []
        },
        {
            "author": "underengineered",
            "body": "Good. Now they need to return the bitcoin they seized.\n\nCurrent value is north of $18 billion.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RealisticInspector98",
            "body": "![gif](giphy|l0HlGVD6AsbobSTe0|downsized)",
            "score": 1,
            "replies": []
        },
        {
            "author": "GHeusner",
            "body": "Now do Snowden.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Anen-o-me",
            "body": "Fuck yeah! Justice for Ross!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Adventurous-Ad-7222",
            "body": "I’m late here, and I can’t seem to get the facts of this case straight. Can someone, in a friendly way, explain the Ross Ulbright case to me?",
            "score": 1,
            "replies": []
        },
        {
            "author": "TreeStumpKiller",
            "body": "Loyalty - that’s the key to influencing DJT. Wonderful news.",
            "score": 1,
            "replies": []
        },
        {
            "author": "30_characters",
            "body": "groovy scary ripe quaint zealous tub act offer sort library\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
            "score": 1,
            "replies": [
                {
                    "author": "Nanamight",
                    "body": "He didn't have to free him either, he could've just ignored it.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "KDot0300",
            "body": "Didn’t he try to hire a hitman?",
            "score": 1,
            "replies": [
                {
                    "author": "dreamache",
                    "body": "No. Never proven",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Invulnerablility",
            "body": "Hopefully, a sign that the war on drugs is ending?",
            "score": 1,
            "replies": []
        },
        {
            "author": "TrainWreck43",
            "body": "wtf? This feels like when that EPA jerk forced the Ghostbusters to shut down the Containment Unit!",
            "score": 1,
            "replies": []
        },
        {
            "author": "HungryJuggernaut4778",
            "body": "Ross Ulbricht is $ALTOID\nWhy $Altoid?\n- 20% supply sent to Ross\n- low market cap \n- unwavering community \n- only coin with Altoid in name on Dex\n\nGULwrVbDds3syijiedNieummMCDnFezYx8Cx6U82pump",
            "score": 1,
            "replies": []
        },
        {
            "author": "Summersemantics",
            "body": "He is so hot, and so badass. I’m a dreamer",
            "score": 1,
            "replies": []
        },
        {
            "author": "MeAndDuke",
            "body": "Why was this important for Libertarians? \n\nOr was it? \n\nI think I read something that Trump did this as a promise to Libertarians.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "Honestly as much as I want to like him, I just can’t get over the fact that he literally thought he was paying for like 3 dudes to be killed. That kinda goes against the whole do whatever you want as long as it doesn’t hurt anyone else idea. I know he didn’t get charged for it or whatever but he paid like over a mil thinking he was murkin dudes that got in the way of his empire. I dunno… am I the only one?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Squatch_Zaddy",
            "body": "I’m happy the Dread Pirate Robert’s is free, however I’m worried that Trump’s language will make people believe that Libertarians are Trumpers. \n\nStill hopefully this paves the way for someone to decriminalize everything.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jayhovaswitnuss",
            "body": "[Far-left dude gets it. Everybody knows Ross should be free](https://youtu.be/IAr9rRer5kA?si=SjNvLBuCj_VaVYkH)",
            "score": 1,
            "replies": []
        },
        {
            "author": "JKlerk",
            "body": "An enabler of questionable moral character.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ModusPwnins",
            "body": "An overt authoritarian courting the libertarian movement (and it working) tells you everything you know about how much the modern libertarian movement actually values liberty.",
            "score": 0,
            "replies": [
                {
                    "author": "Anxious-Educator617",
                    "body": "Shut up",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "DonnaDDrake",
            "body": "![gif](giphy|yr7n0u3qzO9nG)",
            "score": 1,
            "replies": []
        },
        {
            "author": "throw42069away420",
            "body": "I hope I don’t get sick of all the #WINNING!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Plebinator6000",
            "body": "Didn't he attempt to hire hitmen to kill several people? As much as you can argue against his sentence for running the silk road, surely that's not great? haha",
            "score": 0,
            "replies": [
                {
                    "author": "StunningIgnorance",
                    "body": "that was a claim but he was never charged/tried for it which obviously means they had no evidence, otherwise they would have done it.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Plebinator6000",
                            "body": "He wasn’t charged because prosecutors didn’t need to him be - the other charges already got him life. Prosecutors still used the allegations at sentencing to push for a harsher penalty. Doesn’t mean there was no evidence, just that they didn’t bother since it wouldn’t change the outcome.\n\nIIRC there are plenty of chat logs and transactions available to the public of him arranging for murder. Just because he wasn't charged doesn't mean he was innocent.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "StunningIgnorance",
                                    "body": "We should read them together and find out for sure.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "curse_of_rationality",
            "body": "This person being pardoned is great. The fact that the executive branch has the power pardon is stil not good.",
            "score": 1,
            "replies": []
        },
        {
            "author": "tactical-terry",
            "body": "This is a win",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheIronGnat",
            "body": "That is actually awesome.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Forever_Nocturnal",
            "body": "Rare Trump W",
            "score": 1,
            "replies": []
        },
        {
            "author": "WholeEase",
            "body": "Made my day",
            "score": 1,
            "replies": []
        },
        {
            "author": "sureyouknowurself",
            "body": "Based Trump.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Defyant700",
            "body": "He should become a candidate for the party,",
            "score": 1,
            "replies": []
        },
        {
            "author": "bloohens",
            "body": " Can someone explain why this is a good thing? Didn’t the Silk Road facilitate sex trafficking, child predators, and illicit drugs and arms dealing?",
            "score": -4,
            "replies": [
                {
                    "author": "Shit___Taco",
                    "body": "Illicit drugs yes, but the other things were prohibited.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "huckafooter",
                            "body": "Not true.  The Armory on SR lasted for at least 2 years. There was crazy shit for sale all the time.  Trafficking I heard about, but never saw evidence of.  DPR shut it all down though.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TrainWreck43",
                    "body": "I’m still waiting for someone to explain why this is a good thing. The guy was a drug kingpin and they also sold stolen credit cards and all kinds of shit on Silk Road.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Butane9000",
            "body": "I'm curious if this sub is going to be slightly more open minded regarding Trump now. I say slightly and Trump specifically because there's really no reason to trust the Federal government.",
            "score": 1,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Butane9000",
                            "body": "I think I'm regards to his first term nobody expected him to win and the deep state & establishment got their hooks in to sabotage his first 4 years. We'll have to see how these 4 years are going to go.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "E_MusksGal",
            "body": "Wait, didn’t Ross Ulbricht run a dark web site that allowed a ton of illicit activity to take place? Why was he pardoned?",
            "score": -1,
            "replies": [
                {
                    "author": "viper999999999",
                    "body": "Correct - he ran a website. And was sentenced to life in prison for it, and served 11 years. There were no victims, only consenting adults.",
                    "score": 7,
                    "replies": [
                        {
                            "author": "nimbusnacho",
                            "body": "Even if you were a stickler and wanted to throw the book at someone for something like that, consecutive life sentences is a fucking beyond insane punishment.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DimeadozenNerd",
            "body": "Despite what Trump says, we didn’t “strongly support” him. We actively booed him to his face. And if you did support him, you aren’t a libertarian.",
            "score": -2,
            "replies": [
                {
                    "author": "salparadise5000",
                    "body": "I voted for him 3 times. I stopped supporting the capital L Libertarian party when they asked people to vote for Hillary Clinton. They will get no more money from me.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "DimeadozenNerd",
                            "body": "If you voted for Trump three times then you have no business being in this sub.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "StunningIgnorance",
                                    "body": "You obviously voted blue, bro. cry more about people posting in the sub about republicans supporting libertarian values. you walk around like a grey cloud in society and bring everybody around you down. this is a _huge_ win and youre sitting around crying your eyes out about Trump.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "DimeadozenNerd",
                                            "body": "You’re clueless. I did not vote blue. \n\nAnd at no point did I say this isn’t a win. It absolutely is. My comment is specifically in regard to Trump’s comment about “libertarians loudly supporting him.” I know reading comprehension is hard for Republicans though, so I’ll give you a break.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "StunningIgnorance",
                                                    "body": "Who did you vote for?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "DimeadozenNerd",
                                                            "body": "Chase Oliver, the Libertarian Party candidate.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "StunningIgnorance",
                                                                    "body": "Take the L, bro. Youre bitching about Trump not being a Libertarian but you voted for Chase Oliver?",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "DimeadozenNerd",
                                                                            "body": "If you think Trump and Oliver are equally libertarian, you’re truly delusional. I voted for the candidate who was closest to libertarian.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "StunningIgnorance",
                                                                                    "body": "I think theyre equally NOT libertarian.",
                                                                                    "score": 0,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "DimeadozenNerd",
                                                                                    "body": "You’re delusional.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "StunningIgnorance",
                                                                                            "body": "I forgot what sub I was in lol",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "theSpringZone",
                    "body": "Cope harder",
                    "score": -1,
                    "replies": [
                        {
                            "author": "DimeadozenNerd",
                            "body": "You Trumpers are literal mindless drones. Pathetic.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "theSpringZone",
                                    "body": "I didn't vote for him. But I sure love watching you all melt down just 24 hours after he took office again. 😂",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "DimeadozenNerd",
                                            "body": "The only people melting down are the fake libertarians who don’t like me pointing out that Trump isn’t a libertarian.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "theSpringZone",
                                                    "body": "He’s not a Libertarian. He may share some views of Libertarianism, but that doesn’t make him one.\n\nAnd I would argue 75% of the people on this sub aren’t Libertarians either. Just my two cents.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Appropriate-Exam7782",
                    "body": "cope",
                    "score": -1,
                    "replies": [
                        {
                            "author": "DimeadozenNerd",
                            "body": "Wow, good one. Did Trump teach you that one?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Appropriate-Exam7782",
                                    "body": "womp womp. keep crying. IM ECSTATIC. ROSS IS FREE.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "DimeadozenNerd",
                                            "body": "You realize these things aren’t mutually exclusive, right? Yes, it’s good that Ross is pardoned. That doesn’t change the fact that Trump isn’t a libertarian.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "legal_opium",
            "body": "I would have rather got something thst actually increased our freedoms. But hey that's me",
            "score": -11,
            "replies": [
                {
                    "author": "EasytheGoon",
                    "body": "The biggest win the libertarian party has ever achieved. What is the price of one person's freedom?",
                    "score": 16,
                    "replies": [
                        {
                            "author": "legal_opium",
                            "body": "The libertarian party achieved this ?",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "EasytheGoon",
                                    "body": "Yes, it was on a lists of issues that was presented to Trump when he spoke at the convention and it was Trumps promise to libertarians. Angela Mcardle as much as she's slandered deserves praise for this.",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "legal_opium",
                                            "body": "I wish it was something like end of the drug war. Did Ross actually try and get people killed? If so he isn't the libertarian hero we think he is.\n\nOr was the attempted assassination bullshit?",
                                            "score": -8,
                                            "replies": [
                                                {
                                                    "author": "EasytheGoon",
                                                    "body": "He did not it was a fabrication by the justice department and not part of his charges.",
                                                    "score": 15,
                                                    "replies": [
                                                        {
                                                            "author": "legal_opium",
                                                            "body": "How do we know it was a fabrication ? Got a link or something i can look into it further ?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "EasytheGoon",
                                                                    "body": "Because if it was true he would have been charged for it.",
                                                                    "score": 10,
                                                                    "replies": [
                                                                        {
                                                                            "author": "legal_opium",
                                                                            "body": "This is what I found \"The district court found by a preponderance of the evidence that Ulbricht did commission the murders.\"",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "EasytheGoon",
                                                                                    "body": "https://www.ice.gov/news/releases/ross-ulbricht-aka-dread-pirate-roberts-sentenced-life-federal-prison-creating",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "legal_opium",
                                                                                            "body": "That link doesn't discuss whether Ross did solict murder for hire or not. From what i understand they don't have evidence that the murders took place but have evidence he did solicit them to happen.",
                                                                                            "score": 2,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Son_of_Sophroniscus",
                                    "body": "According to the tweet above from Trump, he credits the libertarian movement and Ross' mom, so yeah kinda",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "legal_opium",
                                            "body": "The movement is different from the party. As evidenced by the movement ditching the party last election",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "LukeTheRevhead01",
                    "body": "https://preview.redd.it/8tt635sxufee1.jpeg?width=540&format=pjpg&auto=webp&s=337a56e57a496282e1f4349b7c2e0ee750e227a6",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Random_Monstrosities",
            "body": "Well I've just gained a lot of love for Trump.",
            "score": 0,
            "replies": []
        },
        {
            "author": "ThisIsMyUsername1122",
            "body": "Not a Trump fan by any means, but this is amazing news! Cruel and unusual punishment, but thank god the man is free finally",
            "score": 0,
            "replies": []
        },
        {
            "author": "placeboloverlover",
            "body": "Yeah as a Bernie Sanders simp and a commie even I am very happy for this man. Good job Trump",
            "score": 0,
            "replies": []
        },
        {
            "author": "None",
            "body": "not a big trump fan, but he kept his promise and I gotta respect that",
            "score": 0,
            "replies": []
        },
        {
            "author": "Upstairs1njury",
            "body": "Thank you president Trump!!",
            "score": 0,
            "replies": []
        },
        {
            "author": "Prince-Of-Patriarchy",
            "body": "I'm so hard right now!",
            "score": 0,
            "replies": []
        },
        {
            "author": "littleorfnannie",
            "body": "Went to school with Ross. This is great news!",
            "score": 0,
            "replies": []
        },
        {
            "author": "thunder_shart",
            "body": "Libertarians sacrificing women's bodily autonomy and other personal freedoms by voting for trump to release one man, just flags that's you're conservative and not remotely Libertarian",
            "score": -22,
            "replies": [
                {
                    "author": "Trumpologist",
                    "body": "Plenty of libertarians are split on the issue given the other side of that coin is depriving someone of the right to life",
                    "score": 12,
                    "replies": [
                        {
                            "author": "thunder_shart",
                            "body": "So you're cool with a teen girl carrying her rapists child? Cause that's what you're sacrificing",
                            "score": -10,
                            "replies": []
                        },
                        {
                            "author": "Trumpologist",
                            "body": "What percentage of abortions are rape based? If we agree to a rape exception and a mother’s life exception will you ban the rest",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "thunder_shart",
                            "body": "1 rape should be too much for you, but maybe I'm wrong. Maybe you need 10 rapes before you're OK with it.",
                            "score": -2,
                            "replies": []
                        },
                        {
                            "author": "Trumpologist",
                            "body": "That’s not at all what I said. Since you’re being obtuse I’ll tell you. Rape abortions are less than 1% of the total abortions done. You’re using 1% to justify the murder of the other 99%\n\nNice gaslight though",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "thunder_shart",
                            "body": "OK, so you're cool with child rape victims giving birth to their rapists baby. Glad we got that covered",
                            "score": -1,
                            "replies": []
                        },
                        {
                            "author": "RireBaton",
                            "body": "I'm very sorry that you can't read. Keep trying though, you might get it one day.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "gijoeusa",
                            "body": "Nah, fam, that’s not true. Straw man all day.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "thunder_shart",
                            "body": "https://www.google.com/amp/s/abcnews.go.com/amp/US/13-year-rape-victim-baby-amid-confusion-states/story%3fid=108351812\n\nhttps://time.com/6198062/rape-victim-10-abortion-indiana-ohio/",
                            "score": -2,
                            "replies": []
                        },
                        {
                            "author": "Wtfjushappen",
                            "body": "This argument is fucking tiring and losing weight the way you people throw abortion around.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "thunder_shart",
                            "body": "there's documented cases dude, so you have to live with yourself with that knowledge",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Wtfjushappen",
                            "body": "I realize it happens. If the vote was to allow abortion in cases of rape, incest or stealth, you could win that argument and probably gain support but the left is fucking radical and want abortion to be much more and people just don't agree with that, don't be a male slut.",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "SPedigrees",
                            "body": "A collection of cells is not \"someone.\"",
                            "score": -10,
                            "replies": []
                        },
                        {
                            "author": "Trumpologist",
                            "body": "Both you and I are a collection of cells",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "SPedigrees",
                            "body": "And any collection of cells inside my body belongs to me alone, to do with what I choose.\n\nHere's a history lesson for you:\n\nIn England in an era before sanitation, antibiotics, and advanced medical knowledge, many women were dying from abortions.  It was for this reason that abortion was made illegal, ie to protect the lives of women, because childbirth was the less dangerous option even in that dark era.  It had zero to do with the health of a fetus, because the beginning of life was universally defined as \"when a baby is born and brought forth.\"  This prohibition came to travel across the Atlantic via Common Law.  A pity its original purpose did not also make the voyage.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "EasytheGoon",
                    "body": "I think if a person supports the murder of children that flags them as a leftist and not a Libertarian.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "thunder_shart",
                            "body": "Yikes, I said women's bodily autonomy and you immediately went to children, shows where your head is at.\n\nPlan B and access to contraception is also woman's freedom, something that the trump administration has spoken to looking at restricting access too.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "EasytheGoon",
                                    "body": "Who in Trumps administration said that?",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "thunder_shart",
                                            "body": "Literally Trump",
                                            "score": -2,
                                            "replies": []
                                        },
                                        {
                                            "author": "EasytheGoon",
                                            "body": "Source?",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "thunder_shart",
                                            "body": "https://apnews.com/article/trump-contraception-birth-control-abortion-2024-8f73bb1b3a5864b24157f15eb272a3e6\n\nAnd that's just Trump riffing. His cabinet and other members are way more into restricting access",
                                            "score": 0,
                                            "replies": []
                                        },
                                        {
                                            "author": "EasytheGoon",
                                            "body": "“Do you support any restrictions on a person’s right to contraception?”\n\n“We’re looking at that and I’m going to have a policy on that very shortly,” Trump responded\n\nSo you took this statement as he was against contraceptives? And womanly \"autonomy\"?",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "thunder_shart",
                                            "body": "Yeah duh, he literally said they were looking into it. That's how reading comprehension works.",
                                            "score": -2,
                                            "replies": []
                                        },
                                        {
                                            "author": "EasytheGoon",
                                            "body": "Lol maybe you need reading comprehension because they looked into it and decided it should be left to the states. So your prejudice decided that's what he meant.",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "thunder_shart",
                                            "body": "If someone is too poor to travel for health care, what do they do then?\n\nIf someone lives in a state where shit is illegal and they don't have the means to travel due to generational poverty or other obligations (like illness or disease), what do they do?\n\nJust suffer under the boot like you want?",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "EasytheGoon",
                                                    "body": "That is our federal system. If you don't like where you live move. Or be involved in your local system and change it. Our state government by design are supposed to be more changeable than the federal government.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "thunder_shart",
                                                            "body": "You literally are so detached from society that you don't understand the fundamentals of generational poverty and how the government uses said poverty to control the masses. \n\nLike this is libertarianism 101. Oppressive governments form laws to control those you don't have the means (i.e. capital) to better than circumstance. So libertarianism is to restrict that government overreach in order to better the lives of others.\n\nYou're just a conservative dawg",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "EasytheGoon",
                                                                    "body": "You're theology screams leftist and not libertarianism. Libertarians are for the decentralization of power not the concentration of power to the federal government. It seems you don't believe that people have any agency in their lives at all.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "thunder_shart",
                                                                            "body": "You want daddy government to tell you what to do, that's real freedom right therevlmao",
                                                                            "score": 0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "OratoryGorgias",
            "body": "Great president",
            "score": -2,
            "replies": []
        },
        {
            "author": "GoodwillTrillWill",
            "body": "Thank god our boy is free",
            "score": -1,
            "replies": []
        },
        {
            "author": "jimandi80",
            "body": "At the time of his sentencing in San Francisco in 2015, Ulbricht was 31 years old. He was convicted of distributing narcotics, engaging in a continuing criminal enterprise, conspiring to commit computer hacking, and conspiring to create fake identities and launder money. He was sentenced to life in prison. \n\nWOW!! Exactly like djt himself!! Well, I'm no longer worried about dangerous immigrants. I get good ole police beating, drug trafficking Americans pardoned. Yep, you hire a felon to run our country. He will let every felon out of prison who backs him. Dangerous immigrants my ass!!",
            "score": -11,
            "replies": []
        },
        {
            "author": "Marlin_Grin",
            "body": "TLDR: rEeEEeEEEEeeeeeEE",
            "score": 7,
            "replies": []
        },
        {
            "author": "MacDaddy555",
            "body": "Wait…didn’t the dude actually put a hit out on one of his employees or something? Why is he being pardoned?",
            "score": -4,
            "replies": []
        },
        {
            "author": "pasarina",
            "body": "That was an inexcusable pardon.",
            "score": -5,
            "replies": []
        }
    ]
}