{
    "title": "What do you think the best countries for libertarians are.",
    "author": "Dry-Lengthiness-7182",
    "subreddit": "Libertarian",
    "rank": 32,
    "score": 0,
    "upvote_ratio": 0.25,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.reddit.com/r/Libertarian/comments/1inimuj/what_do_you_think_the_best_countries_for/",
    "id": "1inimuj",
    "selftext": "I'm thinking Haiti,Somalia, Switzerland, Costa Rica in someways Panama ",
    "comments": [
        {
            "author": "PhraseGlittering2786",
            "body": "United States. The only place in the world where it is a thing, you can live in many rural areas in many countries where the government doesn't care, but it doesn't mean that it values liberty. \n\nAs someone born in an underdeveloped semi-socialist country, the United States is the only place where liberty exists even if not so strong. Y'all may take the United States for granted but trust me that country is the best in the world. There is no country in the world where you can say anything (except calling for violence and giving threats) and not be arrested.",
            "score": 15,
            "replies": []
        },
        {
            "author": "Bonsaitreeinatray",
            "body": "Haiti and Somalia aren't good for anyone, no matter what political philosophy they hold.",
            "score": 13,
            "replies": []
        },
        {
            "author": "JimJamTheNinJin",
            "body": "Live out in the woods where nobody will bother you",
            "score": 6,
            "replies": []
        },
        {
            "author": "TexasBrett",
            "body": "You should catch the next flight to Haiti and report back after a couple of hours.\n\nOh, can you even get a flight since they were shooting guns at planes on short final?  I guess that’s good for libertarians though, free to shoot at approaching airplanes.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Hefty-Owl2624",
            "body": "1) United States. No other country provides people with this many opportunities to choose what they want. Economically better, politically worse \n2) Switzerland. Municipal policy is a thing, but economically thinking less opportunities and also less choice. \n\nI do not include other countries as they depend on larger ones or have other fundamental problems, but I’d say that Slovenia, Czech, Poland, UAE (not politically), Finland, Estonia and some micro countries (Liechtenstein, Andorra etc) also have acceptable level of freedoms and safety.",
            "score": 3,
            "replies": []
        },
        {
            "author": "stKKd",
            "body": "Rural thailand. Want to do something? Nobody will care.\n\n\nWant a pink house? No prob\nWant to swap a tractor engine on a 60 years old car chassis? No prob\nDriving your motorbike with no lights/no plates/no paper in front of police? No prob\nAll of this while having gigabit fiber + digital tv + sim card + insurances for 20$ ",
            "score": 4,
            "replies": []
        },
        {
            "author": "FlounderExisting4671",
            "body": "Antarctica",
            "score": 2,
            "replies": []
        },
        {
            "author": "gabrielsol",
            "body": "If you have the money and can afford some protection, Guatemala would probably be the answer.",
            "score": 1,
            "replies": []
        }
    ]
}