{
    "title": "ADHD has ruined my life",
    "author": "Entire_Tower1664",
    "subreddit": "ADHD",
    "rank": 15,
    "score": 143,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 34,
    "url": "https://www.reddit.com/r/ADHD/comments/1jdzfgc/adhd_has_ruined_my_life/",
    "id": "1jdzfgc",
    "selftext": "I’m 20, Male, and I’ve been struggling with the hardest time of my life over the last few years. When it came time to take responsibility for my life and handle real-world tasks—things beyond childhood—I felt like everything crashed down on me. I can’t seem to get anything done. I’m constantly stuck, feeling like I have no motivation. I have a lot of interests and hobbies that I want to pursue, but I feel like I can’t even start them. I don’t know how to cope with what feels like a demonic disorder inside my mind.\n\nI feel completely lost. It’s been a huge blow to my mental health, and I’ve developed depression and severe anxiety because of it. I barely do anything with my life and when I try to explain my struggles to people around me, they don’t understand. They have hopes and expectations for me, and every time I think I’m not meeting them, I feel like I’m letting everyone down.\n\nI don’t know where to go from here or what to do. It’s like I’m stuck in a constant cycle of trying and failing, and I can’t seem to break free. Does anyone have advice or experiences with feeling this way? I need help.\n\n(Edit: Thank you all for the helpful responses. Truly appreciate them)",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/Entire_Tower1664 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Appropriate_Amoeba50",
            "body": "You are only 20 years old. Your life hardly started. The most important thing you need to learn is not blaming yourself for things you cannot do anything about. And also to ask for help, like you do now. It seems on social media that everyone is successfull. That's not really true. Find out what you really like doing and pursue that. My 19 yo adhd daughter is really intelligent and could have gone to university.  But she likes more to work with her hands and now learns to work with textiles and leather and she is blooming and happy.",
            "score": 53,
            "replies": [
                {
                    "author": "SocketByte",
                    "body": "As a 23 year old male I really try to get the \"your life hardly started\" part of the argument, but it just doesn't work. It feels like I wasted my entire youth fighting with this piece of shit condition. No girlfriend, no social life, barely made it through school despite feeling like I'm capable of more than that. It's really easy to fall into the trap of constant \"I'm a failure\" thoughts. Thankfully got diagnosed and I'm figuring out the medication, definitely see improvements but it's far from perfect.\n\nIt's a painful condition because it's slow. It slowly creeps on you, builds up, and destroys your life piece by piece. Your daughter is very lucky to have a parent that understands her. Wish both of you lots of luck!",
                    "score": 37,
                    "replies": [
                        {
                            "author": "Strong_Paper2894",
                            "body": "definitely this. I was told “you are only 20, that’s ok” \nNow I’m 30, more lost than ever. Desperately trying without any success.\nMy only real advice is to concentrate all of your energy into therapy/meds/finding how to help yourself.    After that you will find your way.",
                            "score": 21,
                            "replies": []
                        },
                        {
                            "author": "peach1313",
                            "body": "You won't really get the \"your life hardly started\" part until you're much older and look back. That's the paradox of youth.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "wookiee1807",
                            "body": "No, homie... You've spent you're entire youth exploring the confines of your brain, and learning how it works. You know what's distracting, what's necessary, and what's impossible.\n\n\n\nCBT helped me a lot, and it's essentially:\n\nYou're a conglomeration of all the many different things you've had to be to survive life this far. Every impulse, every \"brain fog\", every intense response... It's a \"part\" of you that feels as if you're being threatened, and jumps into protecting you the way they were created to do the very first time you felt threatened that way.\n\nRejection, fear, people pleasing, learning body language and tones... It's all learned for protection, whether to help us mask, or help us process.\n\nWhen we can help those parts feel safe, wanted, but not needed, we have an easier time in life.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "No_Cartoonist3711",
                            "body": "What meds have you tried taking, just curious. I use MPD in form of Medikinet IR. I want to try lisdextroamphetamine, but before wasting my moneys I want to know someone else's experience",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "SocketByte",
                                    "body": "Medikinet CR and IR. It's alright, I can focus much better and feel a slight improvement in \"life energy\", basically an antidepressant that actually works for me. Doesn't really improve executive dysfunction unfortunately though, but I still figure out my doses. In Poland we only really have Elvanse (which is expensive as fuck and hard to come by) and Medikinet, never tried Elvanse though.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "peteofaustralia",
            "body": "I'm so sorry to hear that, brother. 🫂  \nWe all know how shitty this phase feels. Really we do. Anxiety, depression, RSD, social confusion, focus, money, being organised, keeping relationships. It's so fucking hard. It really does get better, I promise you, especially with simple but reliable tools, being kind to yourself, people who get to, and repetition.  \nI'd be more than happy to talk in DMs if you wish.",
            "score": 16,
            "replies": [
                {
                    "author": "Senhor_Alfredo",
                    "body": "The problem is that it is not really a phase. It's a whole life situation. You should feel like a warrior to even have the strength to live with a brain that is constantly fighting back \n\nIt's a war brother, welcome.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "peteofaustralia",
                            "body": "It's definitely a struggle. It gets easier when you find the handbook. I only got diagnosed at 45.  \nNothing made sense until then.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Senhor_Alfredo",
                                    "body": "What's your handbook?\n\nMy handbooks usually last a week or two, then I'm back to the beginning. It's impossible to stay consistent.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Potous",
            "body": "Do you need to speak in private maybe ? You can mp me if you want.",
            "score": 8,
            "replies": [
                {
                    "author": "Entire_Tower1664",
                    "body": "Yeah would be nice",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Weak_Commercial_1580",
            "body": "This seems like it must have been hard to admit and write. I am 31 and struggling similarly, but I can’t talk about it or admit it. Proud of you.",
            "score": 7,
            "replies": []
        },
        {
            "author": "andythetwig",
            "body": "Some things to think about: Life is harder for lots of people and for lots of reasons. Maybe they lost a parent when they were young, maybe they are gay in a red state, maybe they were born with cerebral palsy. Some difficulties are visible, some aren't. But believe me when I say that privileged people - good looks, confidence, money, still find life hard because they will *invent* reasons why they are suffering. It's a state of mind. You are grieving for time wasted chasing something that was never attainable, and you should be allowed to grieve. But at some point I hope you realise that you are full of promise and talent. With the right help in the right parts of your life, you can achieve something different - maybe something even *better* than what you were aiming for before your diagnosis.\n\nWhat's awesome about getting an ADHD diagnosis is that you know *why* life is hard*.* SO now you can turn your gaze to the future, setting goals that are more achievable for someone with a brain as brilliant and infuriating as yours. Seek support in the things that you find tricky, and focus your energy on relationships that compliment the way you think and behave. You will be ok!",
            "score": 8,
            "replies": []
        },
        {
            "author": "Ok-Programmer-7703",
            "body": "I've been there. Your feelings will lie to you. Everything will feel all bad, then another day ... all good. Keep trying, regardless. Be kind. Sometimes, your progress isn't measured by your effort but by how you treat others on your journey. Let your failures teach you how it feels to fail, and encourage those around you when you sense their struggles. Lastly, your starting definitions of success might need adjustments. You don't win if you get married... you win if you are worthy of marriage. Society sells a story. If you have a high-powered job/wife/car/whatever, then you matter. You matter RIGHT NOW! You don't need a far away achievement to \"win\". Sometimes, putting a single article of clothing away is a win. Sometimes, choosing to endure is a win. Sometimes, it's just learning something new. There is so much to discover. Hang on. Breathe! (Hey.... you can breathe. Win!). Best wishes from far away. I pray you'll find hope in the darkest of times.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Shannonmn73",
            "body": "Remember that failure is one step away from success.  At least you are trying!  And you might fail 25 more times before you succeed but at least you are in the fight.  There's more to that and it sounded way better in my head. Lol. I feel bad sometimes that adhd'ers have to get advice from other ADHD people with the half thought out words of wisdom etc. Lol. But I think you get my meaning, right.  Life is a lot of \"failing\" but those make memories too and it will be all the sweeter when you do succeed.  \n\nI'm going to quit now.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Important-Pride-4250",
            "body": "Its tough. The only thing I could say is try getting some anxiety/depression meds.",
            "score": 3,
            "replies": [
                {
                    "author": "howdylu",
                    "body": "he needs adhd meds… the depression meds do not make you more motivated or happy. they make you numb",
                    "score": 0,
                    "replies": [
                        {
                            "author": "TrumpsCovidfefe",
                            "body": "It kind of depends on the person. For both my son and I, they worked a little (SSNRI). They helped us to feel less suicidal and less irritated and a bit less disorganized. Not much, but maybe 5-10 percent on the organization and 75-90 percent on the depression. I don’t think it’s really helpful to tell someone what they should and shouldn’t try, either way; but it is helpful to frame it as, “This is my experience; others with adhd have had different experiences.” \n\nRegardless, my heart goes out to OP because it can be a very long slog to get the right medication or even combo of meds plus therapy. It feels endlessly tiring sometimes. I have felt like OP before and I was having the thoughts and struggle that they are, and I had insurance thankfully, and I went  an intensive outpatient therapy program. They were able to make  medication changes quickly, had social workers to help me navigate things, and helped me reframe my brain. Unfortunately, I still wasn’t diagnosed with adhd at the time so it only helped so much, but it did help enough with my depression related to ADHD to get me more stable.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SocketByte",
            "body": "Felt exactly the same as you when I moved out of my parents house at 20. I really understand what you're going through. It feels like your brain is your biggest enemy in life, doesn't it?\n\nI really really really hope you'll be able to get a proper diagnosis and start medication. It's not as revolutionary as some may say, but it definitely helps. My depression is gone on ADHD meds, and no antidepressants worked before.",
            "score": 2,
            "replies": [
                {
                    "author": "Senhor_Alfredo",
                    "body": "Im on 300mg  Brupopiom and i don't see results whatsoever. It's been over a month. Finding a good doctor has been the hardest part",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SafetyProfessional16",
            "body": "You sound like my son, who is a bit younger than you but shares in your sense of despair. I know it’s hard to see past it now, but this won’t be your life forever. You can acknowledge that things ARE harder for you, because of ADHD and growing up during the craziest time in a long time, and then give yourself a break and find the ways that will make it easier. Seeking help is the best way to get started. Medication, support, routine, and good people in your life is my Handbook-getting acquainted with self-forgiveness is my advice. Finally, my observation-no one hates change more than ADHDers, but no one is better at implementing it to start life over(sometimes many times).❤️",
            "score": 2,
            "replies": []
        },
        {
            "author": "irrision",
            "body": "Honestly becoming an \"adult\" and taking on all the responsibilities that go with it was one of the hardest things I did. I don't know I had ADHD back then. I should have been in therapy and probably on meds. I know both of these things helped me when I was diagnosed at 40.\n\nDefinitely seek help from a psychiatrist and a therapist if you can. Consider trying meds if you haven't already, they might help you level things out enough to get a hold on your situation better.",
            "score": 2,
            "replies": []
        },
        {
            "author": "kori0521",
            "body": "Guess 5 years delayed (I'm 25) but I have the same exact issue. It's like I've written the post. I wasn't aware about ADHD until last year, which cleared my doubts about mywelf as a person at least. What I've done in these past 5 years was getting a license after 2 years of constantly failing the exams and dropping the university because I was thinking \"I don't like it so I don't care that much\". If I was aware sooner I might could have finished it or do something about it. I feel your strugle, every time I want to talk someone about it they just give me vague \"just do it\" like anwer/advices. Reading the comments below your post touched me just as much as probably you, thank you very much for this post. I will try and take some of the advices/motivation and hope you do as well :) At the end, you have 5 more years I've already wasted, keep your head up! I also fear that I'm wasting my lofe ritting with my toughts, not doing anything I dayream of doing or want to do (even if I clearly can), but then I try to remind myself that (hopefully) it's still only a third/fourth of our life spent, there is still a lot of time to change amd \"get going\". Wish you the best, and don't always feel bad not doing anything, sometimes it's needed, stressing instead of embracing your rest is not gonna make it better. I also dedicated this year for not doing anything until I get my appointment to the doctor..",
            "score": 2,
            "replies": []
        },
        {
            "author": "MCSmashFan",
            "body": "I feel you dude. Also 20 years old and I feel like I'm wasting so much time and life and not doing things. Barely have much energy to do things i gotta do.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ILoveSpankingDwarves",
            "body": "At 20 your life has started. Get therapy and take your meds.",
            "score": 2,
            "replies": []
        },
        {
            "author": "somethingdifferent84",
            "body": "My life just collapsed from the past twenty years of undiagnosed adhd, depression and anxiety. It doesn't have to end here. Fail, but didn't give up. You will find what works. Martial arts, dance, DND, faith, etc. something to fill your heart. Get with a doc that will work with you to find the meds that help. Therapist to help you learn how to anticipate and manage your behaviors. \n\nStart small and build a solid manageable life and add to it bit by bit to cultivate a full life. \n\nBut don't give up. I'm in the aftermath of not doing the right things, blissfully unaware of how it was harming me and those around me and resulting in multiple bad decisions with lasting repercussions. Not hopeless, but heartbreaking and life-changing.",
            "score": 2,
            "replies": []
        },
        {
            "author": "pianomicro",
            "body": "ADHD does not ruined your life. ADHD is our life.\n\nWe just learn to live with it.\n\nEveryone is born differently \n\nWe just born with ADHD. \n\nWe just need to name lemonade",
            "score": 2,
            "replies": []
        },
        {
            "author": "No_Cartoonist3711",
            "body": "If you have anxiety , you can try propranolol. Propranolol and methylphenidate works wonders for me to an extent.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Exact_Rabbit8232",
            "body": "i feel the exact same tbh, everyday i am just fighting to survive another day with my brain and not hate myself for only doing the bare minimum or even less",
            "score": 1,
            "replies": []
        },
        {
            "author": "OnlineGamingXp",
            "body": "On meds?",
            "score": 1,
            "replies": []
        }
    ]
}