{
    "title": "What do you love about yourself as someone with ADHD?",
    "author": "ContributionOwn6977",
    "subreddit": "ADHD",
    "rank": 12,
    "score": 27,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 47,
    "url": "https://www.reddit.com/r/ADHD/comments/1jec5g6/what_do_you_love_about_yourself_as_someone_with/",
    "id": "1jec5g6",
    "selftext": "Just to spread some positivity I thought it would be fun idea just to get every ones thoughts and words and it might help someone or maybe it will cheer someone up or maybe it will just be a lil fun thing!:)\n\nIts so important not only remind yourself of how amazing you are but to show others that it is possible to love yourself even if you have ADHD!",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/ContributionOwn6977 and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Future-Translator691",
            "body": "I love that I’m still really passionate about things (as a kid you hear so much - you won’t be like this when you’re older etc). I bring a lot of energy to a room still and people like to work with me or be around me and I think a lot of that comes from my personality - being positive, a problem solver, creative and passionate basically!",
            "score": 46,
            "replies": [
                {
                    "author": "perpetuallytrying",
                    "body": "Awe I LOVE THIS. We are great",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "wiggywoo5",
            "body": "Peoples seem to like me, even if i dont get on well with myself. So these kind of posts are mental health  \n\nsupport, thx.\n\nAlso sometimes i see a bigger picture about something. So i may not be good at chess, because i am busy looking around at whats happening in the room. I think many people with adhd can \"see the wood for the trees\". Maybe there is a connection to creativity with that :).",
            "score": 20,
            "replies": [
                {
                    "author": "Technical-Space5743",
                    "body": "It’s easier to think outside the box, when you are outside the box 😀",
                    "score": 11,
                    "replies": [
                        {
                            "author": "wiggywoo5",
                            "body": "Mind blowing point :)",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "zombiexcovenx",
            "body": "i think we tend to be more open minded and empathetic, but obviously thats not true for everyone with ADHD",
            "score": 19,
            "replies": []
        },
        {
            "author": "Tricky_Card_23",
            "body": "I work really well under intense pressure when everyone else crumbles. I think clearly for once. I am quick to act in dangerous scenarios instead of freezing. I’ve protected myself multiple times. I think my brain thrives in chaos.",
            "score": 18,
            "replies": [
                {
                    "author": "JmoneyHimself",
                    "body": "Same that’s why I love jobs that are fast paced/chaotic/diverse and hate jobs that are slow paced and always the same each day.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "CarLjpeg_",
            "body": "Even though we don’t want to we take a lot of short cuts and do things differently everytime BUT that leads to some crazy problem solving skills and ingenious ways of doing things. Hobby hopping is a struggle but has filled my life with so much more passion and learning. A jack of all trades is a master of none, but oftentimes better than a master of one! I feel like adhd gives me a leg up on being creative bc my brain pulls from crazy places of inspiration.",
            "score": 14,
            "replies": [
                {
                    "author": "TrumpsCovidfefe",
                    "body": "lol I am not the only one who has used “jack of all trades, master as none” to describe themselves. This sub is so surreal sometimes.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "kittyconetail",
            "body": "My problem-solving is quick. A lot of stuff \"just clicks\" because my thoughts go so quickly and attack the problem from multiple angles at once. Solutions can be unorthodox and efficient.\n\nE.g. my girlfriend is wiping off the kitchen counter. Crumbs need to fall into your hand or into the floor when you get to the edge of the counter. I'm holding a dustpan. It clicks that we can just hold the dustpan under the edge of the counter to catch the crumbs.",
            "score": 10,
            "replies": []
        },
        {
            "author": "Original-Thought7400",
            "body": "As much as it drives me crazy sometimes, there’s other times when I’m almost grateful to be on the go mentally all the time, because I have a lot of interesting thoughts and ideas that I might not have if I didn’t think about everything during physical downtime.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Variable851",
            "body": "The desire to learn when something is interesting to me. The hypervigilance that keeps me scanning my environment and picking up subtle movements and sounds. It's one of the most powerful tools I have in evaluations. That same trait has kept me alive and safe as a motorcyclist in the NY metro area.",
            "score": 6,
            "replies": [
                {
                    "author": "Rorymaui",
                    "body": "I am always scanning while I drive (eyes to mirror, car in front, cars around me) and my partner is even worse but he’s undiagnosed. I actually thought mine was from watching my dad drive like that growing up not ADHD related until I saw my partner drive and realized he looked very adhd as he drove. (My dad has adhd too though) When I pointed it out to him, he said he’s always drove like that and it helped him in the military.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DecemberPaladin",
            "body": "I’m too fucking stupid to give up.",
            "score": 6,
            "replies": [
                {
                    "author": "papierrose",
                    "body": "Oh fuck. Yep",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "arteai",
            "body": "Empathy, as someone always misunderstood and always screwing up I’ve been in the situation of feeling totally hopeless and I like to put me as “hey if I could do it you will totally crush it”",
            "score": 4,
            "replies": []
        },
        {
            "author": "Recent_Parsley3348",
            "body": "Middle child with ADHD…I👏🏼am👏🏼hilarious!",
            "score": 6,
            "replies": []
        },
        {
            "author": "NoReasonDragon",
            "body": "Creativity 100% 😎; but then execution 10% 😩",
            "score": 6,
            "replies": [
                {
                    "author": "johnnyorange",
                    "body": "If at all - damned executive function",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "passingcloud79",
            "body": "I’ve no idea if it’s anything to do with it, but I think I’m a kind and helpful person generally and like to help people out or give them a smile. I think this is what is most important for me.",
            "score": 5,
            "replies": []
        },
        {
            "author": "DJfade1013",
            "body": "I love my enthusiasm I have, & I like meeting people who have like their own thing & I learn from them even though it may not interest me. Just the fact that my friend is enthusiastic about it makes me enthusiastic about learning it. Now sometimes it becomes a hindrance some people find me annoying. Either you love or hate me it's okay I made an impact somehow someway",
            "score": 3,
            "replies": []
        },
        {
            "author": "SmallGlock",
            "body": "Relentless enthusiasm for life itself and the wide variety of interests I’ve accumulated over the years. My ability to understand and communicate emotions, people skills etc. Fulfillment with novelty too. \n\nI’m not sure how similar this is for others with ADHD but as I’ve come to understand myself and my condition, I can make peace with elements of it. I feel like a golden retriever. I’m simple and I love people. I try and approach life with an upbeat “make the best” of things attitude and find people rallying around me. I get chances to lead activities or organize events and it’s all so intuitive and natural for me.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Rasmusmario123",
            "body": "When I want to do something, I do not give up, **ever** (for better or for worse)\n\nOne of the proudest moments of my life was during the last year of my game development course. We had a group project to create a game over a year, and we were three days away from the deadline to submit it to the schools game awards competition. There were *so* mant bugs and unfinished features.\n\nI stayed home from school and worked non stop for the first two days. By this time, the artists gave up, and we were three programmers left. The first programmer clocked out at 23:00 the day before the deadline, the other left at 01:30. The game was still not in a playable state, so I stayed up until 06:00 writing the most nonsensical but functional code I've ever written. And when I was done, the game was too.\n\nWe didn't win anything, but we got nominated for three different categories which was a huge win.",
            "score": 3,
            "replies": []
        },
        {
            "author": "wakkha",
            "body": "I don’t give myself enough self love, but I can acknowledge now that yes I AM actually incredibly fun at parties. I have a ton of party tricks I learned from hyper focus, I’m very silly, I do impressions, I can play multiple instruments and act very well. Usually at a party or gathering you’ll find a group of people around me being amused by my antics. Because of bullying, it’s taken me a long time to accept that they are in fact laughing with me and not at me. But my wife has said many times that she can bring me around proudly because people are just drawn to me, and usually ask her to bring me back again soon.",
            "score": 2,
            "replies": []
        },
        {
            "author": "KeyWeakness7131",
            "body": "I love my ability to read people so easy. Especially when I know them for some time :)",
            "score": 2,
            "replies": [
                {
                    "author": "Rorymaui",
                    "body": "I’m thinking about turning it into a career somehow 🤣",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "TheTemplarSaint",
                    "body": "Sometimes it’s God-like, especially with a bit of life experience. \n\nMy wife “Oh my gosh, did you hear about Mrs. A and Mr. W?!” \n\nMe: “They…, for about the last 5 years?”\n\nWife: “Who told you?”\n\nMe: “My adhd brain, at that grill out 5 years ago”\n\nCan’t really provide details, or reasons. Just popped into my head after my brain took in cues no one else would notice if they tried. A glance, the way a word was said, the way someone said something about another person.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Appropriate-Food1757",
            "body": "I keep grinding.",
            "score": 2,
            "replies": [
                {
                    "author": "trashtrucktoot",
                    "body": "Grind or die.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "BarberGent",
            "body": "I love being the fun parent, lol.",
            "score": 2,
            "replies": [
                {
                    "author": "ContributionOwn6977",
                    "body": "Period🙌",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "alex_is_the_name",
            "body": "If it wasn't for ADHD I wouldn't know all the music that I enjoy today. I am also a musician, song writer and music producer and even though that hasn't really taken off in a form of a career, I enjoy every moment listening, creating and playing music. I've always said it's been my best friend and it will always will be. It's been there with my in my very darkest times and it's the only thing that has really ever understood me and help me feel my deepest and most challenging emotions.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ok-Pen-9533",
            "body": "I love how intuitive I am. \n\nIt takes me about three times driving a vehicle to learn it's ways, if you know what I mean. I notice the small things that make a difference. \n\nI can do a lot of things by feel that a lot of people can't do. Like shaving my legs in the dark and do a good job. \n\n edited to remove the Debbie downer part. This is about joy.",
            "score": 2,
            "replies": []
        },
        {
            "author": "papierrose",
            "body": "I’m super creative! In the artsy way but also in coming up with ideas and solutions that others don’t think of. I’m also really inquisitive which makes me adventurous, a good listener, and always discovering new things whether it’s knowledge or finding the best restaurant in town. I think I’m also pretty perceptive, quietly funny and have a sense of wonder that rivals my toddlers’.",
            "score": 2,
            "replies": []
        },
        {
            "author": "paprikahoernchen",
            "body": "I'm very open-minded and patient with other people's struggles!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Mindless-Ostrich-882",
            "body": "I am awesome in a clutch, I did well in high stress jobs. The after effect was awful. I know if it hits the fan I will be okay! I also love my sarcastic humor.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Serenaa12",
            "body": "Creative Jack of all trades (unfortunately master of none) from all the things now lie in the hobby graveyard. \n\nAlso stalking skills / ability to trace and find out things are ace.",
            "score": 2,
            "replies": []
        },
        {
            "author": "PossiblyN0t",
            "body": "I'm one more person in the world who understands and has patience for other people with ADHD.",
            "score": 2,
            "replies": []
        },
        {
            "author": "maltesemamabear",
            "body": "I really don't know anymore ... I used to love the creative part but I'm too burnt out to create anything ... also liked being physically hyper but the meds stole that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Itotekina",
            "body": "I love being the calm and collected one in an emergency!",
            "score": 1,
            "replies": []
        },
        {
            "author": "teamdoosh",
            "body": "Apparently I’m great at making educated guesses and a party pooper who figures out the premise of stories/movies/shows pretty easily. Also at scavenger hunts which aligns with what someone put regarding tracking I suppose. I play a mean game of Clue or Werewolf. \n\nI tend to be a quick learner often times hyper focusing on certain interests to an extreme amount. Cooking is my creative outlet so I will often times put a cooking show on like Iron Chef and enjoy the timed pressure.\n\nEdit: also great in stressful situations. Like too calm for people’s comfort calm but it’s been a great trait in my field of work. I also suspect my brother has ADHD and he translated his calmness in chaos to working as an ER nurse.",
            "score": 1,
            "replies": []
        },
        {
            "author": "fptnrb",
            "body": "I’m genuine and honest about what’s interesting. I am happy as long as there’s room to learn and grow independently. I get along well with people who are non-basic and creative and funny.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jadmcgregor",
            "body": "I love my creativity… I love that I’m calm in a crisis… I love solving problems!! Thank you for posting this!! I needed a boost today and this was a good reminder of the power of positive thinking!!",
            "score": 1,
            "replies": []
        }
    ]
}