{
    "title": "Doing the Thing",
    "author": "Star_Tool",
    "subreddit": "ADHD",
    "rank": 9,
    "score": 27,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/ADHD/comments/1jeh0mf/doing_the_thing/",
    "id": "1jeh0mf",
    "selftext": "I think what people struggle understanding the most is that someone with adhd wants to do the thing. They are actually excited and motivated to do the thing. They’ve thought about it a lot and have allotted time to do the thing. They just physically cant do the thing sometimes. All the planning in the world will not help. It just cannot be done right now. I also think that the person with adhd wants to understand why they cant do the thing. They grasp for more understanding of themselves and why they cant do things as simple as throwing away that one particular piece of trash. Self acceptance of the situation, at least in my case, is very important so as to not get to down on yourself when you just cant do the thing. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/Star_Tool and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Shelskharma",
            "body": "This post is amazing. I feel like I have been struggling to do ANY of the things lately… Life has been a dumpster fire. 😞 I’m trying to stay positive, which can be particularly tough when coming off of a pretty bad psychiatric period. I’m trying to make positive steps and progress… but sometimes I feel like “trying “ just isn’t enough… anyhow, thank you for this post- it is very validating. ❤️",
            "score": 4,
            "replies": []
        },
        {
            "author": "Imaginary-Stranger78",
            "body": "I feel this so much in my soul to just do \"the thing\", a thing, *any thing* and nothing comes out of it and then people around you are just silently judging you and wondering \"why you aren't like them\" or because you've always been that \"black sheep\" and now people don't even bat an eye at you and you wanna stay true to yourself but at the same time you wanna *DO THE THING* but now you don't know how or maybe don't want to, but you don't want to be \"left out\" and all you are doing now is just sitting in the void and waiting for *something* to happen or for it to all just \"end\". \n\nVery much trying and I have to even push myself a lot but I just wish there was some kind of guiding hand, anything to just push me in the right direction.",
            "score": 2,
            "replies": []
        }
    ]
}