{
    "title": "Wasting my life?",
    "author": "mrymoon",
    "subreddit": "ADHD",
    "rank": 13,
    "score": 11,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 26,
    "url": "https://www.reddit.com/r/ADHD/comments/1jeibic/wasting_my_life/",
    "id": "1jeibic",
    "selftext": "Anyone else feel like they’re wasting their life away? I have so much that needs to be done or can be done. Cleaning, organizing, hobbies, etc. but I feel like after like 4pm, I have nothing left in me. I just wanna rot on my couch. So if I don’t get what I need done by then, it doesn’t get done. And honestly I could/should do stuff all day but I just have no motivation. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hi /u/mrymoon and thanks for posting on /r/ADHD! \n\n### Please take a second to [read our rules](/r/adhd/about/rules) if you haven't already.\n\n---\n\n### /r/adhd news\n\n* If you are posting about the **US Medication Shortage**, please see this [post](https://www.reddit.com/r/ADHD/comments/12dr3h5/megathread_us_medication_shortage/).\n\n---\n\n^(*This message is not a removal notification. It's just our way to keep everyone updated on r/adhd happenings.*)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ADHD) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "turtlehana",
            "body": "Are you medicated? Cause that helped me.",
            "score": 3,
            "replies": [
                {
                    "author": "mrymoon",
                    "body": "Yeah I’m on Ritalin. I usually only take my morning dose even though it’s ordered twice a day.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "turtlehana",
                            "body": "I bet if you took it in the afternoon it’d help with that evening drive.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "mrymoon",
                                    "body": "I really should",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "ZeBugHugs",
                                    "body": "On Adderall not Ritalin, but so far my experience is not sleeping at all if I try to take it a second time in the evening. I hate just becoming a useless sack after work, but not sure how to find a balance of effectiveness in the evening while still being able to sleep",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Beadrilll",
                                            "body": "Is it XR or IR? Results will vary on your body and how it metabolizes, but if I take a smaller amount of my IR around 3 or 330, I can usually get some things done at home while falling asleep with melatonin at night.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "ZeBugHugs",
                                                    "body": "It's IR, XR up to 30 mg didn't seem to do anything. I've been 145 ish lbs for a decade so my metabolism probably laughs at anything not quick enough, sadly. The 10 mg of IR didn't seem to do anything either but maybe I should try again now that I have a reference point of what it feels like when it's working.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "turtlehana",
                                            "body": "Perhaps they can up your dose. I take Adderall in the morning and it wears off around 8pm. If I were to take a second dose I’d be up all night. \nRitalin is more of a 6 hour dose medication which is why it’s recommended twice a day.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "ZeBugHugs",
                                                    "body": "It seems layered for me. I take IR 30 mg currently, which is closer to 3-4 hours efficacy, and only 2 of those hours am I able to do high functioning tasks on demand, namely writing my book. After that I still feel alert for a while but I can't do the focus on command anymore.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "IntuitiveResearch",
                            "body": "Hardcore drugs then! you think that's helping?  \nsearch some forums like earth clinic and find some advice yo",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Traditional_Nebula96",
            "body": "That's me by 10 am... getting up at five 😭",
            "score": 3,
            "replies": []
        },
        {
            "author": "RealisticPin2660",
            "body": "I understand how it can feel. It often happens that we set a lot of goals for ourselves, but we can't find the strength or motivation to accomplish them. I struggle with this sometimes too, and what helps me is the “small steps” approach - not trying to do everything at once, but starting small. For example, eliminate one thing or do one action from your list, and that will help to gradually unload your day.\n\n\n\nYou don't have to think that you're wasting your life - sometimes it's just important to allow yourself a vacation. The important thing to remember is that small efforts eventually lead to results.\n\n\n\nIf you'd like, we can talk in private.",
            "score": 3,
            "replies": []
        },
        {
            "author": "AdministrationNo1715",
            "body": "A part of my learning process about discovering things about myself is a lot of redefining the way I think about these motivations and goals. Yes, I feel like I could be doing something more, but it doesn't mean that its a bad thing that I haven't\\*.  \nTo put simple, you have to reasonably believe that its okay. Even if its a cycle thats been going on for a while, don't guilt yourself. Remind yourself about that you got out of bed and acknowledge the things that you did do!\n\nIt takes a while, but you're learning about yourself. You're learning how you function as a person, and figuring out how to get better at doing or being able to do the things you want.\n\nIt was only 5 months ago I figured out my strategy of waking up early in the morning (at least 7 hours of sleep)  \nI have a problem waking up and randomly thought (What if I wake up, quickly take my meds and fall back asleep with another alarm waking me up 30 min later)  \nI've been doing that every single day without incident, and I got a double victory because I figured out that I can be very productive in the morning, but as soon as I sit down and do anything not productive (Mostly gaming)  \nI will not go back to being productive. Its just too difficult for me to. Instead of fighting it, I accepted that, and its easier for me to just avoid getting distracted when I wake up. So I don't allow myself to get distracted until a specific time of the day.\n\nThe times that I give in and distract myself and I just don't do anything productive though, I shrug it off and try to remember that its ok.  \nIts ok because I can try again, and I still have a chance to. Its ok because I believe its ok, as long as it doesn't actually effect my well being and living situation\\~  \nAnd if I get distracted again tomorrow, or still not as productive, its still ok. The most important thing is discovering more in depth about how your brain and body functions. You'll make it through, you've gotta believe that and try again. Oh! And don't try too hard\\~  \nIf you don't have it in you when you try again at 4PM or haven't figured it out, well you might as well relax and try again tomorrow!  \nYou can think on it as you just allow yourself to relax at the same time. It'll be alright \\~",
            "score": 2,
            "replies": [
                {
                    "author": "mrymoon",
                    "body": "Thank you so much. I love this",
                    "score": 1,
                    "replies": [
                        {
                            "author": "AdministrationNo1715",
                            "body": "No problem\\~  \nI'm really open about my thoughts on stuff like this. If you're ever in a tough spot, feel free to shoot me a dm! (I'm not on reddit super often though so I hope I catch it)\n\nOr double, triple message me or something its cool lmao",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "gojira_glix42",
            "body": "Man I came on reddit just now to post basically this. I'm so EXHAUSTED from 5 day workweeks working til 5. I spend 10 hours a day around work. Preparing for work in the morning. Commute to office in traffic. Plan an appointment or errand around a 1 hour lunch break or skip part of break another day to make break hour longer for Dr appt. Pack up, commute home in 5 o clock traffic. Oh and then I've got basically 4 hours before I completely shut down around 10, biologically based on circadian rhythm. \n\nBut my brain has been going 100mph all day, and I'm basically ready for bed by the time I get home, if I don't have to run an errand like grocery store right after work. And then making dinner? And then lunch for the next day? And then basic chores???!!! \n\nYou're not wasting your life. You're just stuck in a society that is so deluded into thinking we should be working all the time and never stop because the machine must go on. Because that rule is dictated by the select few who biologically were gifted brains that could go for the slow sustained burn and build systems that essentially enslave us. \n\nFind a better job that gives you more flexible hours. Or see about contract work and leveraging our unique ability to binge work and get stuff done way way faster than others and be able to move on to the next thing. (I say that in a job market that is NOT post 2029 and most definitely not post 2023 and current. Holy hell.)\n\nGive yourself more grace. Your brain isn't built for the society expected standard of brain function based on circadian rhythms. Square peg in round hole. Learn to shape yourself into a triangle and find a bunch of smaller triangles to fit in, instead of the perfect circle hole.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Sea_Resolve_470",
            "body": "Don’t be so hard on yourself if ur awake early and manage to be organised till 4pm maybe you earnt that time on the couch",
            "score": 2,
            "replies": [
                {
                    "author": "mrymoon",
                    "body": "I appreciate that, thank you",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Sea_Resolve_470",
                            "body": "You’re welcome brother we are always our own worst critics",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "IntuitiveResearch",
            "body": "you gotta think of your why   \nand what happens to you when you do nothing   \nit's about knowing you can do things   \nso systemising stuff is so important \n\nit's a really hard hole to get out of - best build a support network x",
            "score": 1,
            "replies": []
        },
        {
            "author": "FFFHAMS",
            "body": "Yes, I feel this way virtually all the time now. It’s a hard slog. I do nothing each day and every week or two I suddenly function fine for a few days. Those are the days that keep me alive, the rest are a sick torture brought on by the ultimate stalker. Long story short the coming times are going to require warrior effort to stay alive and survive.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PiesAteMyFace",
            "body": "No. I do feel that my life is full to the brim, and it would be nice to have 10+ extra hours in the day. I go no stop from 6 am to 9 pm, when kids go down. And at that point vegging in the armchair is all I can do.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sea_Resolve_470",
            "body": "At least ur not out on the street making trouble nothing wrong with wind down time everyone needs it",
            "score": 1,
            "replies": []
        },
        {
            "author": "Suprman21",
            "body": "Yes even medicated, I struggle to give myself any credit for things i do and just wallow in everything I haven't done yet.\n\nI am working on checking off easy stuff like getting out of bed or taking a shower etc to boost my perception of accomplishments",
            "score": 1,
            "replies": []
        }
    ]
}