{
    "title": "Why Was Gojo So Conservative in His Usage Of His CT?",
    "author": "CringeyDeeds69",
    "subreddit": "JuJutsuKaisen",
    "rank": 7,
    "score": 99,
    "upvote_ratio": 0.84,
    "num_comments (reported by reddit)": 44,
    "url": "https://i.redd.it/3syw67k6cdpe1.jpeg",
    "id": "1jdw4a0",
    "selftext": "Looking at Gojo's usage of limitless, I believe there is much more he could have done that would have resulted in fewer issues in the manga.\n\n\nIn, shibuya or Shinjuku:\n\nAfter hidden inventory, he was working on using multiple reds and blues at a time. I doubt he would not be able to do it after an extra decade of working on it. This is Gojo, not Geto with RCT.\n\nMoving forward, could he not have used multiple blues to restrain all limbs and hold an opponent still, or maybe even rip them in 5 pieces. It would have finished the disaster curses with the exception being mahito, and then Gojo would only need to worry about the transfigured humans.\nIt would throw off Kenjaku's plan as well since his timing would then be off. Leading to Gojo not being sealed and him joining in to Jump Uraume and Kenjaku.\n\n This also would have helped with Sukuna and a pre adapted Mahoraga.\n\nHad he this to sukuna in Shinjuku, he could have landed more hits, and possibly more black flashes, further shifting the tide of battle and making Sukuna transform earlier. Gojo would likely still die, but the chain reaction could cause Kashimo to reconsider jumping in as he did. Kashimo's extra firepower would help the squad big time, or he could have helped Hakari stall uraume. \n\nUsing science gojo could have reached even higher speeds using red and blue to narrow distance ahead of him while enhancing it behind him.\n\nHonestly I believe many JJK character could have been more powerful if they understood science.... Especially Jogo.\n\n",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "**If this post does not have a spoiler tag, SPOILER TAG MANGA COMMENTS**, or you risk a tempban. Keep it secret for the anime watchers.  Please remember that vague spoilers count as spoilers such as \"do we tell them\".\nIf you're caught up on the manga, consider joining our sister sub r/Jujutsushi for catered, in-depth manga discussion.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JuJutsuKaisen) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "cigiggy",
            "body": " He likes to throw hands and he doesn’t know everyone’s technique or traps that pop up",
            "score": 173,
            "replies": [
                {
                    "author": "CringeyDeeds69",
                    "body": "So would it not benefit him to restrain his opponent and deal with them quickly prior to any possible activation of CT or trap?",
                    "score": 34,
                    "replies": [
                        {
                            "author": "Plus_Aura",
                            "body": "Gojo already complains that his fights tend to be too short for him to even get any black flashes off.\n\nHonestly, it's probably because he doesn't really enjoy killing people right away. And when it came to the disaster curses, he was really enjoying himself torturing them.\n\nSo it's probably that Gojo just like to scrap. \n\nAlso, Gojo DOES use blue when he's hand to hand fighting. He uses blue to suck his opponents into his blows. Yuta and Hakari experienced this and said they immediately collapsed and threw up after 1 blow from a blue enhanced punch from Gojo",
                            "score": 93,
                            "replies": [
                                {
                                    "author": "CringeyDeeds69",
                                    "body": "\n\n>Also, Gojo DOES use blue when he's hand to hand fighting. He uses blue to suck his opponents into his blows. Yuta and Hakari experienced this and said they immediately collapsed and threw up after 1 blow from a blue enhanced punch from Gojo\n\n\n>And when it came to the disaster curses, he was really enjoying himself torturing them.\n\n\nIf he did enjoy torturing the Disaster curses, why not then use blue hold them still followed by repeated punches, to make his job easier. Jogo would have died but Hanami would have lived, especially since they survived a purple while off guard. He still could have tortured Hanami while working smarter, not harder.",
                                    "score": -37,
                                    "replies": [
                                        {
                                            "author": "vizmarkk",
                                            "body": "Cuz he wants a fight",
                                            "score": 41,
                                            "replies": []
                                        },
                                        {
                                            "author": "Plus_Aura",
                                            "body": "I mean yeah he couldve..but hindsight is always 20:20. It's easy to look back and say what shouldve been done different. Im sure youve made mistakes and later realized you could've taken smarter choices.\n\nCould Gojo have been like a machine and just go for the instant kill every single time? Sure but that's not his character either.",
                                            "score": 16,
                                            "replies": [
                                                {
                                                    "author": "CringeyDeeds69",
                                                    "body": ">I mean yeah he couldve..but hindsight is always 20:20. It's easy to look back and say what shouldve been done different.\n\nI'm very certain this is something that Gojo knew in the moment. 2.5 curses that couldn't even make him blink attacking him at once in a crowded subway is suspicious on several different levels. Gojo definitely is a risk taker, but he's not an idiot.",
                                                    "score": -20,
                                                    "replies": [
                                                        {
                                                            "author": "Legit-Or-Quit",
                                                            "body": "Gojo couldn’t use blue or red to any effective capacity in Shibuya in order to avoid collateral to all of the non-sorcerers. It’s also why gojo struggles to catch them and has to rely on baiting them into close quarters. Other sorcerers just being near already forces Gojo to hold back, non sorcerers would likely just be put through the meat blender if Gojo actually uses any remotely effective version of red or blue.",
                                                            "score": 15,
                                                            "replies": [
                                                                {
                                                                    "author": "Lonebarren",
                                                                    "body": "Also in Shibuya he still would have Won if it wasn't for Kenjaku stealing Geto and effectively stunning him with that.",
                                                                    "score": 6,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Worth_Lavishness_249",
                            "body": "Kenjaku did say something about restraining his output in shibuya.\n\nWill disaster curses die?yes.\n\nBut there will be after math,people are just too close.\n\nIn shinjuku he did use multiple  blue? Red on sukuna but that required his both  hands.\n\nWith sukuna ,idk if only gojo could do that bit they could sense that spark before ce activation. So move having tell and requiring both hands seems inefficient.\n\n\nEspecially due to mahoraga and agito.\nIn fight after attack gojo was actively trying to not give sukuna rest time.\n\n*not sure but he does attack him in shadows. So idk of its to capitalize on bf or just to not leave hidden danger.\n\n\nMahoraga was starting to adapt just attacking sukuna could just desummon if he thought any attack would one shot this guys if he could just chill in shaodws.*not sure since agito died. Especially mahoraga.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "achen5265041",
                                    "body": "Remember that Gojo limited himself to Blue and reinforced hits after he found Sukuna's gameplan to be getting Mahoraga to adapt to infinity/limitless. The two times we see him use red it was when Sukuna wasn't using Mahoraga to adapt (Once during MS, the other for Unlimited Purple)\n\nAs for Shibuya, Gojo was limited because of the civilians there.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "carl-the-lama",
            "body": "Shibuya: he legit would have deleted all the random civilians\n\nShinjuku: he did this a lot, but for red it’s best to put all your eggs in one basket.",
            "score": 72,
            "replies": []
        },
        {
            "author": "Wrath-of-Elyon",
            "body": ">Moving forward, could he not have used multiple blues to restrain all limbs and hold an opponent still, or maybe even rip them in 5 pieces. It would have finished the disaster curses with the exception being mahito, and then Gojo would only need to worry about the transfigured humans.\n\nPlease reread Shibuya to find out why he didn't use blue.",
            "score": 30,
            "replies": [
                {
                    "author": "meatykyun",
                    "body": "They literally dont read, honestly not even looking at the pictures.",
                    "score": 24,
                    "replies": [
                        {
                            "author": "Wrath-of-Elyon",
                            "body": "It's honestly ridiculous at this point. He got me interested with the science stuff at first, only to show he literally only looked at the pictures.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "CourtJester2512",
            "body": "he does throw multiple blues",
            "score": 18,
            "replies": []
        },
        {
            "author": "Iron0skull",
            "body": "1. His fights are already short enough \n2. Using alot of blue and red would make fighting boring\n3. Gojo just like megumi and sukuna enjoy fighting",
            "score": 23,
            "replies": []
        },
        {
            "author": "Open_Detective_2604",
            "body": "In Shibuya it's because of the civilians, in Shinjuku it's because of Maho.",
            "score": 11,
            "replies": []
        },
        {
            "author": "Bagelodon",
            "body": "well with sukuna he was perfectly aware that he was trying to get mahoraga to adapt to his technique. if he used more than blue it would increase the adaption rate and make red/purple unusable. so he chose to stick it out with conservative uses of blue/red to minimize the rate.\n\nup until sukuna the last person to really push him was toji so he had no real need to outdo what he had already achieved post toji training. nobody was even close to a challenge. when fighting sukuna he was smiling from the joy of being pushed to the max. and as a result he was learning and adapting too. if there were opponents strong enough to push him he’d have created some crazy new applications of his technique sooner.",
            "score": 14,
            "replies": []
        },
        {
            "author": "5YL_Portaler",
            "body": "Dont fuck with jjk fans they dont fucking read\n\n\n\n\nGojo didnt use blue or red (aside from blue punches) BECAUSE THAT WOULD'VE KILLED PEOPLE IN SHIBUYA \n\n\n\n\nBlue and red are too destructive for them to not kill everyone same for his domain and purple\n\n\n\n\nAgainst sukuna he did something similar but he couldnt really use blue to throw sukuna around since domain amp allowed sukuna to atleast neutralize the attraction of blue and he couldnt fully neutralize but mitigate the damage of red",
            "score": 6,
            "replies": [
                {
                    "author": "1095212dinomike",
                    "body": "He couldn't neutralize either. DA only neutralized the low output infinity but it could only weaken the strengthened output of blue and the reversed output of red. Either way blue and red alone don't have the speed and ap to take out a Sukuna using DA which is why Gojo had to mix it in with his h2h.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Important-Breath1297",
            "body": "Jogo could've been the deadliest, and that's a hill I'm willing to debate on.\n\nHaving Fire is shown to be weak in pop culture but once used correctly, you become OP.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bodynu",
            "body": "I’m not sure if it’s possible but one thing I was always wondering was if it’s possible to send limitless to stop someone from going somewhere and not just protecting Gojo. Opponent wants to dodge? Slide limitless around them and they just won’t be able to dodge. I understand why Gege didn’t do this though it would be just too broken.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Xcyronus",
            "body": "IN shibuya he doesnt want to kill everyone.  \nin shinjuku... ahem mahoraga.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lazydusto",
            "body": "Didn't he use Blue like you suggest against the axe guy during the Tokyo/Kyoto Goodwill Exchange?",
            "score": 1,
            "replies": []
        },
        {
            "author": "justrichie",
            "body": "Probably bc using blue to restrain something as strong as a Disaster Curse requires higher CE output. Gojo had to limit his output so he didn't accidentally harm the civilians.",
            "score": 1,
            "replies": []
        },
        {
            "author": "enthusiastic_box",
            "body": "Being overly generous with the application of his techniques when the opponent has Mahoraga is basically a death sentence. And the rest of the time he simply had no need to go all out. (In Shibuya he couldn't use them as he would have torn the civilians to shreds)",
            "score": 1,
            "replies": []
        },
        {
            "author": "realsirgamesalot",
            "body": "Didn’t he use multiple blues against the guy that wanted to turn him into a coat rack",
            "score": 1,
            "replies": []
        },
        {
            "author": "bad_squid_drawing",
            "body": "Could be gege forgot, or could be a young gojo over prepping for fights he's imagining- but in reality using multi simultaneous reds and blues would be so crazy destructive he never needs to and or he realized it can accidently make a purple bomb if he flings them to crazily and he opts for more controlled approach going forward.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TeaAndCrumpetGhoul",
            "body": "He literally used multiple blues and reds against sukuna in shinjuku. \n\nHe literally couldn't use blue or red in shibuya. Re read",
            "score": 1,
            "replies": []
        },
        {
            "author": "Asian_Persuasion_1",
            "body": "gojo did use multiple blues on juzo (axe man) and sukuna. he couldn't use his CT in shibuya because humans in the way. he could have used multiple reds against sukuna, except every single red he landed required a surprise attack to even land at all.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AyeAye90",
            "body": "IHe loves to fight. But he'll throw everything at them if his life is ever in danger....but I believe It was already explained that he couldn't use his CT because of the normies in shibuya.\n\nAgainst Sukuna, tbh I doubt it would work. also he didn't want to show Sukuna everything he has. Also Maho's adaptation. Yes he can do it but the only reason I can think of that would be why he would spam multiple blues and multiple reds would be to spam unlimited hollows. But this means megumi goes bye bye. Which is fundamentally against Gojo's character. Remember this is a guy who... probably the first thing he asked right out of the box was if the civilians in shibuya were okay? He talks tough but it really bothers him when innocents catch strays.\nAll this plus a tiny bit of plot induced stupidity.",
            "score": 0,
            "replies": [
                {
                    "author": "FlamingPoisonn",
                    "body": "If you're implying Gojo was holding back and not using all of his abilities against Sukuna, you're wrong.\n\nThe reason he was never able to fire off any attack he wanted was because he was fighting Sukuna, nothing else.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Healthy-Strategy3011",
                            "body": "Also he was forced to be limited with his abilties in the second half of the fight or else he would’ve just boosted Mahoraga’s adaptations even further.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "AyeAye90",
                            "body": "The reason he couldn't was because of Megumi and mahoraga's adaptation.This is a tired argument. Gojo casted multiple blues to sneak a red on Sukuna....which he could do nothing about. When he decides to cast an unlimited hp, he did, which Sukuna could do nothing about. When he was using Sukuna's face as skateboard, the peanut gallery was worried he was going too far...yet you think gojo planned on doing that unless he had no choice?\n\nThis doesn't mean he was holding back. If anything he made it harder for him due to megumi being hostage.  I know words are hard., but try to think about the difference between holding back and being restricted.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "FlamingPoisonn",
                                    "body": "You're so severely mistaken that regardless of how I explain it to you, you'll misinterpret it.\n\nGojo was not holding back, nor was he restricted. He was doing absolutely everything he could in order to damage Sukuna. He says this exactly.\n\nSukuna also had Domain Amplification off for half of their fight in order to adapt. That's the only reason \"Gojo was using Sukuna's face as a skateboard\".\n\nGo reread their fight and then come back to discuss.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "AyeAye90",
                                            "body": "Lol, the way you try to frame yourself as some authority is so funny 🤣 ...\"explain it to me\". Lmao \nSo loud and so wrong. If Gojo wanted to spam unlimited hollows to kill him, he would. Both times he spammed many blues and when he used an hp. Sukuna literally couldn't do anything to him.. I fear you're the one that's due for a reread.. if you have nothing better to say. Just go away with your delusions.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "1095212dinomike",
                                                    "body": "You're loud and wrong. Gojo wasn't wary of maho's adaptation until after the domain wars. Before then he would've been using blues and reds as freely as he deemed necessary. But considering that Sukuna at fp was able to react to and tank a buffed HP with just ce reinforcement, blue and red spam would never be enough to cause significant damage which is why he mixed it in to his h2h instead. The only time Sukuna \"couldn't do anything\" was when he turned his DA off so as to allow Mahoraga to adapt to Gojo's cts. You're the one who needs to reread.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "AyeAye90",
                                                            "body": "I was talking about the after domain wars you egg.\nI was talking about spam blue and reds for unlimited hollows you egg.\n\nThe first hp doesn't even count considering the distance and even then it took all in his tank to survive and still took his arms off. \nNo before gojo hit him with red he literally spammed multiple blue orbs which Sukuna couldn't do anything about...all of them can be exploded with reds you egg.\nWhen Gojo decided to finally use a hp Sukuna could do nothing about it despite Maho's adaptation you egg. \n\nIt's like y'all need a lesson in reading comprehension lmao.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "1095212dinomike",
                                                                    "body": "And YOU'RE STILL WRONG you egg. After the domain wars the ONLY reason Sukuna wasn't constantly using DA was to not interfere with Maho's adaptation meaning if it weren't for Maho he would still be using DA to weaken all of Gojo's blues and reds which even without DA are NOT enough to significantly injure him unless they're combo'd with Gojo's physical attacks.\nYou say Sukuna couldn't do anything about the blue spams is you yet again misunderstanding the fight as at that point Sukuna was purposefully on the defensive to give Maho time to adapt. I don't know where you got the idea that he was helpless against the blues seeing as he was literally dodging like 99% of them.\nAnd once again you Gojo was forced to detonate a hp on top of himself as he had no other way of getting one off against Mahoraga and Sukuna(who again wasn't using DA and so could only touch Gojo when Maho turned his infinity off) and this was after lucking out and restoring his output with multiples black flashes. So once again take your own advice and reread the manga you egg.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "AyeAye90",
                                                                            "body": "It wouldn't have mattered you egg. DA ain't saving him from hollow purple you egg. If DA was enough he. Wouldn't risk dying to get a technique useful for majorly one guy you  egg\n\n\nOhh not enough to significantly wound him but somehow was able to force him to use RCT till his CE levels dropped...l o fkn l\n\nYeah allows Maho adaptation BC he knows he'll lose without it.\n\nDetonated and was barely injured. Oh and that was because of maho you egg. No 3 v 1 means gojo can land it in a 1 V1 you egg.\n\nLol Sukuna was using DA when Gojo casted the multiple Blues that Sukuna could do nothing about before the red you egg. \n\nInstead of allowing the red to explode he could have connected with a blue and exploded him you egg.\n\nGtfo and Learn to read freaking egg. Gege doesn't care about your silly powerscaling you egg. No matter how you spin it Sukuna ain't stopping an unlimited hollow spam you egg.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "AyeAye90",
                                                                            "body": "It wouldn't have mattered you egg. DA ain't saving him from hollow purple you egg. If DA was enough he. Wouldn't risk dying to get a technique useful for majorly one guy you  egg\n\n\nOhh not enough to significantly wound him but somehow was able to force him to use RCT till his CE levels dropped...l o fkn l\n\nYeah allows Maho adaptation BC he knows he'll lose without it.\n\nDetonated and was barely injured. Oh and that was because of maho you egg. No 3 v 1 means gojo can land it in a 1 V1 you egg.\n\nLol Sukuna was using DA when Gojo casted the multiple Blues that Sukuna could do nothing about before the red you egg. \n\nInstead of allowing the red to explode he could have connected with a blue and exploded him you egg.\n\nGtfo and Learn to read freaking egg. Gege doesn't care about your silly powerscaling you egg. No matter how you spin it Sukuna ain't stopping an unlimited hollow spam you egg.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ApplePitou",
            "body": "He likes trolling during fights :3",
            "score": 0,
            "replies": []
        },
        {
            "author": "Smidog",
            "body": "real answer is because gege wanted it that way.",
            "score": 0,
            "replies": []
        }
    ]
}