{
    "title": "This is in my opinion one of the best kind of anime fights in terms of scale",
    "author": "ihatemylifewannadie",
    "subreddit": "JuJutsuKaisen",
    "rank": 2,
    "score": 373,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 26,
    "url": "https://i.redd.it/f0tvcfvxnhpe1.jpeg",
    "id": "1jebkdo",
    "selftext": "2 city block level characters just absolutely going CRAZY and destroying everything in sight. Just strong enough to destroy the environment with ease, just weak enough to actually use the environment against their opponent by throwing it to them. No crazy planet destroying blasts, no galaxy destroying punches, just straight blow for blow hands.\n\n(Artist is naguarama on deviantart)",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "**If this post does not have a spoiler tag, SPOILER TAG MANGA COMMENTS**, or you risk a tempban. Keep it secret for the anime watchers.  Please remember that vague spoilers count as spoilers such as \"do we tell them\".\nIf you're caught up on the manga, consider joining our sister sub r/Jujutsushi for catered, in-depth manga discussion.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/JuJutsuKaisen) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nook-Memer",
            "body": "I feel like the thing that makes jjk fights awesome is that they aren’t to over the top dragon ball one piece and stuff but also not grounded and normal \n\nCity block and city level is lowkey the best verse strength nobodies to over the top it just the perfect amount of destruction",
            "score": 90,
            "replies": [
                {
                    "author": "ihatemylifewannadie",
                    "body": "100% agree, not too much not too little.",
                    "score": 24,
                    "replies": []
                },
                {
                    "author": "AnividiaRTX",
                    "body": "Dragonball's scale is so overblown that it loses all meaning to me. A lot of other anime and manga struggle with this.",
                    "score": 18,
                    "replies": [
                        {
                            "author": "SubjectBodybuilder81",
                            "body": "always that one person complaining about dragon ball",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Entire_Whereas9531",
                                    "body": "Nothing wrong with that. You can enjoy something while at the same time be critical of it",
                                    "score": 14,
                                    "replies": []
                                },
                                {
                                    "author": "AnividiaRTX",
                                    "body": "There is actually atleast 2 in this instance. \n\nAnd I wasn't complaining about dragonball, I was complaining about dragonball super. I liked dragonball, and Z.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "bloopblubdeet",
            "body": "So far, this is the best fight in the JJK anime until Sukuna and Maho vs Gojo gets animated",
            "score": 46,
            "replies": [
                {
                    "author": "No-Arachnid-5940",
                    "body": "I can't fucking wait for this",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "Yasinator101",
                    "body": "I think kashimo vs hakari, Sendai 3 way, and Kenny vs Yuki / Choso",
                    "score": -3,
                    "replies": []
                }
            ]
        },
        {
            "author": "KJRex101",
            "body": "As a manga reader who was already in awe in how it played out originally, I just wanna say MAPPA outdid themselves and more when it came to adapting this one",
            "score": 10,
            "replies": [
                {
                    "author": "Doug_Dimmadab",
                    "body": "I read the manga after watching the anime, and it made me appreciate the anime so much more for animating Todo's black flash as hard as they did",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "ApplePitou",
            "body": "Mahoraga truly wins our hearts :3",
            "score": 5,
            "replies": []
        },
        {
            "author": "LuciPichu",
            "body": "What i wonder about JJK is what would you classify Sukuna as? Is he a Villain or an antihero kind of personality? Because you find yourself rooting for him when he takes over depending on who he's fighting.",
            "score": -18,
            "replies": [
                {
                    "author": "bloopblubdeet",
                    "body": "Has to be a villain no? \"Women and children crawling around like maggots! It'll be a massacre!\"",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "Nook-Memer",
                    "body": "Did you seriously just ask if. That mf was an anti hero? He’s pure villain",
                    "score": 25,
                    "replies": [
                        {
                            "author": "shjahaha",
                            "body": "Nah bro was just misunderstood trust.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ThePr0l0gue",
                    "body": "He literally eats women and children",
                    "score": 9,
                    "replies": [
                        {
                            "author": "shjahaha",
                            "body": "On everybody's soul we've all done that at least once.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "memeaccountokidiot",
                    "body": ">Because you find yourself rooting for him when he takes over depending on who he's fighting.\n\nthat just makes him a charismatic villain not an antihero",
                    "score": 11,
                    "replies": [
                        {
                            "author": "LuciPichu",
                            "body": "That sounds more like what I was going for. Thanks",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "alastor158",
            "body": "Why didn’t you mark it as spoiler? You just spoiled this part for me",
            "score": -15,
            "replies": [
                {
                    "author": "RhymeGoesFlyinnnn",
                    "body": "u dont even know what that white thing is before they start fighting",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "ihatemylifewannadie",
                    "body": "brotha do yuo even know what the white thing is suppsoed to be, all u know is that they fight and that its peak",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Reasonable-Business6",
                    "body": "1.) Season 2 dropped in 2023. Also in the manga this is barely even halfway through. Why're you on a subreddit if you're not even up to date on stuff like this.\n\n2.) Nothing in the screenshot shows any abilities you wouldn't have already seen Sukuna do.\n\n3.) You don't know who Sukuna is fighting",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}