{
    "title": "Rich and powerful people must actually score pretty low on Maslow's pyramid of needs.",
    "author": "Dododingo-",
    "subreddit": "Showerthoughts",
    "rank": 14,
    "score": 120,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 16,
    "url": "https://www.reddit.com/r/Showerthoughts/comments/1jbsq1x/rich_and_powerful_people_must_actually_score/",
    "id": "1jbsq1x",
    "selftext": "",
    "comments": [
        {
            "author": "Showerthoughts_Mod",
            "body": "/u/Dododingo- has flaired this post as a **casual thought**.\n\nCasual thoughts should be presented well, but may be less unique or less remarkable than [showerthoughts](https://www.reddit.com/r/Showerthoughts/wiki/requirements).\n\nIf this post is poorly written, unoriginal, or rule-breaking, please report it.\n\nOtherwise, please add your comment to the discussion!\n\n&nbsp;\n\n^^This ^^is ^^an ^^automated ^^system.\n\n^^If ^^you ^^have ^^any ^^questions, ^^please [^^use ^^this ^^link](https://www.reddit.com/message/compose/?to=/r/Showerthoughts&subject=Question%20About%20This%20Post&message=I%20have%20a%20question%20regarding%20a%20recent%20post.I%20understand%20that%20I%20may%20be%20banned%20if%20my%20question%20has%20already%20been%20addressed%20by%20the%20rules.) ^^to ^^message ^^the ^^moderators.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Antonela24",
            "body": "It's ironic, but once you have so much, the stuff at the top of the pyramid becomes elusive—like true respect, genuine relationships, and self-actualization. Maybe the simple life is where the real riches are.",
            "score": 13,
            "replies": [
                {
                    "author": "Dododingo-",
                    "body": "I would'nt go straight for \"simple\" life.I think the best place to achieve hapiness is enough money to cover basic needs and a reasonable safegard to eliminate immediate money-related stress, but not so much that you don't need to work at all. The freedom to chose your work is probably a big game changer too.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 35,
            "replies": [
                {
                    "author": "Riff316",
                    "body": "Or they have more time and leisure to pursue actualization since they don’t have to fight for the basic needs all the time.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "mrhorus42",
                            "body": "Maybe if your self earned, my example is my old friend who was born with the golden spoon. \nHe gets houses and apartments for free and started to study again at mid 30. \nBut he dosnt care about what he learns and the organization of the free houses actually stresses him, since he dosnt know how but also dosnt embrace becoming a full time landlord (he actually denies or downplays owning property towards his friends)\n\nHonestly he dosnt seem fulfilled in life just waiting to inherit more than he could ever make himself. \nThe part where you fight for your place in life (a job/position you like) he will never experience and it gave me a lot of chances to grow and discover myself, so id agree with the shower thought, bro lacking from to much money",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "whynothis1",
            "body": "Its empathy and compassion they score low on and, imo, is the difference between them and the rest of society. \n\nThey'll tell it's how smart they are and how hard they work but, most people will: A) know that's not true about them and B) even if it were, we all know smart people who work very hard who aren't rich and powerful. More so, the smartest in society generally tend not to fall for materialism and the will to dominate. \n\nThey don't work harder than a single parent, working 2 jobs or  junior doctor. \n\nIt's not just access to capital, as many people born to wealth don't become billionaires and the like. \n\nThe difference is always the extent to which they're willing to ruthlessly exploit and stamp down on everyone lower than them, as shamelessly as possible, to gouge the absolute most out of them and a cold, insatiable hunger and will to dominate. The results of which they hope will fill the hole in their soul where their parents love for them should've been.",
            "score": 5,
            "replies": [
                {
                    "author": "Dododingo-",
                    "body": "I don't disagree with any of the points you made, but I would not say that these are the specific reason for their unhapiness.\n\n\nMore like a mix of broken human interactions, absence of occasions to self reflects and, as you pointed, a deep knowledge that they don't deserve their situation.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "replies": []
        },
        {
            "author": "Painty_The_Pirate",
            "body": "Can’t do shit! Smells like shit. Must be Trump.",
            "score": -7,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Showerthoughts-ModTeam",
                            "body": "### Miscellaneous\n\nIn addition to the above, posts in /r/Showerthoughts may not be any of the following:\n\n* Based on specialized or esoteric knowledge or information\n* Nonsensical (as with \"The purple happy makes rowboat with appearance bumper.\")\n* Directed at, inspired by, or similar to posts that were recently offered anywhere on social media\n* Predicated on an opinion, preference, or personal belief (as with \"Since vanilla is the best flavor, X.\")",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Remarkable-Pirate214",
                    "body": "Don’t bring drump in the shower with me",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Painty_The_Pirate",
                            "body": "Sorry to rain on your shower, I’ve been in a doomsaying mood lately. I’ll stop, I might manifest something dangerous.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}