{
    "title": "The biggest difference between bravery and stupidity is simply whether or not it worked out in the end.",
    "author": "DerCatzefragger",
    "subreddit": "Showerthoughts",
    "rank": 6,
    "score": 206,
    "upvote_ratio": 0.85,
    "num_comments (reported by reddit)": 33,
    "url": "https://www.reddit.com/r/Showerthoughts/comments/1jdnmw9/the_biggest_difference_between_bravery_and/",
    "id": "1jdnmw9",
    "selftext": "",
    "comments": [
        {
            "author": "Showerthoughts_Mod",
            "body": "/u/DerCatzefragger has flaired this post as a **musing**.\n\nMusings are expected to be high-quality and thought-provoking, but not necessarily as unique as [showerthoughts](https://www.reddit.com/r/Showerthoughts/wiki/requirements).\n\nIf this post is poorly written, unoriginal, or rule-breaking, please report it.\n\nOtherwise, please add your comment to the discussion!\n\n&nbsp;\n\n^^This ^^is ^^an ^^automated ^^system.\n\n^^If ^^you ^^have ^^any ^^questions, ^^please [^^use ^^this ^^link](https://www.reddit.com/message/compose/?to=/r/Showerthoughts&subject=Question%20About%20This%20Post&message=I%20have%20a%20question%20regarding%20a%20recent%20post.I%20understand%20that%20I%20may%20be%20banned%20if%20my%20question%20has%20already%20been%20addressed%20by%20the%20rules.) ^^to ^^message ^^the ^^moderators.",
            "score": 1,
            "replies": []
        },
        {
            "author": "leave1me1alone",
            "body": "No. The intent matters. If you're doing something dangerous for a purpose then it's bravery. If you're doing it for no reason then it's stupid.\n\nRunning into a burning house to save a life? Brave.\n\nRunning into a burning house to grab your lunch? Stupid.\n\nRunning across a highway to save a baby? Brave.\n\nRunning across a highway to grab a 20 that fell? Stupid.\n\nYou can fail and still be brave. You can succeed and still be stupid",
            "score": 96,
            "replies": [
                {
                    "author": "Designer_Situation85",
                    "body": "Yea this is a much better take.",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "Dammit-Dave814",
                    "body": "This is the way.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "lankymjc",
                    "body": "OP is going with a child’s understanding of risks. \n\n“Don’t cross the road without looking!”\n\n“But I made it across fine!”",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "mr_ji",
                    "body": "You're describing gallantry.  Look up the difference between courage (the trait), bravery (the will), and gallantry (the motivation).  Maybe throw in valor (the way you do it).",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "OChemNinja",
            "body": "Someone had to be the first to try something. I wonder... for how many of those people was it also their last?",
            "score": 5,
            "replies": []
        },
        {
            "author": "lurflurf",
            "body": "I think it is still brave if it doesn’t work out. In fact it is even more brave if the person who does it believes it won’t work out.",
            "score": 5,
            "replies": []
        },
        {
            "author": "AnAdvancedBot",
            "body": "The biggest difference between bravery and stupidity is that they define separate (though sometimes overlapping) phenomena.\n\nBravery is a metric that defines acting in the face of fear, that is all. Something can be brave and stupid or brave and smart — that depends on the reasoning behind the bravery, not necessarily the outcome. \n\nStupidity is simply acting unintelligently. You can be bravely stupid… but you can also be a stupid coward.",
            "score": 4,
            "replies": []
        },
        {
            "author": "TheMuffler42069",
            "body": "Not true. You have to be brave to take the action not to live through it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "FrozenReaper",
            "body": "The people who tried to assassinate hitler were brave, even if they failed and ended up dieing because of it",
            "score": 2,
            "replies": []
        },
        {
            "author": "NAT0P0TAT0",
            "body": "the difference is whether or not you are aware of the risks, a stupid person can do something stupid and get lucky, doesn't mean they were brave\n\na stupid person doesn't really think about the potential consequences, or they incorrectly believe they're basically guaranteed to succeed and therefore the result of failure is irrelevant, so they just go for it\n\na brave person understands the danger and goes ahead anyway, knowing that they are taking a risk, ready to face the consequences if things don't work out in their favour",
            "score": 2,
            "replies": []
        },
        {
            "author": "Truck_guy",
            "body": "That sounds about right. Bad luck turns you into a fool, while success turns you into a hero.",
            "score": 6,
            "replies": [
                {
                    "author": "JackDeaniels",
                    "body": "I'd argue a lucky idiot is still an idiot. Just the fact you didn't die does not un-stupify your actions",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "TheMuffler42069",
                    "body": "Wrong",
                    "score": -2,
                    "replies": [
                        {
                            "author": "SirArgumentative",
                            "body": "Wow you sure added a lot to this discussion",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "TheMuffler42069",
                                    "body": "Did you see the other comments ? Because I did add a lot",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheMuffler42069",
            "body": "You see… you have to see the burning building then decide to risk your life to save those inside. Bravery doesn’t involve survival.",
            "score": 2,
            "replies": [
                {
                    "author": "GoldenSteel",
                    "body": "Yeah, but if you don't manage to save anybody then you're that idiot who committed suicide by fire.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "burgerking351",
                            "body": "I disagree, if you die trying to save people, you wouldn’t be remembered as an idiot. Most people would still think highly of your character and still give you some praise.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "TheMuffler42069",
                                    "body": "Exactly",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "TheMuffler42069",
                            "body": "Who said you can’t save people and die too ?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "replies": []
        },
        {
            "author": "imsaurabh3",
            "body": "There is always an element of ridicule when you try something new. Else, it wouldn’t be exciting.",
            "score": 1,
            "replies": []
        },
        {
            "author": "onedayilive-blog",
            "body": "Can we have both in our lives? It's normal, you know.\n\nWe need to be foolish for a long time before we become wise.  \nWe need to be fearful and broken many times before we become brave.",
            "score": 1,
            "replies": []
        },
        {
            "author": "thehightide255",
            "body": "Not failure, but low aim is the crime, for in great attempts it is glorious even to fail... (Bruce Lee, Striking Thoughts)  \nThe difference between a success and a failure is just that... you can be brave in a stupid attempt and you can be a coward in successful or just reasonable attempts! I don't think it's mutually exclusive and I get your point... \n\nThe biggest difference between bravery and stupidity is certainly that the one is more desired than the other by most people... but for some people, it is all the same, because it's just an expression of yourself at the time. Everyone can feel stupid sometimes and even the most fearful can find their courage at any time. It's not always the brave ones that are heroes! :) \n\nu/NAT0P0TAT0 has replied too, and they are right on! Less philosophical than me",
            "score": 1,
            "replies": []
        },
        {
            "author": "cadillacbeee",
            "body": "\"It ain't stupid if it works\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Confident-Court2171",
            "body": "The existence of the phrase “posthumous medal” disproves your thought.  The world is full of dead men who did something brave and didn’t have is “work out”.",
            "score": 1,
            "replies": [
                {
                    "author": "LegionnaireMcgill",
                    "body": "Thats usually when the goal is achieved but the dude died in the process.\n\n \"He boarded the enemy tank and threw grenades down the hatch until the entire crew was killed.\" - Gets medal\n\n\"He boarded the enemy tank and threw grenades down the hatch until the entire crew was killed, but he was shot and killed in the process\" - gets posthumous medal\n\n \"He intended to board the tank and throw grenades down their hatch, but he was shot and killed before he got there.\" - No medal. Maybe a letter from their CO to their family vaguely mentioning how he died heroically.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MacPhisto__",
            "body": "\"They're either incredibly stupid or incredibly brave\". \n\n*Or just really fucking hate us*",
            "score": 1,
            "replies": []
        },
        {
            "author": "marcorr",
            "body": "If you don't succeed, then you're just... \"testing the limits.\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Randleifr",
            "body": "Nah. Being brave IS being stupid. You’re only brave when doing something you don’t want to do.",
            "score": 0,
            "replies": []
        }
    ]
}