{
    "title": "ouch...who else relates?",
    "author": "No-Improvement-7614",
    "subreddit": "shitposting",
    "rank": 19,
    "score": 943,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 72,
    "url": "https://i.redd.it/g1e5kee26fpe1.jpeg",
    "id": "1je17ob",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Whilst you're here, /u/No-Improvement-7614, why not join our [public discord server](https://discord.gg/QpBGXd2guU) - **now with public text channels you can chat on!**?\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shitposting) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "ImZaphod2",
            "body": "Isn't that literally depression?",
            "score": 208,
            "replies": [
                {
                    "author": "Lethargo-Man",
                    "body": "Well could be... I'd rather describe it as dark numbness instead of sadness... Sometimes sadness is all you can get tho...",
                    "score": 73,
                    "replies": [
                        {
                            "author": "Ornery_Blueberry1541",
                            "body": "that's straight up depression my guy hot tip get a minimum of 8 hours of sleep for at least a month and if you don't feel any different see a therapist",
                            "score": 52,
                            "replies": [
                                {
                                    "author": "Lethargo-Man",
                                    "body": "Thank you, I know... I deal with that for a long time... It was diagnosed and I was on therapy few times before... Most times I can deal with it or at least am functional enough... I even do sports 3 times a week... Times are tough right now... I got an appointment in may. :)",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "TDA_Liamo",
                                            "body": "Exercise is good. Hope things get better for you dude 👍",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "author": "Lethargo-Man",
                                                    "body": "Thank you, kind stranger <3",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Desperate_Cucumber_9",
                                    "body": "Unfortunately, it’s near impossible to get 8 hours of sleep at night if you have clinical depression. I can manage 6, at most.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Lethargo-Man",
                                            "body": "I don't get 8 hours either... Since I use my cheap exercise bike I definetly sleep better most of the times... Getting started is hard when you are... Try building up a small routine in a lighter episode might get's you better thru a darker one. Took me years, but it works for now. It propably won't heal you but it helps you dealing with it. You ans I will find some way don't be too desperate, my little cucumber",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "drhko",
                    "body": "In my case yes",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Leanfanatic",
            "body": "Depression, on my shitposting sub?!",
            "score": 88,
            "replies": []
        },
        {
            "author": "ConstantWest4643",
            "body": "Because I clicked the sound icon, but there was no sound. 😔",
            "score": 41,
            "replies": [
                {
                    "author": "chaosanity",
                    "body": "Truly a dark day indeed…🥲",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "WidowmakerFeet",
            "body": "try drunk driving 😇",
            "score": 22,
            "replies": []
        },
        {
            "author": "Ballstoucher_47",
            "body": "First-world problem",
            "score": 60,
            "replies": [
                {
                    "author": "TheFalcon633",
                    "body": "The great thing about the internet is that rather than working through your sadness to make a better life for yourself you can just a find a bunch of other sad people and all agree that it’s (insert popular topic)‘s fault your life isn’t the way you want it to be and not your own fault thus taking all responsibility off yourself.",
                    "score": 55,
                    "replies": [
                        {
                            "author": "triitrunk",
                            "body": "Facts. The great thing about third world countries is you don’t have time to be sad or depressed when you’re literally trying to survive everyday.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "TheFalcon633",
                                    "body": "The best part about having a shitty childhood is that when you start at the bottom you have nowhere else to go but up and everything becomes a bonus.\n\nYou get to eat dinner: Bonus\n\nYou get to have a full nights sleep inside: Bonus\n\nYou can go to a doctor when you are in pain: Bonus\n\nYou don’t spend every day in constant fear: Bonus\n\nSadly cock size will never go up and that’s just a fact of life. Trust me I’ve tried.",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "lethally_",
                                            "body": "my cock size is variable. it rises whenever i see automod reply to me",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "PandalfAGA",
                                                    "body": "You should get flair for pee in your ass. That way you will always have huge cock",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "PooInTheStreet",
                            "body": "Well if the entire world were different i wouldn’t feel this way!",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Leogis",
                            "body": "And what if i'm sad because my job is ass and the job market is completely fucked ?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Hermeticrux2",
            "body": "Well considering most Americans and young people absolutely pump their brain with un-knowing dopamine releases, yea. Your baseline is gonna be shit. Porn, food, games, social media, drugs, TV, and literally everything is a dopamine release. Dopamine was meant as a reward to keep us functioning. Not an outlet for every passing moment to be drilled",
            "score": 29,
            "replies": [
                {
                    "author": "Victom123",
                    "body": "i cant hear you over my multiple gacha juggling daily routine while playing absolute brainrot youtube shorts on the side monitor",
                    "score": 23,
                    "replies": [
                        {
                            "author": "shattered_rip",
                            "body": "Relatable",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "klodmoris",
                    "body": "Funnily enough, it's common for thirld world countries populations to almost instantly get addicted to all dopamine releases you listed as soon as they get easy access to them.\n\nEvolution made us perfect energy acquirer and energy saving machines. And it did it with it's most important tool - dopamine. And now that we can get it more cheaply than even before.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Kimarnic",
                    "body": "Why exclusively Americans?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Hermeticrux2",
                            "body": "Because I live in America.  Idk what the fuck is going on in China. And damn speaking of that. Why is the default setting for reading comprehension now drawing conclusions specifically for the sake of debate.\n\nSaying most Americans means most Americans. It doesn't mean EXCLUSIVELY Americans. That isn't what the fuck I said. God damn I'm over this fucking Internet bullshit.",
                            "score": -5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Electric4ce",
                    "body": "This is most likely the correct answer",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "SarenSeeksConduit",
            "body": "It's not that it's bad; it's that it isn't what you want it to be.",
            "score": 4,
            "replies": []
        },
        {
            "author": "JaimesBourne",
            "body": "Go buy a fishing pole with a bobber and hooks. Grab some red worms or night crawlers. Go to a pond by yourself (anytime of day) cast out and relax. Hobbies help, fresh air helps, and nature is great. \n\nYesterday, I literally watched a bald eagle swoop down and grab a fish from the water I was fishing. It was awesome",
            "score": 6,
            "replies": []
        },
        {
            "author": "Spare-Yellow182",
            "body": "Saluta vitam tuam, non licet convertere. Nobis dormientibus, spectaberis gerere te quam optime. Praesta terga naturae, omnes optant mundum regere. Est consilium meum, Est conscientia mea. Adiuva ut decernam, Adiuva ut augeam libertatis gaudiique. Nihil  umquam est aeternum, omnes optant mundum regere. Locus est ubi lux te inveniet non, tuas manus teneo dum paries corruit. Cum acciderit, ero tecum, Maxime gaudeo hoc potiri, Contristor hoc deleri. omnes optant mundum regere. Non fero hanc dubitationem iunctam improvidentiae. Omnes optant mundum… Dic mihi numquam numquam  numquam opust est hoc. Cur credis unae inscriptioni? Omnes optant mundum regere. Omnia ad libertatem gaudium-que Nihil  umquam est aeternum, omnes optant mundum regere.",
            "score": 5,
            "replies": [
                {
                    "author": "Ketchup_inhaler",
                    "body": "Lacrima pro Timor 💪",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Squidich",
            "body": "I work at retail and i like to help customers. My coworkers are nice people that i'd be able to call friends and i live alone with my cat but my family still supports me and often invites me for dinner. \n\nYet whenever i come back from work and be able to hold my cat in my arms, i always feel relieved from stress and sometimes end up crying. \n\nI don't feel bad yet ig my body always feels overwhelmed.",
            "score": 2,
            "replies": []
        },
        {
            "author": "I_LOVE_BREAD_FR",
            "body": "Well it's my fault I can't enjoy it",
            "score": 1,
            "replies": []
        },
        {
            "author": "justarandomguy902",
            "body": "yes, me",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jidolman077",
            "body": "However when I tell my dad\n\nHe says “I wanna watch bobs burgers”",
            "score": 1,
            "replies": []
        },
        {
            "author": "bgaesop",
            "body": "I relate in the sense that I wonder why so many people with good lives are sad, yes",
            "score": 1,
            "replies": []
        },
        {
            "author": "lespectaculardumbass",
            "body": "Mine is",
            "score": 1,
            "replies": []
        },
        {
            "author": "HollowWarrior46",
            "body": "It’s important to not take what you have for granted. But it’s also ok to realize that you aren’t happy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RunInRunOn",
            "body": "My slow hire archie of needs",
            "score": 1,
            "replies": []
        },
        {
            "author": "Awesomeness7716",
            "body": "Me :( But my depression medication is making things worse",
            "score": 1,
            "replies": []
        },
        {
            "author": "Guiding_Lines",
            "body": "It’ll get worse",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tenuous_Tangent",
            "body": "I did everything in my life right. Went to college. Graduated. I have a good steady job. \n\nAnd I still feel like a piece of garbage.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LiquidMetal616",
            "body": "Used to be depressed before I saw how connected everything was\n\nI literally cannot name a \"bad\" thing that has happened to me that hasn't led me to good eventually\n\nFor example my mother passed when I was very young, yet it was the best thing that could have happened to me\n\nAs I grew up and matured I began to realize just how miraculous it was to have a house, food, water, entertainment, friends, family, etc\n\nI became much more grateful\n\nI also realized most of my \"depression\" was actually just me  dealing with negative thought patterns. I stopped listening to the voice in my head when it would say fucked up shit lol\n\nAnother huge thing people don't wanna admit is that they probably aren't doing what's best for themselves. You'll be less depressed if you stop drinking alcohol and start working out for example but it's tough putting in effort from a place of sadness\n\nIt's weird because becoming \"happy\" only takes shifts in perspective but your depressed ego tries to tell you it's impossible. For whatever reason if you're depressed for long enough it becomes \"comfortable\" for you and that is your normal state of mind because that's what you're used to.\n\nIt took a while to realize happiness was a state of mind as well. Lots of people attach \"happy\" to material gains. As in \"I'll be happy when I get my mansion or girlfriend\". And that shit is always only temporary and not very useful because the ego will always want more more more! Gotta be happy with what you have and God takes care of the rest\n\nLast thing I'll say is sometimes the biggest tragedies are actual miracles in disguise. Next time something fucked up happens try and take a different perspective and see how it might be setting you up for future stuff! Black Sabbath can't write War Pigs without war lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Agent_5021",
            "body": "i wish i knew man, best i can do right now is tell you to try and look for something missing, like i feel like i'm lonely so i'm looking to fill that void somehow, meet someone who could do that, maybe start a family? or maybe i just lack purpose, i guess, i'd rather live trying to look for something than accept that nothing can be fixed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ShitFuck2000",
            "body": "Im homeless broke and have advanced liver disease, frankly Im mostly content but kinda bored 🤷",
            "score": 1,
            "replies": []
        },
        {
            "author": "ggdogelmao",
            "body": "It's not bad, it's actually worse 🥲",
            "score": 1,
            "replies": []
        },
        {
            "author": "Akrylkali",
            "body": "The internet feeds the void in us, but it's never satisfied.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ZellHall",
            "body": "I had this for a few days now, I still don't understand why and it's painful. I just hope it will soon go away, like it always does",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nekromant-IV",
            "body": "I can't, but i think that has mostly to do with me not being a little bitch. 🖕",
            "score": 1,
            "replies": []
        },
        {
            "author": "EternalHuffer",
            "body": "Me",
            "score": 2,
            "replies": []
        },
        {
            "author": "AverageRandomPerson",
            "body": "Oh my goodness, folks, I need your help once again! 😅😅 This is the fourth time—yes, you heard me right, the FOURTH time—I'm coming to you with this conundrum. There's this individual, a character so suspicious that they practically have \"Shady McShaderson\" written all over them. They've slithered into my messages like a sneaky little snake, and they've done something truly outrageous. They've sent me a message, a message filled with dubious vibes, and within that message, they've included a link. A link that looks as suspicious as a cat in a dog park 🤗🤗😅\n\nNow, I know I can be a bit too trusting, maybe even a tad gullible 🥱🥱, but my spidey senses are tingling. This shady stranger is practically radiating sketchiness. Their message is like a neon sign flashing \"SCAM ALERT!\" But, being the cautious and curious person that I am, I thought I'd turn to you all for advice. Should I click on this incredibly suspicious link? I mean, it’s just a little hunch I have that this might not be entirely safe. What do you think? Could it possibly, maybe, potentially be a scam? 🤔🤔\n\nI need some enlightenment here, folks! I'm on the edge of my seat, heart pounding, palms sweaty, hoping you'll provide some wisdom before I make any rash decisions! What say you? 😅😅",
            "score": 1,
            "replies": [
                {
                    "author": "Artificial0937",
                    "body": "not gonna read that",
                    "score": 26,
                    "replies": [
                        {
                            "author": "AverageRandomPerson",
                            "body": "I've spent 2 whole minutes finding the right pasta and this is what the world thinks?!\n\nI'm dropping out of shitposting school.",
                            "score": 16,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DatCheekyHeretic",
                    "body": "Have you tried hard drugs?",
                    "score": 12,
                    "replies": [
                        {
                            "author": "A_random_poster04",
                            "body": "I tried the stupid drug",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "TheFalcon633",
                                    "body": "This vexes me.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Kimarnic",
                                            "body": "I am too in this comment section",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Professional_Age9970",
                            "body": "I may suggest KCN for permanent solution",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "lethally_",
                                    "body": "and... how to synthesize it?",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "drhko",
                    "body": "Halbe Bibel ganzer Hurensohn",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "weirdminecraftwalrus",
                    "body": "your palms are sweaty? are your knees weak and arms heavy, by any chance?",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Gordo_Mamon",
            "body": "Yeah, but, lt IS that bad",
            "score": 1,
            "replies": []
        },
        {
            "author": "Stargate_1",
            "body": "Real",
            "score": 0,
            "replies": []
        }
    ]
}