{
    "title": "🥲🥲📡",
    "author": "RunsInNaruto",
    "subreddit": "shitposting",
    "rank": 15,
    "score": 226,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 5,
    "url": "https://i.redd.it/sy5i5skhohpe1.jpeg",
    "id": "1jebn50",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Whilst you're here, /u/RunsInNaruto, why not join our [public discord server](https://discord.gg/QpBGXd2guU) - **now with public text channels you can chat on!**?\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/shitposting) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "snaip_",
            "body": "give me your seed",
            "score": 37,
            "replies": [
                {
                    "author": "TheBosstin12",
                    "body": "Alright, no clue what that has to do with minecraft though",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Jan_Vydra",
            "body": "\"Then i got home And played Minecraft\"",
            "score": 9,
            "replies": []
        },
        {
            "author": "mydudeponch",
            "body": "LMAO\n\nYou know how it's fun to watch a child interact with the world for the first time and have their own experiences through their perspective. That is what this post is to me. \n\nAOL used to send you free drink coasters that you could pop into your disk drive and have access to chatting with so many random people. Some of us thought it would be fun to agree with some of the dumber people and then defend them from others who weren't getting the joke. So we did that every day after school. It never really stuck and was all fun-and-games till facebook became public. All of a sudden the people we were joking with found each other and started reaffirming their ideas. The proofs they would come up with were more hyperbolic than anything we ever imagined, but they believed it. We created an ideological monster from humor, lies and suspicion. You other apes know who you are. It was funny at first and we were all pissin ourselves laughing. But this is the end result. We've successfully corrupted generations through trolling. Why does this feeling of success feel so hollow. We did it guys... They actually believe it now. Now with everything going on it feels like we contributed to the downfall of society in our own way, and I'm not sure if there is a way to fix it.",
            "score": 3,
            "replies": []
        }
    ]
}