{
    "title": "The race for 1st in Atlantic is intensely close",
    "author": "I_Am_Vladimir_Putin",
    "subreddit": "hockey",
    "rank": 7,
    "score": 1132,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 277,
    "url": "https://i.redd.it/9qmpbi41agpe1.png",
    "id": "1je4z83",
    "selftext": "",
    "comments": [
        {
            "author": "dchowchow",
            "body": "Man. Tampa has been on a tear.",
            "score": 291,
            "replies": [
                {
                    "author": "MomsTortellinis",
                    "body": "Vasilevskiy is so good, everyone is (rightfully) loving Hellebuyck this season but Vasilevskiy is on a 920 save pct age well.",
                    "score": 156,
                    "replies": [
                        {
                            "author": "BiscuitsMay",
                            "body": "That’s 920 after starting the season very average. He probably was around 900 after the first 15 starts.",
                            "score": 93,
                            "replies": []
                        },
                        {
                            "author": "Suspicious_Radio_848",
                            "body": "Man has back to back cups, he’s an amazing goalie.",
                            "score": 29,
                            "replies": []
                        },
                        {
                            "author": "Kronzor_",
                            "body": "Vasi yes, but they also score the most out of any of these teams.",
                            "score": 24,
                            "replies": []
                        },
                        {
                            "author": "bloodrider1914",
                            "body": "And I thought he was washed at the beginning of the season",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "steelhorizon",
                                    "body": "Back surgery ain't no joke ",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "kozed",
                    "body": "MTL, FLA, TB, OTT & TOR are all in the top 11 NHL teams for the past 3 months.\n\nThat's about half, all from the same division.",
                    "score": 52,
                    "replies": [
                        {
                            "author": "ZedisDoge",
                            "body": "Atlantic division being the murderers’ row, whats new :’(",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "dekusyrup",
                                    "body": "Somebody in toronto made a wish on the monkey's paw for boston to not be so good and this is what happened.",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "dae5oty",
                                    "body": "Atlantic is the new AL East",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Brittle_Bones_Bishop",
                    "body": "Its weird the first 12-15 games were 50/50 once we got to mid November they turned it on until January where they were hot garbage, February comes along and we dont lose a game and march got a little shaky after the tradedeadline but have had a couple goodins since. We have 6 players over 20 goals 3 over 30 with Kuch sitting at 29,  and of all things Vasy is back on his shith a .920 SV% and 32 wins on the season.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "CavilAtRest",
                            "body": "Strength-of-schedule is a hell of a drug. From what I recall Tampa's early season matchups were a lot tougher.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "noigmn",
                                    "body": "Moser's return from the injury where he collapsed on the Kadri goal was probably the biggest factor, at least recently.  \n\n\nWe were playing well but up and down while he was out. We started our recent hot streak right after he returned.  ",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "gstringwarrior",
                    "body": "They added big time at the deadline too.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "benabramowitz18",
                    "body": "Tampa was so far ahead in goal differential, that I called them winning the Atlantic in December.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "kingkellam",
            "body": "Bolts/Cats and Leafs/Sens first round is within reach, you love to see it",
            "score": 330,
            "replies": [
                {
                    "author": "bigboycig",
                    "body": "I do NOT want to face the lightning again for the 800th time",
                    "score": 112,
                    "replies": [
                        {
                            "author": "ADrunkMexican",
                            "body": "Neither do i, lol. I don't know what the best scenario for us to avoid the Panthers or Leafs, lol.",
                            "score": 28,
                            "replies": [
                                {
                                    "author": "bigboycig",
                                    "body": "U have to win the division so the leafs and panthers will play eachother in the first round",
                                    "score": 20,
                                    "replies": [
                                        {
                                            "author": "ADrunkMexican",
                                            "body": "Fuck lol",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "vassman86",
                                                    "body": "... Double fuck lol",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "andontheslittedsheet",
                            "body": "Well the rest of the league does because the hockey is dynamite lol",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "pavlovedoncaffeine",
                                    "body": "who knew florida man hockey goes this hard",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "bigboycig",
                                    "body": "Should be florida vs tampa in 2nd round so theres a 100% chance a florida team will reach the conference final (to try and continue the florida team stanley cup final streak)",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "MildlyResponsible",
                                            "body": "Forget the Florida streak, in the last 6 Finals, there have been 7 teams from the Atlantic.",
                                            "score": 17,
                                            "replies": [
                                                {
                                                    "author": "mrcelerie",
                                                    "body": "that streak is probably more unbreakable than any other records in hockey unless there's a playoffs reform. only other way it happens is if we get an other one time special playoff like we had due to covid AND 6 years straight with at least one team",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "andontheslittedsheet",
                                            "body": "Fine by me! See you there :)",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ugh168",
                            "body": "😂",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "Skwurt_Reynolds",
                            "body": "I understand the reasons of why this format was put into place, but I am seriously fucking bored of the matchups.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "bigboycig",
                                    "body": "Florida (the state) is just too good at hockey",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "CanuckPanda",
                    "body": "I want Sens because I’m old enough to remember the Battle of Ontario series(plural) of the early 2000’s. \n\nBring that back, please.",
                    "score": 30,
                    "replies": [
                        {
                            "author": "kingkellam",
                            "body": "I've never seen a leafs/sens series so I think it would be cool, but I wouldn't be opposed to the Sens stumbling a bit, the Habs continuing this .800 point% pace they've been on, and getting a 2021 r1 rematch",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "ADrunkMexican",
                                    "body": "Those were peak times in the playoffs, lol.",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "babypointblank",
                            "body": "Please no I hate a strong Leafs/Sens rivalry. Just let the Panthers or a strong Bruins team wallop us instead.",
                            "score": -7,
                            "replies": [
                                {
                                    "author": "okmijnmko",
                                    "body": "Leafs/Sens rivalry is more fun for Canada, win/win. Money stays more local for the economy too.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ADumbSmartPerson",
                    "body": "Honestly as a leafs fan that is probably the path that is best for us instead of trying to go through Floriday/Tampa (although OTT has the leafs number so even that is scary) but I would love for the leafs to beat Tampa in the first round, Sens to beat Florida, and (a man can dream) Habs beat the Caps. That is my dream first round. All 3 Canadian teams making it to the second round and having a potential for a leafs/habs ECF. The only other thing I would love but would probably kill half the leafs fan base due to heart attack would be if we beat Tampa in the first, Florida in the second, Boston (unlikely for them to make it but you never know) in the ECF then the Jets. Ultimate revenge tour.",
                    "score": 24,
                    "replies": [
                        {
                            "author": "Kronzor_",
                            "body": "I disagree. I would rather lose to Florida or Tampa, since I won't have to hear it from their fans so much. Sens fans will be absolutely insufferable if they knock the Leafs out. I'll have to quit this subreddit lol.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "ADumbSmartPerson",
                                    "body": "Well you make excellent points. None of which would matter if the Leafs could just win the Stanley Cup for a change!",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Kronzor_",
                                            "body": "Yeah. Like imagine us if we won the Stanley cup? Beating the leafs in the playoffs IS the sens Stanley cup. That's the level of unsufferablity we're up against.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "CoupleScrewsLoose",
                                                    "body": "ok but winning a round is the Leafs cup too so we really can’t talk",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Kronzor_",
                                                            "body": "I don't think so. I think it's the minimum acceptable. Leafs fans are annoyed because we usually get less than we'd accept",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "CoupleScrewsLoose",
                                                                    "body": "precisely why the fanbase celebrated hard when we finally won a round. chirping other teams for what they would hypothetically do if they beat us in the playoffs is embarrassing when we practically had a parade downtown the night we finally won a round in nearly 20 years.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Voljjin",
                                    "body": "You got that right.",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "sameth1",
                                    "body": "Why don't they just agree to beat Florida and Tampa in round 1 then face in another round?",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "jjaime2024",
                                    "body": "Would not be the Sens fans its he Leafs fan that could not handle it.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "No_Annual_4647",
                                    "body": "gotta keep in mind to a sens fan that can remember the early 2000s in that era the leafs are to them what the bruins are to leafs fans but even worse because its toronto, just pure misery and losing over and over in the playoffs. like the year they were heavily favoured and swept the regular season series only to get swept by the leafs where they didnt even score a goal until the 3rd period of the 3rd game. between that and the \"little bro\" feeling with toronto and the just passive aoe disrespect they get from us they are going to be talking generational shit if they beat us in the first round and probably deservedly so",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Kronzor_",
                                            "body": "I think that it's more than that even. The Sens fandom is predominantly born of Ontarians that didn't want to support the Leafs. Many of them rooted against the Leafs before the Sens even existed.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "raptosaurus",
                            "body": ">although OTT has the leafs number so even that is scary\n\nThey did in the regular season in the 00's too and we all know how that turned out",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "FactOrFactorial",
                            "body": "I wouldn't *HATE*  for a Canadian team to finally win the cup. It's been what, 50 years or something?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "dekusyrup",
                                    "body": "30ish.  early 90s montreal.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MegaPhunkatron",
                    "body": "God that would be so fucking sick",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "I_Am_Vladimir_Putin",
            "body": "Wouldn't be surprising at this point if playoff seeding will come down to last game of the season for these teams",
            "score": 464,
            "replies": [
                {
                    "author": "__TheWaySheGoes",
                    "body": "Kinda refreshing from knowing who we were playing months in advance in previous years.",
                    "score": 278,
                    "replies": [
                        {
                            "author": "jonmorrie",
                            "body": "Not sure if you recall last year but Toronto played Florida in game 81 or 82. Florida won, stealing the 1 seed from Toronto on the last day",
                            "score": 77,
                            "replies": [
                                {
                                    "author": "ghost_curse123",
                                    "body": "You were fighting with Boston for the division, we were solidly 3rd in the division at that point",
                                    "score": 127,
                                    "replies": [
                                        {
                                            "author": "jonmorrie",
                                            "body": "Ah good call, you're right it was Boston. Either way my point stands, y'all didn't know who your opponent was until game 82",
                                            "score": 40,
                                            "replies": [
                                                {
                                                    "author": "mcauthon2",
                                                    "body": "except in our heart of hearts we knew it was Boston",
                                                    "score": 76,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "ghost_curse123",
                                                    "body": "We knew in our hearts that it was always going to be Boston",
                                                    "score": 56,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Lightscreach",
                                            "body": "Leafs were 8 points back of the Panthers to finish the season.  It’s funny how quickly people were upvoting the Leafs losing the division when it wasn’t even correct",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "__TheWaySheGoes",
                                    "body": "I think that was Boston you stole it from but yeah I guess it did alter who our opponent was.",
                                    "score": 41,
                                    "replies": []
                                },
                                {
                                    "author": "bigman000000",
                                    "body": "Florida took the top spot from Boston last year",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Do_it_for_the_upvote",
                                    "body": "Toronto anti-clutching? A tale as old as time.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DMHavoX",
                    "body": "Florida plays Toronto 2 more times this season (@Toronto 4/2 and home on 4/8 with 4/8 being the first of a back to back for the leafs). \n\nFlorida plays the Tampa Bay in Tampa as their last game of the season on 4/15.\n\nToronto plays in Tampa on 4/9 (second of a back to back, playing the Panthers the night before).\n\nIt could get very interesting.",
                    "score": 24,
                    "replies": [
                        {
                            "author": "dekusyrup",
                            "body": "Pretty sure the final stretch of the season schedule is specifically designed to make just this scenario.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "DMHavoX",
                                    "body": "Well played to the schedule makers then. Mission accomplished! I also believe that is why they hold on the the 2 point system and don't go to the 3 point system. Makes more playoff drama.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "SmokeontheHorizon",
                            "body": "All schedules are not created equally :(",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ZakkH",
                    "body": "I need you guys to figure out your spot out before the last game, we need Matthews/Marner/Nylander resting when we play you.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "Peekatchu1994",
                    "body": "Sens creeping up as well",
                    "score": 29,
                    "replies": [
                        {
                            "author": "MikeJeffriesPA",
                            "body": "Yes and no. Assuming the team that finishes 1st ends up with ~102 points (the current pace of those 3 teams), Ottawa needs at least 25 points in their last 16 games.\n\n\nThat's 12-3-1, or 11-2-3. It's doable, but would take an incredible heater. \n\n\nNow, could Ottawa move up to 3rd? Sure, if one of those three slumps, but likely not higher than that. ",
                            "score": 80,
                            "replies": [
                                {
                                    "author": "TkachukMitts",
                                    "body": "I think the Sens are about where they should be seeded. I want no part of playing Florida though, that's the one team I don't feel like the Senators have a chance in hell of beating, but I would think most fanbases don't want to play them either.",
                                    "score": 25,
                                    "replies": [
                                        {
                                            "author": "bistroexpress",
                                            "body": "For some reason, we keep beating them, only allowed 1 goal to them all year. Doesn't really make sense.",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "Riskar",
                                                    "body": "They're a recent Stanley Cup champion, we hate those 😆",
                                                    "score": 5,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "An_doge",
                                                    "body": "Some teams play up opponents better, and down worse. Which makes a bit more sense but not much.",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "dnel707",
                                                    "body": "They were missing some key players last time.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "babypointblank",
                                            "body": "Your username implies you really want a Battle of the Tkachucklefuck Brothers",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "StayClassynet",
                                    "body": "I think that’s a good/fair assessment. I’m not totally sure they can realistically catch up to third either. It does seem like they’ve put enough separation into WC1 vs WC2 though. Wouldn’t be surprised to see them firmly stay in WC1.",
                                    "score": 27,
                                    "replies": [
                                        {
                                            "author": "Montsegur97",
                                            "body": "Pretty sure I saw that yesterday, your strength of schedule was on the easier side.  Of course, this is the NHL and it could mean absolutely nothing, but there's a chance they finish strong.",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "Jbroy",
                                            "body": "Unless Ottawa loses tonight and slumps for 2 games then that separation evaporates in half a week.",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "author": "BoxCarBlink44",
                                                    "body": "What if TO and Tampa lose their next game then two more after that while Ottawa wins? You can use your argument for any scenario lol",
                                                    "score": 14,
                                                    "replies": [
                                                        {
                                                            "author": "Jbroy",
                                                            "body": "It was more of a comment on the separation of WC1-2.  But yes any team in the top 5 could theoretically miss out on the playoffs or win the division.",
                                                            "score": 8,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "babypointblank",
                                    "body": "Sens are on a hot streak but I’m fully expecting A-3 or a wildcard spot",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Effective-Elk-4964",
                                    "body": "Yeah, and I’d also be surprised if one of the three they’re chasing doesn’t end up outplaying their pace down the stretch.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "List-Worth",
                                    "body": "2nd or 3rd is attainable right now. I'm not sure 2nd will remain attainable, but right now it definitely is.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "MikeJeffriesPA",
                                            "body": "Fwiw money puck has 1st/2nd as about 16% right now, so a 1/6 chance. Not awful. ",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "List-Worth",
                                                    "body": "It's interesting that 1st and 2nd have the same odds but 3rd doesn't, despite TBL and TOR having the same points and GP. I'm sure there's more that goes into the odds than just the face value of the standings though.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "MikeJeffriesPA",
                                                            "body": "1st/2nd is a combined 17%, whereas 3rd is 25%.\n\n\nIt comes down to how many teams you need to pass. Like if Ottawa finishes with 100 points, there's a great chance that's enough for 3rd, might be enough for 2nd, unlikely to be enough for 1st ",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "List-Worth",
                                                                    "body": "Fair enough, I don't really look at odds like that, and when I do I take them at their face value, so I've never really put thought into how they work, thanks for explaining.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "MikeJeffriesPA",
                                                                            "body": "No worries, and yeah it's why being 6 points out of 1st with three teams to catch is worse than being 6 points out of 1st with only one team to catch.\n\nIt's just statistically unlikely that all 3 teams will slump, and far more plausible that 1 team will slump.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "mackinder",
                                            "body": "for the Sens to end up in the top 3, one or more of those teams will have to be dreadful down the stretch.  I doubt that happens.  Sens should be a playoff team but I would think a wildcard based on how good they have been this season.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "ceribaen",
                                            "body": "Saying it's attainable is like saying that becoming a millionaire for your average person is attainable. \n\n\nSure, given the right circumstances it could happen. But highly unlikely. \n\n\nBasically one or both Tampa and Toronto need to play sub 500 hockey for the remainder of the season, and Ottawa needs to continue its hot streak and keep up a top 3 team in the league pace in order to pass them. \n\n\nOver 4 or 8 game stretch? Could see it get interesting. Over 16 games? I think it's a bit much to suggest one team stays that cold while the other stays that hot for the entire run.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "List-Worth",
                                                    "body": "I guess, I said attainable, not necessarily likely. I'm just saying, taking the standings for what they look like at this exact moment, it is attainable. I'm not saying it is necessarily a lock, or likely, etc. Just that it is currently within reach.",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "AmeriCanada98",
                            "body": "Would be a tough road to realistically have a path at the 1 seed for Ottawa. Could see you guys getting up to A3 though if any of these 3 get cold",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "alexgriz127",
                    "body": "\"WE WANT FLORIDA\" 2: Electric Boogaloo",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "RelaxingRed",
            "body": "Battle of Florida and battle of Ontario round 1 would be a fucking beautiful thing to see.",
            "score": 89,
            "replies": [
                {
                    "author": "peachjuice-isbest-78",
                    "body": "Sure but the leafs would have to consistently win games and we all know that after they get a decent winning streak going they follow it up with a losing streak",
                    "score": 14,
                    "replies": [
                        {
                            "author": "VitaminTea",
                            "body": "The Leafs have “consistently” won games exactly as much as these other teams. That’s why they are tied in the standings…",
                            "score": 27,
                            "replies": [
                                {
                                    "author": "Gary-Laser-Eyes",
                                    "body": "I’m just scared of the playoffs man. I’ve been hurt too many times hahah.",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "jghtb",
                            "body": "Leafs have an identical record to Florida. But yeah, streaky.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "queuedUp",
                    "body": "even more wild when it's Ottawa in 2nd or 3rd and Tampa or Florida dropping to the wildcard",
                    "score": 2,
                    "replies": [
                        {
                            "author": "coffeenteaman",
                            "body": "Subscribe",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "jlquon",
            "body": "Worth it to push - round 1 is always a bloodbath in the Atlantic for the 2-3 matchup",
            "score": 138,
            "replies": [
                {
                    "author": "nomdreas",
                    "body": "You know what, the fact that, you, a Bruins fan, sees it this way is refreshing. \n\nI’m just used to the Bruins eating our lunch in the first round.",
                    "score": 57,
                    "replies": [
                        {
                            "author": "Cmike9292",
                            "body": "The Leafs and Bruins always find a way to go 7 and kick the shit out of each other. I don't think either team's fans have that much fun lol",
                            "score": 39,
                            "replies": [
                                {
                                    "author": "RanaMahal",
                                    "body": "Yeah even with it swinging Boston’s way the 3-4 times they met the Leafs it’s still not really enjoyable to keep playing game 7 games winning 2-1. That shit is nail biting and any small mistake could’ve had it going to the leafs.",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "author": "TomBradysThrowaway",
                                            "body": "And it's not good for you in future rounds even after the win.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "remotewashboard",
                            "body": "enjoy the reprieve while you have it!!!",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Emergency-Reindeer55",
                                    "body": "Bruins are in a weird spot. \n\nWill they be bad for a while or will they make some big moves and maybe get lucky with a few prospects and come right back?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "remotewashboard",
                                            "body": "i can tell you that sweeney/neely are looking to get back into the hunt ASAP. will they? who knows! i think there’s a path for a year or two retool and getting back to being competitive but that’s all about them making the correct, smart moves. i can’t put my faith into the FO with hypotheticals unfortunately— they haven’t earned it yet",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "nomdreas",
                                                    "body": "I’d be shocked if Sweeney/Neely have jobs soon. This offseason is so important for them.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "peachjuice-isbest-78",
                                            "body": "I hope and pray they become bad for a while Like the habs were",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Kronzor_",
                            "body": "We still got Marchand lurking.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "schwetybalz",
                    "body": "For Tampa especially this season. 24-8-2 at home and 15-15-2 on the road. That home ice advantage would be huge. Second to Carolina for home record in the East if my quick research is correct.",
                    "score": 13,
                    "replies": []
                }
            ]
        },
        {
            "author": "arv5518",
            "body": "The Sabres are fully going to mess with these teams and win games against them for no reason other than to make the other fan base mad that they lost to the Sabres. Sabres win at the end of the season when they are eliminated and just hurt their draft pick 😂",
            "score": 137,
            "replies": [
                {
                    "author": "diecommajerks",
                    "body": "I know we still have 2 games against Sabres, not sure about the others though",
                    "score": 23,
                    "replies": [
                        {
                            "author": "SpingusCZ",
                            "body": "One more in April for both Florida and Toronto",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "galloots",
                            "body": "Sens still have two left",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "bellerinho",
                    "body": "A bad Sabres team beating a playoff calibre Leafs team is a tale as old as time (time in this case being the last 10ish years)",
                    "score": 20,
                    "replies": [
                        {
                            "author": "FallOutShelterBoy",
                            "body": "During this drought we’ve beaten Toronto more than any other team. Some of it of course is because they’re in our division, but whatever players are on the ice seem to get that we hate that Leafs, so they channel it to play harder",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "bellerinho",
                                    "body": "There's just something about this iteration of the Leafs playing these iterations of the Sabres, Sens, and Habs that really just makes those three into juggernauts every time they play Toronto lol",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "UniformRaspberry2",
                                            "body": "> this iteration of the Leafs\n\nEvery iteration, let's be honest here.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Emergency-Reindeer55",
                            "body": "Leafs are 2-0 against them this year so could maybe sweep them in the regular season for once.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "babypointblank",
                                    "body": "Leafs are 4-2 (including an OT win) since the start of the 2023-4 season",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Allen_Koholic",
                    "body": "The Sabres are the best argument for implementing the Gold Plan for draft seeding.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "RanaMahal",
                            "body": "What’s the gold plan?",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Allen_Koholic",
                                    "body": "https://en.wikipedia.org/wiki/Gold_Plan_(sports)",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "gsauce8",
                                            "body": "Doesn't this give an advantage to teams that get eliminated early?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Allen_Koholic",
                                                    "body": "Wouldn’t those be the teams that need the most help and are the most “deserving”’of a high pick?",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "gsauce8",
                                                            "body": "Oh you're totally right lmao.",
                                                            "score": 4,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Muumienmamma",
                                                    "body": "Yes but it is only an advantage compared to without such thing they just get the best draft lottery odds.",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "sameth1",
                                                    "body": "That's how the current system works too. The team that gets eliminated first is usually the one that loses the most games.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ghost_curse123",
                    "body": "Oh this is definitely going to happen",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "high-rise",
                    "body": "This might be a 1970 expansion team thing.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "RikVanguard",
                    "body": "Time for the annual end-of-season \"oh you guys are going to be scary next year!!\" hot streak",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Basil_Normal",
            "body": "I’m not even sure which seed is the ideal one to aim for at this point tbh",
            "score": 45,
            "replies": [
                {
                    "author": "epicfacej",
                    "body": "The only correct answer is not 3.",
                    "score": 63,
                    "replies": []
                },
                {
                    "author": "SpingusCZ",
                    "body": "None of them",
                    "score": 15,
                    "replies": [
                        {
                            "author": "I_Am_Vladimir_Putin",
                            "body": "That's what the Bruins figured",
                            "score": 43,
                            "replies": [
                                {
                                    "author": "infinis",
                                    "body": "Everyone is trying to compete for the third spot so that they can have a free pass in the first round playing the leafs.",
                                    "score": -7,
                                    "replies": [
                                        {
                                            "author": "babypointblank",
                                            "body": "Aren’t the Habs going to be lucky if they make a WC spot? Gotta be comfortable in your ability to claim a WC spot before you can come for A-3.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "infinis",
                                                    "body": "Can you help me with a quizz question I have here.\n\nWhich Canadian teams haven't made the Stanley Cup final in the last 20 years?",
                                                    "score": -8,
                                                    "replies": [
                                                        {
                                                            "author": "babypointblank",
                                                            "body": "Which Canadian team only made the playoffs because some raccoons got the sniffles?",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "infinis",
                                                                    "body": "Making it to the dance doesn't get you the crown. What do you have to show for it?",
                                                                    "score": -2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "babypointblank",
                                                                            "body": "As much as the Habs do",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Protodemic",
                                                                                    "body": "\"making it to the dance doesn't give you the crown\" is such a self burn for that hab fan lol. The best part is they followed up the luckiest run of life by finishing as the first ever 32nd team in the NHL. And then they drafted Slafkofsky of all players with the first pick lol. To be fair though, they chose the wrong year to be that dogshit",
                                                                                    "score": 3,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ghost_curse123",
                    "body": "Our best bet is Washington losing every single one of their games from this point on so one of us steals 1st in the east, probably need to deduct a few points from them to even have a shot at that",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "toolschism",
                    "body": "Whatever seed results in us getting home advantage against either the Sens or the Leafs.\n\nFuck everything about playing Florida in the first round again. Even if you win that round half your team is on IR after that series with how violent it gets (and how many rat fuckers they have on that team).",
                    "score": 7,
                    "replies": [
                        {
                            "author": "Kevpatel18",
                            "body": "We had either Toronto or Florida in the first round for the last 4 years, insane at this point",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "dekusyrup",
                                    "body": "They made this playoff format just for this purpose.  They want to stoke division rivalries.  \n\nIn the old format the last 4 years tampa would have had rangers, devils, panthers, and lining up for leafs this year.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "dekusyrup",
                                    "body": "They made this playoff format just for this purpose.  They want to stoke division rivalries.  \n\nIn the old format the last 4 years tampa would have had rangers, devils, panthers, and lining up for leafs this year.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "bootcutwater",
                    "body": "first for sure. home ice advantage is always good",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "t_l_quinner",
            "body": "The top 3 in the metro are the only thing not close in the east. There’s 7 teams within 10 points of each other competing for 2 wild card spots",
            "score": 38,
            "replies": [
                {
                    "author": "RSquared",
                    "body": "It's kinda funny that the 2 and 3 seeds tend to know their opponent long before the 1 seed does.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "PeterG92",
                            "body": "It's a big downside to their current play off format, they need to go back to 1 v 8",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "saltearthbaby",
            "body": "Ottawa will be well rewarded no matter what.",
            "score": 14,
            "replies": [
                {
                    "author": "Kronzor_",
                    "body": "Ottawa making the playoffs is already a massively successful season. They're playing with house money at that point.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "user028473972",
                            "body": "This is exactly why I think they could cause an upset in the playoffs if they make it. The expectation is for them to make the playoffs. No one has any expectations for them IN the playoffs. It’s a success if they make it and everything else is just confetti. The teams they’d be going up against have the expectation that they take it all the way and it’s a failure if they don’t. There’s so much more pressure on those teams than the Sens, so the Sens just get to play hard and enjoy the ride, while others have so much on the line. The Sens simply have less to lose and I think that works in their favor.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Kronzor_",
                                    "body": "I mean they have less to lose and aren't expected to go as far because they aren't as good of a team. So while having less pressure certainly helps, playing against better teams will not. They're going to be the underdog no matter who they play. Underdogs win all the time in hockey though, so no one will be surprised if they knock anyone out.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "PremierBromanov",
            "body": "I kinda assumed the leafs were playing for a wildcard spot given all i hear about them.",
            "score": 38,
            "replies": [
                {
                    "author": "No_Tumbleweed_6880",
                    "body": "Most negative good team for some reason.",
                    "score": 28,
                    "replies": [
                        {
                            "author": "BoxCarBlink44",
                            "body": "the highest highs and the lowest lows for them. cup champs 2025 to dog shit chokers are every game depending on the outcome lol",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "No_Tumbleweed_6880",
                                    "body": "Parade planned / Parade cancelled",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "JustHach",
                                            "body": "SNIP SNAP SNIP SNAP SNIP SNAP\n\nYou have no idea the psychological toll that 3 game winning/losing streaks have on a fanbase!",
                                            "score": 12,
                                            "replies": []
                                        },
                                        {
                                            "author": "Farfalo",
                                            "body": "Snip snap snip snap snip snap",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "grizzlby",
                            "body": "The Eagles of the NHL except for some difference that I can’t quite put my finger on…",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "BeefJerky03",
                                    "body": "I got you- Eagle is a bird, Leaf is part of a tree. I think.",
                                    "score": 11,
                                    "replies": []
                                },
                                {
                                    "author": "leafsbroncos18",
                                    "body": "Eagles obviously have 11 less championships, how lame",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Thepotatoking007",
                                    "body": "The Eagles can win something",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Emergency-Reindeer55",
                                            "body": "That's not it",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "babypointblank",
                            "body": "It’s because our team loves a Game 7 choke job, Toronto-centric sports media pisses off the rest of Canada and our fanbase is so large that we have more idiot fans through sheer numbers alone. \n\nWe also have a core with stats that should be able to get it done on paper but can’t deliver when it matters. I personally wonder how this team would perform in the playoffs if Babcock hadn’t been their coach during their key development years but you never know. You also can’t blame your old coach six years on especially when this team and the individual players have the resources for the best sports psychologists you can find.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Kronzor_",
                            "body": "You think it's unmerited? \n\nWe lost to you guys once for goddsakes lol",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "No_Tumbleweed_6880",
                                    "body": "Funny, but for a team that has been first in the antlantic for the whole season-ish and is now 2 points off, yes, unmerited.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Kronzor_",
                                            "body": "Leafs fans don't give a shit about the regular season. We could win the presidents trophy and we'd all assume we're getting swept by Columbus in the first round. \n\nUntil they show us differently when it matters there's going to be a lot of negativity.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "No_Tumbleweed_6880",
                                                    "body": "Yeah but give a shit or not, you keep saying your team is bad when its just not the case. You have a good hockey team.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Kronzor_",
                                                            "body": "I think the measure for good/bad is just whether we believe the can win a first round playoff series or not. Right now it looks like no, so we see that as bad. It doesn't matter if they're 5th or 10th or 1st in the league. Worse than Florida/Tampa (or hell, Ottawa) is bad.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "UniformRaspberry2",
                    "body": "Last night was the first game since the Four Nations break where we've actually looked like a professional hockey team, so that's probably why.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "miller94",
                            "body": "We really are the same",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "big_samosa",
                            "body": "I entirely disagree - both the Florida and Ottawa games were close run things, and the effort was certainly there",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "RanaMahal",
                            "body": "It’s almost like your entire team lives or dies on your 8 digit salary players playing well lol",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "UniformRaspberry2",
                                    "body": "What do you mean *your*, Leafs fan.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "RanaMahal",
                                            "body": "Well, your as in the Leafs. I’m also a Leafs fan lol. But using your in the 3rd person sense of the word.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "chemicalxv",
                    "body": "To be fair, the fact they have the same % as Tampa despite scoring exactly 20 fewer goals and also allowing exactly 20 more goals is kind of crazy.\n\n40-27 (overall) with only a +17 goal differential is a pretty wild stat, but then again so is Tampa being +57 (third-best in the league) but only 8th in Points % lol.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "RanaMahal",
                            "body": "Tampa just wins harder in their wins and Toronto has just been consistently 3-2 wins all year with the occasional 4-5 goal games sprinkled in. \n\nTampa drops a lot of those 7-1, 6-2 wins which makes the goal differential for them a wider gap",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "mdkss12",
                    "body": "to be fair, prior to yesterday they had been on a 1-4-1 streak (and that 1 win was in a shootout against a mediocre Utah) meanwhile OTT is at 77 points with a game in hand, so it's not like TOR is locked into a top 3 spot and they had been spiraling a bit.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ShadowRealmDuelist",
            "body": "Listening to Toronto fans you’d think the Leafs were a lottery team…",
            "score": 40,
            "replies": [
                {
                    "author": "justaperson815",
                    "body": "1 playoff series win in 20 years will do that to a fan base",
                    "score": 41,
                    "replies": []
                },
                {
                    "author": "OhGodThisGuy",
                    "body": "Every win is an asterisk, every loss a referendum",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "RanaMahal",
                    "body": "Worst team ever (has made the playoffs 9 years in a row which is the longest active streak in the NHL and sorta up there with some of the longer playoff streaks)",
                    "score": 9,
                    "replies": [
                        {
                            "author": "gillesregis",
                            "body": "I don't think anyone argues that Toronto has been one of the best regular season teams in the recent years. But having your high expectations crushed one game short of a playoff victory so many years in a row will break the mind of any sports fan. They can be talented yet still be a joke.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "VeryKnies23",
                    "body": "We've been hurt too much, but yes some are going full panic mode",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "JesusJohn",
                    "body": "The best time to panic was yesterday. The next best time is right now.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "realsalbowski",
                    "body": "And yet, there are people in this sub who are adamant that leafs' fans are \"overconfident.\"",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "peachjuice-isbest-78",
            "body": "Not to mention Ottawa also being at 77 points which is only 6 points behind",
            "score": 17,
            "replies": [
                {
                    "author": "quixotik",
                    "body": "We're coming to the party!",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "galloots",
                    "body": "With a game in hand, and 2 on the panthers.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "queuedUp",
                    "body": "I half expect Ottawa to slide into the 2nd or 3rd spot when the dust settles",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Strattex",
            "body": "I’m praying for Ottawa to go on absolute heater and win the division💀 Chaos ensues, fun times",
            "score": 34,
            "replies": [
                {
                    "author": "LachlantehGreat",
                    "body": "Absolutely ",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "Madman200",
                    "body": "Subscribe",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "citadel72",
                    "body": "Yes please.",
                    "score": 18,
                    "replies": [
                        {
                            "author": "zedemer",
                            "body": "You do that, just give us 3 pts in our next 2 matches. Feel free to win all others",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "UTC_Hellgate",
                                    "body": "Do you guys wanna like...play another game for 60 minutes and we'll just finish this in OT? Everyone goes home with something?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "zedemer",
                                            "body": "Sure. Let's go!",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "brechbillc1",
            "body": "Making those losses to Boston and NYI hurt more. We pick up those points and we have a bit of a cushion.",
            "score": 10,
            "replies": [
                {
                    "author": "MiamiVicePurple",
                    "body": "All three of us have cooled off a bit. Tampa and the Leafs have also lost some games they probably shouldn’t have.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "brechbillc1",
                            "body": "Yeah I figured we would at some point. The tough part about those losses though is we gave up a multi goal lead in both which hurts because we’re one of the best shutdown teams in the league. Not having Ekky hurts obviously as we’re shuffling the D pairs with new faces. As long as we can maintain our spot come playoff time and return to full strength, I think we’ll be ok.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "knightrobot",
                    "body": "Blowing two 2 goal leads in the 3rd was not... ideal. And they didn't bother to show up in Montreal.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "knightrobot",
                    "body": "Blowing two 2 goal leads in the 3rd was not... ideal. And they didn't bother to show up in Montreal. Honestly didn't have much business being up on Long Island either.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "azure_888",
            "body": "You guys ever see that Simpsons episode where they're in international waters so they have monkeys fight each other with knives? That's kinda what this feels like.",
            "score": 4,
            "replies": []
        },
        {
            "author": "TildeGunderson",
            "body": "I'm kind of happy that it's not the same 4 teams in the top 4 there, but I was sure Tampa would be the one that'd fall off first. It didn't seem like Boston lost anything except Ullmark in the offseason, who, admittedly, is a star goalie (and created the best goalie tandem in the league), but you'd think they wouldn't plummet so far.",
            "score": 6,
            "replies": [
                {
                    "author": "jlquon",
                    "body": "we lost speed (debrusk), goalie play plumetted (platoon vs attempt to have swayman be #1), replaced with plodding (zadorov, lindholm), regressed (coyle, frederic, tbh mcavoy), bad luck (carlo had like 15 goals go off of his body), injuries (H lindholm was the big one)\n\nBunch of little disasters piled up",
                    "score": 12,
                    "replies": [
                        {
                            "author": "babypointblank",
                            "body": "I think you’re forgetting one bud",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "jlquon",
                                    "body": "Marchand was playing fine until he got hurt but the season was already over by then so I didn’t include him",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "winkNfart",
            "body": "leafs need to avoid playing ottawa at all costs",
            "score": 8,
            "replies": [
                {
                    "author": "Sad_Bolt",
                    "body": "And the possibility of facing both Florida teams instead of one is better?",
                    "score": 8,
                    "replies": [
                        {
                            "author": "winkNfart",
                            "body": "we cannot beat ottawa, period. no offense.. but we’ve got the bolts’ number in the last couple years. panthers will stomp us, so that’s whatever.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "jjaime2024",
                                    "body": "For Leafs fans if they were to lose to Florida yes it would hurt but it is what it is.If they lose to Ottawa it would be much harder for fans to accept.",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "RattledRed",
                                    "body": "🤦🏿‍♂️",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "babypointblank",
                            "body": "I don’t have to deal with Florida or Tampa fans. I do have a bunch of Sens fans in my life who are ready to roast the fuck out of me in the group chat.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "queuedUp",
                    "body": "So .... like tank just enough to get the 2nd wildcard to play the Capitals?",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "james-HIMself",
            "body": "Vasilevsky has been insane the last few months. Well the entire Tampa team has. But he in particular looks like his usual Vezina self.",
            "score": 3,
            "replies": []
        },
        {
            "author": "SpingusCZ",
            "body": "Washington and Carolina are drooling seeing how much these teams are probably gonna beat each other up in the first two rounds",
            "score": 6,
            "replies": []
        },
        {
            "author": "pyrasilverado",
            "body": "All 3 made trade deadline acquisitions, and when 2 and 3 play first round... We can all say what mistakes everyone made... Well, not me, I will gladly come back here after the first round is over and read all the hot takes!",
            "score": 2,
            "replies": []
        },
        {
            "author": "xc2215x",
            "body": "2nd vs 3rd will be a great matchup in the first round.",
            "score": 2,
            "replies": []
        },
        {
            "author": "2014olympicgold",
            "body": "Its ridiculous that Toronto needs to play a road B2B in Tampa and Florida near the end of the season. Wtf was that schedule maker lol.",
            "score": 4,
            "replies": [
                {
                    "author": "KingBroly",
                    "body": "'Do you hear that, Mr. Anderson?  That is the sound of inevitability.\"\n\nThat's why.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "cavegrind",
            "body": "I had been busy with life the last week, so aside from catching our slide over the last 7-10 games or so I wasn't watching the league.\n\nI honestly assumed the Lightning were just solidly in the WC spot and that was it. What the fuck happened to FL and TOR?",
            "score": 2,
            "replies": [
                {
                    "author": "dolewhiplash",
                    "body": "Our slide was a three game losing streak with a shootout loss in there,  so its not really what happened to the other two teams and more everyone overreacting to a very normal sized slump",
                    "score": 9,
                    "replies": [
                        {
                            "author": "cavegrind",
                            "body": "I was more saying that I wasnt paying attention to them or the standings, and was expected both other teams to be tipping 90 points already.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "atomic-z",
                                    "body": "Leafs won one game in 15 days.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "babypointblank",
                    "body": "Matthews decided not to score for awhile among other things",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ghost_curse123",
                    "body": "Tampa went on a bit of a tear, Florida still playing relatively well and Toronto has played like dogwater since coming back from the break except for last night",
                    "score": 1,
                    "replies": [
                        {
                            "author": "jghtb",
                            "body": "Leafs won 5 in a row coming off the break. But yeah, dog water.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "sansaset",
            "body": "i love the doom and gloom from our fanbase calling to trade everyone and fire berube less than a season in when we're still keeping up with powerhouses like Florida and Tampa.",
            "score": 2,
            "replies": [
                {
                    "author": "babypointblank",
                    "body": "I have plenty of anticipatory doom and gloom because I’m a Leafs fan but I’m not calling for anyone’s head because we’re still in a good position relative to the rest of the Conference",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Adren406",
            "body": "Ah yes the ice hockey powerhouse state of \\*checks notes\\* Florida and then there's Toronto. This timeline is hilarious.",
            "score": 2,
            "replies": []
        },
        {
            "author": "KingAteas",
            "body": "I normally boo the Laughs but I really don’t want DeSantis to have one of his FLA teams to win, so go Toronto!",
            "score": 4,
            "replies": [
                {
                    "author": "I_Am_Vladimir_Putin",
                    "body": "We always knew that deep inside you love us",
                    "score": 7,
                    "replies": [
                        {
                            "author": "VeryKnies23",
                            "body": "https://i.redd.it/0gg29rfuogpe1.gif",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AdminsKindaSus",
                    "body": "Thank you ya filthy Hab, I’d like to think we’d do the same if the positions were swapped",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "__TheWaySheGoes",
                    "body": "The other 6 Canadian teams used to be teams I’d always root against but now I want any Canadian team to win against any American team lol.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "espher",
                            "body": "Boston Pizza was a year early with that stupid ad campaign.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "Telvin3d",
                            "body": "My dream this year is an all-Canadian semi-final ",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "babypointblank",
                                    "body": "That only happens if some weird Canadian terrorist decides to Nancy Kerrigan the Panthers",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Telvin3d",
                                            "body": "I mean, even if we get a Canadian team in the East WC2 so that it’s even possible it’s still not likely. But a guy can dream. Any team can have a bad series, or have a hot goalie for the perfect handful of games",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "JediMasterZao",
                            "body": "Same! Supporting a team because they're Canadian? I sleep. Supporting a team because they're facing a US team? mad awake.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Nostradomusknows",
                    "body": "He probably doesn’t even remember we have hockey in the state unless someone tells him.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "FactOrFactorial",
                    "body": "A solid FUCK DESANTIS. Dude needs to be thrown in a volcano.\n\nGo bolts.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "babypointblank",
                    "body": "DeSantis doesn’t care about hockey whatsoever. That being said if the FL teams *do* go far I don’t want them to face the Oilers or the Canucks because we don’t need a bunch of Canadians flying down to that hell hole state.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "KingAteas",
                            "body": "Yeah, the way things are going, they might not come back 😱",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "zirky",
            "body": "how is tampa ahead of the leafs? they have the same points, lower ROW and toronto is 3-0 head to head",
            "score": 1,
            "replies": [
                {
                    "author": "Svalbard38",
                    "body": "Regulation wins is first tiebreak and they have 34 to our 32",
                    "score": 9,
                    "replies": [
                        {
                            "author": "zirky",
                            "body": "completely forgot about that!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sad_Bolt",
            "body": "This doesn’t seem right, we need to rig so the Leafs have to play both Florida and Bolts. Maximize their suffering.",
            "score": 1,
            "replies": []
        },
        {
            "author": "redundead",
            "body": "*laughs/cries in thunderdome*",
            "score": 1,
            "replies": []
        },
        {
            "author": "SteveYzerman_19",
            "body": "These 3 teams and Boston (but for some reason did horrible this year) are always the top 3 teams in Atlantic these past years. Makes me really want to see Florida and Tampa Bay go at it again and see some bad blood.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bloodrider1914",
            "body": "Come on let's see a battle of Florida first round",
            "score": 1,
            "replies": []
        },
        {
            "author": "Commander-Fox-Q-",
            "body": "All these teams have so many games against each other also. Gonna be a bloodbath. Wish divisional games weren’t so heavy down the stretch since I feel like it can cause injuries more often idk",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zand78",
            "body": "Man I am split between wanting the Tkachuk bowl or Marchand against the Leafs.",
            "score": 1,
            "replies": []
        },
        {
            "author": "EatUpBonehead",
            "body": "I wish they would change the playoff format",
            "score": 1,
            "replies": []
        },
        {
            "author": "Soren_Camus1905",
            "body": "IS IT",
            "score": 1,
            "replies": []
        },
        {
            "author": "Forceful3",
            "body": "Another reason why we need to bring back the conference system",
            "score": 1,
            "replies": []
        },
        {
            "author": "VegasKL",
            "body": "*looks at Toronto*\n\n\nI just want to say good luck, we're all counting on you.\n\n\n/Prepares to be let down.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Eckstraniice",
            "body": "Leafs setting themselves up for a 3rd place finish and another game 7 on the road..",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dragonsfire09",
            "body": "Murderers row. The Stanley cup goes through the Atlantic every year.",
            "score": 1,
            "replies": []
        },
        {
            "author": "frozenjunglehome",
            "body": "So, Florida, followed by Hot Tampa, and then Cold Tampa.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fellers",
            "body": "What is the tiebreaker for TOR and TBL? Toronto has one more win.",
            "score": 1,
            "replies": [
                {
                    "author": "MOLightningBro",
                    "body": "Regulation wins",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "rodon25",
            "body": "The loser point is fucking stupid.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AgentBlue14",
            "body": "Top three contenders for \"Team most hated in the league\" lol",
            "score": 1,
            "replies": [
                {
                    "author": "noodleyone",
                    "body": "Vegas is definitely in contention.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "pavelbure1096",
            "body": "Fuck you Putin!",
            "score": 0,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -3,
            "replies": [
                {
                    "author": "Plague183",
                    "body": "Because they have to play each other probably",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "drichm2599",
            "body": "https://preview.redd.it/8cbogup4zhpe1.png?width=800&format=png&auto=webp&s=929f52ec44e0658f7b6979585a00aefb6d7bf142\n\nMetropolitan race be like",
            "score": 0,
            "replies": []
        },
        {
            "author": "PositiveJetsFan",
            "body": "Fuck Vladimir putin",
            "score": -2,
            "replies": []
        }
    ]
}