{
    "title": "The race for the 2nd Western Wild Card is intensely close too",
    "author": "Angryangmo",
    "subreddit": "hockey",
    "rank": 8,
    "score": 244,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 129,
    "url": "https://i.redd.it/79twqrbr4ipe1.jpeg",
    "id": "1jedww5",
    "selftext": "",
    "comments": [
        {
            "author": "martial_arrow",
            "body": "Canucks - Rangers Stanley Cup final still on the table",
            "score": 116,
            "replies": [
                {
                    "author": "_GregTheGreat_",
                    "body": "Reformed JT Miller vs rejuvenated Elias Pettersson in a 7 game series would be absolute cinema",
                    "score": 62,
                    "replies": [
                        {
                            "author": "modernjaneausten",
                            "body": "I want to see it so bad honestly",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "dude8212",
                                    "body": "Same but I don't think my heart could take it",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "modernjaneausten",
                                            "body": "Samesies 😬 I’d be hugging a pillow the whole game just to get through it",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Firestorm238",
                    "body": "Ok Francesco ;)",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Shiny_Mew76",
                    "body": "This is unironically what I was hoping for during the Conference Finals last year.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "nostradamefrus",
                    "body": "I'mma need you to relax",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "toadaly_rad",
            "body": "We’re having the ultimate mid off. And boy is it exciting!",
            "score": 83,
            "replies": [
                {
                    "author": "mephnick",
                    "body": "Turtle derby!",
                    "score": 20,
                    "replies": [
                        {
                            "author": "FumblinginIgnorance",
                            "body": "I've bounced around between we really want the playoffs, to we don't deserve the playoffs so much and we are all winning and losing together... I guess I'd better go check playoff standings again",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "pluralsight24",
            "body": "Blues are the favourite for WC2 IMO. Easiest remaining schedule in the league which includes playing the Preds 3x",
            "score": 59,
            "replies": [
                {
                    "author": "butwhyyyyyyyyyyymeee",
                    "body": "This. Canucks have Winnipeg 2x, Vegas 2x, Dallas and Colorado still to go. Hardest remaining schedule in the league I believe, don't quote me on it though",
                    "score": 31,
                    "replies": [
                        {
                            "author": "hockeycross",
                            "body": "I think Detroit gets that honour but Canucks are close.",
                            "score": 19,
                            "replies": []
                        },
                        {
                            "author": "GovernmentKlutzy712",
                            "body": "Frankly I don't think I would enjoy the Canucks getting 12 shots a game en route to losing in 4 or 5 games to the Jets. \n\nSt Louis can be the sacrifice instead.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "AffectionateAd147",
                            "body": "I believe they are 4th if I remember correctly. Still crazy hard tho. I’m hopeful though, anything can happen.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ziggs_ulted_japan",
                    "body": "Can't wait to lose all three of those games lol",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "LGMatter",
                    "body": "They’re also, the second worst team in the picture tho. And Parayko is out",
                    "score": -11,
                    "replies": []
                }
            ]
        },
        {
            "author": "PorkinsHeldIt",
            "body": "Didnt realise utah is having a decent year",
            "score": 155,
            "replies": [
                {
                    "author": "Flatoftheblade",
                    "body": "Coyotes were set to make the playoffs last year until all the rumours about the team being sold were confirmed and that seemed to be a hit to morale and they dropped off hugely.",
                    "score": 64,
                    "replies": [
                        {
                            "author": "Pineapple_warrior94",
                            "body": "Imagine an alternate timeline where the Coyotes used that as motivation out of spite. They win the cup at Mullet arena and then literally fade away",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Flatoftheblade",
                                    "body": "It would have made for a great story.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Ubechyahescores",
                                    "body": "*”We’ll never lose again”*",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "discofrislanders",
                            "body": "They were 2 points out in January and then went on I want to say an 11 game losing streak. There's a conspiracy theory I've heard that Bettman either fixed games against them, or just straight up told them to lose because he was horrified at the prospect of playoff games at Mullett Arena.",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "ImSomeRandom",
                                    "body": "Yeah it’s a Bettman conspiracy and not that the relocation rumors picked up and goaltending injuries ",
                                    "score": 30,
                                    "replies": [
                                        {
                                            "author": "misfittroy",
                                            "body": "So Bettman injured their goalie is what you're saying?",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "weschester",
                                    "body": "They went on a 14 game skid I believe and it happened the exact same time the players were first told that the team would be moving after the season.",
                                    "score": 13,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "arbordianae",
                            "body": "soft tampering",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "NixonsTapeRecorder",
                    "body": "Oilers in a predicament tonight.  Beat Utah or lose and fuck the flames?",
                    "score": 73,
                    "replies": [
                        {
                            "author": "IrateWeasel89",
                            "body": "Beat Utah to help the Blues which then fucks the Flames.",
                            "score": 54,
                            "replies": [
                                {
                                    "author": "marbsarebadredux",
                                    "body": "We're fucking ourselves well enough",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "eatingasspatties",
                                            "body": "Tbh I’d rather see you guys make it than Vancouver. Mainly just cause that’d be really funny",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "themooseiscool",
                                    "body": "Do it for Hollywood and Bro!",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "docboyo",
                                            "body": "Miss those guys so much. So happy they’re thriving in STL",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "bladeovcain",
                                    "body": "Fuck it, I'm sold",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "burf",
                            "body": "Counterpoint: Nothing is more painful as a Flames fan than constantly being on the playoff bubble, so the Oilers beating Utah would be more painful. \n\nPick a fuckin’ lane please, Flames.",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "_GregTheGreat_",
                            "body": "Beat Utah to get the Flames hopes up so them missing the playoffs is more heartbreaking? \n\nI promise I don’t have ulterior motives by suggesting this 😇",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "Thneed1",
                            "body": "We will fuck our ourselves enough because we can’t score goals.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "letsgoToshio",
                                    "body": "Wolf is gonna have to start scoring too",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "CND_",
                                            "body": "I wouldn't put it past Wolf to become the teams top scorer. Not like Wolf would need to score that many to do so.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "NoticedGenie66",
                                                    "body": "He's good, but the goals are not there. He might lose the Calder race if he doesn't shape up and fire some pucks on net! /s",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "TankDivision",
                                    "body": "Sounds familiar",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Shiny_Mew76",
                            "body": "We all know it’s the latter.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "JackManningNHL",
                    "body": "I would be so happy if they snuck in.  It really would be the dangling cherry turd on top of the shit sunday that was served to Coyote fans.\n\nAnd I don't even want Coyote fans to suffer more than they have, I just like the poetry of it all.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "C0gD1z",
                    "body": "I’m really pulling for the hockey club and not only because they have Sergachev, but he’s a big reason why.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "RikVanguard",
                    "body": "Is 30-37 with a negative goal differential \"decent\"? They're on pace for 37 wins if you round up. Last year's Coyotes, allegedly too distraught by rumors of relocation, finished with a whopping...36 wins. Oooohh big improvement by way of the loser point.\n\n\nWe're getting dangerously close to *good game ~~Yotes~~ Club Bros! Y'all gonna be spooky next year!!* territory. ",
                    "score": -1,
                    "replies": [
                        {
                            "author": "PorkinsHeldIt",
                            "body": "Sorry I couldnt see the hawks so far down the standings",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "RikVanguard",
                                    "body": "We very much know a bad team when we see one ",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Vashanesh",
            "body": "Not pictured: The Wild's freefall.\n\nIt wouldn't surprise me to see us on the wrong side of this picture before the end of the year.",
            "score": 37,
            "replies": [
                {
                    "author": "discofrislanders",
                    "body": "You're 8 points clear, it's probably safe",
                    "score": 19,
                    "replies": [
                        {
                            "author": "murgeRekwest",
                            "body": "Wild are 4-5-1 in their last 10 games. Probably safe and should be safe, but not guaranteed with their injuries.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "discofrislanders",
                                    "body": "The Wild have 14 games left. Let's say they go 6-7-1 in those 14, that leaves them with 94 points. For them to miss the playoffs at that mark, two of these four teams would need to win 12 games the rest of the way, which is a very tall order.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "murgeRekwest",
                                            "body": "\"Probably safe and should be safe, but not guaranteed...\"\n\nLet's move along.",
                                            "score": 9,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "bootygoon2",
                    "body": "Why does it feel like this happens often for the Wild? They have a great first half of the season which has them high in the standings then by the end they’re back to the middle of the pack and in a wildcard spot or third in the division. Poor cursed Minnesota, good but not good enough.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Vashanesh",
                            "body": "Because we are still a talent starved team. We have one point per game player (Kaprizov), and MAYBE two more (Boldy and Rossi) but those two are still young and streaky. We're not getting any meaningful scoring from our D, and our bottom-6 seems to be allergic to scoring. Our top-6 frequently includes retreads like Marcus Johansson, an aging -- albeit still reasonably productive -- Zuccarrello, an oft-injured Ek, etc. We're always one top-6 forward injury away from being a 1-line team (whichever line Kaprizov's on).\n\nWe start strong because our coaches understand that we win through effort, not raw skill, and gameplan accordingly.\n\nThe issue is that kind of play isn't sustainable for a full season, let alone adding playoffs. Injuries have wrecked us this year, but it's pretty common for our best guys to be tired by this point in the year. If the team's entire gameplan is \"outwork the other team\", that just isn't a long-term recipe for success.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "hockeycross",
                            "body": "Well the last few years they have had a massive cap penalty on their throat so depth has been hurt.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "bootygoon2",
                                    "body": "Fair point I did forget about that. Pretty impressive they have managed to be a playoff team all those years with the buyout costs for Suter and Parise on the books. I wonder what their off season looks like this summer as I’m pretty sure the amount goes down a ton for the two buyouts.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DisDataWang",
                    "body": "What is happening with Kap? Could him and ek come back for the playoffs? \n\nI'm a jets fan and the two teams I least want to face would be a healthy Wild and Flames (Wolf is scary good imo)",
                    "score": 5,
                    "replies": [
                        {
                            "author": "TGUKF",
                            "body": "he had surgery at the end of January",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Vashanesh",
                            "body": "We still don't know. All they've said is that he tried to rehab an injury that ended up needing surgery. That was before the break, and we haven't heard shit.\n\nJEEK is apparently \"likely\" to be ready for the playoffs, but we have no idea what kind of shape he's in. Neither he nor Kap are skating, yet.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "DisDataWang",
                                    "body": "Wonder what's up with the silence.\n\nTough luck- wild fans are in for some good years once you're free from the dead cap shackles.\n\nFan to fan...you really like Hartman? Lol",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Vashanesh",
                                            "body": "Plenty of conspiracy theories, of course. My personal theory is that the injury wasn't anywhere near as bad initially, but he played through it until it became a huge issue that they didn't understand the scope of. That still doesn't explain why Billy G hasn't just shut him down for the year, but it tracks with trying to protect \"his people\" (i.e. the Wild medical staff that's gotten so much shit recently).\n\nAs for Hartman? No, there's nothing he brings that isn't completely overwhelmed by his dipshittery.\n\nIf he can clean up his game, and care the right way enough to put in consistent effort, he can actually be pretty effective. The problem is that he's shown no ability to do both at the same time for any more than a few games in a row for two seasons, now. If it weren't for his contract, he would likely have already been waived. He checks off a lot of boxes of the stereotypes GMs seem to love, but too frequently he fits the \"all the tools, no toolbox\" label.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "rTpure",
            "body": "Not going to speak for other teams but Vancouver will get demolished in the first round if they make the playoffs",
            "score": 23,
            "replies": [
                {
                    "author": "weschester",
                    "body": "Anyone who gets that WC2 is getting blown out in 4 or 5 against the Jets.",
                    "score": 18,
                    "replies": [
                        {
                            "author": "PolarOpposites8",
                            "body": "I hope so… the Blues worry me the most though. I will never count them out.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Jordan_Kyrou",
                            "body": "I wouldn’t be so positive about that blowout. Whichever team wins this close race will be red hot.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "iMDirtNapz",
                    "body": "If the oilers make it to WC2 and end up getting swept by the Jets I’ll gladly take the faded emblem and cheer on Winnipeg.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "asparagusbruh",
            "body": "THE DUCKS ARE STILL TECHNICALLY IN THE PLAYOFF HUNT RAHHHHHHH FEAR US",
            "score": 17,
            "replies": []
        },
        {
            "author": "Furzmann",
            "body": "For the sake of Wolf I hope CGY makes it in, for the sake of everyone watching that playoff series I hope they don't",
            "score": 42,
            "replies": [
                {
                    "author": "burf",
                    "body": "Who doesn’t love a first round sweep where the losing team averages a single goal per game?",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "AffectionateAd147",
                    "body": "Hahahah that kid is a stud, early on in that Leafs - Flames game yesterday it looked like he was going to will them to a win. Im a van fan and the most interesting team here is Utah IMO. They beat us 3 out of 3 times this year and are a young, fast, skilled rush team. Although I do think any team that makes it in loses to WPG in 6 or less if hellybuyck is anywhere near his regular season form.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "WinPrize9339",
                            "body": "It’s like a mini tournament between 4 make-a-wish teams to get rolled over in 4 games with a 5 GAA vs the jets in the first round.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "AffectionateAd147",
                                    "body": "Yeah I agree. Although the narrative that the Canucks sub is currently spitting out is the importance of getting the playoff experience as a young team. After our moves we are a top 10 (or 5) youngest team in the NHL and getting a taste of the intensity and grit the NHL playoffs require would be very important IMO. Especially after the playoffs that Petey had last year. Also Quinn, he can do nothing wrong in my eyes, but the oilers especially were able to silence him a bit with extreme physicality.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "WinPrize9339",
                                            "body": "Yeah, and you always want to make the playoffs no matter what, we’ve got a few young guys who would be good to bleed into the playoff spirit. It’s also great for team morale. \n\nTo no surprise, the flames are the 17th youngest team, which is perfectly middle of the pack, as usual. It was funny that our game last week was touted as the ‘WC2 game’, which was between the 2 lowest scoring teams in 2025, was a great game though.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "AffectionateAd147",
                                                    "body": "It was! I was there, happy to see other Canucks fans living in calgary. I do like a lot of the young flames, think Parekh is going to be a stud for a long time, Coronato and Zary too. I’m worried that since they were mid to bad for so long that they don’t have that top end forward talent that is needed for a contender. \n\nNot saying we do either, even Petey at his best, we still need a 2C and more top 6 wingers. Hopefully we can both turn it around. My life is better when the flames and Canucks are winning.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "WinPrize9339",
                                                            "body": "I want every Canadian team to make the playoffs (apart from the oilers, fuck the oilers). My dad grew up in Vernon so I have a soft spot for the Canucks.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "AffectionateAd147",
                                                                    "body": "Ah very cool. Flames are one of my secondary teams too when they aren’t head to head with the Canucks. Have a good one pal\n\nFuck the oilers",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Shaftell",
                    "body": "It's amazing that he's a 7th round pick. To get any value from that round is good enough but to get a player of Wolf's caliber is such a cool story.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "JonTheWizard",
            "body": "I’m hoping Utah makes it.  What a turnaround from last season that would be.",
            "score": 14,
            "replies": [
                {
                    "author": "GroundbreakingRich96",
                    "body": "With the injuries we had this year it would be awesome to make the final wildcard spot.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "InsectAssassin",
            "body": "Canucks needed to beat Montreal and Utah these past few games.  I think they are done, schedule is brutal with top tier teams.",
            "score": 22,
            "replies": [
                {
                    "author": "raymondliang",
                    "body": "With Hughes back and Petey playing somewhat like a decent NHLer again, i think they’ll be okay. I dont think Utah can overcome the GP deficit and climb past 2-3 teams",
                    "score": 0,
                    "replies": [
                        {
                            "author": "DunkDaily",
                            "body": "???? It's 0 games and 2 points and Utah has a far easier schedule lol",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "InsectAssassin",
                            "body": "More worried about St. Louis, their schedule is the opposite of the Canucks.  Hughes is a monster but not 100%.  Demko would have to come back but that isn't happening.  Chytil may sit out due to concussion history and what is best for his life.  Canucks can't generate offensive chances with the dump and chase style of play.  Also, can anyone tell me what the lines are, they seem to change every game.  Chemistry isn't created in one period.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "bladeovcain",
                            "body": "I dunno. They play against Winnipeg and Vegas twice while also playing Colorado and Dallas down the stretch.\n\n\nTheir remaining schedule is not an enviable one",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "KingInTheFarNorth",
            "body": "CGY, VAN and STL are also tied on regulation wins with 24. The latter two also tied in regulation+overtime wins.",
            "score": 8,
            "replies": [
                {
                    "author": "discofrislanders",
                    "body": "STL has more total wins than Vancouver, which is the next tiebreaker",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "murgeRekwest",
            "body": "Blues play Canucks in St. Louis on 3/20 and then host Utah for the last game of the regular season.",
            "score": 7,
            "replies": [
                {
                    "author": "peaktopview",
                    "body": "I was at the Blues/Avs game a few years back, last game of the season, winner went to the playoffs (Blues lost 5-2). It was electric though",
                    "score": 3,
                    "replies": [
                        {
                            "author": "BasilCupitch",
                            "body": "I went to the game before that where all we had to do was get a point to make the playoffs and Duncan Keith scores with seconds to go in regulation.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MATCHBen",
                    "body": "Script writers were really working overtime with this one",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "FlyerN",
            "body": "This year keeps on giving, the league is competitive and there's plenty of drama, what else could you ask for?",
            "score": 6,
            "replies": []
        },
        {
            "author": "pixel-queen",
            "body": "no jinxes but I feel like the blues are hitting this with a lot more momentum than the other three. Calgary and Vancouver are kind of in a choke-off contest at the moment and Utah is hot and cold",
            "score": 7,
            "replies": [
                {
                    "author": "JackyN52",
                    "body": "Agreed. Even if we make it in somehow we’re most likely losing in 4 or 5 games to the jets even if helly shits the bed again. Our offence can’t generate shit 😭",
                    "score": 5,
                    "replies": [
                        {
                            "author": "pixel-queen",
                            "body": "oof, *that's* who you'd hit? Tough break the way the jets have been this year, Jesus lol",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BoBonnor",
                    "body": "The flames should be nowhere near this wildcard spot. I wouldn’t call it a choke when we miss. Our team is absolute wank with above average goaltending",
                    "score": 2,
                    "replies": [
                        {
                            "author": "pixel-queen",
                            "body": "Oh in the grand scheme for sure, they're regressing to the mean - after selling last trade deadline, I (and everyone else) expected to see Calgary maybe not competing with san Jose but definitely down with the kraken this year. This year's been a major credit to Wolf and he's my personal pick for the Calder",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "NotRealBush",
            "body": "It would be amazing if we make the playoffs for our first season.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Yamcha_is_dead",
            "body": "It’s just going to end up being the boring options that make it in, so Canucks and Rangers it is.",
            "score": 3,
            "replies": []
        },
        {
            "author": "VonDingwell",
            "body": "The East is equally wild\n\nhttps://preview.redd.it/3eyboukj1jpe1.jpeg?width=1080&format=pjpg&auto=webp&s=42fca8219476f9b873b50efddcd547ea90e74b22\n\n\\*I only included the islanders BC they have two games in hand while being 4 pts out",
            "score": 3,
            "replies": [
                {
                    "author": "AdmiralRon",
                    "body": "Part of me really wants Columbus to run it all the way to the final. What a storybook season that would be after that nightmare of an offseason.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Many-Potatoes",
            "body": "It’s fun watching a wild card race and feeling neutral about who makes it unlike how I feel looking at the east lol",
            "score": 2,
            "replies": []
        },
        {
            "author": "Selmanella",
            "body": "The fact we’re even relevant in this with our inability to score goals is such a testament to how amazing Wolf has been this year. Kids a superstar in the making.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Humans_Suck-",
            "body": "New guy at my work is a blues fan so obviously I want them to get in so I can give him shit when they lose in the first round lol",
            "score": 2,
            "replies": []
        },
        {
            "author": "ImAnAfricanCanuck",
            "body": "Tbh, I think the Blues will take the final wildcard spot.",
            "score": 2,
            "replies": []
        },
        {
            "author": "sbianchii",
            "body": "Let's go flames tonight, both for our pick and our playoff spot!",
            "score": 2,
            "replies": []
        },
        {
            "author": "OttawaFisherman",
            "body": "Canucks make it if Petterson plays somewhat decent. If he goes invisible again they have no shot.\n\nI’m betting on him disappearing when the games get big",
            "score": 3,
            "replies": [
                {
                    "author": "_GregTheGreat_",
                    "body": "For what it’s worth Petey has 7 points in his last 6 games, with all four goals being dangerous vintage Pettersson\n\nHe’s still not at his peak level but he’s been looking like a real 1C again",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "supereagle00",
                    "body": "Petey rises up during playoffs aside from last year when he was playing hurt. Won SHL playoff MVP and was a beast for that bubble run",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 2,
            "replies": [
                {
                    "author": "Satans_BFF",
                    "body": "The Blues have the same amount of regulation wins as the Flames and Canucks. STL is 4-1 in the shootout. So, if anything, they are boosted by being better at a dumb skills comp.",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "Turbanator456",
                    "body": "I know critical thinking and analysis is at an all time low but like come on get it together man.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "TimeForBeans420",
            "body": "God I fucking hope the flames fall apart here in the next little bit. Purely relying on wolf while having a bottom 10 pk/pp and lack of scoring is not a recipe for success.",
            "score": 1,
            "replies": []
        },
        {
            "author": "uh_Ross",
            "body": "I like that we’re all playing as if nobody actually wants that last spot. \n\nSomething tells me it’ll be Utah getting in",
            "score": 1,
            "replies": []
        },
        {
            "author": "Queasy-Yam1697",
            "body": "You think it's tight now.  Just wait for MN to keep shitting the bed.  They were atop the NHL earlier and they've been tumbling down.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DelusionalLeafFan",
            "body": "Canucks can thank the leafs. 1 they just beat Calgary clean keeping their 2 point lead. 2 leafs did not show up for their game against the Canucks handing them another 2 points free and clear. Leafs being the good guys again",
            "score": 1,
            "replies": []
        },
        {
            "author": "antrage",
            "body": "!Remindme 1 month: All the Canadian teams will make it into the playoffs.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Coldbrewski24",
            "body": "Come on Mammoth",
            "score": 1,
            "replies": []
        },
        {
            "author": "drumsareneat",
            "body": "Sad quack",
            "score": 1,
            "replies": []
        },
        {
            "author": "originalgiant",
            "body": "This is one of the most entertaining final stretches in recent memory. Tons of surprises & feel good stories all around. Also, it’s good for the league to see some new faces vying for a spot in the dance.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Any-Panda2219",
            "body": "Welcome to Bettman’s parity. I don’t hate it when the alternative is 15 meaningless games in the last month of the regular season",
            "score": 1,
            "replies": []
        },
        {
            "author": "jarude87",
            "body": "Death, taxes, and terrible Flames teams being dragged kicking and screaming to mid-first round pick hell by elite goaltending. \n\n\nI got clowned on this offseason for suggesting this is exactly where'd we'd be. And here we are again. Bottom out already...",
            "score": 1,
            "replies": []
        },
        {
            "author": "robikki",
            "body": "All 4 teams play tonight! Lots of scoreboard watching!",
            "score": 1,
            "replies": []
        },
        {
            "author": "The_Niddo",
            "body": "Canucks are screwed. Tough schedule, down our best puck moving forward, Demko still made of glass. St.Louis has a lol-worthy schedule ahead, Flames have a rookie goalie who could drag them kicking and screaming in, and Utah has nothing to lose with a gunho team. \n\nJust too many injuries and too much drama this season. At least we substantially upgraded our d-core for next year, locked in our backup goalie, and have a set of guys possibly ready to make the jump next year?",
            "score": 1,
            "replies": []
        },
        {
            "author": "00Makerin00",
            "body": "We’re boned lol. Without Chytil we don’t have a second line, and we have a tough schedule",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 1,
            "replies": []
        },
        {
            "author": "rockylion",
            "body": "The battle to lose in 5 games in the first round of the playoffs",
            "score": 0,
            "replies": []
        },
        {
            "author": "Mocha22_",
            "body": "It’d be a real shame if the flames *just* miss out. Too good to be a top pick team not good enough to be a playoff team, purgatory baby. Be a real shame.",
            "score": 0,
            "replies": []
        }
    ]
}