{
    "title": "NASA astronauts latest: Barry Wilmore and Sunita Williams return to Earth - BBC News",
    "author": "coinfanking",
    "subreddit": "space",
    "rank": 2,
    "score": 485,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 55,
    "url": "https://www.bbc.com/news/live/c9de6q52g8qt",
    "id": "1jehdvc",
    "selftext": "The SpaceX Dragon capsule carrying them undocked from the ISS about 05:00 GMT\n\nSplashdown is expected just before 22:00 GMT. The journey home will have lasted almost 17 hours\n\nIt will be a fast and fiery re-entry through the Earth's atmosphere for the Space X capsule - science editor Rebecca Morelle explains how it works",
    "comments": [
        {
            "author": "liaisontosuccess",
            "body": "dolphins swimming around welcoming them back as well",
            "score": 1,
            "replies": [
                {
                    "author": "VeterinarianTiny7845",
                    "body": "And a couple of cheeky sharks going for a welcoming nibble",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "cdtoad",
            "body": "Astronaut  \nBarry Wilmore and\n his crew crash-land on a planet where apes are the dominant, intelligent species and humans are enslaved, leading to Willmore's struggle for survival and a shocking revelation about Earth's fate. ",
            "score": 1,
            "replies": [
                {
                    "author": "CollegeStation17155",
                    "body": "As I recall, the recovery crew actually played that joke just for fun on one of the crews by having everyone wearing monkey masks when the opened the capsule.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "JonSpangler",
                    "body": "Dr. Zaius! Dr. Zaius!\n\nDr. Zaius! Dr. Zaius!\n\nDr. Zaius! Dr. Zaius!\n\nOh, Dr. Zaius!\n\nDr. Zaius! Dr. Zaius!\n\nWhat's wrong with me?\nI think you're crazy.\n\nI want a second opinion.\nYou're also lazy",
                    "score": 1,
                    "replies": [
                        {
                            "author": "TheRealNobodySpecial",
                            "body": "I thought he sleeps with the fishes?\n\nNo, he's sleeping with the fishes.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ZeroWashu",
            "body": "How many astronauts have returned in a vehicle type they did not launch in?",
            "score": 1,
            "replies": [
                {
                    "author": "MammothBeginning624",
                    "body": "During shuttle era a few launched on shuttle became part of ISS expedition and came home on soyuz and vice versa started on soyuz ended on shuttle.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "PM_ME_UR_ROUND_ASS",
                    "body": "Actually quite a few - Wilmore and Williams are joining a rare club that includes Apollo-Soyuz astronauts, several ISS crew during emergencies, and notably the Columbia STS-107 crew would've if the tragdy hadn't happened.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "AliDearest94",
                            "body": "How would the Columbia crew have joined the club? They were either living or dying on that shuttle unfortunately. The Atlantis rescue scenario is a pipedream.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "CFCYYZ",
            "body": "\"Leave it to tomorrow to unpack my case, honey disconnect the phone\" - Beatles  \nWelcome home folks! There is beer, pizza and cake in the fridge.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gamnit",
            "body": "New guy working at a news station, watching the feed, probably one of the most stressful feeds ive ever had to route. Huge ups to the techs, engineers, physicists, meteorologists, etc who made this possible. I am so happy we didnt have to go through a bad outcome here.",
            "score": 1,
            "replies": [
                {
                    "author": "Loud-Session2543",
                    "body": "Congratulations to Elon Musk and spaceX as well.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Gramage",
                            "body": "Elon Musk had absolutely nothing to do with it other than buying SpaceX and taking credit for everything they do.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "LyrMeThatBifrost",
                                    "body": ">buying SpaceX \n\nWell this is a new one. I don’t think there’s any doubt as to who founded the company.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "OxbridgeDingoBaby",
                                    "body": "Reddit every time SpaceX does something wrong/bad: It’s directly due to Elon and his ketamine. \n\nReddit every time SpaceX does something right/good: It’s got absolutely nothing to do with Elon whatsoever.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Gunnar_Peterson",
                                            "body": "You can't reason with redditors, they don't operate on logic",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "giantsfan143",
                                            "body": "Reddit used to have a boy crush on Elon. I remember very clearly. Now, they all have TDS and EDS 😂",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "theanthonyya",
                                                    "body": "Right??? It's crazy how Reddit loved Elon Musk, but now Reddit has a different opinion of Elon Musk like 6 years later. As if opinions can just change over time in response to new events taking place 😂",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "cereal_heat",
                                                    "body": "He used to honestly be an almost god-like figure here. He was going to save the world with EV's, revolutionary solar panel tech, and he was going to propel a new generation of space exploration. The moment he revealed his political position, reddit did a 180. But they did it becuase they are really smart, not becuase they are letting their political position become an all encompassing emotional saddlebag, that can control any aspect of their lives at the drop of a hat.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "ponmbr",
                                            "body": "Every time I see Elon bad I just leave this;\n\nhttps://www.reddit.com/r/SpaceXLounge/s/61zJtR54V0",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "lilmookie",
                                            "body": "He’s making the space industry unhealthy and looting government contracts but go right on ahead.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Tangielove",
                                                    "body": "He's been receiving contracts for spacex since the early 2000s. I wouldn't say looting but built a trust with the government and nasa on hitting goals. There's not much competition for him since blue origins didn't meet their goals and boeing didn't bring home their astronauts.",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "SmartestUtdFan",
                                                    "body": "Fascinating way of saying he’s found a way to reduce costs by 10x",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "ALStark69",
                                            "body": "It’s Reddit. What do you expect",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "how_tall_is_imhotep",
                                    "body": "Elon founded SpaceX. Take a few seconds to look that up",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "VeterinarianTiny7845",
                                    "body": "🎣(I have to write this as my comment it too short)",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ForsakenRacism",
                            "body": "The worst person you know does something good",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "dallascowboys93",
                                    "body": "This news will never reach the front page",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ForsakenRacism",
                                            "body": "What news?  The splash down is all over Reddit",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "ShinyGrezz",
                                            "body": "It probably will, and it certainly should've done. But shame on Musk and Trump for making it political, and shame on you all for perpetuating that. Even here, this thread is full of people saying \"welcome home!\" and offering their niceties to the astronauts. But you people couldn't help yourselves, and praised Dear Leader.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Northdistortion",
                            "body": "Yes thanks you president Trump and Elon Musk",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Steve490",
            "body": " Go SpaceX. Go NASA. Welcome back home Butch and Sunni you absolute heroes. What a Herculean effort.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheReaLKillingJok3",
            "body": "The Whole Coverage was Amazing and Dolphins to, Thank You Astronauts. Also amazing work spacex and nasa bringing them home safely",
            "score": 1,
            "replies": []
        },
        {
            "author": "ERedfieldh",
            "body": "So....give or a take a week until Trump tries to deport Suni because of her heritage?",
            "score": 1,
            "replies": [
                {
                    "author": "Nosemyfart",
                    "body": "Why just why? Instead of just being happy that these astronauts are back on earth and safe, let's just jam Trump into the story. I hate Trump too, but God damn.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "LordRattyWatty",
                    "body": "You should bet your entire worth on it! /s\n\nIt won't happen. Ever. Stop trying to doomread and make or predict something is going to happen that won't.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "alfmoren15",
            "body": "Thank you Elon you show the world what you can do!",
            "score": 1,
            "replies": [
                {
                    "author": "giantsfan143",
                    "body": "He’s a goddamn gangster and a national hero. Despite what you might see on here 😂",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ItsKingDx3",
                            "body": "Gangster lmao that’s so cringe",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "giantsfan143",
                                    "body": "Your love for Pokémon and astrology is cringe 😂",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ItsKingDx3",
                                            "body": "Musk will never let you suck it no matter how hard you grift 🥺",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "falsemessiah1999",
                    "body": "Yes this was entirely Elon musk’s doing",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "razordreamz",
            "body": "Gilligan's island. They were stranded much longer than anyone thought.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Logical-Track1405",
            "body": "If the female Astronaut is married.. \nI'll bet when she walks through the door, there's a pile of dishes in the sink and the house is a mess  😂",
            "score": 1,
            "replies": [
                {
                    "author": "OneBadHarambe",
                    "body": "What kind of 1980s attempt at humor was this?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "orosoros",
                            "body": "With all the Elon praise in these comments going on as well \n\nMaybe astroturfing?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}