{
    "title": "The wall of smoke actually worked",
    "author": "Geistlamo",
    "subreddit": "GlobalOffensive",
    "rank": 13,
    "score": 124,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 18,
    "url": "https://v.redd.it/blkbzsshefpe1",
    "id": "1je1x2j",
    "selftext": "",
    "comments": [
        {
            "author": "Noth1ngnss",
            "body": "valorant-ass execute lmao",
            "score": 65,
            "replies": [
                {
                    "author": "Geistlamo",
                    "body": "fr fr",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Vivi3n95",
            "body": "The counter? One stabby boii",
            "score": 27,
            "replies": []
        },
        {
            "author": "Ok_Top9254",
            "body": "Fun fact: Anubis B site is the hardest site to hold for CT's in the entire game. \nAlso, people have no trouble going 3 A on dust but the moment someone calls 3 B on Anubis, it's as if you insulted their whole bloodline, idk why this is a thing.",
            "score": 10,
            "replies": [
                {
                    "author": "needledicklarry",
                    "body": "3 B is generally disadvantageous because it keeps you from taking map elsewhere. The counter to a team constantly rushing B is to flash out A, or peek from bridge and shoot them in the ass.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ElectricalCurrent666",
                    "body": "why is it so hard to hold? it looks average to me",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Snowbound11",
                            "body": "Zero room to move, zero map control and every spot you play as a CT is either smokeable or a Molotov pushes you out. \n\nYou either have to double into con/retake it mid/late round or try and find a timing on B main either by flashing in for a kill or dry walking.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "FortifiedSky",
                                    "body": "yeah the biggest things are that CT's have to take a huge risk if they want to actually take control of B main / ebox since T's have such a huge advantage taking fights there. Most times even if you take control, T's still have the advantage re-taking that space / clearing angles as they please",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "_carzard_",
                            "body": "When you CT on that site, the whole time you feel like you’re a terrorist who is in a shitty position after a postplant.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "Ok_Top9254",
                            "body": "[Here is the source,](https://img-cdn.hltv.org/gallerypicture/ctijo\\_AaZjBMftkopRCed\\_.png?auto=compress&ixlib=java-2.1.0&q=75&w=1200&s=abcbedbbb0ea3ad2e591b6dec0ddd77a) [here is the article.](https://www.hltv.org/news/40195/which-bomb-sites-are-hardest-to-hold) Idk about you but it feels extremely claustrophobic to play and you have zero safe space to to hide and play from to prevent Ts from entering the site. If you think about it, every bombsite in the game is awkward to enter for Ts because you have to clear multiple angles, have a tight corridor, long stretch of map you have to run through and be in the open if they peek into you, or have to climb over something, even if you do your utility correctly. On anubis though, once you smoke cross and dark/ninja, and take connector or molly it, you just have to swing pillar. Ts have a crossfire from connector/main. They can straight up ferrari peek people corner/pillar and they can't hide. At most they can hide in a smoke and repeek, but they'll be in an obvious disadvantage. Unless the CT doesn't get a double kill, they'll be instantly traded.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DivideNo2179",
            "body": "Smokin’ in the boys room",
            "score": 8,
            "replies": []
        },
        {
            "author": "AnotherNobody1308",
            "body": "This view is so good",
            "score": 5,
            "replies": []
        },
        {
            "author": "Ancient-Product-1259",
            "body": "Do this at the start and then follow up with people throwing molotovs 1 at a time to make it not defusable",
            "score": 3,
            "replies": []
        },
        {
            "author": "Ahmedia69",
            "body": "bro came in and planted and then just snuck out lmao",
            "score": 1,
            "replies": []
        },
        {
            "author": "ProfetF9",
            "body": "Now evolve! Do longer smokes, all go trough smoke > ct > A 😈",
            "score": 1,
            "replies": [
                {
                    "author": "Geistlamo",
                    "body": "Challenge accepted!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "flyinpiggies",
            "body": "All fun and games until you get ninja’d",
            "score": 1,
            "replies": []
        },
        {
            "author": "masiju",
            "body": "WeMade Fox ass execute https://youtu.be/av1NKDmFjZQ?si=DJiUwoU41Fc98xTJ",
            "score": 1,
            "replies": []
        }
    ]
}