{
    "title": "IGL's V.s. The Top 10 in 2025",
    "author": "CjDoesCs",
    "subreddit": "GlobalOffensive",
    "rank": 8,
    "score": 62,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 21,
    "url": "https://i.redd.it/rgq22gatrhpe1.png",
    "id": "1jec3xj",
    "selftext": "",
    "comments": [
        {
            "author": "dontletmecook73",
            "body": "Surprised Blitz is only 0.94. Every time I watch their games he looks pretty impactful when fragging",
            "score": 36,
            "replies": [
                {
                    "author": "lordposedyon",
                    "body": "They mostly win and ratings are really good on those games. But when they lose, 0.9 and below. Last Vitality game especially hits the average hard. 0.56, 0.6 maps, ufff",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "CjDoesCs",
            "body": "Threw this together for something else but this is every IGL in the Top 10 right now compared with the same filters of 2025 and vs top 10. Crazy how far away from the pack Apex and Twistzz are despite their differing results.\n\nEdit: and stats allow for very little nuance, not every team is structured for their IGL to have great numbers just a fun comparison",
            "score": 30,
            "replies": [
                {
                    "author": "Ok_Cardiologist8232",
                    "body": "Apex and Twistzz aren't really that crazy, twistzz is a new IGl that was star player.\n\nAnd Apex used to be one of the best Entries in the world.\n\nOther IGLs that had star status like Karrigan, and Snax are  older and take up far worse roles than Apex and Twistzz.",
                    "score": 22,
                    "replies": [
                        {
                            "author": "CjDoesCs",
                            "body": "I would also hold up Ropz making apEX life easier over all and allowing him to focus on his individual game is a huge boon",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "jcv999",
                            "body": "Apex is older than snax",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Ok_Cardiologist8232",
                                    "body": "He takes up worse roles and took a massive break from Tier1 play.\n\nWhereas Apex has been in T1 since like 2010.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Character-Divide-170",
                            "body": "The roles play a small part. Any team that wins all their games gets a super inflated rating. Apex wins all his games right now, so his rating is super inflated. Twistzz loses all his games and still has a 1.05, indicating he is an actual extremely good individual player. \n\nGo look at Apex rating vs top 20 in years where his team wasn't do so hot. Sure he plays better roles than Karrigan and Snax, and he has a better rating than them, but he still puts up bot numbers.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "noahloveshiscats",
            "body": "snax 2nd worst stats so does that mean he is 2nd most genius #nooticing",
            "score": 19,
            "replies": []
        },
        {
            "author": "Lizmurigi",
            "body": "Put some respect on Finn's name",
            "score": 9,
            "replies": []
        },
        {
            "author": "IbanezHand",
            "body": "karrigan is the worst IGL, confirmed.",
            "score": 5,
            "replies": []
        },
        {
            "author": "dafo446",
            "body": "The only one standout to me is Brollan, like MOUZ kick Siuhy, arguably one of the best new generation IGL and everyone think Mouz are crazy, and they Win.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Boba_Fett_is_Senpai",
            "body": "The [peak IGL](https://www.youtube.com/watch?v=wkHbQCJvLQ8)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Character-Divide-170",
            "body": "Sometimes rating causes winning, but sometimes winning causes rating.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThisBeTheVerse63",
            "body": "I cant help but cheer on Brollan. His calls keep improving, and his teammates really trust him. I’m excited to see how far along he develops by December. Nothing against Shiuy, but I find the new Mouz more entertaining strat wise. Of course, Sphinx has been the missing piece they needed for consistent power.",
            "score": 1,
            "replies": [
                {
                    "author": "BW4LL",
                    "body": "You’re giving way to much credit to someone who is most likely working off the playbook Siuhy and sycrone created for this season. Also Mouz were already a top 5 team and so it’s not like he elevated them to new heights. I’d hold off on praise till seeing how they perform the rest of this season and next.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "n05h",
                            "body": "Yeah, time will tell if he can bring depth",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "El_Chipi_Barijho",
            "body": "Karrigan: God of the game.\n\nSnax: Bot Snax.\n\nThe exact same stats. Maybe stats are the worst way to evaluate IGLs?",
            "score": 4,
            "replies": [
                {
                    "author": "Stahlios",
                    "body": "Well, yeah, no one is saying that this evaluates the best IGLs. Those are still interesting to see.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "jonajon91",
                    "body": "Karrigan has gotten away with ass mechanics for a long time now because of his slick calling.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "CriticalCreativity",
                    "body": "It's the same as comparing Twistzz & Apex i.e. one of them is -- in addition to their individual stats -- a much stronger IGL than the other",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}