{
    "title": "Got a shop that's 1000ft away from the house and I had Internet working there for a year. But now it don't work. Any idea why?",
    "author": "Rough_Community_1439",
    "subreddit": "HomeNetworking",
    "rank": 5,
    "score": 747,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 83,
    "url": "https://i.redd.it/qi2q38e9vbpe1.jpeg",
    "id": "1jdq18h",
    "selftext": "It's hooked to a 1000ft fiber cable and it went from the router to the converter then to the converter and another router. I rebooted EVERYTHING and still got nothing. I tried bypassing the router and tried putting it directly into the modem Armstrong gave us. I tried swapping out the converters on both sides. The fiber line appears to be communicating but I got no data output. Any suggestions for a fix?",
    "comments": [
        {
            "author": "MegaBusKillsPeople",
            "body": "Those converters are not bad for the price, but it's likely one of them is junk. Spend the $56 and order a new set. OR get a switch with a SFP port(s)",
            "score": 586,
            "replies": [
                {
                    "author": "Rough_Community_1439",
                    "body": "Turns out there was a bug that died in one of the converters. Replaced it and it's back up. Thank you for the idea to swap one out",
                    "score": 719,
                    "replies": [
                        {
                            "author": "JuicyCoala",
                            "body": "Dang this reminded me of the history why “[bugs](https://americanhistory.si.edu/collections/object/nmah_334663)” were used to denote any issues with a code in a deployed software or system…",
                            "score": 334,
                            "replies": [
                                {
                                    "author": "scfw0x0f",
                                    "body": "That original bug caused a hardware failure, not a software failure, even if programmers blame EEs for all their mistakes whenever they can 🤣\n\nhttps://interestingengineering.com/innovation/the-origin-of-the-term-computer-bug",
                                    "score": 37,
                                    "replies": [
                                        {
                                            "author": "IAmSixNine",
                                            "body": "haahh Hardware bugs vs Software bugs.   Dang bugs just get a bad wrap.",
                                            "score": 9,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Valvazork",
                                    "body": "Thank you!",
                                    "score": 30,
                                    "replies": []
                                },
                                {
                                    "author": "ButItsRexManningDay",
                                    "body": "Hah I was just about to say this!\n\nAlso reminds me of the old early 70's movie The Adromeda Strain where someone wasn't notified from the computer because a piece of paper got jammed between the bell and the striker but tech's didn't see it because they were focused on finding the fault in the electronics in the cabinet and didn't look at the bell on the door.\n\nWas explained as \"These were highly trained electronics men, looking for an electronic fault. The trouble was purely mechanical of the simplest kind. But for them, it was like trying to see an elephant through a microscope.\"\n\nI always try to remind myself of that line to think outside of the box with an issue when I'm getting stuck/there is no obvious problem/answer,",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "medforddad",
                                    "body": "Except that note: \"First actual case of bug being found\" clearly indicates that \"bug\" had already been in use as slang for error/problem in hardware or software. Otherwise they wouldn't have made a joke about this being an \"actual\" bug in the system.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "zoltan99",
                            "body": "Can you link where you found the replacement converter bug?",
                            "score": 37,
                            "replies": [
                                {
                                    "author": "scratchfury",
                                    "body": "I’m also curious if the replacement bug was also dead or if it needed to be alive.",
                                    "score": 22,
                                    "replies": [
                                        {
                                            "author": "zoltan99",
                                            "body": "This is why I asked for a link, part number would be good too, op please deliver",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "Jasong222",
                                                    "body": "Not op and of course what bug you use can depend, but any of these should work interchangeably:  \n  \nhttps://www.ebay.com/itm/116457036992",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "ragnerokk88",
                                                            "body": "No, he said the bug died you obviously need a live one to carry the data back and forth.",
                                                            "score": 9,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "LongWalk86",
                                    "body": "Clearly a firefly. Only available in the back yard of the old hippie couple up the block that doesn't use pesticides and mow their lawn with a scythe.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Sad_Refrigerator8426",
                            "body": "fun story, worked in networking for a while back in early 2000s was working an internet outage with a field tech, he arrived to the cabinet where we determined to be the cause and opens it with me on the phone and starts gagging. \n\nTurns out crickets had been molting in the cabinet (guessed cause it was warm?) to the point that they had filled up every empty space with cricket shells and various forms  of life of cricket. Tech sent me a pic which i wish i still had where you could legit see the imprint of the door of the cabinet in this mass of cricket with the vents and all. \n\nTech legit had to basically chisel off all the cricket mass to get to the gear and swap out the card that had shorted out lol.\n\nThen they plugged every hole they could find with mesh on the outside of that cabinet.",
                            "score": 29,
                            "replies": [
                                {
                                    "author": "DrWhoey",
                                    "body": "Please don't ever forget the mess that field techs have to deal with when you meet them in person. We're a little off, and a little weird, and might smell a bit funny from what we had to deal with that day.\n\nWe work it so you don't have to!",
                                    "score": 26,
                                    "replies": [
                                        {
                                            "author": "Sad_Refrigerator8426",
                                            "body": "Lol whats funny is if you're based in the states or the UK, there is a decent chance we've worked together.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Koto137",
                                    "body": "I had Internet outage last spring, at ISP junction box, small box where they weld two optic cables together, from their cables to cables leading to my house. It appears that wasps are getting into these boxes, forming nestst which eventualy push optic link to the corner and break it due to angle. Technician came prepared with wasp spray, as it was not his first rodeo 😅",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "doge_lady",
                                    "body": "That pic sounds like gold. Too bad you lost it.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Sad_Refrigerator8426",
                                            "body": "I also had a call where the customer hung up on me because a BEAR ENTERED THEIR KITCHEN.\n\n  \nBest part is the guy is like \"hey sir imma have to call you back\"\n\nPuts the phone down and you hear \"Mary! Theres a BEAR CAME IN THE BACK DOOR\" and the line cuts off.\n\n  \nI did check his account later that day and they did call back, so guess they shood it out but its a funny call.  I still have the audio for it lol",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "DandyInkantation",
                            "body": "I'm being dumb, I read it like you replaced the bug for a live one.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "Unfair-Sell-5109",
                            "body": "So it was an insect and not a bug in the software?",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "paulstelian97",
                                    "body": "Organic bugs",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "RoughManguy",
                            "body": "When troubleshooting networks, always start from Layer 1 - is my cable/connector/device still completely functional?",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Riobob",
                            "body": "Good on you. You debugged the converter.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Savings_Storage_4273",
                            "body": "I read you fixed the issue, but invest in some cleaning tools for the fiber, I would bet you didn't clean anything while you were troubleshooting, this is very important with Singlemode Fiber.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Rough_Community_1439",
                                    "body": "Would be a good idea. There was a quarter inch of dust on the converter I replaced.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Savings_Storage_4273",
                                            "body": "You really need to, 9 micron core, a speck of dust affects performance. At a minimum one of these [Click Cleaner](https://fibercablesdirect.com/fiber-optic-cleaners/344-one-click-lc-mu-fiber-optic-cleaner.html?srsltid=AfmBOoqToE4sSrm9Sh2AZDJWZXcA2adM7DLM4UL-zEN06YJ7JY9pgD_o) not the best option, but for a novice, this is better than nothing. You can clean each patch cables and the optics of the media converters.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "jacle2210",
                            "body": "Dang, would have been cool to see a 21st Century telecommunications bug.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "DDS-PBS",
                            "body": "Thank you for coming back to update us.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Rough_Community_1439",
                                    "body": "It's the least I could do. This project would have been abandoned if it weren't for this communities help with troubleshooting.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "thejamus",
                            "body": "Different situation but somewhat relevant since the elements can be rough on electronics.  I recently had to have my ISP come out to the house because I'm paying for 600mbps down but was only getting between 20-40mbps with frequent dropouts.  Turns out a squirrel had partially chewed through the coax service line.  Moisture got into the service line and that was that.  They ran a new service line and everything is great again.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "imakesawdust",
                            "body": "So your network was bugged, eh?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Primus_is_OK_I_guess",
                            "body": "What kind of bug did you replace it with?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "LongWalk86",
                            "body": "Glad you were able to find a new firefly. They can be hard to find this time of year.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "wrexs0ul",
                    "body": "Beat me to it. Those converters die way more often than the fibre.\n\nAnd much cheaper to replace as a test!",
                    "score": 6,
                    "replies": [
                        {
                            "author": "MegaBusKillsPeople",
                            "body": "That brand is like $26 each delivered from Amazon prime",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Rough_Community_1439",
                                    "body": "I found the original listing and naturally I bought 4. Along with 4 SFP adapters because the one converter is in a pretty bad environment.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "MegaBusKillsPeople",
                                            "body": "I have one stuffed in a plastic electrical box out in the middle of parking lot for security camera. We're betting is going to last about a year maybe a little more.\n\n I act as the ISP for my business park, these are how I interconnect all the buildings. I charge them $100 setup fee and then $30 a month. Between internet and trash service I make about 150 a month",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Rj_Core_14",
                                                    "body": "I would love to know to what kind of hardware you are using and how are you connecting/authenticating them in the software.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "MegaBusKillsPeople",
                                                            "body": "Used layer 3 switch using SFP/LC adapters with separate VLAN's. On their end, one of the 10Gtek adapters with SFP/LC to a cheap gateway/router. If they don't pay, I either unplug their connection or shut it off/throttle via the switch.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Bluetooth_Sandwich",
                            "body": "No doubt, it's generally why I like to pick up a couple from FS",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "wrexs0ul",
                                    "body": "I inherited a couple with a company for some network shots in remote areas. So much cheaper to keep a spare on site than send a tech. That being said, they're great for what they do. As is FS.com!",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "T3a_Rex",
                    "body": "The “Sodola” switch on Amazon is 35 bucks for two SFP+ and 4 2.5gbe. It’s better and cheaper than a media converter.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "The_Doctor_Bear",
            "body": "Pull the fiber (handle with care, don’t get dirt or dust on fiber end)\n\nPull the SFP\n\nPower cycle the adapter\n\nPut the SFP back in\n\nPut the fiber back in\n\nTest again.\n\nCheck all the Ethernet cables you’re using since those are cheap and you should have spares on hand.\n\nThe fact that it’s showing it’s negotiated and MDX etc should mean your fiber is good.\n\nI’d be looking at either a bad adapter or bad SFP.",
            "score": 51,
            "replies": [
                {
                    "author": "Rough_Community_1439",
                    "body": "Since I found it was a bad adapter I chose to have a couple spares. For a 1000ft run of fiber is this the right SFP to purchase? I am a bit of a novice when it comes to fiber \n\nhttps://a.co/d/6Cisw1Y",
                    "score": 12,
                    "replies": [
                        {
                            "author": "The_Doctor_Bear",
                            "body": "Do you know what kind of fiber you have running between the two locations?\n\nThose are multimode adapters and should be fine for your distance requirements.\n\nOnly concern would be whether your fiber is multimode or singlemode spec. Multimode is more common at these distances.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Rough_Community_1439",
                                    "body": "Looks like LC to LC single mode\n\nhttps://preview.redd.it/4pn5kfn95cpe1.png?width=1080&format=png&auto=webp&s=d44ba93fb1aacdd62564b48c863fdf8589df59c8",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "The_Doctor_Bear",
                                            "body": "Then what I would look for would be something LC duplex single mode in approximately your range.\n\nSingle mode fiber has a different core diameter and it is more optimal to use the intended transceivers.\n\nI’ve never used these specifically but they should meet your needs of 1000’ distance capable, single mode, LC duplex.\n\nhttps://a.co/d/9te78VG",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "QPC414",
            "body": "Have you verified the switch/router port that feeds the converter works?\n\n\nDo you have good lights on the other converter?  \"Fiber\" and \"1000M\" lit on the other side?",
            "score": 7,
            "replies": [
                {
                    "author": "Rough_Community_1439",
                    "body": "Both converters looked the same. also turns out there was a literal bug issue with it.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "esseeayen",
                            "body": "So, you literally debugged the issue.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "WTWArms",
                                    "body": "Love it!",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "QPC414",
                            "body": "😆  Love the easy fixes!",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Rough_Community_1439",
                                    "body": "Due to the dust and an apparent bug I decided to put the new adapter into  the same box a PLC sits on. Should make it last longer than 9 months.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Thebandroid",
            "body": "As you can see from the 1000m light, you have the metric version. You need one that says 1000ft.",
            "score": 18,
            "replies": [
                {
                    "author": "Germainshalhope",
                    "body": "Lol",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Draskuul",
            "body": "Glad to see you were able to do this right and use fiber.  \n\n\nI had a family friend in the same situation but he had already run CAT5 before I got involved.   I salvaged it with a couple T1 routers and using it as a dry pair.  Fortunately I had an old set with internal clock generators.   Yeah it's slow, but this was also 25 years ago.",
            "score": 6,
            "replies": []
        },
        {
            "author": "PanoptiDon",
            "body": "I've worked with a bunch of these and the fail rate was pretty high",
            "score": 3,
            "replies": []
        },
        {
            "author": "Drisnil_Dragon",
            "body": "Did you run fiber between the buildings?",
            "score": 2,
            "replies": [
                {
                    "author": "Drisnil_Dragon",
                    "body": "Also do you have a fiber tester? It passes light between ends to see if the fiber comes out the other side.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Drisnil_Dragon",
                    "body": "From the picture, the Ethernet cable may be bad. Do you have Ethernet cable tester?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "NikolaiCakebreaker",
            "body": "Those converters (Planet and the many knockoffs) just die sometimes. I've replaced many over the years.",
            "score": 2,
            "replies": []
        },
        {
            "author": "dragonflymaster",
            "body": "Just on the line of \"bug\" problems. I once lived in a rural area with only ADSL connections for internet. The phone cable was rural aerial (thicker copper - less loss)  and then via a few ground pits and underground to the house. On more than one occasion (and often after big rains) when the internet went crap I would lift the pit lid and the pit would be full with an ants nest. Once I sprayed them and dug all the stuff out (and it dried out) the speed would get better. The joins seemed to be those gel ones but water still got in.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Valuable-Speaker-312",
            "body": "I remember being sent to a restaurant where the kitchen PC had a dead mouse.  I got there and noticed the computer wouldn't even turn on.  Turned out that a mouse got into the PC and ate a power line.  ZAP!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Slater1601",
            "body": "Could be something in your design with routers and such. Why don’t you plug a computer into the Ethernet port at each end. Set your ip address on one to something like 10.10.10.1 /24 and 10.10.10.2 on the other. See if you can ping each other. Then report back here and we’ll go from there.",
            "score": 1,
            "replies": [
                {
                    "author": "Rough_Community_1439",
                    "body": "Had a literal bug issue with the converter. I replaced it and it's back up and running",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Yetkha",
            "body": "\"another router\" means you're double NAT OR it's 1 of those \"mesh\" routers acting as an access point? (Saw that the problem in the title resolved, this is just a separate question out of curiosity)",
            "score": 1,
            "replies": []
        },
        {
            "author": "painefultruth76",
            "body": "The green light is off.",
            "score": 1,
            "replies": [
                {
                    "author": "Rough_Community_1439",
                    "body": "It was never on.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "No_World_4832",
            "body": "Take a look at Bi-Di SFPs. Single core optics. You can run 1 or 10Gbps over a single strand of fibre. Also by going direct into the switch via SFP will be more robust than media converters. Also if you have decent SFPs that support DOM you will be able to monitor the signal loss of the link to know what is a healthy link vs losses and other issues.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NeverTooOldTooGame",
            "body": "Buying a new set of coverters is cheaper than the alternative of putting in a Point to Point ubiquiti setup.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KarmaKaladis",
            "body": "Media converters are terrible. Yes it solves a problem but spend a bit more and eliminate this troubleshooting black hole.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Insomniac4969",
            "body": "Had a very similar switch, it just burned out one day. Got a new one and it was working again.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Richiedafish",
            "body": "You check the fiber with a good flashlight fyi. If you can see good light at the other end, it’s probably not the fiber.",
            "score": 1,
            "replies": [
                {
                    "author": "CoatStraight8786",
                    "body": "Ruby red (VFL) are like $20 on Amazon,  much better than a flash light,  especially for 1000ft.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "tangobravoyankee",
                            "body": "IDK about 1000ft, but the cameras on my phones have always gotten the job done. Tho I'm sure I've read that some have a filter so best to verify with a known-good emitter first.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "CarefulAstronomer255",
            "body": "> The fiber line appears to be communicating but I got no data output\n\nMaybe the line is damaged? Perhaps something has nibbled the line so that it can still send signals but the signals are so disrupted by the damaged line that no data can be decoded on the other side.",
            "score": 1,
            "replies": []
        },
        {
            "author": "anthonythemoonguyyt",
            "body": "Who agrees that a Wi-Fi Booster Sucks?",
            "score": 1,
            "replies": [
                {
                    "author": "yrro",
                    "body": "They are awful yes",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Rough_Community_1439",
                    "body": "The only reason why I have a wifi repeater is because it has a Ethernet hookup. I have it for my PC and it saved me from running another cable.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "niamulsmh",
            "body": "fibre cut or signal loss.",
            "score": -1,
            "replies": []
        },
        {
            "author": "anthonythemoonguyyt",
            "body": "Will this Make my Wifi Speed Faster? Better than a Wifi Booster?",
            "score": -1,
            "replies": []
        }
    ]
}