{
    "title": "Version 5.5 Special Program Announcement",
    "author": "the-roast",
    "subreddit": "Genshin_Impact_Leaks",
    "rank": 17,
    "score": 1935,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 181,
    "url": "https://i.redd.it/b5of7nq0n6oe1.png",
    "id": "1j9airi",
    "selftext": "",
    "comments": [
        {
            "author": "KumanderKulangot",
            "body": "Fare thee well and until we meet again, Bob Genshin and John Impact.",
            "score": 593,
            "replies": [
                {
                    "author": "TetraNeuron",
                    "body": "*Kindly Da Wei… Make the world… A gentler place...*",
                    "score": 64,
                    "replies": []
                },
                {
                    "author": "rotten_riot",
                    "body": "Going from Bob Genshin and John Impact to this will be a massive downgrade and I haven't even seen the livestream yet, I just know it",
                    "score": 36,
                    "replies": [
                        {
                            "author": "IttoEnjoyer_",
                            "body": "\"I aM sO eXcItEd To Be HeRe\" ugh ENOUGH",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Striking_Branch_7281",
            "body": "Everyone's freaking out about Mizuki being on the art and not Iansan, and here I am wondering how people aren't talking about the fact that right above the post image(the official twitter post) it said and I quote:\n\n>\\*There will be a special standby animation before the Special Program begins. Traveler, stop by early to watch it!\n\nI wonder what that animation will be considering all the crazy moon lore stuff lately and the fact the livestream happens literal hours after a total lunar eclipse.. 👀",
            "score": 467,
            "replies": [
                {
                    "author": "zMaximumz",
                    "body": "I think it would be weird to show that **before** the program because it could lessen the hype of the stream\n\nThough I would LOVE another Moon Sister lore drop",
                    "score": 131,
                    "replies": [
                        {
                            "author": "que_sarasara",
                            "body": "Perhaps that's the idea though, to get you there before it starts (and hopefully keep you there for the rest of it).",
                            "score": 61,
                            "replies": [
                                {
                                    "author": "zMaximumz",
                                    "body": "Hopefully",
                                    "score": 14,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Accomplished-Let1273",
                    "body": "Eclipse is a really important theme around genshin \n\n\"THE ECLIPSE DYNASTY\" and the \"CRIMSON MOON DYNASTY\" were the ones who started the game's story after all\n\nI remember seeing the eclipse in mavuika's trailer and going crazy with different theories (since the eclipse was covering natlan's symbols which is the sun)",
                    "score": 50,
                    "replies": []
                },
                {
                    "author": "Antique-Substance-94",
                    "body": "Maybe not moon lore or anything but another type of video like the one we got in before 5.0 livestream with ajaw playing but this time it will be ifa bird playing",
                    "score": 35,
                    "replies": []
                },
                {
                    "author": "KrzyDankus",
                    "body": "its most likely something similar to Flappy Ajaw from 5.0",
                    "score": 16,
                    "replies": [
                        {
                            "author": "TheSpartyn",
                            "body": "lol yeah people expecting some arlecchino or capitano style teaser and it's just gonna be a goofy lil cartoon",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "validq_",
                    "body": "genuinely more excited about the moon lore in the livestream more than any character, new area, or banners, because they hinted to show us something on the day of full moon",
                    "score": 49,
                    "replies": []
                },
                {
                    "author": "dr0ps0fv3nus",
                    "body": "Standby animations are usually just silly filler so I wouldn’t get too excited for that specifically, but I am expecting them to talk about the web event, since it’ll be updated throughout 5.5.",
                    "score": 44,
                    "replies": [
                        {
                            "author": "Striking_Branch_7281",
                            "body": "Yea I'm keeping my expectations low, but I do hope they'll elaborate on the web event stuff at least because the whole timing of it can't be a coincidence. 🤔",
                            "score": 9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Aerie122",
                    "body": "Snezhnaya crumbs 👀",
                    "score": 8,
                    "replies": [
                        {
                            "author": "DrRatiosButtPlug",
                            "body": "More like Nod-Krai crumbs",
                            "score": 15,
                            "replies": []
                        },
                        {
                            "author": "AverageAyatoFan",
                            "body": "Fuck it anime crumbs inject that copium into my eyeballs",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "itbelikethattho_",
                    "body": "It’s just gonna be something like we had before the 5.0 livestream. Nothing important. You guys read too into things",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Striking_Branch_7281",
                            "body": "Well it IS Hoyo so tbh there’s always that possibility, however they didn’t mention other similar animations beforehand which makes me think they’re gonna show something more important. At the very least we should expect some more info on that web event(you’d think).🤔",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Jaynat_SF",
                    "body": "Does that mean the animation will start before 8:00 UTC-4 or that it'll start at that point and the special program will follow?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Striking_Branch_7281",
                            "body": "Well UTC-4 8:00am is east coast US, and in terms of US central time, that’s means the livestream is at 7:00am and the total lunar eclipse is supposed to be at its fullest/peak somewhere around 1 or 2am CT/UTC-5(would have to double check the specific time but it’s somewhere around that). This means the livestream happens hours after the eclipse is basically done. ",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Relevant-Rub2816",
                    "body": "I'm praying it is sneznaya or celestia crumbs. I will take any at this point. They already dropped cool ass moon lore.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Active_Mall7667",
                            "body": "We probably have to wait for Liben or some important character in nod krai at the end of the story arc to learn something about snez. Hope the additional year of waiting will be worth",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "RefuseStrange2913",
                    "body": "Hope this otherwise it will be so stupid to this webevent and create the hype",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "SkyRyanXp",
                    "body": "Soo..the livestream finished and we didnt saw this animation I guess? Or was it just the trailer?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Striking_Branch_7281",
                            "body": "The \"standby animation\" the official post referred to just ended up being a preview of the collective of plenty area and new saurian we're getting in 5.5.. pretty underwhelming tbh cause I think most people expected some moon lore.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "shdn_paar",
            "body": "does this mean VAs do the livestream?\n\nrip bob genshin and john impact... yall he missed 🤧",
            "score": 410,
            "replies": [
                {
                    "author": "thesqrrootof4is2",
                    "body": "it seems that they will, but it doesn't necessarily mean EN VA is back also...\n\nthe compromise is to definitely ask the VAs for the new characters to step in during as they still maneuver through this situation",
                    "score": 144,
                    "replies": [
                        {
                            "author": "shdn_paar",
                            "body": "yup. and I think that's why mizuki is there instead of iansan... maybe iansan is still muted in en",
                            "score": 110,
                            "replies": [
                                {
                                    "author": "Budget_stawbeery",
                                    "body": "Rip iansan might get recast ",
                                    "score": 52,
                                    "replies": [
                                        {
                                            "author": "hackenclaw",
                                            "body": "Iansan have soo little voice line even in Natlan quest, so even if Hoyo decide recast we wont be losing much.\n\nUnlike the old characters like Zhongli, Hu tao etc.",
                                            "score": 24,
                                            "replies": []
                                        },
                                        {
                                            "author": "SomeoneSayOri",
                                            "body": "If Iansan was recast, I would've expected her new VA to be hosting the program, so I don't think she's been recast",
                                            "score": 45,
                                            "replies": [
                                                {
                                                    "author": "pokours",
                                                    "body": "Iansan is a 4*, they don't always feature in their own patch livestream so I'd stay it's still possible. I don't believe Hoyo would release a mute character",
                                                    "score": 8,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Budget_stawbeery",
                                                    "body": "ZZZ lycon got recast without any Announcement so iansan might get too",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "author": "HaukevonArding",
                                                            "body": "I don't think so. They have a different Studio and Genshin does less replacements of VA than ZZZ in general.",
                                                            "score": 26,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "ThamRew",
                                                            "body": "even S11 got replaced too, it's so jarring 😭",
                                                            "score": 4,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "I_am_the_grass",
                                            "body": "Genshin is trying to avoid a situation of recasting a VA because of the strike. It's a bad look.",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "MorningRaven",
                                                    "body": "It's also a great way to break a lot of players love for their characters.",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "Starmark_115",
                                                            "body": "Only time they cake was there and ate it too was with Tighnari's first VA if memory serves",
                                                            "score": 8,
                                                            "replies": [
                                                                {
                                                                    "author": "MorningRaven",
                                                                    "body": "In EN just Tighnari, and the general rerecording of Barbara. Chinese Oz had to be replaced.\n\nBut HSR has had a handful of recasts and ZZZ gets people randomly recasted pretty much every patch.",
                                                                    "score": 6,
                                                                    "replies": [
                                                                        {
                                                                            "author": "makogami",
                                                                            "body": "the Barbara thing wasn't rerecording perse. they had just added the wrong voice files into the game at launch, and corrected it with the right files in 1.3. the recordings themselves were from before launch. we were never meant to hear the 1.0-1.2 voice lines.",
                                                                            "score": 3,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "makogami",
                                            "body": "I don't even remember what she's supposed to sound like lol",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Decimator1227",
                            "body": "I am really curious whether Iansan has her VA back or has been recast because I doubt they will release a completely new character with no VA work at all. And before anyone brings up Pyro Traveler or RMC for HSR they aren’t new and still had their old combat grunts and voice lines from prior forms",
                            "score": 40,
                            "replies": [
                                {
                                    "author": "PapaGrinch",
                                    "body": ">I doubt they will release a completely new character with no VA work at all.\n\nI mean technically she had at least 45+ voiced en lines in Act 2 so it's not like she was completely voiced prior to being released.\n\n5.3 EN Archon Quest was shown in JP with EN subtitles so they could also do the same with her demo trailer. As for Iansan's playable state herself it might also depend on whether she has pre-recorded voice lines or not, but I guess we'll see.",
                                    "score": 26,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Starmark_115",
                            "body": "Thought Genshin rn is using the UK Branch of Side Global?\n\nAren't Anna Delvin and Naomi McDonald from Britain?\n\nWhole point they got new contracts is because of the strike the American VA's are struggling with",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "CanaKitty",
                    "body": "All the new VAs from the last few patches are non-union people who are fine voicing right now, so they have enough I guess now to do VAs in the livestream. \n\nBut I will miss Bob Genshin and John Impact. They should let them voice a random NPC line somewhere in the game.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "EpilepticMushrooms",
                    "body": "What if they were popular enough that they get to voice actual characters? That would be awesome!",
                    "score": 14,
                    "replies": [
                        {
                            "author": "MaChao20",
                            "body": "Vital NPCs in Nod Krai, maybe?",
                            "score": 14,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Illustrious-Sweet403",
            "body": "well it was fun while it lasted.\n\ngood bye kai and gabe. ty for filling in the roles of host while the va's were not present at the time. im gonna miss em.",
            "score": 72,
            "replies": []
        },
        {
            "author": "99cent-tea",
            "body": "That baby Tatankasaur has the biggest fucking uwu eyes ever",
            "score": 128,
            "replies": []
        },
        {
            "author": "astrelya",
            "body": "[Genshin JP](https://x.com/genshin_7/status/1899671903511707876?s=46) also announced Varesa's VA and it's M・A・O",
            "score": 112,
            "replies": [
                {
                    "author": "discuss-not-concuss",
                    "body": "blowing up JP’s internet as usual\n\nis there a surprise at this point?",
                    "score": 52,
                    "replies": []
                },
                {
                    "author": "dumb_lasagna",
                    "body": "... Thinking about it, Varesa really is similar to Narmaya from Granblue Fantasy.",
                    "score": 29,
                    "replies": [
                        {
                            "author": "Blanche_Cyan",
                            "body": "Varesa is a heroic glutton with super strenght just like Pekorine too, she might have a friendship with somewhat romantic tones with a hero destined fro greatness too!",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "VoidRaven",
                    "body": "Narmaya welcome back",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "Ke5_Jun",
                    "body": "Close enough; welcome back, Pecorine.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "jyusatsu",
                    "body": "Ohh really her JP Va is M.a.o.? I love her Shion from Tensura. Now I might try to pull Varesa.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "MadameHerta",
                    "body": "LET'S FUCKING GOOOOOOOO\n\nas a huge Narmaya fan, im so incredibly happy to see i was right to notice some parallels in Varesa",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "Tyberius115",
                    "body": "Welcome to Genshin, Narmaya!",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Mrl3igBozz",
                    "body": "My god, She's a big eater, airheaded like Pecorine and has a body like Narmaya. And she's now voiced by M.A.O.\n\nI'M SO CYGAMES PILLED LEZGOOOOO",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "PitifulScore7456",
                    "body": "Narmaya's VA. Yeah, that makes a lot of sense",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "thememeshark",
                    "body": "Oh no, runs! It's Europa!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "hraberuka",
                    "body": "M A O is awesome \n\nI love her as Pecorine and if i am not wrong she is also voicing Snow White in Nikke ( i am using mostly EN, but i think she voicing her )",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "the-roast",
            "body": "# JP has Iansan in Mizuki's place\n\nbut yeah",
            "score": 73,
            "replies": []
        },
        {
            "author": "OneOfQiqisFewFan",
            "body": "I'll miss bob and john genshin (Gabe and Kai i think)",
            "score": 37,
            "replies": []
        },
        {
            "author": "prezoide",
            "body": "[JP: Iansan, Varesa](https://i.imgur.com/03rivUE.jpeg)\n\n[KR: Iansan, Varesa, Mavuika, Paimon](https://i.imgur.com/1bxU5cB.jpeg)\n\n[CN: Iansan, Varesa, Mavuika, Paimon](https://i.imgur.com/55xyJv3.jpeg)",
            "score": 60,
            "replies": [
                {
                    "author": "Helpful_Mountain_695",
                    "body": "Not having Iansan in EN livestream can only mean one thing sadly",
                    "score": 48,
                    "replies": [
                        {
                            "author": "dr0ps0fv3nus",
                            "body": "Yep… on the bright side, her VA still being absent could mean the Genshin team is in favor of waiting for the actors instead of just unceremoniously recasting them without warning like ZZZ and HSR have been doing.",
                            "score": 52,
                            "replies": [
                                {
                                    "author": "Helpful_Mountain_695",
                                    "body": "Genshin is just in a way worse situation, if they start recasting all the unavailable VAs they'd need to replace like half of the cast and all their previous lines in oppose of ZZZ just recasting a few VAs and having way less lines to re-record. So I don't think it's out of Genshin's team kindness, it's just necessity",
                                    "score": 46,
                                    "replies": [
                                        {
                                            "author": "hackenclaw",
                                            "body": "Iansan is still way less lines compared to other older characters, and she spent most of post 5.1 with no voice. So recasting isnt gonna lose much.",
                                            "score": 19,
                                            "replies": [
                                                {
                                                    "author": "Blackout03_",
                                                    "body": "post 5.0 right?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "DrRatiosButtPlug",
                                    "body": "Yeah, I'll take them waiting instead of replacing because if they start replacing it means a lot of characters are in danger.",
                                    "score": 20,
                                    "replies": []
                                },
                                {
                                    "author": "somerandomname8879",
                                    "body": "Yeah thank god, there are characters I pulled pretty much purely for their voice (EN Hu Tao for example). And in HSR I *loved* HuoHuo's voice so much! The new VA is good too, but she just hits a little different... I miss og HuoHuo🥲 \n\nIf hoyo would start recasting en mass it would honestly make me a bit hesitant when pulling future characters for their VA's since they wouldn't be guaranteed to stay.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "MorningRaven",
                                            "body": "OG Huohuo and Mr. Tail. The Luka event helped me warm up to Mr. Tail and Huohuo, but the battle lines still are a downgrade.\n\nI literally pulled Argenti because his OG VA was so good for the role. The new one is a similar sound which is good, but he doesn't speak like he fully believes the words he's saying, and is just playing a theatrical character.\n\nTingyun. I love the new one for Fugue, but OG Tingyun's Laci was just too great. And she had emotion cheering on the dps.",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "pokours",
                                            "body": "I think recasting is always a last resort for them, we don't know for sure what happened with some VAs for them to get recasted, but at least if they start mass recasting because of the strike, they will make sure there is as little risk as possible that the new VAs will stop working. But who knows what could happen in the world in the future. 🥲",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "GasFun4083",
                    "body": "\"All the girly girls\" ahh stream",
                    "score": 52,
                    "replies": [
                        {
                            "author": "UglyManwithStick",
                            "body": "All the girls are girling ",
                            "score": 29,
                            "replies": [
                                {
                                    "author": "0ztralian",
                                    "body": "all the girling girls",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "que_sarasara",
                            "body": "Iansan and Mauvika have to be some of the most un-\"girly girls\" ever lol?",
                            "score": 10,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Comprehensive-Food15",
            "body": "THE MOONNNNNN",
            "score": 30,
            "replies": [
                {
                    "author": "PhiStudios_",
                    "body": "HAUNTS YOU!",
                    "score": 17,
                    "replies": [
                        {
                            "author": "Infamous-Look-5489",
                            "body": "\"Khonshu guides me. Just, not always in the right direction.\"",
                            "score": 10,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "cielrayze",
            "body": "VARESA WAS M.A.O ???\n\nwelcome back narmaya granblue fantasy",
            "score": 30,
            "replies": []
        },
        {
            "author": "JustATaro",
            "body": "Mizuki is here because she's UK voice actress (unaffected by ongoing strike in the states), and this suggests that Varesa is likely voiced by UK VA too.",
            "score": 35,
            "replies": []
        },
        {
            "author": "Stunning_Dealer_9211",
            "body": "is Iansan just gonna be mute on release? no way right?",
            "score": 41,
            "replies": [
                {
                    "author": "Wisterosa",
                    "body": "she could've been recasted, ZZZ just quietly replaced 2 characters again",
                    "score": 41,
                    "replies": [
                        {
                            "author": "fat_mothra",
                            "body": "ZZZ recast someone every week tho",
                            "score": 25,
                            "replies": [
                                {
                                    "author": "ZoomBoingDing",
                                    "body": "It's just a new Soukaku every other patch",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "que_sarasara",
                            "body": "Who were replaced? I haven't noticed anyone changing voice since I started playing in January???\n\nEdit; Soldier 11 and Lycaon, dammit ):",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "KinDGrove",
                                    "body": "Its a weird situation all around, since Lycaon's old VA tweeted out that they were never contacted by Hoyoverse or the Recording Studio (Sound Cadence) that Lycaon was getting recast, and were surprised at learning the news\n\nSimilarly, Soldier 11's old VA was not informed in advance she was getting recasted either, but she was aware that by following the SAG strike there was a possibility it would happen\n\nJust kinda unprofessional for the Recording Studio and Hoyoverse to not say anything at-all or give prior notice",
                                    "score": 22,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "DhelmiseHatterene",
                            "body": "Like another said, I’m hopeful the Genshin EN team is just waiting. Better that than replacing the VA imo.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Winston7776",
                    "body": "It’s not impossible, but given how long Iansan has been in the game, there’s also a chance that they recorded her battle lines early on. Let’s hope that they did do that",
                    "score": 26,
                    "replies": [
                        {
                            "author": "IttoEnjoyer_",
                            "body": "i doubt that given that Pyro MC is mute",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Mikauren",
                    "body": "Probably. HSR's MC is mute - including combat voicelines for Remembrance MC - so it's not impossible. I imagine if she was recast, her new VA would appear in the livestream, just like how Lycaon (ZZZ) has a new voice in official content right now.\n\nOtherwise, they were recorded earlier like previous union Natlan VAs (Kinich for example)",
                    "score": 12,
                    "replies": [
                        {
                            "author": "BobTheGodx",
                            "body": "The voice of the MC is much more important than a 4* who’s only spoken for one patch though.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Budget_stawbeery",
                    "body": "Probably recast ",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "LeagueOfHurricane",
            "body": "Did I miss something about Mizuki being in 5.5 or is this just a random guest appearance.",
            "score": 18,
            "replies": [
                {
                    "author": "Mombrki",
                    "body": "I assume it's cause they can't use iansan's VA.\n\nEdit: yeah Japanese stream has iansan and varesa.",
                    "score": 47,
                    "replies": []
                },
                {
                    "author": "Wisterosa",
                    "body": "she's spooking you on standard",
                    "score": 28,
                    "replies": []
                },
                {
                    "author": "no_longer_lurkII",
                    "body": "Mizuki's in Standard, she'll be in every patch from now on.",
                    "score": 25,
                    "replies": [
                        {
                            "author": "mitsu__",
                            "body": "wait what fr",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Bitter-Grocery-7138",
                                    "body": "Yes she's joining the standard banner cast after this patch",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "MEJ7700",
            "body": "Aw...I'm actually gonna miss the 2 npcs (localizers)",
            "score": 64,
            "replies": [
                {
                    "author": "Mombrki",
                    "body": "Hoyo please put them in the game as NPCs",
                    "score": 44,
                    "replies": []
                },
                {
                    "author": "shadowblaster19",
                    "body": "I need them in Mondstadt as random NPCs named \"John\" and \"Bob\"",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Blackout03_",
                            "body": "Have their actual names of \"Gabe\" and \"Kai\" instead.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Aiyyogxoto",
            "body": "Mizuki, hi again!",
            "score": 34,
            "replies": []
        },
        {
            "author": "Rexcaliburrr",
            "body": "John genshin and bob impact need to get honorary npc places in the open world at this point, I'm gonna miss them 😭",
            "score": 19,
            "replies": []
        },
        {
            "author": "Ash-n-Jok3r",
            "body": "I absolutely CANNOT wait to get my little jelly bean Iansan. I have waited for her since the Ignition Teaser (maybe even the Travail trailer) I’m so excited I’ll finally have a member from each of the tribes (Kinich, Xilonen, Citlali, Mualani, Chasca and now Iansan)",
            "score": 32,
            "replies": [
                {
                    "author": "Eggyolk57",
                    "body": "I just hope she isn't mute on release",
                    "score": 15,
                    "replies": [
                        {
                            "author": "Ash-n-Jok3r",
                            "body": "You and me both",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Eggyolk57",
                                    "body": "Whether she'll have a new en va or not, i'm just coping that she will finally have a voice, let's stay strong",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Ash-n-Jok3r",
                                            "body": "I’d love Tara Strong or Cherami Leigh, but they’re in my dreams copes",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Eggyolk57",
                                                    "body": "If it ends up being tara strong, imagine all the twilight sparkle memes lol",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Ash-n-Jok3r",
                                                            "body": "So true, I just kinda hope one of them because they’re like my hero voice actors, you know? They play some of my fav characters ever. Tara does Harley and Raven, Cherami does Queen from Persona 5 and the Imagined from Fortnite etc",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Starmark_115",
                                                            "body": "Imagine the Harley Quinn ones too!",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "MorningRaven",
                                                    "body": "They're too large of VA to play a 4* in some interlude quest. We're more likely to have Cherami Leigh play Bronya Tsarista.\n\nTara. Well she's versatile.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Ash-n-Jok3r",
                                                            "body": "That doesn’t add up because Erica Lindbeck voices Chev and she’s really famous and voiced tons of characters\n\nEdit: YES I WOULD LOVE CHERAMI TO VOICE THE TSARITSA, MY GOAT",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "MorningRaven",
                                                                    "body": "Erica only has a few leads though. She's got a long history and amazing roles but she does so much secondary casting, I wouldn't put her level of famous in the same as say Todd Haberkorn whose Razor and Reca.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "erosugiru",
            "body": "I'm gonna miss the localization team 😭😭😭❤️",
            "score": 20,
            "replies": []
        },
        {
            "author": "neuvvv",
            "body": "mizuki rerun? /s",
            "score": 9,
            "replies": []
        },
        {
            "author": "KittyBeary",
            "body": "I'm gonna miss Bob Genshin and John Impact :(",
            "score": 4,
            "replies": []
        },
        {
            "author": "LifesBetterWithJoja",
            "body": "probably a decent chance iansen is being recast. releasing a new character with no voice wouldnt be a good idea",
            "score": 8,
            "replies": [
                {
                    "author": "iMPoSToRRBiSCuiT",
                    "body": "The combat voices are usually one of the first things to be recorded, so those should at least be there",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "REVRYOU",
            "body": "#And Varesa's JP VA is MAO! \nYeah that's 100% absolutely ez pull for me",
            "score": 13,
            "replies": []
        },
        {
            "author": "Budget_stawbeery",
            "body": "VA stream is back?",
            "score": 2,
            "replies": []
        },
        {
            "author": "reaperhank",
            "body": "After that webevent lore dropped, i expected some small snippets of Nod krai",
            "score": 2,
            "replies": []
        },
        {
            "author": "ilovegame69",
            "body": "Mizuki taking over Iansan role, because either Iansan is still mute or Iansan VA being replaced",
            "score": 2,
            "replies": []
        },
        {
            "author": "StevieBond",
            "body": "Looks like we'll find out soon if the trailer has the EN voices in them.",
            "score": 2,
            "replies": []
        },
        {
            "author": "wobster109",
            "body": "Back to characters doing the livestream I guess. Well, I dream of one day walking around Teyvat and seeing John and Bob at Angel's Share, please 🙏",
            "score": 2,
            "replies": []
        },
        {
            "author": "xoyj",
            "body": "FML I forgot time zones have shifted, it’s at 1am for me",
            "score": 2,
            "replies": []
        },
        {
            "author": "evan_of_tx",
            "body": "Mizuki instead of Iansan. I'm so sorry Iansan enjoyers. Looks like there's a 50/50 chance that Iansan is going to be the first ever character to be released completely or partially without voice lines, unless they pre-recorded them 6 months ago. I hope she will have at least some important lines like skill cast, burst cast, and voice lines about other characters. Maybe she'll be half mute? I think it's possible. Probably the best outcome we could hope for :(",
            "score": 5,
            "replies": [
                {
                    "author": "hackenclaw",
                    "body": "there is a big diff between the story/event quest which is given free\n\nvs\n\na character that is paid. I dont think Mihoyo wanna deal with $$ refund because of uninformed player complain about no voice line when playing Iansan.\n\nIansan has to be fully voice for the character itself, either pre-recorded way earlier or recast\n\ntldr: Story/event are the freebies, character itself is a product. Releasing an incomplete product is a big nono.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "Ash-n-Jok3r",
                    "body": "I really really really hope not. It won’t look good and people are already not happy with the lack of VA’s, especially regarding Lantern Rite. That would’ve been SO much more heartfelt if Brianna had said “my hero” to the traveller instead of it being silence. Iansan is also my most hyped Natlan character, really hoping she has her voicelines and stuff",
                    "score": 5,
                    "replies": [
                        {
                            "author": "evan_of_tx",
                            "body": "I hope she's voiced too! Releasing a completely mute character is very risky, even if this character is a 4 star. I can't imagine them actually doing this. I think they have her combat voice lines",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Zindril",
                            "body": "How can Iansan be your most hyped Natlan character when she is one of the least active characters, and has barely had any VA in English? Even Dainsleif mains have more to grasp on than you lmao.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Ash-n-Jok3r",
                                    "body": "Who cares? She’s adorable, I like her design and her ancient name and profession is cool? She always caught my eye even in the travail trailer",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "PapaGrinch",
                                    "body": ">How can Iansan be your most hyped Natlan character when she is one of the least active characters, and has barely had any VA in English?\n\nYeah, Iansan is also my most hyped Natlan character even now. So uhh...you do know Iansan still has lines despite them not being voiced in AQ, a whole interlude to herself, and 92 lines in Mauvika's personal quest even though they aren't voiced in english right?\n\nThere's also the fact that every other current playable natlan character has \"About Iansan\" lines about her with even Mavuika having two lines especially for her.\n\n>Even Dainsleif mains have more to grasp on than you lmao.\n\nAnd comparing Dainsleif of all characters like he has barely any lore is kinda cringe ngl\n\nIt's giving \"I don't pay attention to other characters that interest me\" imo",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Zindril",
                                            "body": "I legit roll and immerse myself in the lore of every character. The only characters I have not rolled for are like 5 of them, and most recent ones past 2.1 are sigewinne and baizhu. Her lines are mostly of little consequence, and the lack of voice acting in EN (which the person I replied to uses it seems since they seem so passionate about her being voiced), makes the character unremarkable to say the least. \n\nShe is just not memorable, just a fitness trainer who has been hyped up to be the one Mavuika trusts to take her place in a time of crisis, if Mavuika dies or gets put out of commission for whatever reason... only to NEVER show anything of considerable strength or similar to back up this statement. Quite literally the most nothingburger character Mihoyo has come up with in Natlan. \n\nThe only time she had a semi active role was the interlude in 5.2, where she was yet again not voiced, and Capitano was the most intriguing character by far there, completely eclipsing her.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "PapaGrinch",
                                                    "body": "So your opinion of her is ultimately subjective, got it.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Ash-n-Jok3r",
                                                            "body": "Us Iansan mains gotta stick together.",
                                                            "score": 1,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "Zindril",
                                                            "body": "Well duh? I am sorry that the story has done her dirty, and her VA is nowhere to be seen, thus having less presence than even freaking Ifan's saurian companion lmao (and that's such a low bar). I just find it illogical that people act like they are her ''mains'' when we have had so little to make her barely any more unique than some side quest boring unvoiced npc. \n\nActually, now that I think about it, the majority of NPCs in World quests were more important and contributed more than Iansan. Legit all I remember Iansan blabbering about is Paimon's fitness program lol. \n\nReally goes to show also that you guys can come up with no good arguments over why you like Iansan, other than just her design (which is about the only fair metric ppl have so far of her), because her story and lack of VA stinks.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "PapaGrinch",
                                                                    "body": ">I just find it illogical that people act like they are her ''mains'' when we have had so little to make her barely any more unique than some side quest boring unvoiced npc.\n\nOnly thing illogical here is your stubbornness in believing some sort of criteria needs to be met to be excited about another character. \n\n>Really goes to show also that you guys can come up with no good arguments over why you like Iansan\n\nI'm just genuinely tired of explaining why for what's possibly the 4th time in a row. Nice generalization of Iansan fans though. \n\nTbh I already understood your mindset from the first time around, but keep going off I guess since it looks like you still have something to prove. I'm just entertaining you at this point to see where this is going.",
                                                                    "score": 6,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "HaukevonArding",
                    "body": "Well you could say that the Pyro Traveller also is a character released without voicelines.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Molismhm",
            "body": "Omg this means we will get the banners. Prayege Xilonen Iansan on one banner thats before Xianyun 🙏🏻🙏🏻🙏🏻",
            "score": 4,
            "replies": []
        },
        {
            "author": "sumshi009",
            "body": "I WILL BE WAKING UP EARLY FOR THIS",
            "score": 1,
            "replies": []
        },
        {
            "author": "PaIamon",
            "body": "Is this going to be another Bob Impact (localizer) stream in English?",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrCovell",
            "body": "More exploration and story content let’s go!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Weary-Trade-1576",
            "body": "LORD OF SAND , YOUR LIVESTREAM IS READY!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "OctoSevenTwo",
            "body": "Not this thing airing at 8 AM when I have to be at work by 8:45. Maybe I can listen while driving there….Or I’ll just go early and hang out in, like, the playground or some shit to watch it with my earbuds in.",
            "score": 1,
            "replies": []
        },
        {
            "author": "emiya002",
            "body": "So a bit off topic, I stopped after finishing Fontaine's archon quest. Do we have any major developments to the overall plot? Also, did Eula appeared in story after the summer event last year?",
            "score": 1,
            "replies": [
                {
                    "author": "Common-Chip-4928",
                    "body": "Depending on what you mean by development, if you're talking about some new revelation of information then there wasn't much of that in natlan AQ \"yet\" but if you mean some information from books/artifact become relevant in the AQ for the first time then there were plenty of them \n\nNo",
                    "score": 1,
                    "replies": [
                        {
                            "author": "emiya002",
                            "body": "Thanks for the reply. I meant like some new major developments with deinsleif, Tsaritsa, the abyss element or the sibling, outer god( the one at the beginning of the game).",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Common-Chip-4928",
                                    "body": "Fontaine dain quest reveals big information, not much for the tsaritsa, big sibling moment in dain quest and for the unknown God, well not so much about her but there was something related to her in natlan AQ",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Cookiejule",
            "body": "Day of the Flame returns? Hmm, strange title. Will someone come back?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wa_lied",
            "body": "Finally getting the cow, getting milk this last few years now getting the factory itself",
            "score": 1,
            "replies": []
        },
        {
            "author": "InkPncl",
            "body": "For people on the east coast (united states), the special program airs tomorrow at 4am? I always get confused trying to convert utc to est",
            "score": 1,
            "replies": []
        },
        {
            "author": "RosesWithParfum",
            "body": "A very poor patch again.. whatever",
            "score": 1,
            "replies": []
        },
        {
            "author": "OkRelationship772",
            "body": "A bit out of the loop here... Have we always known Varesa is 5* and iansan 4*? Could have sworn it was the opposite",
            "score": 1,
            "replies": []
        },
        {
            "author": "Excellent_Excuse1954",
            "body": "Iansan still has no voice or what 😞",
            "score": 1,
            "replies": [
                {
                    "author": "BobTheGodx",
                    "body": "No voice or new VA",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "hraberuka",
            "body": "Let's go, can't wait\n\nVaresa looks super cute, we should get the epic vulcanic area, new world quests etc so cool",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok_Coconut6731",
            "body": "Why Mizuki is there?",
            "score": 0,
            "replies": [
                {
                    "author": "Budget_stawbeery",
                    "body": "Iansan still mute ",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Ok_Coconut6731",
                            "body": "Sadge",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Dry-Leading2816",
            "body": "Im sick of her already 😩",
            "score": -21,
            "replies": []
        },
        {
            "author": "Vvvv1rgo",
            "body": "They didn't even put Iansan in the poster... only her skull. FUCK YOU HOYO!!! I'm so sad.",
            "score": -1,
            "replies": []
        },
        {
            "author": "No_Dust_1630",
            "body": "So Mizuki is here (again) but Iansan is absent. She's truly the forgotten child of Natlan 😭",
            "score": -4,
            "replies": [
                {
                    "author": "V_Melain",
                    "body": "on every other language she will be on the livestream",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "NirnrootEnjoyer",
            "body": "Iansan shafted again ",
            "score": -5,
            "replies": [
                {
                    "author": "GasFun4083",
                    "body": "She's on every other language, this is probably just another VA issue",
                    "score": 18,
                    "replies": [
                        {
                            "author": "NirnrootEnjoyer",
                            "body": "Yeah I know. that's what I meant another patch of mute Iansan confirmed",
                            "score": -3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "chaoscauser",
            "body": "Please be better than 5.4 one of the worst patches we have had",
            "score": -2,
            "replies": []
        },
        {
            "author": "Jaytotallymyrealname",
            "body": "jumpscare",
            "score": -1,
            "replies": []
        },
        {
            "author": "Cicchio51",
            "body": "They can announce the cow and turn off the livestream honestly",
            "score": -4,
            "replies": []
        },
        {
            "author": "ikkekun",
            "body": "no dev livestream???",
            "score": -3,
            "replies": [
                {
                    "author": "AlphaLovee",
                    "body": "?",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Antique-Substance-94",
            "body": "Why the hell mizuki is here , does anyone have any idea?",
            "score": -14,
            "replies": [
                {
                    "author": "Platinum_6156",
                    "body": "Other languages have Iansan but since she's potentially not voiced in English still they're using Mizuki most likely.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "Cannabis_With_Emilie",
                    "body": "Because Iansan is still muted in EN? The other languages all have Iansan.",
                    "score": 6,
                    "replies": []
                }
            ]
        }
    ]
}