{
    "title": "Genshin Impact Version 5.5 Livestream Summary",
    "author": "intrinsicepiphany",
    "subreddit": "Genshin_Impact_Leaks",
    "rank": 8,
    "score": 1886,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 286,
    "url": "https://www.reddit.com/gallery/1jb3pxu",
    "id": "1jb3pxu",
    "selftext": "",
    "comments": [
        {
            "author": "intrinsicepiphany",
            "body": "Extra Notes:\n\n1. New TCG Cards\n2. New Area Limited Time Explorations Rewards\n3. IFA!!! (no way, bro!)\n4. New Saurian - Tatankasaurus\n5. Envisaged Echoes for Dehya & Venti\n6. Natlan OSTs added to rhythm game (in case it wasn't clear in the pic!)\n7. Seagate Cyno-Themed Limited Edition External SSD (whaaat???)",
            "score": 399,
            "replies": [
                {
                    "author": "intrinsicepiphany",
                    "body": "LIVESTREAM CODES:  \n1. GI55Teteocan  \n2. GoGoVaresa0326  \n3. CoachIansan0326",
                    "score": 201,
                    "replies": [
                        {
                            "author": "nuts_extraction",
                            "body": "I guess they stopped banging their head on the keyboard to generate codes huh",
                            "score": 332,
                            "replies": []
                        },
                        {
                            "author": "Budget_stawbeery",
                            "body": "They stopped smashing Thier heads on keyboard? Nice ",
                            "score": 36,
                            "replies": []
                        },
                        {
                            "author": "Dry-Leading2816",
                            "body": "What does GI55 means? We know 0326 is the release date.",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "IndicationOk8616",
                                    "body": "GI: Genshin Impact  \n55: 5.5 update",
                                    "score": 126,
                                    "replies": []
                                },
                                {
                                    "author": "UseSwimming8928",
                                    "body": "55 is the new pity obv",
                                    "score": 51,
                                    "replies": []
                                },
                                {
                                    "author": "Charesque",
                                    "body": "Version 5.5 😭",
                                    "score": 38,
                                    "replies": []
                                },
                                {
                                    "author": "D5Gmp",
                                    "body": "GI 5.5, I thought It was pretty clear",
                                    "score": 28,
                                    "replies": []
                                },
                                {
                                    "author": "Commercial-Candle-19",
                                    "body": "Version 5.5",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "fazb3arsfright",
                                    "body": "version 5.5",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "I_May_Fall",
                                    "body": "Version 5.5?",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "Yur1n4M00n",
                                    "body": "Genshin Impact 5.5 I guess",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "Winston7776",
                                    "body": "55 is how many pulls are in this patch\n\n>!/j!<",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Queasy_Signature6290",
                            "body": "Is the Varesa code a power Rangers reference?",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Aschverizen",
                    "body": "Lol what, a Cyno themed SSD is way out of the left field, if it was someone like Nahida it could probably work, at least they chose an Electro character which is probably the 2nd best theme for such a thing.",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "Ruu94",
                    "body": "Damn, I hate the limited exploration rewards... I wish they would put those 400 primos back on the map in chests.",
                    "score": 131,
                    "replies": [
                        {
                            "author": "RugaAG",
                            "body": "Those 400 would be distributed across other limited time stuff sadly.\n\nTheir not meant to be added to the permanent pool",
                            "score": 41,
                            "replies": []
                        },
                        {
                            "author": "PH_007",
                            "body": "Giving you the upvote before you're flooded with \"no but those primos are free on top of regular rewards Hoyo is just that generous!\" like they don't have a fixed primo budget per version cycle that simply gets shifted around (into worse places in the case of limited time ones) lol",
                            "score": 70,
                            "replies": [
                                {
                                    "author": "Classic-Pickle1826",
                                    "body": "The way I got downvoted each time when I brought how shitty making exploration /the chill part of the game/ FOMO like the rest of the content was disheartening. Like guys ok these are freemogems but perhaps yall can understand I dont wanna feel pressured to play a game I enjoy just bc it seems good on paper.",
                                    "score": 72,
                                    "replies": [
                                        {
                                            "author": "Knux911",
                                            "body": "Yeah I don't like to rush exploration. I can only properly play one day a week due to work and life commitments. Outside that, most of the time it's just - login to get Welkin and if I have the energy, do dailies. Usually farming is done on weekends only.\n\nI much prefer to roam the open environment and open chests with my wife in co-op. So I mostly leave chests alone for that reason. I unlock statues and waypoints for convenience, but roaming around defeating enemies and completing puzzles together brings me the most joy.\n\nWorld exploration of the environment is my favourite part of Genshin. Listening to the music and discovering gorgeous and cool places is wonderful. Delving into antediluvian ruins and finding lost treasures is both relaxing and engaging at the same time.\n\nEdit: Spelling",
                                            "score": 22,
                                            "replies": []
                                        },
                                        {
                                            "author": "Lower_Comfortable_44",
                                            "body": "You legit will only miss them if you stop doing anything related to exploration for 3 WHOLE MONTHS... (and the second patch of this duration usually doesn't even add more exploration)  \nLike lets be real here if thats the case then 99% of the time its a case of you have quit playing at that point.\n\n  \nI can also speak from my view as a person who plays 8 gacha's currently and procrastinates like no other(often last daying/missing some events) i did not miss the previous ones.",
                                            "score": 15,
                                            "replies": [
                                                {
                                                    "author": "Bazookasajizo",
                                                    "body": ">8 gachas currently\n\n\nHoly f*ck dude",
                                                    "score": 5,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "troysama",
                                                    "body": "not sure why we should be penalized for not exploring most of a region in three months",
                                                    "score": 24,
                                                    "replies": [
                                                        {
                                                            "author": "whataremyxomycetes",
                                                            "body": "Damn did hoyo break into your house break your kneecaps delete your artifacts and weapons use your wishes for standard banner for not exploring the region in 3 months? You're not being punished, you're just not being rewarded. You are literally saying why am I not being rewarded for not playing the game.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Classic-Pickle1826",
                                                    "body": "3months can go very quickly if your life isn't completely surrounded by genshin and only genshin. Personally I just like doing stuff at my own pace and simply knowing I have a deadline on something I wanna do to relief the pressure of IRL stuff is just shitty.\nIdc if I have enough time I just dont wanna have something at my back tellin me to \"hurry up!\" for that kind of stuff. It just leaves a bad aftertaste. I guess from your heavy gacha background, being so used to be surrounded by FOMO tactics you dont give a shit ti that kind if stuff anymore.",
                                                    "score": 32,
                                                    "replies": [
                                                        {
                                                            "author": "Noxianratz",
                                                            "body": "If 3 months for a bit of exploring is too little time do you just do none of the limited time events that are only like 1-2 weeks? There are tons of rewards in any gacha that are limited time and Genshin has always been like that, the month long exploration perks are probably some of the most lenient. Especially if you're caught up or close to it on content.",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "Classic-Pickle1826",
                                                                    "body": "If you really cared about what I read you would've noticed it's not about the time it gives you to do exploration. It's about having rewards gated behind FOMO. It makes the experience   less enjoyable.",
                                                                    "score": 11,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Noxianratz",
                                                                            "body": "I don't know if you're trolling or not understanding what I just wrote but yeah, that's the exact point I made. Do you not think all limited-rewards and limited time events, limited character banners, etc. are all FOMO? When an event lasts for 1 or 2 weeks do you not understand that's still FOMO? The game is built on it like all gachas, that hasn't changed from the first version. There are people who hate that model so they don't play and I can understand that but it seems weird to specifically hate one of the more lenient examples of it yet presumably continue to play the game.",
                                                                            "score": 4,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Classic-Pickle1826",
                                                                                    "body": "I could play genshin bc I like the exploration while not wanting this part specifically pilling up with all of the other FOMO stuff? Why should I be happy the one big thing about this game that was free of the gacha FOMO bullshit is now one more mean to make me stressed about \"finishing playing in time\" like idk how else to explain. I mean I get it its a gacha and that's the basic thing they want to do bc of how effective it is to retain players in the game but that diesnt mean that's good. Especially because I dont think we are actually getting more rewards from that to begin with.",
                                                                                    "score": 19,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Noxianratz",
                                                                                            "body": "It's just funny because this is basically like spending your time in a casino then complaining about the predatory nature of having a complimentary raffle ticket as you exit. FOMO is pretty scummy but it's optional for you. You don't have to care. Either the primos matter to you and you were on top of all the other events anyway that they'd hypothetically be taking this cut from, in which case honestly not a big deal at all. Or you skip most events because you can't be bothered to keep up with the time limits and this is actually more ideal because it's way more lenient. Even if you don't if you're already not completing most of the events and just playing casually you're still just skipping primos same as always. The only ones I see this hurting are those who play consistently but don't like to explore or who like to leave it and do it all at once. \n\nSo yes it's not good but that doesn't just apply to this specific case, that's literally everything the game is built on. If you can't accept that it seems healthier to move on because the 3 month limit is probably one of the most reward friendly things Genshin is ever going to offer.",
                                                                                            "score": 5,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "Classic-Pickle1826",
                                                                                                    "body": "Well idk maybe it is funny and weird but I kinda want my gambling machine to keep some sort of quality, no matter how little there was to begin with. 😭 (Not that I believe genshin is hopeless, far from it, otherwise i would not play it, but yknow to get the idea) like at least keep the illusion it's fine or something lol idk man. It's not like I'm losing my mind over that since it could seems like it bc we're arguing about it for some time now, but yeah it just makes my experience less fun overall.",
                                                                                                    "score": 5,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "RuneKatashima",
                                                                                    "body": "They're saying exploration FOMO is not equivalent to event FOMO because exploration was meant to be the chill permanent content of the game. Turning it in to FOMO sours the experience.",
                                                                                    "score": 9,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Noxianratz",
                                                                                            "body": "I already answered this somewhere else but the only thing you're missing, at least for now, are primogems. Either you already play enough with the events that you're consistent enough and it doesn't matter, I'm in that category at least. Or you don't play very often and you probably weren't getting all limited primos to begin with, in which case just also ignore this too. The only people I'd understand being upset is the small subset who waits for all the region or most of it to be available to explore at once but still plays often enough to keep up with the events. \n\nBasically if you wanna play chill, primos being up for grabs as an incentive isn't a big deal and having more than one patch to do it is really lenient. I'd understand if it was a limited weapon or something but it's like two and a half pulls.",
                                                                                            "score": 2,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "Jairo234",
                                                                            "body": "> It makes the experience less enjoyable.\n\nDoes it? The good part is always the gameplay. If you want the extra gems you can surely carve the time in the months you both mentioned, otherwise you can skip. There's a plethora of much more strict fomo nonsense in the game, like events, namely, or dailies.\n\n> Idc if I have enough time I just dont wanna have something at my back tellin me to \"hurry up!\"\n\nSure, but at that point, wouldn't it be more sensible to just quit gachas, since, we all know too well their entire modus operandi is fomo? Like, even if they made this permanent you would still be following the other 10 layers of \"hurry up, we tell you how and when you NEED to play\".",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "RuneKatashima",
                                                                                    "body": "> Like, even if they made this permanent you would still be following the other 10 layers of \"hurry up\n\ntbf exploration takes a lot longer than events do. Several hours vs maybe an hour. You can't really last minute it like you can events.",
                                                                                    "score": 6,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "author": "Classic-Pickle1826",
                                                                                    "body": "Is the game being a gacha an excuse for the rare good part to start being lame..?\n\n>you can surely carve the time in the months you both mentioned\n\nWhy yes I can but that doesn't mean it makes for a good experience. Even if I dont respect the deadline bc \"idc I do my own thing\" the simple fact it exist makes the whole gameplay sour. It's like any hobby that you put deadlines on, it becomes more of a chore to do, even if you actually dont respect the time limit. I mean I'd like to get the less FOMO as possible in the game I play, gacha included, even if their whole marketing stitch is about that unfortunately.",
                                                                                    "score": 6,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Lower_Comfortable_44",
                                                            "body": "No it does not really cause to get them your life does not need to be \"completely surrounded by genshin and only genshin\" in the first place.  \nAnd yes in an ideal world nothing would be fomo but that is not where we live, so can't help you there.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Charly52",
                                                    "body": "I return to Genshin after a year of not touching it back in 5.0. I haven't unlocked the last expansion of sumeru and all of Fontaine. I wanted to complete the content in a cronological order, and that means that I lost a whole 10 pull in limited time rewards. \n\nIt's FOMO, and it sucks. It doesn't have to be limited-time.",
                                                    "score": 21,
                                                    "replies": [
                                                        {
                                                            "author": "Lower_Comfortable_44",
                                                            "body": "Like i would want it not to be but at the same time i'm also being realistic to how gachas are and have been.",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "RuneKatashima",
                                                    "body": "> who plays 8 gacha's currently\n\nDog, I can barely handle 2. I haven't been doing any ZZZ comms or Genshin 'sploration. I've been getting my events and endgame content done in the last 2-3 days every time.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "author": "Lower_Comfortable_44",
                                                            "body": "did you see the rest of what i said about that? I have missed events and most of the time do them last day or 2 as well, but can still do them cause how they are.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "author": "LemmeDaisukete",
                                                                    "body": "I last minuted events in an hour tops. Exploration however, take me days mainly because I enjoyed the experience and don't wanna rush them with interactive maps. That being said I do have a day job to commit to and a family AFTER that day job. Not every weekend do I get to actually play genshin wholeheartedly, sometimes not every 3 months even. So yeah rushing players to finish those exploration within 3 months when it's literally a permanent content (that I can do over a couple years) is a bit of an asshole move. And for every patch they gave us exploration FOMO events, the normal limited time events are more scarce/gives less primogems. Because those FOMO exploration primogems counts into the primogems per patch count. Effectively, yes. Permanent exploration enjoyer DOES GET LESS primos as a result of these FOMO exploration patch.",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Lower_Comfortable_44",
                                                                            "body": "I do not touch interactive map myself either. Still got to it and did the last one in 2 days (the main world quest it self gives a lot to it) with like only surface level done before that a bit after patch launch.  \nAlso if you want to be efficient with your pull currency and enjoy stuff slowly then most gachas don't really give that luxury.\n\nLastly i would wish these were permanent too but i also know that what i think does not matter on this front sadly.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Anaurus",
                                    "body": "We'll have to compare the total primos of version 5.x with previous versions to be really sure, but I'm not very optimistic...",
                                    "score": 3,
                                    "replies": []
                                },
                                {
                                    "author": "GingsWife",
                                    "body": "While I agree that the time limitation is becoming a bit cumbersome, they've also increased their primogem budget _slightly_",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Ruu94",
                                    "body": "Lol, thanks for the upvote! Yes, exactly as you say.",
                                    "score": -3,
                                    "replies": []
                                },
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "Lopsided-Insurance26",
                                            "body": "I mean it’s 300 primos which sounds like a lot but it isn’t even 2 wishes",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "ChristianEmboar",
                                                    "body": "That's what I say, they're so stingy lmao.",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "nanausausa",
                            "body": "Same, exploration's my favorite aspect of the game and I hate they introduced fomo to it. It just sours the whole experience, which is why I barely touched the first Natlan expansion at first and waited until they expired. I really really hope this is a Natlan-exclusive thing.",
                            "score": 14,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "BloodAngelsAreCool",
            "body": "Double the artifacts, double the pain.",
            "score": 268,
            "replies": [
                {
                    "author": "LeAstra",
                    "body": "“My artefact drops have doubled since the last we met, Count”\n\n“Good. Twice the pride, double the Def”",
                    "score": 136,
                    "replies": []
                },
                {
                    "author": "Aerie122",
                    "body": "Atleast it's much faster\n\nI like quick suffering that slow",
                    "score": 46,
                    "replies": [
                        {
                            "author": "LunarSDX",
                            "body": "200resin perday. \n\n20 x 3 = 60resin for double runs; 140resin remaining; 3 domain runs  \n40 x 3 = 120resin for condensed runs; 20resin remaining; 3 domain runs  \n20 x 1 = 20resin for regular runs; 0resin remaining; 1 domain run  \n\n\nthats 7 domain runs compared to the usual 5. you get more suffering over a longer period of time.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Peudan",
                                    "body": "you dont get 200 resin per day. its 180.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "LunarSDX",
                                            "body": "Mb. Point still stands. 6 domain runs and more artifact suffering",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "HitMeWithAraAra",
            "body": "no new artifacts to be added to strongbox, fireflynews leaker L",
            "score": 127,
            "replies": []
        },
        {
            "author": "J_witt",
            "body": "No mention of whimsy in strongbox, it's over.",
            "score": 255,
            "replies": [
                {
                    "author": "jyusatsu",
                    "body": "Sadge really want whimsy in strongbox already coz all the good pieces I got are for Reverie and I already got godly Reverie set for my Emilie with so much pieces to spare.",
                    "score": 74,
                    "replies": [
                        {
                            "author": "Aschverizen",
                            "body": "Oh god yes, I gaved up on farming that domain since I already gave Emilie a decent set but still don't have a good Whimsy for Arlechinno and Clorinde. I had to make do with Gladiator set for Arle and TF for Clorinde but I'm trying to transition into an Overload team for Clorinde so I want to at least get a decent Crit set that can be shared with Arlechinno and just change the goblet as an off piece.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "jyusatsu",
                                    "body": "Same same with my Arle on Glad and Clorinde on TF set. I'm trying to transition my Arle to Whimsy but getting unlucky with my last piece. Going to craft on set Whimsy Pyro goblet next patch and the set should be decent. Not planning to farm another set for Clorinde coz I'm satisfied with what she have and borrowing gears is inconvenient for me.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "NightmareVoids",
                            "body": "Worst part is how Deepwood is now BiS for Emilie",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "murmandamos",
                                    "body": "Lowkey probably to sell c2 bundle since they both shred at C2 you're already at 60 shred the marginal gain from deepwood after that probably isn't worth since you'll already be below 0% so deepwood starts at half value.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "jyusatsu",
                                    "body": "How so? Deepwood was her first set until I switched to Reverie and there's a decent difference in damage in favor to Reverie.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "NightmareVoids",
                                            "body": "Now that PMC, Mav or Iansan will be holding scroll, Kinich needs a deepwood user of the team. The hit in Emilies dmg is easily made up by Kinich having a deepwood user on the team",
                                            "score": 14,
                                            "replies": [
                                                {
                                                    "author": "kwondissimo",
                                                    "body": "Reject deepwood Emilie. [Embrace deepwood Mavuika](https://youtu.be/u2nNa1E2qxc?si=EPT5AbmH7vcUNMz_&t=1260). LOL",
                                                    "score": 14,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "jyusatsu",
                                                    "body": "Kinich team I see. Well I don't have Kinich and Mav but I see Deepwood is best for support Emilie for him. I mainly team Emilie for damage with Lyney, Ganyu and now with Wrio and my Deepwood holder is either Dehya or Thoma.",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "CharmingChance8230",
                    "body": "ikrrr",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "VoxImperii",
                    "body": "Was pretty much the only thing to look forward to for the rest of 5.x for me\n\nI’m back to not caring about the game til Natlan is done with",
                    "score": -20,
                    "replies": [
                        {
                            "author": "whynot1260",
                            "body": "I mean, you can also just... farm Whismy until the end of 5.x and you'll probably get good pieces...",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "Frexys",
                                    "body": "In fairness whimsy is a massive pain to farm, but that is true",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "author": "Frores",
                                            "body": "that domain is so fucking ass lol, those 2 dumbasses running around, not hard it just needs enough \"brain juice\" for me to get annoyed at it",
                                            "score": 9,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "VoxImperii",
                                    "body": "Done that since it came out, almost a year now, not anywhere close to done (so doubt about it working out til 6.0)",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "kwondissimo",
                                            "body": "Dang that's crazy long time.  Are you exclusively farming Whimsy or other things as well? Also mind if I ask what your Whimsy builds are like?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "VoxImperii",
                                                    "body": "Whimsy only/solely. Build is 90/200, weapon crit included.\n\nGot some good pieces very early on, then a sands 8 months in, and nothing since. Plenty of room to improve, plenty of wasted stats.\n\nArtifacts are absolutely garbage of a system, putting it into the strongbox is the least they could have done. Well, it’ll hit them on the pocket as the competition heats up and improves while they stagnate and create nonsense like Natlan was (character-wise I mean, it’s all modern immersion breaking bullshit).",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Anaurus",
                            "body": "I know what you mean, my hype is at an all-time low with Natlan, it's crazy, I hope Skirk will motivate me again.",
                            "score": -5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "CallMe___",
            "body": "Anyone knows what the treasure compass upgrade is?",
            "score": 80,
            "replies": [
                {
                    "author": "Retsukohl",
                    "body": "It detects the new kind of monetoo",
                    "score": 84,
                    "replies": [
                        {
                            "author": "opeyemiii",
                            "body": "among other things apparently.",
                            "score": 45,
                            "replies": [
                                {
                                    "author": "Sofystrela",
                                    "body": "Can we finally detect some puzzles like the Anemo Slimes circling trees or one-time kill monsters? Or even those Mora thingys, that would be amazing!",
                                    "score": 59,
                                    "replies": [
                                        {
                                            "author": "leche2007",
                                            "body": "Or the stupid Aranaras in Sumeru...",
                                            "score": 29,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "CallMe___",
                            "body": "Thats not already included? I was really hoping for all chest detection.",
                            "score": 28,
                            "replies": [
                                {
                                    "author": "Retsukohl",
                                    "body": "At least that's all they talked about in the livestream",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "RuneKatashima",
                                            "body": "They literally said the new Monetoos as an addition. Like, \"and the new Monetoos\".",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "SecretBusy8603",
                    "body": "They said, \"treasure compass will now be able to detect more treasure locations **including** new kind of monetoo\". We really hope they have included puzzles that spawn chests as well, patch details when the update arrives will give clear details.",
                    "score": 31,
                    "replies": []
                },
                {
                    "author": "Saiyeh",
                    "body": "Still waiting for the treasure compas to work in Dragonspine. Idk why they continue to keep it locked when no other region got the same treatment. It's going to be 5.5 let me find the last ones I missed. ",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "16tdean",
            "body": "New map looks incredible. \n\nIm so confused on what the rest of 5.X looks like, becuase we have another Natlan character to release, someone probably from Mondstat, Skirk, a summer event, some people think NodKrai might come before 6.0, probably will still get a Dainselif quest. \n\nMaybe the Dain quest has us going back to Mondstat for some reason? Maybe that would work? \n\nI have no idea what is coming in the next beta.",
            "score": 181,
            "replies": [
                {
                    "author": "littlemochasheep",
                    "body": "Mare Jivari Dain quest with Enjou 🙏",
                    "score": 150,
                    "replies": [
                        {
                            "author": "Economy_Natural5928",
                            "body": "manifesting ts now, please",
                            "score": 31,
                            "replies": [
                                {
                                    "author": "RuneKatashima",
                                    "body": "Manifesting buddy cop comedy with Enjou and Dain 🙏",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "Economy_Natural5928",
                                            "body": "Dain acting hella serious and ominous while Enjou is on some BS with his chaotic energy, please",
                                            "score": 6,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "AkibaSasaki",
                            "body": "please I've been robbed of an Enkanomiya WQ with Dain already....",
                            "score": 20,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "rotten_riot",
                    "body": "My guess is:\n\n* 5.6: Effie (5★), Dahlia/Ifa (4★)\n\n* 5.7: Skirk (5★)\n\n* 5.8: Dahlia/Ifa (4★)\n\nI don't know which one would stand out the less in the 5.6 event between Dahlia and Ifa. It depends where it is",
                    "score": 22,
                    "replies": [
                        {
                            "author": "mappingway",
                            "body": "Ifa is 113 on the character index, which indicates he'd be released in 5.6.\n\nThe one wildcard is Dahlia. I think they could hold him back to 5.8, similar to Heizou or Emilie.",
                            "score": 42,
                            "replies": []
                        },
                        {
                            "author": "Nebula707",
                            "body": "They release 17 characters per region, so 5.8 is a new character",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "rotten_riot",
                                    "body": "They could always just release 16 characters now (given how they would've added the new character's silhouette among the others) or release the new character with Ifa/Dahlia in 5.8, but I'm more inclined to the first one",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "Nebula707",
                                            "body": "When they revealed the characters, they explicitly said these characters are releasing in the next 6 months. 5.8 was 7-8  months away at the time.",
                                            "score": 19,
                                            "replies": [
                                                {
                                                    "author": "Classic-Pickle1826",
                                                    "body": "Capitano summer event chilling on golden apple archipelago copium stonks",
                                                    "score": 17,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Portokali3",
                                    "body": "17 characters per YEAR , not region - they can copy  HSR nad ZZZ  in 6.0 and double 5 stars every update.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Nebula707",
                                            "body": "Nah, it's per region. From 2.0 till 2.8, they released 17 characters, and they did the same in 3.x and 4.x.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "RuneKatashima",
                                                    "body": "> and they did the same in 3.x and 4.x.\n\nDoes the 17 include the Lantern Rite characters?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Nebula707",
                                                            "body": "Of course",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Portokali3",
                                                    "body": "2.x , 3.x and 4.x is 1 Geshin year",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "uniusva",
                                                            "body": "A version with 9 patches (so 2.x, 3.x, and 4.x) lasts 54 weeks so just over a year. In terms of calendar years both 2023 and 2024 had 15 characters while versions 3.x and 4.x each had 17, so 17 per version/region is probably the correct interpretation.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "LeToutPuissantPoulpe",
                                    "body": "Because the last one will be be Capitano\n*huffs copium*",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "mappingway",
                                            "body": "Lore-wise I think Capitano isn't going to be for a while, however I definitely think he'll eventually get released.\n\nThe Loom of Fate is explicitly a project that has the capability of recreating Teyvat's leylines. Although Caribert said that replacing them with the Loom of Fate was nigh impossible, it seems weird to me that they'd go out of their way to establish this arcane machine, which is the entire purpose of the Abyss Order and the Sibling until this point, and say very loudly \"this thing can write new leylines\" just before Natlan's storyline.\n\nThe Loom of Fate, which Traveler likely forgot about due to memory loss in 4.7, gives a fantastic opportunity to one day fix everything wrong with Natlan, and the rest of the world. (With the memory manipulation aspect, it could even be used benevolently to rewrite Natlan's leylines in such a way that they don't lose their cultural history as Mavuika was fearing.) Theoretically, any reason for Capitano to remain bound to the throne would cease once it is fully employed, because it would render what Capitano and the Lord of the Night are both doing to be obsolete.\n\nSo, my speculation is that once the Loom of Fate plotline reaches its apex, that will set the stage for Capitano's return.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "lucio_222",
                                                    "body": "nice theory! I hope you're right",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "GutierresBruno",
                    "body": "My bet is:\n\n5.6 - Fontaine event, Skirk release leading to next Dain quest\n5.7 - Dain quest, Mavuika second quest, Mare Jivare\n5.8 - Mondstad comeback, Summer event",
                    "score": 10,
                    "replies": [
                        {
                            "author": "LiDragonLo",
                            "body": "Personally hope for skirk to be released in 5.7, want more time to save",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "ChristianEmboar",
                            "body": "How anti climatic can a summer event be just before a lore shitfest lol",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "rotten_riot",
                                    "body": "Tbf the summer event always gives hints to what the next nation is about, and it's supposed to be a chill way to close a nation",
                                    "score": 29,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Exotic_Dragon_",
                    "body": "6.0 is not snezhnaya?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "chupa000",
                            "body": "We're not sure yet, basically a lot of things indicate that we would go to an independant region related to snezhnaya called nodkrai before heading to snezhnaya, but we do not know \"how big\" the region would be, so a common theory lately is that nodkrai is big enough to be the \"region of the year\" during 6.x and that snezhnaya would only release in 7.x",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "rotten_riot",
                                    "body": "They have been mentioning Doorman Port a lot recently, and with Varka now in Nodkrai I'm starting to think 6.0 will in fact be a patch focused on Nodkrai and expansions for other nations",
                                    "score": 20,
                                    "replies": []
                                },
                                {
                                    "author": "RuneKatashima",
                                    "body": "I doubt they'd ruin their travails chapter trailer for Nod-Krai.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Soluxy",
                            "body": "Next region is probably Nod Krai. Snezhnaya is going to be in 7.0, anyone who thinks otherwise is coping hard.\n\nAll I see is that they've expanded Fatui plot to two whole regions, don't know why people are complaining so hard.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "h2odragon00",
                                    "body": "I fucking hate the leakers who said that.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "RuneKatashima",
                                    "body": "> Next region is probably Nod Krai. Snezhnaya is going to be in 7.0, anyone who thinks otherwise is coping hard.\n\nI disagree. It goes against the travails trailer.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ilmanfro3010",
                                            "body": "Travail trailer only says that chapter 6 of the AQ is going to be Schneznaya. Nod Krai could be the beginning of the Schneznaya AQ (it's technically a part of Schneznaya), which in that case would be divided into two parts, one in Nod Krai and the other in main land Schneznaya in 7.x. Aside from that, they don't even need to follow the travail trailer since they probably went through many changes in the story from its release to this day",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "HouseUnlucky6674",
                                    "body": "Could you explain why you believe Snez being next is cope? That seems like a stretch of criticism. Each year is a new nation.\n\n  \nOr wait, are you just afraid of the game ending? I'm pretty sure Snezhnaya won't be the last region dude. We still have to fight the Unknown God and the Abyss so we'll likely end up going to one more region.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Portokali3",
                                    "body": "Nothing in 5.6-5.8  confirmed !!! They said the volcano is the last zone in Natlan , Mare Jivari waiters are coping here , Nod Krai is replacement of Mere Jivari , and the summer event (krai translates as region , and Simulanka was the last summer event) - Snezhnaya main land - December 2025 !",
                                    "score": -7,
                                    "replies": [
                                        {
                                            "author": "LiDragonLo",
                                            "body": "Who said the volcano is the last area? Don't we already know we can max the statue/tree next patch?",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "Soluxy",
                                            "body": "5.6 is going to be Fontaine event with new Fontaine girl along with Ifa 4-star. 5.7 is Dain patch with Skirk as she is the student of one of the sinners that he's going up against, 5.8 is going to be Summer Event with Dahlia, it's plenty obvious\n\nThere's no room for Nod Krai in 5.X",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "LiDragonLo",
                                                    "body": "Skirk in 5.7 would be a god send for me ngl. Still wanna save up as much primos as i can for her",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Nebula707",
                            "body": "Nod-krai, no the Snezhnayian main land",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "RuneKatashima",
                    "body": "> becuase we have another Natlan character to release, someone probably from Mondstat\n\nlate patches usually release a 4* character from the previous version's region.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Megingjord2",
                    "body": "I really doubt we will get Summer event with map. Last one seems to me like a farewell.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Unusual-Address5799",
            "body": "No strongbox?? So leakers scam again?",
            "score": 67,
            "replies": [
                {
                    "author": "NFN-2",
                    "body": "We literally got images of strongboxes from the beta. Idk what happened",
                    "score": 34,
                    "replies": [
                        {
                            "author": "The_OG_upgoat",
                            "body": "Might show up unannounced, they sometimes throw in pretty big changes that don't get mentioned in the livestreams.",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "VoxImperii",
                            "body": "Nope, didn’t actually. The leak only contained images of the sets on blank white backgrounds, was posted here.\n\nAnd another thing, the way the shadows of the sets were Photoshopped on was fake, wrong shadow direction/opacity etc.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "NFN-2",
                                    "body": "You mean these images, right? If so, I wonder who would even need to create this kind of fake...\n\nhttps://imgur.com/a/QYY16Zi",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "VoxImperii",
                                            "body": "Yeah, those. Leakers wanting attention, I guess. You can tell it’s fake by the fact that the shadows are done wrong (not like the actual in-game ones) - and ofc, there was unfortunately no mention of these sets in the stream either.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "greennyellowmello",
                    "body": "99% of leakers are guessers",
                    "score": 36,
                    "replies": [
                        {
                            "author": "laharre",
                            "body": "There were beta files for this one, so definitely not a guess. ",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "CharmingChance8230",
            "body": "AHEM WHERES THE STRONGBOX????? EXCUSE ME I AM WAITING FOR WHIMSY",
            "score": 165,
            "replies": [
                {
                    "author": "Antares428",
                    "body": "Yeah, either EN team messed up, or there is no Whimsy.",
                    "score": 51,
                    "replies": []
                },
                {
                    "author": "Monikabestgrill",
                    "body": "*Imbues your sword with* \"Whimsy\".",
                    "score": 22,
                    "replies": []
                },
                {
                    "author": "BassonBoy",
                    "body": "You made me realize they never mentioned that... \n\nI've been looking forward to that all of 5.4... \n\nThis is such a betrayal to all Arlecchino and Clorinde mains ಥ⁠‿⁠ಥ",
                    "score": 49,
                    "replies": [
                        {
                            "author": "LeAstra",
                            "body": "Salt\n\nAnd betrayal",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "VoxImperii",
                            "body": "Same, was the only thing to look forward to in the rest of Natlan for me",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Aerie122",
                    "body": "Was there a leak about it or I got mandela effect",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Peudan",
                            "body": "[ yes... we did get one.. sadge..](https://www.reddit.com/r/Genshin_Impact_Leaks/comments/1inokp5/remaining_4x_artifacts_are_getting_added_to/)",
                            "score": 15,
                            "replies": [
                                {
                                    "author": "Prior_Supermarket265",
                                    "body": "Lmao \"reliable\"",
                                    "score": 17,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "greennyellowmello",
                            "body": "A guess, we got a guess",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Flauschvieh",
                    "body": "Yeah pls the Domain is so ass to farm",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fabulous-Problem-153",
            "body": "What are the upgrades to the treasure compass?",
            "score": 38,
            "replies": [
                {
                    "author": "intrinsicepiphany",
                    "body": "It can detect more kinds of puzzles/treasures now. But iirc the livestream said monetoos.",
                    "score": 39,
                    "replies": []
                },
                {
                    "author": "SecretBusy8603",
                    "body": "They said, \"treasure compass will now be able to detect more treasure locations **including** new kind of monetoo\". We really hope they have included puzzles that spawn chests as well, patch details when the update arrives will give clear details.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Petter1789",
                    "body": "Just making them able to detect more types of treasures",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "whatahottake",
            "body": "IFA WAS FINALLY SHOWN OH MY GOD THE WAIT IS ALMOST OVER 🙏",
            "score": 40,
            "replies": []
        },
        {
            "author": "SKrad777",
            "body": "So much for all that lunar eclipse coinciding with 5.5 livestream, Yet we got nothing at the end.",
            "score": 47,
            "replies": []
        },
        {
            "author": "vampzireael",
            "body": "Why did I read as Janet Jackson😭😭😭",
            "score": 46,
            "replies": [
                {
                    "author": "GutierresBruno",
                    "body": "Ikr me too 😭",
                    "score": 10,
                    "replies": [
                        {
                            "author": "vampzireael",
                            "body": "😫😫",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Platinum_6156",
            "body": "It was leaked that the remaining Fontaine artifacts would be added to the strongbox. Is that just not happening anymore or something? I haven't heard anything about it but if that's the case I guess I'll have to get started in farming whimsy. At least the artifact event will help me get started hopefully.",
            "score": 57,
            "replies": [
                {
                    "author": "Antares428",
                    "body": "Hoyo is just laughing at people who pulled for outdated rerun unit during rerun banner in 5.3.",
                    "score": -89,
                    "replies": [
                        {
                            "author": "Platinum_6156",
                            "body": "Mate, who cares about that shit lmfao. Not all of us are meta slaves that only care about who does the most damage. Some of us like other characters and saying that Arlecchino/Clorinde are outdated is wild. \n\nI literally could not care less about spiral abyss. Meta and who is good means absolutely nothing to me.",
                            "score": 77,
                            "replies": [
                                {
                                    "author": "16tdean",
                                    "body": "If Arlechino and Clorinde are outdated whats Ganyu? cause I just pulled her on the chronicled wish.",
                                    "score": 43,
                                    "replies": []
                                },
                                {
                                    "author": "Samm_484",
                                    "body": "If you are not a \"meta slave\" just use glad lmao",
                                    "score": -39,
                                    "replies": [
                                        {
                                            "author": "cryarion",
                                            "body": "bro does not know what “meta slave” means",
                                            "score": 28,
                                            "replies": []
                                        },
                                        {
                                            "author": "Swimming_Summer_7182",
                                            "body": "I mean they're already pulling for an \"outdated\" character according to op, someone which they like so wouldn't it be better to put them on their bis set atleast so they don't do shit all dmg and also they're pulling for them cause they like them most probably so it'd make sense to farm their bis set to show their dedication.",
                                            "score": 16,
                                            "replies": []
                                        },
                                        {
                                            "author": "Cleansing4ThineEyes",
                                            "body": "Meta slave means all you do is run optimal teams. The majority of players run who they want and then optimize that to a reasonable degree. It's definitely reasonable to want the BiS for your favourite character",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Il-savitr",
                            "body": "That's me ig. Opened the game after a year and used all my primos in that banner and now I have 3 characters with shitty as builds",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "CandyGhost76",
            "body": "it's official  \nno natlan fishing weapon =(",
            "score": 83,
            "replies": [
                {
                    "author": "Antares428",
                    "body": "Cannot give any F2P options, right? Poor indie company would bankrupt if they would do so.",
                    "score": 65,
                    "replies": [
                        {
                            "author": "CandyGhost76",
                            "body": "gotta get dawei another yacht",
                            "score": 21,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ChristianEmboar",
                    "body": "Bomb that fucking gamemode and forget it even exists ffs",
                    "score": -36,
                    "replies": [
                        {
                            "author": "LiamMorg",
                            "body": "I guess we're advocating against farmable f2p weapons now huh.",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "ChristianEmboar",
                                    "body": "Not really, you can make it farmable without including that hideous feature. You guys don't have enough of fishing even after this current event featuring how shit it feels (event if it's not the same), don't you?",
                                    "score": -4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "CandyGhost76",
                            "body": "go kick rocks you absolute rando",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "ChristianEmboar",
                                    "body": "Because of people like you the downfall of this game is closer than it should 😭😭😭",
                                    "score": -38,
                                    "replies": [
                                        {
                                            "author": "Frores",
                                            "body": ":(",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ririniniyoo",
            "body": "im happy about double the artifacts cause that means more artifact exp. I'll need to remember not to condense resin tho",
            "score": 30,
            "replies": [
                {
                    "author": "Annual_Molasses6735",
                    "body": "Especially when you tries to up a single substat for support xd",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "LoverOfCircumstances",
                    "body": "Too bad it's limited to 3 extra runs per day ,it would've been cool to blast my reserved resin with x2 bonus- could've seen something other than defense and one crit sub artifacts. ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AdventurousWrath4105",
            "body": "Omg IFA",
            "score": 11,
            "replies": []
        },
        {
            "author": "whankeybby",
            "body": "ifa? close enough, welcome back mammon",
            "score": 35,
            "replies": []
        },
        {
            "author": "wobster109",
            "body": "Natlan songs in the music mode let’s go! 🎶🎵🎶🎵",
            "score": 10,
            "replies": []
        },
        {
            "author": "Estudante-de-Design",
            "body": "\"The compass will be able to detect new treasure locations\". So, is it just the new special seelie thing or does it finally include hidden puzzles, buried chests, etc? The vagueness doesn't really make me think it's the latter, otherwise they'd just have straight up stated it.\n\nAlso, nothing about the web event? I was hoping they'd say something about it in the stream (even if only explaining the dates when the event will update). Guess it'll have its own separate announcements then.",
            "score": 10,
            "replies": [
                {
                    "author": "dr0ps0fv3nus",
                    "body": "Yeah, the lack of any mention of the web event was by far the most disappointing thing about this livestream for me. The community was some of the most excited it has ever been following the web event, and they didn’t take advantage of that at all during a livestream that took place on the same day of a Blood Moon Eclipse! I almost wish they had done the web event next week if nothing was supposed to be announced this Friday; it just created a lot of expectation.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Crimson-Dust",
            "body": "and still no over flowing resin",
            "score": 10,
            "replies": []
        },
        {
            "author": "Schmedricks_27",
            "body": "Woke up to Ifa anemo bomb.\n\nHoping he's good for Wanderer or can swirl enough Pyro for burning and somehow adds a new Anemo+Dendro reaction lol",
            "score": 13,
            "replies": []
        },
        {
            "author": "TatsuyaST",
            "body": "Where moon sisters? where strongbox?",
            "score": 6,
            "replies": []
        },
        {
            "author": "c0nqu3ror",
            "body": "I found this stream really fun! Excited for Xianyun rerun so I can finally run plunge dps Shenhe",
            "score": 25,
            "replies": []
        },
        {
            "author": "Present-Split4502",
            "body": "The double artifact event.. is that also applicable to the new domain? The picture has older artifacts and the description also makes it sound like it’s old artifacts only?",
            "score": 13,
            "replies": [
                {
                    "author": "intrinsicepiphany",
                    "body": "Yep it is. You have 3 chances each day to claim double drops from any existing domain for the duration of the event.",
                    "score": 20,
                    "replies": []
                }
            ]
        },
        {
            "author": "Cosimov",
            "body": "I'm excited for the new map, but idk about these events...\n\nWell, other than double artifacts.",
            "score": 11,
            "replies": []
        },
        {
            "author": "markcan_killua",
            "body": "finally stacked patch the new area looks insane",
            "score": 22,
            "replies": [
                {
                    "author": "ChristianEmboar",
                    "body": "Thought the same until I looked at the estimated amount of rewards, until then I thought it was stacked too",
                    "score": -14,
                    "replies": [
                        {
                            "author": "Stefffe28",
                            "body": "How much is it?",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Individual-Peach-467",
            "body": "Man, Varesa is just not it for me.",
            "score": 32,
            "replies": []
        },
        {
            "author": "burningparadiseduck",
            "body": "At least, they're giving us events.... unlike star rail 🗿",
            "score": 42,
            "replies": [
                {
                    "author": "Ultradamo2306",
                    "body": "Wait what !?\n\nI had a break from the game site the new region drop.\n\nDo they not do events anymore?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "ChristianEmboar",
                            "body": "2 events per patch, next one is anniversary and they barely have events that can be done in 30 min (even the flagship event wtf) and the damn monopoly we had last year in Anni too.\n\nMight have something to do with a lot of players having their brains cooked with so much Gacha overload they just want hsr as their side game, or even leakers publicly advocating for them to keep doing this shit.\n\nAs a hsr player, you can prob play once a week and get everything done without losing anything but dailies, and it's not even if tryharding the game has a reward when you get powercrept every other patch.",
                            "score": 26,
                            "replies": [
                                {
                                    "author": "Adorable-Fortune-568",
                                    "body": "The negative of HSR is most of the rewards in end game content which Manny struggle against. A lot of powecreep and you have to spend or pull new characters to get rewards. That game will pick out your eyes if you don't know what you doing",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "ChristianEmboar",
                                            "body": "Even if you know at some point what you're doing you are still fucked lmao. \n\nThe difference between Genshin, zzz and hsr is that the first two can clear difficult content with the players skill in terms of rotations, good use of reactions, dodging, using the enemies placement, etc.\n\nWhereas in hsr, that skill expression is having you push 2 buttons on good orders with very well built chars that get behind on the meta every patch. Like people who still say not pulling for x char is a skill issue is so mentally ill to actually defend a system like this on a game that barely has nothing.",
                                            "score": 17,
                                            "replies": [
                                                {
                                                    "author": "rotten_riot",
                                                    "body": "I said something like this and got downvoted to hell lol HSR players really think \"planning your pulls and building a meta team\" is a gaming skill 💀",
                                                    "score": 18,
                                                    "replies": [
                                                        {
                                                            "author": "ChristianEmboar",
                                                            "body": "Yeah most of the HSR guys who say that are big assholes or people with an ego as big as the fucking sun, and we better don't start about that because I've my list with users from reddit on it 💀💀💀",
                                                            "score": 9,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "arionmoschetta",
                                                    "body": "Can you clear 9 stars Deadly Assault without the new shiny 5 star in ZZZ? Lmao that's a joke right? Do you even clear the theater in Genshin without a bunch of units? Guys you really need to stop being so biased about HSR. Genshin and ZZZ are not perfect either. They're all greedy in some way",
                                                    "score": -12,
                                                    "replies": [
                                                        {
                                                            "author": "Portokali3",
                                                            "body": "You should stop defending HSR ... In ZZZ if you try really hard , and if you have good disks , you can clear Deadly Assault with standard banner characters , and in Genshin IT is easy , it is just time gated like SA . HSR said fu to the veterans , and I think GI and ZZZ will follow and do the same thing to us , because of the HSR community , that allowed this to happen ...",
                                                            "score": 8,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "RuneKatashima",
                                                            "body": "> Can you clear 9 stars Deadly Assault without the new shiny 5 star in ZZZ?\n\nLast DA had two ice weak Bosses. The only eligible characters to do those are Miyabi and Ellen, as there are no other forms of ice dps. I 9 starred it which means I 3 starred with Ellen.\n\nAlso, I use Lighter as my Fire dps and always 3 star with him. He's M0 and so is my Burnice who I pair with him. Not even her sig Wengine. This isn't a meta team, just what I wanted to do.\n\nAre you sure about the stance you're taking?",
                                                            "score": 4,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "ChristianEmboar",
                                                            "body": "Ofc they all are, but hsr is way more insane and blatant about it. And at least zzz has more content to do. WAY MORE content = WAY MORE ways to get income.",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "author": "kamanami",
                                                                    "body": ">more content to do\n\noh just you wait till its 2nd year. HSR was like that too. Genshin I wasn't playing on early years.",
                                                                    "score": 0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "arionmoschetta",
                                                                    "body": "ZZZ is literally 8 months old and already had a re-release in 1.4. Of course it has more income, they need to grab you on a flop game unlike HSR that stick in the top sellers since release. And that game does not have more content than HSR AT ALL. You're delusional",
                                                                    "score": -6,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Portokali3",
                                                                            "body": "Since release really ? HSR was absolute garbage during 1.1-1.4 , they were making barely 17 mil on banner .  Genshin toxic content crators made the game popular in the west , CN community didn't care at first.",
                                                                            "score": 5,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "None",
                                                                            "body": "[deleted]",
                                                                            "score": -7,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "arionmoschetta",
                                                                                    "body": "I'm mad but you are the one bringing Kuro and WuWa to a discussion about Hoyo games lmao. You're funny",
                                                                                    "score": 0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Ascheroth",
                                                            "body": "You only need 6 out of 9 stars in Deadly Assault for all currency rewards, and that is very achievable.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "arionmoschetta",
                                                                    "body": "Just because you can do it, doesn't mean everyone can. One of the last rotations all my friends couldn't get 2 stars from that awful piece of crap red robot that was terrible to beat even with Harumasa + Qingyi. That's the opposite of \"very achieveable\" in case you don't know",
                                                                    "score": -1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "RuneKatashima",
                                                                            "body": "The red robot is indeed ass. Apparently it needs to be fought in a very specific way and Shock ironically fucks up being able to do that. it's actually bad enemy design. I, personally, will give anyone a pass for not performing top tier for that monstrosity.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "RuneKatashima",
                                    "body": "> aboguing\n\n?\n\nCan't even tell what word you were trying to use.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "ChristianEmboar",
                                            "body": "I guess one mistake makes my point invalid I see, ty ✨",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ikkekun",
                            "body": "only 2 events",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Adorable-Fortune-568",
                            "body": "Honkai star boring to play. They give you two events that last the entire patch. All the stellar jades are bank in end game content that majority can't clear. Seriously I quitting the game if 3.2 come out and I don't see any improvement",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Appropriate_Time_774",
                                    "body": "And since we are in leaks sub, lets talk about how they are literally adding in a character with an account wide passive.\n\nA global buff that will work in endgame modes just by having her in your account, not even on the team.\n\nHSR just giving me less and less reason to login with each new patch lmao.",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "arionmoschetta",
                            "body": "They do, people are just morons that wanted to play those gachas as if they were MMORPGs or some shit like that. People have jobs and HSR actually respects your time, unlike the others. Even ZZZ was terrible in that last patch. More than 3 thousand lines and 8 events. Gosh what a mess",
                            "score": -7,
                            "replies": [
                                {
                                    "author": "Ultradamo2306",
                                    "body": "I only play zzz in my breaks ( 30 min) and could everything fit in actually",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "author": "arionmoschetta",
                                            "body": "Good for you then",
                                            "score": -3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "arionmoschetta",
                    "body": "I rather have less events than that fucking yapping that Genshin has in every single event",
                    "score": -16,
                    "replies": [
                        {
                            "author": "dr0ps0fv3nus",
                            "body": "You could put the yapping of every single Genshin event from any given patch together, and it still wouldn’t be as long as the current HSR main quests.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "masternieva666",
                            "body": "lol hsr got more yapping than genshin.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "ChristianEmboar",
                                    "body": "Both have a lot of yapping, but yeah hsr has even more when you see and compare yapping with content, guy is on a delusional streak",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Portokali3",
                                            "body": "he is unhappy we get more of content in ZZZ and GI lol , probably not even playing any of them",
                                            "score": 6,
                                            "replies": []
                                        },
                                        {
                                            "author": "LiDragonLo",
                                            "body": "Tbh hsr is even worse bc its even harder to skip the yapping in that game. In genshin its easier to skip it",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "ChristianEmboar",
                                                    "body": "Yeah they make those dialogues that you can't end preemptively",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "RuneKatashima",
            "body": "Does anyone know what they mean by the treasure compass detecting more treasure locations? They mention the new Monetoos but that sounds in addition to something else.\n\nI guess I am hoping against hope more \"spawning\" chests can be found with the compass.",
            "score": 4,
            "replies": []
        },
        {
            "author": "greennyellowmello",
            "body": "No new artifact strongbox is a kick to the nards",
            "score": 8,
            "replies": []
        },
        {
            "author": "Hizenberg_223",
            "body": "so there is no new strongbox😭😭😭😭",
            "score": 3,
            "replies": []
        },
        {
            "author": "ToranjaNuclear",
            "body": "Holy shit I've been ignoring basically all leaks and official content for months now, I can't fucking believe Iansan is a 4 star lmao I was thinking to this day that I would have to get Varesa over her. They did her so dirty",
            "score": 3,
            "replies": []
        },
        {
            "author": "SwitchHitter17",
            "body": "Why does it seem like they're so against adding an artifact \"discard\" or \"trash\" function like they have in other hoyo games?  I just want to mark em as trash, never have to think about them again, and mass salvage them.  Is that too much to ask?",
            "score": 18,
            "replies": [
                {
                    "author": "earlfriend",
                    "body": "I want this feature so bad. Seems so easy to add, when they've already added other markers.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "BreadStickxz",
            "body": "DOUBLE ARTIFACT DROP IS REAL ITS NOT JUST A DREAM",
            "score": 6,
            "replies": []
        },
        {
            "author": "CommercialShow3873",
            "body": "The overflow favor event should be the 1st to come",
            "score": 3,
            "replies": [
                {
                    "author": "Peashooter2001",
                    "body": "At least they will release it in the 1st half, not in the end of the patch.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Kronman590",
            "body": "NEW RHYTHM GAME SONGS LETS GOOOOOO",
            "score": 3,
            "replies": []
        },
        {
            "author": "Pawny_99",
            "body": "Natlan is dragging. Pacing was extremely bad with this region. We’re only 5.5 but feels like we should be in the next region.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Ok-Store-8600",
            "body": "Nothing special...",
            "score": 8,
            "replies": []
        },
        {
            "author": "jaspur69",
            "body": "I wanna be a saurian",
            "score": 3,
            "replies": []
        },
        {
            "author": "Peudan",
            "body": "wheres the new strngbox :(",
            "score": 6,
            "replies": []
        },
        {
            "author": "WeePhantom777",
            "body": "Mail system is da best frfrfrfr",
            "score": 2,
            "replies": []
        },
        {
            "author": "bsh-thrasher",
            "body": "He's giving me Crocodile Dundee vibes :)",
            "score": 2,
            "replies": []
        },
        {
            "author": "ChiragMiddha",
            "body": "Varesa jp va Mao xiangling 💀💀 WHAT??!!",
            "score": 2,
            "replies": []
        },
        {
            "author": "kamirazu111",
            "body": "Never thought I'd get to see a Pecorine x Narmaya Expy in Genshin.\n\nWhat a great day to be wrong. *OKAWARIIIII!!!!!!*",
            "score": 2,
            "replies": []
        },
        {
            "author": "Legendary7559",
            "body": "Btw when do 5.6 leaks start roughly? I really wanna know if skirk works well with my emilie for burn melt",
            "score": 2,
            "replies": []
        },
        {
            "author": "Pawny_99",
            "body": "Even with two new characters and map, still not enough to make up for how bland things have been lately.",
            "score": 2,
            "replies": []
        },
        {
            "author": "itbelikethattho_",
            "body": "So according to the stream, this is the final natlan area (i think they said the words “final stop in Natlan”), so i guess no more new areas like some thought?",
            "score": 3,
            "replies": [
                {
                    "author": "Spieds",
                    "body": "They said specifically \"final stop on the tribal tour through Natlan\". Aka, last tribe. At the very least, mare jevari is still more than possible, and I think people did check that even with 5.5, you can't reach 100 Natlan exploration yet (at least I believe I saw it being said)",
                    "score": 30,
                    "replies": [
                        {
                            "author": "Portokali3",
                            "body": "Nod Krai for the extra 20 lvls acording old leaked map , it should be an island north of  Natlan",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Spieds",
                                    "body": "Would be weird though, since we already got the info that it's specifically part of Snezhnaya",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "Portokali3",
                                            "body": "Nod Krai is 100% part of Snezhnaya , but we got the artifact set in the Natlan region and they showed it as part of Natlan's road map , so my guess is Nod Krai 5.6 - 6.2 and then Snezhnaya main land during the winter.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "Spieds",
                                                    "body": "I mean, yeah, I do also think it will release before Snezhnaya, but I just don't think it's exploration is gonna count towards Natlan's exploration progress. Kinda how Dragonspine doesn't count, afaik, towards Mondstadt exploration progress",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Aggravating_Ask_9594",
                    "body": "No. Where did you hear that? We still can't Max the mural or the statue.",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ricksaw26",
            "body": "I guess I will have to wait a bit more for skirk.",
            "score": 2,
            "replies": []
        },
        {
            "author": "KayU32",
            "body": "What happened to mah girl Mizuki in second pic? 😭",
            "score": 2,
            "replies": []
        },
        {
            "author": "Chulinfather",
            "body": "I find it interesting how, lorewise, luminee just doesn’t exist",
            "score": 2,
            "replies": []
        },
        {
            "author": "Empty_Berry-kun",
            "body": "Why is Aether looking at Ifa like that? 🤔",
            "score": 2,
            "replies": [
                {
                    "author": "ErrorDS",
                    "body": "😈 only innocent reasons",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "dubrea",
            "body": "They finally made a darker skin character. Wow.",
            "score": 2,
            "replies": []
        },
        {
            "author": "AKENO_UNDER_BLADE",
            "body": "ill finally get mavuika a good double crit pyro goblet surely this patch",
            "score": 1,
            "replies": []
        },
        {
            "author": "TechFragranceFan",
            "body": "No Wind Trace? Another sad patch for me :(",
            "score": 3,
            "replies": []
        },
        {
            "author": "Joseph_LVS",
            "body": "...so xianyun for 6.6, 7.7 & 8.8 then?",
            "score": 1,
            "replies": []
        },
        {
            "author": "UnknownFromTheAshes",
            "body": "Ifa",
            "score": 1,
            "replies": []
        },
        {
            "author": "Advendra",
            "body": "What date is the update?",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 0,
            "replies": [
                {
                    "author": "Positive_Matter8829",
                    "body": "oh my",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Desperate_Exam3898",
            "body": "Will iansan and faruzen be on the same banner? If so it's cooking real noce",
            "score": 1,
            "replies": []
        },
        {
            "author": "TickTickTickeryTock",
            "body": "Oh finally, they're updating the mail system! That one was so unusable, thank you! That's a very important fix! /huge amounts of sarcasm)",
            "score": 1,
            "replies": []
        },
        {
            "author": "360withscope",
            "body": "they are making it very easy to save for skirk. veresa & ifa both skips.",
            "score": 0,
            "replies": []
        },
        {
            "author": "biggest_brainz",
            "body": "idk if it's because of their way of presentation but this livestream felt so dry even more than the previous 5.4 lol \"which had nothing\"",
            "score": -10,
            "replies": [
                {
                    "author": "ChristianEmboar",
                    "body": "I feel like there's no salvation for the at this point lol, they're starting to make even clearer what game of the main 3 (gi, hsr, zzz) they want us to play when they have that much variance.",
                    "score": -12,
                    "replies": []
                }
            ]
        },
        {
            "author": "HoshiAndy",
            "body": "ufhhhhh. Xianyun weapon banner is god awful for me. 😩😩😩\n\nLike…. I wanted c2 Xianyun but if it’s comes next I’ll just skip. Peak patrol and elegy thoughh ugh 😩😩",
            "score": 0,
            "replies": []
        },
        {
            "author": "Tsukiko_Miku",
            "body": ">!is ifa off anemo sub dps or exactly what he is? if anyone know explain me in razor language pls!<",
            "score": -5,
            "replies": [
                {
                    "author": "Petter1789",
                    "body": "We don't know what his kit is yet, so nobody knows what role he is",
                    "score": 22,
                    "replies": [
                        {
                            "author": "Portokali3",
                            "body": "my guess is sucrose with nightsoul",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Tsukiko_Miku",
                            "body": "oh thank god, i thought i missed",
                            "score": -2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Tsukiko_Miku",
            "body": ">!can someone tell me if iansan is off electro sub dps like fischl or kuki?!<",
            "score": -6,
            "replies": [
                {
                    "author": "Mombrki",
                    "body": "Electro Bennett but instead of circle impact it's Fitbit impact",
                    "score": 42,
                    "replies": [
                        {
                            "author": "Aschverizen",
                            "body": "Oh yeah how does her ATK buff work?\n\n\nLike does it scale the same way as Bennett and what's her needed stat besides ER? I only know that she needs ER since it's the one that gives her buffs.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Tsukiko_Miku",
                            "body": "so in elemental skill she isnt like fischl or kuki?",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "Yesburgers",
                                    "body": "No. after skill is used, Iansan has to attack on-field to do any electro application. No off-field. Burst also has no off-field app.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "Tsukiko_Miku",
                                            "body": "tysm!",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "AshyDragneel",
                                                    "body": "There a catch though. Unlike Bennet who want active character to stay his field, Iansan wants active character to keep moving to keep her nightsoul point up for her big atk buff otherwise active character will get Weaker buff",
                                                    "score": 4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "morion77",
                    "body": "She's like Bennett, but instead of being good only with characters that snapshot or can stay within a circle, she demands constant movement for her buff to stay up, no off-field application.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Tsukiko_Miku",
                            "body": "oh got it thanks",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Draken77777",
            "body": "No free Ororon?",
            "score": -6,
            "replies": [
                {
                    "author": "CementEater8000",
                    "body": "Yes free Ororon, they showed it in the stream",
                    "score": 7,
                    "replies": []
                }
            ]
        }
    ]
}