{
    "title": "My body is able to build muscle again",
    "author": "Capable-Fix4213",
    "subreddit": "stopdrinking",
    "rank": 397,
    "score": 12,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 10,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j2kheg/my_body_is_able_to_build_muscle_again/",
    "id": "1j2kheg",
    "selftext": "I'm into running and weight training, and have always been pretty dedicated. While I was drinking, exercise would take a back seat to my hangovers. It would be days before I felt well enough to work out again, and I just ate whatever sounded good/whatever I could keep down until I recovered, and then I'd go back to a healthy diet.\n\nI'd noticed my body composition was different from when I was younger, but I thought that was just the result of aging. It turns out alcohol was affecting my ability to build muscle/burn fat. It took me around 5 months to notice my body was building muscle again, and I'm starting to look the way I did 10 years ago. It's absolutely awesome, and I really had no idea how much alcohol was affecting me physically until I stopped. I never want to go back to the way I was before. Fitness and benders cannot coexist. ",
    "comments": [
        {
            "author": "VW_Fe2O3",
            "body": "Same for me. I'm in the gym 4 or 5 times a week and I wasn't getting any real results until I quit drinking. I'm sure it was helping offset the calories, but now I'm seeing actual physical positivity.\nMy bank account is happy too. Lol",
            "score": 5,
            "replies": [
                {
                    "author": "PhoenixApok",
                    "body": "Years ago, before I really tried to get sober completely, I started doing calorie counting. And it just doesn't really work trying to work booze into a weight loss program.\n\nA normal drinker (one or two beers a night,  3 times a week) would probably have been fine. But I usually wanted at least a 6 pack every day and that's right there over 4,000 calories a week.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "shanked5iron",
            "body": "Crazy what our body is capable of when we aren't feeding it poison! I actually managed to get in pretty decent shape even while drinking, somehow. But now? night and day difference.",
            "score": 3,
            "replies": [
                {
                    "author": "Capable-Fix4213",
                    "body": "Same here, I managed to stay in decent shape but the difference and actually making progress is amazing!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "_jais_",
            "body": "Can so relate. I was one of those people who, even while drinking 6-7 days a week would always exercise and lift weights. Honestly, I looked pretty decent for somebody who drank as much as I did, but was never healthy. In fact I used being able to work out every day as justification to myself and everybody else that I didn’t have a problem.  Although I’m only 60 days sober I’ve lost 21 pounds and energy at the gym is through the roof compared to what it was before. Still struggling with the not wanting to drink however :) \n\nGood luck!",
            "score": 3,
            "replies": [
                {
                    "author": "Capable-Fix4213",
                    "body": "Same, I thought because I was still exercising regularly and still in decent shape that I didn't have a problem. It was only after stopping that I started to see how bad my problem actually was.\n\nCongrats on 60 days! It can be a struggle at times for me too but coming here and seeing stories of people who decided to give in and and drink is a great way for me to see I'm not missing anything.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "YouSaidItButIForgot",
            "body": "I'm a climber and kept getting tendon injuries in my fingers, which sucked and took months to heal. Alcohol definitely makes recovery worse and it's one of the biggest reasons I want to stop. Good luck man, enjoy the gym gains 💪",
            "score": 2,
            "replies": []
        },
        {
            "author": "Alone-Village1452",
            "body": "Same here. Losing weight while getting stronger. Alcohol destroys your muscles and makes you fat so I guess it makes sense 😅",
            "score": 2,
            "replies": []
        },
        {
            "author": "LetTheHuman",
            "body": "This is my goal! I struggle to care about my long term health, but I do feel insecure with my body and weakness. I've been going to the gym for a week (which I can only do by cutting down on drinking, as my favorite gym time is my favorite drinking time too) and the muscle pump has been very motivating. I was sober last night so I actually feel well rested today. \n\nGonna try taking it one day at a time. I'm not drinking today! Might hit the gym later to start getting my cardiovascular conditioning back to where it was. I was coughing and panting on the floor after my second exercise last night. Luckily the gym was nearly empty cause I was a bit embarrassed.",
            "score": 2,
            "replies": [
                {
                    "author": "Capable-Fix4213",
                    "body": "Taking it one day at all time is all you can do! I'm proud of you for still hitting the gym. You'll get your conditioning back in no time.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}