{
    "title": "Marriage on the rocks. Made it a week. Already seeing mild changes?",
    "author": "LimeSpecial1726",
    "subreddit": "stopdrinking",
    "rank": 292,
    "score": 221,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 54,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j2k0wk/marriage_on_the_rocks_made_it_a_week_already/",
    "id": "1j2k0wk",
    "selftext": "I’ve always tried to stop but this time because my marriage is in the rocks. \n\nMy wife didn’t have to tell me 100 times for me to know I had a problem. \n\nFrom beers in the garage, from hiding empties only to forget where I hid them, from finding excuses to run to the store, my wife knew what the fuck I was up to. \n\nA week ago my babysitter was the one to tell me to get my shit together. She said my wife found the receipt from Publix where I bought flowers for Valentine’s Day. On the receipt was a 12 pack of beer. \n\nThat conversation with the babysitter made me realize that my wife could give two shits about flowers. She wants her husband back. She wants a good father to her kids. \n\nI have lost 7lbs in 7 days. I was present and patient with my kids this weekend. I was sober. I haven’t used eye drops in a week. I have saved well over $200 not going to the gas station to buy IPAs and scratch off tickets.\n\nSure the weight loss, clear eyes and money saved are great. But the relationship with my wife hasn’t magically changed. I know that will come with time. I have to keep focusing on myself right now. Keep my head up and focus on not drinking. My drinking problem has damaged my relationship with my wife and one week sober cannot fix the damage it has caused. \n\nLet’s hope it’s not too late to mend. \n\nDay 8 here we come.\n\nToday I will not drink.\n\n\n\n\n\n",
    "comments": [
        {
            "author": "full_bl33d",
            "body": "When i stopped drinking it did absolutely nothing to repair the damage I’ve done in my past. I was a hider as well but I wasn’t nearly as good at hiding it as I thought I was. I had similar routines to continue to drink even as I swore I was cutting back and it strained my marriage to say the least. It took more than a couple weeks of not drinking to start building back that trust and there weren’t any words I could say that meant anything, it took actions. \n\nI’ve been down that road before and I’d always go back to drinking as soon as the heat was off of me. I can see now that my drinking was really just a symptom of what was going on with me and i needed help to start changing more about me than my beverage choices. I found out I wasn’t alone and other alcoholics in recovery laid it all out for me. They gave me an outlet and provided support/ guidance. I just had to show up and stop pretending I knew it all myself. I can fully admit that I didn’t have the patience or vocabulary to have a normal conversation about it all when I was first starting but I learned. I believe talking with other sober people preserved some of our marriage because I didn’t have to bring all my alcohol shit back to the person who carried far too much already.\n\nI was able to make living amends instead of apologizing all the time. Those actions helped us get to a point of finding the willingness to work on it together. We uncovered a whole bunch of resentments, co-dependency, denial and other gnarly shit but it was stuff we were willing to work on together. There’s no way I make it to that point on my own. It’s been over 5 years since my last drink and things are good. My kids have a sober dad and my wife has a sober husband. I’m still active in my recovery and my wife got involved with alanon. It helps with everything. Sobriety gave me the opportunity to repair the damage but I still had to take actions and do the work. Digging up my roots and separating fact from fiction in my own story has freed me up in a way I didn’t think possible and I’ve made some good friends along the way. Keep searching and working on it. You’re not alone",
            "score": 50,
            "replies": [
                {
                    "author": "Excellent-Seesaw1335",
                    "body": "Quitting drinking didn't help me repair past damages I caused but amazingly enough, I've caused zero damage in nearly six years of being sober. Shocking how that works.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "full_bl33d",
                            "body": "It’s pretty rad but I know I’m not batting 1000 percent. I certainly don’t make shit worse or blow things up like i did when i was drinking but i step in it all the time. I think the biggest difference is that i can admit when im wrong and i see my own role in my resentments. That took some time and a lot of bumps and bruises to get there and i still have a long way to go. Congrats on 6 years. I turned 5 in January.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "rodolphoteardrop",
                    "body": "It reminds of the phrase, \"I didn't always get in trouble when I drank, but every time I'd been in trouble, I'd been drinking.\"",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "FlowerOfLife",
                    "body": "OP, this comment right here. You summarized everything greatly. \n\n1) You gotta want this for YOU above all else, otherwise you'll go back to the bottle when things cool off. \n\n2) Seek external support with other alcoholics in active recovery. This was the biggest factor in keeping me sober this time around.\n\nCongrats on your sobriety covid homie!",
                    "score": 7,
                    "replies": [
                        {
                            "author": "full_bl33d",
                            "body": "Wild times, glad you made it. I think I’d be dead or worse if I hadn’t stopped drinking right before shit really got weird with Covid. I didn’t need much of an excuse to stay at home and drink… for the good of the community, of course. It fucked a lot of people up and I still see folks coming in recently that have been holed up ever since covid started. I know there’s plenty more out there. How’d you make out?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "FlowerOfLife",
                                    "body": "My sentiments exactly. I tell people that if I kept going at the pace I was at when lockdown hit, I'd most likely be dead or on the streets. I would have been downing handles of cheap vodka. I would have ended up not caring about hiding it from my wife (then girlfriend) at some point, and she would have went back to her parents. At that point, I would have just drank myself into a deeper stupor until I eventually died alone and loaded in my bed. \n\nInstead, I had a binge on February 24th 2020 that wasn't any different than other ones I'd had. I slept through the first two hours of my graveyard shift and knew I was going to finally get caught being drunk on the job. I was throwing up black \"coffee grounds,\" and opened up to my supervisor who already knew I was going through it. That morning I went to the ER for the first time in my life. I sat there alone, cold, and watching Japanese television for three hours while I reflected on how I got there. I made the choice then to suck it up and go to an AA meeting. I was done feeling like this. I was discharged, went home to take a nap, then went to my first meeting at 6pm that night. There was literal magic in the air of that room. Everything clicked into place. I proceeded to attend a meeting every single day until around March 13th when the lockdowns started shutting things down. At that point I had a good enough foundation built that all I needed was for there to not be booze in the house. My wife was very supportive of me here. The rest is history, and I am writing this to you today having just celebrated five years away from the sauce. \n\nIn hindsight, I could have just told my job that I fell asleep on the job. I usually took a nap before anyways and could have said my alarm didn't go off. I'm glad I took it to heart and decided enough was enough. The lockdown saved me in many ways. \n\nAs for how the last few years have gone, I had to step away from a hobby I loved for a few years while I focused on staying sober. I played a lot of disc golf back then, but it had turned into my excuse to go get loaded. I'd drink a few tall boys on the course, buy a single serve box wine (the ones that have 3 glasses), chug that in the parking lot of my apartment before going upstairs to my wife, and then be able to drink more without her knowing I was already buzzed. She always knew. lol So I needed to stop playing for a bit while my brain reset. I'm back to playing now and am in love with the game again. After five years in, I have zero interest in going back to the booze. I really did not enjoy the buzz when I break it down. Everything in life is much better without the booze. Everything. \n\nI appreciate you asking! Let me know if there is ever anything I can do for you",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "full_bl33d",
                                            "body": "Amazing. Very similar for me as well. I had just enough in person meetings to have made some genuine connections and I was on my way. After meetings started getting closed and things got weirder it was hard to find balance between exposure risk and not doing enough for my sobriety. I felt like I was fucked either way but I’d be extra fucked if I were still drinking. \n\nDecoupling activities with drinking for me is a never ending project. Most of the concerns are in my head tho. When I’ve gone out to golf or hike or play music, etc. it’s always been a blast. I just put soo many obstacles in my own way. Congrats on 5 years, that’s awesome. I’m still carrying my 5 year coin around with me in my pocket since last month. I don’t usually do that but it feels good. \n\nI’d say the biggest issue I have is relating to my drinking friends. I was  just with a few different groups over a long weekend a couple weeks ago and I fucking hate how all of them talk. I guess I’ve grown accustomed to the “no bullshit” / direct way other alcoholics talk to each other. I felt like everyone was trying to impress everyone else about vacations they’ve taken and complain about how  their spouses aren’t like them. I guess that’s how people talk but I’m glad I can see my role in my resentments and work on something larger. I definitely do not want my spouse to be more like me. I can barely stand myself.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "FlowerOfLife",
                                                    "body": "This whole conversation encapsulates \"I am you and you are me and we are all together.\" I think we are the same person living similar lives in different places lol \n\nI can't stand being around drunks or people heavily drinking anymore. It is just so god damned boring. People having a drink or two while hanging out or at dinner? No worries there. People doing shot after shot? Na fam, I'm out. I had to stop hanging out with my wife's friends for this reason. They'd all get hammered and then be the biggest pieces of shit to their spouses. I had to have a couple of serious conversations with my wife about how this made me feel. I did not like who she was when she was drunk. Granted, I was a handful when I was drinking, but I am over being around drunk, shitty people. She's a wonderful person and doesn't really drink anymore. She stopped hanging out with those people kind of naturally. Now we live 1000 miles away in a new place.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "br3wnor",
            "body": "Amen brother, I quit drinking because keeping my marriage and family together depended on it. At the end of the day the only thing I could do to show my wife that I was serious about change this time was not to drink. That was it, every night I had to go to bed having not drank and after months of this my wife finally began having a little bit of trust in me that this time it was serious. 400+ days later and the difference in how she sees and feels about me as a partner is night and day. And my relationships with my kids is something I never could have achieved without getting sober. \n\nYou got this 🤙🏼",
            "score": 31,
            "replies": [
                {
                    "author": "LimeSpecial1726",
                    "body": "That’s reassuring to hear. Glad I’m not alone",
                    "score": 12,
                    "replies": [
                        {
                            "author": "br3wnor",
                            "body": "Best part of this sub is realizing the amount of people with the exact same problem/life situation you have and reading about those who’ve gotten through it for the better. Life is SO much better sober for us alcoholics",
                            "score": 8,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "cjs0216",
            "body": "Good luck. I was in your same boat a month and a couple days ago…my wife has made the decision to leave the marriage. I understand why and I accept it, but it’s tough. If your person is willing to stand beside you through it, put all the effort in and don’t lean on her for support. She’s probably tired of your shit and needs to heal in her own way. Best thing you can do is show, don’t tell. Action is the only thing that will show you’re serious. Now is not the time for words. Good luck! We’re rooting for you.",
            "score": 17,
            "replies": [
                {
                    "author": "LimeSpecial1726",
                    "body": "Hell I didn’t think of her having to heal. Thanks for the words brother",
                    "score": 15,
                    "replies": [
                        {
                            "author": "cjs0216",
                            "body": "I didn’t, either…same as I didn’t realize how much my drinking was affecting my relationship with her. I was an almost daily drinker and she would get annoyed, I’d smooth it over, promise to cut back, quit, whatever. A person can only take so much of it. Get yourself in a better place and then maybe talk to her about couples therapy. Like I said, mine is too far gone. We had other issues, but drinking compounded them and made everything worse.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "LimeSpecial1726",
                                    "body": "We are not experts in smoothing it over lol",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "cjs0216",
                                            "body": "Nope lol",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Capital_Listen_5863",
            "body": "You’re doing all the right things. I’m proud of you for not only having the realization but also making concrete steps to change.",
            "score": 14,
            "replies": []
        },
        {
            "author": "godzirraaaaa",
            "body": "Some things take time. Good on you for being honest with yourself and making a change. Wishing you all the best. IWNDWYT!",
            "score": 6,
            "replies": []
        },
        {
            "author": "Mediocre_Caramel1655",
            "body": "Forgetting about the hidden empties hit me hard.  I remember when my wife found the hidden empty bottle of vanilla extract.  That was a real low point.",
            "score": 7,
            "replies": [
                {
                    "author": "mindbodysober",
                    "body": "Bad memories flooding my brain. Drank the large bottle of vanilla from Costco. So shameful, man. No more. Not today. I can hardly admit that to myself.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Apexsconnie",
            "body": "Each day sober is another opportunity to show the changes in our lives. Our loved ones put up with far, far more than we realize dealing with the problems drinking causes. I couldn’t imagine the extent of it until I put the bottle away. Keep it up, you have the right mindset!",
            "score": 6,
            "replies": []
        },
        {
            "author": "Terciel1976",
            "body": "Seven days, one at a time. Here’s to eight. IWNDWYT.",
            "score": 5,
            "replies": []
        },
        {
            "author": "UsefulChicken8642",
            "body": "IPA, scratch offs, the 7 pounds the first week, hiding cans, the frequent gas station trips. Your story is eerily identical to mine. The relationship stuff is slower to come back but it does. (Your dong will thank you too). I’m going on month 8. \n\nIWNDWYT",
            "score": 8,
            "replies": []
        },
        {
            "author": "TheAimlessPatronus",
            "body": "Thats so awesome to read. Remember that no matter what, no one can take this week of successes from you. Now you know how possible it can be. You deserve this kind of happiness 😊",
            "score": 4,
            "replies": []
        },
        {
            "author": "wetonwater",
            "body": "Day by day, keep stacking those numbers!",
            "score": 5,
            "replies": []
        },
        {
            "author": "sarahn06",
            "body": "You got this!",
            "score": 3,
            "replies": []
        },
        {
            "author": "SteamingCharlie",
            "body": "Good on you! ",
            "score": 4,
            "replies": []
        },
        {
            "author": "normal_is-boring",
            "body": "IWNDWYT",
            "score": 2,
            "replies": []
        },
        {
            "author": "Personal_Berry_6242",
            "body": "Proud of you!!! IWNDWYT",
            "score": 3,
            "replies": []
        },
        {
            "author": "Tryna_TGS",
            "body": "Keep going, you’re doing the hard work! One day at a time, friend, and it really does work. 💛 IWNDWYT",
            "score": 3,
            "replies": []
        },
        {
            "author": "MassiveMeatHammer",
            "body": "I feel you with the scratch off savings. I used to spend 20 a day. So I decided to put 20 a day into savings instead. What an insane amount of money I was throwing away over 700 a month",
            "score": 3,
            "replies": []
        },
        {
            "author": "Good_Agent6056",
            "body": "I’m on day 2. Same kinda issue.. I get blackout drunk and argue with my bf for no reason.. I can tell I have things to work on. I don’t want him to leave me. But also, I am always tired and unmotivated. I was drinking from morning until I passed out at night. Even while I was at work.",
            "score": 3,
            "replies": [
                {
                    "author": "LimeSpecial1726",
                    "body": "I am a “at work” drinker too. Your bf deserves the real you not the drunk you.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Good_Agent6056",
                            "body": "I agree.. I feel so guilty. We had 1-2 weeks of nightly arguments. I finally said I have to stop and he’s been really supportive. ",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "RedhotGuard21",
            "body": "Coming up on 2wks. Therapy is helping, lots of self reflection. Repairing the damage I’ve done will take time. \n\nKeep it up! IWNDWYT",
            "score": 2,
            "replies": []
        },
        {
            "author": "freeride35",
            "body": "My ex was in court mandated rehab for a second time when I realized she was never going to change. I never stopped loving her but I knew her drinking was fucking up both our lives, and I’d had enough. She was released from rehab just to get served divorce papers. I’m glad you didn’t get to this point, I hope you and your wife make it right.",
            "score": 2,
            "replies": []
        },
        {
            "author": "coIlean2016",
            "body": "Awesome!! I’m rooting for you and your family! \n\nIt’s not worth it. Highly recommend coming here every day. Get a badge with your start date and watch that number grow. Make it your focus. Read the stories of others. Notice their anguish. Encourage them on their journey. Understand what alcoholism means. \n\nI really loved “This naked mind” novel. \n\nIWNDWYT",
            "score": 2,
            "replies": [
                {
                    "author": "LimeSpecial1726",
                    "body": "Thanks! I was wondering how to get a number under my name.\n\nI have been reading 2 books this past week. \n\n“Atomic Habits” by James Clear.\n“The Guide” by Peter Heller.\n\nI’ll add that book to my list. I got a library card this week. Haven’t been to a library since grade school.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "coIlean2016",
                            "body": "Atomic habits is great,  I read it on repeat for 6 months! You’ll like “this naked mind” as much. \n\nIf you go to the main page for r/stopdrinking you will get the instructions for where to send your start date and the specific format as it is a badge bot and then it will be updated shortly after\n\nTap on “See community info”",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "GreasyRim",
            "body": "Boy do I know the struggle of hiding empties. If you can resist grabbing a 12 pack, I can resist grabbing 6 9.9% tallboys. IWNDWYT.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Reasonable-Will-504",
            "body": "My wife is the most important person in the world to me. We don’t have kids. It’s just us. I was hitting the vodka pretty hard. It got worse during/after Covid lockdown. I never hid my drinking, I never had to. She never gave me a hard time about it. It turns out I just always wasn’t the nicest person towards her while drinking in certain situations. She didn’t and doesn’t deserve that. I was losing her and I had to do better. So back in November I just stopped. It’s what I had to do. I didn’t talk to anyone about it. Not even her. I just stopped. Here comes another month. She said to me a few weeks ago, “you seem like your old self again”.",
            "score": 2,
            "replies": [
                {
                    "author": "Historical-Tap-8506",
                    "body": "That's pretty awesome!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "smsmsm10",
            "body": "Just remember, be patient. I quit on May 29th 2024, and my marriage too was about to be over after 25 yrs.  I can happily say we are nearly back to the good times again, trust, rekindled feelings, etc. I never realized how much verbal damage I had done until the drinking stopped. That stuff, after years takes a huge toll and does not fix itself overnight. Stay the course. Stopping drinking COMPLETELY changed my life for the better and I know it will yours. Just know your partner has their own timeline for healing and recovery.\n\nAdditionally, I find myself often reflecting on the great things about my wife, outloud to her daily, that I took for granted - she's always been the consistent rock in our relationship. I constantly acknowledge my issues and have made it a point to simply say I am sorry when a situation arises that I now clearly see through a much different lens.  Whatever works for you, it will all be so much easier minus the poison. I wish you the best! \n\nEdit - added additional context",
            "score": 2,
            "replies": [
                {
                    "author": "LimeSpecial1726",
                    "body": "Thanks for the encouragement. \n\nI forget the last time I made her actually smile. Her putting up with vice has taken a tole on her. I have work to do. She is an amazing mother and was an amazing wife until I became a child myself. \n\nCongrats on 9 months btw",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Necessary_Year_5178",
            "body": "445 days\n\nI can only speak for myself, but for me, prolonged and consistent changed behavior was the only thing that mattered. I've lost friends I won't get back, and I don't blame any of them. It's been tough. I still screw up and who knows--maybe there's another relapse in my future. I think this one's sticking, but I want to maintain gratitude.\n\nAll that's to say: I will not drink with you today. Hang in there. For me, the first month was the toughest, but it gets easier and better.",
            "score": 2,
            "replies": []
        },
        {
            "author": "beebz-marmot",
            "body": "I feel like I could’ve written this - the skulking about to hide the drinking is the worst kind of betrayal of my family, and myself.  Thanks for sharing this - it helps. IWNDWYT 🤘",
            "score": 1,
            "replies": []
        },
        {
            "author": "MarkOCaoimh",
            "body": "As the spouse of an active alcoholic… to have her make this realization and take this approach would be a dream come true",
            "score": 1,
            "replies": []
        },
        {
            "author": "JojoMcJojoface",
            "body": "I have been in your shoes. I was able to navigate by making 100% sure that I didn't drink AND I wasn't an asshole about it and did not breathe a word of complaint about it.  I agree the focus in this regard must be to ourselves. But I got a lot of traction and momentum when I turned my perspective to a 'selfless' one, instead of the selfishness of the dreadful cycle of drinking.   \n  \nI waited patiently for those little moments of connection, or service or even levity, and then I accepted those overtures and tried to build on them (i was building trust, which happens over the course of time) There were times when I thought I was 'good' to drink again, like really convinced, but jarringly/staunchly chose the 'different' choice and not drink.   \n  \n(I'll tell you the secret though... if you want to strongly connect with your wife: give unconditional foot rubs at bedtime. But to yourself it's not unconditional, it's a reinforcing deal you've made with yourself. Something like: 'when I don't drink, I am more capable of love and have value, and will remind myself of this fact with this act of love, instead of selfish drinking which was has been my choice in the past.')",
            "score": 1,
            "replies": []
        },
        {
            "author": "baronmunchausen2000",
            "body": "10 days is awesome! You got this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "obwfly",
            "body": "IWNDWYT",
            "score": 1,
            "replies": []
        },
        {
            "author": "FlowerOfLife",
            "body": "Any trust I had with my partner was just about gone when I stopped drinking. It took real time before I earned it back, and even now there are times where I get a raised eyebrow or two. \n\nThe fact that you understand this is a huge step forward. Be patient with your family giving you their trust back. Accept that you've put yourself in this position and continue to improve. \n\nLastly, be selfish with your sobriety. Getting cleaned up for others is noble, but at the end of the day, you have to want it for yourself. Forget about quitting for anyone or anything. Quit because YOU want to quit. This was something that I internalized during this stint that helped put things into perspective. There is an old story that I relate this to. \n\n\"A man wanted to change the world, but first he needed to change his country. He wanted to change his country so he changed his community. He wanted to change his community so he changed his family. He wanted to change his family so he changed himself. Then, because he changed himself, he was able to change his family. He was able to change his family and now he could change his community. He was able to change his community so he changed his country. He was able to change his country, and finally, he was able to change the world.\" or something along those lines. \n\nDo this for you first and foremost. \n\nOh, and seek out external support with other recovering alcoholics. You gotta get around other people physically who can relate with you. Your support system can only do so much if they are not addicts/alcoholics themselves. \n\nGood luck friend. Take it a day at a time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Spare_Answer_601",
            "body": "I noticed changes right away (lost weight) however, the emotional side took longer. Has your wife been to Alanon? It’s been very helpful to our family. IWNDWYT",
            "score": 1,
            "replies": []
        },
        {
            "author": "starving_queen",
            "body": "IWNDWYT",
            "score": 1,
            "replies": []
        }
    ]
}