{
    "title": "Things I have done AF this year",
    "author": "jetlaged",
    "subreddit": "stopdrinking",
    "rank": 335,
    "score": 39,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 7,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j2n5tu/things_i_have_done_af_this_year/",
    "id": "1j2n5tu",
    "selftext": "I’ve been reflecting on things I’ve experienced this year without alcohol, and it’s kind of blowing my mind. Some of these things I had never done sober before, and others were challenges that in the past I would have used drinking to cope with. But I made it through all of them clear-headed, present and actually living them. And the best part? I’ll remember them.\n\nHere are some of the big ones:\n\nMany ice fishing trips - something I had never done sober before.\n\nWatched the Super Bowl sober - for the first time ever.\n\nCelebrated my youngest’s birthday party and was fully present - It felt good not having to worry about other parents smelling alcohol on me.\n\nCelebrated my own birthday sober - probably the first one in 21 years.\n\nDealt with work stress without numbing it with alcohol - I used to love my after-work beers, but I got through the tough days without them.\n\nWent out to a sushi dinner and didn’t have sake while everyone else did - This one was tough. I love sake, and my brother even ordered me one before I arrived. I told him he could have it.\n\nHad a celebratory toast with bubbly water - still felt part of the moment.\n\nBeen bored, lonely, and depressed... and still didn’t turn to alcohol.\n\nIt hasn’t always been easy, but I’m sticking with it. And I know I’ll keep stacking up more moments like this.\n\nFor anyone out there struggling, keep going. It’s worth it.",
    "comments": [
        {
            "author": "mindbodysober",
            "body": "I got a new dog 3 years ago. Never played with her sober or not hungover.  It feels great. Thanks for a thought-provoking post!",
            "score": 3,
            "replies": []
        },
        {
            "author": "galwiththedogs",
            "body": "Thanks for this perspective! \n\nIf all goes according to plan, I’ll have my first sober summer this year—I haven’t had one in 15 years! ",
            "score": 2,
            "replies": [
                {
                    "author": "jetlaged",
                    "body": "A sober summer... that's crazy to think about too. This will be my first sober summer in 23 years. WOW",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Metal666AF",
            "body": "This is amazing and impressive. Well done and congratulations.",
            "score": 2,
            "replies": [
                {
                    "author": "jetlaged",
                    "body": "Well thank you very much :)",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "maddedge",
            "body": "I love this post. You’re inspiring!",
            "score": 2,
            "replies": [
                {
                    "author": "jetlaged",
                    "body": "Lol thanks. Never been called that before. Going to bed with a smile.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}