{
    "title": "Drinking gave me energy",
    "author": "hodlgang69",
    "subreddit": "stopdrinking",
    "rank": 385,
    "score": 8,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j2qewp/drinking_gave_me_energy/",
    "id": "1j2qewp",
    "selftext": "Since i quit i feel i have no power",
    "comments": [
        {
            "author": "la_vida_luca",
            "body": "Me too. Drinking gave me this livewire intensity that made me just battle through life. I felt weirdly drained when I was sober a month or two. But after a little more time, I found myself experiencing more energy than ever before. Better sleep, a renewed interest and capability for exercise. I figure it was like my body just needed some time to reset. It had got used to alcohol as an energy source and so it was a bit confused when its familiar energy source disappeared. All it needed was some time to get used to burning “clean” energy.\n\nCongrats on 36 days. IWNDWYT",
            "score": 5,
            "replies": []
        },
        {
            "author": "yuribotcake",
            "body": "As much as I thought that while I was drinking I could have accomplished anything, in reality drinking only motivated me to keep on drinking. When I started to run (after quitting), eventually trained for a marathon, then an ultra, my power and motivation came from being able to do more than previously capable of. If I'm tired and unmotivated just form a day of work, I will always be tired and unmotivated. But if I add a run or a gym workout after work. The body and mind adapts, so next day I am ready to tackle the day and then be able to do more after. Makes the work day feel like small part of the day, not the mountain I had to overcome previously. Alcohol was a good way to feel that how I was and what I was capable of was good enough. And if I were to even consider running or training for a distance run, it would convince me that I didn't really need to train, and after puking if I tried running a mile, a beer would just confirm that running wasn't something I was into. \n\nIWNDWYT",
            "score": 3,
            "replies": [
                {
                    "author": "hodlgang69",
                    "body": "I know what you want to say, maybe im not so long sober and thats the problem, but now im struggling with motivation and energy for everything, like work, cleaning, cooking and family.. i hope it gets better, but congrats to you!",
                    "score": 2,
                    "replies": [
                        {
                            "author": "yuribotcake",
                            "body": "I know exactly what you mean. I feel like it's not really energy, but motivation or expectation of reward for doing normal life things. If Pavlov's dogs can salivate to the sound of a bell, just imagine what a chemical that forces absurd amounts of dopamine will do to a human brain. It just takes a bit of time, a bit of rewiring, and re-learning.\n\nAnother thing to consider is how much influence my thinking brain has over how I feel and what I am motivated to do. If I give myself time to think about things, I will always find a reason to do the least amount of work, yet expect the most amount of reward. Like today I will go to the gym after work, there's no real reward after it, aside feeling good and sore. But if I stop and think \"do I feel like working out today?\" my mind will come up with a million reasons why I should just sit on couch and eat ice cream. That's what my brain is good at, evaluating and comparing. And if it knows that there's no reward, then it makes the idea of doing something feel daunting and pointless. Thus the de-motivation. So just like with gym, work, chore, I just get them done before I even have time to think about it.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Capital_Listen_5863",
            "body": "Dopamine needs to readjust … be patient with yourself! I used alcohol as an energy boost and it’s taking me a bit to readjust.",
            "score": 2,
            "replies": []
        }
    ]
}