{
    "title": "Day one",
    "author": "muse89",
    "subreddit": "stopdrinking",
    "rank": 258,
    "score": 176,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 48,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j2t6bc/day_one/",
    "id": "1j2t6bc",
    "selftext": "Been on a year long bender...every night black out drunk..my whole body is so bloated by now that I'd probably have gained 50 plus pounds \n\nEvery morning I wake up with my heart pounding along with the most stupid intrusive thoughts. \n\nThe fact that I'm doing this tells me that perhaps there's still hope somewhere inside me to make things better. ",
    "comments": [
        {
            "author": "jbashar",
            "body": "My Day one as well. IWNDWYT.  We will get through it.",
            "score": 68,
            "replies": [
                {
                    "author": "Thegirlwhothrifts69",
                    "body": "Killing it! Happy for you!!",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "commongander",
                    "body": "You got this! IWNDWYT",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Okie_Dokie_777",
                    "body": "You can do it! IWNDWYT",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Spare_Ad_4484",
            "body": "I think if you are tough enough to endure a year long bender then you are tough enough to stop.",
            "score": 40,
            "replies": [
                {
                    "author": "Its_me_T_",
                    "body": "This! I’m still in early days, but just saying no to that first drink feels so much easier than enduring the racing heart, pounding head, and spiraling thoughts just praying for it to be over",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "StopDropNRoll9",
            "body": "Well done - my first night stopping too. We have got this",
            "score": 38,
            "replies": []
        },
        {
            "author": "PuzzleheadedPlay5590",
            "body": "My day one too.  Best wishes to us all!",
            "score": 39,
            "replies": [
                {
                    "author": "Tg_the_king",
                    "body": "Godspeed brother, me too",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "Thegirlwhothrifts69",
                    "body": "Happy day one! One day at a time ❤️",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "ComfortableBuffalo57",
            "body": "You cannot win a battle without admitting that you are in a fight. You have made the first step.",
            "score": 19,
            "replies": []
        },
        {
            "author": "SufficientZucchini21",
            "body": "We all start at the same place. Welcome. \n\nIWNDWYT",
            "score": 18,
            "replies": []
        },
        {
            "author": "Excellent-Seesaw1335",
            "body": "Just get through day 1 and then you'll have a little more hope to help you through day 2.",
            "score": 15,
            "replies": []
        },
        {
            "author": "Been1LongDay",
            "body": "That weight will fall off. Some of it at least. It's what has kept me going as much as anything. I looked at a picture yesterday of me basically passed out on the couch with one hand in the waste of my pants and my shirt halfway up my bloated belly. That pic was a couple months ago. I don't really try to impress other people but I used to always have a little pride in how I looked, just basic stuff no world's sexiest man shit, but damn I looked rough in that pic to be honest. It's been a source of motivation even if I'm not perfect",
            "score": 9,
            "replies": []
        },
        {
            "author": "Downtown-Reason-6523",
            "body": "Lots of us here on day 1.  I hope to see you all tomorrow!",
            "score": 10,
            "replies": [
                {
                    "author": "Thegirlwhothrifts69",
                    "body": "Yes!! happy day one! One is better than 0 I’m stoked for you!! Keep going ❤️",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Vahiker81",
            "body": "Congrats!  Meetings helped me sustain sobriety... Meeting Guide app lists where and when.  6 years sober.  You're not alone.",
            "score": 8,
            "replies": []
        },
        {
            "author": "Wanttobebetter76",
            "body": "I have faith in all of you! I'm glad you're here. You never have to feel that terrible again. We can do hard things! I will not drink with you today!",
            "score": 7,
            "replies": []
        },
        {
            "author": "Thegirlwhothrifts69",
            "body": "Congrats on your day one! The body is so resilient you’d be surprised. You’re already going through the worse part today. Keep going!! You got this ❤️\nIWNDWYT!",
            "score": 6,
            "replies": []
        },
        {
            "author": "VicarLiquor",
            "body": "Me too. The confusing thing is, I’ve quit before and it was easy and I felt amazing! I even left notes for myself - “remember how good you feel.” \n\nSomeone, somewhere said it’s like you’re this fly who keeps hitting the glass pane when all you have to do is fly out the open window next to it. \n\nI take that to mean, if you can let go of your assumptions about something (that most likely controls you) you will find that mysterious answer we’re all searching for. How is it so obvious but so damn hard?",
            "score": 5,
            "replies": [
                {
                    "author": "VicarLiquor",
                    "body": "Ignore my silly avatar name (it was random 😝)",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "tox1cTort",
            "body": "Hold on to that hope - it's real, and it can get you through snags. You have so much more power than you know!",
            "score": 5,
            "replies": []
        },
        {
            "author": "MindPerastalsis",
            "body": "Day one here for me as well…day one is the easiest…hold on for the ride. I have day one a couple times a week. We can do it this time ❤️‍🩹",
            "score": 5,
            "replies": []
        },
        {
            "author": "freeride35",
            "body": "It’s a step in the right direction, keep moving.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Kingdoktor",
            "body": "Well done, the PAWS will be brutal, the anxiety will be insane.\nGive your body time to heal.\n\nBe careful of withdrawal symptoms if you begin to shake you need to get immediate medical attention.\nThey will also help you with the anxiety-",
            "score": 6,
            "replies": []
        },
        {
            "author": "Eye-deliver",
            "body": "Wow! So glad you are all here! There is every reason in the world for you to not lose hope. You can do this one day at a time. So simple but seemingly so hard. There is a lot of support here so keep coming back! IWNDWYT",
            "score": 4,
            "replies": []
        },
        {
            "author": "ScribbleDibbleDo",
            "body": "There is Hope. And day one is required. You can do it. Glad you are here!",
            "score": 5,
            "replies": []
        },
        {
            "author": "DoqHolliday",
            "body": "You guys got this, sending good wishes for resolve and clarity. \n\nNothing to lose and everything to gain.\n\nOnwards and upwards!\n\nIWNDWYT",
            "score": 3,
            "replies": []
        },
        {
            "author": "turkeylips4ever",
            "body": "You’ve got this! IWNDWYT\nBe safe and go to ER for detox if you can 🖤",
            "score": 3,
            "replies": []
        },
        {
            "author": "MysteriousJimm",
            "body": "Plenty of us have been there brother. It’s so hard mentally to pull yourself out when you are that far in. Memes and shit talking about “three day benders” like they are hardcore always make me chuckle.",
            "score": 3,
            "replies": []
        },
        {
            "author": "palmtree3333",
            "body": "There is hope!!! Make sure you have some support systems in place. I use the Sunnyside app, go to therapy and the book Sober Curious was a helpful resource when I was contemplating breaking up with alcohol. It’s been six months sober for me after 20 years of drinking, with the first half of this year being full of long binge weekends. I don’t have nearly the level or frequency of dread/anxiety/intrusive thoughts I used to and that keeps me motivated to abstain, especially in moments of craving. I fast forward the clock and think about what a gift it is to not be hungover!",
            "score": 3,
            "replies": []
        },
        {
            "author": "Fickle_Mortgage_9425",
            "body": "day 8 and i feel amazing!  you day one guys, you got this!  i promise, if i can do it, anyone can.  first 4 nights of sleep were hell, but push through.  it is so worth it.  i check in every night with this thread and it's amazing what a support system it is for me.  so thank you all.  i already feel an incredible amount of optimism for my future.",
            "score": 3,
            "replies": []
        },
        {
            "author": "MaryjaneinPA",
            "body": "Welcome aboard.  It's a great place to be. IWDWYT.",
            "score": 2,
            "replies": []
        },
        {
            "author": "NB-THC",
            "body": "You got this. Hang in there and stay strong. It gets better. I was just like you for multiple years in a row.\n\nIWNDWYT",
            "score": 2,
            "replies": []
        },
        {
            "author": "Expert-Pain-5140",
            "body": "You got this 💪 IWNDWYT",
            "score": 2,
            "replies": []
        },
        {
            "author": "Open_Preference7549",
            "body": "Grab onto that hope and don't let go. You are strong. You can do this. IWNDWYT",
            "score": 2,
            "replies": []
        },
        {
            "author": "on_my_way_back",
            "body": "Congratulations on day one!  I found that the first day was the most challenging for me.  I didn't think I would ever be able to quit drinking poison.  However, something magical happened along the way as I realized that I can quit drinking alcohol and not miss it.  I did a few things differently this time.  First,  I educated myself on the harmful effects of alcohol on the human mind and body.  Second, I added community to my support.  Third, I stopped lying to myself about alcohol.  You can do this!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Care-Bear_703",
            "body": "IWNDWYT, you can do it. You dont have to feel like this ever again, its the best feeling honestly 🥰",
            "score": 2,
            "replies": []
        },
        {
            "author": "madeitmyself7",
            "body": "Good job on day one!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Lolbak",
            "body": "Mine too. Again. We got this!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Mystiquewraith",
            "body": "IWNDWYT!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Key_Blacksmith_813",
            "body": "Welcome to the rest of your life.",
            "score": 2,
            "replies": []
        },
        {
            "author": "snuffbby",
            "body": "day one for me. i want to try. i want so badly to try. everyone's posts are very eye opening for me. we can do this",
            "score": 2,
            "replies": []
        },
        {
            "author": "Vesper-Martinis",
            "body": "Iwndwyt and welcome to all the one dayers!",
            "score": 2,
            "replies": []
        },
        {
            "author": "MyBodyStoppedMoving",
            "body": "I suggest checking out an AA meeting. I know it’s not for everyone, but it definitely helped me.",
            "score": 2,
            "replies": []
        },
        {
            "author": "rev0lutionist",
            "body": "My day 1 as well - we got this!",
            "score": 2,
            "replies": []
        },
        {
            "author": "PuzzleheadedPlay5590",
            "body": "How are all the Day One folk?\nThirty six hours here and feeling ok, just tired.\nI’m so grateful for this community.❤️",
            "score": 1,
            "replies": []
        },
        {
            "author": "Okie_Dokie_777",
            "body": "You got this IWNDWYT ❤️",
            "score": 1,
            "replies": []
        }
    ]
}