{
    "title": "Anyone been sober since the new year?",
    "author": "vitality_ox",
    "subreddit": "stopdrinking",
    "rank": 225,
    "score": 245,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 172,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j2x51b/anyone_been_sober_since_the_new_year/",
    "id": "1j2x51b",
    "selftext": "I did dry January and then dry February and here we are continuing in March. I was curious to hear if anyone else did dry January and is still going strong? I’d love to hear how you are doing on your sobriety journey. ",
    "comments": [
        {
            "author": "RelationshipFirm9756",
            "body": "My last drink was on Christmas 2024. This is the longest I’ve gone in years.",
            "score": 79,
            "replies": [
                {
                    "author": "Gullible-Noise-9209",
                    "body": "12/26/24 here",
                    "score": 22,
                    "replies": [
                        {
                            "author": "polocanyolo",
                            "body": "Me too",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "Skimable_crude",
                            "body": "Same.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "NK534PNXMb556VU7p",
                    "body": "1/3/2025",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "808champs",
                    "body": "Cool! Mine was around the same date, but 2023. Keep it up!",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "jimothy1972",
                    "body": "Last drink was on Christmas morning too",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Lucky_Best_Wash",
                    "body": "Me too. Last drink was 12/25/24.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "jimothy1972",
                            "body": "Great work!",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SomeOneOverHereNow",
                    "body": "I'm about the same.  Dec 20th 2023.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Disastrous_Earth3714",
            "body": "Did dry January with no real intention of making it permanent but now I am really thinking I'll do just that. IWNDWYT!",
            "score": 56,
            "replies": [
                {
                    "author": "drinkyourcornliquor",
                    "body": "You will not regret continuing being sober.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "AlternativeHandle100",
                    "body": "Same here! Really liking it, but January was easier for social activities like everyone knows ‘dry january’ now.\n\nNow it feels harder to say that I’m still not drinking. \n\nWhat’s your experience on this?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Disastrous_Earth3714",
                            "body": "I haven't had a problem with that really. No thanks has worked well for me so far.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PandaKittyJeepDoodle",
                    "body": "It just gets better!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "SwissFleas",
                    "body": "SAME",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Knife_guy1210",
            "body": "3rd new years AF and going strong 💪",
            "score": 44,
            "replies": [
                {
                    "author": "2Punchbowl",
                    "body": "Keep it up big guy! I love it!",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Momik",
                    "body": "Nice! I’m at about 17 months myself",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Starman68",
            "body": "Yes I did this 7 years two months and three days ago! \n\nI started with January. Then thought let’s do 50 days. Then at 100 days you get a new liver. Why not try 6 months. OK, let’s go for a year. The first year is the most difficult.",
            "score": 29,
            "replies": []
        },
        {
            "author": "evilgiraffe04",
            "body": "I stopped 12/4/24 as a promise to myself for landing a new job. I told myself two months but I’ve kept going. My dog was diagnosed with lymphoma in early February and I decided to keep going because I want to be present with him during his remaining time.",
            "score": 23,
            "replies": [
                {
                    "author": "leebaweeba",
                    "body": "I’m really sorry to hear about your dog. What an awesome gift to both of you that you’ll be more present in the time ahead. \n\nKeep it up. You’re doing amazing.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "palmtree3333",
            "body": "Just hit six months! Probably the longest I’ve gone in 20 years.",
            "score": 23,
            "replies": [
                {
                    "author": "2Punchbowl",
                    "body": "Congrats!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "AlphaBurke",
            "body": "After many, many badge resets, I did a sober August back in 2018. By day 10 I felt like I was living life with a cheat code on. Never looked back.",
            "score": 17,
            "replies": [
                {
                    "author": "BloggerCurious",
                    "body": "Nice! So by day 10 you say. All right, I'm taking notes. I'm still a 'Rookie', so I've got a lot to learn",
                    "score": 1,
                    "replies": [
                        {
                            "author": "AlphaBurke",
                            "body": "Heavy word of caution, everyone is different and ymmv. I have seen people on here say they felt no different after 30 days. I think it has a lot to do with how much you regularly drink and why. \n\nI didn’t have any underlying depression or other issues. I suspect a lot of people who don’t feel a lot of difference have underlying issues that make the turnaround in mood less noticeable. \n\nWhat I’m trying to say is, if you don’t feel amazing at day 10, don’t give up. IWNDWYT",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "GenevieveSapha",
            "body": "Jan, 22nd...\n\nCongrats on 61Days...",
            "score": 16,
            "replies": [
                {
                    "author": "leebaweeba",
                    "body": "Proud of you! IWNDWYT",
                    "score": 3,
                    "replies": [
                        {
                            "author": "GenevieveSapha",
                            "body": "Ty... 🩷\n\nIWNDWYT",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "crumbsforget",
                    "body": "Me too!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "SlyChic",
            "body": "I’m 60 days sober; I knew that I didn’t want to go back to drinking though. It’s been one of the best decisions of my life.",
            "score": 15,
            "replies": []
        },
        {
            "author": "Goliardojojo",
            "body": "I started dry January on the 2nd continued in February and now I’m doing March. All is well except for crippling headaches that I can’t seem to shift. I’ve had some edgy moments that were uncomfortable but that said, it didn’t make me want to drink. I’m feeling very alone, confused and sad atm. I’m going to try and eat more healthily and get more exercise to see if that helps my overall condition. Hopefully I feel better tomorrow. IWNDWYT",
            "score": 12,
            "replies": [
                {
                    "author": "No_Main3084",
                    "body": "mine lasted as long and are less infrequent now around day 103 stay in there!",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "sittingontheroofjust",
            "body": "that's great keep going and stay with it",
            "score": 8,
            "replies": []
        },
        {
            "author": "LeatherAd7686",
            "body": "Last drink was new years 2024. Still going strong. Last year I went 11 months before I drank. I’m committed to 1 full year this time around. But then again I’m not drinking just for today.",
            "score": 9,
            "replies": [
                {
                    "author": "lo__-l",
                    "body": "I’m using my amazing powers of procrastination to put off drinking until later. After a while it’s too late to start today so maybe tomorrow.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "yayoallnite",
            "body": "Sober since NYE 🎉🎉🎉",
            "score": 6,
            "replies": []
        },
        {
            "author": "DifferentProduct284",
            "body": "My last drink was December 5!!! Keep it up!!",
            "score": 7,
            "replies": []
        },
        {
            "author": "Manuntdfan",
            "body": "Since Jan 25th for me. I dont ever want another drink in my life. I do enjoy cannabis though.",
            "score": 7,
            "replies": []
        },
        {
            "author": "elleantsia",
            "body": "I started January 10th still going strong. It’s been interesting. I’m a lot more emotional. Maybe I’ve always been but I’m irritated not being able to cope the same ways but I’m a lot more creative now. Like i can write a journal entry on several full pages which is something I’ve never done while drinking",
            "score": 4,
            "replies": [
                {
                    "author": "mamabear1087",
                    "body": "I too am so much more emotional. I cry a lot more. I broke down with my son the other day out of nowhere (and nowhere near my period). Did not expect this.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "elleantsia",
                            "body": "Yes!! I have pmdd so I’m familiar with luteal phase problems. But same here. We’re grieving the loss of a friend too :(",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "mamabear1087",
                                    "body": "So so true.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "McDiscage85",
            "body": "Me! I did dry January and have yet to have any alcohol this year. I have been in numerous situations were I'd usually drink... (bars, concerts, etc) I have held strong and it really hasn't been that hard for me. Going to keep on going..",
            "score": 5,
            "replies": []
        },
        {
            "author": "Ambitious-Can4244",
            "body": "Been sober since Christmas. Feeling ok. Still dealing with some fatigue.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Suspishbish97",
            "body": "Didn’t manage to do dry January but the last time I drank was 01/10/25 :) feeling great just struggling with all the emotions I am having to process now that I’m not drowning it all with booze.",
            "score": 5,
            "replies": []
        },
        {
            "author": "HUP",
            "body": "That's me. After the 1st week or so, I've only had a handful of difficult urges. I've gotten to the point that I'm scared to drink. I know I should never drink again. I know that if I do, it'll just be the same old slippery slope. I'm thoroughly committed to losing weight. So I'm not going to drink until I lose at least another 20 lbs.",
            "score": 6,
            "replies": [
                {
                    "author": "vitality_ox",
                    "body": "Losing weight is a big motivator for me to continue to be sober too.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Interesting_Taro_358",
            "body": "I’ve been miserable :) and I started dec 31st",
            "score": 5,
            "replies": []
        },
        {
            "author": "Broad_Sun3791",
            "body": "I did dry July and then set a goal for 15 months.",
            "score": 3,
            "replies": []
        },
        {
            "author": "infinitetwizzlers",
            "body": "Yes, me. Although I went into it planning to do sober forever. Holding strong!",
            "score": 4,
            "replies": []
        },
        {
            "author": "djd66",
            "body": "Yep, been sober since January 1 and I have no plans to drink again. I feel so much better and I have also dropped 20lbs!",
            "score": 3,
            "replies": []
        },
        {
            "author": "Zealousideal-Pen-142",
            "body": "Last drink new years. It’s been amazing. I’m 39, longest I’ve gone without alcohol since sophomore year of high school. So hard at first, had to rely on NA beers. Now I just drink seltzer water in evening.",
            "score": 3,
            "replies": [
                {
                    "author": "djd66",
                    "body": "I do the same with seltzer! I bought a soda stream and make my own. I add a little cranberry and slice of lemon- it awesome! I like to use Knudsen cranberry juice as it far better than ocean spray. My wife gives me a hard time about the bottle costing $10,… I remind her how much a bottle of wine costs and she smiles!\n\nI also enjoy Athletic beer - tastes just like an IPA with none of the bad stuff - and they are only 60 calories.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ac_superstar",
            "body": "28th Dec 2024.. it’s not been easy at times but everyday I’m fighting to stop me from going back to drinking. It really is one day at a time.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Metal666AF",
            "body": "Yes, but I try not to forget: it’s always one day at the time.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Which_Rip_5872",
            "body": "Did dry January. I liked it so I’ve kept it going. At 100 days I’ll reassess.",
            "score": 3,
            "replies": [
                {
                    "author": "viciouschicken99",
                    "body": "That's my thinking right now also",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "InuitOverIt",
            "body": "I was planning on starting Jan 1, ended up with covid right after Christmas so I accidentally started early.",
            "score": 3,
            "replies": []
        },
        {
            "author": "mpkns924",
            "body": "December 28th was my last night out drinking. I got pretty hammered. Nothing bad happened aside from the usual hangover, anxiety, lack of sleep, being a shitty parent the next day, etc.  \n\nI did dry January last year and it lasted until April. I drank on and off the rest of 2024. I might get the itch to drink on a patio this summer, but I’ll play the tape forward and know it’s not worth it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Extra_Meaning_2647",
            "body": "I’m still doing my sober September. There have only been a few occasions where I thought a glass of wine would be nice, but I don’t actually miss it. Noticeably more productive and positive. I feel very lucky and grateful to have a much easier quit than I have actually earned. Not as much weight loss as I would have liked, but now time to dial in the diet. I don’t feel obligated to liven up any party anymore (but I’m still fun!) and I feel closer to my loved ones. And I LIKE my sober self! I knew this time would be different because I wasn’t counting down the September days until I could drink again. My health numbers had finally started to show that I wasn’t compensating anymore, which was the catalyst. Everything improved in 3 months. Sending love and support to you all, especially to those who are struggling.",
            "score": 3,
            "replies": []
        },
        {
            "author": "TinaGeneLouise1",
            "body": "Me! Jan I felt great, lots of energy and doing all the things. Feb wasn't my favorite. I spent the whole month feeling physically and mentally exhausted. Luckily I haven't had a single urge to drink since I quit but I haven't experienced a whole lot of benefits besides a little better sleep and no hangovers. Here's to hoping the good stuff is coming soon!",
            "score": 3,
            "replies": []
        },
        {
            "author": "Miserable_Junket9652",
            "body": "1/6/25!",
            "score": 3,
            "replies": []
        },
        {
            "author": "coIlean2016",
            "body": "Since the first part of last November!!  Almost 4 month!!",
            "score": 3,
            "replies": []
        },
        {
            "author": "jetlaged",
            "body": "I'm here just rocking sober 2025 too, seeing where it's gonna take me!",
            "score": 3,
            "replies": []
        },
        {
            "author": "wilt-oledo",
            "body": " I wish. Had two or three bad weeks, mostly sober other than that. Still a far better start to the year than I’ve had in a long time.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Melodic_Preference60",
            "body": "Yep, January 2023!",
            "score": 3,
            "replies": []
        },
        {
            "author": "TheMrfabio24",
            "body": "Right here✋.",
            "score": 3,
            "replies": []
        },
        {
            "author": "SGTIndigo",
            "body": "I’ve been quit since Jan. 1, 2024. I started for Dry January and just kept going. So glad I did.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Sensitive_Target6602",
            "body": "I have but I’ve also been sober since October 28th. I had tried dry January in the past but wasn’t able to stick to it very well. This time around something is working.",
            "score": 3,
            "replies": []
        },
        {
            "author": "madirish098",
            "body": "New years was my last one.  Feeling really good, all the normal things I’ve read here for years - better sleep/digestion/mental health.  Also trying to stop eating so much sugar as that has seemed to creep.  No real goal at this point just felt like drinking was getting deadly boring and I have a lot of important shit happening this year keeping me busy and focused.  Not really tempted to drink and don’t plan to break the oath.",
            "score": 3,
            "replies": []
        },
        {
            "author": "DriftingPyscho",
            "body": "April 4th last year actually.  ",
            "score": 3,
            "replies": []
        },
        {
            "author": "PictureNegative12",
            "body": "I had my last drink December 31, 2024.",
            "score": 3,
            "replies": []
        },
        {
            "author": "El_Demetrio",
            "body": "Me!  New year’s eve was my last dance!",
            "score": 3,
            "replies": []
        },
        {
            "author": "Vesper-Martinis",
            "body": "I hadn’t really heard of dry January but seems to do it, then February and now\nMarch. Loving life.",
            "score": 3,
            "replies": []
        },
        {
            "author": "50_by_50",
            "body": "Me!  Honestly once I got past the first few weeks, it hasn’t been too bad! I love how I feel so that’s motivating me to not go back! This is the longest I’ve gone sober in forever! Congrats! IWNDWYT!!!",
            "score": 3,
            "replies": []
        },
        {
            "author": "Slow_flow",
            "body": "Not quite since the New Year but January 11th was my last drink. It’s been amazing, and I wish I had started sooner. It just seems so obvious now that alcohol is not the move. Congrats on your tremendous start to the year! I’m looking forward to being a year deep into this and seeing where I am.",
            "score": 3,
            "replies": [
                {
                    "author": "sweet_sixty",
                    "body": "Wonderful to read from you. Congrats to being sober for so many weeks now. And it really doesn’t matter how long we are sober as long as we are not drinking today. I will not, that’s for sure. Alcohol is a poison and would ruin my day.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Classic_Shake_6566",
            "body": "I started with dry jan and it was my 4th annual. I thought going into it that it could be different.  I've been going strong since.  \n\nI had a friend's 50th birthday in Vegas over a weekend which was interesting. I slept earlier than the rest, and tbh did not enjoy Vegas. At all.  \n\nI have been exploring Buddhism a lot. I've been figuring out my new identity.  What do I do with my leisure time that doesn't involve drinking. I've always been fit, full Ironman, so many triathlons, and certified Pilates teacher on the side. It feels tough and lonely sometimes, but then I remind myself I'm doing cool stuff like a pelvic floor workshop this weekend. I'll be so much more open to learning and meeting people without feeling the tinge of hangover and that anxiety with some body aches.  \n\nWriting this response to you has helped and I'm grateful that you posted your question.  I will not drink with you today",
            "score": 3,
            "replies": []
        },
        {
            "author": "Freetobeyourself",
            "body": "Consecutively since December 27th! I only had 4 drinking days in December before committing to being AF. IWNDWYT",
            "score": 3,
            "replies": []
        },
        {
            "author": "harmonious_harry",
            "body": "I did this a few years ago. My dry January has lasted over 3 years. Good luck OP. Great way to start the new year. IWNDWYT",
            "score": 3,
            "replies": []
        },
        {
            "author": "Belizemomma",
            "body": "January 1st, and I'm happy with my efforts!",
            "score": 3,
            "replies": []
        },
        {
            "author": "Sensitive-Candle3426",
            "body": "Still goin' 🙌🏻",
            "score": 3,
            "replies": []
        },
        {
            "author": "realitybites95",
            "body": "It’s going. Some days are easier than others. I wish I could still drink wine but then I fast forward and I know I will feel like shit so I don’t.",
            "score": 3,
            "replies": []
        },
        {
            "author": "livenow-thinklater",
            "body": "Jan 4th here! Went in with the intention of at least taking a break, but still going strong and no plans to go back. Life isn’t perfect, but it’s a million times better sober.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Square-Weight4148",
            "body": "Dry since october 1st last year.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Professional_Toe2751",
            "body": "Yes! 62 days",
            "score": 3,
            "replies": []
        },
        {
            "author": "Only-girl444",
            "body": "Yes! Exact same here, last drink was NYE. Did dry Jan, then did Feb and now in March. First month was easy enough (mostly), February I was very emotional, cried at everything. I’m doing much better this month. I have been told (mainly via Reddit) that the big changes take a while, min 6 months, so I’m very excited for that and to be honest it’s keeping me going. I have lost weight, sleeping great and my skin is looking better. I’m 40F, been a heavy drinker (daily) for 20 years",
            "score": 3,
            "replies": []
        },
        {
            "author": "SlurmsMacKenzie420",
            "body": "Dec 15, 2024 for me. Can’t wait to hit that 90 day mark. Haven’t been sober this long since my last deployment. Feels great",
            "score": 3,
            "replies": []
        },
        {
            "author": "thegoodchildtrevor",
            "body": "Daily drinker. Dry since 20th Dec. Thought I’d just do a month. Felt like things were only starting to genuinely improve around the end of the first month so I’m still going.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Confident-Address640",
            "body": "Yes and prior to the new year I had over four months before minor set back and then back on the train",
            "score": 2,
            "replies": []
        },
        {
            "author": "Eat2Live2Run",
            "body": "Yep! My last drink was December 28.",
            "score": 2,
            "replies": []
        },
        {
            "author": "2Punchbowl",
            "body": "I’m doing March, I stopped doing 1 day at a time, I now do 1 month at a time, so many less decisions for me to think about.",
            "score": 2,
            "replies": []
        },
        {
            "author": "alizabs91",
            "body": "Me! Been going since early November of last year.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Galaxyman0917",
            "body": "I started with dry January and I’m still going. I feel the best I have in years!",
            "score": 2,
            "replies": []
        },
        {
            "author": "effasteriskck",
            "body": "My last drink was dec 23st! Still holding strong.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Altruistic-Slide-512",
            "body": "January 1st! Seemed like a good moment. I feel motivated and healthy. Congratulations!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Beulah621",
            "body": "Yes, Dry January has stretched on to March and I feel fantastic! IWNDWYT 🙂",
            "score": 2,
            "replies": []
        },
        {
            "author": "nicen08",
            "body": "Sober since 12/23/24. It's the longest I've gone in quite some time.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Deepspace9mm",
            "body": "12/14/24 here",
            "score": 2,
            "replies": []
        },
        {
            "author": "Thin_Switch_5861",
            "body": "Yes and I will be sober 10 months on the 12th. I believe this will be the first time in years I have made it through every major holiday from April-now, completely sober 🥰 honestly it just gets better and better. I’ve shared a little here in the forum, but my personal life circumstances haven’t gotten any better, in fact they’ve gotten worse. But knowing that I’ve been learning to get through the hard stuff without drinking, has felt like such an accomplishment. It’s not a piece of cake and is still a work in progress as far as the things I am learning and how I handle situations but it’s just like man… a year ago I couldn’t imagine two consecutive hard days at work, without a drink a night and now I have been trudging through the worst year of my life stone cold sober. It’s a good feeling.",
            "score": 2,
            "replies": []
        },
        {
            "author": "realityexperiencer",
            "body": "I’ve been trying a bit (ok a lot) before, but Jan 1 is when it stick. Maybe it was shared vibes from the Dry January folks that I drafted on. 😂",
            "score": 2,
            "replies": []
        },
        {
            "author": "Psychological-Try343",
            "body": "Me!! I don't know what I'm doing or how long this will last, but now I'm thinking April cuz why not?",
            "score": 2,
            "replies": []
        },
        {
            "author": "bridge_view",
            "body": "09/12/1980",
            "score": 2,
            "replies": []
        },
        {
            "author": "toihanonkiwa",
            "body": "Well, yes (but also a bit before NY)",
            "score": 2,
            "replies": []
        },
        {
            "author": "Complex-Olive-5447",
            "body": "Last drink 10/31/2024 ….wooooo",
            "score": 2,
            "replies": []
        },
        {
            "author": "Former-Quail-1482",
            "body": "12/30/24",
            "score": 2,
            "replies": []
        },
        {
            "author": "PrinceCastanzaCapone",
            "body": "Been sober since December of 23! I am not going back… ever. I drink NA beers, some that are “Near Beers” that *may* containin up to 0.5% alcohol but I could drink a six pack and not feel a thing. I think the labeling is just them covering their ass since it might not be exactly zero alcohol. That level of alcohol is similar to most kombuchas and fruit juices according to google. In some states minors can purchase them.\n\n12/19/23 for me.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Libra-Wolf",
            "body": "Started 12/16/2024 after my last hurrah at a Christmas work party. Already lost several inches off my waist, my face is no longer bloated, have gotten back into powerlifting, and have been striving to do better each day. \nThankful to not constantly bargain with myself every night to justify my drinking because the devil on my shoulder says I should.",
            "score": 2,
            "replies": []
        },
        {
            "author": "fecundity88",
            "body": "Since 2019 New Year’s Eve. 12/31/19",
            "score": 2,
            "replies": []
        },
        {
            "author": "RoughStory3139",
            "body": "8-12-18",
            "score": 2,
            "replies": []
        },
        {
            "author": "_D3ft0ne_",
            "body": "I am trying for at least a year... And hopefully sober, rest of my life.",
            "score": 2,
            "replies": []
        },
        {
            "author": "katolato28",
            "body": "Last drink 1/3/2025",
            "score": 2,
            "replies": []
        },
        {
            "author": "raerabbit27",
            "body": "Me! Stopped right before New Year’s and I’m not looking back 😎",
            "score": 2,
            "replies": []
        },
        {
            "author": "thanksmydude123",
            "body": "Yep, me - 12/31/2024 🥳",
            "score": 2,
            "replies": []
        },
        {
            "author": "Which-Inspection735",
            "body": "Yeah I did this in 2024 and kept it going until October (we went to an all inclusive resort. I did drink a lot but didn’t get sloppy). After that trip I had the occasional drink, but I’m doing it again this year. After our next trip, it’ll be a rare thing for me to drink but I’m not going to be militant about it. Im",
            "score": 2,
            "replies": [
                {
                    "author": "MrSchpund",
                    "body": "I did two years of abstinence before going to an all inclusive resort … A couple of years back on the booze followed but now dry again since NYE.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "yearsofpractice",
            "body": "Hey OP. I’ve been sober since October 2023, but just wanted to congratulate you on your achievement! \n\nIf it helps, I’ve learned not to count the months or think in terms of long term targets - just focus on no drinking today. Just today. Tomorrow will take care of itself. \n\nAlso - what benefits have you seen so far? I remember month three was when my thought processes started to speed up and I just started to feel sharper mentally. \n\nAll the very best to you from Newcastle Upon Tyne, UK",
            "score": 2,
            "replies": [
                {
                    "author": "vitality_ox",
                    "body": "Hi there! Thank you so much! Also, congratulations to you! That is amazing. Yes, one day at a time. I’ve noticed I’m able to handle work stress better. I’ve read a lot of books this year. I also am eating healthier. I hope to see more benefits as I move forward on this journey. The cravings have come and gone. I am proud of myself for not giving in when those cravings felt intense to the point I thought I may pick up a drink. Distraction helps and playing the tape forward.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Vast-Courage-6811",
            "body": "12/27/24 still going strong.  The gym really helps with anxiety.",
            "score": 2,
            "replies": []
        },
        {
            "author": "yvr_dad",
            "body": "12/19/24 here.  I find the clarity in the mornings - and lack of guilt / anxiety - the best part.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Boring-Brush-2984",
            "body": "Going strong since Sunday December 8th. I was sober for 6 months until that Friday (12/6). Friends came into town for dinner and I was weak! Went on a bender throughout that entire weekend…I can never just have one drink…I have to go all out",
            "score": 2,
            "replies": []
        },
        {
            "author": "SwissFleas",
            "body": "🙋‍♀️\n\nI tried dry january. Felt..... amazing. It was planned, but also needed. My kids made some drinking comments to me on NYE and that sealed the deal for dry january. Outside of pregnancy, I've never gone this long without drinking. I feel great, sleep better, less anxious, skin looks great, all the good stuff. But why do I still miss drinking??? Ugh. I really intend to be off the stuff forever.",
            "score": 2,
            "replies": [
                {
                    "author": "vitality_ox",
                    "body": "I can relate. I go through moments of missing it too. The grief is losing alcohol is a real thing. Just wanted to let you know you are not alone. I am proud of you!!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "IllustriousFriend894",
            "body": "My last drink was 1/5/25. It’s been mostly good. The cravings hit me more the second month than the first (yesterday was a hard one, but I endured), but life is definitely better. More sleep, better sleep, less anxiety.",
            "score": 2,
            "replies": []
        },
        {
            "author": "chickee17",
            "body": "My last drink was New Year’s Eve.  Still going strong.  Just got back from a 2 week vacation south and did not touch a drop.  Pretty proud of myself.  Let’s keep going!!",
            "score": 2,
            "replies": []
        },
        {
            "author": "CaptainlockheedME262",
            "body": "Started on December 15th. Feeling so damned good and determined to keep it going.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mon_2424",
            "body": "I started having worrying GI symptoms mid December and haven't touched a drink since. Unfortunately still having issues so I'm guessing it wasn't the alcohol.",
            "score": 1,
            "replies": []
        },
        {
            "author": "joeytootall12",
            "body": "My last drink was on 12/17/24. This is the longest I’ve gone without a drink in 15+ years",
            "score": 1,
            "replies": []
        },
        {
            "author": "combonickel55",
            "body": "Still going strong",
            "score": 1,
            "replies": []
        },
        {
            "author": "shifty1032231",
            "body": "Still 100% sober in 2025",
            "score": 1,
            "replies": []
        },
        {
            "author": "UnleashTheOnion",
            "body": "My husband quit two days after Christmas. So proud of all of you!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "rhyno23rjr",
            "body": "Sober since NYE, plan on raw dogging 2025, no plans on returning to my old ways.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cheesesmysavior",
            "body": "Dry January only helped me realize the problem. It was time for the real work to begin. Day 11 here. Shooting for 30 Then 🤷🏼‍♀️",
            "score": 1,
            "replies": []
        },
        {
            "author": "c6zr_juan",
            "body": "December 1st",
            "score": 1,
            "replies": []
        },
        {
            "author": "808champs",
            "body": "Yep. Last year too. Feel great.",
            "score": 1,
            "replies": []
        },
        {
            "author": "f3ath",
            "body": "I like it so far. Carry on!",
            "score": 1,
            "replies": []
        },
        {
            "author": "MoumouMachine",
            "body": "I stopped in early September and just hit 6 months",
            "score": 1,
            "replies": []
        },
        {
            "author": "Shaakti",
            "body": "Yup",
            "score": 1,
            "replies": []
        },
        {
            "author": "den773",
            "body": "IWNDWYT!",
            "score": 1,
            "replies": []
        },
        {
            "author": "jupiter_citizen",
            "body": "My last drink was December 29, my last bottle of wine",
            "score": 1,
            "replies": []
        },
        {
            "author": "Icarus18181",
            "body": "Me ! Sober since January 1st. I like the benefits and feel real good. I will tell you the truth however, I feel like sometimes the routine gets more into me or am I just gettting more conscious of it? I dont want to relapse but Im in this kind of grey area right now…",
            "score": 1,
            "replies": []
        },
        {
            "author": "Missavieve",
            "body": "My husband (who does breaks all the time) was doing “Dry Til July” and I decided I wanted to try not drinking for the first time ever (heavy wine drinker for 20 years.) So I stopped drinking Jan 1 not sure how I was going to make it to July and now I’m pretty sure I’m never going back. It’s turned into a real journey of healing and self reflection that I didn’t expect. \n\nI’ve been in therapy for years and have done a lot of work on myself. So, when I stopped drinking, it wasn’t like “well, shit, now I’ve got this huge mess to face and clean up” but it pulled back the covers on the things I was still numbing out to. It’s been empowering to look at things through a sober lens. It feels like I’m being truthful and accountable for the first time in a long time.\n\nI’m very interested in seeing how this experience continues to evolve - on all fronts - but especially the physical side. I believe my body is still recovering from the years of drinking poison and I’m very interested in how this healing will continue to evolve.\n\nThings that have helped me:\n1. Having a partner who is doing the sober thing too. (Not sure how people do this by themselves - I’m in awe of you and you inspire me.) I’m doing this for me but it helps to have someone going through it with you.\n\n2. Reading This Naked Mind was a huge shift in thinking that I needed at the beginning. I still go back to it and all the sections I highlighted when I need inspiration.\n\n3. NA drinks.\n\n4. Puzzles.\n\n5. Paying attention to my feelings and not judging them. I’ve been doing this for a long time through my work in therapy, but being sober has created such clarity and allowed me to hyper-focus on how I’m feeling and why.\n\n6. This subreddit community.\n\n7. Remembering what alcohol has done to people I know and love.\n\nI wish everyone out there the absolute best on your journey, no matter where it takes you. I will not drink with you today!",
            "score": 1,
            "replies": []
        },
        {
            "author": "godahi9660",
            "body": "✋️ Going well, it's getting better daily.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Thegirlwhothrifts69",
            "body": "I’m here from sober Jan! \nI started going to Pilates and yoga classes which I never felt good enough to attend, but they’ve been keeping me active. I am feeling my feelings now which is hard. What I mean by that I would use any excuse to drink. Fight with my husband = Drink. \nMy dog is sick = drink. Stressed out from work = drink. I say being sober sucks a lot but mostly cause it’s a dark inside joke to me. Other than that I feel really good I’m super proud of myself and mostly I like remembering things haha. \nI was a closest drinker so as soon as my kids would go to bed I would start drinking, I would wake up feeling irritable and tired. Now I wake up earlier than everyone rushing to get to a class. \nHappy you’re here! ❤️",
            "score": 1,
            "replies": []
        },
        {
            "author": "ckwolf1",
            "body": "Started January 1 as my Dr changed my meds and told me I shouldn’t drink for a few days while I get used to them. I’ve just kept going as I feel so much better, sleep better, mood better, relationships better. I’ve got a long history with alcohol misuse on and off. Wish I’d started the journey sooner but happy to be on it today. My only frustration is I’ve not lost any weight which is really odd. Maybe that will shift with a bit more time.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Glad_Day_3007",
            "body": "Yep",
            "score": 1,
            "replies": []
        },
        {
            "author": "LemonyFresh108",
            "body": "1/12/25 but California style ..",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kind-Humor-5420",
            "body": "Started two weeks before January but still here!",
            "score": 1,
            "replies": []
        },
        {
            "author": "GrimReaperMB",
            "body": "December 15th was my last drink. That was the first Christmas and New Years I  had been sober for in 25 years. It was difficult, but this year, it will feel normal.",
            "score": 1,
            "replies": []
        },
        {
            "author": "semperfi8286",
            "body": "😁",
            "score": 1,
            "replies": []
        },
        {
            "author": "poquitoborracha",
            "body": "12/28 💪🏼",
            "score": 1,
            "replies": []
        },
        {
            "author": "mrgndelvecchio",
            "body": "Still going since Dry January of last year 😊",
            "score": 1,
            "replies": []
        },
        {
            "author": "TxCoastal",
            "body": "me!    did the dry jan thing... and it's just carried over.....",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mitosis_Stages",
            "body": "My last drink was a little before Christmas. Best decision I have ever done in my life. It did come with its consequences as I am now dealing with PAWS. But with time, symptoms will subside. Keep up the good work!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Healer_21",
            "body": "12/24/24",
            "score": 1,
            "replies": []
        },
        {
            "author": "zenheadache",
            "body": "Day after thanksgiving and going strong. Felt good, with minimal cravings for a while but then started feeling a little restless. Started hitting up meetings in February and they’ve been helpful.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bubbly_Smile2848",
            "body": "Day 4 for me",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mandiwilcox",
            "body": "1/7/24 did dry January & still going strong.",
            "score": 1,
            "replies": []
        },
        {
            "author": "EnvironmentalYou2398",
            "body": "9/7/24 was my last drink and it was a terrible four loko. Don’t miss it",
            "score": 1,
            "replies": []
        },
        {
            "author": "MyEXTLiquidity",
            "body": "I drank a bit in February but did dry January. Congrats to you! I’m trying to get back on the dry wagon. But progress been made I’ve only had beers 11 days this year so far. Normally I could pound back 11 drinking days in 2 weeks.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fast_Freddy_Fact",
            "body": "Yes, like yourself, I started at Dry January, and it's been an interesting time. I have days where I feel I'm at one with the world, and then others when I find myself emotionally and mentally all over the place. So it's been an interesting journey so far.",
            "score": 1,
            "replies": []
        },
        {
            "author": "viciouschicken99",
            "body": "27th December here!",
            "score": 1,
            "replies": []
        },
        {
            "author": "FescueMerkin",
            "body": "12/10/2024 for me. It's been an awesome soon to be 3 months",
            "score": 1,
            "replies": []
        },
        {
            "author": "Willowwalking1",
            "body": "Stopped 12/19/24",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rflorkey",
            "body": "12/28/2024!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bright_Design966",
            "body": "Me! 95 days under my belt!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "TemporaryPumpkins",
            "body": "Me",
            "score": 1,
            "replies": []
        },
        {
            "author": "Live_Art3185",
            "body": "Same here! Thought I’d try for a week. Then another one. And now it’s 2 months! Feels really good. Many people on this thread probably have heard this but it was new to me:\n“Having none is easier than one”. \nAiming for 3 months now and then I will set another goal. Step by step….🙏🏼",
            "score": 1,
            "replies": []
        }
    ]
}