{
    "title": "Well, 50 Days",
    "author": "rliteraturesuperfan",
    "subreddit": "stopdrinking",
    "rank": 323,
    "score": 12,
    "upvote_ratio": 0.89,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j2y0nm/well_50_days/",
    "id": "1j2y0nm",
    "selftext": "Today is 50 days since I've had a drink. \n\nI've been toying with sobriety for a few years, using the Time Since app to just casually track how long I go between drinking. It's ebbed and flowed. I did Dry January last year, then was up and down the rest of the year, sometimes going a couple weeks between drinks, sometimes drinking a few times a week. \n\nI often feel shakey in my sobriety journey. Find myself downplaying it, thinking it's a little silly since I don't reaaally have a problem like other people I see on here. But during the past few weeks I've been feeling more clearheaded and doing more reflection on my life as a drinker. \n\nI remember my earliest memories with alcohol was when I first drank at around 15. I'd just entered high school, and older kids would tell stories about so and so being so funny when they drink, and I thought to myself 'you can become a different person? Sign me up.' I was so introverted and uncomfortable with myself, the draw of just drowning all of that anxiety out and escaping for a bit led me to frequently drinking to black out through high school and college.  \n\nLater the blackouts became less frequent, but the 'unwinding' after a long day at work with a six pack, or a couple glasses of whiskey replaced it. \n\nBut in the last couple of years I've gotten a lot healthier, lost weight, gotten really into running, and also gotten married. I'm happy and  comfortable in my life, and I've found that I want to be present for it. I want to be a great husband, friend, family member, and maybe at some point, father.\n\nSometimes it still feels silly. Unnecessary because I don't have a real problem, but ya know what? I don't feel like drinking right now, so I won't anyway. \n\nThank you to you all in this group, it's meant a lot to me on this journey. ",
    "comments": [
        {
            "author": "shineonme4ever",
            "body": "Well, That's AWESOME!  Congrats on 50 Days!          \n...and 19 more until your \"Nice\" Day!  Keep up the Great Work!",
            "score": 2,
            "replies": []
        },
        {
            "author": "sittingontheroofjust",
            "body": "congrats keep it up",
            "score": 1,
            "replies": []
        }
    ]
}