{
    "title": "54 days",
    "author": "kevin-kevinson",
    "subreddit": "stopdrinking",
    "rank": 336,
    "score": 8,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j2zibz/54_days/",
    "id": "1j2zibz",
    "selftext": "I (29M) am in a sharing mood today. In June I lost my mom. She was my favorite person in this whole world. I had already had a drinking problem but I let myself go off the deep end. I didn’t wanna be saved. Idk what possessed me to check myself into treatment. But today, I am almost two months sober and clean from any drugs. This is the longest I’ve gone without drinking since I was maybe 21. I feel so much better and tbh, idk how I got this far. The cravings have gone almost completely even though not entirely. I just choose not to drink. I’m far enough where I am trying to be conscientious about my sobriety but it’s no longer like I’m on autopilot. I miss my mom so much but I can’t keep letting the addiction win. \n\nTo anyone struggling, there’s no shame in going to treatment. Honestly I wish I would have sooner because believe it or not, those people are there for the same thing. There’s nothing to be worried about. Some of the most understanding and compassionate people I’ve ever met have been addicts.  \n\nOne thing I noticed was that it took about two to three weeks before I even started feeling “normal” again. The anxiety and restlessness and boredom get so bad, but you have to learn how to live with it and man it can be hard some days. I forgot what it was like to be so bored. It’s not just “quitting drinking”. It’s a genuine mindset shift that I personally needed treatment to help me realize. Just be ready for it to really suck at first. But just know it gets so much better and you look back and go “what the heck was I thinking?” \n\nHumans are very resilient but we’re not invincible. I truly wish for everyone that’s struggling with alcohol/substance abuse to have a wonderful life. Keep on fighting. ",
    "comments": [
        {
            "author": "mindbodysober",
            "body": "Losing a parent suuuuucks. She will live on trough you because of all that she gave you.\n\nI dove into the bottle after my mom's passing. I get it. What I didn't do is seek help. She passed 26 years ago. I'm at 54 days, too. \n\nYou are correct in stating that it's a complete change of a mindset. \n\nI'm happy that you are pushing forward and your words of encouragement are touching.\n\nPeace to you. 🙏❤️",
            "score": 2,
            "replies": [
                {
                    "author": "kevin-kevinson",
                    "body": "I’m sorry to hear you had to go through the same thing. It is something I don’t wish on anybody. 54 days is a big deal! I’m proud of myself and I’m cheering you on as well!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "mindbodysober",
                            "body": "It is an inevitable circumstance of life. Thanks for the encouragement.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}