{
    "title": "What were your hangovers like?",
    "author": "Dontslapmygoodies",
    "subreddit": "stopdrinking",
    "rank": 311,
    "score": 5,
    "upvote_ratio": 0.86,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j34i78/what_were_your_hangovers_like/",
    "id": "1j34i78",
    "selftext": "So I was just thinking about this. Started drinking at 16, clearly you never get hangovers when you’re young. \n\nThen in my mid to late 20’s. I was a puker, like face in the toilet, puking up bile, can’t hold anything down…..all day.\n\nBut when I got into my 30s, just straight up anxiety, heart pounding, and pounding headache. But no more barfing……\n\nI’m now 35.",
    "comments": [
        {
            "author": "Zeeman-401",
            "body": "Isn’t it crazy how if you ate some bad food and the next day puked all the way to bile stage you would just never want to eat the same food again? But with alcohol the brain says “ it’s ok to puke your guts out and then have the same poison later tonight!”",
            "score": 5,
            "replies": []
        },
        {
            "author": "Level-Canary-9712",
            "body": "I got hangovers even when I first started drinking at 14. Like puke bile all day hangovers. I just had more energy to deal with it I guess? I'd somehow stay up really late and be able to manage the next day, up until I was like 21 ish.\n\nThe past few years has turned into either: \n1. I magically don't get hungover (heavily dosing myself with gravol during and after drinking, drinking so much water I pee every 20 minutes, etc.)\n2. Continue drinking the next morning to avoid it\n3. Throwing up all day\n4. I literally am so hungover and exhausted I need to sleep until 2, 3, even 4 pm, then lay on the couch and go back to bed by 9. \n\nCrazy how much shit I've put my body through.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Vegetable_Cicada_444",
            "body": "Bad headache, nauseated, dry heaving bile, tons of anxiety.   \nSo glad I never have to do that ever again.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Fun-Abrocoma9848",
            "body": "Extreme anxiety and depleted dopamine",
            "score": 2,
            "replies": []
        },
        {
            "author": "apocalypsmeow",
            "body": "I never got hangovers when I was young - like, I used to get up and go to the gym at 5 am after drinking - and I've only been physically ill from hangovers a handful of times. But in the last year or so (~33) I started having wicked hangovers. Just puffy, bleary, scratchy throat, headaches, feeling awful. It was weirdly unpredictable too, like one night I'd drink 3+ bottles and be fine, the next I'd drink 2 and be a wreck.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ExistingClient9746",
            "body": "Complete exhaustion, brain fog, feeling gross, anxiety, replaying everything I said and did and feeling embarrassed… all I want is to fast forward to bedtime and skip to the next day",
            "score": 1,
            "replies": []
        },
        {
            "author": "DepartmentNo5846",
            "body": "Oh this is a good one! \n\n16-29: Drink 12 pints and sleep for an hour and go to work.\n\n30: Drink 3 pints, sleep for 2 days.",
            "score": 1,
            "replies": []
        }
    ]
}