{
    "title": "6 days !",
    "author": "OpportunityLess8110",
    "subreddit": "stopdrinking",
    "rank": 280,
    "score": 14,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j35qtb/6_days/",
    "id": "1j35qtb",
    "selftext": "6 days sober today. At the beginning of these 6 days I (21f) was literally thinking to myself I have no idea how I am supposed to make it through 24 hours without alcohol. I struggle with my mental health pretty bad as it is and as you can imagine alcohol intensifies it like crazy. 6 days ago I finally broke down to my mom & told her I need her help to not drink. I finally admitted I have a serious problem & told her I don't have the self control to casually have a drink. I have spent too many years binge drinking & using alcohol as an escape for it to be seen as anything positive for me personally. Yea I feel happy when I take that first drink & have had a lot of fun while drinking, but the good does not outweigh the bad. I take it way too far more often than not. I was good at making my drinking seem \"casual\", but anyone who has known me for some years knows it has been an issue. But even then the BIG mistakes were pretty spaced out so it was easier to make it seem like my drinking wasn't out if control. I have made MANY drunken mistakes. Probably spent more days drinking than not for a long while now. Anyway, my mom was understanding (she struggled with the same thing when i was growing up) & has been helping me. This isn't my first time trying to get sober, not even close, but these 6 days have seriously felt like eternity. I had been having a harder time mentally already so putting sober on top of that feels like hell, but i'm doing it. My mom hasn't really talked to me these past couple days because of how intense my depression has gotten & it is hard for her to deal with. I spiralled very quickly. I keep reminding myself how detrimental a drink would be right now. For me & everyone around me at this point. It's just not worth it. Drinking will never be worth it. Here's to almost making it to 1 week. IWNDWYT",
    "comments": [
        {
            "author": "Minimum-Holiday-7750",
            "body": "Well done on an amazing effort.\nKeep yourself busy with other things for me it's been exercising and cooking eating nice healthy food. You've got this keep up the good work. IWNDWYT",
            "score": 2,
            "replies": [
                {
                    "author": "OpportunityLess8110",
                    "body": "thank you :) i actually for the first time have gotten more interested in cooking healthy hearty dinners & getting daily physical exercise in! should be normal at my age, but was never a priority of mine lol",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}