{
    "title": "Feeling lost in life is making it more difficult to quit.",
    "author": "Solo_Lift",
    "subreddit": "stopdrinking",
    "rank": 319,
    "score": 2,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j37y15/feeling_lost_in_life_is_making_it_more_difficult/",
    "id": "1j37y15",
    "selftext": "I'm so lost in life and directionless... I never made plans for my future as I was growing up. I just played video games and sort of checked out of life. When I was younger I always planned on taking my own life when I was old enough to go along with my preferred method. I've just been working these manual labor warehouse jobs and it's finally catching up to me physically getting back and shoulder pain. I don't work enough hours to get benefits because I hate the job so much... I can't even bring myself to talk to coworkers I look sad and depressed all day at work... people have even told me so... I have such a hard time talking to people in person I always feel so anxious... I can't even bring myself to go more than a couple weeks till I fall back into drinking... I just don't know what to do anymore I feel like I'm nearing the end",
    "comments": [
        {
            "author": "Prevenient_grace",
            "body": "Sorry to hear about your experience.\n\nGlad you’re here.\n\nRather than ‘nearing the end’… you are standing right at the beginning!\n\nToday could mark the Start of a Virtuous Upward Spiral.\n\nI removed the alcohol, worked a plan and have everything today.  You can too.\n\nThere are free recovery groups everywhere…. And also online.\n\nI walked in, sat down, and listened.  There are no requirements.\n\nI found support, new sober friends…. Soon I was engaged in fun activities…. I’ve never looked back.\n\nTried anything like that?",
            "score": 3,
            "replies": []
        },
        {
            "author": "ErikDebogande",
            "body": "Ontological pain is a very real thing",
            "score": 1,
            "replies": []
        }
    ]
}