{
    "title": "The joy from quitting alcohol",
    "author": "Neversaidthatbefore",
    "subreddit": "stopdrinking",
    "rank": 216,
    "score": 38,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j38xuu/the_joy_from_quitting_alcohol/",
    "id": "1j38xuu",
    "selftext": "I love everything about it! It's hard to describe everything great that has come from putting down the bottle. I love being able to keep my word! Get things done! Even the tedious tasks don't bother me anymore. I can look at a big challenge and think, \"I got this.\" Anything can be done with taking one step at a time. And it's not a race either! I am only competing with myself. Actually, I think I do better, I think we all do better, when more of us are doing well. It helps us learn to see how others can do it in their own ways! So, don't be too shy! Share your stories, it can help others!",
    "comments": [
        {
            "author": "Any_Comedian_1055",
            "body": "Everything you said is true. I love that I've regained a propensity for action.\n\nI love that I am in control of my choices and can literally do ANYTHING I want except for that one thing. IWNDWYT.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Uphilldrop",
            "body": "These ideas are really great! It’s amazing how much clarity and motivation come from quitting. Keep going and telling other people about your trip. It could help them.",
            "score": 4,
            "replies": []
        },
        {
            "author": "notsofunnyjim",
            "body": "Stay strong 💪",
            "score": 3,
            "replies": []
        },
        {
            "author": "RealisticInspector69",
            "body": "Joy is exactly right... IWNDWYT 🌹🌹🌹",
            "score": 3,
            "replies": []
        },
        {
            "author": "Tough_Got_Going",
            "body": "I feel this way as well- 14 months in. The euphoria is real for me. I don’t think this can be called the pink cloud at this point. Just happy and powerful. \nIWNDWYT",
            "score": 2,
            "replies": []
        }
    ]
}