{
    "title": "It’s my birthday and day 1 again",
    "author": "Chubby313",
    "subreddit": "stopdrinking",
    "rank": 166,
    "score": 197,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 92,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j383x6/its_my_birthday_and_day_1_again/",
    "id": "1j383x6",
    "selftext": "I’m so angry with myself. I stopped drinking 30th September 2024, and made it alllll the way to 31st December. 94 days. I thought I was cured. I didn’t even think of alcohol anymore. Went to numerous parties over Christmas, birthdays, funerals, loads of occasions and ordered water with no issue. \nMy father in law gave me a beer New Year’s Eve, and I decided to drink it because ‘2025 will be a sober year, so here’s one last one’\nFast forward 2 months, I’ve gone straight back into my old ways. Drinking every day after work, hiding in the garden so my Mrs doesn’t see me downing the wine. \nThe health issues I previously fixed have come back. I feel unhealthy and look tired all the time. \nToday is my birthday, and when I set a date to quit, I find it helps so, I want my new age to be a sober one. My mother in law has bought me cans for my birthday, but I’ve already decided who I’m going to give them to in work. \nI need to stop drinking forever, but most importantly, I won’t drink today",
    "comments": [
        {
            "author": "bombinator5000",
            "body": "“Why do we fall master Bruce?”\n\n“So we can learn to pick ourselves up again”",
            "score": 56,
            "replies": [
                {
                    "author": "Chubby313",
                    "body": "This is a great perspective. Just wish I wasn’t so clumsy 😂",
                    "score": 16,
                    "replies": []
                },
                {
                    "author": "cacodoxyy",
                    "body": "This shit made me tear up.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "spearmint826",
                            "body": "Ooof. Same",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MountainLiving4us",
            "body": "Happy Birthday..",
            "score": 24,
            "replies": [
                {
                    "author": "Chubby313",
                    "body": "Thank you!",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "Excellent-Seesaw1335",
            "body": "Sometimes a relapse gives us more perspective. Years ago I thought I had it figured out and decided to drink in moderation after 9 months of sobriety. It turned into a 5-day bender and I left a wake of destruction in my path.\n\nIt was the wake up call I needed that the trajectory of my life is exponentially better when vodka does not enter my system.",
            "score": 23,
            "replies": [
                {
                    "author": "Chubby313",
                    "body": "Yeah I thought I nailed it last time, and didn’t think 1 drink would make me spiral. I even became a strong advocate against alcohol completely, helping my colleagues and friends with their habits. Congrats on such a huge number, I hope I can get there too, one day",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Excellent-Seesaw1335",
                            "body": "Just get through today and then worry about tomorrow, friend. They all add up. The number of my sober days is really just decisions made on individual days strung together.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Chubby313",
                                    "body": "One day at a time :)",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "lo__-l",
            "body": "Welcome back. IWNDWYT",
            "score": 11,
            "replies": [
                {
                    "author": "Chubby313",
                    "body": "IWNDWYT ☕️",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "andycairns",
            "body": "Happy birthday.  You done 94 days that's pretty great.  You got this.",
            "score": 11,
            "replies": []
        },
        {
            "author": "Bork60",
            "body": "Happy Birthday.   I stopped on my 60th birthday,  mid Covid.  I was curious to see if I could.  It lasted 300 days.  I retired at 61.  A ticket to drink all day long.  8 to 10 tall boys every day.  June 19th 2023 I had to stop for 30 days to get tests done.  I know where my doctor was going with it. I just never started again.  I had enough.  I never say I quit...just taking a break.  Works for me.",
            "score": 12,
            "replies": [
                {
                    "author": "Chubby313",
                    "body": "That’s incredible, well done to you!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "wizzkidsid",
            "body": "I quit for 4/5 years and thought I was cured, life was amazing. A year back on the booze and I'm downing wine at 6am... Started my new sober life a month ago. I'm never going back. Lessoned learned!",
            "score": 8,
            "replies": [
                {
                    "author": "Chubby313",
                    "body": "Sounds like we are very similar, f*** wine. Well done for getting back on the wagon!",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "fucktard1977",
            "body": "Happy Birthday! I feel the same way. Stayed straight for a minute but right back where I started.",
            "score": 5,
            "replies": [
                {
                    "author": "Chubby313",
                    "body": "Thank you! It’s easily done. We’ve quit before, we can quit again!",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Spare_Answer_601",
            "body": "Happy Birthday 🎂 Begin Again. IWNDWYT",
            "score": 6,
            "replies": [
                {
                    "author": "Chubby313",
                    "body": "Thank you!",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Spare_Answer_601",
                            "body": "Extra Candle this year to celebrate your sobriety! 🤩🌻😊",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ComplaintScary8730",
            "body": "It's crazy the power that poison has over us innit! Welcome back! And Happy Cake Day",
            "score": 6,
            "replies": [
                {
                    "author": "Chubby313",
                    "body": "Thanks! It is poison. Crazy how society view it to ‘have a good time’",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Global-Revolution-71",
            "body": "You might not ever be cured. It's a battle that could never end. But you have to have the perseverance. I believe in you.",
            "score": 4,
            "replies": [
                {
                    "author": "Chubby313",
                    "body": "Thanks! I’m starting to believe in myself too. What I achieved last year was something I thought I could never do. Now I’ve got a new target",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "rhinoclockrock",
            "body": "Sometimes we need to go back into things and check, so we can be sure. Know you know, and knowing is half the battle! 🌠 Happy re-birthday! IWNDWYT",
            "score": 4,
            "replies": [
                {
                    "author": "Chubby313",
                    "body": "Yeah, I’ve checked, and checked, and checked again! And now I’m 1000% sure I know!",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Calm_Raccoon_2866",
            "body": "Happy birthday! Even though I’ve struggled with addiction my entire life and knew logically I needed to quit, I had to have one more go to show me it wasn’t possible to drink like a normal person. \n\nNow, I have incorporated all the recommendations given to me by others who have been successfully sober for years - and it’s working. \n\nEverything happens in Gods time, as long as you don’t quit trying, you’re winning.",
            "score": 3,
            "replies": [
                {
                    "author": "kevinmbo",
                    "body": "imo there is no “normal” drinking. its a fantasy made up by alcoholics. i personally dont know any “normal” drinkers who appropriately drink and enjoy exactly two beers during socially appropriate events/activities and then forget about alcohol until the next appropriate occasion. people either excessively drink xxx beers or slowly sip one just to fit into the crowd. could just be my unique experience but for the most part what i see is people like to drink and drink too much or ultimately really dont like to drink and slowly do so less and less.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Chubby313",
                            "body": "What I noticed when I first gave up, was a lot of my friends and colleagues would say “what, you haven’t had a drink in 2 weeks? I could never do that” and it became apparent quite quickly how most people I know have an issue with alcohol, but at different levels",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Major_Smudges",
                            "body": "Yeah, you are bang on the money here. Show me a 'normal' drinker and I'll show you someone who really doesn't like it all that much in the first place.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Chubby313",
                    "body": "Congrats on 202 days! Something I’m hoping to achieve one day! I like reading, and watching podcasts on other peoples stories. Can learn a lot and see things from a different angle which I hadn’t thought of before",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Calm_Raccoon_2866",
                            "body": "Thanks! I attend AA meetings regularly. I have a temporary sponsor but am looking for a permanent one to start going through the steps. If I feel this good already, I can’t wait to see what happens when God removes all my emotional baggage!",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Chubby313",
                                    "body": "Ah cool, how do you find AA working for you? It’s something I don’t think I could do, mainly because of my job.. I live in a town where everyone knows everyone and everyone knows what I do coz they see the uniform. However I am looking into private counselling/therapy to see if that helps with my self destruction!",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Tank-Pilot74",
                                            "body": "Welcome back to the best journey! Proud of you for recognizing the error of your ways! I can’t recommend therapy enough… it is one tool in my box that helps immensely imo! May I suggest AA online if you feel the need for incognito mode?! I found virtual meetings to be a godsend in the beginning. IWNDWYT!",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Chubby313",
                                                    "body": "Thank you and I’m glad you’ve found some great tools that work! I will look into the online AA, that’s a good idea!",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Calm_Raccoon_2866",
                                            "body": "AA for me is really helpful because I see others who’ve been successful in the program. The concept of surrendering my will and just doing what’s right just works for me, and the group keeps me accountable. AA is completely anonymous, so if anyone sees you in a meeting, they don’t gossip (in my experience), but online meetings may be a good place to start!",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Beautiful-Middle-193",
            "body": "Happy birthday!! 🎂🎁 \n\nI think that alcohol deserves your anger, not yourself.!\n\nScrew alcohol!\n\nIWNDWYT ☠️ 🥊",
            "score": 4,
            "replies": [
                {
                    "author": "Chubby313",
                    "body": "Thank you! IWNDWYT 🥊",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "calvinmacisaak",
            "body": "Happy birthday! Today is always a good day to start. I’m on day one as well. IWNDWYT",
            "score": 4,
            "replies": [
                {
                    "author": "Chubby313",
                    "body": "Here we go! We got this",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "KindaKrayz222",
            "body": "IWNDWYT",
            "score": 3,
            "replies": [
                {
                    "author": "Chubby313",
                    "body": "IWNDWYT",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Own_Spring1504",
            "body": "Happy birthday! Great decision and you know you can do it",
            "score": 3,
            "replies": []
        },
        {
            "author": "Tick0r",
            "body": "Happy birthday and welcome back, IWNDWYT.",
            "score": 3,
            "replies": [
                {
                    "author": "Chubby313",
                    "body": "Thank you, IWNDWYT",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "cornfl8kgrl",
            "body": "happy birthday! give yourself the gift of forgiveness and start anew. IWNDWYT!",
            "score": 2,
            "replies": [
                {
                    "author": "Chubby313",
                    "body": "Thanks! IWNDWYT",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Killah_Kyla",
            "body": "It's hard to find someone in recovery who hasn't relapsed. Recovery isn't linear and nobody's perfect. Happy birthday to you and think of those 92 days and how much better you felt. You can do it again!",
            "score": 2,
            "replies": [
                {
                    "author": "Chubby313",
                    "body": "Thank you! I’m even more determined than I felt on 30th September, I got a new high score to beat",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "TrashPandaPoo",
            "body": "Happy Birthday! Done similar myself and was back on day 1 for my birthday too!\n\nI didn't appreciate the advice of this not being a linear process but it's completely correct and I have learnt more about myself so I'm appreciating the positives and trying not to be too bothered by the number on my counter.",
            "score": 2,
            "replies": [
                {
                    "author": "Chubby313",
                    "body": "Happy birthday for last week! Let’s have a good healthy new age 😊",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "randomuser8479373",
            "body": "Happy birthday! It's just a hiccup. Brush it off and keep going 💪",
            "score": 2,
            "replies": [
                {
                    "author": "Chubby313",
                    "body": "Thank you! Brushed off and ready",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Alkoholfrei22605",
            "body": "Welcome back! Happy birthday! IWNDWYT",
            "score": 2,
            "replies": [
                {
                    "author": "Chubby313",
                    "body": "Thank you! :)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "OkComplaint2791",
            "body": "This happened to me so many times. That devil on our shoulder always tries to talk us into drinking.\n\nIn the end it is never worth it.\n\nHappy birthday and you got this!",
            "score": 2,
            "replies": [
                {
                    "author": "Chubby313",
                    "body": "Thank you! Ive read a lot about people experiencing the voice in the head/ devil on the shoulder trying to convince you. At one point I learnt to control it and tell it to f*** off when it started creeping in. Crazy really when you think about it!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Tshlavka",
            "body": "Best Birthday gift you could give yourself! Welcome back and Happy Birthday 🎁",
            "score": 2,
            "replies": [
                {
                    "author": "Chubby313",
                    "body": "Thank you! :)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "solace_seeker1964",
            "body": "\"I thought I was cured.\"\n\nNever \"cured\" of that alien monster, just reprieved for a day, as they say.  \n\n[https://www.google.com/search?q=independence+day+movie+no+peace&oq=independence+day+movie+%22no+%3Beace&gs\\_lcrp=EgZjaHJvbWUqCAgBEAAYFhgeMgYIABBFGDkyCAgBEAAYFhgeMg0IAhAAGIYDGIAEGIoFMg0IAxAAGIYDGIAEGIoFMg0IBBAAGIYDGIAEGIoFMgcIBRAAGO8FMgcIBhAAGO8FMgcIBxAAGO8FMgoICBAAGIAEGKIE0gEJMTI1MzNqMGo3qAIAsAIA&sourceid=chrome&ie=UTF-8#fpstate=ive&vld=cid:59e0d1e3,vid:RsUscVoZcMQ,st:0](https://www.google.com/search?q=independence+day+movie+no+peace&oq=independence+day+movie+%22no+%3Beace&gs_lcrp=EgZjaHJvbWUqCAgBEAAYFhgeMgYIABBFGDkyCAgBEAAYFhgeMg0IAhAAGIYDGIAEGIoFMg0IAxAAGIYDGIAEGIoFMg0IBBAAGIYDGIAEGIoFMgcIBRAAGO8FMgcIBhAAGO8FMgcIBxAAGO8FMgoICBAAGIAEGKIE0gEJMTI1MzNqMGo3qAIAsAIA&sourceid=chrome&ie=UTF-8#fpstate=ive&vld=cid:59e0d1e3,vid:RsUscVoZcMQ,st:0)\n\nThe monster's BEST trick, btw, is making us think he's gone away for good.\n\nNo matter how far along the recovery road we are, we are all the same distance from the ditch.\n\nLove.",
            "score": 2,
            "replies": []
        },
        {
            "author": "NetStrong1308",
            "body": "Happy birthday OP. I love that your birthday is your quit date! What an awesome birthday gift to yourself. Best wishes both on your birthday and on your new sobriety journey",
            "score": 2,
            "replies": [
                {
                    "author": "Chubby313",
                    "body": "Thank you :)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "LynchMob187",
            "body": "Happy Birthday!",
            "score": 2,
            "replies": [
                {
                    "author": "Chubby313",
                    "body": "Thank you :)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Paulgasmm",
            "body": "It was really helpful for me to tell my friends and family that I quit. It was awkward but that way they knew not to give or offer anything to me. Helps a ton those first few months when the self control needs all the help it can get.\n\nIWNDWYT!",
            "score": 2,
            "replies": [
                {
                    "author": "Chubby313",
                    "body": "I have always been open to friends and family… my in-laws just don’t quite ‘get it’, they’re old school (father in law goes to a working man’s club after work for a couple pints etc). I managed to say no to them a lot last time, it was my fault for giving in on New Year’s Eve. Lesson learnt!",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Paulgasmm",
                            "body": "Yeah I've had my fair share of people who didn't really get it, I hope they learn to understand and I hope you're proud of yourself for taking this moment to learn this lesson. Last time I decided to quit drinking someone offered me a drink and I IMMEDIATELY accepted it haha goofy brain just lookin for a reason. You got this!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Intelligent-Bug-531",
            "body": "Happy double birthday. It will be so rewarding rereading this post next year!",
            "score": 2,
            "replies": [
                {
                    "author": "Chubby313",
                    "body": "Thank you!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dazzling-Research-53",
            "body": "don't judge yourself based on the times you stumble, because you will stumble (everyone does).  Focus on your reaction to those struggles instead.  Each one of my relapses offered a valuable, if not painful, lesson.\n\n  \nedit: happy birthday!",
            "score": 2,
            "replies": [
                {
                    "author": "Chubby313",
                    "body": "Thank you! That’s a great outlook to have! My health and finances have always been my focus. Rejoined a gym I’ve not gone to for 5 years today (and paid for the next 6 months so that’ll give me motivation to go)",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Dazzling-Research-53",
                            "body": "nice.  I just joined a gym as well.  I'm 47 and haven't been inside a gym since 17, so this is not the easiest thing in the world but after just 2 weeks I'm noticing positive changes in mood.  It helps, keep up the good work!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Hopeful-Charge-3382",
            "body": "Moderation, what is that? I tried moderation but I just wanted to drink until I was good and drunk, who only drinks two beer, who only has 1 shot of vodka, who only drinks once a week? I could never understand these people, like why drink at all? Get drunk or get off the pot. This is my third sobriety in 8 years, first 2 tried to moderate, Lololol went straight back to chronic drinking.\n\nI am an alcoholic, I can never drink again, EVER, the Truth will set you free.\n\nTake care, I hope you make it, you must be loved by many.  \n  \nIt's easier to keep a tiger in a cage than on a leash",
            "score": 2,
            "replies": []
        },
        {
            "author": "whaletacochamp",
            "body": "Might be helpful to be explicitly clear with your in laws that you’re done drinking",
            "score": 2,
            "replies": []
        },
        {
            "author": "nauraug",
            "body": "Don't beat yourself up! There are very, very few people who succeed in quitting their first attempt. I sure as hell didn't. \n\nWhat I would recommend is mentally buckling up for the long haul. I definitely had moments early on where I thought that if I went a few months, I'd be \"cured,\" too. Much to my own cost (and the cost of others), I was so utterly wrong on that. Once I solemnly accepted that there was no time in which I could ever drink again, that this was going to be my reality until the end, it stuck. You got this. IWNDWYT!",
            "score": 2,
            "replies": []
        },
        {
            "author": "benjaminbuttlicker",
            "body": "Happy birthday! The greatest gift you can give yourself is sobriety! Iwndwyt ❤️",
            "score": 2,
            "replies": []
        },
        {
            "author": "grackleATX",
            "body": "Happy Birthday! IWNDWy’allT!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Naive_Line_8086",
            "body": "What health issues do you have from it",
            "score": 1,
            "replies": [
                {
                    "author": "Chubby313",
                    "body": "Enlarged liver causing pain on my right side, very high cholesterol, levels of fat running through my blood has spiked, and blood pressure through the roof. All of this I managed to get down to normal range during my sober stint, which are now back up again",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Naive_Line_8086",
                            "body": "How much do you drink per week if you don't mind me asking",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Chubby313",
                                    "body": "1x750ml bottle of 11% wine and 1x660ml 8.8% cider a night. Around 6pm, I’d tell the Mrs I’m going for a cigarette in the garden, go out there and drink both bottles before finishing my cigarette. Go inside to watch tv and then bed for 9pm",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Naive_Line_8086",
                                            "body": "Yikes, doesn't sound like that much",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Chubby313",
                                                    "body": "To be honest I think it’s a big amount to consume within 5 minutes every day, instead of it lasting a few hours lol must be a strain on the liver to receive so much in so little time",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Naive_Line_8086",
                                                            "body": "Oh right, so you drank it down quickly ?",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "author": "Chubby313",
                                                                    "body": "Yeah in the time I finished my cigarette , both bottles would be gone 🙈 so within 5 minutes I’d down them",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Naive_Line_8086",
                                                                            "body": "Lol how could you drink a bottle of wine that fast",
                                                                            "score": -1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "DarthDarklorD",
            "body": "Happy Belated!\nIWNDWYT!\n\nI ended an 8 day streak Sunday, with my Mom and her husband. (They have since been informed of my quitting)\nI asked for rum weeks ago as a souvenir from St. Martin. They delivered while I was on the wagon.\nSo not to be ungrateful I had a shot and a few nips of some other liquors. Didn't go HAM or anything.\nMonday I was craving Beer, thank god for NA Michelob.\nI'll ask for Tea next time.\nGave the rest of the bottle to a guy at work \nLet's do this, together. 🤝",
            "score": 1,
            "replies": [
                {
                    "author": "Chubby313",
                    "body": "Fair play that’s a great achievement to give something like that away! My whole family are drinkers so alcohol is always a present. No one has bought me any this year apart from my mother in law, she means well but I don’t think she understands addiction, she said ‘you don’t have to drink it now, but just keep it on the fridge for when you do fancy it’ lol bless her",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}