{
    "title": "Newly sober",
    "author": "Majestic-Inspector71",
    "subreddit": "stopdrinking",
    "rank": 245,
    "score": 10,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 15,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j3by9s/newly_sober/",
    "id": "1j3by9s",
    "selftext": "Is it odd or doing too much to set milestones for myself to celebrate? Like a week, a month 90 days etc and have a planned mini celebration for those dates to look forward to?\n\nI think it would help my motivation. I’m currently 2 days sober and would like to find a way to keep moving forward.\n\nThoughts?",
    "comments": [
        {
            "author": "DarkPasta",
            "body": "I'm all for it. Planning on giving myself a treat when I reach 1000 days",
            "score": 8,
            "replies": []
        },
        {
            "author": "Soberdot",
            "body": "I celebrate everyday! Check out the I Am Sober app",
            "score": 3,
            "replies": [
                {
                    "author": "yougococo",
                    "body": "I just started using this app and love it.  It got me through a pretty strong craving yesterday.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Soberdot",
                            "body": "In my very early recovery days I would open the app at 9:50pm and watch the seconds add up until an other day hit at 10pm. I did this most nights for god knows how many days.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Slipacre",
            "body": "Milestones are fine, but gotta avoid thinking of them like a finish line, this is a lifestyle change - at least as I see it.   \n\nHave you considered finding a sober community like Smart or AA.  I found it very helpful.",
            "score": 2,
            "replies": [
                {
                    "author": "Majestic-Inspector71",
                    "body": "I’ve never heard of smart but I don’t like AA in the area I live in",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "CartographerSuper423",
            "body": "It's your journey!  Do what motivates you and makes you happy!",
            "score": 2,
            "replies": []
        },
        {
            "author": "swift_justice91",
            "body": "There is really no \"wrong\" way to go about this as long as you're not drinking! Celebrate every single day as a milestone if you want! As long as you don't reward yourself with alcohol, more positivity is a great thing.  \nSome people will even set rewards, like buying themselves a thing they always wanted from the money they would have otherwise spent drinking. Whatever keeps you motivated is allowed. There is really only the one rule: IWNDWYT  \nGood luck!\n\nEdit: typos",
            "score": 2,
            "replies": []
        },
        {
            "author": "pepperbiscuit",
            "body": "Why not? Every day sober is a celebration. Eventually it will be your lifestyle and you won’t be thinking about it as much every day. Anything that helps you remain sober is worth doing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MoumouMachine",
            "body": "I use the money saved by sobriety for my hobbies now that I can enjoy life again.",
            "score": 1,
            "replies": []
        },
        {
            "author": "iamahill",
            "body": "The only concern I see is milestones becoming too much artificial pressure at a certain point. It also makes a slip up more painful. \n\nI kept personal track but not publicly.",
            "score": 1,
            "replies": [
                {
                    "author": "Majestic-Inspector71",
                    "body": "I was thinking of having the “smaller” mile stones be with my partner and the bigger ones (6 months) be with family that are sober. Waiting for everyone to do a year celebration",
                    "score": 1,
                    "replies": [
                        {
                            "author": "iamahill",
                            "body": "That’s not quite my personal style because emphasis creates said pressure and basically everyone lapses eventually and that’s perfectly normal. \n\nThey said, I’m sure you will figure out what works for you. Maybe celebrating milestones works best. Many do it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}