{
    "title": "Realizing who your friends really are when you get sober! Mostly me complaining srry",
    "author": "SpareCatxoxo",
    "subreddit": "stopdrinking",
    "rank": 233,
    "score": 11,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j3cwtk/realizing_who_your_friends_really_are_when_you/",
    "id": "1j3cwtk",
    "selftext": "So i up and quit my bar job that i have been at more then 40 hrs a week for 2 years and not one single person has seen what happen or where i went. or like even my regulars lol  I thought i was pretty close to alot of them and  I didn't tell anyone but my boss and he wouldn't say anything to anyone so to my knowledge no one has any idea what happen to me and again not one single person has reached out to check.... iv been off social media and everything for a week and nothing. lol if i went missing the only people who would notice would be my kids and husband. tf ..\n\nLike thinking about it ....all the stuff iv had an abusive partner who still bugs me to this day and they know and i have 2 kids and then i dont show up to work.. personally i would check in on someone day 2 if i hadn't heard anything if that was someone else's situation. Kinda pisses me off actually !!!!! Totally understand not everything is about me but like we check up on people we claim to care about . \n\nSo today is the day i see that i never actually had friends at this place or the people who came to see me everyday weren't coming to see me at all. I have to put my big girl pants on and remember that sobriety can be fucking lonely. But positive side im sober another day and at least i get to be with the ones who really love me and deserve my time . no more pointless relationships.",
    "comments": [
        {
            "author": "None",
            "body": "Yeah, honestly it's easy to create a lot of friends with a party mindset or even a work comraderie. A lot of alcoholics are incapable of being social outside of social settings including alcohol. It's kinds of like we all just want to relate, the bar is full of a bunch of people who do relate!\n\nIt's a good thing imo, you are seeing that it's not real. My friend is stuck in the same loop, bar to socialize, get drunk, repeat. He is even thinking about buying the bar he frequents now, and I told him: you know you will be an alcoholic forever if you do that right? He straight up told me yes.\n\nOnce the drink stops flowing, the people you drank with will turn into different people. Think of bar friendships like work friendships. Once you leave work, it tends to fizzle out. Not always, but a lot. I'm sorry you're realizing this though, I'm sure it is a hard mental transfer.",
            "score": 5,
            "replies": []
        },
        {
            "author": "full_bl33d",
            "body": "I’m still waiting on the get well cards from everyone at the bar and I’m still waiting on all the apology letters too. I don’t think they’re coming. But I think that’s a good thing because I don’t need to seek support from broken furniture and sobriety is teaching me that I don’t need anyone to act a certain way for me to be ok either. I found there are real people in real life who know what this is like and are more than willing to help so long as I’m willing to show up. Many of the alcoholics in recovery that I’ve met after I stopped drinking know me better than most of the people I’ve known my whole life. Many of them are parents like I am and we check up on each other. The culture around parenting and drinking in my neck of the woods is absolutely bonkers but I don’t have to feel like I’m on an island. It’s important to me so I work on it. I can’t make the argument that I don’t have time to get involved in my own sobriety, but I tried. When I sat down and did the math I found that I spent an astronomical amount of time, money and energy is planning, drinking, hiding the effects, disposing the evidence and being laid up hungover. I know I got some time for this.\n\nSad to say, but not really, I don’t miss my old drinking crew. I didn’t have to cut them out of my life completely but I’m allowed to have boundaries and I don’t feel like sitting at the bar and waiting for  my turn to shout about what toys I thought were cool when I was little or why my last vacation was the best ever recorded. I don’t have to get into what I’m doing to take better care of myself and it honestly never comes up. I’m not chained to a bottle anymore so I’ll see if / when I see em. I’m not holding space for that anymore and I don’t have to do any of it alone because I’m not alone. Neither are you",
            "score": 3,
            "replies": []
        },
        {
            "author": "sobermethod",
            "body": "Unfortunately that is how it goes sometimes. We find that people we believed we were closed to, in addiction, aren't people who care or share any interest in our wellbeing when we are sober. \n\nAs upsetting as it is, try to look at it from the lens of 'now you can focus on building up meaningful connections with people in your life who value your wellbeing and your relationship'. \n\nKeep up your great efforts in your sobriety! You can do this!",
            "score": 3,
            "replies": []
        },
        {
            "author": "Vivid-Discount-1221",
            "body": "I say this to people all the time who don’t want to quit their bartending job because “they love their co workers blah blah blah” the day you leave you’ll never hear from them again. Quitting bartending was the best thing I ever did, I wish I quit a lot earlier",
            "score": 2,
            "replies": [
                {
                    "author": "SpareCatxoxo",
                    "body": "I am alot happier with my choice now that i understand they were not real friends just another bunch of liquored up people who want to just party with anyone who's willing.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}