{
    "title": "Disappointed with myself. Such a long and good streak and I ruined it for no really great reason.",
    "author": "BLam03",
    "subreddit": "stopdrinking",
    "rank": 226,
    "score": 13,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 15,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j3de4l/disappointed_with_myself_such_a_long_and_good/",
    "id": "1j3de4l",
    "selftext": "Yesterday was my birthday. I have one year old twins and a ten year old daughter with my husband. I woke up feeling pretty okay. It was a Monday so my husband went to work, dropped our daughter off at school for me and I stayed home with the twins. I honestly don't know why it hit me, but I decided to pour myself a hot cocoa with peppermint schnapps because, hey, it's my birthday and I've done really awesome for years now. What a dumb ass thing to break a streak for. After one came two and then I began to reflect on how absolutely exhausting it is to not have any friends or family around to see, let alone, help me with the twins from time to time. Those pesky relaxing drinks turned into a full on dive into resentment and a pity party fast. I hate to say that I got buzzed. My husband came home and was obviously mad at me. I did my usual deny and deflect. Why? It's so stupid. I didn't have to ruin my own birthday for no good reason. Now I have lost trust and I am so disappointed in myself.",
    "comments": [
        {
            "author": "Okie_Dokie_777",
            "body": "I’ve been there. Many of us here have. I’m so sorry. It’s disappointing and disheartening. But be kind to yourself. One day, one slip - doesn’t define you. Happy birthday 💞",
            "score": 9,
            "replies": [
                {
                    "author": "BLam03",
                    "body": "Thank you so much 😊",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dull_Count_1963",
            "body": "Been there. Don’t get obsessed with the number. You’ve learned a lot and you’re healthier than if you weren’t trying. Just start over and keep your head up. But remember what this taught you. ❤️🙏",
            "score": 7,
            "replies": []
        },
        {
            "author": "DoqHolliday",
            "body": "What do we say to death?\n\nNot today…\n\nSending love and hope and good wishes. Getting a post up and getting right back in the saddle is the next best thing. You still did YEARS girl. Be proud of that, forgiving of yourself, and better prepared for the future.\n\nIWNDWYT\n\n💙🫂",
            "score": 3,
            "replies": [
                {
                    "author": "BLam03",
                    "body": "Thank you! Iwndwyt",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "GenevieveSapha",
            "body": "Naaawwww so sorry Sweetie... 😪 It's not the end of the world though. So you had a wee slip-up... forgive yourself and carry-on.\n\n\nOn a more cheerful note...\n\n#HAPPY BIRTHDAY... \n\n🫂 🩷",
            "score": 4,
            "replies": [
                {
                    "author": "BLam03",
                    "body": "Thank you 😊",
                    "score": 2,
                    "replies": [
                        {
                            "author": "GenevieveSapha",
                            "body": "Yw... 😊",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "LuckyDuckTheDuck",
            "body": "I had a new thought yesterday that might help you. My Wagon doesn’t have a rear view mirror. I can only control and see where I’m going and not where I came. Focus on the road ahead and not how you got here.",
            "score": 3,
            "replies": []
        },
        {
            "author": "suilbup",
            "body": "This doesn’t have to be any more than just a bad day.    Consider yourself fortunate that you’re recognizing it as a mistake after just a day and you don’t have to spend months hiding it while you dig a deeper and deeper hole to climb out of. \n\nGodspeed, my friend.",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "My disappointment in my behavior is always elevated when someone else sees it or I’m feeling “caught.”  I’ve overspent this month and while I cannot take it back, I am choosing to actually use the serenity prayer that helps me so much.  Accepting what I did, I can’t change it, let’s move forward with better education and keeping track of spending habits.  That’s a good way for me to change my behavior and it works for me most of the time.  It’s worked with booze.  I simply won’t beat myself up, and I hope you didn’t either.  Consuming that much sugar will put ya me in a bad mood the next day anyways.  I’m trying to say, thank you for sharing, please come back and it’s always good to talk it out.  No one deserves to sit and wallow over the past that is fixable. Edit: happy birthday 🎁",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "Setbacks are a part of the journey, unfortunately. I would try to reframe your mindset into thinking more like this: \"I made a mistake, I learned from it, next time I won't make that mistake.\" It's easier to build your mind around growth if you just accept your mistakes. Of course, hold yourself accountable still, but I wouldn't be so hard on yourself. You are in fact doing great. Alcohol is a depressant, so it tends to do the pity party thing in our heads.\n\nThat being said, gosh twins alone would be so hard. I'm sure that's tough. I would perhaps try talking to your husband for some breaks from time to time, if at all possible. Even 30 minutes to yourself is a blessing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MyEXTLiquidity",
            "body": "Happy belated birthday! We all fail from time to time ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Beautiful-Middle-193",
            "body": "Resentment always seems to sneak up on me when I’m not getting enough time for myself. \n\nNot to mention at that age your twins must be EXHAUSTING!! even if they are cute :) my youngest is also small and my god, sometimes I wish I had even a dentist appointment to go out alone lol.\n\nTry not to punish yourself too much for one bad day out of over 1500 ♥️ \n\nHappy birthday 🎂 and IWNDWYT",
            "score": 1,
            "replies": []
        },
        {
            "author": "realitybites95",
            "body": "Birthdays are hard, and I get why you kinda wanted to escape for a minute. don’t beat yourself up. I cry on my bday every year.",
            "score": 1,
            "replies": []
        }
    ]
}