{
    "title": "It took 14 days",
    "author": "Horton213",
    "subreddit": "stopdrinking",
    "rank": 49,
    "score": 207,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 30,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j3s1qt/it_took_14_days/",
    "id": "1j3s1qt",
    "selftext": "For my stomach to not hurt.  For my poop to be solid.   For my digestion to be normal and for my asshole not to ache.. For me to not feel like I have stomach cancer..  Hang in there sobernauts ",
    "comments": [
        {
            "author": "PossessionOk8988",
            "body": "When my gut and butt felt better, I felt better hahaha.",
            "score": 40,
            "replies": [
                {
                    "author": "Horton213",
                    "body": "Totally.  I was so miserable",
                    "score": 14,
                    "replies": []
                }
            ]
        },
        {
            "author": "SomeOneOverHereNow",
            "body": "Woo hoo!  Normal crap!  One of the best side-perks of not drinking.  :)  Congrats!",
            "score": 15,
            "replies": []
        },
        {
            "author": "3HisthebestH",
            "body": "I quit at the start of the month and was looking forward to THIS the most. Literally the second day sober I got norovirus from my toddler and it’s been a few days of misery in the bathroom. \n\nAlmost over it though and looking forward to sober life and getting out of this hole I’ve been in.",
            "score": 15,
            "replies": [
                {
                    "author": "Horton213",
                    "body": "Well done",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "cutecreep_92",
            "body": "Taking a multivitamin every morning really helps my body regulate itself, but especially after quitting, or a relapse (because let's face it, I've had it happen a couple of times to varying degrees). Alcohol depletes our body of sooo much nutrients, more than just dehydration or blood sugar, but much more than we realize. I recommend implementing a vitamin into your routine for a little while as well as it can make a hell of a difference, but it sounds like either way it's onwards and upwards and I'm glad you're feeling better! IWNDWYT! 🤍",
            "score": 10,
            "replies": [
                {
                    "author": "Been1LongDay",
                    "body": "Yea definitely agree. I take a vitamin B men's gummy twice a day. It has all the different B vitamins plus some other stuff. But also a potassium and magnesium several times a week. I may not need that as much anymore but alcohol sucks the potassium and magnesium right outta you. That can get kinda dangerous",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Spare_Answer_601",
            "body": "Yay. IWNDWYT",
            "score": 8,
            "replies": []
        },
        {
            "author": "DoqHolliday",
            "body": "Isn’t that a great river to cross? Onwards and upwards!",
            "score": 7,
            "replies": [
                {
                    "author": "Horton213",
                    "body": "Absolutely",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "bigbubsworld",
            "body": "This strangely is really good motivation for me right now haha",
            "score": 5,
            "replies": [
                {
                    "author": "Horton213",
                    "body": "Good!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Local-Ad-4587",
            "body": "I can very much relate. Still paranoid of every little sensation or pain. But I feel much better. IWNDWYT!",
            "score": 5,
            "replies": [
                {
                    "author": "Horton213",
                    "body": "Ya I was getting weird pain and aches everywhere",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "katemm13",
            "body": "Add some metamucil in there too youll feel like a brand new person",
            "score": 3,
            "replies": [
                {
                    "author": "Horton213",
                    "body": "Yep got some. Just need to be consistent with it",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Greedy-Ad-2441",
            "body": "🫶🏼🫶🏼🫶🏼",
            "score": 3,
            "replies": []
        },
        {
            "author": "sallybear1975",
            "body": "I’m still announcing my perfect poops 💩🤣🤣\n\nIWNDWYT",
            "score": 3,
            "replies": []
        },
        {
            "author": "rua04cma",
            "body": "I keep reading 14 days for the physical effects and 21 days for the mental effects to even start to dissipate and improve. \n\nPatience is a virtue. \n\nIWNDWYT",
            "score": 3,
            "replies": []
        },
        {
            "author": "bigpeteontheweb",
            "body": "i'm 57 days today and i clog my toilet way more frequently. insane to think pissing water out of my ass every morning was normal for so long",
            "score": 3,
            "replies": []
        },
        {
            "author": "Azreel777",
            "body": "Amazing how long I accepted explosive shits and blamed it on some food I ate.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Been1LongDay",
            "body": "It took me about that same amount of time and man what a relief it is. In more ways than one I guess. After 10 days I started seeing some improvement but 2 weeks made a huge difference",
            "score": 2,
            "replies": []
        },
        {
            "author": "est1984_",
            "body": "IWNDWYT <3",
            "score": 1,
            "replies": []
        },
        {
            "author": "ComplaintScary8730",
            "body": "Yup, I'm still in the hole here, can't wait for the benefits to appear... Holding strong with all yous!",
            "score": 1,
            "replies": []
        },
        {
            "author": "whyisthissohard14",
            "body": "Awesome",
            "score": 1,
            "replies": []
        },
        {
            "author": "Awkward_Turnover_133",
            "body": "Congrats! The body's capacity to heal itself is amazing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "seatstaking",
            "body": "So this is true? I quit probably 10 days ago and my stomach is destroyed. I did not feel anything wrong until yesterday though? Is that normal?",
            "score": 1,
            "replies": [
                {
                    "author": "Horton213",
                    "body": "Ya give it 2-3 weeks.. Eat plain and healthy.. Lots of water.. It will get better",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "gslayton82",
            "body": "It's been a long time, but 14 days sounds about right. By the end of the 3rd day you feel the obsession much less. For everything else, you feel like you're on stable ground 2 weeks later.\n\nGood work",
            "score": 1,
            "replies": []
        }
    ]
}