{
    "title": "I Hate Blood Draws",
    "author": "NeedingSupport1987",
    "subreddit": "stopdrinking",
    "rank": 127,
    "score": 22,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 11,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j3uxc8/i_hate_blood_draws/",
    "id": "1j3uxc8",
    "selftext": "Despite hating blood draws, I was actually excited to get my blood drawn today. It's been 4 months without alcohol and my numbers were abysmal before, basically on the verge of a heart attack. \n\nMy AST and ALT were both pushing 100. My AST is now 39 and ALT 45. \n\nAnd my vitamins that basically didn't exist are now all in the green. Oh, and I've lost 50lbs between cutting alcohol, a diet change, and light exercise. \n\nThis is my friendly reminder to myself that I was down but not out. If you're thinking it's too late for you, it's not. \n\nIWNDWYT! \n\n",
    "comments": [
        {
            "author": "Icy_Pin_6999",
            "body": "Holy that’s amazing 🥹🩷",
            "score": 4,
            "replies": [
                {
                    "author": "NeedingSupport1987",
                    "body": "I was so scared checking my results. I didn’t realize at first I only had the first set of tests and those looked good. I went to check the second and saw no progress and was super disappointed…then I realized they were the old results. \n\nWhen it was updated, I literally did a happy dance. I’m so glad I’ve made the choice to focus on my health. ",
                    "score": 6,
                    "replies": [
                        {
                            "author": "Icy_Pin_6999",
                            "body": "I know that had to be a wonderful surprise! I’m so happy for you truly.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ok_Advantage9836",
            "body": "You are fucking amazing!! My last 2 physicals nice lady doctor never asked how much I drank WTF! After my altered addition in the past!🤣🤣❤️‍🩹",
            "score": 3,
            "replies": [
                {
                    "author": "NeedingSupport1987",
                    "body": "This means so much, thank you. \n\nI honestly lied to my doctor for years and then one day I decided I needed to be honest so I scheduled the first appointment possible and told him everything. \n\nNo judgment, he gave me meds to help with withdrawal and next time I saw him, he told me how proud he was of me because it was clear I had put the changes into effect. ",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Beulah621",
                            "body": "Me too, word for word. I asked myself why I always lied in the past, and the honest answer is fear of losing access to alcohol, due to something she might find that could be caused by the real amount I drank.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "tharebedragons",
            "body": "Amazing! You’re an inspiration 👏",
            "score": 3,
            "replies": [
                {
                    "author": "NeedingSupport1987",
                    "body": "Thank you! ",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "No_Accountant_6083",
            "body": "Congratulations!! That gives me a ton of hope. Getting my first sober blood work done next month. IWNDWYT!",
            "score": 3,
            "replies": [
                {
                    "author": "NeedingSupport1987",
                    "body": "You got this! ",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Spare_Answer_601",
            "body": "Congratulations ! IWNDWYT",
            "score": 1,
            "replies": []
        }
    ]
}