{
    "title": "NA drinks",
    "author": "Every_Change_1829",
    "subreddit": "stopdrinking",
    "rank": 198,
    "score": 1,
    "upvote_ratio": 0.67,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j40ebm/na_drinks/",
    "id": "1j40ebm",
    "selftext": "What are some of your favorite NA drinks that you've been drinking lately?\n\nI've personally been really enjoying trying different sparkling waters when I'm wanting alchohol. I also been enjoying making different combinations of fruit/lemom/mint/cucumber water. Trying different water flavoring packets (cryatal light and other similar ones) has also been a nice sweet-treat thing I've been doing!\n\n",
    "comments": [
        {
            "author": "LizLemonsFeet",
            "body": "My fav drink in general is Waterloo brand lemon lime sparkling water. I could go the rest of my life drinking only that.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Eye-deliver",
            "body": "I’m drinking La Croix sparkling water as well as ginger beer. The ginger beer has the 3 b’s I need as a former beer drinker. Bubbles, bite and burps!",
            "score": 2,
            "replies": []
        },
        {
            "author": "trimarandude",
            "body": "Tried Guinness on the weekend, 0%... What? There is some serious wozardy going on there. No triggers for me with NA, drinks.\nI always looked on this group with envy and disdain equally if I am honest. But I joined it. Here I am about 5 months in and honestly only tempted 3 times. This naked mind did it for me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "yougococo",
            "body": "I loooove hop water- that's probably my go to.  I've also been drinking Slice sodas lately- they're low in sugar and have fiber but taste like regular soda which I love.  I don't mind the Recess mocktails- they don't try to mimic the flavor of alcohol and they're not too sweet, but they have 10mg caffeine which I don't love.\n\nI've gone to the store a few times since I quit and just bought a bunch of individual NA drinks to try out, some of them a little pricier, but it's still nothing compared to what I was spending on alcohol.",
            "score": 0,
            "replies": []
        },
        {
            "author": "tsgarp2025",
            "body": "I like trying different NA beers but also love Spindrift Nojito. Another option for anyone looking for an alcohol-free, calorie-free option is Hoplark.\n\nhttps://hoplark.com/collections/hoplark-0-0",
            "score": 0,
            "replies": []
        }
    ]
}