{
    "title": "Two full days and a headache",
    "author": "determined664",
    "subreddit": "stopdrinking",
    "rank": 110,
    "score": 8,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 6,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j41p4o/two_full_days_and_a_headache/",
    "id": "1j41p4o",
    "selftext": "I guess my main symptom right now is sleep disturbance, today will be my third day with no alcohol. I wouldn’t say I feel hungover this morning bc I have energy but ugh I’ve got a headache. It’s not severe, I took some ibuprofen but I was expecting immediate positive results and I guess it’s going to take some time. I was drinking daily since 2023. \n\nJust posting it here since I know others can relate and it makes me feel better to verbalize it. \n\nThat said, I’m about to actually exercise before work, something I haven’t had the energy to do in a long time! So maybe there are some positives already. ",
    "comments": [
        {
            "author": "Leather_Bid4925",
            "body": "I’m 4 days sober. Got sick (wondered if it’s also some withdrawal) on day 2 and haven’t been sleeping at all. Keep it up, this too shall pass. \nIWNDWYT",
            "score": 4,
            "replies": []
        },
        {
            "author": "Glad_Day_3007",
            "body": "It gets much better! IWNDWYT",
            "score": 2,
            "replies": []
        },
        {
            "author": "Scunner60",
            "body": "Keep strong comrade. Water and sleep are your friends 🥊",
            "score": 2,
            "replies": []
        },
        {
            "author": "ComplaintScary8730",
            "body": "Yup this is normal 👍",
            "score": 1,
            "replies": []
        },
        {
            "author": "Eye-deliver",
            "body": "Yeah this is the hard part but you need to stay focused. Your body needs time to adjust to the absence of alcohol and it definitely needs time to heal so if you can give it a little time it will definitely get better. Stay strong!\nIWNDWYT",
            "score": 1,
            "replies": []
        },
        {
            "author": "Iwantedtobeaviking",
            "body": "For me - It passes, returns, and passes again. The waves of actually feeling and not resorting to numbing. It gets so much easier the more distance you put there. Verbalizing it was one of the kickers for me to push through the constant conflict. Stoked you're gonna exercise, go get it. I'll join ya not drinking today my dude :)",
            "score": 1,
            "replies": []
        }
    ]
}