{
    "title": "Anyone else trying to stop when most of their social life evolve around drinking?",
    "author": "Environmental-Let375",
    "subreddit": "stopdrinking",
    "rank": 44,
    "score": 23,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 13,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j44js4/anyone_else_trying_to_stop_when_most_of_their/",
    "id": "1j44js4",
    "selftext": "Recently retired and most all of the retirees in my social circle (we are in a lake community) drinks.  I am trying to quit or at least cut down to keep the good health I enjoy at 62, but it seems every social activity, whether it be jeeping or boating or just going out to eat, evolves around alcohol.  Heck, even after the half marathon in Memphis, how did we celebrate our fitness?  Drinking at a microbrewery, of course.  How do you break the cycle of alcohol while maintaining your social circles and your relationship with your spouse (She has no intentions of quitting her beer btw).  Your thoughts?  Am I alone in this dilemma?",
    "comments": [
        {
            "author": "alert_armidiglet",
            "body": "I'm a little younger than you are, but my spouse still drinks. Just drinks things I do not care about (whiskey and beer).   \n  \nA lot of my socializing is not-alcohol-focused now, though we still go to bars, etc. sometimes. I've dealt with it with fancy non-alcohol drinks and NA wine, and bought a soda stream and make my own seltzers with herbs, flowers, fruit, etc.\n\nGood luck!",
            "score": 8,
            "replies": []
        },
        {
            "author": "goofball_dungeon",
            "body": "You’re not alone in this dilemma and only once I got out of the drinking world did I see how utterly pervasive it is in American and global culture. \n\nI faced the “sobering” truth that some of my relationships only had drinking as the common bond. And that maintaining some of those friendships was fruitless.  I found new ways to connect with some of the people I drank with. Some of them I didn’t. The truth hurts. I found myself naturally growing distant from a lot of people who I didn’t have any business hanging with. \n\nIt was important for me to find other sober people and invite them into my life. I don’t have to exclusively hang out with sober people, but it reaaalllly helps to have that circle. \n\nMy spouse still drinks. Very little, however. But we went through rough waters early on with  some things I was self-medicating over and suppressing for years. But my not drinking made her eventually drink a lot less frequently. I think you might be surprised at how your quitting can influence others. But do not place  expectations on anyone. Be open to observing the colors your relationship might reveal when you quit. It’s not always bad. It might be tough, but that’s part of the commitment. The only way I could truly gauge how to handle my spouse still drinking was just by doing what is right for myself and taking it a day at a time. \n\nDrinking is ubiquitous and unavoidable but after a while it just becomes background noise. ",
            "score": 8,
            "replies": [
                {
                    "author": "heartunwinds",
                    "body": "We jokingly call my book club \"wine club\" but I have been cutting back significantly recently. I never really paid attention to what others were drinking during our club gatherings, but last time I had about a glass and a half of wine (instead of a whole bottle as usual) and was kind of grossed out to see that someone else drank an entire LITER bottle of wine and then drove home. It really is sobering (no pun intended) when you take a step back and see what is going on and how normalized it is.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "YourBrain_OnDrugs",
            "body": "Yep. I play beer league hockey; it's called that for a reason. Weird to not enjoy the reason that so many other guys are there, but it really is just about getting out/getting exercise for me these days. I was actually a little bit worried about how it'd go if I stopped hanging out as much and told everyone I wasn't drinking anymore.... mostly I was met with support (\"hey man, good for you!\") though there were a few that questioned why I'd deprive myself of the joys of drinking. In either case... haven't really lost any friends over it and now I get to be the responsible one in the group",
            "score": 6,
            "replies": [
                {
                    "author": "Environmental-Let375",
                    "body": "That sounds awesome!....Right now, I just tell my buds \"I'm not in the mood today\" or \"busy day working on the boat\" when drinking NA or water.   Always get that peer pressure to get a beer, even from retired dudes.  That part of drinking hasn't changed since high school/college days.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lucky_Best_Wash",
            "body": "I am working through this right now - fwiw I am 53 and I've been drinking for 40 years - booze has been the one constant in my social life and I am surrounded by drinking in my friend group, career, and neighborhood.\n\nSomeone in a meeting described my current position as being 'in a hallway.' I've left one room (where I was a heavy drinker) and I'm heading to another room (where I'm sober) but for right now I am banging against the walls in the hallway between the two rooms.  It's unsettling.\n\nI'm trying to hold on to as much of my prior life as possible but I can tell that I'm quickly going to have to choose between my old life or being sober, because a lot of my \"fun\" was based on getting drunk.\n\nFor now I am mostly just hibernating as much as possible until I figure it all out.",
            "score": 5,
            "replies": []
        },
        {
            "author": "PinkMorningSky",
            "body": "You are not alone! I'm part of a large friend group of 50-60 somethings and our social life revolves around activities that often center drinking. \n\nSummers are spent hosting each other at our lake places, winters are spent taking short warm weather getaways, and daily life involves going out for dinners or meeting up at breweries. \n\nI'm pleasantly surprised at how much of a non-issue my non-drinking has become. At rural dive bars in lake country I just order a club soda, club cranberry, or a Diet Coke. (As of last summer most rural bars near us didn't have NA beers.) At breweries I order a kombucha. \n\nI've had one other friend come out as a sober person, and I've had a few others tell me privately that they're glad I don't drink because it makes it easier for them to cut back when they're with me. 💕\n\nSorry for the ramble - just know that there are lots of us out here, kind of hiding in plain sight even in a big drinking crowd. \n\nIWNDWYT!",
            "score": 6,
            "replies": [
                {
                    "author": "Environmental-Let375",
                    "body": "Not rambling at all....that is exactly our lifestyle as you described it right there!  Thank you!  That is the kind of inspiration I need to continue this journey.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "BladerKenny333",
            "body": "Yes, I just stopped hanging out so much. Which is ok. I do productive stuff now for fun. I kind just realized hanging out all the time is kind of a waste of time.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Spare_Answer_601",
            "body": "It’s ok. Order club soda plus cranberry juice: no one ever knew the difference except me. IWNDWYT",
            "score": 2,
            "replies": []
        },
        {
            "author": "DanielSON9989",
            "body": "Yep I’ve just been hunkering down these days.",
            "score": 2,
            "replies": []
        },
        {
            "author": "_jais_",
            "body": "Yep. Same thing. I’m 48 and me and my wife’s entire social existence is built on drinking. Eat - drink, hike - drink, friends - drink, tv - drink, nice day - drink, cloudy day - drink. You get the point. I recently moved so a lot of my friends I don’t see very often anymore, but our entire group existence was built around drinking together.  Very hard to see a life without it.",
            "score": 1,
            "replies": []
        }
    ]
}