{
    "title": "You will not break me…",
    "author": "quick_and_dirty",
    "subreddit": "stopdrinking",
    "rank": 58,
    "score": 16,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 8,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j45913/you_will_not_break_me/",
    "id": "1j45913",
    "selftext": "Anyone reading Dungeon Crawler Carl series? It’s been my new escape as I try to stay away from booze. In the book Carl faces all sorts of shit and at his darkest he says, “you will not break me” his mantra for keeping himself, and not letting all the bullshit change who he is as a person. \n\nThis morning, I saw the bottles of wine in my fridge, full and glistening. I grabbed both, popped them open and started saying, “I will win, not you… you will not break me” as I poured it all down the drain. \n\nThat’s it. No wine in the house. I won today, and alcohol, YOU WILL NOT BREAK ME. ",
    "comments": [
        {
            "author": "CauliflowerMurky1614",
            "body": "You will not break me! Way to go!!\nThe strength to pour those down the drain. \nI’ll have to check out this series. ",
            "score": 3,
            "replies": []
        },
        {
            "author": "Je_suis_prest_",
            "body": "That's awesome!! well done!! Unbreakable 💯💖",
            "score": 3,
            "replies": []
        },
        {
            "author": "Detharon555",
            "body": "Just imagine how disappointed Donut would be if you fell off the wagon",
            "score": 3,
            "replies": [
                {
                    "author": "quick_and_dirty",
                    "body": "Mongo would be APPALLED! It would be an OUTRAGE! Hahahaha this made me so happy. Thanks crawler.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Detharon555",
                            "body": "I just started the series a few weeks ago and LOVE it.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Eye-deliver",
            "body": "I have alcoholism but alcoholism have me! Well done OP!",
            "score": 2,
            "replies": []
        },
        {
            "author": "MindPerastalsis",
            "body": "Awesome! I’ll have to check that series out :) thanks for the recommendation! And kudos for dumping the wine out 👍🏽",
            "score": 2,
            "replies": []
        }
    ]
}