{
    "title": "Day 3",
    "author": "Rachxlw",
    "subreddit": "stopdrinking",
    "rank": 82,
    "score": 6,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j46gyh/day_3/",
    "id": "1j46gyh",
    "selftext": "I already know that today will be the hardest. I don’t work today and really only have plans to go to the movies tonight with my dad. He offered to get us dinner before and I purposefully picked a place that doesn’t serve alcohol. Typically we both get a drink when we meet up for dinner.\n\nI thought about telling him about quitting alcohol but I don’t think I’m ready to share with anyone but my husband yet. I’m lucky enough that my problems controlling my intake and actions didn’t start until I was in my late 20s and removed from that side of the family. Its nice to have people in my life who actually don’t know how dark it got at times.",
    "comments": [
        {
            "author": "jbashar",
            "body": "Day 3 here too. You got this. Remember you have support within this community! \n\nIWNDWYT",
            "score": 3,
            "replies": []
        },
        {
            "author": "Polymurple",
            "body": "The tough thing: Day 3 is rough.\nThe good side: Day 3 is the worst.  It starts getting better today.\n\nIt remains tough for a while, but you should start feeling better going forward.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Low_Peanut2644",
            "body": "Congrats on day 3, it can be tough. Good idea to plan to go to place that doesn't serve alcohol so early into your sober journey. Perhaps in awhile you can tell your dad, but only when you are ready. You don't have to tell any of the dark stuff, it's your story to control. Good luck and keep coming back here. IWNDWYT",
            "score": 1,
            "replies": []
        },
        {
            "author": "Roger_Roger27",
            "body": "Push past this. It has gotten much better for me in just under 2 weeks' time. It will 100% be worth it.",
            "score": 1,
            "replies": []
        }
    ]
}