{
    "title": "Back on my meds",
    "author": "Acrobatic_Talk_9403",
    "subreddit": "stopdrinking",
    "rank": 74,
    "score": 4,
    "upvote_ratio": 0.84,
    "num_comments (reported by reddit)": 4,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j4aj3m/back_on_my_meds/",
    "id": "1j4aj3m",
    "selftext": "I’m on (or supposed to be) three different medications for previous SCAD heart attacks. At least one of them is not to be mixed with alcohol, so of course my rationalization is to stop taking my Rx so I can drink 🤦🏼‍♀️.\n\nI’ve been wanting so badly to get back to the gym and on my Peloton, but I’m scared to do it if not properly taking care of my self. \n\nToday is day 3 of no alcohol and day 2 back on the pills. I feel like absolute poop the first couple days getting acclimated to the meds, I’m working through it and can’t wait to get to the gym this weekend. IWNDWYT",
    "comments": [
        {
            "author": "Kyanite21",
            "body": "You are not alone in rationalizing that if you can’t mix your meds with alcohol, you don’t need to take the meds. I did the same thing with Lexapro and booooyyyy was that a shitty choice.  \n\nOn another note, I’m also starting back at the gym this week! Gotta have something to fill the time that I would have spent drinking at home.",
            "score": 5,
            "replies": []
        },
        {
            "author": "whatmonthisitagain",
            "body": "Hey- I saw your post and had to chime in. I unfortunately don’t know anything about your medical condition and would never comment on it or the medication to treat it… but I’m newly sober myself again (235 days today) and both discovered and fell in love with Peloton!!! \n\nIf not drinking alcohol, so that you can take your medication properly allows you to get back in Spin- it is so WORTH the trade off. The treadmill bootcamps, outdoor runs, Tabata spin classes, Core workouts… it’s changed my body and life. \n\nI just wanted to remind you that alcohol really is no match for the stress relief, self care and dopamine that Peloton provides.  I know you know this from your own experience- and you’ll never regret not drinking and doing a great workout, I promise.",
            "score": 1,
            "replies": [
                {
                    "author": "Acrobatic_Talk_9403",
                    "body": "I’m a gym rat so I’m right there with you!! I absolutely love how I feel after a workout and I’m looking forward to getting that “high”’again!!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "whatmonthisitagain",
                            "body": "The happy hormones rush is great, but I’m really appreciating how it genuinely makes me feel like I’m progressing forward, moving towards goals. \n\nDrinking had me running away from, avoiding or ignoring most of my life- which only depleted any teeny self-esteem or confidence I had left. I’m slowly becoming proud of myself again- and as trivial as it sounds, consistently working out lets me feel accomplished.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}