{
    "title": "90 days sober but feel unsupported",
    "author": "imtiredofthisshit69",
    "subreddit": "stopdrinking",
    "rank": 64,
    "score": 6,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 9,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j4bn5k/90_days_sober_but_feel_unsupported/",
    "id": "1j4bn5k",
    "selftext": "I just wanted to rant here for a bit. I’ve been drinking for the last 15 years, not every day, but every time there was a “special occasion” I would get as fucked up as possible and make a fool out of myself. During the last two years I limited myself to a 2 drink maximum due to making some stupid ass decisions while drunk and then 90 days ago decided to completely stop.\n\nI feel so happy with myself, my mind is clearer and my energy is much higher, I’ve saved so much money and I haven’t been making any of the stupid choices I use to make.\n\nThe thing is I feel so bummed because a lot of my friends and family either don’t support me and even get upset when I don’t partake, or they question my ability to “have fun”. I have some vacations planned this year and all I hear is “are you sure you don’t want to drink?” Or “you weren’t that bad when you were drinking” or “I didn’t want to invite you to (event) because I know you aren’t drinking” \n\nI’ve expressed that I still want to be invited to things as I can still have fun and I don’t get tempted anymore, but im sick of the comments.\n\nJust wanted to vent since I know a lot of us have to deal with the comments, this is my first time quitting alcohol and it sucks that I don’t have the support from the people I love the most. ",
    "comments": [
        {
            "author": "YourBrain_OnDrugs",
            "body": "You really can't expect anyone to be as excited about your sobriety as you are -- and that's part of why it's important to develop a network of people who understand the struggle and can cheer you on. Whether that's here on this sub, among people you know in real life, or by joining AA if that's your speed... it's an important part of getting on the wagon and staying on the wagon, IMO. If you're truly doing it on your own without anyone in your corner, you're going to have a really hard time succeeding.",
            "score": 8,
            "replies": [
                {
                    "author": "imtiredofthisshit69",
                    "body": "Yea you’re so right, I’m going to look around for a group and prioritize getting the support I need. I appreciate your response 🫂",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "waitingforpopcorn",
            "body": "We're proud of you, OP. 90 days is awesome. It's 90 days of choosing not to drink. \n\nHop in the DCI here. We get you. We understand. Normies don't get it, they don't understand. IWNDWYT",
            "score": 7,
            "replies": []
        },
        {
            "author": "abaci123",
            "body": "There are two groups of people who I don’t listen to: one group are the people who say ‘ Wha.. ?! You weren’t that bad!’ And the other group are the people who say ‘You are a piece of shit!’.  They’re both wrong. What I am is a person with a drinking problem.  \n\nIt’s humbling to recover from a drinking problem because it’s is a BIG accomplishment and yet nobody cares as much as another person with a drinking problem!! Which is why I go to AA meetings so that I can meet people who know what I’m talking about. Who feel like I feel and make me laugh. Those folks I listen to. Hang in there  and keep reinventing yourself. Your friends will either adjust or you can get some new friends!",
            "score": 6,
            "replies": []
        },
        {
            "author": "jake_cdn",
            "body": "I have had those comments before too. So, for a work event, instead of assuming that these people were \"partying\" and \"having fun\", like they had announced, I asked them what they were going to be drinking, and how much. What I found surprising, and interesting, is that they were only planning on drinking 2, maybe 3 drinks! One of my co-workers was east Asian and couldn't metabolize alcohol and didn't drink at all. Everyone had accepted that he didn't drink and I ended up sitting next to him. I watched as they had their 2 drinks and really let loose. Lol. They had no idea what heavy drinking looks like, and that was okay. After the initial questions in the planning phase of the night out, they accepted that I wasn't going to be drinking. I like to make sure that I make an effort socially when not drinking, that I intiate conversation, tell some funny stories, have some laughs or a dance. They will soon overlook that you are sober. You can always get something that looks like a beer or cocktail as a prop to blend in. If they still give you a hard time, then maybe you need a different approach? We have accepted sober October and dry January, how about dry February? I have told people I am on a cleanse or detox. I have told some people that I didn't quit drinking, I quit hang overs. Before quitting this last time Jan/25 I told by buddy that alcohol didn't line up with my health and fitness goals. He was fine with that. You may also want to try doing other activities, I have been getting together Saturday morning for coffee after going to the gym rather than meeting up Friday night at the pub. Be true to yourself and your goals. I do think that we underestimate the level of psychological dependency that people can develop, we are conditioned to think that we have to drink for social events, celebrations, travel etc, except that we don't. Many millions of people don't drink on the planet, maybe they can't metabolize it, it is against their faith, maybe they don't like the taste, they are in recovery, they don't like being around a spouse or friends that are drunk. It is only a radical shift in your world because friends and family are stuck in that rut. Maybe by you breaking out of the matrix you will give them insight and permission to also try on a different way of \"having fun\"?.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Brave-Scale",
            "body": "You're in the right place here",
            "score": 3,
            "replies": [
                {
                    "author": "imtiredofthisshit69",
                    "body": "Thank you 🫂",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Alkoholfrei22605",
            "body": "Bravo on 90!",
            "score": 3,
            "replies": []
        },
        {
            "author": "RealisticInspector69",
            "body": "Fabulous 90 days...really impressive. And how are you feeling? What are the best bits? IWNDWYT 🌹🌹🌹🌹",
            "score": 2,
            "replies": []
        }
    ]
}