{
    "title": "Dating…",
    "author": "College-athlete222",
    "subreddit": "stopdrinking",
    "rank": 61,
    "score": 6,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 5,
    "url": "https://www.reddit.com/r/stopdrinking/comments/1j4ca1n/dating/",
    "id": "1j4ca1n",
    "selftext": "I recently went on a date with someone I have a history with, and it had been several years since we last saw each other. We decided to reconnect, and I thought it might be an opportunity to socialize since my sobriety is going well and I’ve been a bit isolated. However, after the date, I felt drained and didn't experience the same sense of connection that I had felt when I was drinking with this person in the past. I wonder if this new version of me simply doesn't align with him because I'm not the same person I was back then. It makes me realize that I may have never truly felt a connection; perhaps the drinking was just masking that. \n\nDo you feel since quitting it helps you form deeper connections that are more authentic?",
    "comments": [
        {
            "author": "SallyCook",
            "body": ">Do you feel since quitting it helps you form deeper connections that are more authentic?\n\nYes. \n\nIt also helped me weed out the bullshit and the bullshitters. Alcohol is a mask, a haze, a fog. Alcohol lies and says it's sexy, exciting, and mature. What booze really is is a con artist that takes your money and dignity.",
            "score": 4,
            "replies": []
        },
        {
            "author": "abaci123",
            "body": "Absolutely !! connections become more real in sobriety. I can’t waste time with people that I can only pretend to feel something for. I listen to my intuition very carefully now. I’m a different person and I’m attracted to different qualities in people!  No need to regress, go forward. 🥰",
            "score": 3,
            "replies": []
        },
        {
            "author": "Rich_Particular_4",
            "body": "You may find this in multiple situations in your life.  I used to listen and watch the same things religiously and that has completely shifted.  When on dating apps (which suck) instead of swiping on any and every attractive woman I see, I am thinking a bit more about who I look to match/ connect with.  Even my music taste has shifted a bit. \n\nBest of luck in your search and just know that you being the best version of yourself is only going to help find others like minded and who will continue to bring the best out of you while you're doing that for them.",
            "score": 2,
            "replies": []
        },
        {
            "author": "waitingforpopcorn",
            "body": ">Do you feel since quitting it helps you form deeper connections that are more authentic?\n\nIdk. But it has made me no longer have shallow connections. I don't have un-authentic friends anymore. So I guess that's the same from a subtraction side of things. I just don't do much to add connections.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Aromatic-Situation89",
            "body": "Only a dog returns to its vomit.",
            "score": 0,
            "replies": []
        }
    ]
}