{
    "title": "Hows the solo experience and do you have any recs",
    "author": "Wisdom_of_Odin717",
    "subreddit": "Enshrouded",
    "rank": 18,
    "score": 10,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 27,
    "url": "https://www.reddit.com/r/Enshrouded/comments/1jdh5rk/hows_the_solo_experience_and_do_you_have_any_recs/",
    "id": "1jdh5rk",
    "selftext": "I was looking to get the game for my friends but some are on console and some are busy with uni/careers. So im debaiting just getting it and play solo. How is that experience? Are there ways to optimize fun. Im looking to take it slow and explore the game at my own pace. Is this game still good solo? Ive tried a few survival games that only feel fun with friends so i just thought id ask before I buy.",
    "comments": [
        {
            "author": "Serious-Law464",
            "body": "I started multiplayer with a friend but played solo mostly since and it's great. I find similar games usually don't keep me interested solo but with this game having a good number of npcs to add to your base it helps. Depending on what difficulty you want you can have a nice relaxed game or something more hard core.",
            "score": 6,
            "replies": []
        },
        {
            "author": "SlamTheMan6",
            "body": "100 hours in solo only had the game for 2 weeks, loving it.",
            "score": 7,
            "replies": []
        },
        {
            "author": "sigh1995",
            "body": "I play solo and with a friend. Both are great. \nIf you like building, crafting, and/or exploration I absolutely recommend. If you decide  you are lonely you could go join someone else’s server any time you want, and you can transfer whatever character/items you want, it’s super easy and fast.\n\nI’ve played a few building/survival games (Minecraft, Ark, rust, 7 days to die, Valheim, Terrerria  etc) and enshrouded has my favorite building system so far. It’s also the prettiest and has the coolest armor out of all the ones I’ve tried. Also more fun PVE content and a really solid crafting system. I like its combat the best out of all the ones I’ve tried as well. \n\nThe community managers and devs are also top notch for this game. They are by far the best I’ve ever come across in any game. They are excellent at listening to player feedback, they even set up website for player to give ideas and upvote what they want brought game. They have already brought a lot of stuff people voted for.\n\nFurthermore, I think one of the top indicators of how good a game will “age”  is the devs and community managers. I’ve seen so many games start out strong and/or with so much potential, but the “director” (or whoever’s in charge of major decisions) just absolutely butchers it. They don’t listen to feedback and in many cases don’t even have a lot of gaming experience themselves and implant so truely terrible ideas, often for the wrong reasons.  They make the game worse and worse with every update or do the bare minimum, without a care in the world I swear. \n\nThis game I can tell the developers really love what they are making, know what they are doing, and care about feedback and that alone excites me. The game is already solid and it has a solid team behind it who listens to feedback so it’s just going to keep getting better every update. I’m so excited!",
            "score": 5,
            "replies": []
        },
        {
            "author": "Sarcasm_and_Coffee",
            "body": "I started in my husbands world with him and a buddy. They dropped off for other things and I started my own. \n\nWhen you set the private server, you can customize a ton of stuff. I made combat easier and less frequent; turned off tool and weapon degradation; made the day 1hr and the night 4min; and maxed all the resource gathering....and turned off glider turbulence (fuck that noise)\n\n I'm having a ton of fun with it. >300hrs and I'm not bored yet. For someone with my level of ADHD, that is saying a lot.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Lanky_Luis",
            "body": "Solo experience is great. I have two characters one solo and one I play with a buddy when he has time. This goes for all ways to play, but especially solo. Play on a custom difficulty do not use a pre-set. The sliders are pretty self explanatory, but I will share what changes I made. I think resources are a bit annoying considering the volume of some stuff you need, so I increased mining damage to 200% since all it does is give more ore on hit and cut down trees faster. I also turned plant growth and workshop production to 200% as well. If you dont play melee youll need TONs of resources to upkeep arrows/spells (yes spells are ammo you have to craft). Runes can be hard to come by if you dont chest farm by opening and closing the word and running a chest route to max runes so I just turn up runes I get from salvaging my old weapons to about 80% default is 50% return on investment. I would say to always turn these settings on even with double resource and crafting speed I still think its too slow.\n\nMore optional things that I just like. I turned off weapon durability and starvation. I felt weapon durability only really gimped my exploration constantly having to keep coming back to my base and deal with inv management. Starving was removed bc some workstations are just really slow and I would just afk in base waiting for my stuff to craft so I had to turn that off to avoid dying. Boss health to 200% enemy health 150% enemy amount set to more. I like combat which is probably why I need more resources to keep up on ammo bc of the additional enemies and their increased health. I set day to last 1h. They did a lighting patch and dark places in this game are very dark so you almost cant see anything and you cant hold a torch and your weapons, so while it doesnt stop exploration it does make engaging in combat harder. I sleep the night away and do most things during the day.",
            "score": 2,
            "replies": [
                {
                    "author": "Wisdom_of_Odin717",
                    "body": "This is great to know and also the fact i can kind of change enemy stats to be challenging based on skill and fun. U convinced me to buy it and play solo. I def think ill take your advice for most of those settings. Others i might try and see what i prefer. Otherwise, ia this a game where u specialize into specifically physical ranged, magic, or melee? Should i decide before playing or start a veraatile build and decide later? Is respeccing easy or should i decide ahead of time is what im asking.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Lanky_Luis",
                            "body": "Decent sized skill tree, but you can specc into whatever you want everything on the tree is beneficial as well as link together so its easy to multiclass. Its up to you tho to figure out whats more beneficial then others or if its even worth it to multiclass. Atm there are a lot of \"noob trap\" nodes, but hopefully they get worked out sometime this year. Biggest thing I think I could tell ya is just like any other game the boring QoL passive/on use abilities on the tree are the most powerful. Having a double jump and an updraft for your glider are two of the most important abilities to get in the tree even if you arent playing the classes associated with those perks. also DONT ignore red glowing books/paper they put points of interest on your map.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "sigh1995",
                            "body": "Respecing is easy. You respec by using runes, which you get from salvaging weapons/armor that you find. If you turn up the setting that gives you more runes for salvaging, respecting is easy as pie. Even if you don’t turn that setting up respecting is pretty cheap. You have the option to respect everything for a price or respect individual skills for even less runes. \n\nAs for builds, right now the “best” builds are the ones where you focus into either melee, range, or magic trees, but you don’t have to. I am currently running a paladin build that is a mix of melee and magic trees with a dash from one of the stamina/range tree’s and it’s been doing great so far, haven’t tested it in hollow halls yet tho. You can put your skills into whatever trees you want, very similar to Skyrim imo, except there is a little more overlap between the trees so it’s easier to get to the end of some trees without having to start from the beginning of that tree. \n\nI think you should just toy around with the skills that interest you. If you have trouble there’s plenty of good builds on YouTube and it’s super easy to respec. Def get double jump tho, it’s extremely helpful for navigating terrain which you will be doing a lot.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Wisdom_of_Odin717",
                                    "body": "Ya i think im going to just try my own build. Im a dark souls and monster hunter vet so I think im going to focus on the mobility perks first and leave combat to skill but eventually go into barbarian. I might add magic or something later bit for now, i think ill just focus on mobility.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "jrlamb",
            "body": "I have only played it solo. I have almost 500 hours in,  and I'm taking it slowly. I'm actually at Level 32, but I'm not rushing to complete everything before the early access ends. I enjoy it solo and play it like I played BOTW and other RPGs",
            "score": 1,
            "replies": []
        },
        {
            "author": "Notyomachoman1",
            "body": "I’m working on a massive base that is a tower on a narrower mountain that has rooms in the mountain as well as secret passages and then leads to a large flat farm ground area. There is a winding staircase from ground level that has natural road access so by the time it’s all done it’s going to be a great video on YouTube. That’s also why I haven’t gone into multiplayer because the thought of another player wrecking it would totally suck. I have the enemy count turned up and difficulty up so there is a lot of challenges in solo with that function. I wouldn’t mind trying multiplayer but it’s not a big deal right now because the other players would just see me spending hours placing things and adding things to all my build.",
            "score": 1,
            "replies": [
                {
                    "author": "Wisdom_of_Odin717",
                    "body": "How are you liking the base building? Ive played atleast 10-20 of these survival basebuilding games and ive never enjoyed it once. Always had a friend build while i practiced combat and grinded enemy loot. This game actually feels pretty polished for building and so i was wondering if i should give it a few hours of building and see if i can stick with it. My only worry is that the base will become obsolete location wise and if its a waste of my altar slots. Do i get a ton of them or should i play for awhile before finding a perfect spot, maintaining a functional spot until then?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Notyomachoman1",
                            "body": "That’s a tough question so I built a cool mansion on the starting location it recommends and added to it but I just kept accumulating villagers and wanted to make something special and once you build another location and place the villagers there they aren’t at the original location anymore. So I would try to find a place you like for your final project and just add to it not knock it out completely because you will find different blocks and furniture you may want to add. The base building is fun because you can do so much with it and you can balance you combat and exploration when you don’t want to build. I like the game because I’m a night shift nurse and when I get up if the weather sucks or I have some time I want to kill I hop on and just grind out those things I said above. It feels like a game that has a lot of polish already just knowing they are continuously adding new areas is the cherry on top. I bought my PC because I was so psyched to play Manor Lords and Silent Hill 2 when they came out and I haven’t played them at all since finding this game. Multiplayer would be fun but only in a trusted server.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Wisdom_of_Odin717",
                                    "body": "Good to know, thx. I def agree on the polish and i think ill give the building a fair shot then. Im currently recovering from a surgery and ill need another soon so im just looking for a game to distract me and this game seems perfect for that.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Notyomachoman1",
                                            "body": "Hope you have a speedy recovery. Yes this game is definitely the perfect time sink for you then.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "PanoptiDon",
            "body": "I started solo and it's sometimes frustrating trying to figure things out, but it's also very rewarding. \nI ended up starting over after about 100 hours to try a caster spec over the ranger I had built. \nI'm also enjoying the building aspect, though it requires a lot of resources.",
            "score": 1,
            "replies": [
                {
                    "author": "Yvanthar",
                    "body": "No need to start over when you can just respec.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Darth-olomew",
            "body": "I’ve got over 600 hours in this game and 80% of that is solo. My friends gave up on it because they thought it was boring, but I enjoy the building mechanics the most. The exploration is cool too. I’ve built (and overbuilt) so many bases it’s ridonkulous. Great game with friends or solo. Pick it up, play it, and play it some more.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WinterSummerThrow134",
            "body": "It's good.  My only gripe is that chests should be user-specific.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MKALPINE",
            "body": "Like others here, I started playing with a couple other people but they dropped off so I’ve been mostly playing on my own (120+ hours). The Hallowed Halls can be a bit of a grind by yourself - I like doing them with other players because it saves time, but they’re still easily doable on your own. It’s definitely more fun as a whole playing with other people, but the game is varied with lots of different things you can do, if you’re playing on your own. \n\nI’m more into exploring so I revamped an existing structure and made it my base, but if you’re into building things from scratch it’s really fun and immersive. \n\nI like how I’ll think I’ve explored an entire area and then oh look, hidden temple in the mountainside to explore.",
            "score": 1,
            "replies": [
                {
                    "author": "Wisdom_of_Odin717",
                    "body": "Wait ur telling me i can use existing structures... Do you mean generated structures or ones that other players built? this actually a game changer if its the former.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "MKALPINE",
                            "body": "Like the towns and buildings in the game. I chose the Blue Goblet tavern in the Revelwood. I fixed it up; repaired the holes in the walls and roof. I changed and added some furniture, added a barn for my yaks, and a separate shop for my crafting tables and storage boxes. I just added another “dorm” next door for the other NPC characters to live.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Wisdom_of_Odin717",
                                    "body": "Oh thats actually great to know. No idea why but im so used to games lime conan that restrict ur builsing locations heavily. Its good to know i can use generated things as a base. Im assuming vaults and stuff dont allow it, basically if theres enemies then its a no go right?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "MKALPINE",
                                            "body": "I’ve seen videos on youtube of people putting altars in temples or areas of interest they’d want to return to (gold and silver chests) so I imagine you can as long as you clear all the enemies first?\n\nI still have PTSD from falling through or getting stuck in the map from Ark (getting too close to crevices) so it’s amazing to me being able to dig and mine deep underground and not have that happen.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Wisdom_of_Odin717",
                                                    "body": "Me too. Ark harmed us all. And when I saw the mining mechanic I was so excited. Gives a lot more freedom and comfort. Ive always loved underground rooms and Im think that might be possible.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "catfishburglar",
            "body": "I have completed the currently available game content entirely solo. I made some world setting changes that made the game much more fun. Also some reflections on build choice.\n\n* Turn off weapon durability. Has weapon durability ever been a positive thing in any game ever? I despise it.\n\n* Machine crafting speed to 200%. Still feels a little slow but much better.\n\n* Food buff duration to max. Makes me less likely to horde food as it actually lasts awhile.\n\n* Loot quantity x2. Makes farming for things like building and crafting materials bearable. I built a decent sized base and crafted everything needed. It's honestly not a bad grind.\n\n* I started as a mage, tried ranger, and eventually settled on a warrior/barbarian. The mob density at some points in the game, particularly the hollow halls, is clearly designed around multiplayer. I found that melee with life leech enabled me to actually enjoy the dungeons as you get completely swarmed otherwide if you play at the dungeon level.",
            "score": 1,
            "replies": [
                {
                    "author": "Wisdom_of_Odin717",
                    "body": "Why does everyone hate weapon durability? Maybe im just so used to it but i kinda like having to make backup weapons. That said, i may change it once i get to more fighting focused spots. The first few hours seem fine tho.",
                    "score": 0,
                    "replies": []
                }
            ]
        }
    ]
}