{
    "title": "TIFU by almost sitting on a stranger.",
    "author": "ggoatoats",
    "subreddit": "tifu",
    "rank": 19,
    "score": 102,
    "upvote_ratio": 0.84,
    "num_comments (reported by reddit)": 41,
    "url": "https://www.reddit.com/r/tifu/comments/1jcxz4q/tifu_by_almost_sitting_on_a_stranger/",
    "id": "1jcxz4q",
    "selftext": "So I (27F) went to a rave for the first time with my friends last night. This is not my typical environment and I wasn't quite sure what to expect. Now, here is important information to remember, I have a genetic disease where I cant see well or at all  in low light environments. \n\nSo we get to the party, it's loud, it's crowded and I was ready to sit and enjoy a drink. After walking around for a bit, we finally see some chairs behind a sea of people. My friends squeeze in and I mindlessly followed them in my typical NPC state, taking the less crowded path on the other side. As i squeeze past the table, I go to take a seat on the empty spot that I thought I saw, except...y'know the spot was a living and breathing human! As my behind hovers above this poor unsuspecting victim my friend calls out to me and I realize my transgressions.\n\nImmediately,  I went into my regular reaction to embarrassment- paralysis! My friend stepped in and diligently apologized for me. After the fact, my friend was laughing and I laughed too but in the back of my mind I was wishing for certain death. I've now gained another thought to keep me up at night!\n\nTL;DR I couldn't see and almost sat on a stranger's lap.",
    "comments": [
        {
            "author": "Monstiemama",
            "body": "Babe, you were at a rave, people OD at raves, this was literally nothing, don’t be embarrassed!",
            "score": 114,
            "replies": [
                {
                    "author": "ggoatoats",
                    "body": "Thank you for this haha, I have immense social anxiety and have been ruminating for hours",
                    "score": 15,
                    "replies": [
                        {
                            "author": "Monstiemama",
                            "body": "Please don’t even worry, I promise you that at best, the person doesn’t remember and at worst, they thought it was funny. No need to expend your energy with fear 🎀",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "ggoatoats",
                                    "body": "This is so kind !!!",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Monstiemama",
                                            "body": "🎀💋",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "HammockTree",
                            "body": "Keep going to raves! Getting out around so many wonderful people did great things to alleviate my social anxiety and embrace who I am. I hope it can do the same for you!",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "ggoatoats",
                                    "body": "Honestly, I'm a huge metal head, and that's more my scene! Any time I have access to a music festival/event, I do try to go regardless of what it is just to get out.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "dogteal",
            "body": "Should have went all the way through with it like you meant it at that point.",
            "score": 21,
            "replies": [
                {
                    "author": "ggoatoats",
                    "body": "The only way to recover",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "BDED0275",
            "body": "Hell you might have made someone's day by accidentally sitting on their lap. An event that would live in their memory forever.",
            "score": 13,
            "replies": [
                {
                    "author": "ggoatoats",
                    "body": "Two sides of the coin! Lol I wonder if that's why he didn't say anything 😅",
                    "score": 8,
                    "replies": [
                        {
                            "author": "BDED0275",
                            "body": "He might be thinking about how different his night or his life might have gone if you'd completed the quest🤣. I can almost guarantee you it would have been an amazing conversation starter",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "ggoatoats",
                                    "body": "HAHA \"thats how i met your father\"",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "BDED0275",
                                            "body": "Exactly. Always think about your future",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "shesavillain",
            "body": "That was Princess Mia Thermapolis you almost sat on",
            "score": 8,
            "replies": [
                {
                    "author": "ggoatoats",
                    "body": "Of Genovia ? What an error I've made",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "cuavas",
            "body": "You'd better get all your raves done quickly, because pretty soon you'll feel too old for raves.",
            "score": 5,
            "replies": [
                {
                    "author": "ggoatoats",
                    "body": "Honestly, it's not for me  :[ but I like to try different things out!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "cuavas",
                            "body": "I wasn't having a go at you, just speaking from experience. After 30 (which is quite a few years ago for me now), raves and nightclubbing just feel like effort.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "ggoatoats",
                                    "body": "No I didnt think you were! I was actually agreeing haha. I'm naturally quite introverted and it was quite draining socially",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TwoDogsInATrenchcoat",
                    "body": "Those knees have a 20-year expiration date. Don't waste them, kids!",
                    "score": 1,
                    "replies": [
                        {
                            "author": "cuavas",
                            "body": "My knees are fine.  It’s my feet and ankles that complain about me for doing 20 km every day.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "carlyfries33",
            "body": "I have RP (eye condition that makes low light vision horrible) and relate so hard. My peripherals are very spotty due to the RP and sometimes people will try to hand me something and I just won't see it even in broad daylight. I could be looking directly at thier face but if thier hand is in my blind spots it will look like I'm completely ignoring them... \n\nLuckily my partner is usually there to intervene but I still get anxious about it especially when someone gets frustrated that I can't see them or what they are passing me. \n\nFun fact, short humans (mostly toddler) are always in my blind spots and I trip over them constantly... they aways seem to be less offended than adult though.",
            "score": 2,
            "replies": [
                {
                    "author": "ggoatoats",
                    "body": "I cant believe I found another RP haver on the  non-rp subreddit!! Thats my condition 😲",
                    "score": 2,
                    "replies": [
                        {
                            "author": "carlyfries33",
                            "body": "I was thinking that maybe yours is RP too!! \nHuh, I guess there would be a RP subteddit...",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DesertPunked",
            "body": "I'm surprised you didn't get hit with a \"you don't have to get up 🫠\"",
            "score": 2,
            "replies": []
        },
        {
            "author": "Unlikely_Race9177",
            "body": "Just came to say I read the title wrong. Almost sitting on someone is much better  :)",
            "score": 2,
            "replies": [
                {
                    "author": "ggoatoats",
                    "body": "Thank goodness almost haha",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "egriff",
            "body": "At the first house party I went to in college, I got drunk for the first time. Sat down on a sofa to get my bearings about me and put my hand on what I thought was an arm rest. \n\nIt was not an arm rest. It was the thigh of another guy. He said \"I'm a guy, dude\" and instead of apologizing and saying that I wasn't trying to touch him and that I thought I was reaching for an arm rest, I silently got up and walked away, which probably did not help whatever he might have been thinking.\n\nOver 20 years later and I still cringe. So, you are most certainly not alone.",
            "score": 2,
            "replies": [
                {
                    "author": "ggoatoats",
                    "body": "This story helped me so much! Haha. The silent flee has been my signature move for a while. Next time, I'll sweep a flashlight to be safe",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "PortableIncrements",
            "body": "This one time I came in late to a movie and it was pitch black so I walked to the nearest black void where a seat should reasonably be and it was, instead, a person on a seat. I was right though, there was technically a seat there\n\n\nEdit: he pushed me off his lap :(",
            "score": 2,
            "replies": [
                {
                    "author": "ggoatoats",
                    "body": "This made me snort laugh 😆 with my disability I either try to avoid movie theaters or force myself to get there very early for this reason",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "skjall",
            "body": "A month ago I was at a rave, met a girl I was having a grand time with. Soon after she started kinda passing out while awake, so we went to grab a seat for her to cool down. She started fully passing out, and would come back to consciousness in a minute or so, was throwing me off.\n\nAnyway she had had GHB, someone around me recognised it and got the paramedics. She ended up being carted off to the ambulance at the end of the night. She wasn't the only one heading off in the ambulance either 😅\n\nSo hey, could be worse.",
            "score": 2,
            "replies": [
                {
                    "author": "ggoatoats",
                    "body": "Oh my gosh!! I hope everything turned out okay 😭",
                    "score": 1,
                    "replies": [
                        {
                            "author": "skjall",
                            "body": "I got her Insta and she's been online since, so she's alive at least 🙏🏻\nShe didn't respond to me hoping she was OK, but I have a feeling she had no memory of the night and just woke up with a text from a complete random.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "cuavas",
                                    "body": "GHB, roofies, etc. are like that.  You can still kind of function but have no memories afterwards.  She’s lucky she wasn’t robbed or raped.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "demonbeastoffuck69",
            "body": "I s that really a bad thing. I don't know how you look, but if a woman sat in my lap, I wouldn't complain much . It might even turn out to be enjoyable.  So look and sometimes leap.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sajjadam1998",
            "body": "Well I wouldn’t mind u sit on me 😂",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThinNeighborhood2276",
            "body": "Sounds like an honest mistake given the circumstances! At least you have a funny story to tell now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Impressive_Western84",
            "body": "Wow, this is what keeps you up at night that you almost sat in a stranger at a Rave? Ugh.",
            "score": -2,
            "replies": [
                {
                    "author": "ggoatoats",
                    "body": "More so, coming to terms with my disability and dealing with difficulties in social environments due to it",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}