{
    "title": "TIFU by not properly updating my address with Progressive",
    "author": "svtf_gibbs",
    "subreddit": "tifu",
    "rank": 16,
    "score": 7,
    "upvote_ratio": 0.61,
    "num_comments (reported by reddit)": 6,
    "url": "https://www.reddit.com/r/tifu/comments/1jdeiv7/tifu_by_not_properly_updating_my_address_with/",
    "id": "1jdeiv7",
    "selftext": "Obligatory, this was a mess up over the past 5 years that just came to light today. \n\nSo in May 2020 I bought a house and moved to a different town/county. However the zip codes were VERY similar (made up zip codes but basically 76499 and 76449). The “town” I was moving out of was a city with a relatively high crime rate and the town I was moving to was much quieter and safer. \n\nWhen I moved, I updated my address with Progressive and have been regularly receiving mail from them at my house. My account is on autopay and I haven’t made any claims or changes in the last 5 years, so I don’t ever log in to my account or pay attention to the paper work. \n\nWell today I just happened to finally log into my account for the first time in years and I noticed my street address was right, but it had the old zip code. I figured I’d just update it quick so that it was correct and didn’t create any possible issues in the future. \n\nAs I was finishing updating the zip code, I was informed my bill would be dropping by $22 a month! For the last 5 years I’ve been overpaying for car insurance because I confused my zip codes. $1200+ given to Progressive for absolutely no reason. Certainly not a life changing amount, but infuriating nonetheless. \n\nI guess I should just be happy I finally got the savings on my car insurance I’ve been wanting lmao. \n\nTL;DR: 5 years ago I moved to a new town with a very similar zip code but a very different crime rate than my previous address. Updated my address with Progressive but used the wrong zip code. Finally updated it 5 years later and discovered I’ve been overpaying for car insurance the whole time. \n\n",
    "comments": [
        {
            "author": "euph_22",
            "body": "Could be worse. Could have needed the insurance and then got your claim rejected because of the error.",
            "score": 15,
            "replies": []
        },
        {
            "author": "Jaggar345",
            "body": "You can always call and ask them to backdate the change. They may not backdate it for 5 years but may be able to do something for you. Especially if you have proof you moved. Can’t hurt to ask them and see what they can do for you.",
            "score": 7,
            "replies": []
        },
        {
            "author": "melaniedubbs",
            "body": "I work in insurance, they can backdate this change with a copy of utility bill or other legal document proving the date of address change.",
            "score": 4,
            "replies": []
        },
        {
            "author": "usone32",
            "body": "You might be able to save like $100 a month with a different insurance company too!  I've found the lizard company and also the insurance through Costco is a lot cheaper.",
            "score": 0,
            "replies": []
        },
        {
            "author": "PheonixGalaxy",
            "body": "Ngl, I had a crush on the progressive girl as a kid.",
            "score": 0,
            "replies": []
        }
    ]
}