{
    "title": "TIFU By Reading The Word Receptionist",
    "author": "The_V8_Road_Warrior",
    "subreddit": "tifu",
    "rank": 4,
    "score": 217,
    "upvote_ratio": 0.9,
    "num_comments (reported by reddit)": 17,
    "url": "https://www.reddit.com/r/tifu/comments/1jdkvfq/tifu_by_reading_the_word_receptionist/",
    "id": "1jdkvfq",
    "selftext": "Just remembered this little incident while flicking through comments.\n\nI used to have a job where I went to businesses, schools, etc to empty the sanitary bins in ladies toilets, as well as other things like refill air fresheners, replace urinal mats etc. Not a glamorous job I know, but it's better than being on benefits and it kept a roof over my head.\n\nAnyway, one place I went to (everyone had set routes that were either weekly, fortnightly or monthly so we were  the regular service operative for said place we went to) was a little office and I pressed the buzzer to get let in. As I was waiting, I looked around and saw the word \"receptionist\" underneath the buzzer.\n\nUsually in situations like this, they answer and I just say \"I'm here to do the bins\". But today I had a complete brain fart and as soon as someone answered I blurted out \"I'm here to do the receptionist.....sorry, the bins! I'm here to do the bins!\"\n\nTo say it was awkward when I went to get the sheet to say that I'd been there and done what i had to signed by the receptionist would be an understatement. \n\nThankfully that office was one of my monthly routes so gave a bit of time for everyone to forget it ever happened but my coworkers didn't let me forget it for a while.\n\nTL:DR I unwittingly found myself in an adult film because of a brain fart\n\n",
    "comments": [
        {
            "author": "llamashatebabies",
            "body": "A month is not enough for anyone to forget that response!",
            "score": 71,
            "replies": [
                {
                    "author": "The_V8_Road_Warrior",
                    "body": "Thankfully it's was never mentioned again outside of my coworkers at the office lol",
                    "score": 20,
                    "replies": [
                        {
                            "author": "kevnmartin",
                            "body": "Don't feel bad. My husband still has this cringe to remember.He was working in his dad's gas station, back in the day when they used to check your oil after a fill up. This lady with enormous breasts got her car filled and he was going to check her oil. He meant to ask her to release her hood lock or pop her hood but what came out was \"will you pop your tits?\"",
                            "score": 23,
                            "replies": [
                                {
                                    "author": "The_V8_Road_Warrior",
                                    "body": "Ooo that's going to make you turn red quick",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "author": "kevnmartin",
                                            "body": "He about dies every time he remembers it.",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Cow_Launcher",
            "body": ">Not a glamorous job I know, but it's better than being on benefits[...]\n\nNot at all glamorous, I'm sure. And I imagine you saw things you'd rather not. \n\nBut it's necessary, honourable work and I hope nobody ever gave you shade for it. Respect.",
            "score": 25,
            "replies": [
                {
                    "author": "The_V8_Road_Warrior",
                    "body": "My sister did but she's a bitch and not worth my time.\nThe things I saw actually made me laugh. Apart from the obvious and underwear, no word of a lie I found socks, shoes, a jumper, a coat, someone's pay slip, a stethoscope (even though I was nowhere near a hospital or anything), glasses. And that's just what I remember off the top of my head",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Cow_Launcher",
                            "body": "Better than the usual stories we hear about ladies' restrooms. Most of those involve poop, finger smears of period blood, and the carnage from garden-sprinkler hoverpissing. \n\nNot too sure how someone leaves glasses behind though!",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Agret",
                                    "body": "Most likely they were reading glasses they put into a coat pocket and they fell out when they were bending to wipe.",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "The_V8_Road_Warrior",
                                    "body": "Oh no, I mean I found all those things IN the bins. Especially the coat and shoes, God knows how they got them in there. They're not exactly big bins and the chutes aren't exactly big either.\n\nSomeone actually pooed in a bin too. That was not a pleasant one I can tell you",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "rio-bevol",
            "body": "this is amazing. love it",
            "score": 4,
            "replies": [
                {
                    "author": "The_V8_Road_Warrior",
                    "body": "Was a good job, no two days were ever the same lol",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "XSmartypants",
            "body": "Thanks for sharing that, I needed that laugh today!",
            "score": 3,
            "replies": [
                {
                    "author": "The_V8_Road_Warrior",
                    "body": "Glad my embarrassment brings you joy 😂",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TieAdventurous6839",
            "body": "*I'm here to collect bins, and fuck the receptionist. Not necessarily in that order*",
            "score": 2,
            "replies": [
                {
                    "author": "The_V8_Road_Warrior",
                    "body": "😂😂😂",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Tom2Die",
            "body": "[relevant xkcd](https://www.xkcd.com/604/)",
            "score": 1,
            "replies": []
        }
    ]
}