{
    "title": "TIFU took a gas station boner pill drink",
    "author": "nyraqkne",
    "subreddit": "tifu",
    "rank": 1,
    "score": 3586,
    "upvote_ratio": 0.92,
    "num_comments (reported by reddit)": 302,
    "url": "https://www.reddit.com/r/tifu/comments/1jduivz/tifu_took_a_gas_station_boner_pill_drink/",
    "id": "1jduivz",
    "selftext": "So about last week I went to a Walgreens-Urgent Care combo since my partner needed to get a urine test for a UTI. While waiting around for the appointment to be finished, I ended up looking in the sexual wellness section because I needed lube and sometimes like to laugh at the strange male sex health products. \n\nSince all I hear about gas station boner pills is that they’re snake oil and do not do anything, I had the bright idea of trying one out. I spotted one on the shelf that seemed the most interesting, the Extenze Original Formula Male Enhancement drink. Cherry flavor to top it off. The package was covered in a strange sticky substance (should’ve taken it as a sign) but said screw it, grabbed it and checked out. \n\nThat drink sat in a cabinet for a week but we both agreed to try it out when the UTI passed and we were both in the mood. That day finally came and I grabbed that bottle, ripped the top off, and took a massive swig like I was in the desert and dying of dehydration. \n\nThe first 30 minutes, I felt nothing. After that, I entered hell. \n\nThat shit made me feel like the incredible hulk. That shit made be feel like the terminator. That shit made me feel like the predator. That shit made me feel like max payne. That shit is what Hunter S Thompson was on when he was writing The Rum Diary. I could feel my heart beating out of my chest and I do not know if it was even beating in time. I thought I needed to go get an EKG but took a muscle relaxer instead to kill the feeling. Probably one of the worst feelings I’ve ever had and I do not recommend it. \n\nTL;DR:\n\nTook a gas station boner pill, felt like I was going to have a heart attack. Never doing that again. ",
    "comments": [
        {
            "author": "iupvotegood",
            "body": "Did you get a boner or not?",
            "score": 1971,
            "replies": [
                {
                    "author": "nyraqkne",
                    "body": "Nope",
                    "score": 2214,
                    "replies": [
                        {
                            "author": "Queer_Advocate",
                            "body": "This is this saddest story I have read today. That's impressive given the climate we're in.",
                            "score": 1032,
                            "replies": [
                                {
                                    "author": "tuppensforRedd",
                                    "body": "You didn’t see the 60 minutes Marine Band story",
                                    "score": 89,
                                    "replies": [
                                        {
                                            "author": "Conscious-Desk-694",
                                            "body": "No boners for them either???",
                                            "score": 92,
                                            "replies": [
                                                {
                                                    "author": "Queer_Advocate",
                                                    "body": "No they had one. \nThe trombone.",
                                                    "score": 85,
                                                    "replies": [
                                                        {
                                                            "author": "orangejuice82",
                                                            "body": "A trombone-r",
                                                            "score": 49,
                                                            "replies": [
                                                                {
                                                                    "author": "Queer_Advocate",
                                                                    "body": "I just realized we took em in college then got smash. Yeah I can confirm the wisky dick experiment didn't go in our favor.",
                                                                    "score": 11,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "RootCubed",
                                                            "body": "Was it rusty?",
                                                            "score": 12,
                                                            "replies": [
                                                                {
                                                                    "author": "atrajicheroine2",
                                                                    "body": "More of a blumpkin situation",
                                                                    "score": 7,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "A_wild_so-and-so",
                                                            "body": "Womp womp",
                                                            "score": 7,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "cuavas",
                                                            "body": "A sad trombone?",
                                                            "score": 6,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "bgva",
                                                    "body": "I'm laughing harder than I should at this.",
                                                    "score": 8,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Gunfighter9",
                                                    "body": "The Marines held a nationwide contest for high school musicians who were minorities and the winners were supposed to play a concert with the President's Own band, but Trump's DEI forced the Marines to have to cancel the concert.",
                                                    "score": 10,
                                                    "replies": [
                                                        {
                                                            "author": "brongchong",
                                                            "body": "Good.  Pick the best, regardless of race, color, creed, sex, or orientation!",
                                                            "score": -8,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Queer_Advocate",
                                            "body": "I font have cable\nI don't do MSM, not the major ones. 60 min is what PBS. I look for it before bed.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "DirectorBiggs",
                                    "body": "lol!!!😂",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "OpeningPublic",
                                    "body": "What was the second saddest story? I feel like I need to know....",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Queer_Advocate",
                                            "body": "I woke up this morning, ZERO SMALL PENIS growth oocaured after 200 days. I the exercisea every 30 min around the clock. Oh, the chaffing. I'm stuck with a wee pp.. Littlefoot is highly forgled though!",
                                            "score": -8,
                                            "replies": [
                                                {
                                                    "author": "Queer_Advocate",
                                                    "body": "What sad soul is upset about my self deprivation humor about my life pp? Get a life.",
                                                    "score": -4,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "0tacosam0",
                                    "body": "Have You have not read much news today ?",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "Snowman25_",
                                            "body": "How would the news give you a boner?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Queer_Advocate",
                                                    "body": "Hard news day.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ToWitToWow",
                            "body": "He told you he didn’t. He said he felt like the Hulk. The super hero who—  at minimum—doubles his mass, but the crotch of his pants never rips.",
                            "score": 87,
                            "replies": [
                                {
                                    "author": "Krynn71",
                                    "body": "I'm gunna make a porn where my character is named Kluh, and my dick rips through my pants whenever someone makes me horny. \n\n\nAlso... It turns green.",
                                    "score": 45,
                                    "replies": [
                                        {
                                            "author": "ToWitToWow",
                                            "body": "You bastard. I’m in. But if Kluh’s dick turns green for more than three hours, Kluh should really consult a physician. Or at least a Night Nurse",
                                            "score": 32,
                                            "replies": []
                                        },
                                        {
                                            "author": "Scherzkeks",
                                            "body": "Put your gherkin away,  Kluh",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "OkSmoke9195",
                                            "body": "That is r/oddlyspecific ,\nI like the cut of your jib ",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "NicTheQuic",
                                    "body": "Of course it has to stay small bc so it doesn’t get snagged on underbrush n things.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "EnvironmentalForm470",
                            "body": "If it’s any consolation, I got a boner.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "goat_penis_souffle",
                                    "body": "Second hand boner? That shit is really powerful.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "__eros__",
                            "body": "I gotta say, it doesn't sound worth it to me",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "BaronVonBooplesnoot",
                            "body": "That actually surprises me. A handful of those actually have unregulated amounts of sildenafil in them. I tried a similar test about 10 years ago and wound up buying more. Same thing \"I feel like GOD! Wait, no, fuck god. I FEEL LIKE I COULD FUCK GOD!\"",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "Theistus",
                            "body": "Yeah, you drank crystal meth",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "rumog",
                            "body": "You felt like the Terminator with no boner??!   I truly don't know....I don't know how to end that thought really, I guess it was just surprising.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "SeeWhatSantaBrings",
                            "body": "Since it's not clarified in the OP or first few responses, I'm unsure if you're a woman taking them for the lolz or actually the intended target consumer.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "QuintanimousGooch",
                            "body": "🥀",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "slylock215",
                            "body": "My friend just recently told me the ancient greek story of Priapus, someone cursed by the gods to have a giant cock that was hard all the time until he went to have sex, in which case it went flaccid.\n\nYou're welcome.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Yourownhands52",
                            "body": "What a waste lol",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "_ScubaDiver",
                            "body": "The comment is currently on 669 upvotes. This seems like a gloriously fitting mix between the 69 you were (amusingly) deprived of, and 666 or 667 as the substance you drank being the pharmaceutical equivalent of demonic hellspawn.\n\nEdit: wording",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "brakeb",
                    "body": "it's an innie not an outie...\n\nprobably about 8 million mg of caffeine...",
                    "score": 31,
                    "replies": []
                },
                {
                    "author": "MinnMoto",
                    "body": "I was hoping for a good raging boner story. Damn. Flaccid as ever.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "StoneGoldX",
                    "body": "![gif](giphy|5xtDarw8YSGIGzLi3yU|downsized)",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Skunktoes",
                    "body": "Asking the real questions",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "Weak_Swimmer",
                    "body": "Asking the important questions, lol",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Im_A_Long_Boi",
                    "body": "Not all heroes wear capes....",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Ali_Cat222",
                    "body": "You know I'm almost glad OP be didn't get a boner because if he's talking about acting like the predator and Max Payne and all that shit that girls can have another UTI within a day 🤣🤣🤣🤣 I cannot stop laughing when writing this comment 😂",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Nosereddit",
                    "body": "he was busy surviving the hearth attack",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "CatPurrsonNo1",
                    "body": "Asking the important questions!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "birdnumbers",
                    "body": "asking the real questions",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "IBJON",
            "body": "I'm no doctor, but mixing whatever this was with a muscle relaxer was the real fuck up ",
            "score": 4699,
            "replies": [
                {
                    "author": "lintheamazon",
                    "body": "I thought the story was ending in the hospital after that detail",
                    "score": 1062,
                    "replies": [
                        {
                            "author": "MynorVornaX",
                            "body": "Just imagine the nurse’s face when you explain that combo! 🤣",
                            "score": 266,
                            "replies": [
                                {
                                    "author": "goat_penis_souffle",
                                    "body": "The coroner felt cheated that they didn’t get to use the “gas station boner pills” option on the death certificate generator.",
                                    "score": 118,
                                    "replies": [
                                        {
                                            "author": "snoopyh42",
                                            "body": "I'm sure there's a medical billing code just for that.",
                                            "score": 16,
                                            "replies": [
                                                {
                                                    "author": "highland_redhead",
                                                    "body": "T50.905A - Adverse effect of unspecified drugs, medicaments, and biological substances, initial encounter, or maybe N50.8 – Other specified disorders of the male genital organs",
                                                    "score": 29,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "LynnShieldsx",
                                    "body": "Definitely a ‘hold my beer’ moment for the nurses! 😂",
                                    "score": 105,
                                    "replies": [
                                        {
                                            "author": "snoopyh42",
                                            "body": "\"Hold my boner drink!\"",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "pl1974",
                                    "body": "Trust me. An ER nurse would not bat an eye at this.",
                                    "score": 22,
                                    "replies": []
                                },
                                {
                                    "author": "douggroc",
                                    "body": "i am a nurse and i had a patient in that exact situation. he ended up needing an open heart from a gas station boner pill mix.",
                                    "score": 11,
                                    "replies": []
                                },
                                {
                                    "author": "Prudent-Acadia4",
                                    "body": "Horse boners",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "whamburgers",
                            "body": "He just Yada yada'd the end of that story",
                            "score": 53,
                            "replies": [
                                {
                                    "author": "M4GN3T1CM0N0P0L3",
                                    "body": "No, he mentioned the muscle relaxer.",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "unfvckingbelievable",
                                            "body": "Exactly.\n\nAnd after the muscle relaxer, he's just gonna yada yada through pretty much everything.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "EmmaStarkn",
                            "body": "At that point, I was ready for anything to calm that chaos down!",
                            "score": 23,
                            "replies": [
                                {
                                    "author": "TLeeLucky",
                                    "body": "r/emmastarkin \"At that point, I was ready for anything to calm that chaos down!\"\n\nOP? You forgot to switch back accounts before commenting in the first person. Lol.\n\nEdit: To include message and redditor.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "whimsical_trash",
                    "body": "Seriously DO NOT DO THIS. Mixing uppers and downers could kill you",
                    "score": 285,
                    "replies": [
                        {
                            "author": "JonatasA",
                            "body": "I thought uppers and downers were amphs and bezos.",
                            "score": 30,
                            "replies": [
                                {
                                    "author": "SwarleySwarlos",
                                    "body": "Uppers are generally stimulants, basically everything that drives your bodies functions into overdrive. This includes amphetamines, cocaine, etc but technically also stuff like coffee, although that's not really what people consider uppers.\n\nDowners are the opposite of that, slowing stuff down, like benzos, opiates etc.\n\nThe biggest risk in mixing uppers and downers is that you take too much of one, and when the other one stops working the balance you had is off and you overdose. This is how most people on speedballs die (heroin + cocaine).\n\nBut mixing uppers and downers is not generally bad, healthcare professionals stop an overdose of one by giving you the other (very broadly speaking)",
                                    "score": 139,
                                    "replies": [
                                        {
                                            "author": "McGryphon",
                                            "body": ">technically also stuff like coffee, although that's not really what people consider uppers.\n\nYou say that, but a while back I heard someone at the boulder gym describe \"bouldering speedballs\".\n\nIt's when you take preworkout *and* smoke some weed before starting the session.\n\nI think it's the most wholesome speedballs variant I've heard of.",
                                            "score": 69,
                                            "replies": [
                                                {
                                                    "author": "penquil",
                                                    "body": "Coffee and weed is called a \"Hippie Speed ball\" where im from",
                                                    "score": 31,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "MoonManPrime",
                                                    "body": "This sounds very, ah, Boulder.",
                                                    "score": 11,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "whimsical_trash",
                                                    "body": "We used to get lattes and drive to the mountain, then smoke a blunt and go snowboarding. Gets you fucked up at 7am, but pretty dang wholesome. And fun!",
                                                    "score": 36,
                                                    "replies": [
                                                        {
                                                            "author": "Queer_Advocate",
                                                            "body": "Did that. Broke my arm on the bunny slope snowboarding. Pretty fucking embarrassing in hindsight, rescue patrol had to get call: Overzealous snowboarder down on the bunny slope. He caught more air than he can handle, appears stoned and jittery at the same?",
                                                            "score": 5,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "IR2Freely",
                                                    "body": "I do that for just a normal workout. Caffeine for stamina and vape weed for endurance. Weed supposedly increases the amount of oxygen in your bloodflow. When i take both I am noticeably more comfortable. I only drink coffee when I go to the gym cos I dont like the effects otherwise",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "spider-nine",
                                            "body": "Even mixing alcohol and caffeine can be a dangerous combination, such as Four Loko.",
                                            "score": 15,
                                            "replies": []
                                        },
                                        {
                                            "author": "F0R_T3H_LULZ",
                                            "body": "Been prescribed Adderall and Klonopin at the same now for many years. They work wonderful together when you don't abuse them and don't do dumb shit.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "whimsical_trash",
                                    "body": "That is one upper and one downer, there are many many of them. Upper = stimulant of any type. Downer = depressant. Stimulant and depressant describes what it is doing to your body, speeding it up or slowing it down (in an oversimplified sense).",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "author": "JonatasA",
                                            "body": "So it is a more broad and general term then, thanks.\n\n&nbsp;\n\nIt's just weird, because when people use terms like stimulants they often don't refer to coffee, they use it in the context of specific substances.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "No_News_1712",
                                    "body": "Jeff Bezos",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "OkSmoke9195",
                                            "body": "Jeff benzos",
                                            "score": 19,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Pure_Expression6308",
                                    "body": "Alcohol is a downer",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "Nitro721",
                                    "body": "In this case, 'uppers' and 'downers' could be taken in a whole other context… 🍆",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "trinialldeway",
                                    "body": "Bezos? What do you mean? Because he's jacked?",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "TakeOnMe-TakeOnMe",
                                            "body": "It was a typo initially. They meant to type “benzos” but after the typo other people started making jokes.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "author": "JonatasA",
                                                    "body": "Yes it was a typo, I am sorry (and it took some fighting with the keyboard to get everything right this time).\n\n&nbsp;\n\nI should record it some day, it's crazy (and so are the keys I manage to hit).",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "thedirtydave696969",
                            "body": "Idk, alcohol and addy go together like cocaine and waffles.  Top tier combos.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ThanklessTask",
                    "body": "And that, doctor, is how I shat my pants with a raging boner.",
                    "score": 31,
                    "replies": []
                },
                {
                    "author": "StratoVector",
                    "body": "I'm no doctor either, but I suggest getting the boner embiggen juice was the real mistake from the start",
                    "score": 12,
                    "replies": [
                        {
                            "author": "RabidDrZaius",
                            "body": "Really? I think it was a perfectly cromulent idea.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "rumog",
                    "body": "😭😭😭",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "meowzicalchairs",
                    "body": "All about them uppers and downers, right?",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "JonatasA",
                    "body": "People do not take muscle relaxers seriously enough!",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 4,
                    "replies": [
                        {
                            "author": "RepulsiveContract475",
                            "body": "You say you know what you're talking about, but you don't. \n\nYou wouldn't, or shouldn't, give someone having a heart attack CPR unless they don't have a heart beat. The goal of CPR is to keep blood moving and oxygenated along with artifical ventilation (mouth to mouth), it has nothing to do with restoring heart rhythm. There are only a couple of of arrhythmias that can be treated with defibrillation, namely ventricular defib or ventricular tachycardia. Asystole, which is where the heart isn't beating at all, can't be helped with a shock.",
                            "score": 9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "r0botdevil",
                    "body": "Yeah I'm not a doctor quite yet either, but I am about halfway through med school and I concur. Holy *shit*, OP, that was not a good decision.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Queer_Advocate",
                    "body": "I play one tv and agree.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "k_mon2244",
                    "body": "I am a doctor, and that part gave me a heart attack",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "QuercusSambucus",
            "body": "Wikipedia says that your reaction is most likely coming from [yohimbe extract](https://en.wikipedia.org/wiki/Yohimbine). It's used to wake up dogs when they've been sedated.",
            "score": 648,
            "replies": [
                {
                    "author": "cohonka",
                    "body": "Lol I came to the comments to ask OP if it had yohimbe. When I was in my late teens, after a long-term childhood interest in herbal medicine, I began to experiment heavily with the stronger plants: cannabis, kava, kratom, kanna, blue lotus, opium, etc.\n\nMost plants I liked enough to try multiple times. Yohimbe was the worst drug I've ever taken (aside from this one time when I actually ate the brown \"acid\")\n\nWasn't doing it for horniness. Back then I was more \"let's read extensively about this on Erowid, take a dose, lay still and see what happens\".\n\nCan't remember how much I took. It was just pure yohimbe. But a half hour later I grew irrationally agitated. Skin crawling discomfort. Hot and mad and mad. Heart racing. anxiety. Mad, hot, itchy, discomfort. Mad. \n\nYohimbe made me feel like a jerk to no one. I was lashing out at nothing but generally mad at not myself for this discomfort. It sucked. \n\nI've done almost every mainstream drug aside from PCP, and yohimbe was the worst with crack a close second.",
                    "score": 361,
                    "replies": [
                        {
                            "author": "Kevin_Uxbridge",
                            "body": "Well, not to send you on an unholy quest but the folks I know who indulge in recreational chemistry say salvia is one of the worst.  Don't think anyone tried it twice.",
                            "score": 111,
                            "replies": [
                                {
                                    "author": "cohonka",
                                    "body": "I smoked salvia several times and it was unpleasant every single time but the first. The first time I smoked it it pushed me right over the edge from my normal reality to perceiving myself as some kind of demigod chained to one of an uncountable number of pillars with similar demigods fastened to them, sort of like spokes on a wheel the size of infinite universes. And like a roulette wheel it was spun and after a rapid revolution I slowly clicked into several different dimensions, ultimately ending up in one very similar to where I'd started except noticeably different in that in my salvia trance I had stood up and walked several yards away from my starting point.\n\nSalvia was the first time I broke through to the other side so to speak. \n\nBut I never was able to use it again to the same level. Later attempts were still interesting but never did I seem to be transported outside of my normal dimension.",
                                    "score": 146,
                                    "replies": [
                                        {
                                            "author": "MaxMischi3f",
                                            "body": "Damn, and you ended up in *this* shithole dimension? Tough break.",
                                            "score": 99,
                                            "replies": [
                                                {
                                                    "author": "cohonka",
                                                    "body": "There are worse! But yeah woulda been cool to land just a few notches over in a more utopian layout",
                                                    "score": 43,
                                                    "replies": [
                                                        {
                                                            "author": "Shanguerrilla",
                                                            "body": "That reminds me of the first times I tripped as a teen.  I remember feeling like I was meeting myself for the first time and I wasn't who I knew before.... felt like at the end of each trip you come out a different person than before.\n\nIn a way we do, everyday, whether we pick who that is or let it be picked for us.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "cohonka",
                                                                    "body": "Yeah my takeaway from that trip was basically, every moment is a new reality. There are infinite branching paths leading off from every moment. \n\nWhether I have a choice in the matter or it's all predetermined I still haven't decided my thoughts on but it's more like a, yes and no situation.",
                                                                    "score": 10,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Shanguerrilla",
                                                                            "body": "Exactly.  This stuff is so hard to talk about too, makes me sound like a burn-out and I always feel like I'm slow and can't put this stuff to words.\n\nThat's still my favorite psychedelic-type 'trope' thought experiment.\n\nIt's like there's a jumpoff point too from the branching paths of every moment and every moment a new reality 'for us'--where you pull away from ego and yourself as an individual into the 'what is time' 'we are all one' and we're all from the source or are the source psychedelic thinking.\n\nI think the full circle of that very ethereal concept would be beneficial to society for more of us to stay less distant from, at least in function rather than the opposite of division and ego-centrism we are all barrelling for the rest the time in the west.\n\nedit- also for myself I don't even have doubt (in my answer to myself) that there is no predetermination, there are instead presuppositions and consequential events I determined earlier.  As well as RNG, life is random too and some shit just happens outside our control, but I think I determine what happens within the confine of what I do control.  The trick is like the coffee-church about power and peace, with the change being the wisdom to know the difference.",
                                                                            "score": 4,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "KerseTV",
                                                    "body": "We all did. They just figured it out for themselves.",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "No-Picture4119",
                                            "body": "I was pretty sure I had died and was in purgatory.  My wife, when she finished laughing over her spaghetti and tv show, brought the dog over to me and had me pet the dog for an hour, assuring me that I was still alive.  I told her I forgot how to multiply. We both rolled the dice, and she actually enjoyed herself.",
                                            "score": 30,
                                            "replies": []
                                        },
                                        {
                                            "author": "Romeo_horse_cock",
                                            "body": "I've tried it twice and I don't remember anything besides my hands becoming the grass I was sitting on.",
                                            "score": 11,
                                            "replies": []
                                        },
                                        {
                                            "author": "shes-sonit",
                                            "body": "I was a tin can rolling down a bowling alley wrapped in a thorny vine.",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "author": "cohonka",
                                                    "body": "Sounds about right for the general unpleasantness of later trips haha",
                                                    "score": 5,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "thehighepopt",
                                                    "body": "I think I read that in s Tom Robbins novel",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "bendbars_liftgates",
                                            "body": "Damn the one time I did salvia I thought my TV fell off the stand but it didn't.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "MatchesForTheFire",
                                                    "body": "The one time I did it (huge bong rip) I felt like I fell through a wormhole on the 2nd story apartment balcony we were sitting on. It kinda sounds fun, but it was not.",
                                                    "score": 6,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "poopoopooyttgv",
                                                    "body": "I had one of those old huge glass screen tvs and when I smoked salvia I thought I was trapped inside its reflection, like the Superman mirror prisons lol",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Landon_Mills",
                                            "body": "lol i got the “rolodex of dimensions” treatment as well, felt exactly like you described",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "MeoMix",
                                    "body": "I've tried it a few times. It sucks, but there's worse. I would never fuck with Datura nor would I ever even jokingly suggest anyone else fuck with Datura.",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "edbutler3",
                                            "body": "Oh yeah... I was reading the Salvia posts, thinking that was Jimsonweed -- but that's actually Datura. \n\nI never tried it, but if you can believe *anything* from the Carlos Castenada books, it must be some crazy shit.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Romeo_horse_cock",
                                    "body": "My husband has smoked it several times. After his last time of getting stuck in an angry/joker laugh fit for like 30 mins he decided that was enough. You can just buy it at shops in San Francisco",
                                    "score": 11,
                                    "replies": []
                                },
                                {
                                    "author": "mjrubs",
                                    "body": "The one time I successfully tripped on salvia I ended up on a surreal empty circus midway just running endlessly in circles like I was on a carousel\n\n\nThen I snapped out of it and realized I was in the middle of my backyard and I started dying laughing.  I must've ran down my stairs then out my back door and down my sidewalk.  \n\n\nThe only reason I never tried it again was because I didn't want to do it alone again, and didn't really have anyone I was comfortable going to like \"hey can you babysit me while I take bong rips of this weird plant I got off the internet that may or may not send me traveling through rips in the fabric of reality?\"",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "gomicao",
                                    "body": "I have a pretty complex relationship with Salvia. Though I have not used it in a long long time and don't know when I ever will need to again. It felt like every time I did it, she became a little more friendly. The last time I did it was in a pretty severe depression over 10 years ago and the experience was one of the most loving and beautiful all accepting experiences I have ever had. And unlike any other salvia experience I have ever had previous to that. I just never felt like I needed to go back after that one, felt like it might be acting greedy and I would be punished. It was one of the most positive experiences of my life LOL. And I have been a drug nerd for over 20 years so I am plenty experienced with a pretty expansive set of things. +1 for salvia in the right place and time!",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "RobertDigital1986",
                                    "body": "I tried salvia once about 25 years ago. \n\nOnce.",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "d3gu",
                                    "body": "I bought and smoked a salvia joint when it was legal to purchase, you could just buy one at musical festivals for £5 from various headshop style vendors. Bear in mind this was 2004, I was 16 and hadn't even smoked a cigarette before.\n\nThe effects were super intense, I felt like the sky was falling down on me as I lay on the grass and tried to deal with the impending doom. It apparently didn't last very long, but it seemed like a long time for me haha",
                                    "score": 4,
                                    "replies": []
                                },
                                {
                                    "author": "shes-sonit",
                                    "body": "Yup, I was only in for that one once\nComplete out of body\nI could see how someone could die taking that shit",
                                    "score": 2,
                                    "replies": []
                                },
                                {
                                    "author": "Headjarbear",
                                    "body": "I’ve had good an bad trips on salvia, it only lasts like 15mins. Those horror stories are usually people with no experience downing 100x salvia",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "JonatasA",
                                    "body": "Dont they use this as a sweetner in coke®?",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "author": "SwarleySwarlos",
                                            "body": "That's stevia. They have a few slight differences.",
                                            "score": 31,
                                            "replies": [
                                                {
                                                    "author": "Theo_95",
                                                    "body": "Just minor stuff, like being in a completely different order of plants.",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "OzymandiasKoK",
                                            "body": "You're thinking of HFCS, which is a different thing entirely.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "zorflax",
                            "body": "What plants did you enjoy most?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "cohonka",
                                    "body": "Favorite plant overall is dandelion. Favorite in the high category are probably kava and opium (though I only got to try opium once).",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "cultured_yogurt",
                                            "body": "Wait what does dandelion do for you? I had no clue that it had any sort of effects. How did you consume it?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "cohonka",
                                                    "body": "Didn't mean to imply dandelion gets you high. It's just my favorite plant. Every part is edible (though the stems are nasty raw. It's just tasty and good for you.",
                                                    "score": 7,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "anickseve",
                                            "body": "Oh man... I haven't mixed Kava in years. I gotta go find a new group to mix with...",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Stonerish",
                            "body": "I’d recommend trying PCP and related analogues…some interesting times to be had",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "JonatasA",
                            "body": "Your description sounds like sideffects of a prescription drug ironically.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "SeekerOfSerenity",
                            "body": ">yohimbe was the worst with crack a close second.\n\n\nWhat happened with crack?  I thought people loved it. ",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "RedneckAngel83",
                                    "body": "Ehh, as a late teenager (I was really fucking stupid) I tried to become addicted to Crack for about a week.  Worst high ever.  The ONLY effect it had on me was that my ears rang like I was trapped in a small box. \n\nThankfully, putting it down was easy.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "natgibounet",
                            "body": "Now you made me want to try it",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Shanguerrilla",
                            "body": "The skin sensation is so weird.  I get it super strong with some energy drinks nowadays (from the same thing, presumably).",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Sandpaper_Pants",
                            "body": "Did you own a copy of the book, Legal Highs?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "laturalus",
                    "body": "Second that yohimbe extract is the culprit.  Some people including myself have a bad reaction to it, not only does it make your heart feel real dodgy but my stomach also feels, sus.  \nRemember that scene in Deadpool where he is locked in the chamber and is kept at just enough oxygen to make sure he is right on the edge of asphyxiation?  Youhimbe keeps me edging on a panic attack.  Extense products especially have this in them and for this, I will rate them a .05/5 boners.   Yes it gives you an erection.     But at what cost?",
                    "score": 118,
                    "replies": [
                        {
                            "author": "Zestyclose-Ad-7576",
                            "body": "So, let’s say, “someone”, with say, anxiety issues and had a heart attack, should NOT try the gas station boner pills. Now having said that, do you think that the gas station sushi would be good for dinner?",
                            "score": 18,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Shanguerrilla",
                    "body": "OMG maybe that's why a couple years ago when I'd try my wife's Celsius energy drinks I'd feel like OP. \n\nEditor's note- I'm even dumber than OP.  I had a genetic heart thing that last year required open heart and was already diagnosed with 'severe heart failure'.   I drank more than one... had to MAKE SURE it was from that.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "lkeels",
            "body": "The biggest TIFU was adding a muscle relaxer on top of something you made no effort to see the contents of. Learn from THAT mistake. You literally could have killed your ability to breathe.",
            "score": 492,
            "replies": [
                {
                    "author": "CuriousLynxo",
                    "body": "That combo sounds like a risky gamble!",
                    "score": 29,
                    "replies": []
                },
                {
                    "author": "JonatasA",
                    "body": "Are muscle relaxant nervous system depressors?",
                    "score": 7,
                    "replies": [
                        {
                            "author": "lkeels",
                            "body": "They are respiratory depressors because they are sedatives (per the Cleveland Clinic website).",
                            "score": 28,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "alang",
                    "body": "Yeah beta blocker would have been the smart choice here.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "lkeels",
                            "body": "Not sure about that either. without knowing what else was in the Extenze, it might have had a vasodilator. That coupled with a beta blocker could have dropped OPs blood pressure dangerously low. Even combining a beta blocker with viagra or cialis has to be done with care.\n\nIf the Extenze was just caffeine, probably not a bad idea. But I'm betting it has other \"junk\" in it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "t40r",
            "body": "Idk if I would describe myself as “the predator” while taking a boner pill. But to each their own provolone 😂",
            "score": 196,
            "replies": [
                {
                    "author": "DudesworthMannington",
                    "body": "![gif](giphy|zeqgtki9ifa7u)",
                    "score": 54,
                    "replies": [
                        {
                            "author": "ADMINlSTRAT0R",
                            "body": "I looked up the skit. Pretty funny  \n https://youtu.be/_q7ZyUwZoQk",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "NoShowbizMike",
                                    "body": "Full Emmy Intro:\nhttps://youtu.be/wW1-4gb6Xjw",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Dizzy_Philosophy1976",
                    "body": "I’m just imagining OP doing the Predator Roar and pose, face crab and all, so I mean it was funny at least",
                    "score": 14,
                    "replies": [
                        {
                            "author": "JonatasA",
                            "body": "I'm certain they wanted to disappear.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Dizzy_Philosophy1976",
                                    "body": "Just gotta watch for that shimmer",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "OzymandiasKoK",
                    "body": "You aren't one ugly motherfucker?",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "blackop",
            "body": "Bro it goes in your ass.",
            "score": 63,
            "replies": [
                {
                    "author": "Outrageous-Row5472",
                    "body": "Good news. It's a suppository!",
                    "score": 23,
                    "replies": []
                },
                {
                    "author": "SmokinSkinWagon",
                    "body": "Butt chug it!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Hallelujah33",
            "body": "I took a gas station energy pill once and after puking 5xs ended up laying in the bed on my back listening to my heart pounding echo off the ceiling. Would not suggest.",
            "score": 51,
            "replies": [
                {
                    "author": "whiterussian802",
                    "body": "I did the same and puked so hard I thought I was going to turn into a werewolf… NEVER again",
                    "score": 22,
                    "replies": [
                        {
                            "author": "lintheamazon",
                            "body": "Gotta puke those pesky human guts up so the werewolf ones can grow in 👀",
                            "score": 19,
                            "replies": []
                        },
                        {
                            "author": "Hallelujah33",
                            "body": "Happy cake day.\n\nI mainly thought I was going to have a heart attack at 19 years old.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Optimal-Talk3663",
            "body": "Set a watch alert on AskReddit because this scenario comes up as a question quite often",
            "score": 39,
            "replies": [
                {
                    "author": "aluki90",
                    "body": "I legit saw a post about this maybe 2 weeks ago and none of the stories were good! Except one guy said he would only take 1/3 of one and that was the sweet spot I guess?",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "King_of_the_Hobos",
            "body": ">That shit made me feel like the incredible hulk. That shit made be feel like the terminator. That shit made me feel like the predator. That shit made me feel like max payne.\n\n\n>Probably one of the worst feelings I’ve ever had and I do not recommend it.\n\nI feel like I'm getting mixed messages here",
            "score": 38,
            "replies": [
                {
                    "author": "SeanAker",
                    "body": "I legit thought this was going to be one of those weird ad posts that think they're subtle and clever until the last bit. ",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "StockExplanation",
                    "body": "Right, I thought that he was about to start go on demon time in the bed.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Visoth",
            "body": "NY was an unspecified age male, ☝️🤓 presenting to the emergancy room with gas-station-boner-pill-emia.\n\nEmia meaning presence in blood. High Gas Station Boner Pill presence in blood.",
            "score": 95,
            "replies": [
                {
                    "author": "darth_malmal",
                    "body": "Did not expect to see a Chubbyemu reference here",
                    "score": 21,
                    "replies": []
                },
                {
                    "author": "rpithrew",
                    "body": "Lol",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "JoeFabitz331",
            "body": "It was really \"hard on\" your heart",
            "score": 21,
            "replies": [
                {
                    "author": "C00k1eJar",
                    "body": "No, it gets your heart on.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "PM_WORST_FART_STORY",
            "body": "I really want to buy one of those rhino shaped pills. Not to use,  just to frame it as art. 🦏💊",
            "score": 16,
            "replies": [
                {
                    "author": "Charadanal",
                    "body": "They work",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "meagainpansy",
            "body": "Man how you gonna tell that whole damn story and not even tell us about your boner?",
            "score": 16,
            "replies": [
                {
                    "author": "kawaiipogglet",
                    "body": "OP said in a comment they didn't get one, after all that lmao",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "TaylorWK",
            "body": "The type of person to take a muscle relaxer after taking an unknown pill is the type of person to take unknown pills from a gas station",
            "score": 29,
            "replies": []
        },
        {
            "author": "skizem",
            "body": "A lot of those drinks and pills contain undeclared sidenafil (viagra). \nThere is a huge risk for people taking those and then going into a cardiac episode, as nitroglycerin and sildenafil can tank your blood pressure and kill you.",
            "score": 75,
            "replies": [
                {
                    "author": "lintheamazon",
                    "body": "I'm hoping the above comment gets more upvotes because this should be further up, this is legitimately life endingly dangerous",
                    "score": 18,
                    "replies": [
                        {
                            "author": "MyvaJynaherz",
                            "body": "Hard-on, heart-off?",
                            "score": 11,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "krebstar4ever",
                    "body": "And often, each pill/drink is equivalent to *many* doses of Viagra, which makes it even more dangerous.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Davido401",
                            "body": "Wait, America can sell that shit in a petrol station over the counter? Viagra can only be bought off a Pharmacy, or through a doctor(it used to be prescription only) but you guys can get Viagra juice in a Gas station (I've used Petrol above and Gas here, am a terminally online Scotsman)",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "natgibounet",
                                    "body": "Yeah it sucks in here, but the bright side we can order off the internet",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Davido401",
                                            "body": "Oh we can order shit off the Internet too, it's a weirdly legal limbo area that ave never used personally, too scared, I preferred buying my illegal drugs from a scumbag I've been introduced to at 3am at a party I wasn't invited to where a guy is either ODing or sleeping on the couch next to me!",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "krebstar4ever",
                                    "body": "It's illegal. It's supplements that illegally contain an inexpensive prescription drug, which isn't stated on the products' labels.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Davido401",
                                            "body": "Am glad we seem to have better food safety than you guys, that's wild! Not to say weird shit doesn't get put in our food but you guys are wild!",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "krebstar4ever",
                                                    "body": "It's not food, it's a supplement. Supplements are basically unregulated, unlike food and medication.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "krebstar4ever",
                                                            "body": "I mean, that's the major issue here: supplements are minimally regulated. This was accomplished through lobbying by the supplement industry.\n\nYou can read about FDA regulation of supplements [here, in layperson's terms.](https://www.fda.gov/food/information-consumers-using-dietary-supplements/questions-and-answers-dietary-supplements)",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "virora",
                    "body": "Not this one, however.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "BondsTheJames",
            "body": "I read this in Robert Evans' voice",
            "score": 13,
            "replies": []
        },
        {
            "author": "garry4321",
            "body": "DO NOT MIX UPPERS AND DOWNERS \n\nJESUS H FUCKING CHRIST",
            "score": 10,
            "replies": []
        },
        {
            "author": "Ok-Pressure6036",
            "body": "The boner pill/ muscle relaxer speed ball is stuff of legends",
            "score": 9,
            "replies": []
        },
        {
            "author": "thesleepjunkie",
            "body": "I took one of those energy drinks after a 12 hr shift and hitting the highway to drive 3 hrs to a party at my friend's place. Left at 5pm around 4 am, I looked at my friend and asked, \"How did I get here?\" \n\nI had no recollection of the drive, how I got to my friends house, or the party. \n\nI did not partake in any other substances other than a couple OEs.",
            "score": 33,
            "replies": [
                {
                    "author": "Entitled_Ostrich_321",
                    "body": "Plus the three people stuck to your bumper",
                    "score": 18,
                    "replies": [
                        {
                            "author": "thesleepjunkie",
                            "body": "Yeah I ate the three people stuck to my bumper after I downed a couple beers, \n\nFarmhouse Saison and apple cider braised human thigh are a good pairing.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "natgibounet",
                                    "body": "How was your performance at the party though?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "thesleepjunkie",
                                            "body": "Meh, pretty tame I guess. No one seemed embarrassed to be around me or bad stories told at breakfast.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "donkeybrained420",
                                                    "body": "“No seemed embarrassed to be around me” is legend thought process",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Entitled_Ostrich_321",
                                    "body": "Good tips.  I'll be at your next BBQ",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "BeerMantis",
            "body": "I just looked up what you drank.  The ingredient list looks basically like a preworkout drink with yohimbe and horny goat weed crammed in.  Your experience reads almost exactly like the potential side effects list for yohimbe.\n\nIf you want a safer experiment in this realm, and have no heart/blood pressure issues, try the workout supplement L-citrulline.\n\nFun fact I thought everyone here would enjoy.  Substances that promote or induce erections are referred to as \"erectogenic\".  So I encourage us all to find ways to shoehorn that term to everyday conversations in the near future.",
            "score": 8,
            "replies": []
        },
        {
            "author": "shastaxc",
            "body": "But walgreens is not a gas station",
            "score": 6,
            "replies": []
        },
        {
            "author": "SparklingLimeade",
            "body": "Big mistake thinking snake oil means \"nothing.\" If it does something it's a lot easier to sell it as being useful. It won't be what the sales pitch says but it will do something.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Warlock_Froggie",
            "body": "I see these at the gas station check out alot and I have a serious question. I’m a woman, if I get one of those what will happen? I’m not like sexually active I just want to know if I’d get sick since it’s supposedly a “male enhancement” out of curiosity",
            "score": 5,
            "replies": [
                {
                    "author": "SeanAker",
                    "body": "According to other comments the hulking out has nothing to do with boner medicine and is because of some wild-ass \"energy\" drug that makes you miserable. But my understanding is that these pills *do* often contain knockoff generic viagra, so whatever the negative effects of taking regular viagra as a woman are, plus some. Probably not advisable. ",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Devil_May_Kare",
                            "body": "Viagra supposedly helps with menstrual cramps. But the best way to take it probably isn't gas station dick pills.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SouthernWindyTimes",
                    "body": "You’d feel like the She-Hulk and almost die like OP I imagine.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "drlongtrl",
            "body": "... presenting to the emergency room, where we are now.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Covetous_God",
            "body": "I'm super bothered you keep saying \"pill\" when you drank a drink.",
            "score": 6,
            "replies": []
        },
        {
            "author": "OutInABlazeOfGlory",
            "body": "Go to the doctor. I don't care if you also live in the US and it's expensive, just do it.\n\nAlso pairing that with a muscle relaxant was a horrifyingly bad idea.",
            "score": 10,
            "replies": []
        },
        {
            "author": "YourBrotherDave",
            "body": "\"Didn't you hear what I said? It gives you a boner!\"",
            "score": 4,
            "replies": [
                {
                    "author": "AxleRodSteel",
                    "body": "\"I don't want no part of that shit.\"",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "geriactricpillbug",
            "body": "Im pretty sure HST was drinking rum on a beach when he wrote The Rum Diary.",
            "score": 4,
            "replies": []
        },
        {
            "author": "EmergencyLavishness1",
            "body": "So was it a pill or a drink? Or just complete BS",
            "score": 8,
            "replies": [
                {
                    "author": "forever_not_the_same",
                    "body": "This as it changed from a drink to a pill, the hell? Do they sell boner stuff in drink form?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Fro_o",
                            "body": "I'm not from the states so I'm super confused? You can buy these off the shelves?",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Richard_Ovaltine",
                                    "body": "You can! In any store really you can go in and get \"enhancement\" pills! They work sometimes but mostly suck, you can get them in drink form and food/candyish I believe\n\nIt's not viagra but it redirects blood flow and helps you stay hard I think, am a woman so I've just seen my ex use them",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Fro_o",
                                            "body": "That's so wild to me that you can get these anywhere. Isn't it unsafe? Like your body get used to them and then you absolutely need them?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Richard_Ovaltine",
                                                    "body": "Oh for sure, heart problems and what not. Some packages say no headache because they cause bad ones \n\nThey're probably addictive if you use them alot I bet, they weaken the heart",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "InfoSecPeezy",
            "body": "Leon calls that tap water",
            "score": 3,
            "replies": []
        },
        {
            "author": "King_Cargo_Shorts",
            "body": "So did you get a decent boner out of it?",
            "score": 3,
            "replies": []
        },
        {
            "author": "ClydePrefontaine",
            "body": "So, how was it?",
            "score": 3,
            "replies": []
        },
        {
            "author": "ExitFlimsy4947",
            "body": "Thought exploding boner.",
            "score": 3,
            "replies": []
        },
        {
            "author": "terapinfly",
            "body": "![gif](giphy|5xtDarw8YSGIGzLi3yU|downsized)",
            "score": 3,
            "replies": []
        },
        {
            "author": "RoyalPuzzleheaded259",
            "body": "Ok but how was the boner?  Better than usual or about the same?",
            "score": 3,
            "replies": []
        },
        {
            "author": "Rosatos_Hotel",
            "body": "But did it give you a boner?",
            "score": 3,
            "replies": []
        },
        {
            "author": "Biggs94_",
            "body": "Turns out the true boner pills were the friends we made along the way",
            "score": 3,
            "replies": [
                {
                    "author": "donkeybrained420",
                    "body": "🫃🏻pregnant man emoji award",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "someotherguyinNH",
            "body": "Yeah but did you get a boner?",
            "score": 3,
            "replies": []
        },
        {
            "author": "ksawx",
            "body": "but wait, did OP get a boner?",
            "score": 3,
            "replies": []
        },
        {
            "author": "Fair-Big-9400",
            "body": "Taking a muscle relaxer with a sex pill is like a horny speedball. You must’ve been Gumby with a Pokey.",
            "score": 3,
            "replies": []
        },
        {
            "author": "secretworkaccount1",
            "body": "I guess the wild variation in experience is the actual story. I’ve had nothing but positive experience with gas station boner pills. I have no erectile dysfunction. My use was purely recreational. Fun times were had 🤷‍♂️",
            "score": 5,
            "replies": [
                {
                    "author": "CowabungaShaman",
                    "body": "Man, that’s NOT a sentence you expect to hear every day.\n\n“I’ve had nothing but positive experience with gas station boner pills.”\n\nIt’s like a trigger phrase for a dormant assassin. No human would normally put those words together. \n\nCrap. The boners have risen to kill us all.",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "Available-Carrot3861",
            "body": "Bro turned into Dracula Flows",
            "score": 2,
            "replies": []
        },
        {
            "author": "TractorSmacker",
            "body": "5th paragraph reads like a dracula flow video",
            "score": 2,
            "replies": []
        },
        {
            "author": "PimpGameShane",
            "body": "https://preview.redd.it/e6491qhasfpe1.jpeg?width=1242&format=pjpg&auto=webp&s=3b62908fff821cc8e04cc50e4a2af137c4c5f87e",
            "score": 2,
            "replies": []
        },
        {
            "author": "InsanityAtBounds",
            "body": "Shoulda took blue rhino. Did that shit with my girl and my dick fucking grew 2 inches",
            "score": 2,
            "replies": [
                {
                    "author": "Shebalied",
                    "body": "wtf the gas tanks???",
                    "score": 2,
                    "replies": [
                        {
                            "author": "KoreanJKP",
                            "body": "Haha 🤣. No, but those might be healthier!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Indole_pos",
            "body": "TIL there is a urine test for a UTI. 98% of the population can’t even provide a clean catch urine.",
            "score": 2,
            "replies": [
                {
                    "author": "nyraqkne",
                    "body": "Its not exactly a urine test but a urinalysis",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Indole_pos",
                            "body": "What do you do with the results?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Legend_of_dirty_Joe",
            "body": "Did you get a boner though?",
            "score": 2,
            "replies": []
        },
        {
            "author": "MachineProof5438",
            "body": "Yeah but did you get a boner",
            "score": 2,
            "replies": []
        },
        {
            "author": "Norwest",
            "body": "This just sounds like an ad for Extenze Original Formula Male Enhancement drink (until the last sentence)",
            "score": 2,
            "replies": []
        },
        {
            "author": "timl424",
            "body": "Sounds like the motivation for the Crank movies",
            "score": 2,
            "replies": []
        },
        {
            "author": "cherrywoodtomatoes",
            "body": "I used to work at an adult store and had to sell those to people.\n\nI never did. I took the pink kitty pill once just to see, had a 105⁰ fever, and threw up the whole night.\n\nMen and women's formulas are the same, it's usually just a weight difference (men tend to weigh more compared to women). Most of them use Chinese herbs + supplements like L-thymine(?). I did have a regular that used to come in and buy the silver rhino pills, said how he used them for the gym to keep his energy up, he never had issues. Although Rhino did have a scare a couple years back, idk if it still stands. \n\nGenuinely, if you have an issue, DONT USE THE PILLS. Just see a doctor. Fuck these pills.",
            "score": 2,
            "replies": []
        },
        {
            "author": "TempSmootin",
            "body": "Jesus. Your description and solution are so fucking dum, prime American material.",
            "score": 5,
            "replies": [
                {
                    "author": "Argylist",
                    "body": "Thankfully he detailed grabbing the bottle, taking the lid off, and then drinking some of it. I had no idea how a drink works and I would have been lost...",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "PsychologicalSon",
            "body": "Extenze was an actual name brand of boner pill when I was younger, like only recommended for the elderly and have a medical condition type stuff. It's lucky they didn't have to stick a needle where you DO NOT want a needle stuck.\n\nHonestly I'd have done half and see who passed out first though, so no judgement.",
            "score": 3,
            "replies": []
        },
        {
            "author": "AllynG",
            "body": "Did you Fuq on it at least?! Damn. I would have set my house work up just before that pill. Get some shit done!!",
            "score": 2,
            "replies": []
        },
        {
            "author": "WheezyGonzalez",
            "body": "Chat gpt can’t get a boner",
            "score": 2,
            "replies": []
        },
        {
            "author": "hardwood1979",
            "body": "Solution to a bad experience on an unknown drug is always more drugs.",
            "score": 2,
            "replies": []
        },
        {
            "author": "LuckyDogHotSauce",
            "body": "So wait. How was the boner? \n\nI feel like a lede has been buried here.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mr_Wolf_Pants",
            "body": "https://i.redd.it/rqt8h6i44epe1.gif\n\nYou took too much man, too much…",
            "score": 1,
            "replies": []
        },
        {
            "author": "WolfWhitman79",
            "body": "Yeah, but did you have a boner?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Numerous-Process2981",
            "body": "America is wild.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Puzzled-Dirt3575",
            "body": "This sounds like the beginning of another Crank movie",
            "score": 1,
            "replies": []
        },
        {
            "author": "Joey_iroc",
            "body": "So this was an anti priapism drink? I'd sue for false advertising.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Orphanpuncher0",
            "body": "The gas station across the the highschool is selling boner hunny to kids, major todo in my town right now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Best_Sherbet2727",
            "body": "Honestly, I thought I was about to ascend to another plane of existence. My heartbeat had its own EDM remix, and for a moment, I considered calling Walgreens to ask if I had just consumed a war crime in liquid form. 0/10 experience, but 10/10 for realizing I never want to know what’s in those pills again.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rscottyb86",
            "body": "The real unanswered question:  did you get a boner?",
            "score": 1,
            "replies": []
        },
        {
            "author": "rscottyb86",
            "body": "The real unanswered question:  did you get a boner?",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Reflection-9124",
            "body": "Thank you for your service",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "author": "Dexter_McThorpan",
                    "body": "What were you expecting? ED meds still require arousal. Were you just rocking along solo, full of sketchy boner pills, hoping for a spontaneous priapism?",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sufficient-Squash428",
            "body": "You should probably stop playing with pharmaceuticals.   \nDid you at least pick up the lube?\n\nhttps://preview.redd.it/jwaspz0t3gpe1.png?width=269&format=png&auto=webp&s=8f16c63fe5c894b24dcb567ec479695809702efa",
            "score": 1,
            "replies": [
                {
                    "author": "nyraqkne",
                    "body": "Couldn’t leave without it",
                    "score": 1,
                    "replies": [
                        {
                            "author": "avocadomepls",
                            "body": "Does she get frequent UTIs? Sometimes it can be the ingredients in the lube. Glycerin is commonly used in lube and can cause UTIs if she does pee or clean thoroughly after sex.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheRedneckSuperhero",
            "body": "But did your dick get hard?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Haloman16",
            "body": "This sh** had me laughing in bed",
            "score": 1,
            "replies": []
        },
        {
            "author": "RickolisH",
            "body": "Maybe Jon Jones wasn't lying?",
            "score": 1,
            "replies": []
        },
        {
            "author": "K9turrent",
            "body": "/r/GasStationJamboree wins again!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Minerva89",
            "body": "This story makes more sense if you read it in a trailer trash accent.",
            "score": 1,
            "replies": []
        },
        {
            "author": "UDPviper",
            "body": "I took one of those gas station pills once.  I felt ill, like I had  food poisoning or something.   My whole body just felt really wrong and off.  Never again.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bicyclestamps",
            "body": "What was the drink??? You shoulda had sex.",
            "score": 1,
            "replies": []
        },
        {
            "author": "edbutler3",
            "body": "Sounds like a massive dose of Yohimbe. \n\nEven in my 20s that stuff felt like it was going to kill me -- the one time I tried it. At my current age, I'm pretty sure it would.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bonersalad",
            "body": "You said you entered hell, but then described several characters I've always wanted to feel like.",
            "score": 1,
            "replies": []
        },
        {
            "author": "tk2df",
            "body": "I have tried them in the past, yes makes you sick to a about it",
            "score": 1,
            "replies": []
        },
        {
            "author": "DormantLime",
            "body": "Yeah never buy those, is my advice. When I worked at Spencer's we carried a few items like that but we NEVER advised anyone to take them and carded anyone trying to buy it. We often also warned them at the point of sale that these products are routinely recalled/replaced because of dangerous side effects or impurities in the formulas. We also told them not to mix it with any other drugs, to drink lots of water (or something with electrolytes), and to monitor how their body is reacting (see a doctor if it gets weird).\nPart of working there was sex education- other stores aren't going to care about that and will just sell it to you. Even other Spencer's stores might sell you it no problem, but the two I worked at took shit pretty seriously.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CommentU",
            "body": "you should have just played ‘VYBZ KARTEL - SWEAR TO JAH’ will help guide you next time!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Quiet-Knowledge1908",
            "body": "![gif](giphy|F8QxNkmthR51U4tIDB)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lieutenant_0bvious",
            "body": "You may want to get your heart checked out.  I had heard about anecdotal reports of viagra causing chest pain and heart problems.  Turns out the pain is from blood pressure being lowered and a failing heart overcompensating for the drop in blood pressure.  I'm not saying that's what's going on here- could just be stimulants, etc.  But... you may want to look into it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gunn5150",
            "body": "Those gas station erection pills and drinks are sketchy. They are regularly banned for not putting an ingredient on the label, the ingredient they leave off the label is Sildenafil, also known as Viagra. So ya, those drinks work great, but there is no way of knowing how much Viagra is in the product so it can be extremely dangerous, especially when mixed with alcohol or other drugs. But, regardless, it's a lot of fucking fun. Lol.",
            "score": 1,
            "replies": [
                {
                    "author": "AvangeliceMY9088",
                    "body": "Legit question as a non American. Who Tf buys these things I read about all the time?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "SouthernWindyTimes",
                            "body": "Lots of meth heads and stimulant users because of stim dick. Also alcoholics.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "PlugWalkJo",
            "body": "Bro made me stop scrolling for a sec lmao",
            "score": 1,
            "replies": []
        },
        {
            "author": "Patriette2024",
            "body": "The actual drugs like viagra were originally for hypertension but this was an unexpected side effect. So technically lowering blood pressure helped, not throwing your blood pressure into infinity 😂",
            "score": 1,
            "replies": []
        },
        {
            "author": "lighthawk16",
            "body": "Dumbass",
            "score": 1,
            "replies": []
        },
        {
            "author": "vmktrooper",
            "body": "It sounds like you have a drug problem.",
            "score": 0,
            "replies": []
        },
        {
            "author": "NinjaTank707",
            "body": "https://i.redd.it/n7uu8lmezfpe1.gif",
            "score": 0,
            "replies": []
        },
        {
            "author": "Tratiq",
            "body": "Nothing about this story paints op is a good light lol",
            "score": 0,
            "replies": []
        },
        {
            "author": "Awesomeman360",
            "body": "Look up \"Boner Bears\"\nThey're all natural and they're awesome, lol",
            "score": 0,
            "replies": []
        },
        {
            "author": "IEsince93",
            "body": "I think “Predator” reference could have been left out of your side effects of boner enhancement drink lol",
            "score": 0,
            "replies": []
        }
    ]
}