{
    "title": "TIFU by filling in the wrong person’s medical history",
    "author": "glavet",
    "subreddit": "tifu",
    "rank": 0,
    "score": 532,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 23,
    "url": "https://www.reddit.com/r/tifu/comments/1jeaeq8/tifu_by_filling_in_the_wrong_persons_medical/",
    "id": "1jeaeq8",
    "selftext": "I have a dental appointment tomorrow. My 3 year old son has a dental appointment the day after. His appointment is at a different place from mine, and they have different admin systems.\n\nToday, I got a text message telling me to complete a form about my medical history before my upcoming dental appointment. I clicked the link, filled in the form with my details and then clicked submit. I then got to a page saying something like ‘thank you for filling in the medical history for (son’s name).’\nThis was when I realised my mistake. \n\nSo… I told my kid’s dentist that he is currently pregnant, that he had his appendix removed as a teenager and that he has recently been prescribed medication for a yeast infection. \n\nTLDR: filled in my 3 year old kid’s medical history form with my own information, including saying he is currently pregnant. ",
    "comments": [
        {
            "author": "_drifter_ND81",
            "body": "it’s rough out here for a toddler these days",
            "score": 327,
            "replies": []
        },
        {
            "author": "buttercupfitz",
            "body": "Let me tell you, this happens so often that it follows a pattern - parents start with their child's info, then at some point on the form they go into autopilot and start answering for themselves. It's like a fun little game every time figuring out the moment while reading it back",
            "score": 80,
            "replies": []
        },
        {
            "author": "random-guy-here",
            "body": "No problem, just bring in the kid's drivers license and they can sort it all out.",
            "score": 124,
            "replies": [
                {
                    "author": "dubbzy104",
                    "body": "And a utility bill sent to him at his current address",
                    "score": 14,
                    "replies": []
                }
            ]
        },
        {
            "author": "ckosacranoid",
            "body": "So Mr. Toddler, it say here you are 3 years old. It seems that you have had your appendix taken out, you are pregnant along with taking meds for a yeast infection. I mean, that really sucks to have happen in just three years sir.\n\nSorry, I just had to make this comment.",
            "score": 102,
            "replies": [
                {
                    "author": "Lukthar123",
                    "body": "Mr Toddler is a legend in the speedrunning community",
                    "score": 22,
                    "replies": []
                }
            ]
        },
        {
            "author": "1Happymom",
            "body": "Im sure the Dr. will understand your son has just got a case of \"pregnancy brain.\"",
            "score": 25,
            "replies": []
        },
        {
            "author": "sphynxzyz",
            "body": "LOL thats pretty funny. I'm sure the nursing staff will have a chuckle when you tell them.",
            "score": 40,
            "replies": [
                {
                    "author": "glavet",
                    "body": "You know, I rang them up to explain and the receptionist was very grumpy and not at all amused. Disappointing!",
                    "score": 48,
                    "replies": [
                        {
                            "author": "sphynxzyz",
                            "body": "she should lighten up, its a hilarious accident and lets be honest they are going to ask you all the same questions when they call your name anyways.",
                            "score": 39,
                            "replies": []
                        },
                        {
                            "author": "Lavendeercos",
                            "body": "awww not them getting upset cause they have to do the job they applied for ☹️☹️ demographics are such an easy edit on most receptionist client systems",
                            "score": 20,
                            "replies": []
                        },
                        {
                            "author": "Paavo_Nurmi",
                            "body": ">  the receptionist was very grumpy and not at all amused.\n\nThey are miserable in life and probably not very popular with coworkers. \n\nSource: 40 years of working with people/customers has taught me a lot.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "SigmundFreud",
                            "body": "You should kick her in the nuts.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "glavet",
                                    "body": "Seems a bit extreme. And hard to do over the phone.",
                                    "score": 10,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "lucky_ducker",
            "body": "This is 100% on the people that configured their software for not including the patient name in the original text message.",
            "score": 6,
            "replies": [
                {
                    "author": "uniqueUsername_1024",
                    "body": "Especially if the patient is under 18 years old!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "faythe_scrolling",
            "body": "Hahaha, nice.",
            "score": 11,
            "replies": []
        },
        {
            "author": "cosmos7",
            "body": "> TLDR: filled in my 3 year old kid’s medical history form with my own information, including saying he is currently pregnant.\n\nI wouldn't worry... 50/50 they even bother reading it...",
            "score": 6,
            "replies": []
        },
        {
            "author": "Ok-Bug4328",
            "body": "Don’t worry.  They won’t read it. ",
            "score": 3,
            "replies": []
        },
        {
            "author": "belovedeagle",
            "body": "That shit is going to get into his electronic medical records and spread to every single medical office he goes to like an STD. There'll be no getting rid of it. Even if one office scrubs it, they'll just re-catch the infection from another one.",
            "score": 3,
            "replies": []
        },
        {
            "author": "cameo674",
            "body": "Brain fog is real.  Thank you for the laugh.",
            "score": 2,
            "replies": []
        },
        {
            "author": "KrackSmellin",
            "body": "All the traits someone is looking for in a woman...",
            "score": 1,
            "replies": []
        }
    ]
}