{
    "title": "Absolute crap size charts from Madman",
    "author": "mysteryshopper101",
    "subreddit": "FashionReps",
    "rank": 6,
    "score": 71,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 24,
    "url": "https://www.reddit.com/gallery/1je8nnw",
    "id": "1je8nnw",
    "selftext": "I bought these two pairs of jeans directly from Madman’s Taobao because I needed them urgently. Trusted his size charts, and surprise, they were hilariously off. The Big Ol' Stussy Denim Jeans, listed as a size 32, came with a 37” (94cm) waist—definitely not what I was expecting. Oh, and the size chart? It's helpfully in S to XL, because who doesn’t love a little extra confusion?\n\nOn the other hand, the Dime black jeans at least kept their size chart consistent—S to XL all the way. Unfortunately, the waist measurement was still about 10cm off, with the actual product measuring 91cm instead of the 81cm on the chart.\n\nI’m now a proud owner of 2 pairs of completely useless jeans. If anyone is wondering, my waist size is 32” 81cm. Lesson learnt, don’t buy in the last minute, always go through agent and pay extra for actual waist measurements so an exchange or refund is possible. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Important Links & Active Giveaways\n\n\n[AllChinaBuy Beginner Guide](https://www.reddit.com/r/FashionReps/comments/1hqsxrw/allchinabuy_acbuy_guide_signup_bonus_agent_guide/)\n\n[SuperBuy Beginner Guide](https://www.reddit.com/r/FashionReps/comments/aecrl5/guide_40_the_biggest_best_full_superbuy_agent/) [Video](https://www.reddit.com/r/FashionReps/comments/b4dvi5/fashionreps_newbie_guide_how_to_use_superbuy/)\n\n[MuleBuy Beginner Guide](https://www.reddit.com/r/FashionReps/comments/1dwjknc/fashionreps_guide_90_july_2024_agent_guide_faqs/)\n\n[Link Converter Extension](https://www.reddit.com/r/FashionReps/comments/1f8jrpm/fashionreps_link_converter_pop_up_remover/)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/FashionReps) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "3MadMan_reddit",
            "body": "Hello,\n\nAbout Stussy: This is our traditional measurement method for making pants (natural top flat measurement). We have sold 3,000 pairs, and the basic error is very small.\n\nYou may wonder: size32=81CM waist size, but retail is not like this. We follow up all the details including all sizes. I compared our size chart with a randomly selected product and it was very accurate. .\n\nWe are the most professional in making stussy jeans, and other else's are garbage quality.\n\nAbout dime: This may be a batch problem, and it is indeed very different from my size chart. Because my size chart was counted 2 years ago. For DIME products, I can refund you or reissue compensation.\n\nSorry for the problems you had to deal with, we will try to improve and fix every issue. If your jeans size 32 came with 94cm waist please contact me on discord ticket or thru whatsapp but I think it if you messure it my way it will be the same as size chart.\n\nhttps://preview.redd.it/n93gp2h3yhpe1.jpeg?width=1158&format=pjpg&auto=webp&s=1d9ec695f25e6afa53f356bd280a99552fa56cdc",
            "score": 1,
            "replies": []
        },
        {
            "author": "TutorPale9164",
            "body": "madman always been off",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sensitive_Chard_3925",
            "body": "Ong, even the stuff that I bought from him that was actually the right size all had off waist measurements by bare minimum 5cms. I even confirmed in the discord too. Definitely never going to buy off him again",
            "score": 1,
            "replies": []
        },
        {
            "author": "Patient-Analyst",
            "body": "I got the same stussy jeans in size 32 and they are way bigger then the other jeans in size 32 or size M in compare to the dime jeans",
            "score": 1,
            "replies": []
        },
        {
            "author": "Arlow88",
            "body": "Never trust any sellers on their size charts get your stuff measured using QC pics from your agent so you wont be disappointed when stuff arrives, it saved me many times when stuff hasn't been the right size and I can just exchange it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mason202",
            "body": "it's not just madman. I've been building my haul for the past month and I've had to make 14 returns so far because of massive CM errors. Martian, Pika, Topgoosey, Hotdog, Mook, rocket. everyone has let me down. Even Topstoney, but not from an error. he just sent me the wrong item. it's just so tiring.\n\nThis whole experience has taught me to never buy direct from anyone.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mysteryshopper101",
            "body": "Link for both jeans \n\nStussy: 【淘宝】7天无理由退货 https://e.tb.cn/h.600jwJdltZeSSeM?tk=TACReJQ6zmf HU293 「Madman定制STU光版牛仔Jeans （质量棒）」\n点击链接直接打开 或者 淘宝搜索直接打开\n\nDime: 【淘宝】7天无理由退货 https://e.tb.cn/h.6ZuWoIL4WQoYoXA?tk=iEoneJQ6S8t CZ009 「Madman D风格牛仔裤刺绣个性化定制裤子」\n点击链接直接打开 或者 淘宝搜索直接打开",
            "score": 1,
            "replies": []
        },
        {
            "author": "apollo20155",
            "body": "Hows the quality tho?",
            "score": 1,
            "replies": [
                {
                    "author": "mysteryshopper101",
                    "body": "The denims for both jeans were actually decent quality, the zip on stussy is quite smooth but sketchy on the dime jeans",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Tall-Echidna4066",
                    "body": "For the price you can't have a better one, top tier",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "datboydg",
            "body": "Bro you realize you can talk to agents before you order to get accurate size charts or have them ask any questions directly to the seller. You also should always get qc pics with measurements It literally costs 33 cents bro if u cant spend that then idk what you’re doing. Its clear you’re new and you should’ve done more research before you went out of your way to write this review since you werent educated.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dependent_Many_8851",
            "body": "How about using a belt fym useless bruh they just big",
            "score": 1,
            "replies": [
                {
                    "author": "Chalkywhite007",
                    "body": "What?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Dependent_Many_8851",
                            "body": "He said the pants are useless cause they are big. I said how about using a belt",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Vicovanz",
            "body": "Just wear a belt man",
            "score": 1,
            "replies": [
                {
                    "author": "mysteryshopper101",
                    "body": "I would if i could mate, frankly, it’s akin to before/after pics on ‘the biggest loser’ tv series.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Beautiful-Season-418",
            "body": "how broke u must be to wear fake dime😂",
            "score": 1,
            "replies": [
                {
                    "author": "AMNE5TY",
                    "body": "Femboy enjoyer, gatekeeper of jeans",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Beautiful-Season-418",
                            "body": "Bro i would rather enjoy femboys than buy fake dime jeans😂",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "AMNE5TY",
                                    "body": "You’re here with the rest of us mf just cause you’re buying your fake jeans second hand and thinking they’re real doesn’t make you any different",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}