{
    "title": "Over a dozen new measles cases in Texas outbreak in less than a week: Officials",
    "author": "Surly_Cynic",
    "subreddit": "news",
    "rank": 26,
    "score": 1993,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 80,
    "url": "https://abcnews.go.com/Health/texas-measles-outbreak-jumps-week-officials/story?id=119426887",
    "id": "1j3rb4a",
    "selftext": "",
    "comments": [
        {
            "author": "yblame",
            "body": "None of this should be happening at all!  We figured this stuff out decades ago!\nGrowing up, my family never once worried about measles, diptheria, polio.  You know, child killers.\n\nBecause we were vaccinated as infants or school aged children.  This is so stupid and unnecessary",
            "score": 132,
            "replies": [
                {
                    "author": "grandzu",
                    "body": "Texas is the poster child of stupid and unnecessary.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "Individual-Bee-4999",
                    "body": "Decades ago… medicine so effective people think they don’t need it… maybe that’s the lesson… leaving children to die, again…",
                    "score": 14,
                    "replies": [
                        {
                            "author": "sarhoshamiral",
                            "body": "Children were getting shot at schools and we didn't care. I doubt we will care now.",
                            "score": 23,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Fecal-Facts",
                    "body": "There's a politician that openly says he hasn't washed his hands in years because he has a immune system.\n\n\nWe are regressing as a society.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TSAOutreachTeam",
            "body": "On the positive side, it’s only a dozen or so. It’s incredibly contagious, so if vaccination rates weren’t very high, we’d be seeing those numbers skyrocketing. \n\nAlthough, this might just be due to underreporting.",
            "score": 284,
            "replies": [
                {
                    "author": "FreddyForshadowing",
                    "body": "These are just the confirmed cases, meaning someone was likely brought to a hospital. There's probably plenty more for each one of these that isn't being reported because no one brings them to the hospital. We can always hope that, despite its reputation, Texas actually has some infectious disease people who are skilled properly resourced.",
                    "score": 156,
                    "replies": [
                        {
                            "author": "Surly_Cynic",
                            "body": "Throughout the course of this outbreak, there have likely been unreported cases.",
                            "score": 43,
                            "replies": []
                        },
                        {
                            "author": "tuxedo_jack",
                            "body": "Measles is a reportable condition in Texas with immediate-report requirements, at which point DSHS and county health get involved.\n\nSpeaking as an ATX resident who's worked at Dell Children's and other (formerly) Seton hospitals, I fully expect the amount of _unreported_ cases (meaning the ones that didn't visit or have a telehealth session with a provider for diagnosis) to be double or triple the actual hospitalized / reported caseload.\n\nSeems that this would be secondary or tertiary infections from the fucking Mennonite assholes from Gaines County hitting Buc-ee's on their way out after college trips while infected. I'd almost say it's time for a forcible quarantine of the infected in their homes a la Mary Mallon.",
                            "score": 58,
                            "replies": [
                                {
                                    "author": "Subtle__Numb",
                                    "body": "“But muh beaver nuts!”",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "tevolosteve",
                                    "body": "People won’t wear masks so forced quarantines will make heads explode",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "LeftRightRightUp",
                            "body": "“These are just the confirmed cases” took me straight back to 2020. Fuckkkkk lol",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "BoBSMITHtheBR",
                            "body": "Simple solution folks. Take your vitamins and don’t test for it.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "hpark21",
                    "body": "But they are now having \"Measles party\" which I guess some people thinks is just like having \"chickenpox party\" of long gone era before the vaccines but it is for completely different disease.\n\nAre they going to have Ebola party?",
                    "score": 7,
                    "replies": [
                        {
                            "author": "shouldbepracticing85",
                            "body": "As someone who got chicken pox from a pox party - fuck that shit.\n\nNote: it was before the chicken pox vaccine was available. It was miserable.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SubstantialPressure3",
                    "body": "The number of measles cases associated with an outbreak in Texas has grown to 159 -- an increase of 13 cases in the past five days, authorities said on Tuesday.\n\nI guess we will see in another 5 days.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "ConsistentAsparagus",
            "body": "Isn’t measles devastating on foeti? Fetuses?",
            "score": 17,
            "replies": [
                {
                    "author": "Surly_Cynic",
                    "body": "It’s dangerous to contract during pregnancy, as is true of many viruses. I believe there was a miscarriage or stillbirth associated with one of the large New York measles outbreaks in the Orthodox Jewish community, but you might be thinking of Rubella (German Measles). That’s the one that’s especially risky to contract during pregnancy because it can harm the fetus.",
                    "score": 28,
                    "replies": []
                },
                {
                    "author": "Angery_Roastbeef",
                    "body": "It's SUPER DANGEROUS for unvaccinated adults too.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheStLouisBluths",
            "body": "Is that bad? That seems bad.",
            "score": 43,
            "replies": [
                {
                    "author": "Surly_Cynic",
                    "body": "It’s bad but seems to possibly indicate things are improving.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "WhereMyNugsAt",
                            "body": "After two kids died and the virus is now in every major city, I don’t know how you see things as improving. The death rate in children is 1 out of 1000 infections so if that is staying true for this outbreak that would mean there are already thousands of infected out there.",
                            "score": 15,
                            "replies": []
                        },
                        {
                            "author": "Present-Pen-5486",
                            "body": "IDK the last update was only Friday...",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Surly_Cynic",
                                    "body": "They do them every 3 or 4 days. This update added 13 cases, the prior one added 22, the one before that added 34, and the one before that added 32.\n\nThis seems like a hopeful trend. I surely don’t want to see more kids getting sick.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "Present-Pen-5486",
                                            "body": "The Texas HHS was updating on Tuesdays and Fridays, not sure why this one came on Monday.  the CDC updates every Friday on their count, which is all of the US I think:  [https://www.cdc.gov/measles/data-research/index.html](https://www.cdc.gov/measles/data-research/index.html)",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "author": "Surly_Cynic",
                                                    "body": "Today is Tuesday.",
                                                    "score": 10,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Surly_Cynic",
            "body": "This is more than 100 new cases since the update on February 18th, two weeks ago.\n\nFortunately, reported cases seem to be getting added at a slower pace  than previous weeks.\n\nThe update prior to this one added 22 cases. The two updates prior to that each added 30+ cases to the total case count.\n\nSeems the local public health authorities and medical professionals may be getting a handle on the outbreak. The fewer cases, the better, especially considering children have been most affected.",
            "score": 33,
            "replies": [
                {
                    "author": "Granum22",
                    "body": "RFK probably just ordered them to stop reporting ",
                    "score": 36,
                    "replies": []
                }
            ]
        },
        {
            "author": "15yracctstartingovr",
            "body": "It's almost like it has an r(0) of 12 - 16",
            "score": 17,
            "replies": []
        },
        {
            "author": "mephitopheles13",
            "body": "It’s awful to see children suffer the failings of their parents. At least vaccinated people will be fine.",
            "score": 8,
            "replies": [
                {
                    "author": "bipolarcyclops",
                    "body": "People like me who had measles as a kid will be fine too.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Late-Ad4964",
                    "body": "On the upside, the more that perish, the less republicans there’ll be in the future 👍🏼",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "m_nieto",
            "body": "They should pray to baby Jesus harder",
            "score": 14,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 26,
            "replies": [
                {
                    "author": "Springtimefist78",
                    "body": "Make American the Oregon trail again!",
                    "score": 22,
                    "replies": []
                }
            ]
        },
        {
            "author": "MAZE_ENJOYER",
            "body": "Insane what some parents will put their children through due to their political beliefs",
            "score": 11,
            "replies": []
        },
        {
            "author": "bpeden99",
            "body": "Freedom ain't free... In Texas",
            "score": 5,
            "replies": []
        },
        {
            "author": "TryharderJB",
            "body": "Say your prayers and eat your vitamins brrrrother!",
            "score": 12,
            "replies": []
        },
        {
            "author": "nwmisseb",
            "body": "I would be an E5 tornado if my child caught measles from someone whose parents didn’t believe in vaccines. Everything turning to rubble when I get done.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Mobile-Hair-4585",
            "body": "3 week incubation period. I just got my popcorn.",
            "score": 6,
            "replies": []
        },
        {
            "author": "Roaddog113",
            "body": "Remember to take your vitamins 🤡 R.F.K. Jr.",
            "score": 5,
            "replies": []
        },
        {
            "author": "cg13a",
            "body": "How fortunate that the community can celebrate the results of their wishes.",
            "score": 2,
            "replies": []
        },
        {
            "author": "yosarian_reddit",
            "body": "It’s fine because America is a modern country that has vaccinated all its children against measles. Right?",
            "score": 2,
            "replies": []
        },
        {
            "author": "jackiebee66",
            "body": "Play stupid games, win stupid prizes…and the children suffer…",
            "score": 2,
            "replies": []
        },
        {
            "author": "No-Equivalent-5228",
            "body": "Who knew measles parties would be so bad!",
            "score": 1,
            "replies": []
        },
        {
            "author": "WeirdVision1",
            "body": "Spring break travel, here we come!",
            "score": 1,
            "replies": []
        },
        {
            "author": "flimflammedzimzammed",
            "body": "Sharpie patrol reporting for duty",
            "score": 1,
            "replies": []
        },
        {
            "author": "jenk1980",
            "body": "But don’t worry. RFK jr gave us the answer.  Take your vitamins.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Colonel-KWP",
            "body": "It’s okay. Vaccines are for losers.",
            "score": -16,
            "replies": [
                {
                    "author": "Joeyjojojrshabado70",
                    "body": "I don’t think people understood the sarcasm, friend.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -3,
            "replies": [
                {
                    "author": "charactergallery",
                    "body": "Most of those ill are children.",
                    "score": 9,
                    "replies": []
                }
            ]
        }
    ]
}