{
    "title": "Russia’s river gamble fails near Kupyansk as Ukrainian forces hold the line",
    "author": "tomorrow509",
    "subreddit": "news",
    "rank": 8,
    "score": 3139,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 53,
    "url": "https://english.nv.ua/russian-war/russian-troops-fail-to-cross-oskil-river-near-kupyansk-as-ukrainian-forces-hold-the-line-50495280.html",
    "id": "1j41itn",
    "selftext": "",
    "comments": [
        {
            "author": "I_Got_A_Truck",
            "body": "Whoa, I didn’t think good news existed anymore!",
            "score": 533,
            "replies": [
                {
                    "author": "bassplaya13",
                    "body": "Attacks and defenses like this happen all across the front line, every single day. It’s amazing what the Ukrainian soldiers are accomplishing.",
                    "score": 163,
                    "replies": [
                        {
                            "author": "WampaCat",
                            "body": "Predators fight for their lunch. Prey fight for their life.",
                            "score": 9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Old-Buffalo-5151",
                    "body": "Ukraine has been kicking Russia's ass and taking back ground for a few weeks now.\n\nThe Russias honstely seem exhausted and Ukraine is taking back ground with very little resistance \n\nIt might just be a bad few weeks for Russia but there is definitely a vibe change happening on the front",
                    "score": 52,
                    "replies": [
                        {
                            "author": "I_Got_A_Truck",
                            "body": "Good.  Fuck Russia.",
                            "score": 31,
                            "replies": []
                        },
                        {
                            "author": "heybobson",
                            "body": "WW1 lasted just over 4 years, and we all are aware of how exhausted forces for countries like Germany, France, Britain were by the end of that. \n\nThis war in Ukraine just past 3 years, so it makes sense to see exhaustion from forces that aren't getting supplied properly or switched out with fresh ones.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "BoppityBop2",
                            "body": "In some spots they do, counterattacks for example but the general trend is the Russians are making gains and Ukraine is dealing with significant manpower shortages and exhaustion. ",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "darshfloxington",
                                    "body": "True, but the average amount of Russian ground attacks per day has decreased 3 fold the past month.  Also the Ukrainians are currently beating them back in their largest counterattack since the Kursk offensive.  Both countries are stretched incredibly thin at the moment.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "MadRaymer",
                            "body": "This is exactly why Putin wants \"peace\" talks. He doesn't want peace, obviously, but he desperately needs a pause in the fighting to regroup and rearm so he can try again.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "RepulsiveMetal8713",
                    "body": "yeh I know the feeling",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Savior-_-Self",
            "body": "To the brave Ukrainian troops, well done (from the US with shameful apologies for our president and his party of cowards)",
            "score": 350,
            "replies": [
                {
                    "author": "IamDDT",
                    "body": "Hear, hear! As a fellow American, I could not have said this better.  I am so, so, so so, so sorry for our behavior.  Shame and humiliation for the US, but glory to Ukraine!",
                    "score": 63,
                    "replies": [
                        {
                            "author": "LookAlderaanPlaces",
                            "body": "The US is currently being taken over from the inside by Russia, as per their plan laid out in The Foundations of Geopolitics by Aleksandr Dugin. We are at war in the US with Russia and Americans are too fucking stupid to even understand that it’s happening. And not even a single weapon was used, just people recruited to commit treason. \n\nThose of us with more than a single brain cell, we fully support Ukraine and all our allies.",
                            "score": 17,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DTFlash",
            "body": "I'm starting to get curious if the reason Trump is trying to strong-arm Zelensky into a deal with Russia instead of military support is because Russia knows it's fucked and can't actually win the war. They're using North Korean troops ffs, they can't be in a great position imo.",
            "score": 21,
            "replies": [
                {
                    "author": "tomorrow509",
                    "body": "Imho, Trumps deal favors Putin. Ukraine surrenders and that's all there is. Territory lost and no compensation for war crimes and reparations. What a deal huh.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "jewkakasaurus",
                    "body": "That’s not a logical way to think about it. The Koreans are there purely as meat waves, and when they find a weak spot in the defensive line using these meat waves, they’ll send in their elite troops while still keeping the rest of the line busy with non stop Koreans.\n\nI’m pro Ukraine but I do think they have a lot of issues that they’re dealing with like recruitment and Russia has way more resources to keep the war going",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "NockerJoe",
                    "body": "Russia's military at the START of the war was already so degraded they were using vans from the 90's and didn't even field forklifts for logistics. Russia NOW is using donkeys instead of vans for resupply and they're using dirt bikes and golf carts to go into battle.\n\n\nFrom the very beginning the estimate was Russia could only keep this up until around late 2025 to 2026. Russia's stocks of tanks is dropping fast. Their ability to produce anything is increasingly limited. They literally can't keep this up.\n\n\nI have a feeling the \"plan\" Europe, Australia, and Canada are putting together basically amounts to scraping together enough to let Ukraine run through this year and then at some point have a coalition just sort of come in and mop up the rest.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ClubsBabySeal",
                    "body": "Not really. The Ukrainians aren't doing well and might have a year left. They know this, hence the whole talk of peace and security agreements that's been floating around for months. Also what do North Koreans have to do with anything? They're literally cheaper than Russian troops and by all accounts effective.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Tangocan",
            "body": "What was it Trump said? 3 days?\n\nWhat was it Putin said? 2 weeks?",
            "score": 116,
            "replies": [
                {
                    "author": "chmod777",
                    "body": "trump said he'd solve the war on day 1. that was, what, 40 days ago? \n\nrussia said it was a 3 day operation 3 years ago.",
                    "score": 75,
                    "replies": []
                },
                {
                    "author": "daniel_22sss",
                    "body": "No, no, the other way around.",
                    "score": 21,
                    "replies": []
                }
            ]
        },
        {
            "author": "Dwayla",
            "body": "Brave courageous Ukrainians, fighting for all our freedom.",
            "score": 37,
            "replies": []
        },
        {
            "author": "ContessaChaos",
            "body": "Slava Ukraini! Heroyam Slava!",
            "score": 32,
            "replies": []
        },
        {
            "author": "alwaysfatigued8787",
            "body": "Hold the the line! Hol the line! Hol line! Holine! Holine!",
            "score": 44,
            "replies": [
                {
                    "author": "PM_ME_UR_VULVASAUR_",
                    "body": "Hold the door... Hold the door.. hold door... Ho..door..\n\n\nHODOR",
                    "score": -27,
                    "replies": [
                        {
                            "author": "snowySTORM",
                            "body": "As much as I hate how the series ended, that part was some of the greatest TV ever.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "ABruisedBanana",
                                    "body": "Unreal! I remember just staring at a black screen for 10 minutes after the credits rolled just savouring how great TV it was.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "snowySTORM",
                                            "body": "You just don't get that experience with TV shows anymore.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "PM_ME_UR_VULVASAUR_",
                                    "body": "For me it has to be the Battle of the Bastards. Ironic that the season it fell off has one of the best scenes! Best movie/tv battle I've seen! Taking top spot from Saving Ryan's Privates.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "lasarus29",
                                            "body": "I just re-watched it and it's legitimately so stressful, intense and claustrophobic. Really amazing.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "sirbissel",
                                    "body": "It's been a long time since I read the books or saw the TV series - was that after the point where they'd run out of book to use?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "tsrich",
                                            "body": "I believe it was, but this reveal came from Martin and was planned",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "PerfectAstronaut",
                            "body": "Ho-di-do",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "KriptiKFate_Cosplay",
            "body": "It's hilarious how much russia absolutely fucking sucks at this.",
            "score": 4,
            "replies": []
        },
        {
            "author": "dcnine",
            "body": "Jeff Lynne is so great",
            "score": 1,
            "replies": []
        },
        {
            "author": "Thunderbolt747",
            "body": "But... the Russians didn't cross in Kupyansk?\n\nThey crossed the Oskil river to it's north and are taking km's worth of ground a day. \n\nSeems like misinformation to me.\n\nedit: for those downvoting me, [here's a fucking map](https://www.google.com/maps/d/u/1/viewer?hl=en&ll=49.78537039564486%2C37.684565534670206&z=12&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k) where you can see the Russians have crossed the Oskil river to the *north* of Kupyansk, in the town of Kyrpychne.",
            "score": -7,
            "replies": []
        },
        {
            "author": "MightyHydrar",
            "body": "Hold the line is relative, russia has a foothold across the Oskil not far north of Kupyansk. ",
            "score": -20,
            "replies": []
        }
    ]
}