{
    "title": "Supreme Court rejects Trump’s request to keep billions in foreign aid frozen",
    "author": "Hrekires",
    "subreddit": "news",
    "rank": 1,
    "score": 13026,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 372,
    "url": "https://www.cnn.com/2025/03/05/politics/supreme-court-usaid-foreign-aid/index.html",
    "id": "1j44611",
    "selftext": "",
    "comments": [
        {
            "author": "Federal_Drummer7105",
            "body": "Alito’s dissent is some choice bullshit. “How dare a lower court override the president!”\n\nThe lower court found that congress had specified money to be spent, and the executive branch can’t just say “Nah.” They can slow walk it, they can do some other shady shit - but in the end they gotta pay out that money. \n\nAlito’s so concerned about someone overturning the president he’s saying the statutes congress passed don’t matter.",
            "score": 3956,
            "replies": [
                {
                    "author": "AlanMorlock",
                    "body": "Also numerous supreme court cases against the executive branch start out in lower courts. That's how the whole system is set up.",
                    "score": 165,
                    "replies": [
                        {
                            "author": "SirStrontium",
                            "body": "Don't *all* cases have to start in lower courts? I didn't think it's possible to just start directly at the Supreme Court.",
                            "score": 66,
                            "replies": [
                                {
                                    "author": "Volk216",
                                    "body": "Most but not all. SCOTUS has original jurisdiction in some niche cases involving ambassadors or when a state sues another state or the federal government.",
                                    "score": 81,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "perverse_panda",
                            "body": "Alito didn't have a problem with lower courts shutting down Biden's student loan forgiveness. \n\nThis is just rank hypocrisy and him pulling objections out of his ass, as usual.",
                            "score": 16,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Shervivor",
                    "body": "Alito was appointed by GW Bush. Thomas was an HW Bush appointee. The other two are Trump appointees. \n\nAll of these men are against rule of law and the Constitution.",
                    "score": 1726,
                    "replies": [
                        {
                            "author": "prelsi",
                            "body": "US is currently filled with corruption",
                            "score": 262,
                            "replies": [
                                {
                                    "author": "starrpamph",
                                    "body": "How many more years until they drain the swamp?",
                                    "score": 120,
                                    "replies": [
                                        {
                                            "author": "Critical_Opening_526",
                                            "body": "The sun's radiation could vaporize Earth's atmosphere, killing all life. Scientists estimate that this will happen in about 7.59 billion years.",
                                            "score": 86,
                                            "replies": [
                                                {
                                                    "author": "Doormatty",
                                                    "body": "So how long after that will it take?  ;)",
                                                    "score": 30,
                                                    "replies": [
                                                        {
                                                            "author": "krw13",
                                                            "body": "Based on how the ~~oldest,~~ most corrupt politicians seem to never die young... I'm guessing at least 10 years after that.",
                                                            "score": 16,
                                                            "replies": [
                                                                {
                                                                    "author": "ffnnhhw",
                                                                    "body": "some people must have the hidden attribute where for every person harmed they gained a min of life\n\non a completely unrelated side note Kissinger and Thurmond were great politicians",
                                                                    "score": 12,
                                                                    "replies": [
                                                                        {
                                                                            "author": "scorpyo72",
                                                                            "body": "*Rupert Murdoch has entered the chat.*",
                                                                            "score": 3,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "author": "-Raskyl",
                                                                            "body": "He would be fucking livid at this embrace of fascism.",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "saints21",
                                                                    "body": "Seriously...why won't this obese, incontinent, dementia-addled piece of shit die?",
                                                                    "score": 12,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "DreamSqueezer",
                                                                    "body": "I don't disagree but that's what oldest means",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "krw13",
                                                                            "body": "That's fair, my brain doesn't work good sometimes.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "gnrhardy",
                                            "body": "They renamed it to soggy field and declared mission accomplished.",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "scorpyo72",
                                            "body": "Swampland will will be available for purchase at $5 Mil/per \"Golden District of Columbia\" acre.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "lurkinglurkerwholurk",
                                            "body": "They’re draining the swamp by pumping nuclear runoff into it. Ergo, no more swamp.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Legrassian",
                                    "body": "Currently?\n\nAlways had been, always will be.",
                                    "score": 24,
                                    "replies": [
                                        {
                                            "author": "flibbidygibbit",
                                            "body": "Yes, but in the past, the corrupt elements fought against one another for a bigger piece of the pie.\n\nNow? All of the corrupt are marching in lockstep carrying the pie overhead, not realizing that they're going to be killed while a dozen oligarchs eat it all, leaving nothing for us",
                                            "score": 28,
                                            "replies": [
                                                {
                                                    "author": "brandnewbanana",
                                                    "body": "I think they’re going to split apart because the base is starting to splinter a bit. Lots of maga really don’t like the admin’s decision.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Piggywonkle",
                                            "body": "These Grima Wormtongue assholes have the nerve to point to Ukraine as corrupt. Ukraine is taking big steps in the right direction. YOU are doing the polar opposite! Take a long walk off a short pier, corrupting POS!",
                                            "score": 9,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Indiana-Cook",
                                    "body": "🌎👨‍🚀🔫👨‍🚀 _always has been_",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "YolandiFuckinVisser",
                            "body": "Amy Coney Barrett was appointed by Trump but at least has maintained some integrity.",
                            "score": 232,
                            "replies": [
                                {
                                    "author": "multificionado",
                                    "body": "She must be the ONLY one appointed by Trump that ever shows sense.",
                                    "score": 68,
                                    "replies": [
                                        {
                                            "author": "rabidstoat",
                                            "body": "Kavanaugh has been more independent than I had feared.",
                                            "score": 73,
                                            "replies": [
                                                {
                                                    "author": "The_Space_Jamke",
                                                    "body": "When the drunk rapist is the least evil person in the room we already have enough to be worried about.",
                                                    "score": 69,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "nevertricked",
                                                    "body": "True. I still think he's rapey and had some sus dealings to erase his financial debt as part of his nomination.\n\nHis written arguments are amateurish compared to his peers. I don't know if he's the one writing them or its the staff/clerks his office hired, but there's a noticeable gap when you read his arguments side by side with Gorsuch, Sotomayor or Roberts.",
                                                    "score": 16,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "DirkaDirkaMohmedAli",
                                            "body": "The fear that scotus will always back trump is overblown. Most lawyers are incredibly rule based, to the point where morality can fly out the window. He is directly trying to break rules that are explicitly codified into law. I'm shocked that they even got four votes against it.",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "JellyBeanzi3",
                                                    "body": "Wouldn’t the 4 be evidence it is not an overblown fear?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "DirkaDirkaMohmedAli",
                                                            "body": "It's sent my fear levels up. But Reddit made it out that they would be on his side 100% of the time.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Ashkir",
                                            "body": "I was also surprised by Gorsuch a few times. He rules well on native american issues, he also, is the one that wrote the opinion on discrimination against gays in the workplace, by defining sex.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "mmmsoap",
                                            "body": "She, Kavanaugh, and Gorsuch have all been less outwardly nuts than either Alito or Thomas. Not that they’re great—though I think Barrett is the most open minded of the lot—but they’re better than the guys who have been there for decades and long ago stopped pretending to actually listen to the cases and apply jurisprudence.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "rubywpnmaster",
                                    "body": "Hey, you can be a BS appointee who's unqualified for the job and still realize that allowing the president to ignore acts of congress will lead to the president ignoring SCOTUS as well.",
                                    "score": 52,
                                    "replies": [
                                        {
                                            "author": "QueezyF",
                                            "body": "That’s the shit that gets me. Motherfuckers out here trying to run themselves out of a job. Some true scorpion and the frog type shit.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Ashleynn",
                                    "body": "This has to have trump absolutely maulding.",
                                    "score": 93,
                                    "replies": [
                                        {
                                            "author": "Horknut1",
                                            "body": "Absolutely what?",
                                            "score": 20,
                                            "replies": [
                                                {
                                                    "author": "Ashleynn",
                                                    "body": "Maulding - When you are extremely angry or upset because something very stupid or unfair happened. \n\nPer urban dictionary. It's just a slang term I'm assuming came from a twitch stream somewhere.",
                                                    "score": 38,
                                                    "replies": [
                                                        {
                                                            "author": "SmokeyBeaar",
                                                            "body": "Yeah the term originates from twitch as a combination of mad and balding to get malding",
                                                            "score": 26,
                                                            "replies": []
                                                        },
                                                        {
                                                            "author": "TCBloo",
                                                            "body": "I've never seen it with the 'u'",
                                                            "score": 8,
                                                            "replies": [
                                                                {
                                                                    "author": "Ashleynn",
                                                                    "body": "That's just how I've always spelled it. Also how I found it on urban dictionary. I'll just say its the Canadian spelling and go with that... I'm not Canadian... but its still what I'm going with.",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "Schmeep01",
                                                            "body": "Karl Maulding was great in On The Waterfront.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Tavern_Knight",
                                                    "body": "It is when an animal sheds its old skin, fur, feathers, or shell to make room for new growth. It's similar to getting a new jacket when your old one is worn out.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Stock-Mission-7561",
                                                            "body": "Isn't that molting?",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "author": "Tavern_Knight",
                                                                    "body": "Yeah, someone else already answered so I was just making a dumb joke",
                                                                    "score": 7,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "sygnathid",
                                                            "body": "No that's molting. Maulding is when something is liquified by being heated past a certain degree.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "TheBunnyDemon",
                                                                    "body": "No that's melting.  Maulding is when someone is losing their hair with age.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "RoosterCancer",
                                                                            "body": "No, that’s balding. Maulding is when someone gets paid to appear in photo shoots and helps to advertise clothing and other products.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "PhotographStrict9964",
                                                                                    "body": "No, that’s modeling. Maulding is what happens to the fresh berries after they’ve been sitting in the fridge for a week.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "mockablekaty",
                                                                            "body": "sorry, that's balding. Maudling is when something is sappy and sad",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "rickdeckard8",
                                            "body": "We just call him Donald now. Or Donny.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "ToughCollege8627",
                                    "body": "Im sure he still regrets every moment of giving a woman ANYTHING.",
                                    "score": 37,
                                    "replies": [
                                        {
                                            "author": "runnin-on-luck",
                                            "body": "He'll recall her cuz she's DEI",
                                            "score": 25,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "ntrubilla",
                                    "body": "Credit where credit is due, she seems to be doing the job with credibility and conviction.",
                                    "score": 50,
                                    "replies": [
                                        {
                                            "author": "HeKnee",
                                            "body": "She only cares about social issues it seems.",
                                            "score": 16,
                                            "replies": [
                                                {
                                                    "author": "ntrubilla",
                                                    "body": "Be that as it may, she’s not just voting exactly how her installer would want her to",
                                                    "score": 34,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "corrector300",
                                    "body": "disagree, she is focused on turning america into a christian nation and gives the left the occasional win as long as it doesn't interfere with her overall goal of trashing 250 years of jurisprudence and making women stay at home pregnant etc etc",
                                    "score": 21,
                                    "replies": []
                                },
                                {
                                    "author": "Nazamroth",
                                    "body": "I would have thought part of the Drumpf appointment process is to amputate your spine. Must have slipped through the cracks.",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "lastburn138",
                                    "body": "I think she realized they were trying to use her and wasn't having it.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "mechwarrior719",
                                    "body": "There’s a shock",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Talic",
                                    "body": "If these were Democrat appointed, Republican would be demanding term limits by now.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "DrEpileptic",
                                    "body": "Reading through her rulings has been surreal. She comes from the most deranged of groups, but is somehow the most reasonable and moderate of the conservative judges. Even her executive immunity ruling reads more like dissent than anything else.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "JJiggy13",
                                    "body": "That's a lie",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "4runninglife",
                            "body": "Thomas was a Reagan appointment",
                            "score": -154,
                            "replies": [
                                {
                                    "author": "BillyOdin",
                                    "body": "No he wasn’t, why don’t you at least google it before arguing.",
                                    "score": 79,
                                    "replies": []
                                },
                                {
                                    "author": "HerezahTip",
                                    "body": "It takes less than 3 seconds to prove you wrong. I can’t believe people just spout shit out their ass like this now.",
                                    "score": 57,
                                    "replies": [
                                        {
                                            "author": "4runninglife",
                                            "body": "You know what I was wrong, I had in my head for years he was a Reagan appointee",
                                            "score": 47,
                                            "replies": [
                                                {
                                                    "author": "Doormatty",
                                                    "body": "10 points for admitting it.  You’re a good person.",
                                                    "score": 29,
                                                    "replies": [
                                                        {
                                                            "author": "fauxdeuce",
                                                            "body": "10 for admitting and another 10 for not deleting and pretending it didn't happen.",
                                                            "score": 14,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Djinnwrath",
                                                    "body": "\"you heard\"\n\nDude.",
                                                    "score": -14,
                                                    "replies": [
                                                        {
                                                            "author": "zac628",
                                                            "body": "When some admits they're wrong on something it's best to not berate them further. Take the win and support their ability to own it. That's what we need more people to be doing",
                                                            "score": 15,
                                                            "replies": [
                                                                {
                                                                    "author": "Djinnwrath",
                                                                    "body": "It's too late for that.\n\nThe damage is done.",
                                                                    "score": -11,
                                                                    "replies": [
                                                                        {
                                                                            "author": "zac628",
                                                                            "body": "That's the spirit",
                                                                            "score": 5,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Djinnwrath",
                                                                                    "body": "When all the federally owned old growth forests are cut down before next midterms, you tell me how much spirit matters.",
                                                                                    "score": -6,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "zac628",
                                                                                            "body": "I'm with ya man it's dark out there. Hard to be optimistic about much in the current political climate.",
                                                                                            "score": 4,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Trowwaycount",
                                    "body": "Reagan left office on January 20, 1989.  Clarence Thomas was nominated on June 27, 1991.\n\nI know this because I took the time to look it up.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "thegooddoktorjones",
                    "body": "Going against the clear intent of the constitution is the definition of judicial activism and Alito and Thomas are the worst activist judges in history.",
                    "score": 201,
                    "replies": []
                },
                {
                    "author": "Gamebird8",
                    "body": ">the executive branch can’t just say “Nah.”\n\nWell, the Executive can say \"Nah\" but only in extremely specific scenarios outlined by Congress.  The Lahey Act for example prohibits the sale of US Weapons to groups and governments that are committing war crimes.  \n\nSo if the Executive finds evidence of wrong doing, they can withhold the funds and adjudicate the claim.\n\n\nThat's not what Trump is doing here though.  They're just freezing funding because they want to, which isn't a reasons explicitly laid out by Congress",
                    "score": 172,
                    "replies": [
                        {
                            "author": "santasnufkin",
                            "body": "The Lahey Act is being ignored completely as the US sells to Israel, Saudis, etc.",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "blitz6900",
                                    "body": "Doesn't mean he can't pick and choose when to use it lol",
                                    "score": 21,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Asleep_Macaron_5153",
                    "body": "[Trump adviser says veterans fired by DOGE are perhaps 'not fit to have a job' right now](https://www.msn.com/en-ca/news/politics/trump-adviser-says-veterans-fired-by-doge-are-perhaps-not-fit-to-have-a-job-right-now/ar-AA1AfkLj?ocid=BingNewsSerp)\n\nWASHINGTON — White House adviser Alina Habba said Tuesday that military veterans affected by the [DOGE-led layoffs of federal workers](https://www.nbcnews.com/specials/federal-workers-fired-emotional-toll-doge-trump-elon-musk/index.html) may not be \"fit to have a job at this moment.\"\n\nSpeaking to reporters on the White House lawn, Habba was asked about fired workers whom Democrats have invited to President Donald Trump's joint[ address to Congress on Tuesday](https://www.nbcnews.com/politics/white-house/trump-joint-address-congress-what-to-expect-rcna194476) night. Habba defended the cuts and said she had no sympathy for the thousands of people who have lost their jobs.",
                    "score": 52,
                    "replies": [
                        {
                            "author": "PrimeMinisterOwl",
                            "body": "Alina's not fit to be a lawyer, maybe she shouldn't bring out attention back to that?",
                            "score": 23,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Flashy_Ground_4780",
                    "body": "How dare they say there's no such thing as a retroactive line item veto! /s",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "matthieuC",
                    "body": "We now know that 4 justices are on the Fascist Dictatorship train.\n\nSomehow it's a good news they're a minority.",
                    "score": 79,
                    "replies": [
                        {
                            "author": "checkpoint_hero",
                            "body": "5-4 in weighing the balance of branches of our government is not a comforting margin *at all*",
                            "score": 92,
                            "replies": [
                                {
                                    "author": "archaelleon",
                                    "body": "Only a matter of time before one of the 5 is 'kindly asked' to resign",
                                    "score": 29,
                                    "replies": [
                                        {
                                            "author": "cantfindmykeys",
                                            "body": "That's a weird way to say \"accidently\" falls out a window",
                                            "score": 11,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Menace117",
                    "body": "Alito accidentally arguing against judicial review. That's what happens when you don't have principles",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "lastburn138",
                    "body": "Alito has no interest in what the actual law says anymore.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Jdonn82",
                    "body": "So he’s not a constitutionalist? Because that would suggest to me he’s anti-constitution and wants a return to a monarchy that sides with him.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "TryharderJB",
                    "body": "Aren’t lower courts also part of the judiciary which is one of those checks and balances features of the system?",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "timelessblur",
                    "body": "Alito is a fake judge at this point. He joints the corrupt Thomas, Rapist Kavanaugh. and Partisan hack **Barrett**.  All 4 I do not count worth anything. Making this ruling a 4-1 ruling.  There are only 5 judges on the SCOTUS that I am willing to give any respect for. The Roberts court is a complete and utter joke.  It quickly appearing **Gorsuch** will be joining the other 4 as unfit to be on any court and they are just making shit up on what should of been a 9-0 ruling.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "jokul",
                            "body": "Barrett sided with the majority. The dissent consisted of Thomas, Alito, Gorsuch, and Kavanaugh.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ryrydundun",
                    "body": "don’t think the lower court found anything yet. \n\nthis was over an appeal to stay a TRO while the lower court decides.  \n\nbut ya still bullshit from alito.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "dreamcicle11",
                    "body": "I thought Gorsuch was one of the more serious constitutionalists, so this is deeply troubling.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "dmk_aus",
                    "body": "\"It makes it harder for us to reign supreme if lower courts formally provide arguments that are hard for us to ignore! Also, we want more credit for what we so! We want more credit for our choice, not just agreeing with some dude! Plus it upsets our boss\"",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "DirkaDirkaMohmedAli",
                    "body": "Alito and Thomas are the hacks in the scotus",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ZLUCremisi",
                    "body": "Its exactly why we had to pay Iran. It was already promised to them and we just delayed it",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Starfox-sf",
                    "body": "He thought JG ~~Wentworth~~ Roberts would sign onto “It’s US’s money and I want it now” argument since he stayed it initially.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Alternative-Chef-340",
                    "body": "Alito is a piece of shit.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -6,
                    "replies": [
                        {
                            "author": "vpi6",
                            "body": "I’m a flaming liberal and I for one have absolutely no issue with a conservative judge ordering the government to pay its bills when the government is completely unable to allege (much less actually prove in court) that there is any wrongdoing with the specific contracts in question. Such a no brainer it shouldn’t even be considered up to the Supreme Court.\n\nThe money was already overdue. The judge had ruled a few weeks ago to tell the government to pay its bills. Due to the government stonewalling and transparently not intending to fulfill the order as well , the judge dropped the hammer. That’s what is supposed to happen when there’s that level of fuckery with the courts.",
                            "score": 33,
                            "replies": []
                        },
                        {
                            "author": "Reead",
                            "body": "Another reason to not mischaracterize the dissent is that doing so makes this decision seem more terrifying. A 5-4 ruling on whether the executive can disregard federal contracts and/or the budget set by congress is a *lot* scarier than the reality that only 2 justices (at most!) would likely rule that way.",
                            "score": 10,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "wwhsd",
            "body": "It’s kind of mind boggling that 4 Supreme Court Justices support the idea that the Executive branch can just deicide not to pay their bills when the Legislative branch has allocated the funding and the recipients have already done what they were to be paid to do.",
            "score": 2134,
            "replies": [
                {
                    "author": "dethwysh",
                    "body": "I want to say it's not mind boggling, it should be a clear example that those justices are not upholding their oaths to the constitution, the rule or law, and The People, and it should be grounds for removal.\n\nBecause as much as it's predictable that these jerks would put party over country, it is also not at all how the system is supposed to work. It will take *a veritable* army of political scientists, much smarter than me to build better Guardrails into the system if empathy, reason, and progress ever regain the wheels of power.\n\nFuck, this is a depressing timeline.\n\nEdit: a word",
                    "score": 676,
                    "replies": [
                        {
                            "author": "vnads",
                            "body": "This. Alito's dissent is entirely based on how he feels the government should be acting, not what the actual fucking rules are",
                            "score": 110,
                            "replies": []
                        },
                        {
                            "author": "fiurhdjskdi",
                            "body": "It doesn't take an army or genius to design a better system. Most democracies appoint their executive from the legislature instead of electing them, and have to form coalitions to make a majority for that appointment, removing much of the potential for a populist and limiting the potential of an authoritarian anti-legislature movement.\n\nTheir constitutions are also much more clear at precisely enumerating the power of that executive and by design give it way less power than our executive branch has. \n\nThe founders of our constitution existed at a time when horses were still the primary means of transport and the legislature convened only intermittently, so they worried that it wouldn't be fast acting enough to respond and govern in real time so they left the executive branch with vague clauses that can be interpreted and used (abused) to act quickly. These things have been decried by legal scholars for decades as glaring and outdated flaws in the modern world. \n\nHaving a vague patchwork of enumerated powers that ends up being based on 250 years of \"interpretations\" setting precedents more than the vague clauses in the original constitution is a super dogshit system of government and it should be a surprise to no one that this much executive abuse is so easy to get away with in America.",
                            "score": 99,
                            "replies": [
                                {
                                    "author": "GermanPayroll",
                                    "body": "Yeah, but the idea of an independent President comes from a desire to have a brake against Congress, it’s part of the checks and balances as originally designed. Now 100% the Presidency has gotten waaaay too powerful (in my opinion, but your suggestion literally requires reformatting the entirety of the government into a parliamentary system which the US sought to get away from.",
                                    "score": 42,
                                    "replies": [
                                        {
                                            "author": "Budget_Shallan",
                                            "body": "Compare US Democracy to literally any other country that uses a parliamentary system. \n\nNone of them are as fucked as the US right now. Please don’t knock the parliamentary system.",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "Galxloni2",
                                                    "body": "Israel uses the parliamentary system and can't get rid of netanyahu because of it. He has 20% support at any given time but they can't form a coalition against him",
                                                    "score": 24,
                                                    "replies": [
                                                        {
                                                            "author": "ERedfieldh",
                                                            "body": "That's most because a certain country keep swooping in and interfering with the process.",
                                                            "score": -2,
                                                            "replies": [
                                                                {
                                                                    "author": "Galxloni2",
                                                                    "body": "The US isn't changing their elections",
                                                                    "score": 6,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "UnnecessarilyFly",
                                                                    "body": "Wild how disinformed you are.",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "wheres-my-take",
                                                    "body": "Nobody knocked it",
                                                    "score": 12,
                                                    "replies": [
                                                        {
                                                            "author": "GermanPayroll",
                                                            "body": "The founding fathers did, which is kinda the point.",
                                                            "score": 4,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "CharlesV_",
                                                    "body": "No one is knocking it, I would love to have that here. But you’re asking for the moon. As in, it would literally be easier to send astronauts back to the moon vs rewriting the US constitution to give us a parliamentary system. The idea of even passing a single amendment to the constitution is almost laughable right now. They couldn’t even ratify the ERA.",
                                                    "score": 7,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Oops_I_Cracked",
                                    "body": "Notably, many of our founders, also recognized that the constitution and our government shouldn’t be immutable and permanent. They recognized that it would need to change and grow as the country changed and grew. This is the part where we really dropped the ball. As our world and our country has changed, we’ve stopped updating our government and it shows. Most other democracy have far younger constitutions updated far more regularly than ours.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Strowy",
                                            "body": "> Most other democracy have far younger constitutions updated far more regularly than ours\n\nThe French have had 5 different republics in the same time period, as a comparison.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "ughthisusernamesucks",
                                    "body": "> Their constitutions are also much more clear at precisely enumerating the power of that executive and by design give it way less power than our executive branch has. \n\n\nI thhink it's important to point out that the US constitution does not grant the executive broad powers. It's powers are actually pretty narrow constitutionally speaking. \n\n\nIt does allow congress to delegate powers to the executive though.\n\n\nAnd congress has delegated basically all power to the executive because otherwise they'd have to be accountable for something.\n\n\nbut generally agree... there are better systems out there.. I think parliamentary systems are way more functional than the nonsense we have in the US",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Anvanaar",
                            "body": "The US simply needs a REAL, true, direct democracy. One with more than two parties, one where a majority is needed to rule, where multi-party coalitions have to be formed if no majority is otherwise reached, and one where the literal and simple majority vote of the people of the country is all that matters.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "sakatan",
                            "body": "It needs an army, you say?",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "AdEast4272",
                            "body": "It's not so much party over country, it's Fed Soc ideology. The current batch of republicans just happen to be using the Fed Soc playbook.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "matthieuC",
                    "body": "The real question was : is the president a king or does some rule of law apply.\n\n4 justices were emphatically for dictatorship",
                    "score": 119,
                    "replies": [
                        {
                            "author": "clocks212",
                            "body": "Absolutely nothing would make me happier than those 4 justices sitting in jail from Inauguration Day until the last day of the next administration as an “official act” with preemptive pardons issued for everyone involved in locking them up. ",
                            "score": 43,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "zeno0771",
                    "body": "> deicide\n\nThat's kind of what's needed here, actually.",
                    "score": 38,
                    "replies": []
                },
                {
                    "author": "bbqsox",
                    "body": "Alito and Thomas are hardcore fascists. They're in the bag for this crap. The other two were appointed by Trump during his first term. They were handpicked by the same people that put Project 2025 together.",
                    "score": 63,
                    "replies": []
                },
                {
                    "author": "North_Refrigerator21",
                    "body": "The American courts have been politicized for a while. The American constitution is too weak and is in many regards up for too much interpretation. Democracy has been upheld in the U.S. based on strong traditions. \n\nNow there is someone who gives two shits for tradition, and a political Supreme Court. American democracy on life support. I have a hard time to see how this is turned around, but I hope I’m wrong.",
                    "score": 20,
                    "replies": [
                        {
                            "author": "fiurhdjskdi",
                            "body": "100% our constitution is extremely vague and was written at a time when the legislature barely convened at all and traveled by horse, hence why they left the executive with so much power to act on its own. Glaring flaws in the modern world that should have been fixed ages ago but instead we have a patchwork of 250 years of \"interpretation.\"",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "Shenanigans80h",
                            "body": "Oh absolutely. One of the scariest things about Trump is he does not take any of these checks and balances seriously. He’s going to push the designed limits of the presidency, then he’ll ignore or break down the roadblocks presented from there. A lot of these institutions’ power is only granted on what can essentially be called a trust system where we agree to work together. If one beanch simply doesn’t, who tf knows what happens next",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Clovis42",
                    "body": "They didn't really rule on that question, and the dissent doesn't really say that. It seem that the 4 are making a procedural complaint. Probably a stupid one, but I'm not a lawyer.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "matgopack",
                    "body": "Bills *for work already done*.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "bigchicago04",
                    "body": "I wonder how he’d rule if it was a democrat revoking the courts budget",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Memory_Less",
                    "body": "Indeed, those justices dissenting essentially are doing an, “All Hail to the King!” Alternatively, a zig hail….both!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "AV8ORA330",
                    "body": "It goes against the central make up of our democracy. The President is taking over the other two branch’s. What’s that called?  Totalitarian…",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Important-War-4708",
                    "body": "Andrew Jackson would like a word",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "DrDerpberg",
                    "body": "They're so far gone that I can only imagine they're willing to sacrifice themselves for the cause at this point. \n\nIf Trump has the power they say he does, they exist at his pleasure to rubber stamp whatever he says, and if he wants to disband the court at some later date he totally can and they'll all be jobless.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Nethias25",
                    "body": "It's particularly wild cause Trump has a majority in the house and senate. If the court says you don't have the authority with executive only, say cool story bro and call Thune/Johnson to work a bill to defund USAID. \n\nOr is the majority not so ironclad?...we shall see soon...",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "news_feed_me",
                    "body": "Is it? They don't care how the government is supposed to work or why and probably don't understand why the system was designed as it was. This has been painfully obvious for a decade atleast. American conservatives are traitors to the constitution.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ukexpat",
            "body": "OK, so now let’s see if trump complies and if he doesn’t, then what?",
            "score": 478,
            "replies": [
                {
                    "author": "QuixoticBard",
                    "body": "nothing. Its  an official act. He won't get prosecuted. Don't get more official actish,  than an Executive order.",
                    "score": 311,
                    "replies": []
                },
                {
                    "author": "checkpoint_hero",
                    "body": "Well, for one, I think given *how much shit* there has been, we can take a minute to celebrate the ruling. Democrats never seem to be happy unless something is perfect.\n\n5-4 is alarming, but it still landed on the right side of supporting the balance of power among branches of government.",
                    "score": 72,
                    "replies": []
                },
                {
                    "author": "papaswamp",
                    "body": "If I understand the Impoundment Control Act… in 45 days from his hold, the funds are released anyway (assuming congress does nothing).",
                    "score": 103,
                    "replies": [
                        {
                            "author": "uberares",
                            "body": "which for something like USAID will still cause devastation and loss of life.",
                            "score": 63,
                            "replies": [
                                {
                                    "author": "papaswamp",
                                    "body": "The US is $36T in debt, paying over $1T in interest on that debt. Other countries must step up. I even suspect in the next 4yrs, the USD will stop being the world reserve currency. When that happens... US will be the one needing aid...think great depression.",
                                    "score": -82,
                                    "replies": [
                                        {
                                            "author": "uberares",
                                            "body": "You dont get get care about the debt when Republicans just upped the limit another $4.5T and trump raised it more in one term than any potus in us history. These actions by this admin are going to speed run that Great Depression. \n\nEdit: also that’s not just me saying DJT ‘s actions will cause a Great Depression: \n\nhttps://www.wsj.com/economy/trade/tariff-war-risks-sinking-world-into-new-great-depression-235fffeb",
                                            "score": 75,
                                            "replies": [
                                                {
                                                    "author": "papaswamp",
                                                    "body": "Yes the Democrats have been epic fiscal hawks 🙃. I love how it is suddenly one party that got us here, when it has been both. Both voted for the debt limit suspension last time. Both voted for $7T in govt spending last FY. Both are incapable of doing their job of passing a full FY budget on time (1996 was last). They want you thinking D or R. Stop being a party political patsy. They all need to go.",
                                                    "score": -62,
                                                    "replies": [
                                                        {
                                                            "author": "uberares",
                                                            "body": "The Economy has performed much better under dems than republicans since wwii. You dont care about that though, it doesn’t fit your false narrative.\n\nThere are numerous studies and links had you taken even the slightest time to see them. ",
                                                            "score": 27,
                                                            "replies": [
                                                                {
                                                                    "author": "papaswamp",
                                                                    "body": "Please ...[show me that increasing better economy.](https://fred.stlouisfed.org/graph/fredgraph.png?g=1EcBn&height=490) for the people.",
                                                                    "score": -19,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Skelegasm",
                                                                            "body": "We're done showing you the obvious man. Let misery be your teacher now",
                                                                            "score": 11,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "LillaKharn",
                                                            "body": "Why is the debt bad? Why is the debt bad for our personal lives? What, specifically, is the fallout from actually having debt as a country?",
                                                            "score": 20,
                                                            "replies": [
                                                                {
                                                                    "author": "papaswamp",
                                                                    "body": "Debt is fine as long as it can be paid off. The USG is facing some $6.7T in short term debt due in a year (basically an entire years budget plus over spending) at the same time they need to generate a full FY budget. USG is now facing an exponential debt expansion. This will lead to one outcome. US bond yields (cost of getting more loans) spiking and the rapid devaluation of the USD to the USD losing reserve status. When that happens... next great depression. [Here is the US dollar value today](https://www.tradingview.com/symbols/TVC-DXY/?utm_source=google_ads&utm_medium=cpc&utm_campaign=PPCNONBRAND_GOOGLE_GLOBAL_EN_SALES_GENERIC&utm_id=20367781676&utm_term=dollar_index&utm_content=666074055065&matchtype=e&gad_source=1&gbraid=0AAAAABUK9i1YZhQLHnrpzfn7PBRKKCV7h&gclid=EAIaIQobChMIyYXT2NfziwMV03R_AB0tpR2pEAAYASAAEgJXE_D_BwE)",
                                                                    "score": -10,
                                                                    "replies": [
                                                                        {
                                                                            "author": "LillaKharn",
                                                                            "body": "What does paying off the debt completely do for the United States government? Who owns the majority of the debt?",
                                                                            "score": 11,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "papaswamp",
                                                                                    "body": "Paying off completely? Not possible.. not even close to possible. +$36T Not paying +$1T interest alone would make a huge difference in capabilities the govt to provide citizens.",
                                                                                    "score": -3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "LillaKharn",
                                                                                            "body": "How does the government paying off debt enable the government to provide more for its citizens? Are we not able to balance a budget within the confines of that debt to provide more?",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "papaswamp",
                                                            "body": "Come on you down voters... don't be shy... tell me which party is the fiscally responsible one...please show tour work. US dollar value is presently crashing... yes right now.",
                                                            "score": -9,
                                                            "replies": [
                                                                {
                                                                    "author": "uberares",
                                                                    "body": "I’m sure you’ll move goalposts.. people don’t interact with those like you because you refuse reality. \n\nWe have almost one hundred years of the economy being better under democrats and worse under republicans. \n\n\nThis isnt a new thing, like I said, it’s been going on. For almost one hundred years now. The difference is that republicans have convinced their base to believe in lies and fabrication. \n\n\n\nhttps://en.m.wikipedia.org/wiki/U.S._economic_performance_by_presidential_party#:~:text=Since%20World%20War%20II%2C%20the,income%20growth%2C%20and%20corporate%20profits.",
                                                                    "score": 20,
                                                                    "replies": [
                                                                        {
                                                                            "author": "papaswamp",
                                                                            "body": "Again... show me [Please show me the growth for the people...](https://fred.stlouisfed.org/graph/fredgraph.png?g=1EcBH&height=490)",
                                                                            "score": -7,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "uberares",
                                                                                    "body": "So it’s sealioning then. Like I said, not sure why I’m replying when it’s clear you’re not interested in reality.\n\nWe are done, you linked buying power graph which proves nothing as it’s been down for decades. \n\nAgain, republicans aren’t even attempting a balanced budget, their latest iteration doesn’t balance anything and includes $4.5 trillion in additional lending. ",
                                                                                    "score": 16,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "papaswamp",
                                                                                            "body": "Yes 'down for decades'... transcending either party control. You are close to the realization... just not quite there yet... so close.",
                                                                                            "score": -7,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "uberares",
                                                                                                    "body": "No, you’ve moved the goalposts like I said you would. We are done. \n\nSpending power is not the Economy. ",
                                                                                                    "score": 3,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "iclimbnaked",
                                            "body": "All of that is on Congress to fix via its spending/tax bills. \n\nThe executive is not supposed to start controlling the purse. That’s very explicitly congress",
                                            "score": 21,
                                            "replies": [
                                                {
                                                    "author": "papaswamp",
                                                    "body": "Correct (mostly). I was referring to future spending. Though I seriously doubt congress will suddenly become fiscally responsible.",
                                                    "score": -6,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "SpiritJuice",
                                            "body": "If Trump REALLY cared about debt, why didn't he do this during his first term AND spend less than Obama? Instead he spent more than any other president before him in just FOUR years WHILE lowering taxes to pay for spending. That isn't even counting COVID spending. Just actually think about it for more than ten seconds. They like to throw around big numbers to scare the uninformed. Like when talking about wasteful spending, he reduced a ocean health monitoring fund to \"treadmills for shrimp\", removing all context. And people just believe him because when you reduce it to that level, yeah it is going to sound dumb. If you TRULY care about America, you would reject reductionism and anti-intellectualism that is plaguing American society and the current government. We ALL lose if society just becomes crabs in a bucket that truly think government is spending millions of dollars on shrimp treadmills.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "astralustria",
                                            "body": "The national debt isn't really a problem and it can grow indefinitely without inherent issue.\n\nThinking debt is inherently bad is just the result of a poor understanding of economics. A nation isn't a household on limited income. It doesn't need to balance the budget in the same way.\n\nWhat can cause problems though is the debt increasing too quickly or economic growth slowing down too much. Both of which are things thay tend to happen as a result of a Republican policies.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ukexpat",
                            "body": "Unless of course someone stops them from being released.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "papaswamp",
                                    "body": "Who does that? Esp in light of this ruling. Future funds... sure, but already allocated, not going to happen.",
                                    "score": -3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MalcolmLinair",
                    "body": "Then we see why Musk and DODGE went straight for the Treasury Department's servers and spent days altering their basecode.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "dragonmp93",
                    "body": "It's funny, because Trump going against the courts is the one thing that MAGAs are actually afraid of.\n\nBecause at local level, the court wins (the praying coach, the cake and the gay website, for instance) are the only thing that they have.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "blastradii",
                    "body": "Unless citizens are willing to take control and fight it out with the military which Trump controls….nothing.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Dizzy_Agency_2044",
                    "body": "I have for earqqyqqrtt55et6aa55A",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "jlonso",
            "body": "Damn Justice Amy Coney Barrett doing justice.",
            "score": 382,
            "replies": [
                {
                    "author": "Mysterious-House-51",
                    "body": "Too bad she's done significant damage prior to this with overturning roe and giving cheeto immunity.",
                    "score": 276,
                    "replies": [
                        {
                            "author": "sheriffoftiltover",
                            "body": "She actually dissented in the immunity ruling if you read it. But she did delay his investigations",
                            "score": 231,
                            "replies": [
                                {
                                    "author": "mcmatt93",
                                    "body": "She dissented with one specific part of the ruling, but signed off on every other part of it.",
                                    "score": 134,
                                    "replies": [
                                        {
                                            "author": "jokul",
                                            "body": "That was an extremely important distinction. Barrett's dissent is at least justifiable: if the constitution gives the president an explicit power that power cannot be used in the commission of the crime. The biggest middle finger which went way beyond what most people thought would happen, was when actions that occur as part of explicit powers can't even be used as evidence to determine if the president committed a crime.\n\nI can at least see why someone would argue you can't charge Trump with criminal conspiracy for his conversation with Barr, but not even being able to use that as evidence for other crimes he may have committed is completely insane. That statement is what led to much of Smith's case to switch gears: he could probably have dealt with not charging Trump for the Barr conversation, but not even being able to use anything he did while carrying out a \"conclusive [or] preclusive\" act as evidence was devastating.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "vpi6",
                                    "body": "Only on the part that said official actions could not be used as evidence in other proceedings. She wasn’t ready to go that far.",
                                    "score": 51,
                                    "replies": [
                                        {
                                            "author": "jokul",
                                            "body": "That was an incredibly important distinction.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "thibedeauxmarxy",
                    "body": "A broken clock...",
                    "score": 14,
                    "replies": []
                }
            ]
        },
        {
            "author": "rapidcreek409",
            "body": "That there are only five SCOTUS votes for paying congressionally mandated invoices for work *already* done!? This should be as basic a test of Article I as you can get. And that does not bode well for decisions to come",
            "score": 354,
            "replies": []
        },
        {
            "author": "CRoseCrizzle",
            "body": "Interesting that 2 conservatives, including 1 Trump appointee in Barrett ruled against Trump. Though maybe not so much considering how relatively extreme this case is. The decision to spend this money is made by Congress and the executive branch, in theory, shouldn't be able to stop it for long.\n\nWhat will be more interesting(albeit also scary and dangerous) is what happens if the executive branch starts to ignore judicial rulings that they don't like.\n\nIf Congress sits around and concedes authority to the executive branch and the judicial branch turns out to be toothless, that kind of defeats the whole checks and balances concept that we've leaned on for so long. From there the executive can do whatever, no?",
            "score": 67,
            "replies": [
                {
                    "author": "Impossible-Glove3926",
                    "body": "Barrett is a constitutionalist through and through. She may be a vile religious sycophant, but she does think the constitution should be followed. It is a sad day when the plunge into complete authoritarian rule relies on fucking Amy Coney Barrett… but here we are.",
                    "score": 53,
                    "replies": [
                        {
                            "author": "UnnecessarilyFly",
                            "body": "If the constitution meant anything to her she would have never been a part of this entire charade to begin with. These people are not like us.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "babecanoe",
            "body": "Hallelujah. I haven’t been keeping up too much with which justices vote for what so maybe this is normal, but I was surprised to see Amy Coney Barrett voted with the liberal justices.",
            "score": 215,
            "replies": [
                {
                    "author": "resilindsey",
                    "body": "ACB has been surprising. Obviously in terms of abortion and many women's rights things, she isn't great. But she seems to be an old school conservative. That is, she's a strict constitutionalist / originalist.\n\nWhile sometimes (often times) I disagree with such interpretations of the law, she is at least fairly consistent with it, which means she will on occassion side with the liberal justices. Especially on several LGBTQ issues which has been nice (while she wasn't part of Bostock vs. Clayton, she has often voted to reject hearing many cases related to LGBTQ issues, which left the lower courts' decisions in line with anti-discrimination in place). \n\nUnlike the \"new\" conservatives like Alito and Thomas and the sex predator who likes beer, who don't really have any principles. They will change/bend their interpretation as they please to suit their agenda. It's less that their school of interpretation guides their conclusions so much as that their pre-concieved conclusions dictate which school of interpretation to use to support it.\n\nI still don't like ACB, but she's a fairly loose jenga if you can argue a case that aligns with her philosophy. It gives me some hope that the upcoming US vs. Skrmetti as well as other legal challenges to the Trump admin will be correctly decided. Roberts and Gorsuch also fall into similar descriptions (e.g. they were part of majority in Bostock vs. Clayton, with Gorsuch even writing the majority opinion), so along with three liberal justices, just getting any two of Barett, Gorsuch, or Roberts will win cases.\n\nPost-edit: And further to ACB's credit, she also was the lone conservative justice who didn't rule against the EPA/Clean Water Act in the very recent City of SF vs. the EPA decision and wrote the dissenting opinion. She is a tricky one to nail down how she will sway.",
                    "score": 57,
                    "replies": [
                        {
                            "author": "BabySuperfreak",
                            "body": "It's one thing to fantasize about being a corrupt piece of shit and taking everything for yourself.\n\n\nIt's another to actually have the paper in front of you, pen in hand, and still be able to say \"yeah, fuck this country\".",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "jokul",
                            "body": "She may not be a good person but she is principled. The one good thing is that, if birthright citizenship goes before the supreme court, it is extremely unlikely that she (and Roberts) choose to overturn the 14th amendment. TBH I don't think Gorsuch or Kavanaugh would do that either but that case shouldn't have a plausible 7-2 margin.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "p_pio",
                    "body": "According to wikipedia she has quite history of independent voting. It looks like trump accidentally managed to appoint last time someone who's not an opportunist \"conservative\" but someone who's really  old school conservatist.",
                    "score": 144,
                    "replies": [
                        {
                            "author": "jgoble15",
                            "body": "And part of a cult. She’s not great. But doesn’t seem she’s greedy, just an idealist for nutty ideals",
                            "score": 76,
                            "replies": [
                                {
                                    "author": "Crasino_Hunk",
                                    "body": "ACB and even Kavanaugh have somehow been not quite as treacherous as feared.\n\nNot great, not great at all - but definitely not Alito or Thomas.",
                                    "score": 45,
                                    "replies": [
                                        {
                                            "author": "jgoble15",
                                            "body": "They both don’t seem greedy, just following insane ideals. So they aren’t bought, just crazy. Kavanaugh and his immunity ruling, and again ACB and the cult, but greed is the main enemy right now. Won’t trust them, but will accept helpful rulings from them",
                                            "score": 17,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "MTAlphawolf",
                            "body": "That might be the last time they decide to trust a woman...",
                            "score": 11,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "imoftendisgruntled",
                    "body": "She's more likely in it for the Christian Nationalist hegemony rather than the Unitary Executive/President is a King angle.\n\nShe's bad, just in a different way.",
                    "score": 70,
                    "replies": []
                },
                {
                    "author": "Angry-Wombat1871",
                    "body": "I HIGHLY recommend the podcast 5-4. It’s super informative and the hosts are pretty funny. They are very left leaning but they still shit on the liberal justices when they are being morons too. My friend has been recommending this podcast to me for years and I thought it would be a lot longer episodes and very dry, I also thought I would just get pissed off listening to it. I will say the episodes are a lot shorter than I imagined (~45 mins) the hosts are very knowledgeable and very funny and have amazing chemistry. I will also say that it for sure does piss me off listening to what happened in each case and the reasonings behind the decisions. Especially the Castle Rock vs. Gonzales one…..",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Shervivor",
            "body": "“Four of the court’s conservatives — Justices Clarence Thomas, Samuel Alito, Neil Gorsuch and Brett Kavanaugh — dissented.”\n\nThese are the men who will dismantle our democracy. \n\nSo shocked by Coney Barrett. I guess she does understand the Constitution and the benefit of rule of law. \n\nBTW- this ruling merely states that the USG must pay for work already done by implementers. This is money owed to them.\n\nETA: to fix typo.",
            "score": 513,
            "replies": [
                {
                    "author": "bigdumb78910",
                    "body": "Not sure if you forgot, typo'd, or didn't know, but Coney Barrett is a lady, \"she\"",
                    "score": 349,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -93,
                            "replies": [
                                {
                                    "author": "WampaCat",
                                    "body": "What statement is that?",
                                    "score": 41,
                                    "replies": [
                                        {
                                            "author": "checkpoint_hero",
                                            "body": "For someone who removed Roe I'd say she doesn't get to keep her preferred gender pronouns",
                                            "score": -26,
                                            "replies": [
                                                {
                                                    "author": "Delann",
                                                    "body": "Roe v Wade had nothing to do with preferred pronouns? Embracing ignorance isn't the play, especially when it's one of the main reasons for shit hitting the fan currently.",
                                                    "score": 29,
                                                    "replies": [
                                                        {
                                                            "author": "checkpoint_hero",
                                                            "body": "It’s not ignorance, it’s malice. And it’s the tiniest infraction for someone who betrayed the human rights of their entire gender. That’s how it’s related.",
                                                            "score": -18,
                                                            "replies": [
                                                                {
                                                                    "author": "DrJanItor41",
                                                                    "body": "\"I support your rights on the condition that you don't disagree with me on anything\" is always a fun read on Reddit.",
                                                                    "score": 9,
                                                                    "replies": [
                                                                        {
                                                                            "author": "checkpoint_hero",
                                                                            "body": "Rather, I view the human right over your own body and related medical care to not be something to be disagreed about.\n\nIt's my body and the government doesn't have any right or place in discussion over the medical care I choose to receive. So, fuck Amy and I'll insult her all I want and fuck anyone that defends her.",
                                                                            "score": 0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "elscorcho91",
                                                                    "body": "This is a profoundly Reddit moment",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "BaronvonEssen",
                                    "body": "As a non cis person, I suggest you change it. Misgendering someone you disagree with says gender is to be respected conditionally, and that leads into litany of further implications.",
                                    "score": 38,
                                    "replies": [
                                        {
                                            "author": "Xanadukhan23",
                                            "body": "also not sure what the statement is supposed to be either",
                                            "score": 24,
                                            "replies": []
                                        },
                                        {
                                            "author": "checkpoint_hero",
                                            "body": "I hear you but isn't it okay to be a little vindictive to someone directly responsible for overturning Roe v Wade?\n\nedit: y'all soft. I'll treat enemies as enemies. Fuck the high road. I ***don't*** have respect for Amy, any part of them.",
                                            "score": -24,
                                            "replies": [
                                                {
                                                    "author": "Realtrain",
                                                    "body": "By going against your own beliefs? No, IMO.",
                                                    "score": 23,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Zman6258",
                                                    "body": "\"I'm fine with rapists being raped in prison\", to use a more extreme example. You *shouldn't be* fine with that.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "checkpoint_hero",
                                                            "body": "oh good lord, if you have to amplify your example to that extreme, you have a very weak point.\n\nAmy isn't going to see this reddit comment thread, they'll be fine",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "BaronvonEssen",
                                                    "body": "No. It’s not being vindictive, it’s saying gender identity is conditional, which it isn’t if you really believe in it. \n\nTo be hyperbolic; if a terrible mass murderer assigned male at birth  asked to be called “she”, you should do so, not because you respect them, but because you respect the idea of gender identity. \n\nDon’t become your high school gym teacher who called everyone “ladies”.",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "checkpoint_hero",
                                                            "body": "I'm choosing to disrespect her, I'll choose how to do it. I respect gender identity, I don't respect anything about Amy.\n\nIt seems like the sort of thing that would bother Amy, then that sounds great to me. Have fun taking the high road. How's that been working out for Democrats?",
                                                            "score": 0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Crockwok",
                                                    "body": "That's is infantile as fuck",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "checkpoint_hero",
                                                            "body": "What do you call taking away human rights?",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ERedfieldh",
                            "body": "I thought pronouns were bad?",
                            "score": -14,
                            "replies": [
                                {
                                    "author": "bigdumb78910",
                                    "body": "No, pronouns should, and always have been, according to the gender that the person ascribes to. Amy Coney Barrett, as far as anyone has shown, arms to be a cis woman, and she should be referred to as such. I don't think she would like someone referring to her as a man.",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "talktobigfudge",
                    "body": "I'm more shocked that John Roberts voted to put a leash on Putin's chihuahua Krasnov. ",
                    "score": 67,
                    "replies": [
                        {
                            "author": "bbqsox",
                            "body": "Roberts somehow still thinks he’s a good guy that respects the rule of law despite his Court’s constant attempts to undermine the Constitution.",
                            "score": 64,
                            "replies": []
                        },
                        {
                            "author": "canada432",
                            "body": "Roberts still thinks of himself as the enlightened centrist. Acting as if he makes rulings based entirely on the law and nothing else, while also ignoring the corruption and dismantling of the constitution because it's inconvenient for him and makes his side look bad.",
                            "score": 17,
                            "replies": []
                        },
                        {
                            "author": "matthieuC",
                            "body": "I think he is smart enough to recognize that id they keep letting the president do everything he wants the supreme court will have no power.\n\nAnd roberts very much likes having power.",
                            "score": 27,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ChicagoCowboy",
                    "body": "Coney Barrett is a woman.",
                    "score": 81,
                    "replies": [
                        {
                            "author": "agustybutwhole",
                            "body": "I can’t be compelled to use preferred pronouns.",
                            "score": 56,
                            "replies": []
                        },
                        {
                            "author": "photonnymous",
                            "body": "Are we sure? You can't always be sure these days  /s",
                            "score": -49,
                            "replies": [
                                {
                                    "author": "Johns-schlong",
                                    "body": "Until we have assigned court genital inspectors and confirming DNA tests I refuse to believe any of their genders are what they say.",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Bravely_Default",
                    "body": "Coney Barrett is a handmaid not a commander.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "SnooCats373",
                            "body": "Commanders, generally, get to keep all their fingers.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "counterweight7",
                    "body": "Barret is a she.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Shervivor",
                            "body": "Are we sure??? 🤔",
                            "score": -22,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "thejawa",
                    "body": "For reported \"Constitutionalists\", they don't seem to care much about what the Constitution actually says.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "luvvdmycat",
                    "body": ">shocked by Coney Barrett. I guess he does\n\n\nYou misgendered Barrett! 😤",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Shervivor",
                            "body": "It was a typo, but no way I am changing it!",
                            "score": -7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "jayfeather31",
            "body": "So, it looks like this isn't a particularly strong ruling against Trump, despite the headline, given that it basically shifts responsibility back down to the lower court.\n\nAt least that's something, I guess?\n\nIn any case, we'll see if Trump decides to Jackson this.",
            "score": 71,
            "replies": []
        },
        {
            "author": "kevendo",
            "body": "Whenever I hear even moderately good news from SCOTUS, I immediately fear that it's a bone being thrown to the Left right before an awful ruling for Trump.",
            "score": 77,
            "replies": [
                {
                    "author": "uberares",
                    "body": "Dont worry, they were always going to throw a few bones. The real question is how few bones and which bones. We now see one is funding, which quite frankly its disgusting that four of these hacks feel they can just ignore the outright Constitution.",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "a2godsey",
                    "body": "I think that any time something doesn't go exactly to Mr. Orange that something much worse will follow. It's a rule of thumb at this point.",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "Realtrain",
                    "body": "That EPA ruling yesterday was not great.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "breakinveil",
            "body": ">billions of dollars in foreign aid **approved by Congress**\n\nNo Kings live here",
            "score": 14,
            "replies": []
        },
        {
            "author": "Newparlee",
            "body": "It’s insane to me how many Americans are basically admitting they want a dictatorship. Barrett does her job, and it’s “TROJAN HORSE! LIBERAL PLANT! WE HATE HER!” But when she voted to make Trump invincible; crickets.\n\nIt really is scary how in a split second MAGA can hate you if you don’t do what they want.",
            "score": 13,
            "replies": []
        },
        {
            "author": "SuperF91EX",
            "body": "You could pencil in Alito and Thomas on virtually any right wing wet dream . Gorsuch close behind.",
            "score": 24,
            "replies": []
        },
        {
            "author": "-OptimisticNihilism-",
            "body": "Sooo. Trump will still just not send the money, right?  Even so the damage has been done for a lot of these organisations.",
            "score": 18,
            "replies": [
                {
                    "author": "cyberentomology",
                    "body": "Trump isn’t the one sending the money.",
                    "score": 8,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheShipEliza",
            "body": "5-4 is insane. The court is a disgrace.",
            "score": 20,
            "replies": []
        },
        {
            "author": "ratsareniceanimals",
            "body": "It's mind-boggling this isn't 7-2 with only the absolute extremist partisans dissenting.",
            "score": 7,
            "replies": []
        },
        {
            "author": "DrRichtofen18",
            "body": "When Trump ignores the order and doesn’t unfreeze spending. Does that mean that when a democrat wins in 2028 they can unilaterally forgive student loans? Maga went from praising the courts because they limited Biden but now want to ignore them",
            "score": 8,
            "replies": [
                {
                    "author": "ZiKyooc",
                    "body": "There's not much to unfreeze, they terminated most contracts last week.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "GatewayArcher",
                            "body": "The govt still needs to pay contractors for work performed through the effective date of termination.   Musk & Trump don’t want that to happen.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "aqries907",
                    "body": "Talk about revisionist history. https://www.foxnews.com/video/6347417216112",
                    "score": -4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sithslegion",
            "body": "Dang 1 vote away from me completely losing faith in the Supreme Court. Way too close. 10th grade civics class teaches the basics of government and these judges can’t get it right after decades of experience.",
            "score": 8,
            "replies": []
        },
        {
            "author": "corrector300",
            "body": "alito is the absolute worst and is not a american patriot but a lying traitor to the american values most of us hold. kavanuagh is a beer swilling rapist liar. barrett throws the occasional sop to the left while plotting to remake america in the footprint spelled out by the project 2025 ongoing coup.",
            "score": 7,
            "replies": []
        },
        {
            "author": "ACorania",
            "body": "Again, this not a blow to the administration. The plan of 2025 is to go way too far too fast, 180 days specifically. They know they can't keep it all but win if even some sticks and so much damage is already done and can't be remedied by the courts. They know they can't be held accountable by the courts either.",
            "score": 15,
            "replies": [
                {
                    "author": "penguished",
                    "body": ">They know they can't be held accountable by the courts either.\n\nCourts can hold people in contempt.. including penalties. It's a separation of powers system because the founders knew absolute power in any branch would just destroy democracy. So it is the court's most important duty in this case, if a branch of government wants to ignore them to address the problem.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "ACorania",
                            "body": "Trump can pardon any criminal charges including contempt.  They could try just civil contempt fines but good luck against people like the literal richest man in the world",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "penguished",
                                    "body": "Well it's the court's duty to actually function and not be a fake kangaroo court for the wealthy or privileged... I mean if Trump tries to pardon someone immediately after commanding an illegal action, the Supreme Court has to shut that down. If they don't then yeah the country has chosen to abandon the responsibilities that make democracy work.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "ACorania",
                                            "body": "You're cute, I hope you never lose that giddy optimism.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "penguished",
                                                    "body": "Oh I'm not optimistic about people, it's a conservative stacked Supreme Court. However if they lean too hard into Trump's whimsical desire to be a dictator, they're basically choosing a collapse... not a stable future for America.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "ACorania",
                                                            "body": "I agree, that is what they will do. They'll deny some stuff and let others through to make it look like they still have some power... But they don't, Congress and the judiciary gave away their power.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "cyberentomology",
                    "body": "But we’re getting to the point where the courts have rule enough that any of orders could reasonably be presumed illegal and those charged with implementing them would wait until they can get clarity from the courts.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ACorania",
                            "body": "And... Pardoned. Scouts already ruled he has no check on presidential power including pardons.",
                            "score": -2,
                            "replies": [
                                {
                                    "author": "cyberentomology",
                                    "body": "Ok, now you’re trying to make Trump look coherent. Wanna try that again?",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "ACorania",
                                            "body": "Trump doesn't give two fucks. He wants to golf and look powerful. But he will do what the people around him tell him, like sign whatever pardon paper they shove in front of his face as long as they make him look important at his desk doing it (that is why he seems so surprised by everything being put in front of him when he does those televised signings.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "iamatribesman",
            "body": "The Rule of Law holds .... barely.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Soggy-Design-3898",
            "body": "I'm honestly really surprised. I thought donny had a lock on the courts, guess not. Good news, just surprising",
            "score": 5,
            "replies": []
        },
        {
            "author": "DwinkBexon",
            "body": "This is the sort of thing that people were screaming had no chance of going against Trump and gives me hope that they'll continue to reign him in.\n\nI've been saying the SCOTUS generally does not put up with a lot of Trump's bullshit and I hope that trend continues. But I really don't like that this was only 5-4. I'd feel better about 6-3 or even 7-2. (Alito and Thomas are lost causes, unfortunately.)",
            "score": 3,
            "replies": []
        },
        {
            "author": "WeirdcoolWilson",
            "body": "Yay. Now made him abide by the ruling",
            "score": 1,
            "replies": []
        },
        {
            "author": "_curiousgeorgia",
            "body": "On occasion, Roberts and the rest of the SCOTUS conservative majority will make a meager attempt to not look like the activist partisan hacks they are. So every once in a while, you’ll have a one-off decision on some low-stakes issue where ACB, Kavanaugh, or Gorsuch will break the party line. It’s just a marketing strategy. \n\nRoberts is still under the delusion that he can save his court from being excoriated in the history books… *provided we have history books in the future* and not just state-sanctioned propaganda.",
            "score": 8,
            "replies": []
        },
        {
            "author": "tkrr",
            "body": "It took them a week to decide this?",
            "score": 6,
            "replies": [
                {
                    "author": "checkpoint_hero",
                    "body": "The speed of the case being escalated to this court and the speed of their decision were both exceedingly fast by their typical standards.",
                    "score": 27,
                    "replies": []
                }
            ]
        },
        {
            "author": "Prudent-Blueberry660",
            "body": "He's still going to ignore the court...",
            "score": 4,
            "replies": []
        },
        {
            "author": "aMoose_Bit_My_Sister",
            "body": "good.\n\nit's in our interest to have friends around the world.  foreign aid is the easiest way to do that.",
            "score": 4,
            "replies": []
        },
        {
            "author": "iamhereforthefood",
            "body": "Dayum! Did not expect that! MAGA! But the good kind of greatness ",
            "score": 2,
            "replies": []
        },
        {
            "author": "Buddhamom81",
            "body": "Meanwhile, to distract us with that ridiculous speech, some news of relief.",
            "score": 2,
            "replies": []
        },
        {
            "author": "metalsnake27",
            "body": "Supreme court and federal judges actually rejecting Trump proposals??\n\nWtf???",
            "score": 2,
            "replies": []
        },
        {
            "author": "ZiKyooc",
            "body": "They anticipated this decision and simply terminated most of the about 5,800 contracts they had, including most of those which had waiver to continue.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Snickerdoodle321",
            "body": "Actually, I believe contempt of court can not be pardoned.",
            "score": 2,
            "replies": []
        },
        {
            "author": "CapnDunsel",
            "body": "I guess they can occasionally pretend that they are not bought and sold",
            "score": 1,
            "replies": []
        },
        {
            "author": "USAculer2000",
            "body": "Those 4 will say whatever Trump tells them to.  Imagine the Constitution’s survival hinging on Roberts and Coney-Barrett.  I don’t like its chances…",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fulkcrow",
            "body": "Am I the only one who sees this going right back to USSC in a month?\n\nIt just seems like the lower court judge needs to be more specific, and then the Trump administration can defend that action to cancel more specifically. It also appears geared towards green lighting payments for serviced already rendered and not for ones that have not had an activity hit the books.\n\n\n\n“The unsigned order does not actually require the Trump administration to immediately make up to $2 billion in foreign aid payments; it merely clears the way for the district court to compel those payments, presumably if it is more specific about the contracts that have to be honored,” Vladeck said. “The fact that four justices nevertheless dissented – vigorously – from such a decision is a sign that the Court is going to be divided, perhaps along these exact lines, in many of the more impactful Trump-related cases that are already on their way.”",
            "score": 1,
            "replies": []
        },
        {
            "author": "Discgolferwalken",
            "body": "Its pretty clear there are meant to be a separation of powers.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RaphaTlr",
            "body": "Can we freeze foreign aid to “Israel” though or nah?",
            "score": 0,
            "replies": [
                {
                    "author": "ShakeWeightMyDick",
                    "body": "Are you kidding? Trump *loves* what Israel is doing. Loves it.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "getupgetgoing",
            "body": "These billions refer to services already rendered. Moving on, all future endeavours can be cancelled and nothing further must be paid.",
            "score": -3,
            "replies": []
        },
        {
            "author": "julesnocash",
            "body": "In future rulings, who do they choose to briand threaten scotus family members?? That’s why all the 6ers were released…that’s his personal military..",
            "score": 0,
            "replies": []
        },
        {
            "author": "ronpaulclone",
            "body": "Somehow it’s constitutional to send billions of dollars to a foreign nation? What",
            "score": 1,
            "replies": [
                {
                    "author": "Josh_in_Shanghai",
                    "body": "Congress controls spending. Constitution only takes about 30 minutes to read. Go for it..",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ronpaulclone",
                            "body": "It’s insane that it is constitutional to send American money overseas. Whether or not congress or the president or Santa Claus controls the purse.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Josh_in_Shanghai",
                                    "body": "The constitution is a frame work for our system. Talking about the constitution without knowing anything about the document seems insane. Take 30 minutes and come back.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ronpaulclone",
                                            "body": "Oh thanks for the info. Now that you’ve given me the 2nd grade answer, I’m enlightened and think it’s constitutional to steal trillions of dollars from the American people and send it to other countries. The 16th amendment was the best thing that ever happened!",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Josh_in_Shanghai",
                                                    "body": "Funny that you think the word “constitutional” and “legal” are interchangeable. Maybe if you completed the 2nd grade, you’d be able to have a normal conversation.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "ronpaulclone",
                                                            "body": "I dropped out in kindergarten.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "havingfoibles",
            "body": "came here for the misinformation and wasn't disappointed... this is for completed work only.. as it should be. All the other shit is still frozen/cancelled",
            "score": -10,
            "replies": [
                {
                    "author": "ERedfieldh",
                    "body": "what misinformation?  Trump tried to freeze money for services rendered.  Court said you can't do that.  Where the fuck are you getting anything additional?  Jesus christ, take his dick out of your mouth for a few seconds and get some air.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "BM09",
            "body": "Woah... didn't see that one coming.\n\nYou'd think the majority of SCOTUS would approve anything Trump wanted to do....",
            "score": -1,
            "replies": [
                {
                    "author": "ryhenning",
                    "body": "Okay and why? There’s been plenty of instances with this Supreme Court where conservative judges ruled in liberal favor. But that doesn’t fit the narrative so it never makes news",
                    "score": 0,
                    "replies": [
                        {
                            "author": "BM09",
                            "body": "It definitely made news here",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Awkward-Event-9452",
            "body": "Looks like the waste will continue while Americans die and starve. Enjoy the continued inflation.",
            "score": -14,
            "replies": [
                {
                    "author": "ShakeWeightMyDick",
                    "body": "He’s trying to not pay people who’ve already done the work and are expecting to get paid for it.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "JayPlenty24",
                    "body": "If you don't want to starve hold your president accountable for tanking your economy in less than 2 months.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Awkward-Event-9452",
                            "body": "Nobody is accountable to anything. And the only way to get one thing done is to harm ourselves in some other way. Want universal healthcare, but actually want to crack down on the border? Fuck off, you get an open border, or no healthcare. Tired of it TBH. Also tired of everything we do for the world is asymmetrical in our generosity where they then hate us. Fuckem, let them fight thier wars and spend money on thier own defense.",
                            "score": -3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "rune_74",
            "body": "Yeah I'm sure he cares.\n\n  \nNo power. This is insane.",
            "score": -2,
            "replies": []
        },
        {
            "author": "bkcarp00",
            "body": "Yeah but they have no actual power to make him do so. Pretty obvious they think they can simply ignore the court system since there is no punishment for continuing to ignore orders.",
            "score": -10,
            "replies": [
                {
                    "author": "cyberentomology",
                    "body": "Wait until they hear about the second amendment.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "westexmanny",
            "body": "Amazing how fast the courts work when the subject is blowing tax dollars and paying off friends in poor countries.",
            "score": -9,
            "replies": [
                {
                    "author": "ShakeWeightMyDick",
                    "body": "He’s trying to not pay people who’ve already done the work and are expecting to get paid for it.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Attabomb",
            "body": "Billions that'll have to be saved elsewhere, then. Now you'll lose something that actually matters to you, while funding nonsense half a globe away.",
            "score": -16,
            "replies": [
                {
                    "author": "ERedfieldh",
                    "body": "This isn't money we're giving away.  They provided a service.  This is money we actually owe them.\n\nOr are you the kind of asshole who dines and dashes?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Attabomb",
                            "body": "If I was force-fed a meal I not only never asked for, but adamantly refused, then yeah. In fact, I'll stroll out, and vomit down the maitre d's shirt before I shatter the window next to the door and use it as my exit.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}