{
    "title": "“The Big Guy” got the nickname for a reason",
    "author": "ENVYisEVIL",
    "subreddit": "Libertarian",
    "rank": 497,
    "score": 366,
    "upvote_ratio": 0.77,
    "num_comments (reported by reddit)": 76,
    "url": "https://i.redd.it/ngqb04n9g6he1.jpeg",
    "id": "1ihsjt1",
    "selftext": "",
    "comments": [
        {
            "author": "cTron3030",
            "body": "https://www.gao.gov/blog/federal-government-made-236-billion-improper-payments-last-fiscal-year\n\n> Payment errors are a long-standing issue for the federal government. Over the last 20 fiscal years, it has made an estimated $2.7 trillion in such improper payments. \n\n…jesus, 2.7 trillion",
            "score": 108,
            "replies": [
                {
                    "author": "ialf",
                    "body": "Great article. Shows the payment errors for the last 20- years.  \nFrom 2023, the pandemic unemployment was 43.6b, and the payment protection program was 18.7b - a total of 62.3b related to the pandemic. Subtract this from the 236b total from 2023, which gets us 173.7b. This puts us close to the payment errors from 2019.  \nThis still isn't good, but overall, a lot is still related to the pandemic.",
                    "score": 35,
                    "replies": [
                        {
                            "author": "Whiskey_Jack",
                            "body": "Oh dont worry, the GAO is im sure on the chopping block with the inspector generals.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Yo101jimus",
                    "body": "What’s interesting is the hoops I’ve seen made to get a girl a non powered wheelchair that’s 100% disabled and parents were in poverty levels. But I’m sure this was so the fat people get wheelchairs powered when they should walk.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "CapnHairgel",
                    "body": "With a T. beyond comprehension why people are okay with this",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Judg3Smails",
                    "body": "But but but aCcEsS!!!1!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "indyjones8",
            "body": "$100 billion here, $200 billion there... Pretty soon you're talking about real money.",
            "score": 39,
            "replies": [
                {
                    "author": "legitSTINKYPINKY",
                    "body": "I keep hearing people say “that’s only 1% of our budget!”\n\nWell if we do this 99 more times we’re cooking.😂",
                    "score": 17,
                    "replies": [
                        {
                            "author": "CapnHairgel",
                            "body": "1% of our budget is meaningless when it's more money than any of us could conceive. When its orders of magnitude more money than any of us will ever see in their entire lifetimes.",
                            "score": 5,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Uncle_Paul_Hargis",
            "body": "I remember that one year when I accidentally spent $236 Billion too much.  Crazy how that can happen.",
            "score": 48,
            "replies": [
                {
                    "author": "wpyoga",
                    "body": "Did you spend your own money at least? /s",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "returnofthewait",
            "body": "Prove it Mr. Musk. Show us what they were.",
            "score": 113,
            "replies": [
                {
                    "author": "Failed_Redemption",
                    "body": "This is news from last year...before the election: https://www.crfb.org/blogs/improper-payments-cost-government-billions\n\nSix federal program areas are responsible for 85 percent of the $236 billion in improper payments including Medicare, Medicaid, Unemployment Insurance, Paycheck Protection Program, Earned Income Tax Credit, and Supplemental Security Income.\n\nGAO has recommended that Congress take actions to enhance oversight and accountability of federal agencies such as new reporting, fraud analytics, data sharing, and improved internal control plans.",
                    "score": 34,
                    "replies": [
                        {
                            "author": "Gratedfumes",
                            "body": "Just for scaling purposes, if everyone that receives Social Security were over paid by $100 over the period of a year it would be ~$716 million.",
                            "score": 13,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "dinosaursandsluts",
                    "body": "It's in a Government Accountability Office report. Says so right there in the pic.",
                    "score": 36,
                    "replies": []
                },
                {
                    "author": "beardedbaby2",
                    "body": "So this says the GAO.  Musk is likely to reveal a lot more through DOGE.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "HAIKU_4_YOUR_GW_PICS",
                            "body": "If im reading correctly, he’s saying they could balance the budget by cutting out a trillion in waste and fraud they’ve claimed to have uncovered and the GAO came back with “nuh uh, it’s *only* $200B+ in fraud!”",
                            "score": 32,
                            "replies": [
                                {
                                    "author": "naql99",
                                    "body": "Come on, it's only 236 *billion*.",
                                    "score": 19,
                                    "replies": []
                                },
                                {
                                    "author": "beardedbaby2",
                                    "body": "Yeah, just a little fraud is acceptable, lol.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "ListerineInMyPeehole",
                                            "body": "Casual $200b like the value of an entire salesforce",
                                            "score": 10,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Euronomus",
                            "body": "You mean the unconstitutional power grab? The only thing that is exposing is the current administrations contempt for democracy.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "beardedbaby2",
                                    "body": "Is it unconstitutional?  The president appointed new employees to some agencies and formed a new audit board to audit the agencies.  Unprecedented and unusual? Yes. Unconstitutional?  Idk, guess we'll see.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Euronomus",
                                            "body": "Yes, it is unquestionably unconstitutional to ignore the law as passed by congress and signed by the president - this is doubly so when it comes to spending. The constitution robustly places the power of the purse into congress' hands. Musk(or even Trump) doesn't get to just shut down whole departments, withhold funds, or remove inspectors general - that is all law as passed by congress. We are unquestionably in a constitutional crisis right now - Trump and Musk are wiping their asses with the constitution.",
                                            "score": 16,
                                            "replies": [
                                                {
                                                    "author": "beardedbaby2",
                                                    "body": "Ok, so the issue isn't the new employees, or the new audit board.  The issue is freezing the funds, and terminating employees?",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "Euronomus",
                                                            "body": "First of all It's not an \"audit board\" - that would imply that it's looking to make sure the law is being followed without waste - that's not the case. What they are doing is saying \"we don't think this is a good use of money so we're not going to spend it \", or\"we think this department is unnecessary, so close it down\" ignoring that they are laws passed by congress. And the inspectors general I am taking about aren't \"employees\" being \"fired\", they are presidential appointees confirmed by congress being removed from their posts forcibly, literally kicking and screaming in one case.",
                                                            "score": 11,
                                                            "replies": [
                                                                {
                                                                    "author": "beardedbaby2",
                                                                    "body": "It is an audit board. Tasked with finding and ending government waste by the president.  USAID was created through an EO, so I'm thinking it can be ended in the same way if that's what is to happen.  \n\nIf a president appoints them, why can a president not relieve them?\n\nI'm not thrilled with everything that is happening because I feel it lacks transparency.  However no one has yet explained in what way what is going on is illegal or unconstitutional.  I'm willing to listen.",
                                                                    "score": -3,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Euronomus",
                                                                            "body": "I have explained it clearly, Trump(via Musk) cannot refuse to spend money congress has approved - that is explicitly unconstitutional, period, full stop. Furthermore while USAID was initially created by EO to centralize payments made by dozens of agencies - it was made statutory  by act of congress in 1998 - Trump has no power to dissolve it. And while Trump does technically have the right to remove inspectors general, he has to give a months notice and justification for the firing to congress, he did no such thing.",
                                                                            "score": 17,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "beardedbaby2",
                                                                                    "body": ">that is explicitly unconstitutional, period, full stop.\n\nBecause it is outside the powers of the executive branch.  Yes?  This is what you are saying?\n\n>he has to give a months notice and justification for the firing to congress,\n\nSo a president hires but can not terminate without approved cause?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "Euronomus",
                                                                                            "body": "Yes, that is exactly right, per the constitution the power of the purse is strictly the preview of congress - the president has no power to overrule them on such matters- Furthermore it is the constitutional responsibility of the president to faithfully execute the laws enacted by congress in the way they are written. Finally the president has to get congressional approval on both ends - both hiring and firing.",
                                                                                            "score": 3,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "mhanington86",
                                                                                                    "body": "Yes, this is to ensure that there is separation of powers, as was demonstrated to be of the utmost importance by the founders. The issue I have is that DOGE is removing the people that find the fraudulent spending, including the Inspector Generals....leaving a void for someone with access to the Treasury Department. Power corrupts and absolute power corrupts absolutely.",
                                                                                                    "score": 2,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "PHEN0METOM",
                                                                            "body": "Foreign assistance act was passed by congress in 1961.*",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "beardedbaby2",
                                                                                    "body": "Has Trump said they are definitively ending USAID?  Has Trump said he is ending all approved funding?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "PHEN0METOM",
                                                                                            "body": "He can’t stop the funding. It’s through congressional act. But USAID employees have received notice that they are on “federal admin leave.” Basically they’re all being paid to do nothing while it gets sorted out in court.",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "natermer",
            "body": "I don't think people quite comprehend the numbers being thrown around here.\n\n236 billion dollars is a lot of money. \n\nIf I had 238 billion dollars sitting in a savings account at 1.5% interest...  I would be earning over 9,698,000 dollars _PER DAY_. \n\nI literally couldn't spend the money fast enough to break even. \n\nAnd that actually would be me LOSING money.  Since it is well below inflation. \n\n\nThe entire GDP of Greece is 218 billion.  The entire economy of New Zealand is only worth about 245 billion per year.  There are only a handful of countries that make over 100 billion GDP. \n\nIn 2021 the entire military budget of Russia was 68 billion dollars.  Meaning that the USA could buy the entire military of Russia 3 times over with just the money it managed to \"improperly pay\".\n\nIn China this would be a capital crime.  They would drag out these leaders in the street and publicly execute them for their incompetence.  It would be mandatory watching on every TV screen in the country. \n\nBut in the USA it is  just a \"Oopsie, Tee-Hee silly me\".   It doesn't even make the news. \n\nThis is normal in this country.  The mind boggles.",
            "score": 46,
            "replies": [
                {
                    "author": "ea9ea",
                    "body": "We should be be protesting. The media is controlled by a few. Everyone is taught that if you're unhappy with government then vote. What a joke.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "natermer",
                    "body": "If you ever wondered why we don't have flying cars... this is the sort of crap that we spend our money on instead.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "laxintx",
            "body": "Government misuses your tax dollars, more at 11.",
            "score": 8,
            "replies": []
        },
        {
            "author": "sirwinston_",
            "body": "Now you know why the deep state started losing their shit over Musk getting his hands on that information.",
            "score": 6,
            "replies": []
        },
        {
            "author": "wup_dizzle",
            "body": "No wonder he pardoned his entire family",
            "score": 35,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 15,
                    "replies": [
                        {
                            "author": "RobertNevill",
                            "body": "The ones he could remember",
                            "score": 12,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Son_of_Sophroniscus",
            "body": "And that's just one year",
            "score": 5,
            "replies": []
        },
        {
            "author": "LicenciadoPena",
            "body": "I'm an Argentinian, this stuff doesn't surprise me anymore. Our leftist administrations did this for decades. There even was a driver who wrote the fraudulent payments down on a series of notebooks he kept.",
            "score": 2,
            "replies": []
        },
        {
            "author": "LogicalConstant",
            "body": "\"Taxes are the fee you pay to live in society\" /s",
            "score": 2,
            "replies": []
        },
        {
            "author": "Susbirder",
            "body": "Yeah, but teh tAkEoVeR! How dare anyone look into our shenanigans!  /s",
            "score": 2,
            "replies": []
        },
        {
            "author": "Hot_Egg5840",
            "body": "New York Times? Anti Biden Piece? Can't be true.",
            "score": 8,
            "replies": [
                {
                    "author": "natermer",
                    "body": "They are attacking Musk. That is the funny part.  Saying Biden only managed to lose 238 billion is a DEFENSE of Biden. \n\nThey are saying (paraphrasing):  \"The government only  admitted to accidentally blowing 236 billion dollars. Where does he think he is going to get 1.8 trillion from?\"\n\nThis sort of shit is why people hate the media and hate people who defend the administrative for their egregious crimes against humanity and the American people.   They are so far detached from reality it isn't even funny.  It doesn't occur to them that this is a ridiculous level of incompetence.",
                    "score": 23,
                    "replies": [
                        {
                            "author": "jcutta",
                            "body": "I mean when you're talking about numbers of this level it is a legitimate thing to say.\n\nIf someone sued me for $1800 and I was like \"well I'll admit that I owe this person $236 but they have to prove that there is still an additional $1564 dollars owed because they are currently providing no actual proof it's owed\" it's essentially the same thing.",
                            "score": 7,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "StoppableHulk",
            "body": "This is a random claim made by Elon Musk.\n\nLike this is the guy who bought Twitter to dump chat logs. If that's true, then simply provide records.",
            "score": 3,
            "replies": [
                {
                    "author": "Witty-Management6014",
                    "body": "Lol, this is the GAO.",
                    "score": 22,
                    "replies": []
                },
                {
                    "author": "NewPerfection",
                    "body": "Musk controls the GAO?",
                    "score": 16,
                    "replies": []
                }
            ]
        },
        {
            "author": "Full_Metal_Paladin",
            "body": "Funny how these mistakes never UNDERpay anyone. Imagine accidentally saving taxpayers a few bucks",
            "score": 2,
            "replies": []
        },
        {
            "author": "lmaomitch",
            "body": "Why would anyone trust Musk's word on anything? He will say whatever he deems necessary to consolidate power.",
            "score": -2,
            "replies": [
                {
                    "author": "Witty-Management6014",
                    "body": "It's not musk, it's the GAO.",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "texabrolives",
                    "body": "They’re defending Biden with this article though?",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "Witty-Management6014",
                    "body": "It's not musk, it's the GAO.",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "Alantennisplayer",
            "body": "A better nickname for him  is tungsten",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok_Sea_6214",
            "body": "Because he likes to fondle children.",
            "score": 1,
            "replies": []
        },
        {
            "author": "KaChing801",
            "body": "$235 Billion of that was paid directly to two men named Ben and Jerry. Investigation pending.",
            "score": 1,
            "replies": []
        },
        {
            "author": "wpyoga",
            "body": "So... same shit, different parties?",
            "score": 1,
            "replies": [
                {
                    "author": "natermer",
                    "body": "The problem isn't the people in charge of the system.\n\nThe problem is the system. The fact that it exists at all is the problem.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "monet108",
            "body": "God Damn we are going to learn a lot of shit in the next four years. We will learn why Biden pardoned over 8,000 criminals. Trump has ended whole departments that will seriously cripple the current way our government prefroms regime changes. Remove Security clearance for a bunch of retired so and so's. That ended any potential security concerns from that camp. and their ability to make clandestine deals that serve the Deep State. If Trump could be convinced to stop supporting the Terrorist state of Israel that would be a wonderful. If this is all he does has brought into the light how our CIA operates and penetrates a country...any move the limits the power of the Deep State to keep making endless banker wars to serve the Ruling class is a great step in the right direction.",
            "score": -1,
            "replies": []
        }
    ]
}