{
    "title": "Should Marriage be regulated by the Government",
    "author": "Tandy_Raney3223",
    "subreddit": "Libertarian",
    "rank": 486,
    "score": 68,
    "upvote_ratio": 0.79,
    "num_comments (reported by reddit)": 117,
    "url": "https://www.reddit.com/r/Libertarian/comments/1iigqsj/should_marriage_be_regulated_by_the_government/",
    "id": "1iigqsj",
    "selftext": "What’s the Libertarian stance on marriage? For me I think that’s something between two people and your chosen higher power. Why should I have to go ask the government (marriage license) to be able to call this person my wife. ",
    "comments": [
        {
            "author": "IndyPacers",
            "body": "\"The government doesn't need to regulate that\" is usually considered Libertarian 101",
            "score": 207,
            "replies": [
                {
                    "author": "MannieOKelly",
                    "body": "Well, governments more or less HAVE to be in the business of at least recognizing what constitutes a  marriage for a variety of tax, divorce, inheritance and other legal determinations.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "JackFromTexas74",
                            "body": "But why? \n\nLet everyone designate a legal next of kin and call it a day. \n\nThe nature of the relationship isn’t the government’s damn business",
                            "score": 15,
                            "replies": []
                        },
                        {
                            "author": "warm_melody",
                            "body": "Libertarians also believe that government has no business taxing our actions.",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "BentGadget",
                            "body": "The legal definition of marriage simplifies the handling of all those things, but most could be spelled out in some other sort of legal instrument. It would just be more complicated.\n\nTaxes, though, are different, in that they convey benefits to married taxpayers by virtue of the marriage itself. An equivalent contact wouldn't be the same.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Swimming__Birb",
                    "body": "Yeah, I don't even know why this was even a question.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "HeatherAnne1975",
            "body": "Not at all. In fact, I think that the whole debate about gay marriage is completely avoidable. The government should be in the business of approving civil unions. For straight people, gay people, whoever. Period. Marriage is a very personal thing, for some people it’s a religious sacrament. The government should not be involved in anyone’s personal business.",
            "score": 90,
            "replies": [
                {
                    "author": "Sad_Thought_3001",
                    "body": "Finally!  I have been saying this for years.  It puts everyone on a level playing field and everyone gets equal protection under the law while at the same time safeguarding a religious or other institution’s right to freely associate and do business with who they choose.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "November_Grit",
                    "body": "Why should the government be in \"the business\" of approving personal unions at all?",
                    "score": 19,
                    "replies": [
                        {
                            "author": "bongobutt",
                            "body": "Property law, inheritance, and estates. The law needs to handle next-of-kin and stuff like that, but there are better ways of handling that that don't require making the government the arbiter of literally everything.",
                            "score": 39,
                            "replies": [
                                {
                                    "author": "mptpro",
                                    "body": "Yes, use legal contracts such as Living Trusts.  The only gray area I see is not being able to compel a spouse to testify in court against one's spouse.",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "bongobutt",
                                            "body": "Almost as if the common-law systems we inherited that voluntarily evolved were better than the centrally-mandated ones. 😎",
                                            "score": 10,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "zugi",
                            "body": "\"approving\" -> \"registering\", to basically change a bunch of default settings for inheritance, property ownership, child custody, and taxes, all at once.\n\n\nI basically agree with you that government should not be in the business of approving or disapproving of marriages.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "madsjchic",
                            "body": "People get entangled when they are romantically entangled to a serious degree. We do need some ground rules for break ups when no one is amicable. But it really should be more akin to contract law than anything else. Couples should be made to agree ahead of time how they want to split and any damages in case of breach of the union. This is assuming they want contractual protections for their relationship, which is reasonable for inheritance, medical, children, etc, that aren’t normally contracted around or intrinsically and inextricably emotional and subjective topics.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "X2946",
                                    "body": "You want people to have a 5 year plan?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "madsjchic",
                                            "body": "I think people should have agreed guiding principles to cut down on litigation costs. It’s basic contract law. Family law is already the most fraught area of law.\n\nAnd this is in the context of wanting protections from the state. It’s a fact of life that some people are not capable of adequately protecting themselves or getting trapped in an abusive situation. Again, the difference is how the state will enforce your deal. No civil union? That’s like a handshake deal, and good luck on making the other person behave when things go south. I wouldn’t sell my car without a contract, so I’m not making life choices without something similar.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "okie1978",
                            "body": "I can only think of two reasons, but neither of which would require fee or license: age, disease. I could see Ben back off those two perhaps.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Exciting_Vast7739",
            "body": "![gif](giphy|3o7TKwmnDgQb5jemjK)",
            "score": 28,
            "replies": []
        },
        {
            "author": "jankdangus",
            "body": "No, I support gay marriage. I also support legalizing polygamous marriages if it’s consensual with all parties. Personally, I’m a traditionalist, but it’s none of my business what other people love life are.",
            "score": 26,
            "replies": [
                {
                    "author": "okie1978",
                    "body": "The cool thing about deregulating marriage is that we could be in the opposite sides of gay marriage and have no reason to argue.",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "IndependentTea678",
            "body": "Marriage should be deregulated. Just like every other government permit, we should not have to ask the government for permission.",
            "score": 45,
            "replies": []
        },
        {
            "author": "Gigaorc420",
            "body": "no except for child marriages. Ban that shit no mercy for pedos. Aside from that, not the governments business.",
            "score": 21,
            "replies": [
                {
                    "author": "None",
                    "body": "Well, child marriages aren't marriages, they're child sexual trafficking. No point in putting them anywhere near marriages.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "TheLoneCanoe",
                    "body": "This.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ConfusedScr3aming",
            "body": "no",
            "score": 11,
            "replies": []
        },
        {
            "author": "Bagain",
            "body": "Who does or doesn’t shouldn’t be up to which ever politician is in power. Not their business",
            "score": 11,
            "replies": []
        },
        {
            "author": "Awkward_Ambition1143",
            "body": "No government interference needed for this, or for almost anything tbh.",
            "score": 20,
            "replies": []
        },
        {
            "author": "Billy_Bob_Thompson",
            "body": "The Government should have no say and no knowledge of what you do in your personal life including your marriage, that’s my stance",
            "score": 9,
            "replies": []
        },
        {
            "author": "Potential-Chicken-33",
            "body": "No",
            "score": 8,
            "replies": []
        },
        {
            "author": "dillhavarti",
            "body": "no. having their hands in marriage is just another way for them to take a few extra hundred dollars out of our pockets for something that is none of their business.",
            "score": 7,
            "replies": []
        },
        {
            "author": "PomeloPepper",
            "body": "Marriage is a civil contract between two people.\n\n It confers next of kin status, regulates property ownership and division, inheritance and access to benefits like disability, health insurance etc. from employers, and SSI benefits from the government. Also the presumption of parenthood for children born in the marriage. \n\nI think that any benefits your spouse accrues from your employer or the government are fair game for a limiting definition. \n\nApart from that, there really aren't that many people who care. Just a loud minority of the religious.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Greatlarrybird33",
            "body": "Marriage is a contract to joint two people's assets.\n\nGovernment should be in charge of enforcement of those contracts, but should not be in charge of deciding who gets to enter them.",
            "score": 8,
            "replies": [
                {
                    "author": "CriscoWithLime",
                    "body": "Eh...I feel it needs to be registered.  My thoughts go towards someone who enters into multiple contracts without being truthful with all of the people they have married.  In the case of wills, the most recent supersedes the prior.  Will this be the same?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "berkough",
                            "body": "Depends on the language in the contract that you agree to...",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "NeoWayland",
            "body": "According to the Tenth Amendment, the Federal government has no power over marriage.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Cowboy426",
            "body": "Marriage is protected by the first amendment. The only reason the government is involved is bc taxes. Marriage has been a ritualistic ceremony since before Christianity. It's always been religious",
            "score": 3,
            "replies": []
        },
        {
            "author": "CBL44",
            "body": "IMO, this is a theoretical vs. practical question.\n\nWhen I got married, I immediately had a lot of rights/responsibilities (health, inheritance, financial, etc.) with my spouse. In theory, we could have made contracts to enumerate these rights but I know we would not have done that in a timely manner. I am glad that the goverment sactioned default rights/responsibilities exist.",
            "score": 7,
            "replies": []
        },
        {
            "author": "obsquire",
            "body": "\"The Libertarian stance\" is exactly not how libertarianism works.  We don't enforce ideological unity.",
            "score": 11,
            "replies": [
                {
                    "author": "M-y-P",
                    "body": "But there is a Libertarian stance on many things. That's how you can define things as Libertarian or not.\n\nNot having the government regulate something as marriage is a very Libertarian stance on the regulation of marriage.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "obsquire",
                            "body": "Definite and indefinite articles are not the same: \"a stance\" v. \"the stance\".",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DowntownVisit77",
            "body": "Well I think that for statistics purposes, legal purposes , there should be some formal registration of marriages with government to give some structure . However the government should not DECIDE who should marry whom. The government shouldn’t say “I want only men to marry women or the sort. It should be that if two consenting adults want to formally register their union with government it should be allowed . That is my opinion",
            "score": 3,
            "replies": []
        },
        {
            "author": "madriverdog",
            "body": "Its all \"de-regulate marriage\" until there are large sums of money/property to be divided in a divorce. Then one partner cries to the government to solve the issue. Then its \"there should be laws\".",
            "score": 3,
            "replies": []
        },
        {
            "author": "BEGA500",
            "body": "People should be able to enter into contracts together without interference. Marriage would fall under that. We don’t need standardized marital laws.",
            "score": 3,
            "replies": []
        },
        {
            "author": "bongobutt",
            "body": "The only reason why the government should be in the business of deciding who can get married and who can't is to prevent people from getting married. If we don't want prohibition of interracial marriage or other kinds of marriage prohibition, then marriage licenses shouldn't be a thing anymore. But there still needs to be a legal process for recognizing the issues surrounding a marriage. Suppose a guy dies, and his ex girlfriend claims a right to his house (claiming that they were \"married\"), even though the guy has both a new girlfriend and a legal family? Who gets the house? Is it the girlfriend, the siblings, or the ex? These are real problems that need solved, but I don't think that it is automatically valid to just say, \"you have to register with the government so that it is easier for us to know if a marriage is 'real' or just being claimed by someone for convenience.\" That is the easy solution, but that doesn't mean that it is always the right one.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Cannoli72",
            "body": "Anyone who says yes is not a libertarian. The right to contract is a fundamental right",
            "score": 3,
            "replies": []
        },
        {
            "author": "bongobutt",
            "body": "I'm all for voluntary institutions. If marriage is a thing people want to do, let them do it. But they shouldn't interfere with my thing, and I shouldn't interfere with their thing. When the government steps in and decides to be the referee, it might work... For a time. But as soon as the government starts enforcing *their* thing on *my* thing, I have a problem. People have lost appreciation for the fact that law doesn't have to a process of fiat. The best laws happen by evolution, voluntary interactions, case law, precedent, tradition, etc. They are built over time, and people voluntarily rely on and accept what rises to the top. Voluntarism is the basis for good law, not fiat.",
            "score": 3,
            "replies": []
        },
        {
            "author": "zugi",
            "body": "No!! Marriage licenses are offensive - why the heck should one need advance government permission to get married?\n\n\nI can see perhaps optionally registering a marriage with the government afterwards, just as \"one stop shopping\" to set up joint property ownership, inheritance, child custody, and tax benefits.",
            "score": 3,
            "replies": []
        },
        {
            "author": "jthomas287",
            "body": "There are two types of marriage. The kind of the goverment does and the kind your religion does. \n\nThe goverment doesn't need to involved in either. \n\nAt this point, it's just a tax thing.",
            "score": 3,
            "replies": [
                {
                    "author": "Tandy_Raney3223",
                    "body": "So kinda like a drivers license or car tags. If they were about safety, there would be a better checks and balances to cover safety. Some states do require safety inspections but for the most part it’s just another tax thing. The checks aren’t about safety they just run through and make sure you won’t kill anyone. Pay your money and your free do drive your car another year.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Gabbz737",
                            "body": "Emissions tests are a fucking joker. They're not saving anyone. They're just making money off the dummy-light.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "cb4u2015",
            "body": "Anyone who says yes to “Should X be regulated by the Government” should remove themselves from this community. You’re missing the point.",
            "score": 3,
            "replies": [
                {
                    "author": "Gabbz737",
                    "body": "Yeah, the only thing the government should do is prevent people from breaking obvious laws such as murder/rape/etc. Just a fine line preventing anarchy.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "igortsen",
            "body": "It's just between my wife and I. There is no \"higher power\" there are just two people doing their best for each other and for our family.\n\nThe government and the church can both fuck off.",
            "score": 3,
            "replies": []
        },
        {
            "author": "CaptainRaba",
            "body": "Unless you’re trying to marry a minor, no.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Intelligent-End7336",
            "body": ">Why should I have to go ask the government (marriage license) to be able to call this person my wife. \n\nYou're not asking for permission.  You're asking for recognition in order to receive legal benefits.  Marriage is more than just living together.  It's a contract joining two different parties properties together.  \n\nDepending on whether you're advocating for small government libertarianism or no government libertarianism, will decide whether  you will use marriage certificates as they are part of contract law.",
            "score": 4,
            "replies": []
        },
        {
            "author": "jangohutch",
            "body": "Mostly no, although child marriages should be regulated",
            "score": 6,
            "replies": []
        },
        {
            "author": "jagjordi",
            "body": "only for minors",
            "score": 3,
            "replies": []
        },
        {
            "author": "Ya_Boi_Konzon",
            "body": "No.",
            "score": 2,
            "replies": []
        },
        {
            "author": "TarnishedAccount",
            "body": "No",
            "score": 2,
            "replies": []
        },
        {
            "author": "Banesmuffledvoice",
            "body": "No.",
            "score": 2,
            "replies": []
        },
        {
            "author": "flairfordramtics_",
            "body": "No",
            "score": 2,
            "replies": []
        },
        {
            "author": "Benedict_ARNY",
            "body": "No. Thanks for the dumb question",
            "score": 2,
            "replies": []
        },
        {
            "author": "magestik12",
            "body": "No higher power needed, of any kind. Not a government or sky daddy.",
            "score": 2,
            "replies": []
        },
        {
            "author": "daisymae25",
            "body": "The government needs to butt out.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Curious-Chard1786",
            "body": "tax breaks and adultery and single mothers thats why the laws exist, but as a libertarian headed person I would prefer if families figured it out.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Minarchist15",
            "body": "Marriage is a voluntary agreement between individuals, so the State should no involvment.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Kyosuke-D",
            "body": "Marriage is a contract. The government doesn’t need to be involved until there is a dispute of that contract.",
            "score": 2,
            "replies": []
        },
        {
            "author": "BayBreezy17",
            "body": "No. They should have a catch-all partnership contract for all adults, regardless of gender. “Marriage” is too intertwined with religious doctrine and is problematic in a secular society.",
            "score": 2,
            "replies": []
        },
        {
            "author": "OoklaTheMok1994",
            "body": "Marriage is a sacrament of the church and should be kept as such.\n\nThe government might have some role in people signing contracts that deal with assets and dependents should the partnership dissolve, but other than that, marriage should be between me, my wife, and God.",
            "score": 2,
            "replies": []
        },
        {
            "author": "NoNameGiven20",
            "body": "Short answer \"no\", long answer \"hell no\"",
            "score": 2,
            "replies": []
        },
        {
            "author": "wtfredditacct",
            "body": "Marriage is a contract between two consenting adults. Why the fuck should the government be involved?",
            "score": 2,
            "replies": []
        },
        {
            "author": "san_souci",
            "body": "Marriage is a contract.  The only role of government should be to adjudicate and enforce legal contracts as long as they are freely entered into by competent adults. \n\nYou don’t need a license to enter into other contracts, so why should marriage be any different?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Virel_360",
            "body": "The government shouldn’t have anything to do with it, and you shouldn’t be getting benefits or government tax deductions from being married.",
            "score": 2,
            "replies": []
        },
        {
            "author": "elguapojefe",
            "body": "No.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ztgarfield97",
            "body": "Marriage should remain with the churches, and the churches alone.  The government should have no say in it whatsoever.  That being said, however, a church in that scenario can refuse to perform a marriage for any reason.",
            "score": 6,
            "replies": []
        },
        {
            "author": "annonimity2",
            "body": "Ideally - government shouldn't be involved at all\n\nRealistically - government shouldn't choose who can get married (assuming both parties are consenting adults, pedos violate the NAP)",
            "score": 3,
            "replies": []
        },
        {
            "author": "starthorn",
            "body": "You're confusing religious marriage with legal marriage.  One is a relationship between two people and **potentially** a higher power (depending on beliefs).  The other is a legal contract and agreement that impacts property, taxes, children, inheritance, liability, etc.  It's a specialized legal partnership.  Some may jump in with \"that should be a civil union!\".  That's true, it should.  However, hundreds of years of existing legal language uses \"marriage\", and that's a lot of work to change (without a lot of benefit outside of reducing confusion a little when people conflate the religious and legal marriage concepts).\n\nThe former should be outside of government; the latter needs government involvement.  Ideally, the legal/contractual side should be renamed/updated in all cases to \"civil union\".",
            "score": 3,
            "replies": [
                {
                    "author": "delmecca",
                    "body": "It's really simple you promise to love someone to death you should have to take care of them to death like you said you would it not rocket since and in fact I would go as far as saying. We are two individuals entering into a contract there is already established contract law the only difference is people get they feeling hurt in relationships and want more than they are entitled to half of everything that is it and split custody of the child. You can't have your cake and eat it too.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "lovomoco64",
            "body": "Marriage is inherently religious. If it's not religious, then it's just a business contract. Under how marriage currently works in the US, if it was a business contract, it would have been laughed out of court and deemed a non-binding contract.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Bubbly-Ad-1427",
            "body": "marriage is something which is fine as long as it’s two consenting adults, they don’t need to interfere",
            "score": 2,
            "replies": []
        },
        {
            "author": "bmeezy1",
            "body": "Shouldn’t and there shouldn’t impact one’s tax status .  Government shouldn’t be in the business of marriage period, but yet big gubmint says you single people need to payyyyy!!! That’s fucked",
            "score": 2,
            "replies": []
        },
        {
            "author": "berkough",
            "body": "*This is sort of my half-baked and impulsive answer. I'm certainly open to discussing the flaws with my theory.*\n\nMarriage is a contract... I think it should be governed by the rule of law, but not licensed or mandated to be recognized or enforced by those who are not a party to the contact.\n\nWhat's the point then? Well, businesses, individuals and organizations can choose to acknowledge the contract if they so choose, and guide themselves accordingly.\n\nIf you don't like that a hospital, an insurance company, or a baker doesn't recognize your contact, take your business somewhere else that does.",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "Can people please fuck off with \"what's the libertarian stance on\" questions?! \n\nWanting to know what the \"libertarian rules\" are is very un-libertarian.",
            "score": 2,
            "replies": [
                {
                    "author": "Bagain",
                    "body": "And if you wanted a broad spectrum answer, where else could you go?",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "DR_MEPHESTO4ASSES",
            "body": "No. And Doug Stanhope said it best:\n\nhttps://youtu.be/vXpsT3e8UsM?si=Cc1dGX9r1QRJCLmH",
            "score": 1,
            "replies": []
        },
        {
            "author": "Springer0983",
            "body": "![gif](giphy|STfLOU6iRBRunMciZv)",
            "score": 1,
            "replies": []
        },
        {
            "author": "One_Yam_2055",
            "body": "In general, I'd say no. But I think couples who cohabitate AND have children under the same roof should get nice tax breaks.",
            "score": 1,
            "replies": []
        },
        {
            "author": "okie1978",
            "body": "No, I can’t find any compelling reason the government should be involved in marriage, except for age or disease. There should be no license for marriage.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SlippinYimmyMcGill",
            "body": "Why just two people? If people want to marry 2 other or three other people, why is the government involved at all?",
            "score": 1,
            "replies": [
                {
                    "author": "Butter_mah_bisqits",
                    "body": "Taxes",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "phoenixgreylee",
            "body": "Absolutely the fuck not !!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mobile_Arm",
            "body": "No",
            "score": 1,
            "replies": []
        },
        {
            "author": "cplog991",
            "body": "Nothing should be regulated by the *federal government",
            "score": 1,
            "replies": []
        },
        {
            "author": "dark4181",
            "body": "Without government who would built the relationships?",
            "score": 1,
            "replies": []
        },
        {
            "author": "ProAmericana",
            "body": "I think it makes sense on a tax level. Doesn’t make reasonable sense but it’s there. Civilly there should be no restriction.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Daftwise",
            "body": "It's regulated because there are government benefits. Remove the benefits and the regulation all at once.\n\nAnd the same for every other gov benefit/regulation.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Redduster38",
            "body": "No\n\nI see marriage more as a social contract. A civil union that for government and law confers certain legal privileges and agreements. \n\nMy personal view is as long as it is two or more Consenting Adults agrees to it. It shouldn't matter to the government. Nor others, including why theyvwant said unoin. Yes we think of love but there are legitimate other reasons. Say a platonic roommate to you, trust your life with so the two could make medical and financial decisions for each when the other is \"indisposed\".",
            "score": 1,
            "replies": []
        },
        {
            "author": "chaoking3119",
            "body": "I couldn't agree more! I can understand letting each church decide which marriages they want to recognize, but it is absolutely none of the government's business, what-so-ever. Same with gender. It's none of the government's business to decide what gender is. The government needs to stay out of it!",
            "score": 1,
            "replies": []
        },
        {
            "author": "eico3",
            "body": "No",
            "score": 1,
            "replies": []
        },
        {
            "author": "augsome",
            "body": "It depends. \n\nIf we look at it like a contract and want the government to have fair divorces (not letting one part get kicked out of the house and losing everything) then it should probably also have a hand in the creation of those marriage contracts. \n\nIf we want 0 protections surrounding divorce, 0 benefits to marriage through taxes or other means, and 0 use of any marriage in any of our laws, then and only then would it make sense for the government to have 0 say in it. \n\nimo marriages done or recognized by churches or other organizations should be governed by them, done how they want, but they shouldn’t expect any government benefits or recognition if only done within said group.\n\nThat being said, you should be able to marry who you want as long as they are a consenting adult.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RandoWebPerson",
            "body": "I think the single thing that should be regulated and stay illegal federally is adult child marriage, for obvious reasons. \n\nOther than that, I think it’s deeply tied to the idea of freedom of religion. If people ought to be free to practice any religion in the U.S. (which is what the country was founded on), it follows that they ought to be able to practice any marriage",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheLoneCanoe",
            "body": "No. Because once you no longer want to be married, government has way too much power and in some cases even says what you do with your own body is illegal.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MikesHairyMug99",
            "body": "No",
            "score": 1,
            "replies": []
        },
        {
            "author": "IHSV1855",
            "body": "No.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gabbz737",
            "body": "This is why me and my bf will not get officially married. We'll have a ceremony some day but no marriage license.",
            "score": 1,
            "replies": []
        },
        {
            "author": "katiel0429",
            "body": "Nope.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JonnyDoeDoe",
            "body": "The government should not regulate who or how many can form a household unit, but registration of should is a legal necessity of such a unit so long as the government sets differing law that is advantageous to household units of more than a single person as in tax regulation... Additionally registration of units are useful for property distribution in cases where the unit is dissolved and it is without contracts for the property distribution...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fluid_Wafer_6827",
            "body": "No it doesnt \n\nNext question ?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tacoshortage",
            "body": "I can't imagine a reason why the government would have ANYTHING to do with marriage.  It's a social contract, a religious contract and a civil contract.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lord-Dundar",
            "body": "The only reason why the government is involved is tax implications of marriage. If we get rid of taxes then no government reason to be involved.",
            "score": 1,
            "replies": []
        },
        {
            "author": "future_pirate",
            "body": "I'd say keep the government out of marriage. I don't think it's the government's job to enforce morality. Marry as many people as you want or your sister or whatever as long as it's all between consenting adults.",
            "score": 1,
            "replies": []
        },
        {
            "author": "galets",
            "body": "I am speculating here, but I think the original idea was like this:\n\n\\- Society needs children raised in order to be sustainable\n\n\\- In order to maximize number of children, it is best if people get married and stick together in committed relationship\n\n\\- therefore, marriage should be encouraged and married people should receive benefits.\n\nSince benefits are involved, government has to step in and make sure people are not abusing the system.\n\nIn our present society, raising children is hard work which benefits society, but doesn't really benefit parents that much. It is significantly easier to live life without having any children at all. So \"marriage\" no longer means child-producing union, it's more of a friendship with benefits. In other words... yeah, there shouldn't be government in marriage anymore, at least not in childless marriage.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bubbly-Ad-1427",
            "body": "as long as it’s two consenting adults no",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sithlordandsavior",
            "body": "Should it be regulated by it? No. But for the sake of paperwork, they have a vested interest in knowing the status so there's that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GGM8EZ",
            "body": "Marriage a exclusively religious act and contract",
            "score": 0,
            "replies": []
        },
        {
            "author": "MrFaceless1",
            "body": "Fuck no! Marriage is between a man and a woman and God. I don’t even understand why non religious people even get married.",
            "score": 0,
            "replies": []
        }
    ]
}