{
    "title": "There are more slaves now than any time in human history and it needs to stop",
    "author": "Creative_Mixture_958",
    "subreddit": "Libertarian",
    "rank": 320,
    "score": 191,
    "upvote_ratio": 0.87,
    "num_comments (reported by reddit)": 44,
    "url": "https://vimeo.com/782124830",
    "id": "1iowky7",
    "selftext": "",
    "comments": [
        {
            "author": "Humanity_is_broken",
            "body": "The measure should be in percentage of the world population. This is another example of poor headline choice weakening a very important and serious issue",
            "score": 61,
            "replies": [
                {
                    "author": "djazpurua711",
                    "body": "No, that diminishes the size of the problem. There is greater human suffering than ever before, let us not sugar coat it.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "humblenarcissist112",
                            "body": "I don’t think you understand how brutal the world was before lol",
                            "score": 12,
                            "replies": [
                                {
                                    "author": "djazpurua711",
                                    "body": "I don’t think you understand how brutal the world is now lol",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "humblenarcissist112",
                                            "body": "Oh, sadly I do. But if you think the modern world is more savage than in history, I need you to explain yourself lol",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "author": "djazpurua711",
                                                    "body": "Never said that lol",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "author": "humblenarcissist112",
                                                            "body": "Excuse me for not quoting you directly. “There is greater human suffering than ever before.”\n\nStil wrong",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "djazpurua711",
                                                                    "body": "Excuse me for adding to the discussion of the OP title. \"There are more slaves now than any time in human history and it needs to stop\"\n\nHappy to keep making you look like a moron if you reply",
                                                                    "score": -1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "humblenarcissist112",
                                                                            "body": "Mkay big guy, sure thing.",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Creative_Mixture_958",
                                                                                    "body": "Okay, since I’m the OP, and I can declare a winner, I declare humble the winner and dj the moron.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "humblenarcissist112",
                                                                                            "body": "🙏🏼",
                                                                                            "score": 1,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "BDashh",
                    "body": "The headline didn’t make any claims about proportion. It is discussing sheer numbers. This is not poor headline usage, as it is factually accurate and not misleading to people with some media literacy",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Purp1eC0bras",
                    "body": "So it’s a good amount of slaves for you?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Aggressive-Gazelle56",
                            "body": "sigh",
                            "score": 10,
                            "replies": []
                        },
                        {
                            "author": "Effective-Olive7742",
                            "body": "When did you stop beating your wife?",
                            "score": 4,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "creeper321448",
            "body": "There are also significantly more people now than ever before. The world population wasn't even 1 billion when the trans Atlantic slave trade was happening.",
            "score": 6,
            "replies": []
        },
        {
            "author": "FieryTeaBeard",
            "body": "Please provide a source for the number of slaves currently and previously. Asking because that is a provocative statement and I'm unable to confirm it on a preliminary search.",
            "score": 26,
            "replies": [
                {
                    "author": "Intelligent-End7336",
                    "body": "Seeing as how I found a number in under 5 seconds, I wonder how hard you tried.\n\n[There is 40.3 million slaves in the world today.](https://www.worldatlas.com/articles/countries-with-the-most-modern-slaves-today.html)\n\n[167 countries still have some form of modern slavery, which affects an estimated 46 million people worldwide.](https://worldpopulationreview.com/country-rankings/countries-that-still-have-slavery)\n\n[In 2017, a coalition of states and non-government organizations estimated that there were some 40 million people enslaved worldwide, as well as 152 million child laborers.](https://theconversation.com/fact-check-how-many-people-are-enslaved-in-the-world-today-107078)",
                    "score": 35,
                    "replies": [
                        {
                            "author": "free_is_free76",
                            "body": "Can we at least have subject/verb agreement in our trustworthy sources' headlines?",
                            "score": 9,
                            "replies": []
                        },
                        {
                            "author": "Adriancastellanos",
                            "body": "Might include prisoners in those numbers, if not that number is much higher.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "That would skew the numbers, because prisoners have never likely been counted in slavery figures, historically",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "author": "Intelligent-End7336",
                                            "body": "> That would skew the numbers, because prisoners have never likely been counted in slavery figures, historically\n\nYes, we wouldn't want people realizing that governments never truly abolished slavery.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "whoosh",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Mikenator762",
                    "body": "Woah there buddy you’re asking for a lot considering this is Reddit",
                    "score": 18,
                    "replies": []
                },
                {
                    "author": "Siglet84",
                    "body": "I mean there’s 7 billion more people on earth than there was 150 years ago soooooo…..",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "That's not provocative, it's a well-known, well-attested fact",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Cannoli72",
                    "body": "Have you looked at your paycheck lately? all the evidence you need",
                    "score": -3,
                    "replies": []
                }
            ]
        },
        {
            "author": "WanderingPulsar",
            "body": "Removing prisons and introducing penal labor for all crimes will decimate slavery from its very core. Slavery will become obsolete and an unnecessary risk factor",
            "score": 2,
            "replies": [
                {
                    "author": "Working_Extension_28",
                    "body": "\"Penal labor\" just sounds like slavery going by a different name. Like calling a slave an indentured servant instead of calling them a slave.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "WanderingPulsar",
                            "body": "It actually is slavery if we take the definition of it in that making someone work without a contract. But thats a disputed view\n\nSome lawyers suggest that citizenship is a contract between an individual and the law. If forced labor for criminals was defined in the law, that might be perceived as a binding liability agreed upon\n\nI guess the issue is that the person should start hurting others less, or just dont hurt others if u dont wanna be rented to a company during ur sentence i suppose",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Working_Extension_28",
                                    "body": "So you're getting rid of slavery by doing slavery? That's insanely contradictory.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "WanderingPulsar",
                                            "body": "Its not really, if you are in agreement with those lawyers. If citizenship is a contract, then penal labor is a contracted liability for criminals. You can say \"but i dont like it\" sure but thats not really an argument. The goal is to save innocent people from captivity\n\nPeople wont be put in 'prisons' without taxpayers permission, bcs that would be the slavery of taxpayers. You dont ask consent from taxpayers before funding prisons, why should i pay for your prison stay? I dont even know you\n\nNevertheless, in penal labor scenario, you are still free to rent a criminal, put him in a room in your house, feed him with your own money. That should give the criminal prison vibeees, nice",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Working_Extension_28",
                                                    "body": "Dude that's just straight up slavery",
                                                    "score": 0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ledoscreen",
            "body": "This should include the entire male population of states that force their citizens to serve in their fucking armies. \n\n In addition, I think we should add the rest of the population as a share of GDP redistributed through the state budget.",
            "score": 5,
            "replies": [
                {
                    "author": "Ok-Temporary-3522",
                    "body": "That's right. We must oppose any exploitation.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "allahbkool",
            "body": "Yes there are. Thank you Nike",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "India needs a Milei figure",
            "score": 1,
            "replies": [
                {
                    "author": "caprix",
                    "body": "They’d get assassinated before anyone learned their name",
                    "score": 2,
                    "replies": [
                        {
                            "author": "None",
                            "body": "Ok fine, fine, a Pinochet figure. Get them Chicago Bois in there. Are you happy with what you've done??",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "IsawitinCroc",
            "body": "An inconvenient truth bc there's imbeciles out there who as long as it's happening in 2nd and 3rd world countries it's not real.",
            "score": 0,
            "replies": []
        },
        {
            "author": "dullardlu",
            "body": "There's also more capitalism...",
            "score": -1,
            "replies": [
                {
                    "author": "TermLimitsCongress",
                    "body": "All governments have slaves.",
                    "score": 0,
                    "replies": []
                }
            ]
        }
    ]
}