{
    "title": "Do you think the US is Moving Towards, or Away from Libertarian Ideals Under current Trump's presidency?",
    "author": "CountryAnnual7495",
    "subreddit": "Libertarian",
    "rank": 260,
    "score": 107,
    "upvote_ratio": 0.77,
    "num_comments (reported by reddit)": 246,
    "url": "https://www.reddit.com/r/Libertarian/comments/1iruclb/do_you_think_the_us_is_moving_towards_or_away/",
    "id": "1iruclb",
    "selftext": "Discuss. ",
    "comments": [
        {
            "author": "--alex1S--",
            "body": "He is a crony and against free trade. By definition this economic policy is anti-libertarian. He wants another war on drugs , he’s not clear about abortion rights and he touts the idea of annexing and/or invading neighbouring countries (not to mention Gaza). I’d say he’s moving the US away from libertarian ideals but he does it by shifting focus on the matters libertarians want to hear like, spending cuts, isolationism, gun control. A true populist",
            "score": 208,
            "replies": [
                {
                    "author": "gazzettinoeconomico",
                    "body": "I think you got right to the point by saying \"I’d say he’s moving the US away from libertarian ideals but he does it by shifting focus on the matters libertarians want to hear like, spending cuts, isolationism, gun control.\".  \n  \nI'm Italian, and here there was a journalist (a very famous one, his name was Indro Montanelli)who was anti-communist, and before one ballot wrote to his readers something like \"let's hold our noses and vote for DC\", which was the Catholic party, it wasn't ideal, but it was a way not to allow the worse party (the Communist party)to win.\n\nThat's more or less what happened in this US election in my opinion.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "--alex1S--",
                            "body": "Yeap I think that’s exactly what happened. It’s really a pity that such great country produced so incredibly bad candidates",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "No-Swan-7028",
                                    "body": "Thank goodness we still have Bernie leading the fight",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "--alex1S--",
                                            "body": "He’d be equally bad if not worse.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "djentropyhardcore",
                    "body": "Unfair trade is not libertarian.  Libertarianism says nothing to other countries. It's only about our relationship with our government.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "--alex1S--",
                            "body": "Libertarianism is clearly a very pro free trade ideology as it’s about free movement of goods. Any impediment to it is a de facto limitation of individual freedom and perfect recipe for monopoly formation. That’s why cronies love them. When a government impose them is damaging its relationship its citizens. You can’t have individual freedom without economic freedom and vice versa. Now, people with very \"charged\" views are usually willing to bend reality to fit their narrative (everybody does it). It’s like having a space exploration company that lives off government contracts but trying to slash government spending or being so fixated on gun control elimination that one is willing to give government unlimited power just so a revolver is available at the convenience store",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "djentropyhardcore",
                                    "body": "Libertarianism only applies to the country it's in.  Again, it speaks nothing to trading with communist nations.  Don't turn a minarchist government into an argument for communist globalism. \n\nAlso, revolvers should be available at convenience stores.  We have a second amendment for a reason.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "--alex1S--",
                                            "body": "It seems to my that your ok paying taxes as long as they are called tariffs. Also, you’re ok with your government dictating which product will be cheaper. You also don’t seem to have an issue with reduced competition or letting economic forces work freely. That’s not very libertarian",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "djentropyhardcore",
                                                    "body": "I love economic forces working freely, in my own nation.  I'm an American, not an Earthling.  We do not subsidize business...other countries do, so it's not free trade.  State to state is free trade.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "--alex1S--",
                                                            "body": "One would expect that you should welcome this. Other governments are subsidising your consumption. How is that not a win? In any case trade barriers and libertarianism are as compatible as prostitution and virginity. You literally want your government to intervene with legislation and tax you while doing it. Perhaps you need to recalibrate your political compass because that’s not libertarianism in any form. Maybe you want to look at some conservative/protectionism branch but definitely NOT libertarianism",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "djentropyhardcore",
                                                                    "body": "I want my government to charge other countries to sell here.  BECAUSE I'm a libertarian for this country.  I'm not a \"global libertarian\" unless the US owned the entire world.  \n\nYou reject the westphalian concept of a nation, which is a prc value, not an American one.\n\nAlso whatever you think a \"win\" is is other countries beating the United States.  Obviously you're Chinese, or at least not American.  Your opinion doesn't matter here.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "--alex1S--",
                                                                            "body": "No, I’m not Chinese. Neither American. I’m from the EU but I have the utmost admiration for the US. I am in close contact with the culture and I have received American style tertiary education. I also work closely with American individuals and institutions as my employer is an American based private company. I have also studied libertarianism quite a lot and its many schools of thought. They have quite many differences among them but they all agree on free trade and low to zero taxes. What you defend so full heartedly is a tax on YOU. Not other companies, not other citizens but YOU. Any tariffs placed on non-us products are paid at US customs by US companies (ie importers). I don’t know whether libertarianism has evolved into something else nowadays but if it favours taxes in any shape or form, it’s not true libertarianism.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "djentropyhardcore",
                                                                                    "body": "\"I'm from the EU\"\n\nExactly.  Your area hasn't had a functioning government since the 1920s.\n\nI don't care what you call it; the reason you don't understand this is because you don't like the concept of westphalian Nations.  You think a place like France is just an area of the world no different than any other.  But it is different. It's filled with French people.  French people have a culture, a unified culture even.  They also have a nation.  French people just like Americans want to buy products made by French people.  They want no taxes on those products.  Putting tariffs or taxes or whatever you call them on foreign products made by other countries is not a concern of libertarianism.  A nation cannot rely on foreign products (or foreign workers for that matter).  That's why England is a caliphate now.  They opened their borders and opened up their trade with no consideration of their own citizens, and now you get thrown in prison for questioning any of it.  And unfortunately they cannot defend themselves against their own government.  \n\nWhen you cease to care about your citizens, and especially your citizens ability to engage in capitalism, libertarianism pretty much doesn't even matter at that point because you don't have a country then.  \n\nI don't want cheap plastic shit from China.  I don't care how much it costs because I'm not going to buy it.  I'm going to buy American and I want my government to keep all that cheap Chinese crap out of my country or charge the shit out of people who want to buy it.  That's nationalist libertarianism.  Support your nation first.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "cbstieg",
                            "body": "Tariffs are our government imposing taxes on us.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "djentropyhardcore",
                                    "body": "No it isn't.  It's leveling the playing field between domestic production and communist countries that subsidize their own industry.  Please learn economics and turn off CNN, thanks!",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "cbstieg",
                                            "body": "Let's assume that's true.  That may be the reason for the tariff.\n\nHowever, what a tariff is is a tax. It's imposed by our government. It's paid by whomever imports it. The cost is largely passed along to the consumer.\n\nThat's just basic econ.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "djentropyhardcore",
                                                    "body": "Just cuz you call it something else doesn't make it true. We don't want people in this country buying stuff from other countries.  We want them to buy stuff from our own country.  Do you understand that?  Do you understand that unless you're really itching to buy stuff from Communist countries for some reason, you won't be affected?  Do you have any idea what patriotism is?  Do you have any idea what nationalism is? Do you understand that they are both very good things?  Are you an American citizen?  \n\nI know you won't answer any of these questions so I'm not sure why I'm even bothering, but I hope your check clears from USAID.  (it won't, thankfully)",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "cbstieg",
                                                            "body": "I am indeed an American citizen, get nothing from the government, and understand, but not necessarily agree with, all those things.\n\nI'm not really even arguing against your position on those because I know you're not going to change.  My guess is that you work in an industry that could be impacted by foreign competition.\n\nI'm just trying to get you to understand that a tariff is a tax on consumers, and that's why it's an issue libertarians care about and generally oppose.  Do you understand why?\n\nA tariff being a tax is not something I just came up yesterday, and I don't watch CNN.\n\nRead virtually any economist. Read the dictionary.  You can argue tariffs are good taxes, but the fact of their being taxes is just not up for debate.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "djentropyhardcore",
                                                                    "body": "Except they are tariffs, not taxes.  You do not HAVE to pay tariffs.  You can choose to buy domestic.  You can't choose to not pay taxes.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "cbstieg",
                                                                            "body": "Even if you can avoid a tax, it doesn't mean it's not a tax.\n\nOne of the reasons for the American War for Independence was that the British were imposing taxes on tea and other things. We could have chosen not to pay the tax by not buying tea (and largely, we did). However, the fact that we could avoid it didn't make it not a tax, nor less objectionable.\n\nWhat do you call money that must be paid to the government when a customer buys cigarettes? You don't have to buy cigarettes.\n\nYou can avoid gas taxes by choosing to drive an EV instead of a gas or diesel vehicle.\n\nYou can avoid sales taxes by choosing to be self-sufficient and not buy retail goods.\n\nYou can avoid income taxes by choosing to be self-sufficient and not work a wage job.\n\nYou can avoid property taxes by choosing not to own real estate.\n\nThe only type of taxes that we can't legally avoid are head taxes, a tax paid for the privilege of living. We don't have those anymore.\n\nBut just because we can choose not to engage in activity that can be taxed, doesn't mean those aren't taxes.\n\nSame with tariffs.\n\nWhat do you call it when the government requires payment in order to allow someone to do some economic activity?  A tax.\n\nhttps://www.google.com/search?q=tariff+dictionary\n\n\nHowever, you can't really avoid the cost of tariffs by buying domestic.  The whole point of protective tariffs is to allow domestic producers to charge higher prices without having to worry about being undercut by foreign competition.\n\nSo even if you never buy imported goods, you are still likely to experience tariff inflation at the store.\n\nAgain, basic economics.\n\n\nFinally, the whole idea of you and the government telling me that it's unpatriotic to buy imported goods and will therefore be taxed for it, is antithetical to liberty on two fronts.\n\n1. It's a tax\n2. It seeks to coerce us to change our behavior.\n\nIf you want to buy American because of your patriotic values, nothing is stopping you now. I encourage you to do so.\n\nBut telling other Americans that they can't buy imports without heavy taxation is quintessential big government.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "djentropyhardcore",
                                                                                    "body": "Today, the point of tariffs is to enable domestic production because communists have outsourced production to communist nations that subsidize their industries.  It's not so domestic production can charge higher rates, it's so they can exist in the first place.  Right now, it's not profitable to build a car in the USA because we can buy cars from Communist countries that subsidize their industries.  That's not free trade.  That's slave trade.  You're arguing for slave labor in China.  Which has nothing to do with libertarianism or the United States.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "cbstieg",
                                                                                            "body": "Yet we have domestic production.\n\nYou're obviously not interested in responding to my points or acknowledging basic economic dictionary definitions, so I don't see much point in continuing.\n\nAll the best to you",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "djentropyhardcore",
                                                                                                    "body": "We don't have domestic production of medication, automobiles, anything made of plastic, or basically anything at this point. So, no you are incorrect.",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "No-Swan-7028",
                                            "body": "You're both right and wrong. A tariff is a tax—it’s a cost imposed on imported goods that ultimately gets passed to consumers. However, the intent of tariffs is to incentivize domestic production by making foreign goods less competitive. The problem is, in a globalized economy, many products (especially electronics, auto parts, and consumer goods) aren't easily replaced by U.S.-made alternatives.\n\nTake smartphones, for example—virtually all are made in China, South Korea, or Taiwan. Tariffs don’t magically create U.S. manufacturing capacity overnight; they just raise costs. Even if a company wanted to produce phones domestically, it would take years and massive investment.\n\nSo while the goal of tariffs may be to protect domestic jobs, in the short term, they act as a tax on American businesses and consumers. That’s just basic economics.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "djentropyhardcore",
                                                    "body": "\"in a globalist economy\" is not a death sentence for nations.  It's a choice that our politicians made, specifically Bill Clinton made when he gave China most favored nation status, as well as the nonsense that was NAFTA.  It can be extinguished at any time.  \n\nYes, it takes some time to ramp up production on things.  That doesn't mean to not do it.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "igortsen",
                    "body": "Well said... \n\nIf Elon and Ron Paul audit the fed would you say Trump's administration was more libertarian than any in recent memory?",
                    "score": 6,
                    "replies": [
                        {
                            "author": "3_Thumbs_Up",
                            "body": "If they eliminate the FED and replace it by free banking.\n\nAn audit is just an obvious veil for a power grab.",
                            "score": 23,
                            "replies": [
                                {
                                    "author": "djentropyhardcore",
                                    "body": "LMAO are you serious??  BlueAnon nonsense is silly.",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "author": "3_Thumbs_Up",
                                            "body": "I have no fucking clue what BlueAnon even is, but a quick Google seem to say it's a term for some conspiracy nonsense from the left. The fact that you read free banking and somehow thought I hang around on leftist sites makes it kind of hard for me to take you seriously. That's not an intelligent deduction.\n\nIf you're serious about monetary freedom you're against all central banking. The problem with a central bank is the central bank itself, and the perverse incentives that come with it. \"Auditing he fed\" is missing the goal massively",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "djentropyhardcore",
                                                    "body": "Your left-wing conspiracy theory isn't about banking. It's about you thinking an audit is a power grab.  I know that you're on the left because you think that anything that anybody does in government is a power grab, and that is absolutely true on the left.  A populist libertarian president like Trump has no need to grab power.  His goal is to make government 90% smaller which is the libertarian dream.  He's doing it.  And you're complaining about it.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "3_Thumbs_Up",
                                                            "body": "Free banking is a very libertarian thought.\n\nClaiming to \"fight corruption\" is the text book authoritarian play. Trump wants to \"audit\" the central bank because he wants it to obey him. That's it.\n\nI don't give a fuck about who runs the central bank. I don't want a central bank. That's the obvious libertarian position. You just want a different flavor of socialism, with different rulers, and you still call me a leftist. You're the leftist here, you central bank lover. Go take your leftist policies to some socialist sub.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Ok_Relationship2871",
                    "body": "Yes!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AlphaTangoFoxtrt",
            "body": "I don't think the US has moved *towards* libertarianism in over 100 years.\n\nTrump is an authoritarian asshat, as was Biden, as was Trump, as was Obama, as was Bush, as was...\n\nWhen people tell you who they are, believe them. Trumps whole:\n\n> He who saves his country has broken no law\n\nShould be sending up massive fucking alarms about who he is saying he is.",
            "score": 587,
            "replies": [
                {
                    "author": "Relevant_Hope_2945",
                    "body": "He has his mugshot hanging outside the Oval Office for everyone to see. He isn’t just anti-government process, he’s anti-law entirely.",
                    "score": 73,
                    "replies": [
                        {
                            "author": "2022_Perhaps",
                            "body": "He’s not anti law, he would happily see you locked up for any number of victimless crimes. ",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "FreeOJ32",
                            "body": "That seems like the most libertarian thing ever lol",
                            "score": -21,
                            "replies": [
                                {
                                    "author": "EnlargedQuack",
                                    "body": "You're confusing libertarian with anarchism I think",
                                    "score": 33,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "WhoIsEggroll",
                    "body": "![gif](giphy|3o7TKxOzWkgxIIMwes)",
                    "score": 91,
                    "replies": []
                },
                {
                    "author": "Samniss_Arandeen",
                    "body": ">He who saves his country has broken no law\n\nHow is this not the ends justifying the means? Not to mention the assumption, ideologically-biased *at best*, the ends are, in fact, actually \"saving\" a damn thing?",
                    "score": 37,
                    "replies": [
                        {
                            "author": "AlphaTangoFoxtrt",
                            "body": "It is. It's straight up Machiavellian.",
                            "score": 30,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "HurricaneSpencer",
                    "body": "Homie spittin.",
                    "score": 24,
                    "replies": []
                },
                {
                    "author": "CorruptedAura27",
                    "body": "Correct vibes. I don't like this (our current situation), and I will never trust this. If it walks, talks, acts and feels like a spade, it's a goddamn spade. These cucksuckers are stealin your shit, in one way or another.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "IHSV1855",
                    "body": "This pretty much wraps it up. Well said!",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "pansexualpastapot",
                    "body": "Based.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Smiley1236",
            "body": "Likely away.  I am excited for the waste and fraud cuts we are hearing, but unless that money comes back in the form of reduced or eliminated taxes (or significant balanced budget) it is just reshuffling the deck chairs.",
            "score": 123,
            "replies": [
                {
                    "author": "narwi",
                    "body": "most of the cuts are not waste and fraud and new waste is orders of magnitude larger (armored electric cars for $400 m anybody?)",
                    "score": 62,
                    "replies": [
                        {
                            "author": "John2H",
                            "body": "Need I remind people TRUMP DIDNT SIGN the contract giving Tesla military money. \n\nThat was Biden.",
                            "score": 36,
                            "replies": [
                                {
                                    "author": "KruKruxKran",
                                    "body": "Great so you agree we should halt it.",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "1127_and_Im_tired",
                                            "body": "They did halt it. For now, at least.",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "KruKruxKran",
                                                    "body": "I'm sure you support rescinding the $3B to spaceX for Artemis and mars shot projects too .. 👍.   Also tax cuts...",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "DarthFluttershy_",
                                            "body": "Yes, but calling it \"new waste\" in the context of assessing Trump s administration is misleading",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "KruKruxKran",
                                                    "body": "Why? Waste is waste and if the new admin wants to put their money where their mouth is (irrespective of who initiated) they should halt it. Money to USAID started before the new admin and they froze it. They should do the same for SpaceX",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Veddy74",
                                    "body": "They don't care about the truth,  unless they can embarrass the Republicans.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Veddy74",
                            "body": "Biden did the EVs and Trump put a hold on it and made Tesla bid against other EV companies.  The way you portray this is dishonest.  Are you unaware or just don't care?",
                            "score": 30,
                            "replies": [
                                {
                                    "author": "KruKruxKran",
                                    "body": "The way things are portrayed everywhere is dishonest. Is anything Elon portraying honest and pragmatic? No.. he has an agenda.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Veddy74",
                                            "body": "Yup,  to help stabilize our situation.",
                                            "score": -11,
                                            "replies": [
                                                {
                                                    "author": "KruKruxKran",
                                                    "body": "😂 my god his altruism is so refreshing.. dude I have a bridge to sell you ..",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "Veddy74",
                                                            "body": "If you have more money than anyone else, what is the motivation to try to get your info.  He had access to PayPal for years,  less money at the time,  and he didn't steal.  Seriously,  tell me what's bad about this,  I don't see it.   Government is a parasite that will kill its host to survive.  For 20 years, it has been killing us.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "FullFlounder3",
                                                                    "body": "You’re not thinking big enough.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "JMBisTheGoat",
                            "body": "I think most of the federal budget is waste. They shouldn't be adding anything. \n\nEspecially not armored electric cars. That sounds like a terrifying death trap. Imagine a battery fire in a vehicle where the doors are too heavy open. I mean it's not significantly worse than a normal car fire with doors too heavy to open, but it is slightly worse.",
                            "score": 19,
                            "replies": [
                                {
                                    "author": "5HTjm89",
                                    "body": "I hadn’t actually imagined this administration stuck in a car battery fire with doors too heavy to open. Good point. You’ve sold me on this project.",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "AutoModerator",
                                    "body": "The 'fire in a crowded theater' case was [unanimously overturned](https://en.wikipedia.org/wiki/Brandenburg_v._Ohio) by the Supreme Court decades ago. [Stop using such a flawed and outdated analogy to argue for restrictions on free speech.](https://web.archive.org/web/20240804092942/https://www.theatlantic.com/national/archive/2012/11/its-time-to-stop-using-the-fire-in-a-crowded-theater-quote/264449/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
                                    "score": -21,
                                    "replies": [
                                        {
                                            "author": "sabinati",
                                            "body": "Bad bot",
                                            "score": 9,
                                            "replies": []
                                        },
                                        {
                                            "author": "LikesBlueberriesALot",
                                            "body": "Very bad bot.",
                                            "score": 7,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "dangered",
                            "body": "Idk why you’re still bringing up Biden’s poor fiscal decisions. We know Biden-Harris sucked and it will plague us for decades but this is a thread about Trump",
                            "score": 0,
                            "replies": []
                        },
                        {
                            "author": "djentropyhardcore",
                            "body": "ALL the cuts are unconstitutional government spending.  I don't know how you could say otherwise!",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "datafromravens",
                    "body": "Aren't they preparing a tax cut package? We have to keep in mind that they aim to cut 1 trillion from the budget which is good but we will still be 1 trillion in the whole despite that so cutting taxes before the deficit is sorted out will have negative consequences for the debt burden",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "BEGA500",
            "body": "Away. Sharply. Every executive order is a step away from the rule of law.",
            "score": 206,
            "replies": [
                {
                    "author": "None",
                    "body": "\"Rule of law\" on a libertarian sub. This site is hilarious.\n\nThe rule of law is an incoherent and impossible concept, fyi",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "mean--machine",
                    "body": "Why is the rule of law libertarian?  China has a lot of laws and enforces them very strictly, are they the ideal libertarian state?",
                    "score": -5,
                    "replies": [
                        {
                            "author": "AlphaTangoFoxtrt",
                            "body": "The rule of law is not *automatically* libertarian. This doesn't mean everything against the law is libertarian. \n\nYou're making an inverse fallacy. The \"Rule of law\" is not automatically libertarian. But we have laws against murder. So is murder libertarian just because it is against the law? Of course not.\n\n\"The ends justify the means\" is Machiavellian, and Machiavellianism is explicitly ANTI-Libertarian",
                            "score": 26,
                            "replies": []
                        },
                        {
                            "author": "sabinati",
                            "body": "The rule of law is not just having laws.",
                            "score": 33,
                            "replies": [
                                {
                                    "author": "mean--machine",
                                    "body": "What is it then?  What establishes authority?",
                                    "score": -11,
                                    "replies": [
                                        {
                                            "author": "sabinati",
                                            "body": "The rule of law is one of the key concepts of libertarianism...",
                                            "score": 20,
                                            "replies": []
                                        },
                                        {
                                            "author": "KTPU",
                                            "body": "I'll give you an answer instead of downvoting. Rule of law is an ideal, it means all laws apply equally to everyone. No exceptions for the rich or the political elite, ect.. \"No one is above the law\"\n\nEdit: Here's the encyclopedic definition: \n\n\"the mechanism, process, institution, practice, or norm that supports the equality of all citizens before the law, secures a nonarbitrary form of government, and more generally prevents the arbitrary use of power.\"",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "DarthFluttershy_",
                            "body": ">China has a lot of laws and enforces them very strictly\n\n\nA bit off topic really, but though I'd take the US government -warts and all- over the CCP any day... China kind of has the opposite problem. Their laws are arbitrary and arbitrarily enforced, meaning a very multi-tiered justice system where the government can come at you with just about anything at any time, but typically doesn't bother if you are unimportant. There are, however, silver linings to this, such as the ease of starting a small business...so long as you don't draw unwanted attention.\n\n\nThe US is much, much more legalistic than China. This can be good (such as taking the free speech provision of the constitution mostly seriously, unlike China which also has free speech and press in their constitution as a bad joke), but also leads to a lot of the justice system problems we complain about here a lot.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "claybine",
                            "body": "If rule of law is established, then it's rightful to criticize those who step away from it.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "So libertarians believe in expanding the state or reducing it?,   I personally don't care how reducing the state happens as long as it happens.   If a few bureaucrat rules are broken I personally don't give a shit?\n\n  \nLike I would like to hear, if you could reduce government by 30% right now instantly.  You wouldn't because its not going through the proper bureaucrat walls put to deliberately hinder reducing government entites.",
                    "score": -9,
                    "replies": [
                        {
                            "author": "narwi",
                            "body": "autocratic christian nationalist police state would not be libertarian, no mater how small the government.",
                            "score": 82,
                            "replies": [
                                {
                                    "author": "djentropyhardcore",
                                    "body": "Good thing we don't have that!",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "BEGA500",
                            "body": "They have the presidency, house, and senate. They could just do it legislatively. But they want shock and awe or whatever. The means matter. Just think if he was recruiting government citizen volunteers to be DMV volunteers to help with a license plate backlog. Or any other non official expansion of government.",
                            "score": 17,
                            "replies": [
                                {
                                    "author": "dangered",
                                    "body": "I doubt it could be done legislatively. Just because they have an R doesn’t mean they back every decision he makes. \n\nSome of it probably could be, but the ones aimed at dismantling corruption would be blocked by corrupt R’s and D’s alike.",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "M-y-P",
                            "body": ">Like I would like to hear, if you could reduce government by 30% right now instantly.  You wouldn't because its not going through the proper bureaucrat walls put to deliberately hinder reducing government entites.\n\nNot OP, but I wouldn't instantly reduce any government by 30% unless I wanted to damage a specific country or knew that at least 70% of those people were doing nothing.\n\nI sadly think that reducing government isn't easy, and while you need shock therapy in some cases (Argentina for example), most of the time you have to do it gradually.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "urbansasquatchNC",
                                    "body": "Most of the problems is they're operating on a \"cut first ask questions later\" mindset which is how you get things like firing nuclear safety personnel and then not knowing how to contact them when you realize you shouldn't have fired them. It's just a careless approach that's guaranteed to have severe mistakes like that vs doing the bare minimum of research into what something is or what the consequences will be.",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "LikesBlueberriesALot",
                                            "body": "This. I am all for cutting government spending and bureaucracy.  But this is not how it should be handled. \n\nTeam Trump has literally had a *decade* to come up with detailed plans for reducing government in a way that won’t actively harm the country or its citizens.  But instead they’re just randomly cutting shit with zero regard for the fallout.  We are in for a very very bad time.",
                                            "score": 16,
                                            "replies": [
                                                {
                                                    "author": "LaVillaCalis",
                                                    "body": "How do we know they are not following a plan?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "BajaBlastFromThePast",
                            "body": "What exactly does “reduce the government by 30%” mean",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "what the actual fuck do you think I mean by reducing government by 30%. agencies & programs reduced, workforce reduced, budget allocation, regulatory functions.    You know Government....\n\n  \nI could understand the question coming from a lino or grifter.",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "author": "BajaBlastFromThePast",
                                            "body": "Alright calm down snow flake. God forbid someone ask you to clarify your statements. “30%” in the context you said means nothing. Reduce 30% of spending? Eliminate 30% of agencies? How do you measure a percentage of government? \n\nThe obvious answer is that it’s much more complex than that and that you’re just saying shit. That’s why you got so mad when I asked a simple question. You don’t know the answer.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ghosthacked",
                    "body": "E.O. are the results of power granted to potus by congress. They are very much with in thr rule of law. (for whatever that's worth)",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "datafromravens",
                    "body": "Sort of. The orders are directed at limiting government which is sort of libertarian",
                    "score": -6,
                    "replies": [
                        {
                            "author": "BEGA500",
                            "body": "You can’t really be a libertarian authoritarian.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "datafromravens",
                                    "body": "I think you can. A monarch could in theory be more libertarian than a democracy. In any case, in our democracy our legislators granted the executives far too much power. The choice is make cuts or let the other party wield that power to do the opposite. It's nice to be a perfectly pure libertarian online but the real world is far messier. Even Millei has done non-libertarian things like raise taxes for the sake of a greater goal.",
                                    "score": -7,
                                    "replies": [
                                        {
                                            "author": "BEGA500",
                                            "body": "You admit our executives have too much power but are trying to make an argument for an authoritarian.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "author": "datafromravens",
                                                    "body": "Yeah, did you read my post?",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "author": "BEGA500",
                                                            "body": "I did. That’s how I found the weird contradiction.",
                                                            "score": 8,
                                                            "replies": [
                                                                {
                                                                    "author": "datafromravens",
                                                                    "body": "if you read my post you wouldn't have had that misunderstanding.",
                                                                    "score": 5,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "White_C4",
                    "body": "Depends on what the executive order is. Enforcement does not necessarily mean it's anti-libertarian, it's just the question of whether or not the enforcement infringes on the rights of Americans and promotes liberty over stricter control.",
                    "score": -4,
                    "replies": []
                }
            ]
        },
        {
            "author": "zugi",
            "body": "Fiscally speaking, reducing government  spending, eliminating whole agencies, and reducing the federal workforce is very libertarian. It's also pretty conservative, at least by some past definitions of conservatism.\n\n\nYet tariffs are very illibertarian. Even in response to accusations of unfair trade practices, the libertarian position is \"the more unfair, the better\" when other countries choose to subsidize their own industries.\n\n\nNot policing the world and ending wars is very libertarian, but I'll only really believe it if DOGE makes 10% or larger cuts in military spending. Which I doubt they'll do, but am open to being pleasantly surprised.\n\n\nCutting 10 regulations for every new one is also very libertarian, and old-school conservative.\n\n\nAdvocating for free speech and ending government viewpoint subsidies (USAID, NPR, etc.) is very libertarian.\n\n\nSo mixed it's a mixed bag so far.",
            "score": 50,
            "replies": [
                {
                    "author": "notaprotist",
                    "body": "Could you give me an example of Trump advocating for the free speech of someone he disagrees with? I can only find examples of him promoting speech he already agrees with, which I would argue isn’t supporting free speech at all. On issues he disagrees with, for example Gaza protesters, he’s been threatening to cancel visas and deport people for exercising their speech",
                    "score": 17,
                    "replies": []
                },
                {
                    "author": "Aura_Raineer",
                    "body": "This. \n\nIt’s a very mixed bag so far.\n\nThis thread is full of people saying away. It’s just not that simple. \n\nI see many things that are definitely libertarian but I also see a bunch of things that are the opposite.",
                    "score": 15,
                    "replies": []
                }
            ]
        },
        {
            "author": "Embarrassed_Safe500",
            "body": "I think the U.S. is addicted to the authoritarian model of government. A true libertarian society would be so alien to the vast majority of Americans as to present an ontological shock. Americans are accustomed to being told what they can and can’t do and their desire to be governed increases in direct proportion to population density. \n\nThat said, the some of the things that Trump, et.al. are doing now, such as Doge, if not grounded in Libertarian philosophy, are aligned with Libertarian principles. President Trump’s efforts to reduce the federal workforce, deregulate agencies, and dismantle bureaucratic structures exhibit instrumental alignment with libertarian principles advocating limited government intervention and fiscal restraint. His executive orders imposing a “four-for-one” hiring ratio, aggressive attrition strategies, and elimination of agencies like USAID reflect a derivative application of libertarian ideals, prioritizing downsizing as a tool to curb state overreach and enhance private-sector efficiency. However, these actions diverge from core libertarian tenets in practice—such as Trump’s support for protectionist tariffs, expansive immigration enforcement revealing a superficial consonance with libertarianism rather than a philosophically rooted adherence. While framed as reducing bureaucratic bloat, the administration’s approach emphasizes centralized executive power over decentralized, market-driven solutions, creating a paradoxical blend of anti-statist rhetoric and authoritarian methods. Just my two cents.",
            "score": 18,
            "replies": [
                {
                    "author": "mainlydank",
                    "body": "Aldous huxley has a quote about this many years ago.  It's not just Americans, people in general love being told what to do.\n\n\"the greater part of the population is not very intelligent, dreads responsibility, and desires nothing better than to be told what to do. Provided the rulers do not interfere with its material comforts and its cherished beliefs, it is perfectly happy to let itself be ruled.”",
                    "score": 17,
                    "replies": [
                        {
                            "author": "Embarrassed_Safe500",
                            "body": "That’s a very insightful quote.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "disenchantedsiren",
                            "body": "You are both on point tonight.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "AutoModerator",
                                    "body": "\nLibertarian socialism is an oxymoron. The core tenet of libertarianism is private property beginning with the recognition of ownership of self and your own body and extending to ownership of that which is self-acquired and self-produced with that body.\n\nSocialism and communism deny private property rights, and the right of ownership of what is self-acquired and self-produced.\n\nThis means they deny the ownership of self, and someone who does not own themselves is a slave.\n\nSocialism and communism are totally incompatible with libertarianism, and are nothing more than forms of chattel slavery dressed up in pretty words to serve collective masters. Wealth robbery by the collective is just as immoral and unjust as much being robbed at gunpoint by an individual.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "mainlydank",
                                    "body": "Funny you say band aid off moment.  Before the election I told my friends best I see it Kamala will ruin us over a longer period of time, making the eventual collapse even worse, Trumps way more likely to do it quickly, and like removing a band aid it seems like a better way.  \n\nMy state has ranked choice voting, so I voted for Oliver, Stein as my second choice,  then Cornell West for my 3rd choice, and leaving the rest blank.  I would have easily picked a R or D that I thought could actually do a good job.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TheFortnutter",
                    "body": "this is an ai comment. fucker",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "disenchantedsiren",
                    "body": "I honestly don’t think when you talk to most Americans about downsizing government they are actually against it. I think it’s the swiftness at which it seems to be happening. Whether we like it or not, this is how our society currently functions. We don’t have half of the infrastructure needed in house to make up for what we might be losing. It’s not like that will be ready over night to offer jobs to those who now need jobs or to replace services no longer in the feds hands. It’s great to get rid of a lot of the bloat, but when it comes to what we need at home we need to make sure there is something the people can utilize, or there will be a lot of crashing out. I hope that makes sense. And of course everything that is being cut won’t affect the people, but the things that do should get extra care when handling.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "jussyjus",
                            "body": "I can see a future where certain things crash out like you say, but the current administration “comes to the rescue” by spinning former government entities into private entities. And it won’t be for the benefit of the people. Every privatized industry will be run like the healthcare industry.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "3_Thumbs_Up",
            "body": "Trump doesn't have any ideals, so the US is obviously not moving towards any.",
            "score": 15,
            "replies": []
        },
        {
            "author": "gazzettinoeconomico",
            "body": "Away.  \nI'm a non-American though, even if I love your country and follow its policies and facts as if I were.",
            "score": 6,
            "replies": []
        },
        {
            "author": "internal_logging",
            "body": "Away. \nSmaller government and stopping fraud and waste is achievable. But it should happen once theres a plan that was created by the audits/analysis. The current administration is playing Jenga, pulling at random sections of the government. It's not going to end well and their mistakes will take years to recover from.",
            "score": 76,
            "replies": [
                {
                    "author": "lokehfox",
                    "body": "Decades - even if the next administration aims it's full focus on rebuilding, it will take far far longer than any individuals term. It's so easy to destroy things, and so hard to build them; plus anyone qualified that's been cut loose in the fashion this admin has been doing it.... They are going to be extremely reluctant to come back; nobody wants an employer that can behave this erratically.",
                    "score": 26,
                    "replies": [
                        {
                            "author": "datafromravens",
                            "body": "We don't want them to rebuild them. The debt burden is already unacceptable.",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "lokehfox",
                                    "body": "While in the broad sense I tend to agree with the idea of reducing the expense and size of government, the approach being applied here is undermining national security, harming veterans, and will wreak havoc on many segments of American life outside of the millionaire and billionaire classes. Worse still, the net effect of all these layoffs accounts for such an insignificant percentage of the overall budget that any potential benefits will likely go entirely unfelt, and we'll just be left with the chaos.",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "author": "datafromravens",
                                            "body": "It's been less than a month, i imagine the plan is to cut quite a bit more. If you're upset about a billion in cuts are you sure you really want a smaller government?",
                                            "score": -4,
                                            "replies": [
                                                {
                                                    "author": "lokehfox",
                                                    "body": "Nobody is upset about this small bit of savings, but even if they fired the entire federal workforce overnight, it'd still only account for a few percent of budget; meanwhile the county would be plunged into anarchy. They aren't going so extreme, but it's closer to this than past administrations that we've experienced, and being executed in a fashion that evokes a sense of similarity to edicts from an emperor - a bit of frustration about this is warranted. I'd rather see them abolish executive orders, force congress to actually perform their duties, and go through the budget with something on the scale of scalpel to hatchet, instead of medieval battle axe.",
                                                    "score": 12,
                                                    "replies": [
                                                        {
                                                            "author": "datafromravens",
                                                            "body": "How would you actually go about forcing congress to do their duties or abolishing executive orders? Executive orders exist because congress passed bills that said the president had to make decisions on those topics so you would be going against the will of congress.",
                                                            "score": -4,
                                                            "replies": [
                                                                {
                                                                    "author": "lokehfox",
                                                                    "body": "My meaning was that abolishing EOs might compel congress to function, but you raise a good point - the mechanics of how to actually making them behave as they are intended, and not simply abandon their role to the executive branch again while the judicial just sits back and watches is an interesting question; I can't say I have all the answers, but we need to find our way back from the brink of authoritarianism, not lean even further into it. Every executive order issued is something of an affront to democracy.\n\nTo be clear also, I don't even really blame Trump for this, it's been a growing problem through just about every president in my lifetime; they just keep giving the executive more and more power, and each president has been less and less afraid to wield it. Now we're to a place where the majority of the legislative and judicial branches are basically cheerleaders and yes-men for the executive, and the executive fancies himself as infallible and is willing to act accordingly. If we continue this trend much further, we're going to find ourselves looking an awful lot like Russia within the next decade or so.",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "datafromravens",
                                                                            "body": "What authoritarian cuts their own power?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "lokehfox",
                                                                                    "body": "It's not impossible, but obviously grossly unlikely.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "datafromravens",
                                                                                            "body": "When you cut programs they are cutting their own power. We are seeing that in real time.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "lokehfox",
                                                                                                    "body": "That depends on the beneficiaries of those programs and in some cases, the fashion by which they benefit. Eliminating programs that operate outside of your direct influence can also be seen as a means of consolidating power. Eliminating persons with different opinions and perspectives as well is a means of consolidating power and influence. While yes, the overall apparatus of government may be lessened by eliminating huge swaths of the people changed with its operation, that does not mean the person executing that reduction is less powerful; a dictatorship can operate with far fewer officials than a democracy, and can obviously be much more efficient - that does not make the lives of those living under it better, and more often than not, the opposite is true. \n\nI don't think you want a king, so I'm not sure why anyone would want a president to be imbued with king-like authority, or why anyone would be ok with them leveraging that authority under the auspices of the ends potentially justifying the means, with even no real supporting evidence to suggest that it might.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "author": "datafromravens",
                                                                                                            "body": "you want more foreign aid?",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "author": "lokehfox",
                                                                                                                    "body": "Not necessarily, however foreign aid is sometimes also a vehicle for US aid. For example we'd have been spending more in the decommissioning of the arms we've been giving to Ukraine than the expense of delivering them there. Those arms are then used to perpetuate a conflict that is obliterating the economy of an opposition world power. We're basically saving money to win a war we don't even have to actually fight, and that in turn has helped the US economy to recover more quickly from COVID relative to much of the rest of the world. If we want the dollar to be strong against the currencies of other nations, that is still important.\n\nSimilarly, there are foreign aid programs in countries like Africa to stifle the spread of disease around the world; surely we would spend far more in insurance premiums and medical expenses to cover the cost of widespread monkey pox, ebola, HIV, etc in this country than we do to fight it there. It's not foolish to spend millions there to save billions here, not to mention lives.\n\nSome of those programs may well need more or different support from the government to function more effectively - that said, I'm sure there are also countless foreign aid programs that exist only to garner good will in vain or where the value proposition has shifted and needs to be reevaluated, or was never really there to begin with. Those sorts of arrangements need to be addressed, by the legislature, in the form of elimination or restructuring.\n\nWe should avoid throwing out the baby with the bath water, and beyond that, I don't think it should be for the president to decide unilaterally, and even less so do I believe that a unelected rich guy should even have a word in the conversation",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "author": "datafromravens",
                                                                                                                            "body": "Libertarians tend not to view foreign aid in a positive light.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "author": "lokehfox",
                                                                                                                                    "body": "Sure, and at the surface level that's a great position to take. The realities of the world are simply more complicated than that though. Politicians from every party pitch to what they feel is the lowest common denominator, so it's very often that you get slogan level insight into existing or proposed arrangements that don't work out logically much deeper than perhaps as a good starting position. From that point you'd then work out the best overall solution with logic and reason, even if that means making compromises or creative workarounds.\n\nYou might say for example illegal immigrants need to be deported with maximum velocity..... But I assume you like to eat fresh fruits and vegetables - you can deport everyone, but it's not like there are thousands of out of work American farm workers willing to work for next to nothing that will immediately swoop in to fill the void that's left. A more rational plan would involve building up farm industry and appeal in the agricultural industry among Americans and gradually executing deportations, whilst slowing/stopping the influx of new illegal immigrants. Or if you prefer a more dystopian future, we could advance AI and robotics to the point where farms can run with next to no actual human involvement (which would likely require huge govt programs btw), and then proceed with the deportations.\n\nWhat you don't actually want to do is round up everyone overnight and hock them over the border or into prisons and hope for the best, even if that's the chant-able version of your position; that'd be entirely asinine given the amount of our hard labor force that they represent and the lack of at-the-ready people or technology that would be necessary to replace them.\n\nSo yes reducing or eliminating foreign aid is a great platform talking point, but if you actually did just cut 100% of every program over night with no actual understanding of how those programs were positioned, you might find yourself creating an even greater burden for America, and you may have also burned bridges or been replaced by world adversaries on the way out making it more difficult to undo.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "author": "datafromravens",
                                                                                                                                            "body": "I actually don't agree with any of that. I think you could cut all the funding for stuff like LGBT education abroad with very little impact on any America. I understand soft power but most of it is not working and not being used to actually advance American interests. If democrats want to take taxes to spend on their priorities and is so important that it's worth bringing the country to financial collapse they need to do a much better job of explaining that it's necessary and be far more transparent about what they are actually doing.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "author": "lokehfox",
                                                                                                                                                    "body": "Yeah, can't say I can really imagine ways that a program of that nature would benefit us. That said, foreign aid in total is barely a blip on the actual federal budget - saving a percent or two isn't going to bring us back from anything; if you actually want to bring the country back from the brink of economic collapse, you need to cut costs in areas that would actually be impactful. Pick a year and look up the federal spending breakdown - they should be looking at those 10%-30% items to actually save anything.",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": []
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "disenchantedsiren",
                                                                    "body": "And congress doing so effectively shifted the power giving the executive branch more power than it should have. There were checks and balances in place for a reason. Trump has had no issue singling out those who go against what he is proposing and then watching as those who were against him fall in line. So it really wouldn’t be hard for him to call out those elected officials who were not properly doing their duties on the national platform to get them to actually act as they are meant to function. He won’t tho because then he would be absolving himself of the power shift given by congress because they don’t seem to want to manage the purse. You think he or anyone in that position is really giving up that power? Which is the congress’s power per the constitution. Putting the money as non earmarked (most is) in the executive branch hands basically leaves “we the people” without much recourse. Please seen Hein V FFR Supreme Court ruling of 2007.",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "author": "lokehfox",
                                                                            "body": "Right; under normal circumstances, you'd think the judicial branch would have something to say about this disruption in power dynamics - they just don't seem to care, and they haven't for the last many presidential terms; I do not understand why though - maybe they were just jealous that the legislative branch figured out a way to not have to do any work and wanted that for themselves",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "disenchantedsiren",
                                                                                    "body": "It honestly blows my mind when you go back over the years and look at how Supreme Court rulings or certain acts by congress have effectively diminished the constitution and a lot of our rights. I’m really not a conspiracy theorist but at some point you have to ask has this been a plan in action over the last 100 years or just happen stance that no matter who Republican or Democrat in charge loves to slowly chip away at the constitution and our rights. And it’s always with something that one side agrees (and doesn’t see how it effects us in other ways or longterm) with so you never get enough people to be up in arms about it.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "lokehfox",
                                                                                            "body": "I think it's just part of human nature to want someone else to make decisions so you don't have to; especially when they are hard decisions, and over the decades that has manifested in a gradual drift towards authoritarianism, and who better to be the ultimate decider for all such things than someone with no honor or sense of shame... Someone with so much self confidence they feel themselves infallible, despite mountains of evidence to the contrary.",
                                                                                            "score": 2,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "author": "datafromravens",
                                                                                    "body": "Courts can't do anything unless someone sues about it and has standing",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "author": "datafromravens",
                                                                            "body": "It's not ideal but at least we have someone in the white house who is giving up the power rather than expanding it. That's what cuts do. It takes away power from the executive branch",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "disenchantedsiren",
                                                                                    "body": "We can hope. The fund that are set as discretionary can be used by the executive branch how they see fit with in the departments they were appropriated too. So as long as it’s not used for other things, then I’ll agree. It’s a waiting game to see what comes of it. Any earmarked funds that are touched is a different story, and I assume so far they aren’t touching earmarked funds, but I don’t know it’s too much to follow.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "ShowMeTheCarFaux",
                    "body": "You know what's funny is I agree with the analogy just not that it will be catastrophic. I don't think the tower will fall per say just that the Democrats are just going to restack every piece once they're back and it will be the same shit rearranged",
                    "score": 3,
                    "replies": [
                        {
                            "author": "lokehfox",
                            "body": "Part of the problem here is that it shouldn't be the case that the president alone can yoyo the country so significantly, regardless of party.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "internal_logging",
                            "body": "I live near DC and its being projected this is going to mess up the local economy pretty bad.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "ShowMeTheCarFaux",
                                    "body": "Yeah well you're kind of in a catch 22 as a Libertarian in DC. It's like the one city that requires a bloated gov to have a good local economy.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "datafromravens",
                    "body": "Not possible to do it slowly though. They honestly have only two years to actually do anything and is likely the only real chance to reform to a slightly smaller government. The country isn't ready for entitlement cuts which is what ultimately will need to happen.",
                    "score": -1,
                    "replies": [
                        {
                            "author": "internal_logging",
                            "body": "Well if this could have been a bipartisan agreement they'd have more time",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "datafromravens",
                                    "body": "it's not and never will be. The majority of democrat voters want additional massive welfare programs added in addition.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "Away.  Congress (GOP members in particular) are complicit in this by abdicating their authority, likely out of fear of the looming threat of Musk financing primary challengers to those who step out of line, to the Executive Branch and creating a dangerous precedent (which they will find problematic the next time the Democrats have a unified government).",
            "score": 39,
            "replies": []
        },
        {
            "author": "narwi",
            "body": "technofeudalism is the direction us is moving in and \"feudal\" is in most aspects the opposite of anything libertarian or even just plain old liberal.",
            "score": 12,
            "replies": []
        },
        {
            "author": "IMicrowaveSteak",
            "body": "Didn’t he just propose a $4.5 trillion debt ceiling increase while cutting a few million here and there?",
            "score": 9,
            "replies": []
        },
        {
            "author": "jhaluska",
            "body": "Away.",
            "score": 39,
            "replies": []
        },
        {
            "author": "Lanky_Barnacle_1749",
            "body": "Trump adores Lincoln, americas greatest dictator who believed the ends justify the means like none ever before him, completely wrecking constitutionality in our govt.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Crumornus",
            "body": "Very much away.",
            "score": 27,
            "replies": []
        },
        {
            "author": "notaprotist",
            "body": "This guy is very obviously a textbook example of an actual fascist authoritarian to anyone not willfully blind.",
            "score": 12,
            "replies": [
                {
                    "author": "TheFortnutter",
                    "body": "fascism increases government, not decrease it, which is so far the entire point of his presidency... draining the swamp so to speak.\n\nadvocating for free speech and loosening gun control isnt fascist.\n\nwhile he isnt libertarian, you cant say hes a fascist. thats just asinine",
                    "score": -1,
                    "replies": [
                        {
                            "author": "rock_anon1",
                            "body": "Has he defended the free speech one anyone who has disagreed with him in any capacity?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "oldmanbawa",
            "body": "He isn’t more libertarian, he will just clear some wasteful spending (hopefully) and move what entity the shady funding flows through.(hopefully not, but I’m not holding my breath) None of these people are for the good of the common man or freedoms for everyone. I think one reason this transition looks so different is because it is at least on the surface a change in regime. Though nothing will come of it.",
            "score": 8,
            "replies": []
        },
        {
            "author": "yoemejay",
            "body": "Away. If there is no constitution then there are no libertarian ideas.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Kedulus",
            "body": "Toward",
            "score": 4,
            "replies": []
        },
        {
            "author": "jaron_bric",
            "body": "Those 200 (or however *many* it was) Executive Orders in his first 24 hours didn’t give you some idea",
            "score": 4,
            "replies": [
                {
                    "author": "aaron2610",
                    "body": "Explain the logic please",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok-Affect-3852",
            "body": "Trump isn’t ideologically libertarian, and much of his platform is a clear indication of that (tariffs, involvement in Israel, etc…)  That being said, there are some initiatives that do move us toward less government. I don’t think we could say that if Harris won.",
            "score": 11,
            "replies": []
        },
        {
            "author": "Sithlordandsavior",
            "body": "The pendulum swings sharply, only touching the center line on its way to one extreme or the other.",
            "score": 2,
            "replies": [
                {
                    "author": "None",
                    "body": "Why is the center desirable?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "infamousd6",
            "body": "Im loving this trump presidency its the most libertarian it can get!",
            "score": 2,
            "replies": [
                {
                    "author": "rock_anon1",
                    "body": "Executive overreach is the least libertarian thing in existence, he’s an authoritarian conservative",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "jankdangus",
            "body": "It’s mixed. I think what Trump is doing could dangerously lead to authoritarianism, but at the same time he is cutting waste, fraud, and abuse from the federal government which is something we have all wanted for the longest time now.",
            "score": 12,
            "replies": [
                {
                    "author": "zikol88",
                    "body": "For me, a decent amount of what he's doing is what I want. I just don't like the *reasons* he's doing them.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "jankdangus",
                            "body": "Agreed",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Living-Fill-8819",
                    "body": "My exact thoughts",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Gsomethepatient",
            "body": "Both? There definitely is and has been some authoritarian policies but there are also plenty of libertarian ones as well, I'm gonna hope for an overall more libertarian but it will probably be more authoritarian",
            "score": 5,
            "replies": []
        },
        {
            "author": "--alex1S--",
            "body": "I feel like all these audits are politically driven, with an intention to purge rather than fixing wrongs. Of course they will unearth fraud and massive mismanagement, but that’s just low hanging fruit. I believe the audits should be swift and close to accurate as possible and performed 1) by field experts and 2) by independent third parties. The way DOGE currently works, unveils some stuff which is bad but conveniently focusing on the Dems. Statistically speaking there should be at least one GOP member somewhere that has misused a napkin budget. \n\nOn the Fed front, they can audit all they want and will come out clean because the Fed’s financials are already being audited. Most probably though, Elon will start pushing the argument that it’s legal because of bad laws that are in place. To me, the worst part of all the last few weeks is the meddling with independent institutions. Elon entertained the idea that judges who dispute the EOs are going against the will of the people and should be fired. If the judicial and financial systems loose their independence, you can kiss American prosperity goodbye. Believe it or not the US is one of the most prosperous countries on earth.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ImportantPost6401",
            "body": "Towards, if the Federal Government becomes so weakened that states move in and fill the vacuum.\n\n\nAway, if the Federal Government retains power but simply does so with few checks on power.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Dependent_Intern4527",
            "body": "Away, not at all with the current presidents we had any at all have moved us towards freedom at all.",
            "score": 2,
            "replies": []
        },
        {
            "author": "gabrielsol",
            "body": "Picture this: giving tax dollars to NGOs who then fly in millions of citizens from other countries, and when they come in use tax dollars to house them in five star hotels, pay for their every need, give them free healthcare (something you don't do for your own citizens) and then give them debit cards for expenses.\n\nIf anyone here says the gop is further away than the Democrats your are blinded by partisan politics and are no libertarian.\n\nThe us gov is away already, but it's moving a lot closer with the gop than with the Democrats.",
            "score": 2,
            "replies": []
        },
        {
            "author": "JohnLu44",
            "body": "It's remaining constant. He paid libertarians lipservice similar to Reagan. All democrats since before Clinton are big-federal government.",
            "score": 2,
            "replies": []
        },
        {
            "author": "TerminallyUnique31",
            "body": "Ending wars, auditing the IRS, reducing scope and size of federal government, supporting states to decide what is best for them, individual liberty, pardoning Ross Ulbricht (then calling the judge “scum”!) are a few reasons why this is the most libertarian president in my lifetime.\n\nObviously this isn’t Ron Paul, but compared to the direction that some of the rest of the western world is heading in (jailing people for speech), I’ll take it.\n\nNow this whole talk about abolishing property tax or bringing Paul in to audit the fed would make my libertarian flag go from 6 to midnight.",
            "score": 2,
            "replies": [
                {
                    "author": "Dbl_Dees_Ranch",
                    "body": "why are you and actual libertarian takes being downvoted, is this board overran by progressives?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "rock_anon1",
                    "body": "It’s not exactly reducing scope of the federal government, it’s consolidating the government’s power to the executive branch\n\nBetween that, tariffs, and the crony \ngovernment deals for his buddies, he’s much more authoritarian",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Spicy_take",
            "body": "It’s a lateral move mostly",
            "score": 2,
            "replies": []
        },
        {
            "author": "fitnesswill",
            "body": "#Cons: \n\nExecutive Orders a-la-Obama's phone and pen to ram through the renamed \"Dream Act\"/GWB's signing statements/memorandums. (This is a big one)\n\nTariffs are obviously anti-free trade and anti-consumer.\n\n#Pros: \n\nDOGE slashing the budget and the federal workforce.\n\nAppointing Secretaries that are overtly hostile to the deepstate.\n\nNo new wars. (Fingers crossed)\n\nEliminating the Department of Education\n\nHopefully ending the Ukraine war.\n\nInvestigate the Fed, IRS, etc.\n\n#Mixed bag",
            "score": 2,
            "replies": [
                {
                    "author": "Living-Fill-8819",
                    "body": "Nice response",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Hello-DexterMorgan",
                    "body": "I agree with you on executive orders. But, to be fair, I also think that any libertarian move would really need to be done with the imperial presidency. The most corrupt and the most unpopular congress ever will never try to shrink the size of the government.\n\nI hate it, because anything good Trump does (but also anything bad he does as well) can be wiped out by the next president.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ptrn_l",
            "body": "Yes, but still better than whatever Kamala would do",
            "score": 1,
            "replies": []
        },
        {
            "author": "SynapticSignal",
            "body": "No Trumps libertarian policies are fake.\nSo far everything about fraud In government spending was a lie.\nHe is also anything but non interventionist since occupy Gaza might be the biggest nation building move in history.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SynapticSignal",
            "body": "I'm pretty sure declassifying the JFK assassination was just a distraction. They did it because the damage isn't enough to affect them for what they actually want to do.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DarthFluttershy_",
            "body": "Away, of course. Since the far left are also very authoritarian, some of his attacks on them might have peripheral effects, or else just look good, but broadly he's a new right authoritarian who is governing by fiat. \n\n\nThat said, if we get serious budget cuts and dismantling of the ingrained beurocracy, it would be a boon. No one else has managed it, because it's a crazy hard task under normal circumstances. I won't say the ends justify the means, but there is a possible scenario where coming out the other side of the chaos will make it seem ok... Though it's also possible it's all for show and to purge political opposition.",
            "score": 1,
            "replies": []
        },
        {
            "author": "timbernforge",
            "body": "Both",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheFortnutter",
            "body": "it certainly wasnt moving towards libertarian ideals during obama's 3rd or even the projected 4rth term.\n\nwhat the democrats were doing was going to be irreversible. at least trump is doing some \"libertarian\" policy, and the populist stuff can be just nullified with a new president in 4 years, with an america thats in better shape with a good at least functioning economy, and some sound libertarian policy that started reaching the masses (further libertarian x republican coalition-ing?)",
            "score": 1,
            "replies": []
        },
        {
            "author": "djentropyhardcore",
            "body": "Obviously towards.  He's cutting government by 90% and eliminating unfair trade with other nations.",
            "score": 1,
            "replies": [
                {
                    "author": "taysbeans",
                    "body": "He’s cutting lots of programs but just centralizing them to the executive. \nThey aren’t cut so much as moved to just one branch . \n\nI don’t think it’s so much libertarianism as dictatorship .",
                    "score": 1,
                    "replies": [
                        {
                            "author": "djentropyhardcore",
                            "body": "They already are in the executive.  The United States only has three branches of government.  It's obvious that you're not American.  This is basic American government 101.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "StealUr_Face",
            "body": "You’ll get an unbiased answer on Reddit that’s for sure",
            "score": 1,
            "replies": []
        },
        {
            "author": "Scrumpledee",
            "body": "Away.  \n/discussed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "michaelcraft_yt",
            "body": "While he is going against bureaucracy and waste, he is against free trade, he is a protectionist and has a huge problem with immigration that seems excessive (even though it is true that the border is a mess deporting people whose only \"crime\" is migration is idiotic) so I think he's doing more against than he is going towards liberty.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Independent-Tutor-53",
            "body": "i think so far, we've gotten more than we could have hoped for",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok_Relationship2871",
            "body": "Away from with this recent executive order.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mackattack-77",
            "body": "A sitting president has in the last month said,\n\n\n\"He who saves his country does not violate the law.\"\n\n\nAnd signed an executive order that allows only him and the attorney general to interpret the law.\n\n\nYeah he's pushing us further from libertarian ideals",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tracieattimes",
            "body": "Yes.  He’s moving closer by cutting the amount of government. In the huge flurry of executive orders, you might have missed that he has mandated that for every new regulation proposed, a regulatory body has to bring him 10 regulations to be deleted. In his first term that number was two.\n\nThough sone here will disagree with me I think the immigration thing is also moving closer to libertarian ideals because the United States happens to shower welfare on poor folks, and is doubling tripling, quadrupling, etc., down on this with the current crop of immigrants.\n\nTo me, his most anti-libertarian actions have to do with the way that he is accomplishing all of this. Over the last 50 years or so the American Congress has concentrated more and more power in the hands of the executive branch. And Trump is using that to his full advantage in accomplishing his agenda. In my mind, a libertarian stance would be to return power to the Congress so as to ensure the separation of powers that the constitution specifies. But this one is complicated because a lot of that executive branch power comes through regulatory agencies, and as I said before Trump is cutting their power by cutting the number of regulations.\n\nI’m sure I have missed some things in here, and I’d love to see other people‘s comments. But I think on balance Mr. Trump is moving closer to libertarianism, but using some democratic means to do so.",
            "score": 1,
            "replies": [
                {
                    "author": "narwi",
                    "body": "as longs as your libertarianism does not contain any actual liberties ...",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Tracieattimes",
                            "body": "Maybe you could explain your razor like point?",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "soggyGreyDuck",
            "body": "Closer but still so far away",
            "score": -4,
            "replies": []
        },
        {
            "author": "PM_ME_DNA",
            "body": "It’s moving less fast away from libertarianism than under a Biden or Harris regime.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Narrow-Ad6201",
            "body": "why are you asking this sub? its mostly just a bunch of leftests and liberals who cry about elon and the trump administration.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fun_Assignment_5637",
            "body": "I think that with Elon Musk, we are moving towards government efficiency, cutting the fat, cutting needless government agencies, removing excessive regulation, this is towards libertarianism.",
            "score": -5,
            "replies": [
                {
                    "author": "TheFortnutter",
                    "body": "but with everything else, it becomes a mixed bag. increasing tariffs and general protectionism isnt libertarian at all. he couldve done a milei but he didnt.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Practical_Advice2376",
            "body": "I'll go against the grain here and say towards, because we're shredding bureaucracy, hopefully lowering debt and reducing the size of government.\n\nI think what people are missing on this thread is that Libertarianism can happen under any style of government. Executive branch having too much power isn't against Libertarianism if the power is being used to increase personal freedoms.\n\nIf Trump becomes a dictator, and as a dictator, taxes away all taxes, positive rights, laws against negative rights, and most government departments, that is still Libertarianism!\n\n\\*\\*\\*\\*\\*Edit: Instead of downvoting me, please, tell me why I'm wrong. I am saying this because I want to hear the counter argument. I am not someone who doesn't change their mind.",
            "score": -5,
            "replies": [
                {
                    "author": "None",
                    "body": "I appreciate the sentiment but I think you’re discounting the positive vs negative rights arguments within libertarianism. \n\nAlso, the idea that individual freedoms are protected from arbitrary interference by the state is a core tenet of libertarian philosophy. Does it not feel as though Trump’s cabinet is arbitrarily enacting policy and picking and choosing which freedoms are protected from State coercion and force?\n\nEdit - I didn’t downvote you because I, too, look for perspective. Here’s your upvote homie",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Gsomethepatient",
                    "body": "That's my view also, like dictatorships aren't necessarily bad, but there comes with the risks that it will turn out horribly bad",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "FilterBubbles",
            "body": "Most everything has been towards. I'm fairly sure those responding are just anti-Trump.",
            "score": 0,
            "replies": []
        },
        {
            "author": "eico3",
            "body": "Obviously the bots are saying away.\n\nTrump isn’t a libertarian, but cutting waste and fraud from a system that steals from me is without a doubt moving us towards. \n\nGetting rid of DEI crap and more toward a meritocracy is clearly towards. \n\nCutting our taxes, because taxation is theft, is towards. \n\nAppointing RFK jr, who is a strong advocate for TRUE informed consent is moving us toward. \n\nI don’t see how anyone could say he’s moving us away. He’s not milei, but he’s not a bush or an Obama either.",
            "score": -8,
            "replies": [
                {
                    "author": "rediKELous",
                    "body": "Well they’re looking at tax cuts for the megawealthy estimated to cost the rest of the taxpayers at least $4T. That’s on top of cutting the legs out of tons of programs. So somehow we’re spending less on the masses, but needing the masses to pay more. Personally I’d prefer government bloat over straight up theft.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "eico3",
                            "body": "It’s an extension of the previous Trump tax cuts. I paid less under Trump than under Biden. It’s a tax cut for everyone, and that’s a good thing.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "eico3",
                                    "body": "I paid about 1,200 less under trump than Biden with the same financial situation.  It was nice",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "disenchantedsiren",
                                            "body": "You do realize we are under the same tax plan that was enacted under Trumps 1st term. It expires this year. Unless you have corporate taxes nothing really changed under Biden lol. Don’t believe me… look it up.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "eico3",
                                                    "body": "Tell that to my taxes. \n\nI’m honestly kind of sick of liberals coming in acting like I don’t know what happened with my own money, pretending like they know the laws better than I know my bills. \n\nIdk what to tell ya, there was literally a whole thread on the Reddit front page a year or 2 ago from poverty finance filled with people complaining that their taxes went up drastically, and they expected a refund but were screwed because now they owed money. Your knowledge of laws doesn’t change reality.",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "author": "disenchantedsiren",
                                                            "body": "1. I’m not liberal \n2. Facts don’t care about your feelings\n3. All of that can have happened but it still doesn’t change that fact that it’s been Trumps tax plan since his first term. It literally expires this year in 2025. Just because people owed money doesn’t mean it wasn’t Trumps plan from his first term. It’s public knowledge. \n\nBut here for your convenience, since you clearly didn’t look it up:\n\nOn the Very 1st page: \n\nSubtitle A—Individual Tax Reform\nPART I—TAX RATE REFORM\nSEC. 11001. MODIFICATION OF RATES.\n(a) IN GENERAL.—Section 1 is amended by adding at the end\nthe following new subsection:\n‘‘(j) MODIFICATIONS FOR TAXABLE YEARS 2018 THROUGH 2025.—\n‘‘(1) IN GENERAL.—In the case of a taxable year beginning\nafter December 31, 2017, and before January 1, 2026\n\nhttps://www.congress.gov/115/bills/hr1/BILLS-115hr1enr.pdf",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "author": "eico3",
                                                                    "body": "Oh I understand that it was trumps tax plan. He expected to win in 2020 and extend it (as evidenced by that’s what he’s doing right now). \n\nBiden didn’t. He could have. He could have made his own tax cut for just the middle class, he didn’t. He let us pay more. Trump is helping me.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "disenchantedsiren",
                                                                            "body": "“Biden didn’t change Trumps plan, which I paid more taxes under, so now Trump needs to fix his own plan to help me?” Make that make sense. \n\nSide bar you know it’s congress who actually writes and approves these, the sitting president just makes “suggestions” and signs off. Plus they weren’t going to all come together to change a tax code that doesn’t expire until the end of 2025.\n\nAlso if he would have won in 2020, this would be the same tax plan that entire presidency as this DOES NOT EXPIRE UNTIL THE END OF 2025. It would have been whoever would have won in 2024 making that plan when it expires if Trump did 2 consecutive terms.",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "eico3",
                                                                                    "body": "Well guess what smart guy, Trump did it. Trump is doing it again. Whatever whatever congress has to pass it. Ok cool. Trump got it through congress and will again. \n\nBiden sat there knowing there was a plan to extend them and give middle class Americans a break, he chose not to ask congress. He chose to let the existing plan run its course with escalating higher payments for middle class. \n\nSay whatever you want, Biden could have encouraged cutting taxes for middle class Americans, it might have helped democrats in the election if it had seemed like they cared. But they didn’t. They gave money to Ukraine and told Americans we were lucky to be in such an amazing economy. \n\nWe all remembered. Stop playing these ‘oh you know it’s blah blah.’ Trump pushed for tax cuts. My taxes weee lower. Biden did not. My taxes were higher.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "disenchantedsiren",
                                                                                            "body": "I feel like you need to take some classes on how the government works. Learn the 3 branches and what each branch actually has the power to do, you know per constitution, the foundation of this country. \n\nYou expected a dementia patient to cut your taxes, something you are crying that Trump did not do? You expected a dementia patient to fix what Trump messed up? A dementia patient really? lol \n\nYou sound more like a liberal having expected a dementia patient to try to persuade congress to do anything. \n\nThe fact that you expected a dementia patient to do anything is mind boggling. But that’s how a typical liberal who only voted against their party for the first time would act.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "author": "eico3",
                                                                                                    "body": "Mmmk you’re all over the place",
                                                                                                    "score": 1,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "xxdoba1",
                                                            "body": "I don’t care what you think about liberals. I’m here to talk about money. There was phase out on Trump’s tax cuts that was specifically targeted at the middle class. This is not the type of discussion you want to get into but Trump is the person that raised your taxes not Joe Biden and unfortunately you seem like a sheep and don’t know anything.",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "yosh1don",
            "body": "This thread is full of liberals, not libertarians",
            "score": -2,
            "replies": [
                {
                    "author": "mainlydank",
                    "body": "I dunno about that.  \n\nI don't really know where I belong anymore.  I really want a way smaller federal government and no drug or gun laws,  However I think we need some sort of single payer healthcare or medicare for all.  Post Secondary education should also be paid for by the government pending you can keep up good grades.  Huge cuts in Military budget would be great, with the exception of existing Veteran services, those should be expanded.  No more proxy wars or wars where we are not in obvious direct harm if we don't take action.  \n\nI'm fine with a lot of basic social services too, although not so much for immigrants.  They should be required to be able to provide for themselves via a job or whatever like most people are required if they want to immigrate to a modern first world country.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Uncle_Chael",
                            "body": "\"Free\" healthcare and \"free\" education is not libertarian; however, if bloat was cut, the United States could offer those things and still tax less.\n\nIm in favor of trading bloat for something useful and well-managed - in the envent that I dont have the choice to lower the tax burden by cutting that spending all togeather.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "TheFortnutter",
                            "body": "privatized healthcare is cheap, same as fraternal society healthcare,\n\nhere: [https://www.youtube.com/watch?v=aDE1Yvzsdxs&pp=ygUgZnJhdGVybmFsIGNvbW11bml0aWVzIG1lbnRpc3dhdmU%3D](https://www.youtube.com/watch?v=aDE1Yvzsdxs&pp=ygUgZnJhdGVybmFsIGNvbW11bml0aWVzIG1lbnRpc3dhdmU%3D)\n\nmutual aid existed for a long time and worked really well, so well in fact that doctors lobbied the government to nationalize healthcare under FDR. they were the same people claiming free healthcare was good",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Shade_008",
            "body": "Cutting away the federal agencies and funding that consistently puts the federal government (unconstitutionally) in your every day life is *the* libertarian wet dream. Anyone who is against this notion is just mad about Trump. \n\nMany of the EOs (if not all) directly impact control the executive head has over the executive branch, which news flash guys, is absolute per the vesting clause. We should be more upset at the erosions of our reserved rights/freedoms (or those of the States we live in) that have been swept away under the Fed (by Congress since they're the law making body) without anyone expressly giving power to them for it.",
            "score": 0,
            "replies": []
        },
        {
            "author": "John2H",
            "body": "Towards. \n\nTrump is the first fascist to shrink government spending and waste. He has been notoriously anti-war throughout his entire first term. \n\nHis only authoritarian leaning is about guns which, while red flag laws SUCK a national reciprocity push is roughly on the same level in the positive direction.",
            "score": -3,
            "replies": []
        },
        {
            "author": "RickySlayer9",
            "body": "By words? Away.\n\nBy actions? Towards",
            "score": 0,
            "replies": []
        },
        {
            "author": "White_C4",
            "body": "Some things that libertarians have been asking for decades is showing up during Trump's 2nd term. Trump wants to abolish the Department of Education, Trump wants to remove income tax (although you can debate the other tax alternatives he is proposing), Trump is finally the first president in a long time to start downsizing the government agencies at a massive scale.\n\nThis is not to say Trump is pro-libertarian, he's not. He's a moderate conservative who still wants to protect some big government spending like entitlement programs, use tariffs as an American protectionist policy, and still have some influence over some areas like Gaza.\n\nDespite all that, Trump is the first president in 100 years to go toe and toe against the corrupt bureaucracy of the federal government. That has to count for something. Even if he can't dismantle the bureaucracy at a large scale, at least he will get the ball rolling because the anti-bureaucracy crowd is getting larger in the Republican party.\n\nMomentum matters. Libertarians can't get everything they want, but they can at least recognize the larger push for less bureaucracy.",
            "score": 0,
            "replies": []
        }
    ]
}