{
    "title": "Pentagon in the crosshairs of Doge! Massive cuts expected to agency that has never passed an audit.",
    "author": "libertyseer",
    "subreddit": "Libertarian",
    "rank": 187,
    "score": 47,
    "upvote_ratio": 0.78,
    "num_comments (reported by reddit)": 12,
    "url": "https://www.youtube.com/watch?v=9ssFpVeIuoI",
    "id": "1iv8m9g",
    "selftext": "",
    "comments": [
        {
            "author": "Longjumping_Milk_",
            "body": "I had a Small smudge on my phone screen that made the \" P\" in Pentagon look like an \"f\" and read it as fentagon and I thought to myself.....\"damn it was the Pentagon pushing fentanyl all this time?, you bastards\". I wouldn't be surprised if it were true though.",
            "score": 7,
            "replies": [
                {
                    "author": "Eleminohpe",
                    "body": "Is this where conspiracy theories really come from?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "thermobear",
                            "body": "Dyslexia?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "alurbase",
            "body": "It better be a triangle when they’re done!",
            "score": 6,
            "replies": []
        },
        {
            "author": "MedicMalfunction",
            "body": "Channeling my inner Ron Swanson… slash it!",
            "score": 12,
            "replies": []
        },
        {
            "author": "zugi",
            "body": "Earlier Trump was talking about increasing military funding.\n\nThen he came out with a shocking \"cut military 50%\" statement.\n\nNow he's looking for 8% cuts per year over the next 5 years. And he's identified some specific big-ticket items: evidently a big effort to \"modernize the nuclear stockpile\" was going to cost hundreds of billions of dollars, so he now wants to negotiate nuclear arms cuts with Russia and China to save everyone a bunch of money.\n\nTrump is all over the place on this, but seems to be settling in towards some actually military cuts, which at least is a step in the right direction. We'll see...",
            "score": 5,
            "replies": []
        },
        {
            "author": "Okramthegreat",
            "body": "If they take an axe to defence spending I will be very impressed.",
            "score": 3,
            "replies": []
        },
        {
            "author": "jahwls",
            "body": "I don’t believe this at all but if it’s true great. Should’ve started with it. Out largest discretionary spending source. And also what’s the point of all the money if we can’t win any wars anyways.",
            "score": 8,
            "replies": [
                {
                    "author": "B1G_Fan",
                    "body": "Agreed.\n\nThe military industrial complex is very clever to put jobs in as many congressional districts as possible to prevent wasteful defense spending from being phased out. That way, if a member of congress decides that we don't need another defense budget boondoggle, that member of congress can be voted out due to loss of jobs.\n\nI'll believe Trump and Musk are willing to shrink the defense budget when I see it. But, I'm all for being wrong.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "WanderingPulsar",
            "body": "Fuck em up raw and hard boiii",
            "score": 1,
            "replies": []
        },
        {
            "author": "halfageplus7",
            "body": "I'm no fan of the MAGA movement, but he keeps surprising me with apparent action.  We'll see if it:\n\nActually results in a budget deficit reduction.  Keep the $5k checks.\n\nIt is a distraction from actually taxing billionaires and other business entities.\n\nCall me doubtful (I'd love to be wrong).",
            "score": 1,
            "replies": []
        }
    ]
}