{
    "title": "Should the Government Seek Royalties on Government Funded Research?",
    "author": "hawktherapper",
    "subreddit": "Libertarian",
    "rank": 164,
    "score": 13,
    "upvote_ratio": 0.69,
    "num_comments (reported by reddit)": 31,
    "url": "https://www.reddit.com/r/Libertarian/comments/1iwd16a/should_the_government_seek_royalties_on/",
    "id": "1iwd16a",
    "selftext": "I'm curious about your thoughts on government funding for research like COVID-19 vaccines and SpaceX rockets without requiring ongoing royalty agreements, assuming the government continues funding projects with public benefit under a Keynesian approach (which I know is contentious, but assuming that doesn't change). Taxpayers fund the initial research, but companies keep most profits from the resulting products. For example, Moderna received $1.5 billion in government support, made over $36 billion in vaccine sales, and paid a $400 million one-time fee with some ongoing royalties. SpaceX got over $5.5 billion in contracts, with no clear share in commercial launch profits. Is this fair? Does it distort the market? Should the government seek more royalties?",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "**New to libertarianism or have questions and want to learn more?** Be sure to check out [the sub Frequently Asked Questions](/r/Libertarian/wiki/faq) and [the massive /r/libertarian information WIKI](/r/Libertarian/wiki/index) from the sidebar, for lots of info and free resources, links, books, videos, and answers to common questions and topics. Want to know if you are a Libertarian?  [Take the worlds shortest political quiz and find out!](http://www.theadvocates.org/)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "ikonoqlast",
            "body": "No.  We already paid for it once.\n\nNote that governments role is to provide public goods- stuff that benefits everyone but that don't benefit any one person enough for them to buy it themselves.  Police, fire, national defense, etc.  \n\nSo some government research is appropriate.  The space program isn't profitable in and of itself but as an advertisement for the capability of american science and technology it does benefit the nation by increasing demand for our stuff.  We can do this thing no one else can because we're just better...",
            "score": 31,
            "replies": [
                {
                    "author": "AdrienJarretier",
                    "body": "the gouvernement doesn't provide anything without exotorting it from someone.\n\n\nif there is a government, it's only legitimate role is to protect private property. fire departments are certainly not included, neither is scientific research.",
                    "score": -10,
                    "replies": [
                        {
                            "author": "ikonoqlast",
                            "body": "No, governments role is public goods.  \n\nBtw, protect private property?  That's literally what fire departments DO...",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "AdrienJarretier",
                                    "body": "Why do you lie like that ? Why do you pretend to know anything here ?\n\nYou've never read and understood anything from any libertarian, if you had you'd know \"protect private property\" is a shortcut way fo saying \"protect people's private property from other people trying to infringe on it / steal it\"\n\nAny form of insurance against natural disasters, fires included, isn't part of it.\n\nNature is violent cruel, shit happens, fire, flood, earthquakes. Other people don't have to be forced to pay at gun point to protect your home from nature. That's why you have in the US some people rebuilding their beach house 40 times at taxpayers expense, because assholes like you think it's the government' role to insure people's home.",
                                    "score": -10,
                                    "replies": [
                                        {
                                            "author": "ikonoqlast",
                                            "body": "Guffaw.  I have a PhD in public policy analysis.  You seem to be a teenager so I'm pretty sure I've been a libertarian literally longer than you've been alive.",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "author": "AdrienJarretier",
                                                    "body": "The lies just keep coming... \"I have 4 phds and you're  a kid\" is really an original counter argument.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "jahwls",
            "body": "They already do.",
            "score": 2,
            "replies": []
        },
        {
            "author": "seobrien",
            "body": "If it is, it should be made public domain.  But technically, it should not be funding research.",
            "score": 4,
            "replies": []
        },
        {
            "author": "papajohn56",
            "body": "They already get it in taxes from these companies",
            "score": 3,
            "replies": []
        },
        {
            "author": "RedBlue5665",
            "body": "Government should not fund private research.",
            "score": 1,
            "replies": [
                {
                    "author": "villainoust",
                    "body": "Do you think government should not be funding any research? Or do you just mean government shouldn't be paying for research at a private entity or paying for its own research and then giving it to private industry?",
                    "score": 10,
                    "replies": [
                        {
                            "author": "RedBlue5665",
                            "body": "Zero government funding for research of any kind.",
                            "score": -5,
                            "replies": [
                                {
                                    "author": "TheWestWolf78",
                                    "body": "Manhattan Project, the Internet, and GPS spring to mind. We can debate the philosophical purity of it, but the world is much shittier with zero government research.",
                                    "score": 22,
                                    "replies": [
                                        {
                                            "author": "Consistent-Dream-873",
                                            "body": "GPS is only real argument The internet will exist without the government easily.... And the Manhattan project brought us nukes how could you say with a straight face that it's better for humanity that we have nukes.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "author": "Lopsided_Ad3516",
                                                    "body": "I mean….the last war without them killed how many? We now have a (dangerous) deterrent. \n\nSo it’s either deaths in the tens of millions, or MAD and uh…hope we don’t have some lunatics in charge of….fuck.",
                                                    "score": 4,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "TheBannedLibertarian",
                                                    "body": "I don’t think the argument is that these things wouldn’t exist without the government. \n\nThe bigger question is if the US would have still been the first to do these things. What if the Soviets created the nuke first? What if China created the internet. Would we even be having this conversation?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Wizard_bonk",
                                            "body": "The government actively hampered the growth and adoption of the internet. Up until the 80s it was ILLEGAL for commonfolk to interconnect with university computers and whatnot. GPS. Could easily be privately funded given the sheer number of sectors that use it(banking is a big one) and the network wouldnt be suffering from massive spending on satellites. GPS being \"free\"(payed for by the US taxpayer) is the only part that makes it debatable if a private solution would be better since the access would be lessened.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "author": "Consistent-Dream-873",
                                            "body": "If it's not profitable that means nobody is willing to pay for it which means it's not  a consensual transaction and we don't want it",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Mastiffmory",
                                    "body": "How’s that sand taste?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "audioeptesicus",
                    "body": "Yup. Their \"funding\" is money stolen from you and your neighbors by force. Stop doing that.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "DarthFluttershy_",
            "body": "Ok obviously everyone is saying to stay out of research, which is correct but not happening. To deal with your particular question assuming the government will continue finding research, the problem is that this would ultimately incentivize the government to push competition out, which will add even more barriers to private enterprise and benefitting companies that have the closest relationships with government. That happens already, but it will get worse. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "zugi",
            "body": "Government should not fund research.\n\n\nBut if it does, it does so with money expropriated from taxpayers, and the results should go into the public domain so anyone can use them.\n\n\nThe whole rationalization for so-called \"intellectual property\" (copyrights and patents) is that people won't invest their efforts and capital into developing stuff without the guarantee of a government-granted monopoly to help them profit from that investment. When government funds these things, it's not taking any risk, so granting them patents and copyrights would be absurd.",
            "score": 1,
            "replies": []
        },
        {
            "author": "crackedoak",
            "body": "No. If the government is latched on to something like fusion, deep freeze hibernation, or some super transformative new technology, it gets released into public domain. If businesses want to make the item or produce the technology, they cannot claim it as their own.This forces businesses to lower costs by producing far more efficiently which benefits everyone.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ThatOtherGuyTPM",
            "body": "No.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ginga__",
            "body": "We should not be paying for research in the first place.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Practical_Advice2376",
            "body": "Wrong question. The right question is: Should the Government fund research? And the answer is \"No.\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Grand-Expression-783",
            "body": "There shouldn't be government-funded research.",
            "score": 1,
            "replies": [
                {
                    "author": "Rollercoasterfixerer",
                    "body": "Absolutely insane this take would get downvoted in a “libertarian” sub.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}