{
    "title": "The Myth Of Democracy",
    "author": "UnicornyOnTheCob",
    "subreddit": "Libertarian",
    "rank": 160,
    "score": 0,
    "upvote_ratio": 0.39,
    "num_comments (reported by reddit)": 1,
    "url": "https://www.reddit.com/r/Libertarian/comments/1ixe8na/the_myth_of_democracy/",
    "id": "1ixe8na",
    "selftext": "Why Elections and Centralized Power Don't Work for Us\n\nWe've all been taught that America is a democracy, but let’s be real – it’s not. The U.S. is a representative republic. That means we elect people to represent us, but do they really? Or is that just something we’re told to keep us quiet while a small group of elites keep running the show?\n\nElections Aren't What They Seem\n\nThink about it: can you personally verify the results of an election? With all the technology in place, there’s still no way for you to confirm that your vote counted the way it should. It’s all on faith. We’re trusting that those in charge are doing their job honestly, but who’s really watching them? If you can’t check the results yourself, then it’s not fact—it’s faith. And when the system’s that out of our hands, it opens the door for all sorts of manipulation.\n\nMisrepresentation: Who Are They Really Working For?\n\nHere’s a hard truth: representatives don’t always vote the way their constituents want. Research shows that, in many cases, politicians vote against the will of the people they’re supposed to represent. In fact, they’re aligned with what their donors or other interests want about 35% of the time. So, if they’re not really serving us, who are they working for?\n\nThe Power and Wealth Keep Concentrating\n\nNo matter who gets elected, one thing remains the same: wealth and power keep getting stacked in the hands of fewer people. The richest families control almost all of the wealth, and that power affects policies that shape our lives. Elections don’t change that. The system keeps grinding along, putting the interests of the wealthy over the needs of everyone else.\n\nCentralized Power: A Cult of Control\n\nHere’s where it gets tricky. The U.S. operates under a centralized hierarchy. This means that power is concentrated at the top, and only a few people get to call the shots for millions. It’s like a cult. In a cult, you don’t ask what the believer will believe next – you just start breaking them free from the control that’s been put on them. The belief in centralized power is similar. We’ve been taught to think it’s necessary, benevolent, and inevitable, but it’s just a way to keep us stuck.\n\nThe truth is, centralized power doesn’t have to exist. It’s not natural, it’s not inevitable, and it’s certainly not benevolent. What we need is to break free from the cult of centralized power and return to an egalitarian system where every voice matters equally.\n\nWhat’s the Answer?\n\nI won’t pretend to have all the answers. I don’t have a perfect blueprint for a new system. But that’s the point: more people need to help figure this out. We have to start thinking about solutions, and that means breaking out of the mindset that we need centralized power to make things work. It’s been fed to us like we have no other choice, but we do.\n\nWe need to question everything we’ve been taught. The first step is breaking the spell of centralized hierarchies. Once we start seeing that they’re not the solution, we can begin imagining something better.\n\nIf you feel like this resonates with you, share this message. Let’s help deprogram others and get people talking about what real change could look like. We need your help to figure this out. Let’s start the conversation and work together to find a way out of this mess.\n\n\nStudy: Politicians Vote Against the Will of Their Constituents 35 Percent of the Time\n\nhttps://www.promarket.org/2017/06/16/study-politicians-vote-will-constituents-35-percent-time/\n\nAmericans don't think they have the ear of elected officials\n\nhttps://news.stanford.edu/stories/2018/02/americans-dont-think-ear-elected-officials\n\nMost in US say elected officials don't care what they think\n\nhttps://www.pewresearch.org/short-reads/2024/04/30/more-than-80-of-americans-believe-elected-officials-dont-care-what-people-like-them-think/\n\nEvaluations of members of Congress and the biggest problem with elected officials today\n\nhttps://www.pewresearch.org/politics/2023/09/19/evaluations-of-members-of-congress-and-the-biggest-problem-with-elected-officials-today/\n\nDo our Elected Officials really Represent Us?\n\nhttps://pols.sites.haverford.edu/studentvoices/do-our-elected-officials-really-represent-us/\n\nWealth, Income, and Power\n\nhttps://whorulesamerica.ucsc.edu/power/wealth.html\n\nTaxing the Superrich\n\nhttps://www.bostonreview.net/forum/gabriel-zucman-taxing-superrich/\n\nThe Gilded Age Never Ended\n\nhttps://www.newyorker.com/magazine/2025/03/03/the-gilded-age-never-ended\n\nTrends in Income and Wealth Inequality\n\nhttps://www.pewresearch.org/social-trends/2020/01/09/trends-in-income-and-wealth-inequality/\n\nA Guide to Statistics on Historical Trends in Income Inequality\n\nhttps://www.cbpp.org/research/poverty-and-inequality/a-guide-to-statistics-on-historical-trends-in-income-inequality\n\nHow has wealth distribution in the US changed over time?\n\nhttps://usafacts.org/articles/how-has-wealth-distribution-in-the-us-changed-over-time/\n\nWealth Inequality in America over Time: Key Statistics\n\nhttps://www.stlouisfed.org/open-vault/2020/december/has-wealth-inequality-changed-over-time-key-statistics\n\nNine Charts about Wealth Inequality in America\n\nhttps://apps.urban.org/features/wealth-inequality-charts/\n\nWealth concentration levels and growth: 1989-2016\n\nhttps://www.federalreserve.gov/econres/notes/feds-notes/wealth-concentration-levels-and-growth-1989-2016-20200220.html\n\nUPVOTE if you LIKE this post. * DOWNVOTE if you LOVE this post. * BLOCK ME if you HATE this post.",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Democracy is tyranny of the majority. Read Hoppes [Democracy: The God That Failed](https://www.riosmauricio.com/wp-content/uploads/2013/04/Hoppe_Democracy_The_God_That_Failed.pdf), or other works by libertarians such as [Rothbard](https://mises.org/library/book/anatomy-state), [Spooner](https://oll-resources.s3.us-east-2.amazonaws.com/oll3/store/titles/2194/Spooner_1485_Bk.pdf), or [Hoppe](https://www.youtube.com/watch?v=qrl8YorTa1U) to learn about why so many libertarians [oppose democracy](https://www.youtube.com/watch?v=qrl8YorTa1U). Also check out r/EndDemocracy\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Libertarian) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        }
    ]
}