{
    "title": "Progressives be like",
    "author": "EndDemocracy1",
    "subreddit": "Libertarian",
    "rank": 80,
    "score": 373,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 26,
    "url": "https://i.redd.it/z4be450scqle1.jpeg",
    "id": "1iznnt3",
    "selftext": "",
    "comments": [
        {
            "author": "Party-Pizza-2071",
            "body": "I know! Why would you trust the government again knowing how corrupt it is?",
            "score": 22,
            "replies": [
                {
                    "author": "NewPerfection",
                    "body": "Because *my* side isn't corrupt like *their* side is. ",
                    "score": 37,
                    "replies": []
                }
            ]
        },
        {
            "author": "LocalNobody117",
            "body": "I love these memes",
            "score": 8,
            "replies": []
        },
        {
            "author": "jankdangus",
            "body": "I think the counterargument that progressives make is that it’s the uniparty who loss our trust in the first place. They were the ones who allowed big corporations and the swamp to get in bed with them and pass legislation that rig the system to their benefit. So a bigger socialist government would only work once it earns our trust back. \n\nTyranny of government is bad, but is tyranny of corporations any better? Should there be no check and balances for one corporation gaining too much market share by merging with their competition? So like all things it’s definitely a balancing act.",
            "score": 15,
            "replies": [
                {
                    "author": "Crazycrazyparrot",
                    "body": "Corporations can only run the game if there is power to buy. Take away that power and you level the playing field. Corporations are greedy animals just like governments. They'll try to gain the upper hand over their competition at any means possible. This is how you get lobbyist trying to sway politicians. If you take away power from the politician then you take away the interest these corporations have to sway them. \n\nSocialist answer to this is for the \"right people\" to gain power. An uncorruptable entity that has the power to make the utopia but is also benevolent enough to resist temptations of special interest. They're essentially looking for government Jesus.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "jankdangus",
                            "body": "I agree with a lot of what you are saying, but without some government, I still do worry about one corporation making the free market less free not more.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Crazycrazyparrot",
                                    "body": "El liberalismo es el respeto irrestricto del proyecto de vida del prójimo, basado en el principio de no agresión y en defensa del derecho a la vida, a la libertad y a la propiedad\"\n\nJavier Milei has quoted  this from Alberto Benegas Lynch son. Referring to him as the greatest hero of the ideas of freedom. It means:\n\nLiberalism is the unrestricted respect for the life plan of others, based on the principle of non-aggression and in defense of the right to life, liberty and property.\n\nWhen government is reduced to this level and this level alone it's impossible for the birth of an overpowering corporation. The game today isn't being played fairly. The fact the US has the biggest and most powerful bureaucracy in history and that corporations like BlackRock exist isn't a coincidence.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Behemoth92",
                    "body": "I understand you are just the messenger but what does a tyranny of corporations look like? What kind of coercion are we talking about here? Or is it just economics being characterized as a zero sum game like they always do?",
                    "score": 7,
                    "replies": [
                        {
                            "author": "jankdangus",
                            "body": "Tyranny of corporations is like what we have with military industrial complex and big pharma. Patents create natural monopolies and those big defense contracts were for some reason allowed to merge with smaller defense contractors. I think there used to be 50+ defense contractors and they all got eaten up.\n\nDo you not believe in anti-trust laws? Isn’t it dangerous if very few corporations are allowed to charge any price they damn please because they control large market share. This is the problem with anarchy, the first thing a corporation will do is make the free market less free not more. Corporations don’t operate with a moral compass, they want to accumulate more power and money and expand operations for themselves. Look at how “woke” corporations flip the switch on LGBTQ+ support when it ended up being inconvenient for them because of the cultural shift.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "LegAdventurous3165",
                                    "body": "Yes, corporations use the government to defeat their enemies.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "jankdangus",
                                            "body": "Yeah, but a strong limited government is necessary. Some government regulations are needed to protect the free market. Government is the only entity that has the power to challenge large corporations.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "LegAdventurous3165",
                                                    "body": "Government is the only entity with the power to allow the creation of corporations",
                                                    "score": 7,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "Behemoth92",
                                    "body": "I think what you’re talking about is communist propaganda. Economics isn’t a zero sum game. Monopolies form but are supplanted eventually. Monopolies only last as long as the government supports them. I don’t see any example to say otherwise. Regulationism is literally why only large companies can thrive. Also as long as you have your private property and are able to offer your labor freely you’ll most definitely have your needs met.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "jankdangus",
                                            "body": "Yeah, I’m usually oppose to regulations, but it’s true that some regulations do help protect the free market. Yes, regulations by the government can create monopolies, but it’s also true that allowing corporations to accumulate more market share also create monopolies. It’s a balancing act. \n\nThe reason why we have government in the first place is because not everyone needs actually get met. We have a mixed economy, so we don’t disenfranchise low-income families. Social safety nets are there to help people at bottom join the middle class or aim even higher. We used to have a privatized fire department and while your house might be safe with fire insurance, the neighbor house would burn down.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "Behemoth92",
                                                    "body": "Yeah no thanks on the social safety nets. I’m fine with very very basic public works like fire, police, roads etc. nothing more. I think consent is very important in society. I don’t think you are a libertarian and that’s fine, you value maximizing marginal utility over someone’s right to consent but that’s not who I am or who this sub is. Just pointing it out.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "jankdangus",
                                                            "body": "Believe me in an ideal world, I wish charities, non-profits, churches, social fabric, and the generous nature of Americans is enough to replace social safety nets. In principle I want people to get off the welfare state, but I understand why it’s there in the first place.",
                                                            "score": 5,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "peren005",
                                            "body": "You have proof? Look at the 1800s, the power of the government was much weaker compared today, much less regulation but that didn’t stop tycoons from forming.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Behemoth92",
                                                    "body": "Proof? For what? All of modern Econ? Maybe start with “Free to choose” by Milton Friedman. Malthusianism isn’t taken seriously anymore. Economics is not a zero sum game.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "peren005",
                                                            "body": "lol modern Econ. Just post the receipts. \n\nDid I argue Econ was? Didn’t game theory prove Econ isn’t zero sum? Even more hilarious modern Econ utilizes Nash equilibrium to showcase how monopolies play. \n\nJust post some white papers my guy would love to learn more….",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Behemoth92",
                                                                    "body": "I don’t get what you want proof for.  That monopolies form under free markets vs authoritarian governments which attempt to bust monopolies? I can see how there would be simple game theoretic models predicting the formation of transient monopolies; i don’t know if there there is any empirical backing to these models? Or are you asking for arguments about negative/positive impacts of monopolies? Just make your question less open ended and I could probably help you with a  Google search. lol.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "peren005",
                                                                            "body": "And I quote you sir, “I think what you’re talking about is communist propaganda. Economics isn’t a zero sum game. Monopolies form but are supplanted eventually. Monopolies only last as long as the government supports them. I don’t see any example to say otherwise. Regulationism is literally why only large companies can thrive. Also as long as you have your private property and are able to offer your labor freely you’ll most definitely have your needs met.”\n\nSo, argument 1. Monopolies only exist when government allows it. \n\nArgument 1 rebuttal: look at USA history of 1800s, more ironically when USA started anti-trust laws.\n\nArgument 2: regulations are only the reason why large corporations survive.\n\nArgument 2 rebuttal: “only” is a very strong claim, so I want receipts, but again look at how monopolies formed in their first existence. \n\nA more interesting thought experiment is those in power didn’t have the means or capabilities to exploit at SCALE market inefficiency until the Industrial Revolution.",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ILBTs-n-ILSTs",
            "body": "Progressives like to think they are superior to everyone else. They are pretty full of themselves because of all the brain washing they have received.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Azurill",
            "body": "But the anti progressive approach was just handing it to elon musk and Donald Trump. Like handing it directly to corporations. There isn't even subtlety. You can denounce corporations as being the problem with our government and then hand off the keys to the richest corporate billionaire, a non american.",
            "score": 2,
            "replies": [
                {
                    "author": "DingusDongus00",
                    "body": "No freedom minded people wanted that either. You're complaining about who gets to be king. I don't want a king at all.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "thatnetguy666",
            "body": "and more corprotiations!\n\nMarxist shitholes like china and north korea have more corporations and more powerful ones then any woke socialist could ever dream of. Legit all of North Koreas Canned food packaged food and junk food is all owned by 1 corporation they don't just have the market; they ARE THE MARKET.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TriariusActual",
            "body": "Reminds me of the \"Trump is a dictator, let's ban guns\" sentiment.",
            "score": 1,
            "replies": []
        }
    ]
}