{
    "title": "Republican Thinking: We are cutting the budget but we need to increase the debt ceiling by $4 trillion……what?!?!🤬🤬🤬",
    "author": "CellistSuspicious492",
    "subreddit": "Libertarian",
    "rank": 73,
    "score": 955,
    "upvote_ratio": 0.86,
    "num_comments (reported by reddit)": 59,
    "url": "https://i.redd.it/yics1ki0bsle1.jpeg",
    "id": "1izwdia",
    "selftext": "",
    "comments": [
        {
            "author": "turrettes",
            "body": "They self identify as fiscally responsible, how dare you",
            "score": 259,
            "replies": [
                {
                    "author": "stealthryder1",
                    "body": "You’re asking for logic by the people who have an obsession with their president.. \n\nthe same people who wanted less government control and better budgeting… the same people who are now applauding more government spending, Trump putting in all his ”yes man” cronies, and a bunch of useless executive orders.\n\nThese people are applauding like brain dead seals at Trump making the official language English and renaming the gulf of America… that’s what they are applauding as America first, while Trump is making EO for oligarchs first.. again.. like brain dead goofy ass seals lol",
                    "score": 31,
                    "replies": []
                },
                {
                    "author": "Xmanticoreddit",
                    "body": "Dude, you want to talk about cognitive dissonance?  \n\nAfter a century of industrialist propaganda, libertarians threw away the free market so they could have monopolies and now they’re driving us straight off a cliff into single-payer central planning and nobody on the right is saying anything about communism anymore unless it’s about race or gender.  \n\nThis whole country is so fucking brainwashed I’m smelling bleach every time I roll down the window.",
                    "score": 15,
                    "replies": []
                }
            ]
        },
        {
            "author": "No-Mountain-5883",
            "body": "If it were up to trump we wouldn't have a debt ceiling at all. That tells me all I really need to know about how fiscally responsible he is.",
            "score": 130,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": -37,
                    "replies": [
                        {
                            "author": "LawsOfEconomics",
                            "body": "It’s almost as if two things can be true at the same time.",
                            "score": 37,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": -16,
                                    "replies": [
                                        {
                                            "author": "No-Mountain-5883",
                                            "body": "Your response would make sense if the meme was one of those pink haired woke people bitching about trumps debt ceiling. We're talking about the hypocrisy of trump putting a focus on reducing spending while increasing the debt ceiling. That has nothing to do with Obama or even democrats in general.",
                                            "score": 22,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Automatic-Garden7047",
                            "body": "Trump cuck 👆",
                            "score": 16,
                            "replies": []
                        },
                        {
                            "author": "No_Temperature_8662",
                            "body": "The fact that you are downvoting him is a bit over playing your hand isn't it? \n\nBlatant hypocrisy is not a good look.\n\nHe's right the debt 'ceilings' are little more than political speed bumps that both major parties have failed to respect.",
                            "score": -2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ChknParmasean",
            "body": "I would put money on not cutting the nearly 2 trillion a year military spending. I am sure there is no waste there at all. Its not at all suspicious that the number 1 buyer of glitter in the world is the US military.",
            "score": 42,
            "replies": [
                {
                    "author": "Additional_Ad_4049",
                    "body": "Wtf are they using so much glitter for?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "WeHaveToEatHim",
                            "body": "Boats mostly.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "hardeho",
            "body": "Thats also how we calculate inflation.",
            "score": 12,
            "replies": []
        },
        {
            "author": "mack_dd",
            "body": "Daddy Bibi needs more cluster bombs",
            "score": 34,
            "replies": []
        },
        {
            "author": "AldruhnHobo",
            "body": "They're all the same. One's red, one's blue. Neither side is worth a shit.",
            "score": 20,
            "replies": [
                {
                    "author": "New_Manufacturer5975",
                    "body": "Bingo!",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Rednexican429",
                    "body": "Hell yeah! Are we back to being Libertarians on this sub?",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "bt4bm01",
            "body": "Sad but true.",
            "score": 15,
            "replies": []
        },
        {
            "author": "PoliticalJunkDrawer",
            "body": "We need to increase the debt ceiling because we are running a $2 trillion dollar deficit.\n\nNot raising the ceiling means defaulting, and no serious person has suggested we don't raise it.\n\nOther than that, great point and own!",
            "score": 22,
            "replies": [
                {
                    "author": "soiledmeNickers",
                    "body": "While your point is correct, as it pertains specifically to the incumbent administration, this is not their driving intent. There might be a leg to stand on if they were actually cutting the budget. So far everything I’ve seen seems to only be a redistribution.",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "SmokedRibeye",
            "body": "Cutting the budget doesn’t immediately fix the debt problem… will take time to recoup the amount of dumb spent money. Keyword is SPENT money… we can’t get it all back. Trimming the depts lowers yearly costs but doesn’t put money back.",
            "score": 24,
            "replies": [
                {
                    "author": "BigRed079",
                    "body": "Yeah it will take a lot of time when they are still putting together budgets that have more spending than revenue.",
                    "score": 30,
                    "replies": [
                        {
                            "author": "OpinionStunning6236",
                            "body": "Well we’ve been carrying like $2 trillion annual deficits lately so it’s gonna take a lot of work to get the spending down to the level of tax revenue",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "larzast",
                                    "body": "That will never happen. \n\nThe deficit in 2024 was *1.8 trillion dollars* against an income of only 4.9, they’d have to cut every single budget item by almost 37%. \n\nHowever, they couldn’t stop there. The third largest budget item was net interest paid on public debt, which came in at an astonishing *949bn*. That’s 100bn more than is spent on Defence. Unless the US intends to default, they can’t just “cut” those interest payments, so they’d have to cut a further 7% from everything else.  \n\nAt this point, it would take something truly groundbreaking to ever break even.",
                                    "score": 12,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AlphaTangoFoxtrt",
                    "body": "Deficit and debt are two different things.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Jeepcomplex",
                    "body": "I have 100k budget to renovate my kitchen. After doing the floors for 10k, I am told to stop renovating the kitchen. There’s still 90k in an account.",
                    "score": -19,
                    "replies": [
                        {
                            "author": "SmokedRibeye",
                            "body": "It’s not like that… we were already at the ceiling… you had 0k budget because there’s no money left",
                            "score": 25,
                            "replies": []
                        },
                        {
                            "author": "Time193",
                            "body": "This comment implies that the government has an entire year's worth of salaries on hand, in an account, when they most certainly do not.",
                            "score": 16,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SurlyWet",
            "body": "What would an honest person do?",
            "score": 1,
            "replies": []
        },
        {
            "author": "ILBTs-n-ILSTs",
            "body": "You are not wrong but to be fair the democrats are also really good at wasting our money",
            "score": 1,
            "replies": []
        },
        {
            "author": "shadowamongyou",
            "body": "Trump is doing more than Biden ever did. And yes I’m a libertarian.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Obvious_Scratch9781",
            "body": "I went into the election thinking both candidates were going to spend us into deeper and deeper debt. If the numbers I heard are true, basically get us “balanced” budget in 4-5 years. That’s way better than I expected. \n\nNot what I wanted but better than what I expected.",
            "score": 0,
            "replies": []
        },
        {
            "author": "natermer",
            "body": "This isn't just a Republican issue.  As in it isn't isolated to them.\n\nThis viewpoint is shared by Democrats in power as well as the \"media complex\" and most people on Reddit, by extension (since the vast majority of people only read the headlines).\n\nFor example if Medicare budget is set to rise by 7% next year and they pass a bill limiting it to only 5% growth....  Then that will be reported as a \"Cut in Medicare Spending\". \n\nit is one of the stupidest things on the planet.  But it is also exactly how reporting on the Federal government works.  Standard Operating Procedure.\n\nThis sort of thing is why people often refer to the leadership of the Democrat and Republican parties as \"The Uniparty\".  Which is absolutely the correct viewpoint to have. Sure, they hate each other.  But they hate you more then they hate themselves.",
            "score": 0,
            "replies": []
        },
        {
            "author": "patbagger",
            "body": "Definitely not limited to Republicans",
            "score": 0,
            "replies": [
                {
                    "author": "Solanum_Virus",
                    "body": "bruh dont waste your time this isnt a libertarian subreddit anymore",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "guesswhatihate",
            "body": "Replace republican with \"fed\" and it's  much more accurate\n\n\nSince when does this sub support the fed?  It controlled by both Republicans and Democrats ",
            "score": -21,
            "replies": [
                {
                    "author": "No_Temperature_8662",
                    "body": "It is really telling that you are being downvoted for this in a libertarian sub. Keep speaking up.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "AKLmfreak",
            "body": "I mean, if you’re trying to reverse a moving barge you inherited, going 5 knots ahead is better than staying at 10 knots ahead.  \n\nA lot of people are making snap judgements and criticisms 2 months into a 48 month term, I’m just waiting to see what happens.",
            "score": -21,
            "replies": [
                {
                    "author": "BigRed079",
                    "body": "You don't need to wait, just look at spending from 2016-2020.",
                    "score": 37,
                    "replies": [
                        {
                            "author": "Enough_Deer9752",
                            "body": "You're comparing a first term president who didn't start off the year attempting to find fraud, waste, and corruption with a 2nd term president doing just that. It's not an apples to apples comparison.",
                            "score": -22,
                            "replies": [
                                {
                                    "author": "BigRed079",
                                    "body": "He said he would drain the swamp last time.",
                                    "score": 25,
                                    "replies": [
                                        {
                                            "author": "No_Temperature_8662",
                                            "body": "Strange how much resistance he got for saying that.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Enough_Deer9752",
                                            "body": "Anyone who believed that was as naive as he was his first term. You don't waltz into the White House as a non lifelong politician and get a whole lot done.",
                                            "score": -9,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Time193",
                    "body": "Yeah exactly we were already on track for a budget increase in March it was happening either way, the important thing is downsizing slows this growth, it's like a disease you don't just get better you slowly recover",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "luckoftheblirish",
                    "body": "Seriously though. I understand that we should be skeptical of everything the Trump administration does, but is this really the fight we want to pick?\n\nHe's actually attempting to reduce the deficit, but since it's not a 100% reduction on day 1, we need to shit on him? This sort of insufferable behavior is why we aren't taken seriously.\n\nSteps in the right direction, even small ones, should be praised. There's plenty for libertarians to criticize about Trump, this ain't it.",
                    "score": -3,
                    "replies": [
                        {
                            "author": "Spivvy_",
                            "body": "4.5t proposed tax cut while only cutting $1.5t in spending (while increasing defense spending somehow)  was just voted on in the house by Republicans. Medicare/aid, ss, and defense are our biggest spendings. We voted to increase debt $3t to cut taxes for the rich, to kill more people, and to help less Americans. Really making it great again.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "No_Temperature_8662",
                                    "body": "Cool take, I agree. He isn't cutting enough. I hope we can count on your support when he announces more cuts.\n\nAll that said, if you disagree with tax cuts you know you can donate your own money to the fed, right?",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "author": "Spivvy_",
                                            "body": "I disagree with tax cuts that only affect 10% of the population (those who earn more than $400,000) while simultaneously cutting funding for those who actually need it and/or have already paid in (social security) while also still running a deficit and increasing military spending. I wish you would read.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "author": "No_Temperature_8662",
                                                    "body": "The proposed tip and bonus tax cuts effects much more than those who make over $400k.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "No_Temperature_8662",
                            "body": "This. I don't think we should ever trust people in power, regardless of their party, but I'm not going to stop them when they are doing things like cutting taxes and spending. I may yell 'MOR' and be miffed if they don't cut enough. So the congress passed another bloated budget, hmm must be a day that ends in 'y'. Let's primary away the corrupt congress people.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "No_Temperature_8662",
                                    "body": "Wow. Who would have thought that spending cuts and primarying corrupt officials would be so unpopular on the Libertarian sub?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "xx_deleted_x",
            "body": "NOW you're concerned about congress doing this?????",
            "score": -15,
            "replies": [
                {
                    "author": "Pharaca",
                    "body": "OP used to be concerned about the national debt. Still is. But used to be too.",
                    "score": 28,
                    "replies": [
                        {
                            "author": "EngagedInConvexation",
                            "body": "Miss you Mitch.\n\n...*not* McConnel.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Wonderflonium164",
                    "body": "If I can't be concerned today because I wasn't concerned yesterday, when do I finally get to be concerned?",
                    "score": 15,
                    "replies": []
                }
            ]
        },
        {
            "author": "Malohdek",
            "body": "Except they have added to the deficit.",
            "score": -1,
            "replies": []
        },
        {
            "author": "chainsawx72",
            "body": "Democrats love to say that lower taxes always means less revenue, but historically that is the opposite of the truth.  Think of it this way:\n\n0% tax: no revenue due to no taxes.\n\n100% tax: no revenue due to no GDP.\n\nI hope that's self-explanatory.  Increasing the tax rate to let's say 50% does not mean that you should expect to get half of the GDP of the previous years.  No one knows the optimal tax rate.",
            "score": -15,
            "replies": [
                {
                    "author": "No_Temperature_8662",
                    "body": "It's almost like you should tax the things your don't want to incentivize.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "No_Temperature_8662",
            "body": "Yep. Meanwhile the Dems would screaming that diets are a scam and asking why the doc isn't affirming their bold and beautiful body.",
            "score": -2,
            "replies": []
        }
    ]
}