{
    "title": "Regarding the Epstein files: Remember how republicans complained that the democrat media withheld reports or downplayed the real news? Now we have conservative “influencers” acting like they hold the keys to the truth. MAGA got duped. These are victims of sexual crimes we’re talking about here…",
    "author": "Very_Human001",
    "subreddit": "Libertarian",
    "rank": 75,
    "score": 337,
    "upvote_ratio": 0.89,
    "num_comments (reported by reddit)": 21,
    "url": "https://i.redd.it/z638kfxp3tle1.jpeg",
    "id": "1izzcte",
    "selftext": "",
    "comments": [
        {
            "author": "chechnyah0merdrive",
            "body": "This was an embarrassment. All these influencers are  walking away with egg on their face, and frankly, it’s deserved.\n\nFurther, this Epstein shit is dumb. We already know what horrors went down. It’s insulting to the victims to get cute about it.",
            "score": 95,
            "replies": []
        },
        {
            "author": "Courage13578",
            "body": "I got kicked from my Local Libertarian FB group for suggesting that something fishy might be going on. I guess I wasn’t MAGA enough for them lol",
            "score": 80,
            "replies": [
                {
                    "author": "t0rnAsundr",
                    "body": "Hahahaha. That is why this semi-anonymous account is my one and only social media account.",
                    "score": 15,
                    "replies": []
                }
            ]
        },
        {
            "author": "natermer",
            "body": "it is a way to control what these people are saying.\n\nIt is a 'carrot' + 'stick' approach.\n\nCarrot: \n\nYou are part of a exclusive club and if you play along you can expect a lot of attention and money from what you get access to. Going  to DC and getting all this attention and dinner and, etc etc. Is intensely flattering. And these people can make money from the attention they get, since it will boost their views and marketability.  \n\n\nStick: \n\nIf you piss us off we can take this away from you so you won't get invited to the next club meeting and you won't get advanced access to important information.\n\n(ie:  Just in case you don't understand how this works: \"influencers\" get paid to post messages.  Some of them can make a lot of money from it. More then they can make from just getting views.  Like tens of thousands of dollars or more to post certain views on certain subjects at certain times.  This way astroturf campaigns can be made to look organic. The more attention they get the more money they can command for these services.  They also coordinate through platforms like discord and share viewers with one another to boost \"engagement\". Which is why a lot of right-wing grifters got their blue checkmarks taken away in the last \"Vivek things you are lazy and stupid but H1B immigrants are better\" fake outrage campaign on twitter... they got caught doing this)\n\n\nThis is exactly some of the same tactics that is used to control the press, although in comparison this is pretty heavy handed and clumsy. \n\nPiss off \"The Party\" and you lose your \"inside connections\", no longer get invited to events, and no longer can report on \"leaked\" information, etc etc.",
            "score": 17,
            "replies": []
        },
        {
            "author": "VEXtheMEX",
            "body": "It's almost refreshing to see something other than GOP dick riding on this sub. But let's get shit straight, both sides are fucking dumb, the left has leaned way too into being offended at everything and the right has leaned way too into trying to be fucking assholes.",
            "score": 182,
            "replies": [
                {
                    "author": "bleachbath27",
                    "body": "……the right literally gets offended over someone calling the gulf the Gulf of Mexico instead of the gulf of America (which is stupid as shit) and let’s not forget is really upset over the fact that some men want to where dresses and be called Shirley.",
                    "score": 47,
                    "replies": [
                        {
                            "author": "Hot_Most5332",
                            "body": "You did read the part where he said that both sides are dumb as shit right?  We don’t have to spend every comment virtue signaling that we hate both sides.  You’re on r/libertarian, if you are here to defend anyone in American politics, you’ve come to the wrong place.",
                            "score": -6,
                            "replies": [
                                {
                                    "author": "bleachbath27",
                                    "body": "Oh I’m trackin hombre. I only said that cuz I said it earlier that day. i completely agree and understand they don’t give two fucks about us. You put your finger in a bucket of water pull it out and see how fast that hole fills up that’s how much anyone in the government cares about us. We’re pawns to them. They use the fact we’re poor to make themselves feel better about themselves.",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "OVO_Trev",
            "body": "I don't even know who these people are",
            "score": 27,
            "replies": [
                {
                    "author": "LostNfoundShoes",
                    "body": "Same, I have no clue who is holding what.",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "Jolly_Job_9852",
                    "body": "The guy on the left with the reddish brown beard in a three piece suit is DC_Draino on X or Twitter. I did read that from I think WSJ. I know of the guy from when I would frequent conservative circles",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "RobertEHotep",
            "body": "This spectacle was completely appalling.",
            "score": 11,
            "replies": [
                {
                    "author": "t0rnAsundr",
                    "body": "I know nothing about it and there is no story here. But there could be, if someone actually linked some actual information instead of pretending this hivemind is all on the same page. But people seem more concerned with simply jumping on a bandwagon. This post is low effort. Nothing was learned here. Almost nothing can be learned here. This is a waste of pixels.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Hi-Wire",
            "body": "No one's happy with how this played out",
            "score": 7,
            "replies": []
        },
        {
            "author": "Dominus_Invictus",
            "body": "Well to be fair, every single Republican I know is absolutely furious about this. Rightfully so. It seems like most Republicans see this as doing exactly what the previous administration would do and the complete violation of any trust they had.",
            "score": 7,
            "replies": []
        },
        {
            "author": "Fair_Performance_251",
            "body": "It’s on purpose he didn’t get duped.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LoneHelldiver",
            "body": "I thought the story was that these are the log books of all the FBI agents who have accessed the information, which the NY office had told Kash didn't exist.\n\nI also thought the story was that he is attempting to get these documents from the NY branch and that they might possibly be shredding them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "monsterpoodle",
            "body": "No matter who you vote for it is still a politician..",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": -16,
            "replies": [
                {
                    "author": "username3333333333",
                    "body": "Yes. We want the unredacted client list. We want an explanation as to how these people have evaded prosecution. We want to know why Maxwell was convicted of sex trafficking and that not a single client has been charged. We want to know who in the government made the sweetheart deals and why. We want the  accountability that was promised.",
                    "score": 31,
                    "replies": []
                },
                {
                    "author": "Secondhand-politics",
                    "body": "For *us*, maybe. Republicans aren't afraid to keep secrets from the public if it means having power over the public.",
                    "score": 27,
                    "replies": []
                }
            ]
        },
        {
            "author": "badskinjob",
            "body": "Yes, the YouTubers are the only ones to get that binder. I suppose trump expects Mr beast to hold some sort of competition for who can read it the fastest. Jesus Christ you're reaching there bud.",
            "score": -3,
            "replies": []
        }
    ]
}