{
    "title": "The Israel Lobby is very concerned that Massie may run for Senate - The Republican Jewish Coalition has pledged ‘unlimited’ spending to block Massie if he decides to run",
    "author": "AbolishtheDraft",
    "subreddit": "Libertarian",
    "rank": 68,
    "score": 218,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 16,
    "url": "https://jewishinsider.com/2025/02/mitch-mcconnell-retirement-thomas-massie-republican-jewish-coalition/",
    "id": "1j0aoj6",
    "selftext": "",
    "comments": [
        {
            "author": "AlphaTangoFoxtrt",
            "body": ">We need to get foreign money out of our elections!\n\nOk, let's elect a politician who isn't taking money from Israel.\n\n>ANTISEMITIC BIGOT NAZI RACIST!!!",
            "score": 77,
            "replies": [
                {
                    "author": "Top-Cartographer2627",
                    "body": "GENOCIDE is NOT okay!!!!!",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "AbolishtheDraft",
            "body": "This isn't a big surprise, RJC endorsed his primary opponent last time and AIPAC dumped $600K in attack ads against him. Massie would be an incredible Senator, but I'd hate for him to lose and not be in Congress at all. So I'm conflicted",
            "score": 48,
            "replies": []
        },
        {
            "author": "EVIL-EMPIRE-II",
            "body": "I bet we could crowd fund a hell of a war chest.",
            "score": 20,
            "replies": []
        },
        {
            "author": "Mecaneecall_Enjunear",
            "body": "Alright Kentucky, it’s time for you to do your best work since Bourbon.",
            "score": 24,
            "replies": []
        },
        {
            "author": "ENVYisEVIL",
            "body": "David versus the Goliath",
            "score": 30,
            "replies": [
                {
                    "author": "GimmeTwo",
                    "body": "I see what you did there",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "seobrien",
            "body": "Because?  I need to know how seriously this Coalition has just made enemies.  Going against any politician who puts rights first (a libertarian) is itself a human rights violation.\n\nTo hell with your ideals or objectives if you're fighting someone who wants to ensure people retain their rights first and foremost.",
            "score": 20,
            "replies": [
                {
                    "author": "AbolishtheDraft",
                    "body": ">Because?\n\nBecause Massie opposes all foreign aid, including to Israel. To Israel lobby Super PACS like AIPAC and RJC, this makes him an \"antisemitic isolationist extremist\"",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "natermer",
                    "body": "Politics isn't about morality.\n\nIt is about winning.\n\nThe people who get heavily involved in this sort of thing definitely have a 'ends justify the means' point of view.  To bad none of these assholes have realized that there is no end in sight. It is never going to stop.. it is a long series of 'means'. So they are condemned to inflict endless amounts of destruction and chaos on the rest of the people.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "teleologicalrizz",
                    "body": "Because he revealed that every American politician answers to an \"AIPAC guy\".",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "International_Fig262",
            "body": "Honestly wish he was in my state so I could vote for him",
            "score": 5,
            "replies": [
                {
                    "author": "sweetDryzen",
                    "body": "I got you",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "MateTheNate",
            "body": "The thing that matters is going to be the campaign strategy. Kamala burned through the most expensive campaign in history and look where that got her. Massie is steadfast in his ideals and can defend them with his political background, if the lobby runs a generic talking head they will fall in a debate.",
            "score": 4,
            "replies": []
        },
        {
            "author": "YetAnotherCommenter",
            "body": "Israel First is not acceptable foreign policy, especially given Israel are clearly pursuing ethnic cleansing in Gaza. \n\nAnd whilst the Israelis are *currently* and *on average* a more civilized people than the Palestinians, that doesn't mean the Palestinians don't have property rights. In addition, as Israel's religious right grows and they keep engaging in this kind of behavior (i.e. ethnic cleansing) their advantage over the Palestinians (in terms of being more civilized) begins to sharply erode.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Practical_Advice2376",
            "body": "That's like, enough to just stay in the House : (.",
            "score": 4,
            "replies": []
        }
    ]
}