{
    "title": "Should I max my 401k contributions in my situation?",
    "author": "cyber1551",
    "subreddit": "personalfinance",
    "rank": 17,
    "score": 4,
    "upvote_ratio": 0.64,
    "num_comments (reported by reddit)": 16,
    "url": "https://www.reddit.com/r/personalfinance/comments/1je9ejy/should_i_max_my_401k_contributions_in_my_situation/",
    "id": "1je9ejy",
    "selftext": "Hello,\n\nI'd like apologize in advance for the length of this post. I tried formatting it as nicely as possible to make it easier to read.\n\nI put \"other\" as the flair because this technically has roots in investing, taxes, saving, and planning.\n\nFor context,\n\n* I am 25 years old and live in Nebraska. \n* I make **$100,085.44 pretax**\n* I contribute **$6,005.1 to my 401k (6%)**. My employer matches 100% up to 6% of my salary into my 401k which I take full advantage of. It's invested entirely in SPY and I sell covered calls as Fidelity offers a very nice BrokerageLink feature.\n* I max out my HSA (I technically only contribute **$3,796** since my employer contributes **$500/year** and it counts as a contribution towards the max $4,300)\n* My health insurance is **$1,213.68 a year**\n* **I have zero debt of any kind**\n\nMy final taxable income is **$74,070**. My taxes are broken down like this (this includes all standard deductions and updated tax brackets for 2025):\n\n* Federal tax: **$11,209.55**\n* State tax: **$3,840.76**\n* FICA tax: **$7,273.3**\n\nFor a total taxes paid of **$22,323.61** (22.3% effective tax rate).\n\nAfter all that, I take home around **$1,283 per week** (**$5,562.2 per month**) post tax.  \nUsing monthly numbers for simplicity,\n\n1. **$479** gets automatically transferred to my emergency fund. This is also my \"tax bucket\" for April since I trade options and therefore always owe money each year.\n2. **$583** of that goes into my Roth IRA ($6996/year for almost the max contribution)\n3. **$1000** is needed for my required living expenses (rent, food, car insurance, etc). Yes, I live at home and therefore have low rent.\n4. **$500 to $1000** is fun money (I count restaurants and coffee shops as fun not food)\n5. The remaining **$3,000 - $2,500** is invested into my taxable investment account (more risky than my 401k as it's heavy growth. I also sell options on the indexes for extra income similar to my 401k). I'm trying to FIRE in case it's not obvious.\n\n\\----------------------------------------------------------------------------\n\nOk, now the boring stuff is over. Time for my question. \n\n>**Should I max out my 401k ($23,500)?**\n\nHere are the updated numbers:\n\n* My taxable income gets lowered to **$56,575.76**\n* Total taxes paid is **$17,564.99**\n   * Federal tax: **$7,360.67**\n   * State tax: **$2,931.03**\n   * FICA tax: **$7,273.30 (no change)**\n* New take home pay is **$1,038.67/week** or **$4,500.9/month**\n\nThis results in the following:\n\n* **$245** less money each weekly paycheck (**$1,061.3 less per month)**\n* Therefore, I'd invest **$1,000** less money to my taxable account each month\n* **$17,494.9** additional contributions to my 401k each year (for the $23,500 max)\n* Most importantly, **$4,758.62 saved in taxes**.\n\nI'm stuck for numerous reasons:\n\n1. My taxable account has a higher return than my 401k, so I feel like the money is better spent there\n2. I'd be locking away **$17,494** a year until I'm 65. I know about Roth conversion ladders, which can be used if I retire early so this might not be that big of a deal\n3. The pro is I **save $4,758 in taxes**. Although, this is irrelevant if I do a Roth conversion ladder since I still pay income tax during the conversion each 5 year period.\n4. Historically, accounting for inflation, federal income taxes have gone down over time whereas FICA taxes have gone up. \n   * So deferring my taxes is smart but it's also possible they go up in the future. There is really no way of knowing\n\n\\----------------------------------------------------------------------------\n\n# What Would You Do?\n\nEveryone I've asked this in person recommended I max out my 401k.\n\nIs maxing my 401k the best move, or is keeping more in my taxable account better? Curious to hear your thoughts!\n\nWhat would you do? Which would be the smartest move?\n\nThank you!  \n  \n",
    "comments": [
        {
            "author": "Glargin2",
            "body": "If the invested funds are intended for retirement always max 401k before investing in a taxable brokerage imo. It's just better in every way. You can also access that money prior to age 59.5 if you are thinking of retiring before 59.5 but in general you are best off leaving it in there until retirement. \n\nIf you are thinking of retiring early traditional 401k contributions generally outweigh Roth 401k contributions. Though at your tax bracket it's more of a gray area.",
            "score": 13,
            "replies": [
                {
                    "author": "4look4rd",
                    "body": "OP could be saving for a down payment and given that they are already saving quite a bit for retirement it might not be a terrible idea to dump money into brokerage for short to mid term servings with conservative investments. OP is already saving 12% on the 401k + 6% on Roth IRA + 4% on HSA. That’s plenty for retirement at OPs age.\n\nIf I were OP I’d also look into keeping more liquid savings since that will give the flexibility to move out or purchase a house.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Glargin2",
                            "body": "Yea that would be a scenario where taxable brokerage could outweigh a 401k. But for retirement savings specifically 401k outweighs traditional brokerage in like 99.99% of scenarios.\n\nThis also assumes that OP already has done the basics like budgeting, and building an emergency fund that covers 3-6 months of expenses.",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "BiblicalElder",
                            "body": "For most, I would recommend maxxing 401k contributions over saving for house downpayment in 20s and 30s, and then cutting back in 40s and beyond and prioritizing downpayment.\n\nThe power of compounding returns is huge in one's 20s, and unimpressive in one's 50s. Our culture can pedestalize home ownership and paying off a mortgage with a low interest rate--just like buying fancy new cars by financing them. But these may not be the best ways for people to maximize their life options.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "cyber1551",
                    "body": "Thank you!\n\n>always max 401k before investing in a taxable brokerage imo. It's just better in every way.\n\n That's what I was thinking too. Plus, I can always lower my contributions if needed.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Werewolfdad",
            "body": "https://www.reddit.com/r/personalfinance/wiki/commontopics",
            "score": 3,
            "replies": []
        },
        {
            "author": "dehydratedsilica",
            "body": "I skimmed the first bullet list, then skipped to the end.  All I can say is when I was that age, I maxed out Roth IRA, 401k (mix of trad and Roth - eventually rolled to IRAs when I left the job), and HSA every possible year.  You don't get tax-advantaged eligibility years back after they're gone, but there are ways to get money out of IRA and 401k if you really need it.",
            "score": 3,
            "replies": [
                {
                    "author": "cyber1551",
                    "body": ">You don't get tax-advantaged eligibility years back after they're gone, but there are ways to get money out of IRA and 401k if you really need it.\n\nOmg, that is a very good point! Thank you",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "TrueGlich",
            "body": "man i wish i was this put together back at your age .     The main question is do you have a goal like a house/codo your working on.   and need that money in non retirement lock.         If  not ya maxing out 401k is good idea.  but also if your emp allows making it roth 401k   same limits and you don't get tax deduction now but you you will have 30+ years of tax free gains if you can do Roth 401k",
            "score": 2,
            "replies": [
                {
                    "author": "cyber1551",
                    "body": "I am very lucky. My situation is definitely not normal. \n\nThis is good advice. I will most likely max out my 401k. I can always lower it if I'm facing an emergency or something.\n\nThank you!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "read_the_eula",
            "body": "Check to see if your employer allows for post-86 account contributions and if and how often you can convert post-86 funds to a Roth IRA. You can put about 50k per year into a Roth IRA. My company allows the max flexibility allowed by the IRS. Don't add more money to a 401K with limited investment options beyond the company match if you have the option to take advantage of the mega backdoor Roth.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ksuwildkat",
            "body": "Yes.  As long as you are not starving or living in a box, the answer is always yes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DeoVeritati",
            "body": "I say always max out tax advantaged accounts first unless you are aiming for the conversion ladder and NEED to start saving 5 years worth of expenses.\n\n You say the tax savings doesn't matter if you do the Roth conversion ladder, but it does because the idea is you quit working so you live off the capital gains of a taxable brokerage account while converting. So if you had 0 ordinary income and lived off $48,350 of capital gains from a taxable brokerage account, then that money is not being taxed. Meanwhile you convert as much as you can up to $533,540 such that the traditional funds only get taxed at 15% or less. 15% or less is still better than the 22% you would otherwise be paying\n\nAlso, there is rule 72t withdrawals that can make retirement money mo4e accessible. It is more complicated and risky, but read up on it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "arunnair87",
            "body": "The answer is maybe. It depends on what your goals are in the next 5-10 years.\n\n1) do you want to get married? How expensive is your wedding going to be? Are your parents going to help pay? How much would they contribute\n\n2) do you plan on moving out anytime soon? Do you want to buy or rent in the area you're living or move someplace else?\n\n3) how are the funds in your 401k? What are the expense ratios? What is your 401k invested in, like what's the breakdown? Is it a target date fund or all I the snp500?\n\n4) do you plan on purchasing a car?\n\nI'm sure I'm missing some big questions lol but I think these are the ones I asked myself when I got my first 100k job.",
            "score": 1,
            "replies": []
        },
        {
            "author": "samzplourde",
            "body": "Do you not have a home purchase coming in the future? Paying cash for a house could be the best decision you ever make.",
            "score": 1,
            "replies": [
                {
                    "author": "cyber1551",
                    "body": "Agreed! I will most likely inherit my families house (the one I'm currently living in). It still has a mortgage but it was purchased many years ago so I will definitely not get the same size house for the same price nowadays.",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}