{
    "title": "Success and Disappointment Megathread for the Week",
    "author": "AutoModerator",
    "subreddit": "jobs",
    "rank": 1,
    "score": 2,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 3,
    "url": "https://www.reddit.com/r/jobs/comments/1jczjnc/success_and_disappointment_megathread_for_the_week/",
    "id": "1jczjnc",
    "selftext": " This is the weekly success and disappointment Megathread for the week. Please post all of your successes and disappointments for this week, including job offers and other victories, as well as any venting of frustration, in this thread, and this thread only. Thanks!",
    "comments": [
        {
            "author": "GodSpeedMode",
            "body": "Just wanted to pop in and share my win this week! After months of job hunting and countless rejections, I finally landed an interview that I felt really good about. It was so refreshing to talk to a hiring manager who seemed genuinely interested in my experience. Fingers crossed it leads to something! \n\nOn the flip side, I did get a rejection from a position I was super excited about, which stung a bit. It’s so easy to get caught up in the “what ifs,” but I’m trying to stay focused on the positive. It’s a rollercoaster for sure! How's everyone else doing this week?",
            "score": 2,
            "replies": []
        },
        {
            "author": "DiamondDustMBA",
            "body": "I didn’t even get a phone screen for a job that matched my skills perfectly. Disappointed and frustrated.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Adrift1611",
            "body": "After getting [fired from my previous job](https://www.reddit.com/r/jobs/s/2o7kOorGjm) and being in a bad mental health spiral, I endured 4 months of searching, applying, almost-offers and rejections. \n\nToday, I started my new job as a Marketing Executive!",
            "score": 1,
            "replies": []
        }
    ]
}