{
    "title": "I Was Fired After 13 Years On The Job.",
    "author": "AnyWait6443",
    "subreddit": "jobs",
    "rank": 7,
    "score": 212,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 78,
    "url": "https://www.reddit.com/r/jobs/comments/1je4481/i_was_fired_after_13_years_on_the_job/",
    "id": "1je4481",
    "selftext": "\nI've worked at a hospital as a Security Officer for 13 years. I've seen it all in that time and was pretty good at my job just being more compassionate with patients and visitors. A lot of times the job entailed just smoothing out issues Doctors and Nurses started. \n\nAlways thought I had friends at my job and knew a lot of the big wigs. Until one day I got brought into our office and got canned. A Correction Officer came one day to see his child who was hospitalized. I was working the main entrance metal detector. Mind you, we've always given courtesy to Officers, EMT and Fire Fighters. I asked the Officer if he's armed and if he's currently active, which he replied Yes. I gave him the courtesy of bypassing the line and sent him to the desk for a visitors pass. In other campuses armed officers are always escorted by our Supervisor's but not in our campus because of man power issues. \n\nThis Officer got into an argument with his baby mother and it got physical apparently. The officer was arrested that day. Now 99% of the times we've never had any issues but that 1% got me fired. On top of that they threw a bunch of minor offenses which nobody has ever been fired over like phone usage. During this time my mother was sick and dying. It's been very stressful watching my mother die. I was getting calls from family and doctors daily. I expressed to my supervisor previously that I was under a lot of stress and asked for help.\n\nI fought the Termination and met with the our VP to our department. I expressed it was a mistake and that we've been having issues with management and man power. He called me stupid and that I'm too outspoken. He gave me the scenarios \" what if he shot someone \" . So needless to say that didn't go very well. Never heard back and my emails go unanswered. \n\nSince then now any armed officers are escorted by a supervisor how it should've been from the beginning. But I still lost my job and got in debt with funeral costs. Venting but after so many years working there I was fired so easily with zero sympathy. Always felt they were gunning for me because I was at top pay. But my attendance was perfect so I never had issues. \n\nAt this point I know I should just move on but I had so much time vested and just feel betrayed. Don't know what to do at this point anymore. ",
    "comments": [
        {
            "author": "BeerluvaNYC",
            "body": "you've got 13 years experience of security. that experience is valuable to someone or some company/organization. good luck during this time.",
            "score": 173,
            "replies": [
                {
                    "author": "NeverEnoughSunlight",
                    "body": "All at the same location, too.",
                    "score": 10,
                    "replies": []
                },
                {
                    "author": "BigPanda71",
                    "body": "He also has a termination for allowing an armed\nIndividual into the hospital. He can try to explain it in an interview, if he gets that far. But otherwise he’s screwed.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "Confident-Pen4934",
                            "body": "Why would this even have to be disclosed? It is my understanding that many corporations won’t even give a reference for a job besides the dates of employment.",
                            "score": 57,
                            "replies": [
                                {
                                    "author": "scottiy1121",
                                    "body": "100% this.",
                                    "score": 9,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "chuck_ryker",
                            "body": "An armed corrections officer, and that was the SOP for that location.",
                            "score": 23,
                            "replies": [
                                {
                                    "author": "weaponisedape",
                                    "body": "Corrections officers officers usually dont have the authority to carry off duty as they are not sworn LEO's. Most dont even carry on duty. I would never let a CO carry into a hospital. Only on duty fully sworn LEO's.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "Hoosier_Daddy68",
                                            "body": "That’s what I was thinking, almost all corrections officers don’t carry on the job and they certainly aren’t cops.",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "somethingswrong71",
                                            "body": "Both nys and nyc corrections officers carry off duty",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "HsvDE86",
                                            "body": "They said **at that facility.**",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "dreadfulbones",
                                                    "body": "They SAID officers/emt’s/firefighters. Which that person was not. They SAID they gave them a courtesy. They should not have done that. OP stated they see tons of badges and can’t decipher between them all the time. That is a red flag. They said that AT THAT FACILITY they don’t have the man power to follow protocol. Then that person should not have been allowed in.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "author": "Mojojojo3030",
                                                            "body": "Pretty sure OP meant any officer when they listed “officer” in the policy, including corrections officers. OP didn’t say police officer, proceeds to refer to this person as just “officer” multiple times further down…\n\nMy interpretation is that it’s a courtesy because the whole policy is a courtesy, not because they were violating policy.",
                                                            "score": 3,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "AnyWait6443",
                            "body": "I live in a big city so the hospitals are swarmed with law enforcement. Our policy excepts state, federal and locally sworn officers and atm armed officers.",
                            "score": 11,
                            "replies": []
                        },
                        {
                            "author": "Corpus_Juris_13",
                            "body": "I’m pretty sure that legally employers cant  demand to know why you were fired or even ask about it. Unless he violated a law and it’s on his criminal record that would show up on a background check, just make something up.\n\n“Oh I had the flu and they fired me for calling out”",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "BigPanda71",
                                    "body": "You’re correct. But they can ask if your former employer would rehire you. The answer to that is going to be no. But also, I’m sure people talk about why off the record",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "k23_k23",
                                    "body": "They see it from the date your employment ends.\n\n  \nWhen you are fired, it is any day, if not it is MAYBE end of week, or 15th. or last day of month.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Spinach_Apprehensive",
                            "body": "How is he screwed? Most places wouldn’t disclose that info on why he was fired for legal reasons. They just say “yes they’re rehireable” or no they aren’t.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "BigPanda71",
                                    "body": "He’s not rehireable though. That’s the problem. Fired after 13 years and not rehireable are a bad combination",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Cat_Slave88",
            "body": "Never deviate from the written procedure. This is what happens. If management insists, they can provide in writing the exception to you and the duration of time the exception should last.",
            "score": 60,
            "replies": [
                {
                    "author": "Metaloneus",
                    "body": "The problem is that it's just as easy for management to fire you at that point anyway. They don't need to provide a reason. If someone is trying to get them to leave evidence behind, only the dumbest manager is going to comply.\n\nFrom there, wait a week or two, slap down a PIP, and fire the person a couple weeks later. That's it. Sure, a person can try to argue wrongful firing, but the company can cite any subjective belief and it suffices. \n\nDamned if you do, damned if you don't.",
                    "score": 22,
                    "replies": [
                        {
                            "author": "MuKaN7",
                            "body": "The only 'real' protection is if you are a protected class with documentable discrimination against you. A Pip right after returning from leave from giving birth will get called out on by a judge as bullshit. But blatant violations, such as a positive drug test or cursing out a customer are easily defendable firing reasons.\n\nBut yeah, OP has no case and likely would struggle winning a UI dispute if the hospital tried to be stingy.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AnyWait6443",
                    "body": "Our policy says no weapons except for federal, state and local sworn, including atm officers.",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "snorkels00",
                    "body": "Exactly.  The problem is management prys on people doing as told not following procedure. What is convenient for them. If something happens they blame you because you didn't follow the written policy.",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "SueNYC1966",
                    "body": "My brother was a corrections officer for over 30 years in NY. This. He watched so many of them get fired for bending the rules.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "BitKnightRises",
            "body": "Really sorry and sounds scary that someone armed entered hospital and that too a person with anger issues. Take care and you will find a better one.",
            "score": 20,
            "replies": []
        },
        {
            "author": "Investigator516",
            "body": "Maybe it’s worth it to contact a Labor attorney. The hospital put this on you, because this happened on your watch. But if the bypassing was common procedure, this should be noted because it’s easier for the hospital to fire one person over a mistake rather than to admit they had longstanding policy of giving people a pass.",
            "score": 18,
            "replies": [
                {
                    "author": "One-Fox7646",
                    "body": "Excellent point. OP should reach out to a labor attorney and see what his options are.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "_extra_medium_",
            "body": "Go get another better job.  You have the experience and track record",
            "score": 10,
            "replies": [
                {
                    "author": "AnyWait6443",
                    "body": "It took me years to get at top pay and 5 weeks vacation. I was earning good money. It kills me to have to start over at my age again.",
                    "score": 17,
                    "replies": []
                }
            ]
        },
        {
            "author": "Elevatorbunny6",
            "body": "I've always felt that when the universe wants you to move and you're being stubborn and don't want to, the move will be made with or without your consent. Something greater is waiting for you. I know it's hard, but embrace the change.\n\nAnd my condolences.",
            "score": 19,
            "replies": [
                {
                    "author": "AnyWait6443",
                    "body": "I think you are right. There's a few things I want to try but I keep telling myself it's not the right time.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Elevatorbunny6",
                            "body": "It's time. And stop the self negative talk, you've got a lot going for you with that kind of experience.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "AnyWait6443",
                                    "body": "With losing my mother and job, my head space is really damaged. Usually I can't stand doing anything but lately I go from not sleeping to sleeping too much. Trying to get out of this funk honestly. Just overall sad.",
                                    "score": 7,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "One-Fox7646",
                            "body": "If finances allow can you take some time to regroup? It sounds like you have been though a lot.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Confident-Pen4934",
            "body": "I would agree that your experience should get you a new job quickly.  Sometimes l, as I have found, change can be a very good thing even if you didn’t initiate it.",
            "score": 7,
            "replies": []
        },
        {
            "author": "just_shady",
            "body": "You got too comfortable, lesson learnt. That’s the downside of having “years of experience”.",
            "score": 11,
            "replies": []
        },
        {
            "author": "emerald_green_tea",
            "body": "Oof. I’m sorry OP. Their policy sucks, and they’re obviously just saving themselves by blaming only you and firing you. That said, a CO is different from an active PO. He had no reason to be armed in the hospital. You do have some culpability in this, just not nearly as much as they are pretending.",
            "score": 19,
            "replies": [
                {
                    "author": "AnyWait6443",
                    "body": "Honestly I've seen hundreds of badges from secret service to cops. Didn't know he was a C.O. Plus from my understanding he has peace officer status and can enter most buildings with his weapon. It's all about the policies which aren't crystal clear in my building.",
                    "score": 13,
                    "replies": [
                        {
                            "author": "Equivalent-Yoghurt38",
                            "body": "It honestly sounds like you asked the standard questions and he was intentionally deceptive. Asking if he is “active” implies that he is currently acting within his duties as an officer. His response should have been no, but he intentionally mislead you. \n\nThere are reasons a CO would be active in a hospital (prisoner there for treatment) and it feels like he knew that and took advantage of it. It may be worth hiring a labor attorney and running this by them. There may be nothing they can do, but they also might be able to get the hospital to change your termination to discharged without cause.",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "RideThatBridge",
                                    "body": "\"Active\" to me implies not retired, not that he is currently working. Non retired officers often are \"on\" all the time, hence the carrying \"off duty\". Regardless, I agree that all of this is vague and the trouble maker was wanting to not have to leave his weapon.\n\nAlso, escorting this jackass wouldn't have made a difference, IMO. He wouldn't have been guarded while visiting, just escorted, so the argument still would have happened. The difference would be that OP's supervisor would also be on the hook.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Clay_Allison_44",
                    "body": "COs do go to hospitals armed all the time to guard inmates. Generally, we come in with the patient but there are exceptions.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "SueNYC1966",
                    "body": "Not true, my brother had to escort patients to the hospital all the time. He had one guy who swore he swallowed things just to get out. Some would even pretend to be sick out of boredom. Did you think they call the police to bring them in.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "OddTransportation121",
                    "body": "Agree that OP is the scapegoat for the repercussions for the hospital fu*king up. Hospital says 'oh blame it on that security guard'.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "flafaloon",
            "body": "Getting fired really feels like a deep rejection, it hits hard. Know that you did nothing wrong, you are innocent. It just seems that the universe threw this knuckleball your way. I work in sales, and I have been shit canned for bad performance multiple times. Then I have started new jobs where I crush it and I am seen like a hero. \n\nWe go from hero to zero, and back to hero through our life. Try to accept this, maybe take some time to do stuff you like to do, there is a great freedom in not having to work, and get up and do the grind. Enjoy it for a while, and something else will pop up and you will end up somewhere else, and this will just be a memory, like High School.",
            "score": 5,
            "replies": []
        },
        {
            "author": "FreyaDragomir",
            "body": "I didn’t get fired but opportunities that didn’t align with my morals with dm and rm with how they treat people. Still dealing with the same thing and job hunting too. I think other guy is right sometimes spirit wants to take you out of your comfort zone. I have plenty of jobs that require driving and a license in nursing or property casual so maybe this is a sign in my own mind that I need to go get that license. I hope you get a better job I have seen just how replaceable I am in retail and I don’t like it. So I second feeling how you feel. It’s I think America thing all of my out of country friends have great jobs with pensions etc. I will pray for you while you look that you find something off the bat that gives you same pay.",
            "score": 4,
            "replies": []
        },
        {
            "author": "justkindahangingout",
            "body": "First, OP, I want to express my sympathy and empathy to you. Been there. I was laid off after 11 years being stupidly loyal to an organization. \n\nSecond, and I am saying this from experience. Do NOT take it personal. Spend a day/two relaxing and regrouping but make hast and get back in there and find that new gig. You’ve 13 years in the industry and that means ALOT. I used to work for Allied Universal’s corporate and may be able to assist. Reach out to me if you’d like and we can connect. I still have great connections there even though it’s been 3 years.",
            "score": 3,
            "replies": []
        },
        {
            "author": "dreadfulbones",
            "body": "OP this is not a wrongful termination lawsuit. It was policy, doesn’t matter the staffing issues, you deviated from policy and someone could have died. Apply for unemployment and get a new job. You have tons of experience and should find something better soon",
            "score": 5,
            "replies": []
        },
        {
            "author": "Forward_Awareness_53",
            "body": "Why would a corrections officer have a gun? You are acting like he was allowed in with it because its part of his uniform but its not. Correction officers do not carry guns for obvious reasons.",
            "score": 2,
            "replies": []
        },
        {
            "author": "pistolp3w",
            "body": "You’ll be alright. Now you know the truth about work culture — at the end of the day you don’t matter at all, no matter how cool you are with management. No matter how long you’ve been employed somewhere. No matter how hard you work. You are always replaceable and disposable. Go into your next gig with this mindset and you won’t ever get this comfortable at a job again.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Big-Try-2735",
            "body": "You kinda got screwed.  Maybe this was the last in a line of things they were ticked off at you about.   But 13 year employee?  They aren't easy to come by.  Surprised they let you go.  Maybe the baby-momma was raising hell and someone had to be the sacrificial lamb.  Maybe just an example of 'no good deed goes unpunished'.   \n\nNearly ran into a similar situation (there is a point to this story BTW).  While working as a police officer I had an off-duty Cap't who had witnessed the following debacle tell me after I let an obnoxious drunk, already in cuffs, go home in a cab at the request of my Sgt .......    \"Don't let her (Sgt's) stripes get your badge\".      \n  \nThey became words to live by.    BTW, the Cap't didn't jam me up over it.  He just gave me that advice and went back to his beer.",
            "score": 2,
            "replies": []
        },
        {
            "author": "EkneeMeanie",
            "body": "At this point you can only learn from the experience and move on. This is obviously a management/company deficiency that they were happy to let remain an issue until it has now BECOME an issue. You were a convenient fall guy.\n\nAlso...\n\n>Always thought I had friends at my job and knew a lot of the big wigs.\n\nUnless you know them personally for years, none of them are your friends. Your presence is always at their discretion.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Outside_Scale_9874",
            "body": "I’m so sorry for your loss",
            "score": 2,
            "replies": []
        },
        {
            "author": "HalfwaydonewithEarth",
            "body": "If he went postal it would be your fault.",
            "score": 3,
            "replies": []
        },
        {
            "author": "DylanRaine69",
            "body": "File for unemployment and than see if you can take some legal action m this is ridiculous.",
            "score": 2,
            "replies": [
                {
                    "author": "dreadfulbones",
                    "body": "It’s not, they let an armed man bring a gun into a hospital. That would get you fired on the spot at my facility. Doesn’t matter why.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "AnyWait6443",
                            "body": "Tons of law enforcement come daily. It's nothing new, i live in a big city. Some is personal and some is work related. This wasn't some random joe off the streets who was armed. We have a no weapons policy except for State, Federal a locally sworn officers and atm officers are allowed.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "dreadfulbones",
                                    "body": "It was a random person though, you couldn’t even recognize from their badge that they weren’t supposed to be armed. That alone is very concerning. You knew the policy, knew how other facilities do things, knew yours doesn’t because of “man power” issues, and instead let an armed man into a building full of sick and injured people. At that point, both you and the armed stranger were liabilities. Sucks you got fired but you do have responsibility here, it’s not just a personal vendetta because you got paid the most for your position. You could have gotten someone killed.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Substantial_Feed_347",
            "body": "sorry that happened to you, man. i too did hospital security but had to quit after too many new restrictions n policies. Worse is having supervisors that dont back u up. We have a safe in our sec office under cameras specifically for weapons brought in from other sec officers or off duty cops.",
            "score": 1,
            "replies": [
                {
                    "author": "AnyWait6443",
                    "body": "We have that too, but only for retired law enforcement.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok-Seaworthiness7207",
            "body": "What insurance provider does that hospital support? Asking for an Italian friend.",
            "score": 1,
            "replies": [
                {
                    "author": "PuzzleheadedCattle25",
                    "body": "😅",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "frankensteinmuellr",
            "body": "Apply for unemployment.",
            "score": 1,
            "replies": []
        },
        {
            "author": "PuzzleheadedCattle25",
            "body": "At least your hospital has metal detector because mines doesn’t 🙃",
            "score": 1,
            "replies": []
        },
        {
            "author": "One-Fox7646",
            "body": "I'm sorry OP. This sucks and they did you dirty. With your experience there are a lot of roles out there for you.",
            "score": 1,
            "replies": []
        },
        {
            "author": "One-Fox7646",
            "body": "What about doing something similar like TSA?",
            "score": 1,
            "replies": []
        },
        {
            "author": "wakeupgucci666",
            "body": "I'm sorry that sounds tough",
            "score": 1,
            "replies": []
        },
        {
            "author": "snorkels00",
            "body": "I thought have a case for a lawsuit.  They are trying to blame you when you were following procedure for that campus",
            "score": 1,
            "replies": []
        },
        {
            "author": "ReturnOfWoke",
            "body": "You let pigs break the rules? They're the most violent,  domestic abuser types out there",
            "score": 1,
            "replies": []
        },
        {
            "author": "baby_budda",
            "body": "Talk to a lawyer about wrongful termination. The fact they added on charges like phone usage makes me think they don't have a solid case but need a fall guy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "YouSayYouWantToBut",
            "body": "im sorry to hear this. i would seek a few free legal consultations with a handful of law agencies to see if any of them feel that you have been wrongly terminated. costs you nothing but few hours of your time. good luck to you.",
            "score": -3,
            "replies": [
                {
                    "author": "_extra_medium_",
                    "body": "OP needs to forget about that job and get the job he deserves.  Don't waste any more time or energy on a place that doesn't appreciate 13 years of service",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "AnyWait6443",
                    "body": "Thanks, I probably should. Just keep thinking they'll email me back with good news.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "flying87",
                            "body": "They won't. They're playing the CYA game. They feel it's easier to just put all the blame on you, rather than it get out that the agency was critically under manned and the company culture norms gave grace to armed police officers. They're probably trying to avoid a lawsuit by the mother. \n\nLawyer up. Suit for wrongful termination. Maybe they'll settle out of court if you agree to sign an NDT. After all, you've been there long enough that you know damning company practices, that if it got out, it could upend important contracts. Or if you teamed up with the mother and she can leverage that information against them in her suit.\n\n After all, you were just doing as you were told by supervisors for years. Officers get grace.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "AnyWait6443",
                                    "body": "I might just have to do that. At least get some kind of clarity from a lawyer. My coworkers all think it's crazy and vile how I was let go.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "YouSayYouWantToBut",
                                            "body": "chiming in one more time, do consult with a lawyer, a real one that specializes in this kind of law. as i mentioned earlier, there is nothing to lose by seeking more information. good luck to you. ",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "One-Fox7646",
                                            "body": "OP, consult an employment attorney and see what your options are.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "TheOverzealousEngie",
            "body": "I think what's lost is that this guy lost his job because of, indirectly, 'manpower issues'. You were 'courteous' but also mistaken, by necessity because of no manpower. Me? I'm going to the Department of Labor or a lawyer - if their policy is A and they don't the manpower to enforce A - feels like you could sue.",
            "score": 0,
            "replies": []
        },
        {
            "author": "PuzzleheadedCattle25",
            "body": "On a serious note I think y need to seek legal advice because if it’s commonplace to give “courtesy“ and the whole manpower thing then they’re just using you as a scapegoat and it’s not fair. This is why I always say that employers do not care about us, they use you then spit you out!",
            "score": 0,
            "replies": []
        }
    ]
}