{
    "title": "Saw this on LinkedIn",
    "author": "NurseDTCM",
    "subreddit": "jobs",
    "rank": 2,
    "score": 246,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 31,
    "url": "https://i.redd.it/hh7fmpzy5ipe1.jpeg",
    "id": "1jee2od",
    "selftext": "",
    "comments": [
        {
            "author": "Ok-Librarian-8992",
            "body": "The job I was recently laid off was this to a T. Am glad am out I felt like I was a pysch ward.",
            "score": 35,
            "replies": []
        },
        {
            "author": "Fieos",
            "body": "Many people will see these attributes in their direct manager and not realize that sometimes the toxicity comes from senior leadership.  You can only defend your people from so much and still keep your position.",
            "score": 18,
            "replies": [
                {
                    "author": "NurseDTCM",
                    "body": "Yeah, I see that.\nJacqui Abram says that the “e” in email stands for evidence.\nThat’s how an employee can help themselves.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Car_is_mi",
                    "body": "ive been the middle manager you describe here, trying to do whats right for my team with a toxic manager above me and while yes, youre not technically incorrect, the difference would be reflected in the fact that the middle manager is clearly burned out and rather transparent with their team about where the commands are coming from. Like despite having a toxic manager above me I would never steal credit, create fear, make promises I cant keep, gaslight, play favorites, etc. etc.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Fit_Bus9614",
            "body": "This was my last job. All of it.",
            "score": 6,
            "replies": [
                {
                    "author": "NthDegreeThoughts",
                    "body": "Cabinet member ?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Imaginary_Most_7778",
            "body": "I’m going to send this to my ex boss.",
            "score": 5,
            "replies": [
                {
                    "author": "Initial-Damage1605",
                    "body": "I wouldn't waste my time if I were you. Most people who fit this bill are narcissists and they'll either flip it against you or use to harass you.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "SadDirection3693",
            "body": "Trump?",
            "score": 9,
            "replies": [
                {
                    "author": "SweetAddress5470",
                    "body": "Spot on",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "tallicafu1",
            "body": "Dealt with this exact type of asshole last year.",
            "score": 3,
            "replies": []
        },
        {
            "author": "rogerio777",
            "body": "They just described Trump... yet half of us picked him for the job. Some companies like these types of bosses...",
            "score": 9,
            "replies": [
                {
                    "author": "Guillotine-Wit",
                    "body": "It wasn't half. There were 220 million registered voters and he got 77 million votes.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "nycdiveshack",
                            "body": "The folks under 25 really didn’t care this time",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Kierarktina-1234",
            "body": "I am so so glad my current team lead is the complete opposite of this. Working with them is awesome. I just wish it paid more and was in my degree area😢",
            "score": 2,
            "replies": []
        },
        {
            "author": "slimdawiz",
            "body": "So basically the president of the United States got it",
            "score": 2,
            "replies": []
        },
        {
            "author": "Baseballmom2014",
            "body": "Yep, that's my former director to a T!",
            "score": 1,
            "replies": []
        },
        {
            "author": "RoundPlum3211",
            "body": "are there managers who aren't like this?",
            "score": 1,
            "replies": []
        },
        {
            "author": "boomjay",
            "body": "They should add obstructionist -- when you find a solution to the problem, they tell you that won't work without any evidence (or require continuous trade studies to prove it to them), but they hound you continuously for a solution and blame you for not finding one quickly enough. \n\nMaybe that's just a subset of gaslighting.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RequirementRoyal8829",
            "body": "Ya, I believe this was developed at Harvard, adopted by most every university, and pretty much expected of one when applying for a managerial position",
            "score": 1,
            "replies": []
        },
        {
            "author": "veggieblondie",
            "body": "How do I send this to a previous manager lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "ayannauriel",
            "body": "This is my manager, sadly.",
            "score": 1,
            "replies": []
        },
        {
            "author": "XNightWalkerXD",
            "body": "Not going to lie alot of people that get put into higher rank will abuse power as soon as they can that if they know the plant Manger has their back or the company dgaf about the lower ranks. Had to deal with a boss that had all these traits for 2 years and 8 months eventually I went to therapy and my therapist told me the long term effect are going to be a long recovery.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ayystarks",
            "body": "What happens when 11/12 apply. Do I congratulate him on not doing the one?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok-Mycologist2220",
            "body": "Unfortunately those are also the skills they teach in business school. Actually talking to and knowing what your employees do makes it harder to see them as replaceable numbers on a spreadsheet.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mike312",
            "body": "CEO at my last job engaged in at least 9 of the 12.\n\nIt's been almost 6 months since I got let go and I'm still recovering from the burnout and stress.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Heimeri_Klein",
            "body": "Yea i had a few bosses like this in the past funnily enough some coworkers like this at points as well not very often but when i encountered them it always confused me like. Bro your on the same level as me doing the same work and we both make mistakes why be a dick about it instead of just talking about it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "robtmufc",
            "body": "This sums up my current manager to a T",
            "score": 1,
            "replies": []
        },
        {
            "author": "Chainmale001",
            "body": "Dollar Loan Center Bingo.",
            "score": 1,
            "replies": []
        },
        {
            "author": "properproperp",
            "body": "Micromanaging only happens when people aren’t capable of doing the job at the expected level. If i micromanage you it’s because i can’t trust you to do your job even after ensuring you are properly trained. Don’t want it to happen? Don’t make mistakes / not do tasks that come back to me and you will never hear from me. \n\nMy best employees get pretty much zero follow-up communication from me about their work, the shitty ones get it daily until they can prove to me they don’t need it. \n\nTough luck",
            "score": -6,
            "replies": []
        }
    ]
}