{
    "title": "Unemployed for 1.5 years",
    "author": "warrior4202",
    "subreddit": "jobs",
    "rank": 17,
    "score": 5,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 2,
    "url": "https://www.reddit.com/r/jobs/comments/1jegh6c/unemployed_for_15_years/",
    "id": "1jegh6c",
    "selftext": "I was laid off after a year in strategy consulting after college, and haven't landed anything since, though I've had a fair amount of final round interviews. What jobs can I even get with a consulting background? I was told I could get strategy, operations, growth, corporate strategy, etc. roles after consulting, but I barely see any of those postings on LinkedIn and Indeed. I know the market is bad right now, but I'm feeling really lost and like I don't fit anywhere. For finance roles, I need finance experience, for sales roles, I need sales experience, etc...",
    "comments": [
        {
            "author": "cbdudek",
            "body": "I work in consulting.  Here is the challenge you have.\n\nWhen I hear that you worked in strategy consulting for a year right out of college, I would ask what kind of credentials do you have?  What makes you a strategy consultant with no experience in the field?  I am sure other companies are asking the same thing.  Hell, I didn't know dick when I got my start.  Being put into a consultant position with no experience is just a massive failure waiting to happen.\n\nNo company is going to hire you to be a strategy consultant with 1 year of experience and thats it.  Heck, coming in as a fresh out of college grad, you expect to be working as a consultant in operations?  Growth?  Corporate strategy?  Companies do not hire someone with a year of consulting experience and no other experience to do those things.  Those are for people who have 10+ years of experience working corporate strategy and now they want to be consultants.\n\nWhat did you go to school for?  Maybe look for entry level positions in that area.",
            "score": 1,
            "replies": [
                {
                    "author": "warrior4202",
                    "body": "I majored in Economics but I began my career in strategy consulting because I was told there would be good exit opportunities",
                    "score": 1,
                    "replies": []
                }
            ]
        }
    ]
}