{
    "title": "Tiktok user post alleged video of a returning boss in Elden ring nightreign",
    "author": "Speedwagon1987",
    "subreddit": "GamingLeaksAndRumours",
    "rank": 17,
    "score": 306,
    "upvote_ratio": 0.84,
    "num_comments (reported by reddit)": 109,
    "url": "https://www.reddit.com/r/GamingLeaksAndRumours/comments/1jbtt9i/tiktok_user_post_alleged_video_of_a_returning/",
    "id": "1jbtt9i",
    "selftext": "[ Removed by Reddit in response to a copyright notice. ]",
    "comments": [
        {
            "author": "HydroHomie2077",
            "body": "Is that the gaping dragon from dark souls 1?",
            "score": 112,
            "replies": [
                {
                    "author": "Speedwagon1987",
                    "body": "Precisely",
                    "score": 44,
                    "replies": [
                        {
                            "author": "HydroHomie2077",
                            "body": "Nice",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Jumpster_42",
            "body": "If there will be no Pursuer that invades like Margit in the network test, I riot.",
            "score": 123,
            "replies": [
                {
                    "author": "Sisyphac",
                    "body": "The ants were way worst. They start chain spitting that acid on you.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "GrEeKiNnOvaTiOn",
                            "body": "In the network test, the ants always spawn next to the gravity miners and if you kill them, they drop the gravity magic consumables. Throw three or four of those in the general direction of the ants and 90% of them will die. You don't even need any help to do it and it takes no time. I went for it every match since I figured it out.",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "Sisyphac",
                                    "body": "That is something I really enjoyed about the test. The way you can figure out best methods. One time though I got two randoms that didn’t even want to level up and kept attacking Lorretta I swore they were bots or something. I quit that game after I was trying to solo the first boss. \n\nDid you ever figure out the best way to take out the wormfaces? I usually just didn’t bother. I think there was a basement with three chests at the bottom but it never seemed worth it to kill.EDIT: I also really never got holy damage items.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "GrEeKiNnOvaTiOn",
                                            "body": "I agree. I think figuring out the optimal way through the map is going to be a big thing in Nightreign. There are a lot that you can do even when your teammates aren't coopareting.\n\nFor the wormfaces, you can stun them with fire damage and use boluses for the deathblight but that depend on your drops. Honestly most times we usually sprint past the enemies to the Wormface boss and spam our ults and weapon arts to take it down fast. Or we would simply ignore the ruins.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "author": "Sisyphac",
                                                    "body": "I could see myself taking out the worm faces with the drops. But it seemed way better to get like a plant or hippo on the way. Or even taking out a camp of soldiers.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Gorodrin",
            "body": "man I hope Ornstein & Smough get brought back too",
            "score": 102,
            "replies": [
                {
                    "author": "sarcophagusGravelord",
                    "body": "Damn that would be a perfect Night 2 boss",
                    "score": 29,
                    "replies": [
                        {
                            "author": "mollyfarrenden",
                            "body": "the final bosses of the nights are the new ones",
                            "score": -7,
                            "replies": [
                                {
                                    "author": "XxRedAlpha101xX",
                                    "body": "No? The final boss of night 1 and 2 can be returning bosses.\nIt's the 3rd boss that's completely new",
                                    "score": 13,
                                    "replies": []
                                },
                                {
                                    "author": "sarcophagusGravelord",
                                    "body": "The completely new bosses are the night lords fought on night 3. There will probably be some unique night 1 & 2 bosses as well but the first two nights are the ones that can be returning stuff like centipede demon, tree sentinel, margit, and now it seems gaping dragon :)",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "A_Hideous_Beast",
            "body": "No lie, I was hoping for Gaping Dragon!\n\nSure, he's easy as Hell in DS1, but I like his design.",
            "score": 47,
            "replies": [
                {
                    "author": "mattyyellow",
                    "body": "I don't know, Gaping Dragon (like most DS1 bosses) seems easy in retrospect. They didn't feel easy when you'd been stuck in the depths for hours, hadn't killed the channeler, and thought the drake sword was the only weapon you'd need (IMO).\n\nIt'll be interesting to see what they do mechanically to make it more relevant to the current era of difficulty.",
                    "score": 44,
                    "replies": [
                        {
                            "author": "Yarzeda2024",
                            "body": "The hardest thing about it was the mage sniping you with magic while you try to get through the absolute wall of HP.\n\nIt's more of an endurance test than a boss fight.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "TransfoCrent",
                                    "body": "There's also the random charge forward attack it does that decimates HP and has wonky hitboxes lol",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "bamiru",
                            "body": "centipede demon in the network test was easy.\n\nhis animations were faster than in ds1 i think and he had some more aoe moves.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Flint_Vorselon",
                                    "body": "The mini centipedes also had actual hp values.\n\nIn DaS1 they will most likely die to any attack (2 at most), so no one ever saw their moveset.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "flipperkip97",
                            "body": "I think the Gaping Dragon really was very easy. I still remember there getting there without any estus on my first playthrough and still got him. And I wasn't particularly good at the game. \n\nI definitely expect it to be a bit different in Nightreign.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Yarzeda2024",
                    "body": "It's kind of funny to see Gaping again because the reveal trailer already shows us a dragon with a fairy similar design. It's not a perfect copy, but I think the new dragon was filling the role of big, toothy, mutated dragon.\n\nImagine my surprise when I saw our old friend again.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Jeremiah-Springfield",
            "body": "Playing through DS2 atm, got some bosses that would at least work well for a game like Nightreign - looking glass knight for example. Gaping dragon is a really cool addition. Hope they really focus on that replayability factor with the amount of bosses they use",
            "score": 47,
            "replies": [
                {
                    "author": "bamiru",
                    "body": "dukes dear freja is in nightreign. \n\nshown in promotional screenshots",
                    "score": 37,
                    "replies": [
                        {
                            "author": "Jeremiah-Springfield",
                            "body": "Yeah I saw! I’m playing through DS1,2 and 3 at the same time atm, and all for the first time which has been so much fun. There’s a much bigger amount of duo bosses than I expected across the games, and I think they’re actually mostly frequent in DS3, which surprised me. It’s been making me hype thinking about all the variety they can put into Nightreign with all the boss types they have.\n\nO&S would be super cool, and Artorias I think could be interesting as a pursuer boss like Morgott. I think Nameless will be a pursuer boss, and of course, the pursuer themselves would be good. \n\nI’m just gonna need someone to mod all these bosses into a game already cuz it’s making it hard to wait for release thinking about it!",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "COCAINAPEARLZ",
                    "body": "Looking glass knight is my favorite boss out of any souls game, the summoning mechanic is cool as fuck and the atmosphere of the fight is just fucking SICK.",
                    "score": 9,
                    "replies": [
                        {
                            "author": "SomeNamelessNomad",
                            "body": "I always forget that the knights name is Looking Glass Knight, still call it Mirror Knight despite it being well over a decade now since the beta builds were shown off. \n\nHe would be amazing to fight. I'd personally love Darklurker to have a second chance, since so few bother with the covenant he's tied to. Plus him dividing into multiple entities would work well with the multiplayer focus of Night Reign.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "IronBabyFists",
                                    "body": "Honestly, with the way the Demi Human fight handled lots of enemies, I could see Phalanx fitting well, too. Give em some extra adds and maybe guard counter attacks to make it chaotic... yeah, that could be a neat one. \n\nWouldn't be surprised if the Night 1 boss pool also had a pair of gargoyles just for fun.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "AnIdentifier",
                    "body": "Everyone's thinking it: flexile sentry in chest high water with exploding dudes. Come on fromsoft bring it back",
                    "score": 9,
                    "replies": [
                        {
                            "author": "Clod_StarGazer",
                            "body": "Give it a cool new moveset so both its sides can attack multiple players at the same time come on From I know you want to",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "IronBabyFists",
                                    "body": "Grafted Godskin Sentry: two attached godskin apostle top halves that can each stretch 1/3 the width of the arena.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Speedwagon1987",
                    "body": "The looking glass knight could work only if you were to remove the gimmick of summoning other players and besides most ds2 bosses would feel like pushovers with the new elden ring combat system",
                    "score": 1,
                    "replies": [
                        {
                            "author": "bamiru",
                            "body": "you could make it summon a random npc that is one of the 8 classes",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "IronBabyFists",
                                    "body": "It could mimic tear 1 or 2 of the team (maybe all 3?).",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Jeremiah-Springfield",
                            "body": "Totally get that, yeah, they’re mostly super easy even in the base game. As an idea, though, a boss like that which has a built in mechanic to summon ads the way it does could work? If it was faster and the enemies it spawned were good enough. I also doubt it could make a night boss but a lesser boss totally - I feel like this game will benefit from ‘content’ as well as the usual high quality we expect from their games, for longevity",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Speedwagon1987",
                                    "body": "Yeah that could work as an overworld boss but I genuinely hope for sir alonne and the fume knight to be full fledged night bosses with reworked moveset",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Jeremiah-Springfield",
                                            "body": "Would be so cool! Throne watcher/defender would be cool too. I’m banking on it running on steam deck as that’s my only device right now, but thinking of all the possibilities makes me excited to see what we actually end up getting.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Major303",
                            "body": "I'm pretty sure that old bosses get new moveset. DS1 and DS2 have entirely different combat system than Elden Ring, so just copy and pasting the boss serves no purpose at all.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "0no01234",
            "body": "They posted a higher-quality version [https://www.tiktok.com/@cmz4six/video/7482020669719317782](https://www.tiktok.com/@cmz4six/video/7482020669719317782)",
            "score": 16,
            "replies": []
        },
        {
            "author": "NoPersonKnowsWhoIAm",
            "body": "Shows off a new class too",
            "score": 13,
            "replies": [
                {
                    "author": "extremegun14",
                    "body": "I couldn’t really see what it was. What did it show?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "NoPersonKnowsWhoIAm",
                            "body": "looks like a perfumer class",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "kotn3l",
                                    "body": "its the summoning class, in the first half of the video you can see a big summoned skeleton fighting the boss",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "Gravitas-and-Urbane",
                                    "body": "the video was bad, but that looked like the Nox clothing\n\ntheir entire society was based around liturigcal towns, so it would make sense if they are the faith class\n\ncould be an alternate world where they weren't banished underground",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "SomeNamelessNomad",
                                            "body": "In the reveal travel there is a Nox looking city above ground, in the shot where Wylder is shown mantling just before Nameless King shows up. Plus the Nox having ties to the Night Lord idea in base Elden Ring. \n\nIt seems like a pretty good call to have a Nox character.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "pokeeMonitoR",
                            "body": "It was the summoner class. It showed him summoning the giant ghost skeleton from the mountaintops of the giants",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Yarzeda2024",
                    "body": "This one seems to wearing a long, white veil. \n\nThat seems to shoot down the theory that the summoner was the goat-like creature that shows up near the end of the reveal trailer. I thought that looked like more of a boss design, but the bird-man opens the door to just about anything. I could see it going either way, but some people were really married to the idea of the goat being the summoner.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "MelkorBlackFoe",
            "body": "Gaping Dragon my beloved",
            "score": 12,
            "replies": []
        },
        {
            "author": "waldorsockbat",
            "body": "![gif](giphy|0KQR2jzFKdsT1tzavc)",
            "score": 9,
            "replies": []
        },
        {
            "author": "PS5AmateurGuy",
            "body": "I’ll miss his cute little intro, but I’m excited to face him again! \n\nHopefully he gets some more AOE and uses for that vagina mauler mouth. ",
            "score": 8,
            "replies": []
        },
        {
            "author": "Prsy______",
            "body": "Someone download the video and post here Tiktok is banned in my country smh",
            "score": 34,
            "replies": [
                {
                    "author": "SleepingwithYelena",
                    "body": "Here u go\n\nhttps://streamable.com/ywfo98",
                    "score": 60,
                    "replies": [
                        {
                            "author": "MyClericalGnomance",
                            "body": "![gif](giphy|okLCopqw6ElCDnIhuS|downsized)",
                            "score": 27,
                            "replies": []
                        },
                        {
                            "author": "eat-skate-masturbate",
                            "body": "I love short haired to mboys (unrelated to the video)",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "MercerEdits",
                            "body": "Awesome",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Resistance2X",
                            "body": "Needs reupload, its deleted.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "cdts2192",
            "body": "Replied to a comment about different biomes, saying there are many more.",
            "score": 6,
            "replies": []
        },
        {
            "author": "ImBuGs",
            "body": "I mean this game HAS to have Artorias, right? It fits so well with the theme I'd be disappointed if he's not there.",
            "score": 5,
            "replies": [
                {
                    "author": "TransfoCrent",
                    "body": "Would be cool, but I get the feeling they wanna avoid bosses that are especially lore-heavy.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "2Dement3D",
            "body": "This game really does feel like a celebration of Dark Souls within Elden Ring, and I'm all for it. I do wish it had bosses from all the Soulsborne series, but it's understandable that they likely won't due to the different mechanics in Bloodborne/Sekiro compared to Dark Souls/ER.",
            "score": 15,
            "replies": [
                {
                    "author": "mattyyellow",
                    "body": "They legally wouldn't be able to include anything from Bloodborne without Sony's permission as they own the IP. Sekiro I'm less certain about, Activision published it but I'm not sure what rights they have beyond that.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "marsgreekgod",
                            "body": "From what I ready they fully own the rights ",
                            "score": 10,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "DeMatador",
            "body": "Can't watch it without signing up to the app. Where's \"tiktokcancel\"?",
            "score": 5,
            "replies": []
        },
        {
            "author": "Yarzeda2024",
            "body": "Someone on the main Night Reign sub collected a list of interesting bullet points about this leaker.\n\n[Leaked information from the Tiktok game tester : r/Nightreign](https://www.reddit.com/r/Nightreign/comments/1jbvf91/leaked_information_from_the_tiktok_game_tester/)",
            "score": 3,
            "replies": []
        },
        {
            "author": "TheThotality",
            "body": "The Gape is back",
            "score": 5,
            "replies": []
        },
        {
            "author": "CelioHogane",
            "body": "NO, NOT THIS PIECE OF SHIT!",
            "score": 5,
            "replies": []
        },
        {
            "author": "LeonSigmaKennedy",
            "body": ">Actually interesting leak\n\n>can't watch it because I don't have Tik Tok\n\n...damn..",
            "score": 14,
            "replies": [
                {
                    "author": "awoogr",
                    "body": "Me neither but some dude posted the video in the comments \nhttps://www.reddit.com/r/GamingLeaksAndRumours/s/bKXicgYnco",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "goingtocalifornia25",
                    "body": "tip, if you remove everything after the question mark in the URL you can watch it in browser without needing the app.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "youknowitslucasio",
            "body": "I am absolutely 100% confident Fromsoft is remaking Dark Souls 1 in house, they’re remaking entire character models and move sets from that first game. Seeing the success of Demons souls, resident evil, shadow of the colossus, Mario, silent hill, dead space, and every other remake coming out these days I should’ve figured Bandai namco would jump on the train remaking one of their most iconic games. ",
            "score": 3,
            "replies": [
                {
                    "author": "Namtar_Door_783",
                    "body": "If anything ds2 is one who deserves remake the most out of the three it has a lot of contents and crazy stuff that if add it will be the best souls in the series.\n\nAnd besides even if they change some stuff it won't hurt considering how ds3 avoided ds2 story and focused on ds1.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Icy-Blacksmith-4214",
            "body": "we need some kind of tiktokcancel based in a tiktokninite.",
            "score": 3,
            "replies": []
        },
        {
            "author": "chazzawaza",
            "body": "I have a feeling the returning bosses will be ones that aren’t super important to their respective games. Centipede demon and gaping dragon, to me, are bosses that are more just monsters in there world that need to be killed. Bosses like bed of chaos and Ornstein and smough and more important and I just don’t see them appearing.",
            "score": 5,
            "replies": [
                {
                    "author": "GrEeKiNnOvaTiOn",
                    "body": "Like the Nameless King who isn't at all important.",
                    "score": 17,
                    "replies": [
                        {
                            "author": "chazzawaza",
                            "body": "I could see almost every boss being eligible for appearance in nightrein from ds3. Nameless king included. Ds1 not so much. Probably all the main bosses in ds3 like yhorm and the twin princess, abyss watchers and Aldrich won’t appear.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "chazzawaza",
                            "body": "Look at that the leaker just confirmed exactly what I said lol in another post 😅",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "SiyoSan",
            "body": "Bruh",
            "score": 3,
            "replies": []
        },
        {
            "author": "doyouevennoscope",
            "body": "Noooooooo oh my god I got stuck on this boss for months. With a mix of hollow, underleveled, and being an idiot this dude was harder than Malenia. I am NOT happy!\n\nJk kinda cool to see old bosses coming back ngl",
            "score": 2,
            "replies": []
        },
        {
            "author": "Visual-Situation-346",
            "body": "Fuck I do t have tiktok",
            "score": 2,
            "replies": [
                {
                    "author": "sinktheirship",
                    "body": "Gaping Dragon",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "broebt",
            "body": "I love the vagina dragon! 🐉",
            "score": 6,
            "replies": []
        },
        {
            "author": "MarcsterS",
            "body": "Some bosses were easier than others in the beta. We bullied the hell out of Centipede Demon, but the *3 Tree Sentinels* felt like the hardest one. \n\nI hope Pre-DS3 bosses get a bit of a balance change around ER mechanics.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheFletchmeister",
            "body": "Gaping Dragon’s design has always been so striking to me, this is awesome to see",
            "score": 1,
            "replies": []
        },
        {
            "author": "Temporary7000",
            "body": "I swear we knew this already. Sure there wasn't a glimpse of it in marketing before?",
            "score": 1,
            "replies": [
                {
                    "author": "supermariozelda",
                    "body": "There was a similar dragon enemy but not the gaping dragon specifically.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Poetryisalive",
            "body": "What’s the video? If you don’t have TikTok you can’t view it",
            "score": 1,
            "replies": [
                {
                    "author": "sinktheirship",
                    "body": "Gaping Dragon",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "abeardedpirate",
            "body": "Doubt. Unless that is the 8th class or a skin this is prob just an ER mod.",
            "score": -3,
            "replies": []
        },
        {
            "author": "No_Concentrate_7033",
            "body": "idgaf ab the gaping dragon, that prophet class looks dope.",
            "score": -4,
            "replies": [
                {
                    "author": "ThyUnkindledOne",
                    "body": "I gaf about the gaping dragon :(",
                    "score": 5,
                    "replies": [
                        {
                            "author": "No_Concentrate_7033",
                            "body": "fair. i am just more hyped on the new class",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "bamiru",
                    "body": "its a summoner",
                    "score": 2,
                    "replies": [
                        {
                            "author": "No_Concentrate_7033",
                            "body": "very cool. how do you know?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "bamiru",
                                    "body": "https://www.tiktok.com/@cmz4six/video/7482020669719317782\n\nthe uploader posted another video in higher quality. you can see the spirit skeleton that the player summoned and OP said in comments its a summoner.\n\n\nalso one of the release 8 classes being a summoner has been known about since before the network test.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "No_Concentrate_7033",
                                            "body": "i can’t view tiktoks but i’ll take your word for it",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "WorthSleep69",
            "body": "Fromslopware",
            "score": -28,
            "replies": [
                {
                    "author": "Lakatos_00",
                    "body": "4chan is over there, kid 👉",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "Heisenburgo",
            "body": "I clapped and shidd my pants when they put the Glupshitto dragon from a 15 year old game from two generations ago in this new game... in the eternal words of Cap America, I understood that reference... bravo Vince, I mean Nolan, I mean Kojima, I mean Miyazaki...",
            "score": -32,
            "replies": [
                {
                    "author": "Incu0sty",
                    "body": "Are you alright, bro?\n\n\nHospital is down the road to the right.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Lakatos_00",
                            "body": "Right down the road! Can't miss it!",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "code_gremlin",
            "body": "despite how often Fromsoft refuses their assets (rigs, animations, etc), everything about Nightreign just looks miserably lazy and slapped together.\n\nshits gonna suck",
            "score": -9,
            "replies": []
        },
        {
            "author": "Ricksaw26",
            "body": "The main mechanic of gaping dragon was that he destroyed weapon durability. Without that, what can he do? I mean, other than hitting you with that ginormous body.",
            "score": -5,
            "replies": [
                {
                    "author": "Speedwagon1987",
                    "body": "Main mechanic is a stretch, he literally had only one attack that caused weapon degradation and he barely used it",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "bamiru",
                    "body": "i have >400 hours in ptde/remastered and learned TODAY that gaping dragon's acid attack reduces weapon durability.\n\ni really wouldn't consider it the main mechanic of the fight",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Successful-Buddy-470",
            "body": "Elondusk and doomtrump End game bosses",
            "score": -7,
            "replies": []
        }
    ]
}