{
    "title": "Indianna Jones pre order for ps5 up early in France with an April 17th release date.",
    "author": "DarahOG",
    "subreddit": "GamingLeaksAndRumours",
    "rank": 3,
    "score": 197,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 47,
    "url": "https://www.reddit.com/r/GamingLeaksAndRumours/comments/1je8u90/indianna_jones_pre_order_for_ps5_up_early_in/",
    "id": "1je8u90",
    "selftext": "Just received a notification that Indy was available for pre-order here :\n\nhttps://www.fnac.com/a21385349/Indiana-Jones-et-Le-Cercle-des-Anciens-PS5-Jeu-video-Playstation-5?eaf-publisher=AWIN&eaf-name=generiqueaff&eaf-creative=generiqueaff&eaf-creativetype=1x1&eseg-name=AWINID&eseg-item=297733&Origin=Awin297733&sv1=affiliate&sv_campaign_id=297733&awc=12665_1742314393_bce2f1432eb59009bbc431634277d62c ",
    "comments": [
        {
            "author": "Sweaty_Buttcheeks",
            "body": "Anyone who's a fan of the original trilogy movies will adore this game. It channels the overall feel from the movies so well. It's an absolute blast from start to finish",
            "score": 59,
            "replies": [
                {
                    "author": "hawk_ky",
                    "body": "Agreed, but I don’t think you even need to be a fan of the movies. It’s just a fantastic game overall",
                    "score": 20,
                    "replies": []
                },
                {
                    "author": "-Kars10",
                    "body": "Thank you Mr. Sweaty Buttcheeks",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Joshs2d",
                    "body": "Machine games always does a good job, I’ll get it anywyas",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "bms_",
                    "body": "I'm a fan of the original movies and dropped the game after an hour",
                    "score": -8,
                    "replies": []
                },
                {
                    "author": "ametalshard",
                    "body": "I deeply despise the movies but enjoyed the game well enough. I'd give it a 7/10.",
                    "score": -4,
                    "replies": []
                },
                {
                    "author": "tomsawyer222",
                    "body": "Is it like uncharted",
                    "score": -1,
                    "replies": [
                        {
                            "author": "Halil-Heyman",
                            "body": "It's nowhere near that in terms of similarity, if anything it's more like an immersive sim but you play as the most normal human being ever in terms of skills but because it's im-sim general design is absolutely top notch so you have a lot of fun while you play it. Don't go into game expecting set piece after set piece, it's not that. (just like the other Indiana Jones stuff!)",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "tomsawyer222",
                                    "body": "Thanks, I have heard it’s a great game elsewhere too, will be getting this one!",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Halil-Heyman",
                                            "body": "Little suggestion, watching Raiders before playing it probably is a great idea since there are cool callbacks especially in the beginning that I think will make the experience more enjoyable. Totally fine you go blind too though!",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "DnWeava",
                            "body": "It's way better.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "RollingDownTheHills",
            "body": "In that case I very much doubt the Oblivion remake April shadow drop that some have been going on about.",
            "score": 33,
            "replies": [
                {
                    "author": "Stuza95",
                    "body": "I don't think it'll drop April. Going theory is an announcement  March-April with it releasing early June.",
                    "score": 16,
                    "replies": [
                        {
                            "author": "Active_Mall7667",
                            "body": "Imo, shadow drop during xbox showcase of june",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Wrong_Attention5266",
                    "body": "Watch the oblivion remake be a nothing burger like the “god of war Greek saga” remake. \n\n\nSeriously if you dnt know there was supposed to be a god of war Greek saga remake but it turns out it was just a celebration of god of war being 20 years old and they’re releasing a book called gow Greek saga.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "TheWorstYear",
                            "body": "The rumor is based entirely off of a document thrown together just for the Xbox acquisition. Realistically the document had a lot of 'whatever' to it. Business people demanding a full report on the future of the company, & getting back the best that could be come up with because developers don't really plan that far ahead.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "Particular_Hand2877",
                                    "body": "The problem with the document is it was just a road map. You can throw whatever you want in the road map. In that same document, it showed Starfield releasing in 2022 (I believe). That alone tells you how out of date that road map was.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "TheWorstYear",
                                            "body": "2021 actually. Which was the originally intended release date.    \n>The problem with the document is it was just a road map. You can throw whatever you want in the road map\n\nYep. There's games on there that will never release because the studio closed down. And games that weren't on there that are being made/have been made.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Particular_Hand2877",
                                                    "body": "My fault, yeah 2021. People really took that and ran with it. I just shook my head.",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Signal_Ball4634",
                    "body": "I've been taking everything regarding that with a grain of salt honestly. Nothing concrete to show for this beyond the timeline from the Microsoft trial.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Carlosless-World",
            "body": "Will like enjoy is if i love uncharted and tomb raider? I haven't watched any of the Indy movies",
            "score": 4,
            "replies": [
                {
                    "author": "robertman21",
                    "body": "Maybe? This has a way bigger puzzle focus and less combat focus than Uncharted\n\nYou should really watch the movies though",
                    "score": 11,
                    "replies": [
                        {
                            "author": "3ConsoleGuy",
                            "body": "You can make it combat focused. Once the combat clicks you just run around Giza looking for large camps of Nazis to beat up, push off cliffs, whip, shoot, and throw pots and pans at. It’s entertaining as hell.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "ametalshard",
                            "body": "the movies are full of racist and sexist tropes and that's really only the stsrt of their problems",
                            "score": -7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LeoDaWeeb",
                    "body": "Never seen the movies but absolutely loved the game!",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Iamleeboy",
                            "body": "Go and watch them. The original trilogy are some of my favourite films ever. You will surely not be disappointed",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "MisunderstoodBadger1",
                    "body": "Probably, there are a lot more first person gameplay than those other games though.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Negativ3zerox",
            "body": "You can also preorder the standard version inside a GameStop stores",
            "score": 3,
            "replies": []
        },
        {
            "author": "Fair-Tree-3542",
            "body": "Highly recommend",
            "score": 1,
            "replies": []
        },
        {
            "author": "Game_Changer65",
            "body": "im little scared that the pre orders are this close to its release.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Melodic-Unit3177",
            "body": "Too late. All hype for this game has vanished",
            "score": 0,
            "replies": [
                {
                    "author": "WaffleMints",
                    "body": "For you...",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 0,
            "replies": []
        },
        {
            "author": "Gbrush3pwood",
            "body": "I was always thinking april for this but I'm starting to doubt they are launching, physical copies and all, in less than a month without giving a date. They already gave a date to forza that was announced long after this. I suspect it's slipped. May-June would be my guess. But I could be wrong.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Ok-Potato1693",
            "body": "How do you Playstation players feel 80€ price tag? Is prices like this normal in Playstation? \n\nIn Xbox you pay 15€ for one month of Game Pass and complete this easily in 1-2 weeks and spend rest whatever you want, new Cod or Forza or something else.",
            "score": -10,
            "replies": [
                {
                    "author": "WeirdoTZero",
                    "body": "\"Why do players want to buy games when you can rent them from Blockbuster\"?  \nBecause some people just want the game. Your mileage may vary, but if the game is good enough, it'll be worth the price(so long as it's not ridiculously high like $100 bucks or something).",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "TomAto314",
                    "body": "I personally don't like a time limit hanging over my head. Even if it's plenty of time. That said, I won't pay $70 for this but will just wait until it's on sale.\n\nIt's not like some tiers of PS+ don't offer a similar service either (although I admit gamepass seems superior) so it's not like this is an objectively foreign concept to PS players.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "NeonPistacchio",
                            "body": "This is so true. Subscriptions for movies and series, maybe. But for games, i don't like to have this time limit in the back of my head whenever i start a new game and have to think \"quick! I have to finish this game in one month or else i can't play it\", it's just not relaxing to me. \n\nWhen i buy the game, i can always go back to the game whenever i want as i often do on PS, without any time limits.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "TomAto314",
                                    "body": "I bought a month of PS+ Extra since I saw like 5 games in my wishlist were on it. I noticed I gave up on them a lot quicker than I would have if I bought them. (Maybe that's a good thing...) Then Jedi Survivor released mid my month so I scrambled to get through that. Still though for $15 it was a helluva value but I wouldn't want to live like that if that makes sense.\n\nReally though, I think the original comment was just firing a console war shot.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Gbrush3pwood",
                    "body": "I've had gamepass and it's fun for a while but for me I really just don't see the value in a continuous subscription. I'd rather buy the games that i am wanting physical, as they are never full price rrp here anyway, and actually own the games to play whenever I like with out having to pay a continuously rising subscription to rent them. Not cost effective in my books. I don't play every single game that comes out just because. I don't have the time.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Ok-Potato1693",
                            "body": "No really any need to continuous subscription. For example, new Doom comes soon, so I go to grocery store and pick card with 1 month Game Pass code for 15€ and will beat shit out of Doom during those 30 days and while doing that I easily complete South of Midnight also, 45€. Compared to 125€ they ask for those, I see 15€ extremely cost effective.",
                            "score": -1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "NoBlackberry9480",
                    "body": "I don’t mind paying $70 for great games like DS2 or Ghost of Yotei.  I also can wait till it’s much cheaper and use GameFly for any new releases.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "JohnnyMelon",
                    "body": "In canada, gamepass is 23$ a month before tax so about 3 months is a full game price. No possibility of paying for a yearly membership so you pay about 300$ a year to play on gamepass. PS+ offer yearly subscription for 129$ a year during sales. I prefer paying for yearly ps+ and buying some games I want vs paying 300 a year on xbox and supporting an american brand",
                    "score": -1,
                    "replies": [
                        {
                            "author": "Da-Rock-Says",
                            "body": "You're comparing the sale price of one subscription while rounding up (12x23=276) the others regular non-sale price. Try comparing the sale prices of both and make sure you're comparing the highest tier of both subscriptions too.\n\n\nThe actual determining factor should be the games you play. If you're a casual gamer who only plays a couple games a year then neither subscription is going to be good for you. However, if you play a lot of games then both subscriptions can be good.\n\n\nIf you're interested in the games releasing day one on GamePass then it's a no brainer unless you need to own the games. Personally I've played/will play Indiana Jones, Avowed, Ninja Gaiden 2, Ninja Gaiden 4, Clair Obscur: Expedition 33, Doom: The Dark Ages, South of Midnight, The Outer Worlds 2, the rumored Oblivion remaster/remake, and a handful of smaller games all on day one via GamePass. I also own a PS5 but if I wanted to play all of those games on it on day one I would have to pay over $600 for them. That's only one year of games too. Over the course of a generation it's possible to save thousands of dollars by playing games through subscriptions instead of buying them. Again though, if you care about owning the games or you don't play many games then that's different.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "JohnnyMelon",
                                    "body": "Yep so a subscription with hundred of games + 2 full price games. Xbox games are trash sadly",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}