{
    "title": "The Cartier Patiala Necklace was made up of five chains and a neck collar. It was set with 2,930 diamonds. One of these was the world’s seventh-largest diamond, known as the De Beers Diamond, weighing 234.65 carats in its final setting. It's been missing since 1948.",
    "author": "Majoodeh",
    "subreddit": "interestingasfuck",
    "rank": 7,
    "score": 3309,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 153,
    "url": "https://i.redd.it/rxsrrcqheepe1.jpeg",
    "id": "1jdzajt",
    "selftext": "",
    "comments": [
        {
            "author": "vanillavick07",
            "body": "It's in someone's grandmother's attic",
            "score": 1,
            "replies": [
                {
                    "author": "Midnight_Noobie",
                    "body": "https://en.m.wikipedia.org/wiki/Patiala_Necklace\n\nIn 1998, part of the necklace was found at a second-hand jewellery shop in London by Eric Nussbaum, a Cartier associate.[1] The remaining large jewels were missing, including the Burmese rubies and the 18 to 73 carat diamonds that were mounted on a pendant. Cartier purchased the incomplete necklace and, after four years, restored it to resemble the original. They replaced the lost diamonds with cubic zirconia and synthetic diamonds, and mounted a replica of the original \"De Beers\" diamond.[4][7][8]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "homer_lives",
                            "body": "Interesting.   Someone stole it and broke it down to sell.  Wouldn't be surprised if the big jewels were broken into smaller ones and sold similarly.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "cfiggis",
                                    "body": "You'd pretty much have to break it down. You can't sell it whole - it's too easy to identify as stolen. And even the larger jewels by themselves likely would raise suspicion. Plus, there's not many buyers for huge jewels. Easier to find many smaller buyers. And more anonymous, too.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "1nMyM1nd",
                                    "body": "Couldn't imagine cutting the large diamond up. If it was in my possession, I'd probably make a shrine for it.\n\nMaybe it's on its own adventure like the gold poop in American Dad.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Terminator7786",
                                            "body": "I love that side story so much",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Sinistermiinister",
                            "body": "Typical British, always taking things that don't belong to them",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DaxExter",
                    "body": "*using it as a door stopper",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Illustrious_Donkey61",
                            "body": "![gif](giphy|l0HlUxyetfxeRbbsk)",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ShahinGalandar",
                    "body": "but granny will rather throw it into the ocean because of some fling she had as a teenager than give it to her heirs, those greedy fucks had it coming",
                    "score": 1,
                    "replies": [
                        {
                            "author": "federon1",
                            "body": "I guess some divers were already waiting under the vessel /s",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "andersaur",
                    "body": "And just as useful an object in an attic, or jewelry box, or somewhere industrial. Diamonds are silly. Have one? Cool! Pining for one? Get ya shit straight.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "wheelz5ce",
                    "body": "Right next to the Russian box of trinkets",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "AtticusStacker",
                    "body": "But I hear she had to eat chilled monkey brains to get it.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Eis_ber",
            "body": "I would not be surprised if it's in a Swiss vault or was broken into pieces and sold years ago. And the obligatory fuck De Beers.",
            "score": 1,
            "replies": [
                {
                    "author": "Midnight_Noobie",
                    "body": "Ding ding, you're a Winner!\n\nhttps://en.m.wikipedia.org/wiki/Patiala_Necklace\n\nIn 1982, at the Sotheby's Patiala Royal Family auction in Geneva, the \"De Beers\" diamond reappeared.[5] There, the bidding went up to $3.16 million, but it is unclear whether it met its reserve price.[6]\n\nIn 1998, part of the necklace was found at a second-hand jewellery shop in London by Eric Nussbaum, a Cartier associate.[1] The remaining large jewels were missing, including the Burmese rubies and the 18 to 73 carat diamonds that were mounted on a pendant. Cartier purchased the incomplete necklace and, after four years, restored it to resemble the original. They replaced the lost diamonds with cubic zirconia and synthetic diamonds, and mounted a replica of the original \"De Beers\" diamond.[4][7][8]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "givemethebat1",
                            "body": "That doesn’t make sense. Why is the De Beers diamond missing if it was up at auction? What happened to it after?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "rudolph_ransom",
                    "body": ">Swiss vault\n\nGeneva Freeport is a high possibility",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "SrJeromaeee",
                    "body": "This necklace was worth 2.5 billion USD when it was commissioned a century ago. It turned up in the 80s incomplete and missing all its stones, but if restored properly would easily be the largest private auction sale ever, surpassing the 1.6b mark.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Hurl_Gray",
                    "body": "Fuck de beers?  I love beer.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Milton_McGee",
            "body": "*glances over at the UK*",
            "score": 1,
            "replies": [
                {
                    "author": "shaunoffshotgun",
                    "body": "We'd have put it on display if we took it.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "DolphinSweater",
                            "body": "Can we have it back?\n\nNo! We're still looking at it!",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Mathoosala",
                                    "body": "Great skit",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "GoingAllTheJay",
                                    "body": "Maybe they can buy it back after raising funds with a honey scam.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "MuricasOneBrainCell",
                            "body": "\"The British Museum\" has 1% of items collected on display. \n\nThe same for the Smithsonian.\n\nMost of the stolen items just sit in a fucking box.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Citrinitas115",
                                    "body": "To be fair museums do rotate through some of their items so things don't get stale or damaged by UV exposure. I think you can request to view a specific item from the Smithsonian collection, not sure if you need to be an academic or not but that might be different from museum to museum",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Edwardteech",
                                    "body": "Tbf they aren't being blown up by their home countries either. ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "SophiaofPrussia",
                                            "body": "[Yes, because the British Museum is nothing if not meticulous in ensuring the security and maintaining custody of the items they’ve looted.](https://www.bbc.com/news/entertainment-arts-68665773)\n\nI know what you’re thinking: with so many items in their collection how could they have possibly known? It’s not like they’re going to get an email “Subject: FYI- your precious gems are listed on eBay?” [Oh, wait…](https://www.nytimes.com/2023/08/22/arts/design/british-museum-thefts.html?smid=nytcore-ios-share&referringSource=articleShare)",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "MistbornInterrobang",
                                                    "body": "'The museum's legal representatives, Daniel Burgess and Warren Fitt, told the court how a 1993 audit of a storeroom showed that there were 1,449 unregistered items present, but during another audit in 2023, 1,161 - just over 80% of those items - were missing from the same storeroom.\" \n\n... That seriously suggests they didn't audit for 30 years OR it took them 30 years to catch him. That is batshit insane",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "MuricasOneBrainCell",
                                            "body": "Ahhh, the classic colonial response. \n\nYou're a moron. Do you know how many objects have been damaged by these museums? Do a bit of research instead of parroting colonial ballshit.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "shaunoffshotgun",
                                                    "body": "You OK babe?",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "SpasmodicSpasmoid",
                                                    "body": "You hurt?",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Edwardteech",
                                                    "body": "Funny thing. All the natives who bitch about their stuff being gone. Their great grandparents helped the British dig this shit up or sold them itsms they themselves robbed from graves of their ancestors. \n\n\nDon't try to make me feel bad for people who helped cart of their own history and want it back now.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "Frikoulas",
                                                            "body": "Yeah, a few starving locals in a war are to blame, not the thieves.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "YoungPotato",
                                                                    "body": "The techbro above you is sad his fingernail has more of a culture than his museums so they had to justify the imperialism of stealing other countries artifacts lol",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "avantgardengnome",
                                                            "body": "As if the British army was some league of gentleman anthropologists lol. Some of those wise and benevolent adventurers decided that the Rosetta Stone would look better with “Captured in Egypt by the British Army in 1801” and “Presented by King George III” carved into the sides—the fucking Rosetta Stone!",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "pickyourteethup",
                                            "body": "One time that happened okay!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Thiswilldo164",
                            "body": "accurate - the Brits are pretty comfortable telling everyone to piss off when other countries ask for their stuff back it seems.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "randomisation",
                            "body": "And then charged you to have a look at it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Praetorian_1975",
                    "body": "Hey hey hey we left in 1947, so it wasn’t us … keep glancing 😂",
                    "score": 1,
                    "replies": [
                        {
                            "author": "iiko_56",
                            "body": "https://preview.redd.it/gjcdqek6zepe1.jpeg?width=225&format=pjpg&auto=webp&s=2b5bef7802228f7ce91fb3a10c28065ee3c326be",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Praetorian_1975",
                                    "body": "![gif](giphy|UWnKOebQraQhxmZPuC)",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "bhodrolok",
                            "body": "The last governor left in 1948",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "ShahinGalandar",
                                    "body": "and he had a coincidentally heavy suitcase with him on his way out",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Praetorian_1975",
                                            "body": "Prison pocket, walked funny with a bad gimp 😂",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "trwwypkmn",
                            "body": "It was that last guy on his way out.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Praetorian_1975",
                                    "body": "Damn it, he was only supposed to blow the bloody ~~doors off~~ candles out",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "divine-silence",
                    "body": "What this? Oh that’s just my car seat beads.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Captn_Deathwing",
                            "body": "Average RR",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Severe-Rope-3026",
            "body": "they put a billion dollars of tiny things on a rope and someone ran off with it\n\n\ngreat plan",
            "score": 1,
            "replies": [
                {
                    "author": "Few_Commission5964",
                    "body": "It's only a billion dollars if someone is ready to pay that amount. Otherwise it's just a rock or crystal. ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "pickyourteethup",
                            "body": "I am prepared to pay that amount. Now I just need to find someone prepared to lend me a billion dollars.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "PapaMooze",
                                    "body": "I’m prepared to lend you that much. Now I just need to sell that ol’ necklace thing I got from my uncle who was governor in India. Now wonder where I put it.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Eject_The_Warp_Core",
            "body": "It most likely doesn't exist anymore. You can't sell the stolen Cartier Patiala necklace, but can sell a lot of loose diamonds.",
            "score": 1,
            "replies": []
        },
        {
            "author": "blaque_1",
            "body": "De Beers are missing at my place too",
            "score": 1,
            "replies": [
                {
                    "author": "jinandgin",
                    "body": "![gif](giphy|hXD3cypLkycW1hQTFz)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "KingAhDugShite",
            "body": "The British absolutely have this lmao",
            "score": 1,
            "replies": [
                {
                    "author": "AdjectiveNoun111",
                    "body": "If we took this we'd have it on display in a museum, where we put all the rest of our hard won trophies.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Kujo3043",
                            "body": "\"Hard won\"",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Fugiar",
                                    "body": "Yes that was his joke good job",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Enginerdad",
                            "body": "There's no \"we\" here. British or not, no part of you will ever have any part of that necklace or any other stolen treasure.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Square-Primary2914",
                                    "body": "Yeah like most things people say a country did. You never won ww1 or ww2. I didn’t burn down the White House but we say “we burnt down the White House”. You didn’t lose in the 4 nations hockey game but it’s common to say “we lost”. Canada won and I say “we won” i didn’t play so I didn’t win but it’s what you say in reference to your team or country. \n\nStay in Connecticut bud.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Praetorian_1975",
                    "body": "No mate we left in 1947, it’s more likely that in the power vacuum it was snatched / sold. Or it’s in some one’s granny’s brothers aunties uncles hairdressers sock drawer.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Khan-Khrome",
                            "body": "Either that or someone cut it down the sold the diamond pieces as individual parts, everyone would recognise and question it in its full state, nobody would if it's in a couple dozen pieces.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Crafterlaughter",
                                    "body": "Well, they did find part of the necklace in a secondhand jewellery shop in London with the stones removed… so it’s possible the rest of it was dismantled there and sold off in parts as well.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Savethelasttaco",
                            "body": "So the UK has it.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Praetorian_1975",
                                    "body": "No mate, the US took over from the UK in the ‘let’s take other peoples stuff’ around about that time, have you tried looking under their mattress 😂",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "pickyourteethup",
                    "body": "Got us, it's a doorstop in my local pub. We piss on it at new uears",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "PeanutFarmer69",
                    "body": "The necklace’s Wikipedia article outlines exactly what happened to it lol\nhttps://en.wikipedia.org/wiki/Patiala_Necklace\n\nClick baity ass headline, it hasn’t been missing since 1948, the patiala family auctioned the center diamond in 1982 and various pieces were found in London. Cartier used the pieces it found of the necklace to recreate it in 1998.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Naive_Badger_269",
            "body": "Theory is - Kingdom of Patiala during his downfall sold it bunch of their jewellery and advertised it as stolen because of insult.\n\nPicture of another necklace that resurfaced recently.\n\nhttps://preview.redd.it/n7tmkvvmqfpe1.jpeg?width=1355&format=pjpg&auto=webp&s=6cf8bc61f02cb219d2566340e8614441404464bb",
            "score": 1,
            "replies": [
                {
                    "author": "cornflakegrl",
                    "body": "Who wore it better?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Devchonachko",
            "body": "Neville Chamberlain bought it from Maharaja Bhupinder Singh of Patiala, who needed money after England split from India and the economy crashed. Bhupinder claimed it was stolen to avoid the disgrace and potential fallout of selling a national treasure and reaping all the benefits for his own family. The Chamberlains couldn't dispute that it was purchased under the table over a gentlemen's agreement, so they had a jeweler make different pieces out of the infamous Patiala necklace and split it among their immediate family.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ReallyFineWhine",
            "body": "Some old lady tossed it off the side of a cruise ship.",
            "score": 1,
            "replies": [
                {
                    "author": "Worldly-Actuator7276",
                    "body": "Damn…you beat me to it",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AjRebelion",
            "body": "More than likely in Buckingham palace",
            "score": 1,
            "replies": [
                {
                    "author": "SirDiesel1803",
                    "body": "I was going to say the tower of London.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "CinderX5",
                    "body": "You really think the UK wouldn’t have it on display if we had it?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Severe-Experience333",
                            "body": "maybe y'all are afraid we'll ask it back\n\n![gif](giphy|ANbD1CCdA3iI8)",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "CinderX5",
                                    "body": "You’ve got to be joking. Are we talking about the same Britain here? Come visit the British museum and see all our British stuff.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "sadelnotsaddle",
                                            "body": "There's British stuff in there now? When was that added?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "CinderX5",
                                                    "body": "Every time it crossed our borders.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Poodlepink22",
            "body": "I'm so intrigued by stuff like this. That thing is somewhere and I want to know where.",
            "score": 1,
            "replies": [
                {
                    "author": "RabidPlaty",
                    "body": "Or sold off in a hundred pieces and no longer exists.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ILookLikeKristoff",
                            "body": "Yeah unfortunately this seems like the most likely option.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Carrotfits",
                    "body": "Same!!!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "whenveganscheat",
                    "body": "It's definitely not the decorative top to an incredibly posh buttplug. I asked during the tour",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "_Obama_BinLaden_",
            "body": "![gif](giphy|aw9vw51zjTa8g)",
            "score": 1,
            "replies": []
        },
        {
            "author": "mmuffley",
            "body": "De Beers, you say? I’d look in Chicago.",
            "score": 1,
            "replies": []
        },
        {
            "author": "copingcabana",
            "body": "It's not Cartier, it's the Cartiest!",
            "score": 1,
            "replies": []
        },
        {
            "author": "horrified_intrigued",
            "body": "This is in someone’s grans jewellery drawer. Granny thinks the necklace is cheap costume jewellery, too gaudy and loud to actually wear but too pretty to throw away…probably going to give it to her 3 year old great granddaughter for her dress-up box.",
            "score": 1,
            "replies": [
                {
                    "author": "SignorRoberto",
                    "body": "Not that far off:\n\nIn 1982, at the [Sotheby's](https://en.wikipedia.org/wiki/Sotheby%27s) Patiala Royal Family auction in [Geneva](https://en.wikipedia.org/wiki/Geneva), the \"De Beers\" diamond reappeared.[^(\\[5\\])](https://en.wikipedia.org/wiki/Patiala_Necklace#cite_note-5) There, the bidding went up to $3.16 million, but it is unclear whether it met its reserve price.[^(\\[6\\])](https://en.wikipedia.org/wiki/Patiala_Necklace#cite_note-DeBeers_Diamond-6)\n\nIn 1998, part of the necklace was found at a second-hand jewellery shop in [London](https://en.wikipedia.org/wiki/London) by Eric Nussbaum, a Cartier associate.[^(\\[1\\])](https://en.wikipedia.org/wiki/Patiala_Necklace#cite_note-:0-1) The remaining large jewels were missing, including the Burmese rubies and the 18 to 73 carat diamonds that were mounted on a pendant. Cartier purchased the incomplete necklace and, after four years, restored it to resemble the original. They replaced the lost diamonds with [cubic zirconia](https://en.wikipedia.org/wiki/Cubic_zirconia) and [synthetic diamonds](https://en.wikipedia.org/wiki/Synthetic_diamond), and mounted a replica of the original \"De Beers\" diamond.[^(\\[4\\])](https://en.wikipedia.org/wiki/Patiala_Necklace#cite_note-:1-4)[^(\\[7\\])](https://en.wikipedia.org/wiki/Patiala_Necklace#cite_note-7)[^(\\[8\\])](https://en.wikipedia.org/wiki/Patiala_Necklace#cite_note-8)",
                    "score": 1,
                    "replies": [
                        {
                            "author": "manicMechanic1",
                            "body": "Sounds like someone took it apart to sell the stones separately. Maybe they could get more money that way?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "scotchtapeman357",
                                    "body": "Probably so they wouldn't get immediately caught",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "manicMechanic1",
                                            "body": "Oh yeah, good point!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "SignorRoberto",
                                    "body": "That's what it's seems",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "horrified_intrigued",
                            "body": "Bloody hell! Thank you for this, super interesting.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "rvega666",
                            "body": "More upvotes for Signor Roberto, please!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sea-Wrongdoer-9746",
            "body": "https://preview.redd.it/swqhgjt3ifpe1.png?width=1219&format=png&auto=webp&s=d72c5a611c5568f095eb97e81a8d3798c39e6b6a\n\nHow much is the Cartier Patiala Necklace worth?",
            "score": 1,
            "replies": [
                {
                    "author": "tegridyproduce",
                    "body": "I've hated the rupee currency converter since google introduced it.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "000topchef",
            "body": "Don’t look at me",
            "score": 1,
            "replies": []
        },
        {
            "author": "Specialist_Ask_7058",
            "body": "Hasn't it been disassembled? The centerpiece came up for auction a while ago",
            "score": 1,
            "replies": []
        },
        {
            "author": "sector16",
            "body": "Gonna show up at a Goodwill in Akron…for $4.99",
            "score": 1,
            "replies": []
        },
        {
            "author": "jskaffa",
            "body": "Da Bears",
            "score": 1,
            "replies": []
        },
        {
            "author": "jazzy_superhero",
            "body": "It will be somewhere in UK like all things they stole from others.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Several-Anteater-345",
            "body": "Check British museums basement. Probably stolen and stored there",
            "score": 1,
            "replies": []
        },
        {
            "author": "Working_Asparagus_59",
            "body": "Insurance claim 🤗",
            "score": 1,
            "replies": []
        },
        {
            "author": "11Kram",
            "body": "Is the necklace missing or just the large diamond?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Illustrious-Song7446",
            "body": "I have it. My bad. Ill return it",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lozzabozzawozza",
            "body": "Probably melted down to make lots of smaller diamonds to sell",
            "score": 1,
            "replies": []
        },
        {
            "author": "fridakahlot",
            "body": "I will still pray the thrift gods to find this in a thrift store where the employees thought clearly it is costume jewelry, lol. Let's not lose hope, people",
            "score": 1,
            "replies": []
        },
        {
            "author": "Swissy321",
            "body": "It’s missing to most of us. Someone definitely knows where it is, though.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Locoj",
            "body": "It has not been missing since 1948. Below is from Wikipedia: \n\n\nIn 1982, at the Sotheby's Patiala Royal Family auction in Geneva, the \"De Beers\" diamond reappeared. There, the bidding went up to $3.16 million, but it is unclear whether it met its reserve price.\n\nIn 1998, part of the necklace was found at a second-hand jewellery shop in London by Eric Nussbaum, a Cartier associate.The remaining large jewels were missing, including the Burmese rubies and the 18 to 73 carat diamonds that were mounted on a pendant. Cartier purchased the incomplete necklace and, after four years, restored it to resemble the original. They replaced the lost diamonds with cubic zirconia and synthetic diamonds, and mounted a replica of the original \"De Beers\" diamond.\n\nThe necklace is the subject of a documentary by Doc & Film International.\n\nA granddaughter of Bhupinder Singh of Patiala is now a jeweller in California. In 2012, she was involved in the exhibit \"Maharaja: The Splendor of India's Royal Courts\" at the Asian Art Museum in San Francisco, where the recreated necklace was displayed.\n\nIn 2022, Cartier loaned the recreated necklace to YouTuber Emma Chamberlain. Chamberlain, who is a Cartier brand ambassador, received some online criticism for wearing the necklace at the Met Gala.",
            "score": 1,
            "replies": []
        },
        {
            "author": "unsafelord",
            "body": "These are not the same picture right?",
            "score": 1,
            "replies": [
                {
                    "author": "cat_crackers",
                    "body": "Guy on the left is wearing the diamond necklace centered below all those pearls.  Guy on the right is wearing the same diamond necklace draped across the left side of his chest.  You can see the large pear shaped stone above the head of the armrest.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ProfessorSputin",
            "body": "Sorry guys I’ve had it this whole time. Borrowed it from a friend and just forgot about it",
            "score": 1,
            "replies": []
        },
        {
            "author": "bengalsfan2442",
            "body": "https://preview.redd.it/db3ysgh2sgpe1.jpeg?width=567&format=pjpg&auto=webp&s=feb17aa3ee8ccc1747ce89095f0b44269096e11e",
            "score": 1,
            "replies": []
        },
        {
            "author": "Hopeful-Tea-2127",
            "body": "The British Museum has it for sure!",
            "score": 1,
            "replies": [
                {
                    "author": "ResponsibilityNo3245",
                    "body": "Disappeared after the British left. Someone probably hacked it up and sold what they could.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ownedbydogs",
                            "body": "It was hacked up, but by the owners, who probably preferred having ready cash over a crazy heavy ornate necklace none of the current generations cared to wear.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ann1h1lator",
            "body": "King Charles’ Plug",
            "score": 1,
            "replies": []
        },
        {
            "author": "notoroisOLD40",
            "body": "anyone check the museum of England?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Flat-While2521",
            "body": "Blood diamonds, people died so monarchs could be shiny",
            "score": 1,
            "replies": [
                {
                    "author": "whenveganscheat",
                    "body": "*still dyin'",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Acerola_",
            "body": "This is gonna show up on Antiques Roadshow as some grannies costume jewellery, just you wait.",
            "score": 1,
            "replies": []
        },
        {
            "author": "masterpudu",
            "body": "We're still looking at it!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Loring",
            "body": "Oh shit I think my grandma has that",
            "score": 1,
            "replies": []
        },
        {
            "author": "reformedsinner",
            "body": "Big Drip 💧",
            "score": 1,
            "replies": []
        },
        {
            "author": "rajde1",
            "body": "Interesting wiki article, didn’t expect Emma chamberlain to be in a controversy for wearing it at the met gala.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sureknow1",
            "body": "Yall know it's in some dudes basement whos completely unaware of what it is",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrTroll2U",
            "body": "He doesn’t look like he’s having a good time",
            "score": 1,
            "replies": []
        },
        {
            "author": "aoi_ito",
            "body": "Definitely not in the British museums",
            "score": 1,
            "replies": []
        },
        {
            "author": "koroquenha",
            "body": "Looks heavy as hell",
            "score": 1,
            "replies": []
        },
        {
            "author": "desna_svine",
            "body": "Man wearing pearls?!",
            "score": 1,
            "replies": []
        },
        {
            "author": "HospitalDrugDealer",
            "body": "Are we all just going to gloss over that magnificent neck beard?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nyarro",
            "body": "Ah what's the point of having something that gaudy and big?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Locoj",
            "body": "Sir, please do not redeem the De Beers Diamond. Sir, please. Sir, noooo!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "LardLad00",
            "body": "I wouldn't be caught dead wearing all those jewels. Looks ridiculous.",
            "score": 1,
            "replies": []
        },
        {
            "author": "tunisianobserver",
            "body": "My guess is it’s in a locker in Antwerp",
            "score": 1,
            "replies": []
        },
        {
            "author": "dave_the_dr",
            "body": "Loads of stuff probably went missing in 1948, independence was chaotic. My gran arrived in the UK with no birth certificate or legal papers because that whole boat carrying administration documents apparently went missing",
            "score": 1,
            "replies": []
        },
        {
            "author": "Vaudane",
            "body": "These sort of jewellery items always look like a cluster of verrucas",
            "score": 1,
            "replies": []
        },
        {
            "author": "metroscope",
            "body": "He does not look happy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "necromancyforfun",
            "body": "Someone must have a confirmation it being in one of the museums in UK...but the Scotland yard got them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nocturtle22",
            "body": "Looking at you Liz.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Obvious_Quantity_521",
            "body": "Man fuck the British",
            "score": 1,
            "replies": []
        },
        {
            "author": "Archangelic1",
            "body": "That old thing? I wear it to the Dollar Store for my weekly expired food shop.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Another_Bastard2l8",
            "body": "How much murder and suffering happened to aquire those shiny rocks.",
            "score": 1,
            "replies": []
        }
    ]
}