{
    "title": "The woman loves the foxes that come in front of her house and the fox's laughter. Beautiful moment!",
    "author": "savatano11",
    "subreddit": "interestingasfuck",
    "rank": 2,
    "score": 6168,
    "upvote_ratio": 0.83,
    "num_comments (reported by reddit)": 166,
    "url": "https://v.redd.it/x9i8b0a8tfpe1",
    "id": "1je37m0",
    "selftext": "",
    "comments": [
        {
            "author": "BukkitCrab",
            "body": "This is at a fox rescue sanctuary, from the [Saveafox](https://www.youtube.com/@Saveafox) channel.",
            "score": 1,
            "replies": [
                {
                    "author": "CommandJam",
                    "body": "Yup! Fake title",
                    "score": 1,
                    "replies": [
                        {
                            "author": "VagrantShadow",
                            "body": "I watch that channel all the time.  It's not as if these foxes just come up to her house each night and she plays with them.  It's a lot of work, space and love she has for these foxes and that she gives to them.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "discerningpervert",
                                    "body": "Yeah this title might have people petting wild foxes and that's usually not a good idea",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Megakruemel",
                            "body": "Everytime it's like a bunch of \"the\" in the title, it's ai generated.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "CommandJam",
                                    "body": "Now that you've mentioned it... yeah, this is definitely an ai generated title!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "QuietGanache",
                    "body": "I'm in absolute awe of the amount of effort she puts in (with her partner, friends and supporters) to care for those animals.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "koolaidismything",
                            "body": "Those types of people live our dream we all say. “If I was rich I’d buy a big farm and help animals!” \n\nThen people get some money and buy that farm and it becomes an investment.. they don’t wanna work 24/7 running a sanctuary. \n\nBut, some people actually do it happily. Like angels on earth man. Look at the little Fox smile so big his eyes close. They don’t have any hate or selfishness. Just pure innocent stuff, which makes them worth saving.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "sanYtheFox",
                            "body": "Best thing is that you can book tours, in the summer you can even occasionally do camp trips there",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "IndyWaWa",
                            "body": "I really like her and the foxes and my company did a small trip there a few years back.  \nHonestly I get a bad vibe from her partner in some videos when he's directing her. \"That's enough. Ok we're good. No more.\" Really weird restrictive vibe.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "IncreaseWestern5171",
                                    "body": "Her voice is like fingers on a chalkboard, absolutely cannot stand it. 😅 I get really weird vibes from all saveafox content.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "infinitebrainstew",
                    "body": "I was about to say there’s no way these are wild foxes. I’ve only seen foxes in the “wild” once in my life. Interestingly enough it wasn’t really the wild, I saw 2 foxes in a suburban neighborhood in Miami late at night. They were extremely skittish and avoided coming near us",
                    "score": 1,
                    "replies": [
                        {
                            "author": "PolarNavigator",
                            "body": "Come to the UK, they're everywhere here.\n\nAnd their favourite things seem to be attempting to dig under my shed, screaming for hours on end and shitting in my garden.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "gaelen33",
                    "body": "Yeah if everyone could downvote the OP for being a fucking twat  or a bot that would be great, and go give the save a Fox channel a subscription or a like instead! They're awesome",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Lunatic_Dpali",
                    "body": "Wrong. She is actually from the organisation of [FireFox](https://youtu.be/dQw4w9WgXcQ?si=pPoTwEgHKPXFT7ag). \nEdit: Fun fact the internet company took its name from this organisation.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "baronvonpenguin",
                            "body": "Wow so original.\n\nAnd only the 15th time you've posted it this fucking week.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Atherum",
                            "body": "I thought the company took its name from the 80's military fiction novels Firefox? I swear I remember the logo being a pilots helmet at one point.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "TopShelfTrees4",
                            "body": "Got em!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Equivalent-Honey-659",
                    "body": "Yea usually they just obliterate my hydraulic hoses and run amuck.   Insurance doesn’t pay because “act of god” but it’s not much anyway.    It’s a shame,  if they did this I’d gladly let ‘em chew on clean hoses or just find something like a rope,  but they do smell bad.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "allencb",
                            "body": "hydraulic hoses for what?\n\nMy auto insurance, with comprehensive add-on, covers animal damage.  This is good because squirrels chewed up the wiring harness on our minivan and it would have cost $4500 to repair (new wiring harness at $1500 and the labor to remove the engine and replace the harness).",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "logosfabula",
                    "body": "They are all very healthy and happy",
                    "score": 1,
                    "replies": [
                        {
                            "author": "hunbakercookies",
                            "body": "Yeah. Its a great rescue.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "observer564",
                    "body": "Yeah no stealing content",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "lookawayyouarefilthy",
                    "body": "Exactly what I was going to say, I loved to watch her videos, they are really fun",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "skoomski",
                    "body": "I reported it for lying about the content",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Ok_Calligrapher5278",
                    "body": "I knew it once I heard Finn, went to search for the video before seeing your comment and all I could [find was AI slop on YouTube](https://i.imgur.com/8UmTYPK.png), brace yourselves for not being able to find your favorite stuff trough search anymore in the near future.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "DezXerneas",
                            "body": "That has been a problem since before AI, though it's been getting even worse lately. I don't understand how YouTube search is so ass even though it's owned by Google.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "power78",
                    "body": "Is anything real anymore on reddit? I can't stand the misinformation anymore.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "sir_music",
            "body": "OP spreading misinformation. This is a fox rescue. These are certainly not 'wild' foxes",
            "score": 1,
            "replies": [
                {
                    "author": "ForGrateJustice",
                    "body": "It's a spam bot.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "AnuraSmells",
                    "body": "Look at their post history, no way they're not a bot.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "kakka_rot",
                            "body": "If you ever check a profile and the comments are mostly gifs, it's either\n\na) a teenager or gen alpha\n\nb) a bot",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Adam_Sackler",
                            "body": "Holy shit. I've seen most of its recent posts in the popular section and liked them. I had no idea it was a bot. When an account is obviously a bot like this, why can't they just be deleted?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "AnOnlineHandle",
                    "body": "The title doesn't say they're wild foxes, though my first reading of it did make it sound like they are.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ReelAwesome",
                            "body": "The implication is there. OP gets no benefit of the doubt here, imo.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Will2LiveFading",
            "body": "These are obviously domesticated some. These can't be wild.",
            "score": 1,
            "replies": [
                {
                    "author": "Disastrous-Panda5530",
                    "body": "It’s a fox rescue center",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Nero-Danteson",
                    "body": "Both are domestic foxes. They're rescues. Finnegan and Vixen are their names.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Lemurian_Lemur34",
                            "body": "*Finnegan",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Nero-Danteson",
                                    "body": "Thank you my half asleep brain even missed her calling him at the very beginning",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "throwautism52",
                    "body": "Pedantic, but domestication is species wide, taming is individual. So they are tame, not domesticated, and on 5 opposite side of the coin introduced species that have been domesticated in the past and then reintroduced to the wild like Mustang horses are actually domesticated but not tame.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "that_baddest_dude",
                            "body": "In dwarf fortress if you have two tame animals their offspring will be domesticated. How do you explain that???",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "RunOrBike",
            "body": "Foxes are this funny animal in between a cat and a dog",
            "score": 1,
            "replies": [
                {
                    "author": "DarthRektor",
                    "body": "I would love to own one but they are not inside pets at all. They will tear up everything, piss all over everything, and do that laugh/cry thing all throughout the night. I did a lot of research into it just to be disappointed I would probably never have one cause it requires a lot of land too.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "pcapdata",
                            "body": "I don't want to have one, I would like to meet a fox sometime though.\n\nSame with raccoons.  I don't want a raccoon as a pet, but I'd like to hang out with a raccoon once in a while.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BotGirlFall",
                    "body": "They're dog hardware with cat software",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Uppgreyedd",
                            "body": "I have definitely never read this exact same comment on reddit",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "FirstTasteOfRadishes",
                                    "body": "THEY ARE CAT SOFTWARE RUNNING ON DOG HARDWARE",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "BotGirlFall",
                                    "body": "Yeah, it's fun to say. Im glad I got it in before anybody else.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "fallenmonk",
                                    "body": "I actually sincerely have not, which I guess means I'll start seeing it all over the place now.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Pixel_Knight",
                            "body": "House cats are pretty hard core predators. They are just smaller. ",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Pixel_Knight",
                                            "body": "What does that mean? So? A fox would be prey for a puma. That doesn’t make an animal more or less of a predator. Your statement means nothing. ",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "DaSmitha",
                                            "body": "And eagles and coyotes prey on foxes, but that doesn't mean foxes aren't predators. Animals can be both prey and predator",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "stillish",
                    "body": "Soo, they'll be loyal and needy while you're alive but eat you once you're dead? Got it. Let's just all get foxes and give a big fuck off to the funeral industry. Our families can mourn us while watching them eat our corpse and carry away our bones",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ShowmasterQMTHH",
                            "body": "Sounds good, to bring it a step further, you should be able to specify an animal you want to eat your remains in your Will.  \n\n\"I'd like 4 honeybadgers please\"",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "dawr136",
                                    "body": "![gif](giphy|1004Eqp3k9U6KQ)\n\nThe animal I want to eat my corpse. Idc about the sobs of the puppeteer. Consume my flesh.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "spaceconstrvehicel",
                                            "body": "some regions in india are ahead of you :) air funeral is a thing Pog",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "marsel_dude",
                            "body": "![gif](giphy|LKAIGKbKO4z00MgFFq)",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "nailbunny2000",
                    "body": "Cat software running on dog hardware.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Alternative_Big_4298",
                            "body": "but they’re too cuddly to be like cats.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "I_voted_4_Kodos",
                                    "body": "But my cat is super cuddly, she cries to be held. Some cats are cuddle bugs 💗",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "homogenousmoss",
                                            "body": "Dog software running on cat hardware then!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Pixel_Knight",
                                    "body": "Cats can be ultra cuddly. \n\nIt depends on the cat and often he they are raised. ",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "theycallmebekky",
            "body": "Holy Reddit bot",
            "score": 1,
            "replies": []
        },
        {
            "author": "HugeHomeForBoomers",
            "body": "Pretty sure they don’t come to her house, but live within a large fenced area.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Real_Alternative_661",
            "body": "vixi is a little shy but he wants some too",
            "score": 1,
            "replies": []
        },
        {
            "author": "HungryBashar",
            "body": "Mikayla is the GOAT. SaveAFox does awesome rescue work.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cwk415",
            "body": "Do not attempt to pet wild animals, they are not pets (this is in a sanctuary)",
            "score": 1,
            "replies": []
        },
        {
            "author": "JK_NC",
            "body": "Foxes are dog hardware running cat software",
            "score": 1,
            "replies": []
        },
        {
            "author": "HoochieKoochieMan",
            "body": "Firefox has family-friendly options, in both standard and dark-mode.",
            "score": 1,
            "replies": [
                {
                    "author": "xIViperIx",
                    "body": "And the standard mode keeps laughing at its users.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "restingbitchface2021",
            "body": "Now I know who ran off with the dog toy I had on my trail in the woods!\n\nI found it in a nearby cornfield last spring.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ShadowTown0407",
            "body": "My man if you are going to lie, atleast don't lie about such a big youtube channel",
            "score": 1,
            "replies": []
        },
        {
            "author": "benqhdmi90",
            "body": "OP is a karma farming liar. This is a video of a fox sanctuary.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DXG_69420",
            "body": "what does it say?",
            "score": 1,
            "replies": [
                {
                    "author": "Perfect-Difference19",
                    "body": "C'mon, man, you heard it in the video.\n\nIt's clearly \"a-hee-a-hee-a-hee\".",
                    "score": 1,
                    "replies": [
                        {
                            "author": "DXG_69420",
                            "body": "Wa-pa-pa-pa-pa-pa-pow!\n\nWa-pa-pa-pa-pa-pa-pow!\n\nWa-pa-pa-pa-pa-pa-pow!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "KingTravisClash",
            "body": "Rabies is real so when they wander up like a zombie i hope she doesn’t keep the same energy",
            "score": 1,
            "replies": [
                {
                    "author": "Naga_Bacon",
                    "body": "These foxes are in an enclosure, wild foxes can not just wonder to here.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Canadianretordedape",
            "body": "How to I make friends with forest puppies.",
            "score": 1,
            "replies": [
                {
                    "author": "Granticuss",
                    "body": "This is a rescue. These are not wild but were either saved from fur farms or were injured and non releasable. Save a Fox on YouTube.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "xtrinab",
            "body": "Did AI write this title?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Due-Radio-4355",
            "body": "I’m know it’s a sanctuary. But I still love it",
            "score": 1,
            "replies": []
        },
        {
            "author": "doc2204",
            "body": "![gif](giphy|z4AG8WynSJHA4)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Turtlem0de",
            "body": "Well, now I want a fox 🥺",
            "score": 1,
            "replies": [
                {
                    "author": "QuietGanache",
                    "body": "I'd suggest watching the videos from the channel (linked in the comments). Their immediate reaction to being frightened, being happy, being excited, encountering food or just generally existing is to urinate a particularly smelly urine.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Turtlem0de",
                            "body": "Ty! I’ll train them to let me visit them in the neighbors yard : )",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "silver-orange",
                    "body": "From what I understand, domesticated foxes aren't aggressive, but usually they're also totally disinterested in people.  It took centuries for dogs to become the companions we know them as today...\n\n[https://www.youtube.com/watch?v=4dwjS\\_eI-lQ](https://www.youtube.com/watch?v=4dwjS_eI-lQ)\n\nThe project to domesticate foxes is incredibly fascinating.  But if you're expecting something that can share your home and cuddle like a cat/dog you're going to be very, very disappointed.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Turtlem0de",
                            "body": "Well, to be honest with you I was simply wishful thinking. I already have three dogs a cat and two bunnies so I think we’re good in the pets area.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Japanesewillow",
            "body": "They’re only there because she’s obviously been feeding them.",
            "score": 1,
            "replies": [
                {
                    "author": "QuietGanache",
                    "body": "This is saveafox, they're rescues, not wild foxes. Her property is divided into large enclosures and one of them surrounds the house. She takes great care of them.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Dudepile",
                    "body": "They're there because she owns them.\n\n\nhttps://youtube.com/@saveafox?si=5keg2Yo-oAaK0dRn",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Japanesewillow",
                            "body": "That changes everything. The title was misleading.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ShowmasterQMTHH",
                    "body": "The Red one looks like he hasn't been fed in at least 20 minutes.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "MongolianCluster",
                    "body": "Donuts.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "DrBlaziken",
                            "body": "and milk.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "_CrownOfThorns_",
            "body": "Foxes are my favorite animal!",
            "score": 1,
            "replies": []
        },
        {
            "author": "roloyo101",
            "body": "People who love animals like that are very good people.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Justme100001",
            "body": "You'll never see this on Fox News...",
            "score": 1,
            "replies": []
        },
        {
            "author": "AdDisastrous6738",
            "body": "I have a mini Aussie that acts exactly like this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mattogeewha",
            "body": "Do foxen get chunky with winter coats or is this fox just… healthy",
            "score": 1,
            "replies": [
                {
                    "author": "Imaginary_Recipe9967",
                    "body": "These foxes are “chunky” because they’re bred to have extra skin so that the farm (that they were rescued from) can make fur coats from them. ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "glimmerhope",
                            "body": "Fuck that makes me sick. \n\nReason # 1,000,043 why I hate the human race.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Psbbyxoxo",
            "body": "The cuteness 🥰🥰🥰",
            "score": 1,
            "replies": []
        },
        {
            "author": "Owlamancer",
            "body": "As much as i love finnigan and co, the title is misleading so no upvote.",
            "score": 1,
            "replies": []
        },
        {
            "author": "helveseyeball",
            "body": "Cat software running on dog hardware.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Awesomely_Bitchy",
            "body": "Chubby foxes \n\n(B4 you say anything I understand it's winter and need weight n fur. Just look chubby)",
            "score": 1,
            "replies": []
        },
        {
            "author": "layzeeB",
            "body": "Dude needs a diet like me lol 😂 he’s soo cute",
            "score": 1,
            "replies": []
        },
        {
            "author": "Panem-et-circenses25",
            "body": "Where’s my Dixie-do?!?! I want the cell phone chase video!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dear-Bear-5766",
            "body": "Rather domesticated",
            "score": 1,
            "replies": []
        },
        {
            "author": "contagiousromantic",
            "body": "y'all just pet anything 😭",
            "score": 1,
            "replies": []
        },
        {
            "author": "Murky_Ad2194",
            "body": "r/worldsbeyondnumber",
            "score": 1,
            "replies": []
        },
        {
            "author": "AlbertaAcreageBoy",
            "body": "Can't get anywhere close to the foxes on my property.",
            "score": 1,
            "replies": []
        },
        {
            "author": "QueenoftheMorons",
            "body": "We have wild foxes in our yard and there's no way they would approach a person like this. They are very skittish creatures.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mintybadgerme",
            "body": "This is so old. Finnegan is nearly dead by now he's so old. Lovely fox though.",
            "score": 1,
            "replies": []
        },
        {
            "author": "snoopie4eva",
            "body": "Her response, it’s just a phase honey, this too shall pass 😂😂",
            "score": 1,
            "replies": []
        },
        {
            "author": "MidnightSun77",
            "body": "They look adorable but don’t they stink?",
            "score": 1,
            "replies": []
        },
        {
            "author": "mothzilla",
            "body": "Oh lord he coming.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheWhyteMaN",
            "body": "“The woman”",
            "score": 1,
            "replies": []
        },
        {
            "author": "Lost_Apricot_4658",
            "body": "i can’t reach these high frequencies to lure animals to me 😓",
            "score": 1,
            "replies": []
        },
        {
            "author": "Positive-Produce-001",
            "body": "weird ass bot title very cool\n\nThe bot posts stolen content to farm karma. Beautiful moment!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Icy-Performer-9688",
            "body": "Was gonna say those fox are way too chubby to be wild ones.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cosmicgodesss",
            "body": "This is Finn and dem I watch them on YouTube lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Life-Strategist",
            "body": "\"You came to the right neighbourhood\" vibes",
            "score": 1,
            "replies": []
        },
        {
            "author": "Status-Procedure413",
            "body": "Witch",
            "score": 1,
            "replies": []
        },
        {
            "author": "naturist_rune",
            "body": "Please do not pet wild foxes that approach you as they may be rabid. \n\nThese are not wild foxes, these are rescued fur-farm foxes that have an outdoor pen with tons of room for play. The sanctuary is Saveafox on Youtube, and one of their fabulous models here is the sweet Dixie Do!",
            "score": 1,
            "replies": []
        },
        {
            "author": "4t9r",
            "body": "Reddit needs to crack down on spam bots",
            "score": 1,
            "replies": []
        },
        {
            "author": "raiko777",
            "body": "i wonder if they're people who don't like these crazy cat-dog-like creatures",
            "score": 1,
            "replies": []
        },
        {
            "author": "DonPeteLadiesMan",
            "body": "So cute!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "EllaFant1",
            "body": "u/bot-sleuth-bot",
            "score": 1,
            "replies": []
        },
        {
            "author": "Specific-Bass-3465",
            "body": "They are puppers 😭🍞",
            "score": 1,
            "replies": []
        },
        {
            "author": "Admirable_Click_3375",
            "body": "I wonder how come we still haven't domesticated these animals",
            "score": 1,
            "replies": []
        },
        {
            "author": "namesareunavailable",
            "body": "beautiful to see someone still having a bond with nature.",
            "score": 1,
            "replies": []
        },
        {
            "author": "brutalcritc",
            "body": "They’re fat. 😢\n\nEdit: slightly overweight dogs die 2.5 years sooner than slightly underweight dogs. Overfeeding animals is borderline abusive.",
            "score": 1,
            "replies": [
                {
                    "author": "LlamaLoupe",
                    "body": "... it's winter. They better be fat.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "CupAdministrator777",
                            "body": "Fur real.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "brutalcritc",
                            "body": "Furry =/= fat",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Maultaschtyrann",
                    "body": "They've got a huge layer of fur rn. No way, you can tell if they really are fat.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Blyd",
                            "body": "That fox is fat even for a city fox.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "brutalcritc",
                            "body": "I’ve lived my entire life in places where foxes are everywhere. I know what foxes look like in nature. These things are over fed. \n\nWhen the one lies on its side, you can see a big ol belly.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Moody_GenX",
                                    "body": ">I’ve lived my entire life in places where foxes are everywhere.\n\nI've spent about 15 years in the same environment. These are the fattest foxes I've ever seen.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Imaginary_Recipe9967",
                    "body": "The foxes at SaveAFox have extra skin that looks like it’s sagging sometimes because they’re especially bred like that. These rescues are from a farm that breeds “special” foxes to make fur coats from their skins. ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "brutalcritc",
                            "body": "Sagging? These things are plump, bursting at the seams.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Fast_Butterscotch498",
            "body": "This lady ' should ' understand that these are feral animals and can be affectionate with them to a point ,and not interact with them as if they are domesticated dogs .It has taken 23,000 years to have our dogs achieve the present level of domestication and they are still not totally integrated. She should take care and wear a special glove to protect herself ,just in case.",
            "score": 1,
            "replies": [
                {
                    "author": "nitrajimli",
                    "body": "Those aren't wild foxes. They're domesticated foxes raised in fur farms, the video is from [saveafox](https://www.youtube.com/@Saveafox), an organization that rescues them.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Fast_Butterscotch498",
                            "body": "I take your point  , but they still not to be trusted ,and a protective glove would be a smarter thing to wear , as even a graze from a fox could be dangerous due to the danger of rabies .",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "nitrajimli",
                                    "body": "They've taken care of their foxes for years now, it's a fenced land, they don't have access to the wilds, some of them have even been raised there since puppies, the foxes recieve constant Vet care, meaning, they are [vaccinated](https://www.youtube.com/watch?v=48JSPDznB-8)... some aren't feral animals, some where bred by fur farms to be docile and be handled by humans while in captivity.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "MrTroll2U",
            "body": "Don’t stick your hand in animals mouth. You are like a poster child for urgent care.",
            "score": 1,
            "replies": [
                {
                    "author": "Granticuss",
                    "body": "Yeah OPs title sucks. This is a rescue, those are not wild animals. This woman has raised most of the foxes from a young age saving them from fur farms.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "okboiz123",
            "body": "Me watching this video, scared of approaching dogs as well😑",
            "score": 1,
            "replies": []
        },
        {
            "author": "cheshiredormouse",
            "body": "Was sawing off your hand an option to survive the bite before the rabies vaccine? As in The Walking Dead?",
            "score": 1,
            "replies": []
        },
        {
            "author": "multiplename",
            "body": "Misleading title, and the name Finnegan…. I might be wrong but I vaguely recall seeing this is a YouTube channel and Finnegan unfortunately passed away a few years ago? \n\nI could be wrong but Finnegan the fox really rings a bell… and a pretty sad one at that.",
            "score": 1,
            "replies": [
                {
                    "author": "Granticuss",
                    "body": "This is Save a Fox rescue. As far as I know Finnegan is fine, she posted a video of him two weeks ago. I'm not a super close follower though, but I don't see any sort of announcement like that.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Oli4K",
            "body": "Wouldn’t stick my hands in that. Toxoplasmosis kinda sucks.",
            "score": 1,
            "replies": []
        }
    ]
}