{
    "title": "Between the years 2011 and 2012, a team of thieves stole approx. 2,700 tonnes of maple syrup from a strategic maple syrup reserve maintained in Quebec. The stolen maple syrup was valued at nearly $18 million at the time. Richard Vallières, the accused ringleader, was sentenced to 8 years in prison.",
    "author": "Ultimintree",
    "subreddit": "interestingasfuck",
    "rank": 19,
    "score": 281,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 96,
    "url": "https://i.redd.it/jd5ym3fuzgpe1.png",
    "id": "1je88xn",
    "selftext": "",
    "comments": [
        {
            "author": "These_Ad_7966",
            "body": "In the form of punishment, did he get served pancakes without syrup in prison? 🤔",
            "score": 1,
            "replies": [
                {
                    "author": "GoingAllTheJay",
                    "body": "Worse, they gave him table syrup.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "CitizenHuman",
                            "body": "\"you'll use this Log Cabin syrup and you'll like it!\"",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "These_Ad_7966",
                            "body": "😅",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "polymorphic_hippo",
                    "body": "The Canucks are vicious war machines, but even they wouldn't go so far as this.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ultimintree",
            "body": ">In July 2012, an inspector from the QMSP (Québec Maple Syrup Producers) was conducting an annual inspection of the maple syrup stored at the Saint-Louis-de-Blandford strategic reserve. As he climbed up a stack of barrels, one nearly fell over. Normally, the full barrels would weigh approximately 270 kg and be very difficult to move. The inspector opened some of the barrels and discovered that they were empty. In addition, it was later found that other barrels, which appeared full, were in fact filled with water. It was also reported that some barrels were dirty (despite the cleanliness of the Saint-Louis-de-Blandford reserve) and rusty (an unusual characteristic as maple syrup does not oxidize). The facility had no security cameras and there was no video evidence of the theft.\n\n>Officers from the Sûreté du Québec (SQ), the provincial police force, initiated the investigation after the QMSP contacted the authorities. The SQ determined that the theft was an inside job. It was then established that from October 2011 to August 2012, a group of thieves were taking barrels of maple syrup and syphoning the syrup into their own barrels. The empty barrels were then filled with water before being returned to the strategic reserve.\n\n[Source](https://www.thecanadianencyclopedia.ca/en/article/great-canadian-maple-syrup-heist)\n\n**Perpetrators**\n\n* **Richard Vallières**, accused ringleader, sentenced in April 2017 to 8 years in prison plus a $9.4 million fine, with an extension to 14 years if the fine is not paid.\n* **Raymond Vallières**, father of Richard, convicted of possession and was sentenced to 2 years in jail, followed by 3 years of probation.\n* **Étienne St-Pierre**, a New Brunswick-based syrup reseller, was sentenced to 2 years in jail, 3 years of probation and an $850,000+ fine.\n* **Avik Caron**, the insider whose spouse owned the QMSP warehouse, sentenced to five years in prison plus a $1.2 million fine.\n* **Sébastien Jutras**, a trucker involved in the transport of stolen syrup, served eight months in prison.",
            "score": 1,
            "replies": [
                {
                    "author": "SufficientGreek",
                    "body": ">The thieves distributed their stolen maple syrup from a legitimate operation located in New Brunswick. New Brunswick has a smaller maple syrup industry and is not subject to the price and production controls that exist in Quebec. From New Brunswick, the stolen maple syrup was shipped and sold in Ontario and the United States.\n\nMaple laundering: turning stolen syrup into clean, but sticky, money",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Holiday-Tradition343",
                            "body": "New Brunswicker here. I’m not surprised; Quebec is highly regulated and we’re very much not in this respect.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "LaughableIKR",
                    "body": "That's some Sweet Justice.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "CatsAreGods",
                    "body": "There was a documentary about this called The Great Maple Syrup Heist, and a pretty funny TV series last year that fictionalized many details but was quite entertaining called The Sticky.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "7thFleetTraveller",
                    "body": "Pretty draconical punishment for trolling.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "hroaks",
                    "body": "Probably would have gotten away with it if he only stole 1 million worth",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RaymondMichiels",
            "body": "Well, somebody should mention this, so let it be me: a *strategic reserve* of maple syrup? Because God forbid what would happen should they run out. Riots! Civil war!",
            "score": 1,
            "replies": [
                {
                    "author": "Traditional-Spot8531",
                    "body": "It’s a highly valuable commodity and treated the same as oil to stabilize supply and price regardless of yield fluctuations year over year and to economically protect shortages from hurting producers and exporters. Smart move when it contributes hundreds of millions to the economy.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Zealousideal-Talk-23",
                            "body": "yeah, the maple syrup mafia had a few great idea",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "PsychedelicConvict",
                                    "body": "I know ur joking, but the canadian maple syrup is essentially operated by a maple syrup cartel.  They fix the price so heavily in Quebec, that its kinda a problem for the small extractors.  Its been a while since i watched the documentary on this so details may be fuzzy.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Zealousideal-Talk-23",
                                            "body": "i'm not joking. My family had to stop selling when they came up with their rules since we only have ~400trees",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "STONEDandIRRATIONAL",
                    "body": "didn't you know the canadian dollar is backed by maple syrup? if they run out the entire economy crashes",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "FatTim48",
                    "body": "It sounds dumb, but the government for the province of Quebec is flipping nuts about how heavily they manage the maple syrup industry. It literally looks like a cartel. \n\nThey limit how much people/companies can produce and sell, and any extra is kept in the strategic reserve. \n\nThis is to maintain the price of syrup and not let it drop to a level where it's not profitable anymore.\n\n\nIt's interesting. The thing that tipped people off to the theft was that some barrels were damaged. Little dents and scratches. The actual barrels of syrup are kept in pristine condition. So someone noticed a scratch and that was all that was needed to tip them off that something happened",
                    "score": 1,
                    "replies": [
                        {
                            "author": "MrK521",
                            "body": "I thought they noticed rust",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "FatTim48",
                                    "body": "It was a few things, but all damage related.\n\nRust, dirty, scratches, dents...etc",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "C_Werner",
                            "body": "And I thought the Cranberry Cartel was powerful!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Short_Hair8366",
                    "body": "It may sound funny, but a gallon of maple syrup is of higher value than a gallon of oil.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "CaptainSpervan",
                    "body": "The U.S. also has a cheese reserve. So I get it.\n\nhttps://www.farmlinkproject.org/stories-and-features/cheese-caves-and-food-surpluses-why-the-u-s-government-currently-stores-1-4-billion-lbs-of-cheese",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "hopelesscaribou",
                    "body": "It keeps the price stable, as production varies from year to year.  [article](https://financialpost.com/commodities/agriculture/quebecs-maple-syrup-cartel-should-be-sweeter)\n\nI, for one, would be devastated if the supply ran out. I keep my own strategic reserve at home.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "mudturnspadlocks",
            "body": "Sticky bandits",
            "score": 1,
            "replies": [
                {
                    "author": "StrangelyBrown",
                    "body": "I'm imagining an ID parade/lineup where one of the guys has maple syrup all around his mouth.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ok_Replacement4702",
            "body": "Just look at his pancake eating grin",
            "score": 1,
            "replies": []
        },
        {
            "author": "thealexstorm",
            "body": "Look at that smile.\n\nHe ate it all.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Accurate_Koala_4698",
            "body": ">strategic maple syrup reserve",
            "score": 1,
            "replies": [
                {
                    "author": "SufferNSucceed",
                    "body": "Nice work strategic top 1% commenter. ",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "sirgandolf007",
                    "body": "u/bot-sleuth-bot",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sharp-Self-Image",
            "body": " That’s not a heist, that’s a breakfast revolution. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "-WickedJester-",
            "body": "Provided I mathed correctly, if you used a tablespoon of syrup per 4 inch pancake, that's enough maple syrup for about 1,523,835,417.6 pancakes",
            "score": 1,
            "replies": [
                {
                    "author": "surgicalhoopstrike",
                    "body": "Thank you for your service!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "jen1980",
            "body": "There's a pretty good TV show made about this heist. It's called The Sticky:\n\n[https://www.imdb.com/title/tt19636984/?ref\\_=fn\\_all\\_ttl\\_1](https://www.imdb.com/title/tt19636984/?ref_=fn_all_ttl_1)",
            "score": 1,
            "replies": [
                {
                    "author": "skiattle25",
                    "body": "👍 for The Sticky. Was a fun watch, recommend it for all looking for a light, comedic bit of docudrama",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "luvrboy12",
            "body": "That's a Sappy crime.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Musole",
            "body": "Maple syrup mafia.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AvoirLeHocquet",
            "body": "At least they had the decency not to touch the tactical maple syrup reserve.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bizzybaker2",
            "body": "You can watch this on Amazon Prime (at least here in Canada, not sure about other countries), but this is based on this event. Jamie Lee Curtis is in it, as well as Canadian actors, and it is hilarious!\n\nTrailer\n\n[https://www.youtube.com/watch?v=hvjIKMb5oSc&ab\\_channel=PrimeVideo](https://www.youtube.com/watch?v=hvjIKMb5oSc&ab_channel=PrimeVideo)",
            "score": 1,
            "replies": [
                {
                    "author": "Spirited-Occasion-62",
                    "body": "hilarious is a strong word... more like... amusing",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DowngoezFrasier215",
            "body": "227 , What Else??!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Character-Concept651",
            "body": "I can't stop laughing at his facial expression!\n\n2,700 tones! Sweet Jesus!",
            "score": 1,
            "replies": [
                {
                    "author": "ArcXivix",
                    "body": "*Diabetic Jesus* after all that fucking syrup.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "HighwaySentinel",
            "body": "The fact that it was stolen is one thing.  The idea that there is a \"Strategic Maple Syrup Reserve\" is far more interesting.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DeadParallox",
            "body": "Historians refer to this as the most Canadian Heist in History.",
            "score": 1,
            "replies": [
                {
                    "author": "Jaxsdooropener",
                    "body": "That is precisely how I have been referring to it",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DarkCustoms",
            "body": "I would have blamed it on a bear 🐻",
            "score": 1,
            "replies": []
        },
        {
            "author": "ancedactyl",
            "body": "Way to spoil the end of The Sticky!",
            "score": 1,
            "replies": []
        },
        {
            "author": "lost_opossum_",
            "body": "\"I guess they were able to make the charges . . . stick!\"  #takes\\_off\\_sunglasses",
            "score": 1,
            "replies": []
        },
        {
            "author": "Crafty_Effort6157",
            "body": "The sticky bandit.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DifficultCold7771",
            "body": "I need a Netflix crossover of this and the air Canada gold scheme",
            "score": 1,
            "replies": []
        },
        {
            "author": "TightManufacturer820",
            "body": "Sweeeeet!",
            "score": 1,
            "replies": []
        },
        {
            "author": "BloodShotEye87",
            "body": "There was a great documentary series on Netflix called Dirty Money and this is one of the episodes",
            "score": 1,
            "replies": []
        },
        {
            "author": "boomerangthrowaway",
            "body": "Wait they have a.. 🤔 \n\nYea this tracks. That is interesting as fuck.",
            "score": 1,
            "replies": []
        },
        {
            "author": "zul0013",
            "body": "sweet sweet loot....",
            "score": 1,
            "replies": []
        },
        {
            "author": "murphmobile",
            "body": "Mildly related: The marketing posters for the Canadian Pure Maple Syrup are things of beauty and I’ve always wished to get my hands on one.",
            "score": 1,
            "replies": []
        },
        {
            "author": "nukedambition",
            "body": "Did he come to a sticky end?",
            "score": 1,
            "replies": []
        },
        {
            "author": "RegularlyJerry",
            "body": "Troy is rising",
            "score": 1,
            "replies": []
        },
        {
            "author": "abominablewaffle",
            "body": "At least it's not baked beans.",
            "score": 1,
            "replies": []
        },
        {
            "author": "chaunceythegardener",
            "body": "Is this the definition of sweet revenge?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Holiday-Tradition343",
            "body": "All joking aside, several of the major Quebec maple syrup producers are mob-adjacent if not completely owned outright.",
            "score": 1,
            "replies": []
        },
        {
            "author": "stateofyou",
            "body": "If they had filled the empty barrels with water every time they would have been able to get away with it for years longer. It was the empty barrels that gave them away. Plus they were too greedy and big, only a matter of time before the mafia wanted their cut and a slice of the profits. The fewer people who are involved in a crime, the better your chances of getting away with it. I already watched two documentaries about this and if they kept it going for a couple of years in a small crew, it would have gone unnoticed. They would have paid off all their debts, paid for their kids college fees etc and still have some spare cash. They were too greedy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "funandgames12",
            "body": "I mean if this was a plot from a movie you would think it was too cliche or goofy. But nope, just Canada.",
            "score": 1,
            "replies": []
        },
        {
            "author": "sirprize_surprise",
            "body": "Sweet.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CitizenHuman",
            "body": "Does pure maple syrup not have an expiration date? It must not, or it must be super long. Enough to build a reserve for a whole country. Or maybe just the province of Quebec?\n\nPlus how to you sell off millions of syrup? Did they have some sort of syrup fence?",
            "score": 1,
            "replies": [
                {
                    "author": "-burnr-",
                    "body": "Pure sugars (honey/maple syrup) do not expire AFAIK",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Pinkisthedevill",
            "body": "Wait, a strategic, maple syrup... reserve? That's like if the united states had a burger reserve.  \n\n\nWell Damn now I want strategic  burger reserve",
            "score": 1,
            "replies": []
        },
        {
            "author": "filifijonka",
            "body": "Looks like he consumed a good portion of the loot on his own.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Exotic_Bumblebee_275",
            "body": "The legendary Sticky Bandits",
            "score": 1,
            "replies": []
        },
        {
            "author": "CFCYYZ",
            "body": "The boiled sap of trees of maple  \nIs our very Canadian staple  \nIts worth inside of reserved kegs  \nAttracts thieves, like US eggs",
            "score": 1,
            "replies": []
        },
        {
            "author": "RockportOfWar",
            "body": "I thought it was Khabib’s dad at first, The Late Great Abdulmanap in his younger days.\n\nhttps://preview.redd.it/nz9bxwhibhpe1.jpeg?width=554&format=pjpg&auto=webp&s=16ec081cd6e7ed9314a9eb978ed3ce143b4cb0f3",
            "score": 1,
            "replies": []
        },
        {
            "author": "NoLie129",
            "body": "Sweet criminal",
            "score": 1,
            "replies": []
        },
        {
            "author": "No-Economics6503",
            "body": "The Sticky on Prime Video. Worth the watch.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WHSKYJCK",
            "body": "Sticky Bandit",
            "score": 1,
            "replies": []
        },
        {
            "author": "Toast_Meat",
            "body": "What are you in for?\n\nSyrup. Lots of syrup.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ONLYallcaps",
            "body": "Fucking legend.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Desperate_Army4726",
            "body": "Sweet story.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Eredd19",
            "body": "![gif](giphy|PZAh5BdoD8Vlm)",
            "score": 1,
            "replies": []
        },
        {
            "author": "FewHousing145",
            "body": "In georgia, someone stole 500 tones of pipes :))",
            "score": 1,
            "replies": []
        },
        {
            "author": "datboy1986",
            "body": "I've never heard of a maple syrup thief but this guy definitely looks like one.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Available_Slide1888",
            "body": "'Strategic Maple Syrup Reserve' must be the most Canadian thing ever. It's like us Swedes had a nuclear silo filled with meatballs.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Eddie_Honda420",
            "body": "Strategic maple syrup reserve.  Who would have guessed",
            "score": 1,
            "replies": []
        },
        {
            "author": "mvw2",
            "body": "Look at that happy fat bastard.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mvw2",
            "body": "Look at that happy fat bastard.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FineGripp",
            "body": "People are joking about how Maple syrup is controlled by cartel and how so many Canadians consume it, but isn’t avocado the same deal in the US? Actual Mexican cartels armed with assault rifle control avocado farms in Mexico because so many Americans consume avocados…",
            "score": 1,
            "replies": []
        },
        {
            "author": "FineGripp",
            "body": "People are joking about how Maple syrup is controlled by cartel and how so many Canadians consume it, but isn’t avocado the same deal in the US? Actual Mexican cartels armed with assault rifle control avocado farms in Mexico because so many Americans consume avocadoes…",
            "score": 1,
            "replies": []
        },
        {
            "author": "FineGripp",
            "body": "People are joking about how Maple syrup is controlled by cartel and how so many Canadians consume it, but isn’t avocado the same deal in the US? Actual Mexican cartels armed with assault rifle control avocado farms in Mexico because so many Americans consume avocadoes…",
            "score": 1,
            "replies": []
        },
        {
            "author": "anniewolfe",
            "body": "Sounds like a pretty sticky situation…",
            "score": 1,
            "replies": []
        },
        {
            "author": "mydebu1",
            "body": "Because Canadian money is stupid?",
            "score": 1,
            "replies": []
        }
    ]
}