{
    "title": "LawnMate - Self-Hosted Lawn Mowing Business Management System",
    "author": "jared252016",
    "subreddit": "selfhosted",
    "rank": 16,
    "score": 92,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 14,
    "url": "https://www.reddit.com/gallery/1jdw29z",
    "id": "1jdw29z",
    "selftext": "LawnMate (previously LawnBuddy, still transitioning from the old name) is an app for individuals or small teams to manage their own lawn business. \n\nThis project is not yet complete, but consider it under active development. The prices on the website are not accurate and it will be open source without a fee when it's ready, with a paid SaaS version as well.\n\nThe idea is to target entrepreneurs of all ages, 13-75 by providing them with inexpensive yet helpful tools to run their own side business, whether that be a full fledge lawn operation or just a summer gig for money while school is out. \n\nIf you, or anyone you know, would like to help contribute to the project then please DM me. Feel free to critique the code and please report any bugs on the GitHub. [https://github.com/orgs/Eanix-Net/repositories](https://github.com/orgs/Eanix-Net/repositories)\n\nFeedback would be much appreciated too.",
    "comments": [
        {
            "author": "usrdef",
            "body": "Just a note, obviously your app, your choice.\n\nBut I think something that may end up benefiting more kids, and bringing you more attention is advertising it as a kid / young adults' portal for them starting their own business. \n\nBy targeting lawn services; you're narrowing down your audience, when there are plenty of other things that kids can do to earn money while in school. \n\nAnd while yes, the app can be used by adults as first-time entrepreneurs, you can specifically target it being an app that is user-friendly for teenagers and their family to get involved with.\n\nAn easy way for someone to launch a very simple site, maybe track customer's names / numbers, plan what days of the week they have to do a job and for who. Sort of break all the business stuff down into a really simple UI.",
            "score": 61,
            "replies": [
                {
                    "author": "Disturbed_Bard",
                    "body": "Well said , this could easily cater for many use cases like detailing or painting commissions etc.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "StuartJAtkinson",
                    "body": "Agreed set it as \"Servicing business\" because if you have tools go to a place and perform a service with no manufacturing or selling of goods that is a generic system",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "CheesyBolt",
                    "body": "Agreed. Could be easily used in the winter months throughout much of the world to track a snow blowing / plowing business, just as another example that uses the exact same logic. Many parts of the USA could use this same service for lawns in the summer and snow in the winter, one DB, one site, option to choose lawn cutting / window cleaning / power washing / snow blowing as check-boxes so one customer can be assigned multiple services. ServiceMate or something similar.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "dadidutdut",
            "body": "can it be customized to be used for not just for lawn mowing business?",
            "score": 6,
            "replies": []
        },
        {
            "author": "shadowonyx23",
            "body": "Man....where was this when I started my business 15 years ago! I would have loved this. Good work!!",
            "score": 7,
            "replies": []
        },
        {
            "author": "tillybowman",
            "body": "do lawn mates need something special that doesn't work with an good old CRM like other businesses do?",
            "score": 2,
            "replies": [
                {
                    "author": "CulturalTortoise",
                    "body": "What self hosted crms are there out of curiosity?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Bxlinfman",
                            "body": "I know that odoo does that, not sure about others",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Sufficient_Language7",
                                    "body": "For service scheduling, from what I can tell it doesn't work the way you want.  It also includes a ton of stuff you don't need and makes it way more complicated than what you need.\n\n\nOwn a service based company.  Not Lawn care.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ChknMcNublet",
            "body": "Lawnbuddy was a better name imo ",
            "score": 2,
            "replies": []
        },
        {
            "author": "Oli_Picard",
            "body": "Your licence is very confusing.\n\n\"This project is proprietary and confidential.\" and yet you have bundled in GNU Affero General Public License v3.0GNU Affero General Public License v3.0",
            "score": 2,
            "replies": []
        },
        {
            "author": "fy_pool_day",
            "body": "My painter business friend would like something like this.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Wall_of_Force",
            "body": "will the server mow for me if I install this? /s",
            "score": -3,
            "replies": []
        }
    ]
}