{
    "title": "LinguaCafe v0.14 update released",
    "author": "LinguaCafe",
    "subreddit": "selfhosted",
    "rank": 9,
    "score": 11,
    "upvote_ratio": 0.87,
    "num_comments (reported by reddit)": 0,
    "url": "https://www.reddit.com/r/selfhosted/comments/1jegbl2/linguacafe_v014_update_released/",
    "id": "1jegbl2",
    "selftext": "Hi!\n\nLinguaCafe is a self-hosted software that helps language learners read foreign languages and acquire vocabulary. It provides a set of tools to read texts, look up unknown words and review them later as effortlessly as possible.\n\n[GitHub](https://github.com/simjanos-dev/linguacafe)\n\n[Overview](https://simjanos-dev.github.io/LinguaCafeHome)\n\n[Youtube video](https://www.youtube.com/watch?v=bbflmzgWwe0) (v0.9, made by a user)\n\n[User manual](https://github.com/simjanos-dev/LinguaCafe/wiki/1.-Home)\n\n**Important changes:**\n\n* The update process has been extended with an extra step: you must also download the latest docker-compose.yml file. This time multiple things were changed, but I'll try to provide a list of further changes in the future, so people won't have to check their custom setups for every version.\n* LinguaCafe has started using local storage instead of cookies and has a new text styling system, this means that all of your local settings will reset to default when you first start using this version.\n* 6001 port has been added to the webserver for websockets.\n\n**New features:**\n\n* Added queue based chapter imports. From now on you won't have to wait for your chapters to be imported, it will happen in the background. If you open a book, the chapters will be updated in real time after the importing is finished.\n* Dictionary import progress bar now shows real time progress.\n* Added new online translation service: MyMemories.\n* Added new offline, self hosted translation service: LibreTranslate.\n* Added an API to connect custom scripts and translation services to LinguaCafe.\n* Replaced cookies with local storage. This means that your local settings will reset to default settings.\n* Added level to hover vocabulary box for highlighted words.\n* Added .webp support for book cover images.\n* Added auto theme switching based on system theme.\n* Added an export database button to the admin page.\n* Added automatic daily database backups.\n* Added a change password button to the user settings.\n* Added a button that lets users delete all their data related to their selected language.\n* Added a statistic that shows the users known unique lemmas.\n* Added fully customizable interactive text styling.\n\n**Bug fixes:**\n\n* Book word counts did not update after deleting a chapter.\n* Text reader's light theme glossary word colors were not displayed correctly.\n* Text reader's glossary displayed \"2\" instead of \"new\" for new words.\n* Development tools page had incorrect background for light theme.\n* Book word count percentages were displayed incorrectly in empty books and chapters.\n* Fixed inconsistencies in custom themes when the user selected different foreground color.\n* The selected font type was not applied to the hover vocabulary's reading section.\n* The selected font type was not applied to the text reader's title.\n\n**Other changes:**\n\n* Updated to Laravel 11.\n* Replaced default book cover image.\n* Replaced switches with checkboxes on the vocabulary export page.\n* Removed simple text parsing method. It was something needed before v0.1, because import times were very slow.",
    "comments": []
}