{
    "title": "Are the standards of chain restaurants in the UK dropping drastically?",
    "author": "thrrowaway4obreasons",
    "subreddit": "AskUK",
    "rank": 2,
    "score": 431,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 463,
    "url": "https://www.reddit.com/r/AskUK/comments/1je1s6y/are_the_standards_of_chain_restaurants_in_the_uk/",
    "id": "1je1s6y",
    "selftext": "I had a particularly poor experience in a TGI Fridays last year and swore to never go back. It’s widely expensive for crap food. I know it’s in financial trouble and it’s easy to see why. I had a better burger in Spoons and it was 1/3 of the price.\n\nAt weekend I went out for my niece’s birthday, she wanted to go to Nando’s. I used to think it was definitely one of the better chains, but the food was dry, small portions, still expensive. There’s a knock off Nando’s takeaway near me that is far superior and half the price.\n\nWhen did this happen? These places used to be a nice alternative to a proper restaurant but some fast food places offer better food.",
    "comments": [
        {
            "author": "ukbot-nicolabot",
            "body": ". Note, the question is '_are_ standards dropping?' with a side of Why?\n\nNot. 'What do you think or have experienced with chains?'",
            "score": 1,
            "replies": []
        },
        {
            "author": "PM_ME_BEEF_CURTAINS",
            "body": "A lot of chains seem to now be in the \"sack everyone and coast on the brand until the private equity overlords dump enough debt into the business to put it in administration\" phase of doing business.\n\nSupport local businesses, and let the chains die.",
            "score": 981,
            "replies": [
                {
                    "author": "Cuddols",
                    "body": "If the owner isn’t an old Chinese lady who aggressively yells at me  or an old Italian guy who homoerotically rubs my lower back or a middle aged french guy who flirts with my wife every time I go in then I don’t wanna go there",
                    "score": 509,
                    "replies": [
                        {
                            "author": "TheRealVinosity",
                            "body": "I look forward to reading your restaurant recommendations.",
                            "score": 155,
                            "replies": [
                                {
                                    "author": "Yayzeus",
                                    "body": "Touché Fillet, french restaurant specialising in fish.",
                                    "score": 47,
                                    "replies": [
                                        {
                                            "author": "Ok-Blackberry-3534",
                                            "body": "N'once Pizzeria.",
                                            "score": 14,
                                            "replies": [
                                                {
                                                    "author": "kc43ung",
                                                    "body": "'Fuk Yu Ee Ting' authentic oriental restaurant.",
                                                    "score": 6,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "pattybutty",
                                                    "body": "Is that the place were even the spiciest pizza fails to cause a sweat on its clientele?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Dramoriga",
                            "body": "I have an Indian restaurant near me where the guy gives me a big hug and a shoulder massage while I'm eating because he used to fancy the girl that worked in my family restaurant. You would love it there.",
                            "score": 29,
                            "replies": []
                        },
                        {
                            "author": "greylord123",
                            "body": "There's a Mediterranean one near me with a big hairy barrel chested Greek/Turkish (most likely Cypriot) guy with an open shirt.\n\nAbsolute top tier scran.",
                            "score": 58,
                            "replies": [
                                {
                                    "author": "Cuddols",
                                    "body": "Shirt soaking wet from the heat of the kitchen",
                                    "score": 24,
                                    "replies": [
                                        {
                                            "author": "greylord123",
                                            "body": "Lower back sweat patch",
                                            "score": 14,
                                            "replies": []
                                        },
                                        {
                                            "author": "NotBaldwin",
                                            "body": "The frothing of all the punters wive's loins",
                                            "score": 10,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "tomelwoody",
                            "body": "Could not have said it better, these are the places where you hear the \"Ah, Mr & Mrs Richards. Glad to see you again, how was Spain?\".",
                            "score": 33,
                            "replies": [
                                {
                                    "author": "Cuddols",
                                    "body": "“As a welcome back mister Cuddols, I have put banana fritters in with your takeaway”\n\n“Looks like there is a charge for them on my bill though”\n\n“Yes”",
                                    "score": 122,
                                    "replies": [
                                        {
                                            "author": "tomelwoody",
                                            "body": "\"I know you will like them\"",
                                            "score": 43,
                                            "replies": []
                                        },
                                        {
                                            "author": "Ecstatic_Food1982",
                                            "body": "Bahahaha this actually happened to me at an Indian in Milton Keynes.",
                                            "score": 20,
                                            "replies": []
                                        },
                                        {
                                            "author": "PraterViolet",
                                            "body": "That sounds like the greasy spoon I used to frequent with my mates at uni. \"More mushrooms, lads?\" \n\n\"ooh, that's great! thank you!\"\n\nThen an extra £1 added to our bill when we went to pay. Thirty-five years on and we're still angry about it.",
                                            "score": 18,
                                            "replies": []
                                        },
                                        {
                                            "author": "HeriotAbernethy",
                                            "body": "In a local Italian I was asked if I wanted a particular side with my main. I said no thanks.\n\nHe said ‘it’s included.’\n\nI said ‘no it’s not.’\n\nHe said ‘yes it is.’\n\nI held up the menu. ‘It’s not. No thanks.’\n\n‘For you, it is.’\n\nIrritated by now, I said ‘fine, okay then.’\n\nWhen the bill came it was extra, and they refused to remove it. \n\nWe left zero tip, never went back, and came over all Nelson Muntz when they went bust a few years later.",
                                            "score": 15,
                                            "replies": [
                                                {
                                                    "author": "luciferslandlord",
                                                    "body": "Have you seen face jacker? \"It's completely free sir\"",
                                                    "score": 2,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "cinematic_novel",
                                                    "body": "I am Italian born and bred and I avoid authentic Italian places like the plague",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "arturoui",
                            "body": "[Nancy Lam's Enak Enak](https://nancylam.com/) I don't know if she's toned it down in her dotage but in the early 90s it was THE place to get yelled at",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Astrokiwi",
                            "body": "It is critical that some kid is doing their homework under the desk",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Teembeau",
                            "body": "The rule in Birmingham I followed was the restaurant with the worst decor. Is wallpaper looking terrible? falling off the walls?",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "Cuddols",
                                    "body": "Indian restaurant with tacky 90s plates mmmm",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "gloomfilter",
                            "body": "Pretty bloody poetic for a tuesday morning.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "astromech_dj",
                            "body": "Not sure I’d trust an old Italian guy to run my favourite Thai place.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "TheGreatBatsby",
                            "body": "I'm hoping this is one restaurant.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DoctorOctagonapus",
                    "body": "It's the same playbook as that two cows joke for American corporations:\n\n\"You have two cows. You sell one, and force the other to produce ten cows' worth of milk. Later, you pay a consultant to analyse why your cow has died.\"",
                    "score": 66,
                    "replies": []
                },
                {
                    "author": "Spottswoodeforgod",
                    "body": "“Private equity” - say no more.",
                    "score": 27,
                    "replies": [
                        {
                            "author": "Teembeau",
                            "body": "All that \"private equity\" means is that a business isn't public. A guy who owns his own little plumbing business is \"private equity\".",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Spottswoodeforgod",
                                    "body": "Very loosely, yes. Private equity refers to private capital invested into a non-listed business. So private equity is the actual investment (and the control this gives). A sole trader could say their authority comes from the investment they have in their business, but, in most instances, they would feel their control comes simply from it being their business.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "rising_then_falling",
                            "body": "Who told everyone to hate private equity suddenly? I've worked for publicly owned, PE owned, and management owned companies and there's absolutely nothing inherently bad about PE.\n\nAll forms of ownership have upsides and downsides. VC, Angel, PE, public, family owned, I've worked for them all, and there are good and bad and different aspects to each model. \n\nI'd certainly want to know which PE investors were involved in a company before working there, but there's no shortage of good PE outfits around, as well as bad ones.",
                            "score": -7,
                            "replies": [
                                {
                                    "author": "coffeechestpains",
                                    "body": "Private equity is the vanguard of enshittification. They prioritise maximum short-term profit over quality of food and service\nAll businesses exist to make a profit, but PE will destroy everything chasing short-term results. The tgif op was talking about probably had 60 dishes on the menu, for a 120-seat restaurant with 1 cook and 1 waiter",
                                    "score": 22,
                                    "replies": []
                                },
                                {
                                    "author": "Spottswoodeforgod",
                                    "body": "Hmm… there is no reason why private equity has to be a negative outcome for a business, but almost always, they are. \n\nFundamentally, private equity is designed to take an existing business and release value (money). The traditional method involves breaking up and selling of the constituent parts. Typically, private equity “purchases” a business via loans against the business itself. This means that the business now has to return at least the same profit whilst servicing these loans. This is not a model for strategic investment and long term growth. The model typically involves divesting from the business in a relatively short timeframe (minimising loan costs) but prolonging the period of disruption. Often this process involves setting up a number of individual companies, at least one of which, miraculously, ends up carrying almost all of the combined debt before falling into bankruptcy. \n\nIf, as some people do, you think of the owners of many businesses as being sharks, then private equity are the extra aggressive killer sharks on steroids.",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "author": "newfor2023",
                                            "body": "Well yeh look at the takeover of man united. They owe more now on debt than when they were bought via a similar method of loading debt on the company. Glaziers took a large amount of dividends regardless.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "PM_ME_BEEF_CURTAINS",
                                    "body": "I agree, there are _some_ good PE firms, usually ones that you never hear about.\n\nThen there's the vultures.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "blackleydynamo",
                                            "body": "Because the ones you never heard about are busy building value, not using leveraged buyouts to move from business to enshittified business like Necromongers with ties on, sucking as much profit as possible out then moving on debt-free, after the inevitable administration, to the next victim.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "CeeAre7",
                    "body": "Then the small businesses become chains and the cycle continues. Some chains are good, many have become expansive, overpriced and portions got smaller. I used to work Yo Sushi about 10 years ago and the prices were quite reasonable for what it was. Now it’s expensive I have not eaten there in about 4/5 years. \n\nAnd when you say small business I’m assuming you mean the people who owns it actually works there and takes pride, rather than the chicken takeaways/kebab shops that are owners probably have 3/4 stores and don’t even work in them. If that’s the case, those places are horrible. Worked in two during uni, was paid in cash each week and if you knew what goes behind the scenes you’d never eat in one again. No gloves, no basic hygiene, food are kept overnight in those glass cabinets you see over the counter, then gets reheated. Honestly, it’s fucking terrible, I mean it’s good. If you’re drunk and hungry, but please for the love of god don’t eat in them.",
                    "score": 29,
                    "replies": [
                        {
                            "author": "slainascully",
                            "body": "Yo Sushi has gone absolutely mental. Used to go in high school because you could get a few filling dishes for around £15. Last time it was nearly £9 for a tiny plate of yakisoba that took 20 minutes to arrive",
                            "score": 26,
                            "replies": [
                                {
                                    "author": "Milky_Finger",
                                    "body": "I remember back in uni (2014) they did a massive katsu rice bowl off their menu for about £9. Absolutely massive.",
                                    "score": 8,
                                    "replies": []
                                },
                                {
                                    "author": "Teembeau",
                                    "body": "Yo Sushi is a really great example of the problem of startups. Someone borrows some money builds a massive chain, gets loads of money in, takes it to saturation, caring more about expansion than profit and then some company looks it it and thinks \"what a great business\" and pay an absolute fortune thinking it's going to keep growing at the current rate and they'll be super rich.\n\nThe problem if you read that carefully, is \"takes it to saturation\". It can't grow. You can't do more of them. So the owners spent a fortune getting it and it isn't making the return they want. So what they have to do is to try and squeeze their customers.\n\nIt happens with lots of internet startups too.",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "Gisschace",
                                    "body": "I was surprised when I went in last that they had prawn crackers going around the belt!",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "None",
                                    "body": "[deleted]",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "author": "slainascully",
                                            "body": "No, that's why I didn't say lunch",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "YunaLessCar",
                            "body": "My partner and I went to Yo Sushi for the first time in years a little while ago. I couldn’t believe how expensive it was!",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[deleted]",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "CeeAre7",
                                    "body": "Cheers but can’t see the article. I haven’t paid",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "littletorreira",
                            "body": "I've found usually you get a new small chain that's decent, then it expands massively and drops off. There will always be a new one that people like.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "JustGarlicThings2",
                    "body": "Probably explains why Wetherspoons (mentioned in the OP) hasn’t gone down this route yet, as it’s still privately owned by its original founder. We need more family owned businesses, another great example is family owned Miele when compared to Dyson for example.",
                    "score": 18,
                    "replies": [
                        {
                            "author": "rynchenzo",
                            "body": "Wetherspoons just dropped grilled meat from the menu, because you actually need someone who knows what they are doing to cook it. They are absolutely going down that route.",
                            "score": 32,
                            "replies": [
                                {
                                    "author": "rd3160",
                                    "body": "I work there and the amount of cuts they have made recently is staggering. A lot of longtime staff have had enough and quit (me included, my last day is Saturday) due to rapidly worsening conditions caused by understaffing.",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "author": "rynchenzo",
                                            "body": "Good luck in your new role.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "InternationalRide5",
                                    "body": "Also the cost of gas keeping the grills running all day according to r/Wetherspoons",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "WiggyDiggyPoo",
                                    "body": "That's been discussed just recently in r/wetherspoons. Though the consensus seemed to be the grill is very expensive to run and it's a cost cutting measure, I found this comment about those meals being amongst the most returned also makes sense: https://www.reddit.com/r/Wetherspoons/s/RF4e6YFlU2\n\nI'll miss it, I was in a 'Spoons a month or so back and was able to order a Mixed Grill, one for the road I think.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Immorals1",
                            "body": "Idk I'd say wetherspoons already has. It's not cheap for food anymore and the quality and standards have vastly dropped since the lockdowns.\n\nThe burgers used to be my go to and now they're goddamn awful and verging on expensive.",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "Ecstatic_Food1982",
                                    "body": ">The burgers used to be my go to and now they're goddamn awful and verging on expensive.\n\nYeah and they're tiny these days as well. When I worked for them they were decent, admittedly I left 14 years ago.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "mturner1993",
                                    "body": "Are you sure it's expensive? A pint WITH a burger and chips is £7-8 for the cheaper options. That's not far off maccies.\n\n\nMy other local is £18-19 just for the burger.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Immorals1",
                                            "body": "The cheaper ones are basically bad rustlers burgers and even smaller 🤷.\nLast few times I had them they were absolutely vile",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Massaging_Spermaceti",
                            "body": ">  as it’s still privately owned by its original founder.\n\nNo it's not. Tim Martin is chairman of the company that owns Wetherspoons and has a 25%-ish stake in the company. As chairman without a majority stake he's answerable to shareholders. He doesn't own Wetherspoons.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Twacey84",
                            "body": "Wetherspoons won’t go down this route for the same reason McDonalds won’t. \n\nThe business model of both is fast, low quality, cheap food in large quantities. \n\nNo one expects more from them.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "Josh22227",
                                    "body": "McDonald’s has clearly already gone down this route, prices are up massively and portion sizes are tiny",
                                    "score": 34,
                                    "replies": [
                                        {
                                            "author": "PraterViolet",
                                            "body": "> prices are up massively and portion sizes are tiny\n\nAnd it now takes feckin ages. Stand waiting endlessly for your number while they serve all the Deliveroo guys.",
                                            "score": 18,
                                            "replies": [
                                                {
                                                    "author": "blackleydynamo",
                                                    "body": "This is my experience of it too. Stood round for 20 minutes waiting for 9 nuggets, while 17 Deliveroo drivers pick up. \n\nI've probably eaten my last ever KFC, after I gave them one too many chances to not be awful. McDonald's is fast approaching the enshittification event horizon now as well.",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "20127010603170562316",
                                                            "body": "I've never had a good experience at KFC.  Not once.\n\nI didn't even get chicken last time I went there.  For some reason, after standing there for 20 mins, they decided to serve the person behind me in the queue, who proceeded to order a fucking ton.  I walked out and have never looked back.\n\nKFC is not worth waiting for, and I'd already spent nearly half an hour.  Went to a local chicken place instead, was in and out in five minutes.  Should have gone there first.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Twacey84",
                                            "body": "Prices have gone up every where due to inflation and I personally haven’t noticed any reduction in size of say a cheeseburger at McDonalds. Prices also haven’t gone up as much as other places. Their recent £5 meal deal was quite good value. \n\nThe point is that it’s always been cheap, crap good and it’s still cheap, crap good. \n\nWhereas places like Nando’s at one point was about fairly decent food at a reasonable price.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "catchcatchhorrortaxi",
                                                    "body": "You’re wrong though. It used to be cheap, fast and hot, if not especially wholesome. Now it’s expensive (unless you are exclusively ordering the bargain items that aren’t always available), the service is slow and shite, and the food quality suffers for it, even if the composition is still broadly the same",
                                                    "score": 10,
                                                    "replies": [
                                                        {
                                                            "author": "Twacey84",
                                                            "body": "I’ve personally never experienced McDonalds any better than it is now. Certainly not served hot lol 😂. Even in the 90’s you’d be served limp, barely warm fries and a tiny McChicken burger. Yeah, it was cheaper but everything was. \n\nIn my experience it’s normally the more premium menu items that are mostly out of stock and not the saver menu. \n\nI’m 41 so maybe it was better in like the 80’s or something… 🤷‍♀️",
                                                            "score": -3,
                                                            "replies": [
                                                                {
                                                                    "author": "kunstlich",
                                                                    "body": "Even just a decade ago, or whenever they started the refurbishment to their current offer, it was miles better than today. Ubereats etc have fucked it all up for them. McD's resisted longer than many chains which I assumed was because they were figuring out how to do it properly, then shat the bed with it.",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "catchcatchhorrortaxi",
                                    "body": "McDonald’s has 100% gone down this route, enabled by the massive rise in fat lazy fucks ordering from delivery services despite that inherently involving paying more for cold, shit food. They no longer need to rely on providing even minimal service or value at their stores.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Twacey84",
                                            "body": "Maybe I’m just not old enough to remember McDonalds when it was good then. \n\nIn my 41 years I’ve never known McDonalds to be any better quality than what you get now. It’s always been cold and poorly slapped together 😂",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Fine-Discussion26",
                                            "body": "I remember there always used to be facebook pages called \"get mcdonalds to deliver\"   there was a reason they didn't for so long,  it tastes awful 10/ 15 minutes old",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Ur_favourite_psycho",
                                    "body": "Mc Donalds has.  They've put prices up and made portions smaller.  Their sales have dropped dramatically.  My local used to always be packed at the drive though but I only even see one or two cars there nowadays.  People *have* realised.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Teembeau",
                            "body": "No it isn't. Wetherspoons is floated on the London Stock Exchange. You can buy shares in Wetherspoons.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "SteamerTheBeemer",
                    "body": "Yeah they probably know they can last a while providing pretty crappy food and service because it’ll take people a while to realise the once good chain is not the same and it wasn’t just a one off bad experience they had.",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "vijjer",
                    "body": "> Support local businesses, and let the chains die.\n\nI feel like we need to get this message out more.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "CosmicBonobo",
                    "body": "Not all local cafes and restaurants are these bohemian enclaves, selling homemade croissants, though.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Dapper-Employee1494",
                    "body": "Except that the chains provide employment for 100s of thousands of people in the UK. Not only that they’re an accessible and widespread form of employment for school leavers and those with little in the way of qualifications.",
                    "score": -8,
                    "replies": [
                        {
                            "author": "BaBaFiCo",
                            "body": "Going out to eat isn't charity work. If a business doesn't provide a product that's value matches its price then consumers are free to avoid said business.",
                            "score": 30,
                            "replies": [
                                {
                                    "author": "Vikkio92",
                                    "body": "> a product **that’s** value matches its price\n\nThink the word you were looking for there is “whose”.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "BaBaFiCo",
                                            "body": "I knew there was something when I wrote it. I couldn't put my finger on it!",
                                            "score": 5,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Ranger_1302",
                            "body": "Those chains will be replaced by multiple smaller businesses.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "FizzbuzzAvabanana",
                                    "body": "Already happening.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "bee-sting",
                            "body": "They can work in local businesses...?",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "catchcatchhorrortaxi",
                            "body": "This is a daft argument. If the demand is there, it can be met by other businesses who, spoiler, also need employees",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "spectrumero",
                            "body": "If the demand is there, then other businesses will provide those opportunities. If the demand isn't there then the chains will close too.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "lxgrf",
            "body": "The cumulative result of dozens of cost-cutting measures. Each one of them probably barely noticeable on their own, but in the aggregate...",
            "score": 183,
            "replies": [
                {
                    "author": "RedSunWuKong",
                    "body": "Death by a thousand (budget) cuts",
                    "score": 37,
                    "replies": [
                        {
                            "author": "theivoryserf",
                            "body": "It's interesting, the chains near me seem to have upped their game to compete more with decent independent places. Guess there's going to be a lot of variation",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Simon170148",
                    "body": "Like most things that fail - one little step at a time",
                    "score": 13,
                    "replies": [
                        {
                            "author": "TheCannyLad",
                            "body": "Enshittification - apparently a contender for word of the year recently.",
                            "score": 8,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Matthew94",
                    "body": ">  Each one of them probably barely noticeable on their own, but in the aggregate...\n\nA bit like government regulations.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "WeatherwaxOgg",
                            "body": "And loss of EU staff who were well trained in the hospitality industry with higher standards. Now understaffed with untrained zero hours workers.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "armtherabbits",
            "body": "It's part of the business model, first you expand then you monetize.  Look ar Bill's -- it was great until it had enough locations and brand awareness, then it switched to fast food almost overnight.",
            "score": 275,
            "replies": [
                {
                    "author": "tobotic",
                    "body": ">  Look ar Bill's -- it was great until it had enough locations and brand awareness, then it switched to fast food almost overnight.\n\nBill's was amazing when it was two locations (Lewes and Brighton). Then Bill sold the business and the new owners opened up far too many branches too quickly, at the same time changing the business model. It went from a grocery store with a café in it to a café that also sold a few things in jars you could take home.",
                    "score": 99,
                    "replies": [
                        {
                            "author": "armtherabbits",
                            "body": "I knew bills when it was a guy called Bill and a market stall.\n\nThey didn't really turn the screws until about 2018 or so iirc -- up till then food was pretty good.",
                            "score": 28,
                            "replies": [
                                {
                                    "author": "tobotic",
                                    "body": "His brother ran the pizza place upstairs from the bus station. Only went there once or twice, but was good.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "Gingrel",
                                            "body": "That pizza place was great!",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "bowak",
                            "body": "Oh man, I haven't worked in Lewes since 2011 and I loved that place.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "TeHNeutral",
                            "body": "I remember visiting one in Horsham before they'd opened up in Kingston and Soho, they were quite solid then.    \nAnother one similar is that Megan's, before it even took off she had to sell up.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Bobinthegarden",
                    "body": "Hickory’s are next on the list for this.\n\nGreene King bought them in 2022 but weren’t allowed to change the business significantly as part of the sale agreement, but that apparently has a time limit.\n\nInevitably the accountants are going to get their hands on it and ruin it. When the one near me first opened it was fully booked for a month!",
                    "score": 26,
                    "replies": [
                        {
                            "author": "Tall_Working_2942",
                            "body": "There was one of the “originals” (when it was less than five in the country) near my work a few years ago.  \n\nIt was fun to go once or twice but I don’t see the appeal - and this is coming from someone who likes a large meal.  I think the last time we went for lunch, I totted up the totals and it would have been easily possible to pick a 3 course meal that would have been over 4,000 calories; that’s bonkers.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "GarrySpacepope",
                            "body": "What a strange clause to put in. Like I get trying to protect your families legacy business, but then don't sell it maybe? If the model is so fantastic that it doesn't need changing, you don't need to sell. But if you do need to sell, don't sell to one of the worst pub cos around, find a buyer who aligns with your values. \n\nI'd never heard of Hickory's - my first thought was they were buying all the H's from closing down hungry horses. But it's a hard time to be in hospitality, even harder when your business isn't premium and relies on large slabs of meat.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "rlaw1234qq",
                    "body": "Enshitification",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "No-Tone-6853",
                    "body": "Forget what it’s called, but that business model is basically expand without making a profit while taking over the market then once you’ve got it cut costs and make huge profits. I feel McDonald’s is probably a good example once they were fucking everywhere their product quality dropped, portions especially got smaller while the cost of them increase.",
                    "score": -6,
                    "replies": [
                        {
                            "author": "Historical_Owl_1635",
                            "body": "I think McDonald’s is a pretty terrible example, they’ve always been everywhere and generally the quality was still consistent and cheap.\n\nI think the quality has gone down with them purely due to the new delivery demand.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "one_pump_chimp",
                            "body": "Terrible example. McDonalds quality is unchanged in decades, albeit from a low level. Portions also have not gotten smaller at all. Cost has increased like everywhere, still half the price of competitors",
                            "score": -1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 124,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 47,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 2,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Big-Environment-4583",
            "body": "Private equity purchased a lot of businesses during the pandemic while sales were down\n\nTheir only goal is to maximise profit until the company dies",
            "score": 90,
            "replies": [
                {
                    "author": "Wise-Application-144",
                    "body": "IMHO they know hospitality is dead in the water and they're just asset stripping them. Take on huge \"recovery\" loans, restructure existing debt, sell and lease back all the buildings and hardware, pay out the resulting cash to themselves and let it go bust. \n\nI don't go to any of those places as I don't think they're seriously trying to run restaurants anymore. Just serving a few token meals to the few customers left so they can keep up the illusion for the sake of prying some more loans from investors.",
                    "score": 36,
                    "replies": [
                        {
                            "author": "bacon_cake",
                            "body": "Asset stripping in the hospitality sector is one of the few times where, as a customer, you can literally see the spending being pulled out of the business. \n\nSome of these chain restaurants barely exist within themselves any more. They're just prefabricated shells selling generic food with two members of staff and some token furnishings from the Morplan catalogue, some plastic plants, and a bit of music. I was in a Starbucks (appreciate they're not going out of business) recently and it was the first time I genuinely felt like I was actually being duped by a company. There was nothing to it. Literally it was just a box building, partitioned into a till, toilets, and cafe area, some cheap furniture, a mural on one wall, and a coffee machine. There was literally no further effort made at all, yet it was rammed.",
                            "score": 24,
                            "replies": [
                                {
                                    "author": "Wise-Application-144",
                                    "body": "Yeah I went to a Wagamama's recently and it was just one disorganised memeber of staff repeatedly pestering me to sign up to their mailing list. Place was absolutely empty. \n\nDespite this, they forgot to take my order, forgot to cook it and then forgot to bring it over. On three separate occasions I had to stand up, chase them down and be like \"uhhh you guys are serving food right? Can I have some\".\n\nAt this point I have to assume it's a data harvesting and asset-stripping venture and that they're no longer trying to sell food in return for money.",
                                    "score": 28,
                                    "replies": [
                                        {
                                            "author": "bacon_cake",
                                            "body": ">At this point I have to assume it's a data harvesting and asset-stripping venture and that they're no longer trying to sell food in return for money.\n\nI think you're pretty spot on. There's a great book that touches on some of this stuff called No Logo by Naomi Klein. It talks about how businesses like that used to rely on the strength of their products or services to fuel their reputation and sales, but now that's all secondary to the massive amounts of effort that goes into branding and the \"brand lifestyle\" despite the actual products and services just getting worse and worse.",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "author": "Wise-Application-144",
                                                    "body": "Ahhhh! I've thought about that before, didn't realise it was a recognised \"thing\". Will give it a read.\n\nOff the top of my head, stuff (especially old British brands) like BA, Jaguar, Range Rover, Tiffany, Starbucks, they just seem like outright scams to me. It's not that I don't like the products, it's that they seem exceptionally poor quality and high price, their entire survival seems predicated on people not realising what a bad deal they're getting. \n\nMy old boss got a Mustang Mach E. It was riddled with faults, and it's a flabby Chinese crossover with no racing ability, it just has \"Mustang\" written on the back. Yet my boss constantly boasted about the lifestyle and the brand of his \"'stang\". He's a smart guy but he somehow managed the cognitive dissonance.",
                                                    "score": 6,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "TeHNeutral",
                                                    "body": "I was unaware of the book, and found out it's over 20 years old - I suppose most of us, myself included on many matters, just sleep walk through life.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SlippersParty2024",
                            "body": "Interesting theory.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "catchcatchhorrortaxi",
                                    "body": "Not just a theory, you can watch it happening in real time.",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ghexplorer",
            "body": "Yes, I went to wagamama a few weekends ago for the first time in about a year. Not only have the prices increased exponentially, but my food was 80% beansprouts with about 3 sad bits of chicken in it.",
            "score": 115,
            "replies": [
                {
                    "author": "spaceandthewoods_",
                    "body": "Wagamama has gotten incredibly hit and miss as well; sometimes the food has flavour, sometimes it tastes like fuck all.\n\nAlso the whole \"we bring it out when it's ready\" thing has started to wear very thin, the last few times we've been one of our party has had to wait 20 mins after the first meal was delivered before their food shows up, and there seems to be no rhyme or reason as to why.",
                    "score": 56,
                    "replies": [
                        {
                            "author": "TeHNeutral",
                            "body": "It's so they don't have to time anything and removes something considered a vital element of a chefs repertoire.",
                            "score": 10,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "lovelight",
                    "body": "I remember way back when you could watch chefs in Wafamama's cook the food in the kitchen, now they tear open a plastic pre-proportioned pouch from a central kitchen and just dump it into a wok. It's a real shame.",
                    "score": 63,
                    "replies": [
                        {
                            "author": "SPYHAWX",
                            "body": "My local still has the open kitchen, unless they're just actors",
                            "score": 24,
                            "replies": [
                                {
                                    "author": "lovelight",
                                    "body": "Yup. But have a close look at what they are doing. Precious little cooking.",
                                    "score": 8,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Express-World-8473",
                    "body": "I paid £17 for Katsu chicken curry with extra chicken, I thought I would get a decent amount of chicken but nope it's barely 5 small strips of chicken. I double checked to see if it was the extra chicken I ordered, and was surprised that it was indeed my order. That was the last time I went to Wagamama. Kokoro is far better in terms of taste, quantity and even quality all while costing £7 for a small size which is still bigger than what Wagamama serves.",
                    "score": 20,
                    "replies": [
                        {
                            "author": "Larrygengurch12",
                            "body": "Kokoro is good! Can still get a large katsu curry for under a tenner I believe",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Gazmaster",
                    "body": "They used to do a Wagamama Ramen which had a bit of everything, pork, shellfish, etc. That went off the menu. Next the noodles declined in quality. Then the prices crept up. They will come for your children next!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 75,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 70,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "[removed]",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "None",
                                                                    "body": "[removed]",
                                                                    "score": 0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": -3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Scumbaggio1845",
            "body": "Short answer is definitely yes.\n\nTGI is kind of a baffling one for me because they have been flogging utter crap for years and I genuinely cannot comprehend how they managed to stay afloat, I remember going there in about 2015 bit by choice and being stunned by how the burger they had on the menu was worse than what they give you for staff dinner at pubs. Never understood why people voluntarily went there.\n\nThe rest of them are pretty much duty bound to drop standards in order to stay afloat, there’s also been a huge increase in ‘de-skilling’ and the number of convenience type products being used which accelerated after lockdown.",
            "score": 50,
            "replies": [
                {
                    "author": "Wise-Application-144",
                    "body": "An old colleague of mine was crazy about them and went every week because \"they sing happy birthday for you\" and she loved all the American memorabilia on the walls. This was a grown woman. \n\nShe did drag me there once and I could only conclude the whole place was just a vehicle to fleece Disney-adults.",
                    "score": 38,
                    "replies": [
                        {
                            "author": "thrrowaway4obreasons",
                            "body": "That might be the perfect summary of TGI",
                            "score": 13,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "No-Relation1122",
                    "body": "Cocktails! \n\nWhen I was in my late teens/early twenties, it was the cocktails with food that was passable. Big space, so work functions always defaulted to them as well.",
                    "score": 7,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 52,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Alundra828",
            "body": "I've found bigger restaurants are getting worse, but smaller ones are getting much better.\n\nBack in my youth, you either had nice high end restaurants, or local shitty places you'd go to chance food poisoning. If you wanted that in between, you'd go to say, McDonalds. Cheap, but quality tasting food. Now that's inverted some what. The local shitty places have turned into actually quite nice places, and because of food standards they've all turned into quite nice places to eat, with fantastic food, with reasonable prices. In comparison, because the chains are not competing at a local level they're just looking to raise profits across the board, they're still offering the same low quality food they were 10-20 years ago (if not worse quality) but dramatically raised prices, making it a no-brainer to never go there.\n\nMcDonalds is a prime example. It's toilet fodder. The point of it is low quality, cheap food. Now it's low quality expensive food. Fuck them. However, in it's place Burger King has swooped in to fill it's niche. It's not exactly *cheap* but the quality is far superior to McDonalds, making it the better option. These big chains are so focused on a global picture that they can't see they're being cannibalized from below by smaller players, and local businesses.\n\nAside from that, small joints like chicken places, kebabs, Indians, have really increased in quality. Shout out to Slim Chickens, quite genuinely the best KFC replacement there is. But even if they weren't the best, tonnes of smaller chicken places do KFC better than KFC do, because KFC have, like McDonalds gone down the low quality, high cost route.\n\nAnd because of Uber Eats, I know we gripe about how shite it is as a service, but it opens up such a large market for these places. Basically any large chain or franchise has a local knock-off that is way, way better. I only live in a small town and I'm spoilt for choice, I can't imagine what it's like in say, London. McDonalds? Burger now. KFC? Slim Chickens. Burger king? Gourmet Kings. Pizza Hut? Pizza Valley. Baskin-Robbins? Kaspas. Taco Bell? Mexican Now. Subway? Wrights. All of these are local alternatives for me to big chains, all of these are far superior in terms of quality, *and* cheaper. \n\nThis is true capitalist competitiveness in action. The big chain stores are busy enshittifying to save money. And this has left a niche for small local outfits to come in and take market share by offering a better product for cheaper or the same price. These food chain dragons are leaving themselves open to death by 1000 cuts. If people went local enough, these wankers would feel it enough to change.",
            "score": 21,
            "replies": [
                {
                    "author": "JimmyTheChimp",
                    "body": "I live in Australia and chains are so expensive where as independents (most east and south east asian, which are everywhere) are as cheap if not cheaper than the UK. You can get all you can eat wagyu BBQ for equal to 25 pounds, I could get lunch KBBQ for 7.50. My girlfriend and I often get thai and share a couple plates and a starter it comes out to $40 so about 10 pounds each. These places are always busy, they are so cheap its now cheaper than McDonalds and KFC.",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "Teembeau",
                    "body": "My theory about all this is that TripAdvisor massively changed the information about restaurants.\n\nThere was a time people would go to a familiar name like Pizza Express, Bella Italia. It isn't the best food, but it'll be OK where a random Italian might be great, or might be terrible. That's the value of most chain restaurants. There isn't a scale advantage, it's the brand reputation. But that also costs money because of management, national marketing etc. So Pizza Hut is no cheaper than a local pizzeria.\n\nOnce you get TripAdvisor or OpenTable, you can see the places that get consistently high scores. Pick from the top of the list and you're going to get at least a good meal. It destroys the value of chain restaurants. You can be a pub out in a village with zero marketing budget and people will come to you because of it, if you're really good.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "ImpressNice299",
                    "body": "Exactly. I spend a lot of time in hotels in London and I get deliveries. I order from places I would never have considered before I could look up reliable reviews (and food hygiene scores) online.\n\nLondon has some of the best burger restaurants in the world at the moment because the competition is relentless. Compared to a few years ago, you probably have to be in the top 10% just to survive.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "WiggyDiggyPoo",
                    "body": "Burger King has always been superior to McDonald's. A Whopper meal may look expensive but it's much more filling.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 19,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RockTheBloat",
            "body": "It's the private equity model. Squeeze every ounce of goodwill possible out of a brand while taking as much money from the business as possible until there's nothing left of value and lots of debt, then pull the plug.",
            "score": 34,
            "replies": [
                {
                    "author": "rising_then_falling",
                    "body": "That's not the private equity model. It's the way some PE firms approach some of their investments. There are plenty of good PE firms that materially improve the company and then sell at a new and sustainably higher value.",
                    "score": -5,
                    "replies": [
                        {
                            "author": "catchcatchhorrortaxi",
                            "body": "Once maybe, not any more. Even when they aren’t asset stripping, market value arbitrage multipliers rarely come about without somebody, somewhere getting trodden on.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 12,
            "replies": []
        },
        {
            "author": "rsoton",
            "body": "Would much rather give my hard-earned to independent, or family-run, or even small local chain establishments than give it to American-owned corporate chains where the staff don’t care about you or the food because they’re just working for some corporate chain and being paid a pittance.",
            "score": 12,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 28,
            "replies": []
        },
        {
            "author": "thefreeDaves",
            "body": "Yes in the short answer. In fact I’d aver that the entire retail/high street customer service experience is dropping drastically. \nThere are several reasons for this I believe but I’d start with lack of engagement, lack of good management ( from top to bottom) & lack of incentives or any profit shares to motivate the staff.",
            "score": 7,
            "replies": [
                {
                    "author": "DarkangelUK",
                    "body": "Increase in produce costs has driven ingredients prices up\n\nIncrease in fuel costs has driven delivery prices of said ingredients up\n\nIncrease in energy prices has risen drastically to keep the lights and cookers running\n\nIncrease in minimum wage combined with NI hike has driven employee wage costs up\n\nThere aren't many avenues left for growing big profits these days other than increasing prices to the consumers will being served by people who are over worked and understaffed as they cant hire more workers.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "thefreeDaves",
                            "body": "Yup. We’ve worked hard at pricing ourselves out of work.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "South_Buy_3175",
            "body": "The bar was never particularly high to begin with in my own experience. But nowadays it’s cost cutting to the extreme, trying to squeeze every drop of profit out the thing.\n\nThe bigger chains will survive but we’ll see plenty up and die as owners continue to squeeze. ",
            "score": 9,
            "replies": [
                {
                    "author": "Beartato4772",
                    "body": "It's also easier to do food at home now I'd say too.  People have got smarter, there's good frozen stuff that gets you half the way there.  As much as I find the air fryer craze amusing it's made vaguely coherent cooking easier for more people.\n\nAnd let's be honest, at a chain they were never chefs, they were normal people doing their best with a chef's instructions.\n\nEven if the chains hadn't got worse, the gap would have closed.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "newfor2023",
                            "body": "Yeh I can buy a pack of quarter pounders that are actually all meat and even Angus or flavoured ones for very little. Then have a half pound burger for 1/4 the cost of eating one out that is somewhat unknown quality or content and isn't on a brioche bun. It makes the decision rather easy. \n\nSame with steaks, soon as you learn to cook one properly then the £20+ for a sirloin versus what even the butchers will sell ribeye for is wildly disproportionate. \n\nFish and chips I've done but it's a huge pain in the arse. SO orders it since it's something we don't do at home. I usually try and find a place that specifically does something I can't make or buy easily.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Farscape_rocked",
                    "body": "\"Cost cutting to the extreme\" is them trying to keep prices from going up massively when costs have risen sharply.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "South_Buy_3175",
                            "body": "Prices have gone up though, massively.\n\nKFC charges out the arse for usually mediocre fried chicken. I can and do get better for cheaper down at the local chicken place.\nSame with TGI’s, same with majority of chains. \n\nIf doesn’t matter what they’re trying to do, if the food is expensive and sucks then people will eventually stop going altogether.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "theyst0lemyname",
            "body": "Are the standards in the UK dropping drastically? Yes.\n\nMost industries are in a race to the bottom to maximise profits at the expense of quality.",
            "score": 14,
            "replies": [
                {
                    "author": "ImpressNice299",
                    "body": "This is just Reddit doom worship.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Advanced-Essay6417",
            "body": "Chain restaurants now cost as much as an independent and the latter will be better. I've just stopped going there if I can. A slop up meal at McDonalds costs as much as the set menu at the local Chinese.",
            "score": 8,
            "replies": [
                {
                    "author": "Motor_Line_5640",
                    "body": "I was suspicious of your claim, so I checked. Set menu A at my local (a meal for 1 person) is £12.50, which is crispy pancake rolls, sweet and sour chicken hong kong style and egg fried rice. Whereas at McDonalds, 9x nuggets, fries, sprite and a McFlurry is £8.89. And a meal for 4 - 2x large burgers, 2x small burgers, 2x large fries, 2x small fries, is £14.99.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "LennonC123",
            "body": "Yeah, I don’t really look forward to eating out at a chain restaurant any more. Had an impromptu day out with the wife on Saturday, went to the real Greek, really enjoy the food but the service was shocking. There was only 6 tables with customers including us, and they somehow forgot our order. \n\nMy wife noticed we’d been waiting over half hour for our food so she asked if we could have the bread and dips to get started, 5 minutes later the waitress came back and asked us what we ordered. I said we’re going to leave, she panicked and after speaking with someone, our food was almost ready. Came to our table a few minutes later. It was good to be fair but our appetite had gone. They offered us staff discount on the bill which I accepted, but they still gave me a bill with a service charge on. \n\nTwo other tables complained about their food; one had raw chicken, and I couldn’t tell what the other table complained about.",
            "score": 5,
            "replies": []
        },
        {
            "author": "levinyl",
            "body": "People still go to TGI and expect anything decent? From the food to the service it is utterly despicable!",
            "score": 4,
            "replies": []
        },
        {
            "author": "itsYaBoiga",
            "body": "The two chains you mention, this has always been the case. TGI is overpriced pub food, and Nando's is very expensive chicken, for a USP that has now been replicated by many fast food places much cheaper.",
            "score": 5,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 21,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 9,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 22,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 10,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 6,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 12,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 13,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": -4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "None",
                                    "body": "[removed]",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "[removed]",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "None",
                                                    "body": "[removed]",
                                                    "score": 3,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 2,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Torgan",
            "body": "There's been lots of inflation but incomes haven't kept up. So if restaurants don't want to raise prices they need to cut costs, so cheaper ingredients, smaller portions etc. And remember businesses didn't benefit from the enefgy price cap. Mid quality chains have suffered a lot, people only go for the cheap option or high end for a special occasion.",
            "score": 3,
            "replies": []
        },
        {
            "author": "No_Potato_4341",
            "body": "TGI Fridays yes, I think they have definitely lowered their standards and they just don't good food anymore. I actually think wetherspoons have also gone downhill as well and don't do decent food anymore either. Nandos no, I think they still do decent food tbh. One of the few places that still does. ",
            "score": 3,
            "replies": []
        },
        {
            "author": "Fuzzy_Appointment782",
            "body": "I avoid chain restaurants wherever possible, happy to pay a little bit extra at an independent and pay for food that will be properly cooked, and something a little bit different to what I could get elsewhere (or make myself at home).",
            "score": 3,
            "replies": []
        },
        {
            "author": "AdjectiveNoun111",
            "body": "It's probably a convergence of 3 different factors.\n\n\n1. Inflation, so food which was previously considered \"cheap but ok\" is now expensive but still just ok\n\n\n2. Overall food quality has improved a lot in this country, so people are developing more discerning palates\n\n\n3. Most chains will inevitably over extend, and attempt to boost profit by cutting costs. That could mean cheaper ingredients, or cheaper/less skilled staff",
            "score": 3,
            "replies": []
        },
        {
            "author": "alanaisalive",
            "body": "Under capitalism you need to constantly grow to be considered successful. So businesses grow and expand to make more money, but there is a saturation point for how many locations can still be profitable given the population. When they reach that point, the only way to continue making more money is to either innovate and come up with something new and exciting to draw in more customers or raise prices and cut costs. Most opt for the latter because it is less risky. So quality goes down and prices go up and people lose interest and company goes bankrupt and blames the customers for not enjoying their overpriced garbage anymore. Most chain restaurants are in that final phase right now.",
            "score": 3,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 2,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 2,
            "replies": []
        },
        {
            "author": "individualcoffeecake",
            "body": "It’s the business model of do as little as possible for as much as possible.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Important-Call6087",
            "body": "I think it is probably the same. It’s not like shifting quality and cost-cutting didn’t exist prior to the 2020s. However, I think with ever-increasing prices (particularly within fast food) people tend to question the quality and service a lot more than they would have previously.",
            "score": 2,
            "replies": []
        },
        {
            "author": "RJLHUK",
            "body": "Nando’s is a disgrace these days. I’ve commented about this before because I’m personally offended with how bad it’s gotten. The product is worse and the price is higher, I’ve gone from going weekly to nearly never. Awful.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Jabber-Wockie",
            "body": "They operate on fine margins and pay shit wages. Any change in supply-chain costs means they make cuts.\n\nThey are being fucked by inflation and have run their people into the floor with terrible management practices.\n\nIt's probably hell to work in them, so people do the very least they can to secure a paycheck.",
            "score": 2,
            "replies": [
                {
                    "author": "Jabber-Wockie",
                    "body": "Many are franchises or locked into huge debt products by big corporates and operated by spreadsheets that have no interest in the actual business.\n\nA cash cow held up by borrowing.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "UKS1977",
            "body": "Yes. This is because management is trying to keep costs down due to huge inflation over the last couple of years - This has meant quality reduction. But also they buy a lot of products in - which have their own management with their own concerns and own quality reduction. And so forth.\n\nA lot of these chains are owned by VC firms who also want to see growing profit not just revenue, so they enourage the squeezing even at the best of times.\n\nJohn Ruskin said it best: \"**There is hardly anything in the world that cannot be made a little worse and sold a little cheaper, and those who consider price alone are that man's lawful prey.\"** ",
            "score": 2,
            "replies": []
        },
        {
            "author": "Pyriel",
            "body": "Because they keep getting bought out by venture capitalists, who are only interested in increasing profits.\n\n**Nandos** \\- now owned by Yellowwoods \"a private investment group with a portfolio of investments primarily in the financial services, restaurant and hospitality sectors.\"\n\n**TGI Fridays** \\- went bankrupt, with the remaining UK stores bought private equity firms Calveton UK (a private investment company focusing on branded opportunities in consumer and retail sectors.)  and Breal Capital (A private equity firm)\n\n**KFC** \\- bounced around, now owned by YUM! Bands, \"an American multinational fast food corporation\" not technically Private finance, but little difference.\n\n**Pizza Express** \\- repeatedly sold to Private investment firms, now owned by \"A group of private bondholders\"\n\n**TheRealGreek** \\- Owned by CapDesia \"an investment firm exclusively focused on European branded restaurant chains.\"",
            "score": 2,
            "replies": [
                {
                    "author": "TAWYDB",
                    "body": "KFC hasn't really bounced around. It's been owned by Yum since it Yum was spun out of Pepsico in 1997, who'd owned KFC since 1987. \n\nNot like Yum is a private equity firm, its atleast an actual food business first. Still big and corporate but different than the others for sure.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "l8yters",
            "body": "I used to go TGI a lot. Then a friend got a job there in 2019 and showed me some photos from the kitchen.\n\nSafe to say, I haven't been since.",
            "score": 2,
            "replies": []
        },
        {
            "author": "mayowithchips",
            "body": "It’s shocking how expensive chain restaurants are, don’t know how families can afford it casually.",
            "score": 2,
            "replies": [
                {
                    "author": "YodasGoldfish",
                    "body": "Even McDonald's is too expensive for a family. Two adults and a 9 year old is over £20 and you are still hungry afterwards.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "mayowithchips",
                            "body": "It’s sadly more expensive than before but still the most affordable. The chain restaurants discussed in this thread have main courses around £20 each!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Equivalent_Parking_8",
            "body": "Yes, this has been true for a while. Cheaper ingredients, overpriced, poor quality. You may as well go to Wetherspoons and eat their shit for a few quid. Going out anywhere half decent now is minimum £30/head, for a family of 4 that's a lot of cash.",
            "score": 2,
            "replies": [
                {
                    "author": "RedPlasticDog",
                    "body": "And spoons is no worse than any of the chain pubs",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Pizza_Reasons36",
            "body": "It used to be a case of you know what you were getting at a chain and you didn’t mind paying a little extra. Now a majority are of no better quality and more expensive. I try and go to independent or smaller local chains where possible now, as it’s generally a better experience and no more costly.",
            "score": 2,
            "replies": []
        },
        {
            "author": "kitjen",
            "body": "Back in the 80s, American Airlines realised they could save $40k a year simply by removing one olive from each First Class meal.\n\nIt was a strategy which later became a business model: Give less, charge more. \n\nThese chain restaurants know they can give consumers a slightly cheaper product but through mass sales it adds up.\n\nThey either hope you won't notice or they simply don't care.",
            "score": 2,
            "replies": []
        },
        {
            "author": "72dk72",
            "body": "The place that shocks me most is McD's. The food is only a snack not a meal (always feel hungry afterwards) and it works out cheaper to have a proper meal in 'spoons or other chain pubs. I swear the burgers are smaller now  too and clearly not made with any love or attention.",
            "score": 2,
            "replies": []
        },
        {
            "author": "mumwifealcoholic",
            "body": "I want to love Nandos..like I used to. But it's clear they have used other supplier for some of their sides. Peri Peri..mac and cheese we used to love so much....now tastes like it came out of a can. \n\nWe've given up on going out to eat mostly.",
            "score": 2,
            "replies": []
        },
        {
            "author": "First-Lengthiness-16",
            "body": "To be fair Nando’s has always been shite.  An average at best chicken shop that is probably 50% over priced.\n\nThe type of people who are impressed by Nando’s are the type of people who clap when the plane lands.  Thick.\n\nI think with TGIs the standards have gone down hill and they rely on the quirkiness of the brand to try to stand out.",
            "score": 1,
            "replies": [
                {
                    "author": "wildOldcheesecake",
                    "body": "Not sure what crowd you’re in but to be impressed by Nando’s like you claim yet to hate it this much is odd and not true outside of Reddit. \n\nI see it plenty busy every time I pass by. It’s not really expensive for a sit down meal. A 1/4 chicken and sides is plenty filling and decently sized. Like McDonald’s, it can be inconsistent at times but on the whole, you know what to expect. Fantastic for catering to specific dietary needs. Unlike maccies, it keeps you full. Yes it’s more expensive than previous years but so is everywhere else.",
                    "score": 12,
                    "replies": [
                        {
                            "author": "First-Lengthiness-16",
                            "body": "There are loads of thick people around.\n\nThey probably pick their kids up from school in pyjamas.\n\nIt’s very expensive for what it is",
                            "score": -14,
                            "replies": [
                                {
                                    "author": "wildOldcheesecake",
                                    "body": "> There are loads of thick people around \n\nTakes one to know one. Try to go outside sometimes.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "First-Lengthiness-16",
                                            "body": "What on earth has led you to believe I don’t go outside?\n\nYou seem like the kind of fellow who loves a cheeky nandos.  Am I right?",
                                            "score": -4,
                                            "replies": [
                                                {
                                                    "author": "wildOldcheesecake",
                                                    "body": "I enjoy all food.",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "author": "First-Lengthiness-16",
                                                            "body": "Ahh you have low standards and are easily impressed?\n\nMakes more sense.",
                                                            "score": -3,
                                                            "replies": [
                                                                {
                                                                    "author": "wildOldcheesecake",
                                                                    "body": "Cunt.",
                                                                    "score": 8,
                                                                    "replies": [
                                                                        {
                                                                            "author": "First-Lengthiness-16",
                                                                            "body": "Please don’t swear, I won’t report you this time.  However, some folk would do so.\n\nThink about that in future please.\n\nYou can’t admit to having absolutely no standards and then get annoyed when people point it out.\n\nIt’s probably good you don’t have a discerning pallet, makes food easier for you",
                                                                            "score": -6,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "v2k987",
                                                                                    "body": "Just look at how many posts this guy has in the last 24 hours. Complete loser.",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "author": "First-Lengthiness-16",
                                                                                            "body": "Using Reddit doesn’t make him a loser buddy.\n\nWe all use Reddit.\n\nI tend to use it at down time at work, some people use it for escapism, some use it to connect with their hobbies etc.",
                                                                                            "score": 0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "author": "callisstaa",
                                                                    "body": "Average redditor lol",
                                                                    "score": 2,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "deathmetalbestmetal",
                    "body": "> An average at best chicken shop that is probably 50% over priced.\n\nI find it completely bizarre when people on this sub say things like this. Nando's isn't expensive at all. Half a chicken or a burger, with two sides, is like £15. Where on earth are you getting an eat-in meal like that for £7.50? Can barely get that takeaway from a chicken shop with 2-star hygiene rating.",
                    "score": 20,
                    "replies": [
                        {
                            "author": "wheatamix",
                            "body": "People like to dunk on Nando's in the same way that they still like to dunk on Coldplay in 2025.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "SaltyName8341",
                            "body": "2 bits of chicken,2 hot wings and chips £3.50 local shop 4*",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "catchcatchhorrortaxi",
                                    "body": "While Nando’s is undoubtedly over priced for mediocre chicken, are you not concerned that it’s so very cheap in those places? I don’t think I’d risk eating a hunk of chicken that cost less than a can of coke.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "SaltyName8341",
                                            "body": "My reply was to illustrate that the previous commenter was shooting wild on pricing. I don't frequent either establishment as I don't eat fast food and in reference to the chicken being cheaper than a can of coke you should see the prices when buying in bulk as a former supply chain worker you'd be surprised how little the big boys pay for chicken.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "First-Lengthiness-16",
                            "body": "I’m not sure you know what 50% over priced means.\n\nThick people like Nando’s…..",
                            "score": -9,
                            "replies": [
                                {
                                    "author": "deathmetalbestmetal",
                                    "body": "We can take the overvaluation as a percentage of the theoretical true maket price rather than the retail if you like, but the point will remain. Where is it you're getting food for so cheap?\n\nAnd seeing as we're trading insults now apparently. Thick people don't know how to use ellipses.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "author": "First-Lengthiness-16",
                                            "body": "No need to use them in our discussion so far.\n\nYou didn’t understand the maths, which is fine.\n\nMost chicken shops will do a chicken burger and sides for less than a tenner, probably get a drink included too.",
                                            "score": -4,
                                            "replies": [
                                                {
                                                    "author": "deathmetalbestmetal",
                                                    "body": "> No need to use them in our discussion so far.\n\nWhy did you then?\n\n>You didn’t understand the maths, which is fine.\n\nThe maths isn't difficult, but it's not clear what 50% overpriced means by default. If you're saying that it should be £10 your point isn't any stronger.\n\n>Most chicken shops will do a chicken burger and sides for less than a tenner, probably get a drink included too.\n\nAt a sit down restaurant? Absolutely no chance and we both know it.\n\nYou do get that going out to eat is about more than the item of food alone, right?",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "First-Lengthiness-16",
                                                            "body": "You made a silly comment and included awful maths in the comment, of course it was getting picked up on.\n\nThe maths isn’t difficult, but you didn’t get it.\n\n£10 for a chicken shop meal is easily found.  It is rare they charge more for a sit down.\n\nNando’s is equivalently priced to some pretty decent restaurants, one course and a drink is the best part of £20.\n\nThis is terrible value for money.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "author": "Martipar",
                                                                    "body": "Tax avoidance generally lowers prices but places like Nando's are a bit more legal. \n\nVAT is applicable to restaurant food but not takeaway food, sitting on should be at least 20% higher, though obviously having waiting staff to pay pushes that up a bit more.",
                                                                    "score": 1,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "author": "deathmetalbestmetal",
                                                                    "body": ">You made a silly comment and included awful maths in the comment, of course it was getting picked up on.\n\nYou seem to be conflating a mathematical calculation with the unclarity of what was meant. There's no set mathematical concept for something being overpriced. It doesn't exist as a standard.\n\nYou're also making absolutely no sense at all now. You claimed in the comment previously that there was no need for insults, but now there is? Which is it? \n\nShall we have a discussion about your inability to count?\n\n>£10 for a chicken shop meal is easily found. It is rare they charge more for a sit down.\n\nBut you're conflating the concept of a sit down meal and the physical act of sitting down, and we're both well aware of that.\n\n>Nando’s is equivalently priced to some pretty decent restaurants, one course and a drink is the best part of £20.\n\nDo you live in a deprived area?",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "No_Ferret_5450",
                    "body": "Bit harsh, I know it’s not the best but more of a guilty pleasure ",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Far_Reality_3440",
                            "body": "Yeah I think thats harsh all the chicken shops round me are deep fried KFC alternatives, Nandos USP is that it's much more healthy.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "itsmetsunnyd",
                                    "body": "My area all the chicken places do Nandos better than Nandos do. It's actually genuinely difficult to find decent fried chicken.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Far_Reality_3440",
                                            "body": "Really, wheres that?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "itsmetsunnyd",
                                                    "body": "I'm in Gloucestershire",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Green_Sprout",
                    "body": "I've eaten at Nandos once, just to see what the hype was all about... I'd rather go hungry than ever set food in there again and this was at the height of the 'cheeky' Nandos fad.",
                    "score": -3,
                    "replies": [
                        {
                            "author": "First-Lengthiness-16",
                            "body": "If you think of every person that you have ever heard use the phrase “cheeky Nando’s”, can you think of one that isn’t a twat?",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "Green_Sprout",
                                    "body": "Was dating a lass who pestered me for a cheeky Nando's because it was the 'best' thing she'd ever had, she wasn't a twat but she wasn't the sharpest knife in the drawer, I cancelled our plans and instead took her first to morrisons then back to mine where I made a quick Hunter's Chicken and proceeded to blow her mind, turned out her family had been too poor to go out much and the home cooking was of the type stereotypes are made from so she'd never learned or had good home cooking and stuff like Nando's was 'good' to her.\n\nBut to answer your question - 99% of the cheeky crowd are pillocks.",
                                    "score": -3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "YesIAmRightWing",
            "body": "Defo\n\nA lot of microwaving etc etc\n\nMaybe am paranoid but these days i don't bother eating out unless I can see my food being cooked.",
            "score": 2,
            "replies": [
                {
                    "author": "Farscape_rocked",
                    "body": "That's not new. \n\nWhat's changed is the cost of everything has gone up, especially energy, and big chains don't want to put prices up so the quality and portion sizes reduce.\n\nYou can see this really clearly when you look at price rises in local independent takeaways pizza shops vs dominos. Suddenly dominos doesn't look ridiculously expensive any more and that's because they've absorbed the price rises whereas independent shops don't have the ability to do that.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 2,
            "replies": [
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 1,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[removed]",
                    "score": 0,
                    "replies": [
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "None",
                            "body": "[removed]",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "AutoModerator",
            "body": "**Please help keep AskUK welcoming!**\n\n- When repling to submission/post please **make genuine efforts to answer the question given**. Please no jokes, judgements,  etc.\n\n- **Don't be a dick** to each other. If getting heated, just block and move on.\n\n- This is a strictly **no-politics** subreddit!\n        \nPlease help us by reporting comments that break these rules.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskUK) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "mrvlad_throwaway",
            "body": "staff cuts and price cuts have created this drop In quality essentially\n\nI'd much rather make my own food it's much Healthier and cheaper and makes me feel less of a lazy cunt..\n\nrecently been making myself chiptole style salads as have been on a health kick since last October, feel so much better now I've quit all the junk out - I dont even miss it either.",
            "score": 1,
            "replies": []
        },
        {
            "author": "StatisticianOwn9953",
            "body": "Nando's was one and done for me. Even got the shits for my trouble. Just this last weekend discovered that Chiquito is basically as bad as Nando's. There's a Chef and Brewer place near to where I live that's surprisingly nice and inexpensive, though, so some chains are still worth the trouble.",
            "score": 1,
            "replies": []
        },
        {
            "author": "IllustratorDismal452",
            "body": "TLDR: yes, very much so",
            "score": 1,
            "replies": []
        },
        {
            "author": "BaseballFuryThurman",
            "body": "They're as good/bad as they've always been.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Medium_Situation_461",
            "body": "Nando’s is starting to lose its quality, there is a place in barking (which is a fucking shithole), that is far superior to Nando’s and consistently good. \nI went to Wagamama for my birthday, first time I’ve been in a while, it was bitterly disappointing, bland and over priced. . \nRemember when Pizza express went shit? They have pulled it back slightly, but nothing like it was in the late 80s early 90s. \nIt happens.",
            "score": 1,
            "replies": []
        },
        {
            "author": "chefshoes",
            "body": "they're probably realising places like spoons are raking it in for cheap food so they're trying to get the same audience, nandos is now date night for gen z and teenagers\n\nprices are going up as well but the standards remain the same, \n\ni had my inaugural filet of fish from mcds the other day, underwhelming and 4.50!\n\nbut the car park is always rammed.\n\ncafe rouge used to be a bistro its now nothing more than a tgi friday\n\ndo think covid had a lot to do with it, they lost a shit ton of money and will take it anywhere they can for as cheap as they can",
            "score": 1,
            "replies": []
        },
        {
            "author": "MidfieldGeneralKeane",
            "body": "Seems to be the in thing now to give toddler portions for expensive prices. I no longer go to certain places due to this very thing. Even pubs do it now! I remember getting my roast and saying \"is that it?\" it literally was one roast potato, a slither of beef, couple of carrots and one sprig of broccoli with gravy that didn't even cover most of the meal. I asked for more so they did do it for me but the waitress was in a huff about it.",
            "score": 1,
            "replies": [
                {
                    "author": "bumblebutter123",
                    "body": "Meanwhile Toby carvery is roughly a tenner and unlimited sides!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AdministrativeShip2",
            "body": "I had my first McDonald's in years.\n\n\nBusy Town centre location.\n\n\nIt was Grey, thin and fully of watery burger sauce.\n\n\nI should have walked further down the road to spoons.",
            "score": 1,
            "replies": []
        },
        {
            "author": "michaelisnotginger",
            "body": "Went to Wagamamas last night and despite the prices going up a bit, it was the same standard it's always been",
            "score": 1,
            "replies": []
        },
        {
            "author": "clrthrn",
            "body": "The only good thing in Nandos is the sauce. I buy it then make my own chicken at home where it's infinitely tastier and I am the portion control.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sirico",
            "body": "Line must go up",
            "score": 1,
            "replies": []
        },
        {
            "author": "jamesdownwell",
            "body": "Maybe a TGI thing generally, not just confined the UK? The ones here in the Reykjavik area have a terrible reputation.",
            "score": 1,
            "replies": [
                {
                    "author": "Signal_Two_9863",
                    "body": "Worst chain restaurant on the planet tbh, how they're still trucking along I don't know. I'm guessing they'll be liquidated in a few years.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheYetaaay",
            "body": "I think rising prices means the chains aren't that much cheaper than something much better. It's left a gap open for successful restaurants with good models to come in. Look at the success of Dishoom and Rudy's. I think a lot will survive because you can endlessly count on the British public to pick safe options that they know. How well delivery services are utilised will also be a factor.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mattamz",
            "body": "Id expect not the greatest food if it's a chain and cheap. I've been to tgi and was disappointed it was £50 for 2 burgers and drinks\n\n. Similar price and pizza express but it was worth it there imo.",
            "score": 1,
            "replies": []
        },
        {
            "author": "EmmanuelZorg",
            "body": "Broadly agree but I think Pizza Express bucks this trend, never had a bad Pizza Express in 10 years.",
            "score": 1,
            "replies": []
        },
        {
            "author": "tmstms",
            "body": "I think many many hospitality and food businesses have been hit by massive cost rises, that they cannot wholly pass on to customers. So they have to cost- and therefore quality-cut. So, yes I agree, but not just chains- throughout the food industry in every sector.",
            "score": 1,
            "replies": []
        },
        {
            "author": "goldensnow24",
            "body": "Never bother with chain restaurants. 99% of the time I can make better food at home. I’ll only eat out in independent places that I know are excellent, and pay more (but eat out less, so it balances out).",
            "score": 1,
            "replies": []
        },
        {
            "author": "BackgroundChemist",
            "body": "Private/Pirate Equity groups stripping all the value from brands and leaving them in the gutter.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Radiant_Fondant_4097",
            "body": "It's not so much the standards, but the ludicrous price is what sets your expectations to not suck.\n\nNandos to me is slightly upscale McDonalds which I like but I know its not super, TGI's again is nice but not expecting amazement. However when you look at the price I think fuck that, chicken and burgers should NOT cost that, I'd rather go to a nicer italian if I'm going to spend that kind of money.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WarWonderful593",
            "body": "I live in West Wales, so far in the back of beyond that there are no chain restaurants in a twenty five mile radius . Not even a McDonald's. There are some great independents at all price ranges that can thrive because the chains aren't taking the business away.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Teembeau",
            "body": "Honestly, even years ago I thought TGI Fridays were overpriced. It's got great branding and it looks like it'll be fun but the food was never that great.\n\nAnd my other thing is, I believe Spoons are brilliantly run. It's all about packing the punters in, all day. A lot of the costs of a pub or restaurant are fixed. Rent, rates, heating, lighting, kitchen, decor, cleaning etc. Whether you sell 3 lunches or 30, those costs are the same. The only extra cost is the ingredients and that's normally around 1/4 of the cost of a meal. So, you take your margin down a bit, more people come to you. And what you lose in margin, you make up in volume.\n\nIf I'm travelling, it's my top choice. I know what I'm going to get and it's fine and cheap. I like the jacket + bean chilli and it comes with a soft drink for about £6. I was in a town working and the nearest place to eat was the Spoons across the road, so I went over and on a Wednesday night it was really busy. If I went to any other pub on a Wednesday night it wouldn't be even half that busy.\n\nAnd think about things like how Spoons opens for breakfast. Does Nando's? No, they don't. So, part of all those fixed costs are covered by people popping in to get a fry up and a coffee. You're already paying for the building, why not open longer (I never understand cafes that open after 9am).",
            "score": 1,
            "replies": []
        },
        {
            "author": "Foddley",
            "body": "They all seem to be staffed by microwaves.",
            "score": 1,
            "replies": []
        },
        {
            "author": "One-Staff5504",
            "body": "These kind of chain restaurants are the absolute worst. TGI, Chiquito, Frankie and Bennys etc all utter crap. The only decent one is Wagamama and that is good downhill too. Stick to independents or smaller chains like Dishoom.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ComprehensiveSwim882",
            "body": "All big companies are run by pricks. \n\nSo a big chain is going to consist of selfish owners, inhumane management, overworked/underpaid chefs and waiting staff who no longer have to be nice to you for tips because no-one carries cash.\n\nIt's a recipe for disaster (and a hockey-puck of a burger).",
            "score": 1,
            "replies": []
        },
        {
            "author": "YodasGoldfish",
            "body": "I couldn't tell you the last time I ate in a chain restaurant and didn't think 'I could genuinely cook better food at home with supermarket ingredients '",
            "score": 1,
            "replies": []
        },
        {
            "author": "jpepsred",
            "body": "Stop the press! TGIF and Nando’s are a bit shit??",
            "score": 1,
            "replies": []
        },
        {
            "author": "Warm-Conclusion-8891",
            "body": "The same has happened to The Lounges chain sadly. Used to be a nice treat, but the food is now the same quality as Spoons but vastly more expensive.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CheesyLala",
            "body": "I think the main thing chains try to do is cut operating costs, and the easiest way to do that is shrink the number of people serving to the bare minimum. \n\nWent to a Bella Italia a little while back, there was one overworked waitress trying to cover the whole joint. It wasn't rammed, but maybe 15 tables in, it needed at least 2 if not 3 people. You could see on her face she was miserable and knackered and run off her feet. It was also a terrible idea financially too, as we had one drink and main course when I think had the service been quicker we'd have had at least one more drink, probably a pudding and a coffee as well, but instead we buggered off, bought cake on the way home and had cake and coffee back home. So saving £12 an hour on a server probably cost them £60-80 off our bill alone. Total false economy.\n\nThey all work like this when they become chains - decisions made on a spreadsheet by a finance person, not in the restaurant by someone reading the room.",
            "score": 1,
            "replies": []
        },
        {
            "author": "WilMeech",
            "body": "I would say it's because when chains are starting off they need to have good quality food to get people through the doors and build their reputation. Once they have that reputation and brand recognition, it's no longer profitable to make actually good food so they make cheap stuff instead and rely on their brand recognition to ensure customers still come to them",
            "score": 1,
            "replies": []
        },
        {
            "author": "Westgateplaza",
            "body": "Tbf I find eating out in the UK generally an underwhelming experience. I normally find good restaurants through word of mouth and try to avoid chains (except Giggling Squid)",
            "score": 1,
            "replies": []
        },
        {
            "author": "sphvp",
            "body": "Even The Ivy in my city is shit. The staff is completely incompetent, and the prices are insane. I have honestly stopped going out to eat. It's much safer and cheaper to prepare food at home. \n\nHonestly the only decent places in my town are Miller and Carter and all Wetherspoons. Elsewhere the standards are mediocre - food is not great and super expensive, most venues smell like mold, staff would not give excellent customer service, yet they ask for a service charge at the end. My friends and I are always disappointed when we go out as there are never any decent places to eat at.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Melonpan78",
            "body": "I live in a city with a ghastly outlet/ chain restaurant village, and I can't remember a time in the last 20 years when any of the prominent names were ever considered 'good'. \n\nI'd say the only decent eatery in the development is Brasserie Blanc, and if someone tells me that's gone downhill recently, I'll cry.",
            "score": 1,
            "replies": [
                {
                    "author": "planetmatt",
                    "body": "It has. Went for their roast recently which we'd previously enjoyed. The roast potatoes were under cooked, the beef over cooked and under seasoned, and the unlimited gravy was a threat, not a benefit.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Crompton201",
            "body": "The chain food places are definitely going down hill but not getting any cheaper . I had a mixed grill from a weatgerspoons in Cheltenham which was inedible. Went to a botanist in marlow twice and both times it was pretty poor ,staff not trained well ,food was just average and it Was way over priced .unfortunately if you go to weatherspoons or a hungry horse you use to get what you paid for but even this isn't true anymore .",
            "score": 1,
            "replies": []
        },
        {
            "author": "smb3something",
            "body": "Living standards (and it seems like just about everything else) is falling in the UK and most of the world. Some people just want to horde all the money.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BanditKing99",
            "body": "Zizzi is still good",
            "score": 1,
            "replies": []
        },
        {
            "author": "thebuttdemon",
            "body": "Joke is on you for going to TGIs, that place has been the pits for at least a decade now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CandleAffectionate25",
            "body": "We had a voucher to use at Prezzo. After telling my partner how nice it is, (I haven't been for a few years mind) and I was quite embarrassed, it was really average!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Financial-Couple-836",
            "body": "The Restaurant Group, the company that owns a lot these chains, has Andy Hornby for a CEO.  He was previously best known for presiding over the collapse of HBOS.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheChookOfChickenton",
            "body": "Standards and quality are dropping everywhere mainly due to the cost of doing business (rent/utilities/wages etc.) rising. \n\nMost companies are now cutting corners and staff wherever they can. Private equity is another factor.\n\nA prime example of enshittification is what's recently happened to TGI Friday's.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Advanced_Parfait_642",
            "body": "I normally only eat out in independants, but would occasionally go to a chain restaurant/pub in the past, mostly if someone else booked it. I have found the quality to never be great, but now most of them are inedible, using poor quality ingredients, and smaller portions.  This happened when they all opened up again after lockdown and got worse again, after the electricity costs went up.\n\nThe only chain restaurant I really liked did Tex/Mex style food.  The nachos used to be great, but then they made the portions smaller, and instead of proper guacamole, and cheese, substituted for squeezy cheese out of a tube and guac.  Stopped doing any sides on the meals, you now have to order them as an extra, the portions are now too small, I say this as a very slim person who does not expect a huge plate full.\n\nThe quality at most chains is terrible, and no better than buying a cheap frozen dinner from a discount supermarket.  I am a good cook, and will only go somewhere if they can cook as good as I can or better.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AnxiousCouch",
            "body": "Probably, big companies taking short cuts with getting in premade food and making ridiculous staff cuts. Less staff but longer hours, management taking on more responsibility for no extra pay etc. I've just left the hospitality industry after working as a manager for 10 years. I'm surprised half the stuff that happens within that line of work is even legal to be honest. \n\nMy advice would be to go to independent places and support them, big companies don't deserve it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Educational-Angle717",
            "body": "I still go but feel like both McDonalds and Burger King have dropped massively. You're now waiting forever for your food which takes out the 'fast' element and when it comes it's undercooked or wrong. Plus the cost has got higher.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ANUFC14",
            "body": "Only chains I’ll go to are wagas and turtle bay. \nWagas is really expensive but still tasty and I’ve never had a bad experience with turtle bay",
            "score": 1,
            "replies": []
        },
        {
            "author": "FizzbuzzAvabanana",
            "body": "Don't use em, stopped years ago. Local indie pub(s) or I save on all the meals out I would've had in this country & have a bloody good blow out on holiday abroad. Never go all inclusive, make it part of the holiday, just stop eating crap.",
            "score": 1,
            "replies": []
        },
        {
            "author": "kenwray",
            "body": "TGI's. You'd be better off just buying the food from Icelands",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jarv_",
            "body": "What a lot of people are saying here is true, but TGIF has always been pretty bad, so not a great example.\n\nIn short yes though, quality has/is going down, I think it's part of the greater inflation/CoL issues we have at the moment, as well as some companies simply profiteering.\n\n\nEDIT: Just needed to mention enshittification",
            "score": 1,
            "replies": []
        },
        {
            "author": "One-Cardiologist-462",
            "body": "Me and my friends used to like TGI fridays. But about 10 years ago, they changed the menus, and simplified their interior.   \nIt used to have NYC Cab doors, traffic lights, and other American inspired décor. Then they followed the trend of oversimplification and it was like eating in McDonalds. Such a let down. \n\nWe didn't go back after that.   \nShortly after, it was closed down, so I guess many others thought the same too.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Low-Cauliflower-5686",
            "body": "Noticed this too, Frankie and Benny's I'm surprised still exists. \n\nEven some of the small chains and local ones cut corners and have gone downhill.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FlaccidBrexit",
            "body": "There’s a great YouTube video by Bloomberg called “How Private Equity Ate Britain” which goes into this, highly recommend it",
            "score": 1,
            "replies": [
                {
                    "author": "Kaurblimey",
                    "body": "just commented this!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Forsaken-Ad5571",
            "body": "Food quality generally has dropped dramatically. I think it’s down to quality food getting more expensive and so places decide to get worse stuff to keep their profits. Restaurants are a bit off this but even supermarket food is getting worse. \n\nI have ARFID and a product of that is a relatively limited diet, which means you become an expert in the food you can eat. You know the texture and taste very well, and almost across the board everything is getting worse. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "cozywit",
            "body": "Nandos varies restaurant to restaurant fyi.\n\nSome are useless and rag the chicken. But some cool it well and it's worth the trip.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Less_Bookkeeper988",
            "body": "The only decent chain I have ever eaten in is Cote. The rest are shite.",
            "score": 1,
            "replies": []
        },
        {
            "author": "dinkidoo7693",
            "body": "TGIs hasn’t been decent since about 2015. They sell their stuff in iceland, same kinda quality loads cheaper.  \nNandos popularity has wained recently due to their price rises.  \nSince Covid costs for restaurants have gone up and people can’t afford to go out to eat as regularly. Lots of these restaurants are just microwaving stuff that they would’ve cooked to order before.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gamecatuk",
            "body": "Yes. Although I would never, ever go to Pizza Hut myself my kids like it. So we go occasionally. Compared to the 80s pizza hut is absolutely fucking vile. The pizzas taste like fake cardboard and the salad bar is full of old shit salad and nasty dips etc... The last pizza I had there was burnt and tasted like plastic had melted in it. In the 80s they had a lovely herby flavour and were loaded. \n\nI had a KFC 4 years ago. Again compared to the 70s the chicken was vile, greasy as fuck and the fries were absolutely pathetic. \n\nMc Donald's is the only fast food place barely keeping up to minimum standards but often get orders wrong. \n\nYes a lot of these places are shit and understaffed particularly Pizza Hut.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NafariousJabberWooki",
            "body": "Food cooked by kids getting minimum wage.    \nLast time I was in a spoons, years ago now, I was served a mixed grill with the pork chop raw on one side (the whole plate was only cooked on one side) and when I raised an issue was told it was served medium rare.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Geepandjagger",
            "body": "Has always been the case. Standardised microwavable crap has been common at these places for a long time it just wasn't as expensive as it is now. At least spoons doesn't claim to be anything it is not. The chains occupy expensive sites on the main streets and people seem to only just be waking up to the fact that literally anywhere else will be better.",
            "score": 1,
            "replies": []
        },
        {
            "author": "forcesensitivevulcan",
            "body": "....and nothing of value will be lost.",
            "score": 1,
            "replies": []
        },
        {
            "author": "EmFan1999",
            "body": "Yes. It’s all UPF food and you can really tell",
            "score": 1,
            "replies": []
        },
        {
            "author": "SingerFirm1090",
            "body": "I think all the names you mention are not chains, rather they are franchises, so whoever buys the franchise decides the quality. There is some central control, but not as much as you might think.\n\nSo you get good branches and poor ones.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Crommington",
            "body": "This is what happens when big chains monopolise markets. For the consumer it’s great for a while because they’re getting something very good for cheap, but once the chain has put all the competition out of business by taking a loss it has to recoup that money and it does it by raising prices and lowering standards because there’s now no competition.",
            "score": 1,
            "replies": []
        },
        {
            "author": "inspectorgadget9999",
            "body": "_gestures vaguely at everything_",
            "score": 1,
            "replies": []
        },
        {
            "author": "wizard_mitch",
            "body": "I think most of them have always been pretty crap but at least they were cheap, now they are crap and expensive.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheCannyLad",
            "body": "If TGI standards have dropped dramatically then it must be beyond awful by now as it was never good in the first place.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Former_Intern_8271",
            "body": "I hardly ever eat at restaurants anymore disappointing or very expensive. \n\nI particularly hate seeing options on the menu that say things like \"add extra chicken for £3\" you just know that's never what you'd consider \"extra\" for a home cooked meal. It's a signal \"don't expect much if you don't pay extra\".",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kaurblimey",
            "body": "This video sums it up nicely https://youtu.be/hIyl5SI6OL0?si=d2mL-3EYmCweup4X",
            "score": 1,
            "replies": []
        },
        {
            "author": "ImTalkingGibberish",
            "body": "Creating something everyone loves then scale to a point you can’t control quality, profit from the brand you had built and then close down all the shops",
            "score": 1,
            "replies": []
        },
        {
            "author": "FTHero",
            "body": "Thaikhun is the only exception.",
            "score": 1,
            "replies": []
        },
        {
            "author": "_Skin_Jim_",
            "body": "Nandos has always been shit and overpriced. Bland hot chicken with no real flavour.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mata_dan",
            "body": "I've always found all of them but wagamamas are mega bad, like just super inconsistent so they are totally meh. Waga is also meh but it's consistently done decently from my experience.  \nTheir business model is family day out convenience I think (and property speculation if only via shenanigens amongst shopping centre companies etc. that make spaces for them, that's gone awry for many), and people are having less of those and being rightfully a little more picky.\n\nI think half decent cooks and chefs have also got slightly more opportunities elsewhere now as the industry above this level has been able to demand a bit more pay and a slightly less bad working environment, correct me if I'm wrong as that could be a local factor.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cider-with-lousy",
            "body": "I believe that many, if not all, chain restaurants prepare dishes centrally at a single location. it's essentially cook chill food. That's fine if you're eating in a works canteen or staff restaurant. It's not fine if you're paying quite a lot of money in a restaurant. I recently ate at an  Indian chain and honestly I could have prepared that dish at home and it would have been far tastier. No wonder many people these days prefer to entertain at home.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mccobsta",
            "body": "Private equity firms have bought into a lot of them and possibly assets stripping",
            "score": 1,
            "replies": []
        },
        {
            "author": "adezlanderpalm69",
            "body": "Awful place.  Food is terrible",
            "score": 1,
            "replies": []
        },
        {
            "author": "HallPutrid397",
            "body": "Every restaurant just sells the same few variations of crap imo. How many smash burger places or burritos do we need? \nAlso 9/10 places are unhealthy af.\n\nOnly things i bother with are indian/chinese takeaway",
            "score": 1,
            "replies": []
        },
        {
            "author": "NoInvestment9829",
            "body": "£50ish for two sad ramen bowls and two apple juices at wagamama’s made me start learning how to make it at home. \nLast place on earth where I’m eating at is Slim Chickens (Ashford Shopping Centre) as they did not expand enough yet to start watering down their recipes and up the prices. The amount of choice for sauces they offer and give makes it almost feel illegal.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Top-Artist-3485",
            "body": "Nando, Wagamamas, Zizzis, TGIs, all can get in the bin. Overpriced, small portions.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Remote-Pool7787",
            "body": "TGI is teetering on the brink of going under, and have already closed a huge number of locations. The staff that are there will either be new and on temporary contracts, or will have been there for years and years and coasting along in hope of a half decent redundancy offer at some point.",
            "score": 1,
            "replies": []
        },
        {
            "author": "thecoop_",
            "body": "It’s been like this for years. Chain starts doing something a little different at a good price, quickly becomes the same as everything else and in the process losing what made it unique, prices go up, people stop going because it’s the same as everything else and too expensive for the quality, quality drops further, prices increase more, chain shuts (eventually).",
            "score": 1,
            "replies": []
        },
        {
            "author": "hypotheticalfroglet",
            "body": "Ever since Covid service nearly everywhere has deteriorated to 1970s levels, at least here in Britain.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Loxnaka",
            "body": "Tgis food quality has gone down massively past few years but Nando’s is still pretty good although prices have of course gone up, maybe you got unlucky.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Roylemail",
            "body": "Because EVERYTHING is cut to keep costs down and profits up",
            "score": 1,
            "replies": []
        },
        {
            "author": "pmoppy",
            "body": "Yep. The prices are shocking too. £17 for a pepperoni pizza at the Prezzo near me\n\nFor me they have essentially become the service stations of the restaurant world. Noone really heads out to them on purpose. But they pick up people when they are convenient. Like after a couple of hours wandering around a retail park.",
            "score": 1,
            "replies": []
        },
        {
            "author": "pmoppy",
            "body": "Yep. The prices are shocking too. £17 for a pepperoni pizza at the Prezzo near me\n\nFor me they have essentially become the service stations of the restaurant world. Noone really heads out to them on purpose. But they pick up people when they are convenient. Like after a couple of hours wandering around a retail park.",
            "score": 1,
            "replies": []
        },
        {
            "author": "LFTMRE",
            "body": "Standards always were low, the British public just has incredible tolerance for shit food, generally speaking. \n\nLet them die off, I'd prefer independent restaurants.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ClintonLewinsky",
            "body": "Went to Bella Italia a few weeks back.  It was bloody awful and £120 for 2 adults 3 kids.\n\nMorrisons ready meals were better",
            "score": 1,
            "replies": []
        },
        {
            "author": "AltruisticProgram141",
            "body": "My parents used to go to the TGI's next to the cinema in Aberdeen all the time, pre-lockdown. It was never really my thing, but it was hearty portions and decent enough in a kind of elevated junk food-ey way. We went again a few months after everything opened up and it was really bad; tiny menu, loads out of stock, and the prices had gone right up. The waitress just had to keep coming back and apologising for everything, I felt really bad for her. Oh and the meal was not good. My parents were almost hilariously irate to have been let down by their favourite chain. Now they always go to this independent Turkish place round the corner instead and they can't stop raving about it, so I'm pretty glad that this particular bad experience with a chain put them off enough to go a little off-piste (for them). Support your local non-chain restaurants! It's the only way!",
            "score": 1,
            "replies": []
        },
        {
            "author": "vijjer",
            "body": "> I know it’s in financial trouble and it’s easy to see why.\n\nGood riddance to bad rubbish.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mag-1892",
            "body": "Recently went to tgi for first time in years and it seems the menu has halved but the prices have doubled. I won’t be going back",
            "score": 1,
            "replies": []
        },
        {
            "author": "uselesstosser",
            "body": "Ever since the covid bullshit, chain restaurants are less than half as good as they were. The food is meh, the portions are smaller, the prices are bigger. Some of the little perks or ingredients that made them special are gone. They may as well just microwave crap from Bidfood. You are much better going to independent cafes and restaurants who actually care about the food.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BeeW84",
            "body": "Refuse to go to Nandos anymore, unclean restaurants, crap service and substandard meals for the price. Even worse if you order it for home delivery",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pink_Flash",
            "body": "That's just it. Standards are dropping everywhere.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CosmicBonobo",
            "body": "Went to a Harvester on Sunday. Friendly waitress, clean table, decent salad bar, quick service, food hot and well cooked. In and out in under an hour. Marvellous.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Aggravating_Ant6318",
            "body": "They've always been crap",
            "score": 1,
            "replies": []
        },
        {
            "author": "crapmetal",
            "body": "I thought tgi went bust.\n\nThey we're always crap you ust didn't notice till someone did it better nearby.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Infinity_Flounder",
            "body": "10+ year bartender here, worked a lot of bars and restaurants\ni've watched the fall of quality and standards like a slow car crash. \n\nthe answer is 100% yes\n\nWorking for Fridays when they lost their JD sauce was interesting",
            "score": 1,
            "replies": [
                {
                    "author": "thrrowaway4obreasons",
                    "body": "It seemed half their menu was made up from JD sauce. Was it a total meltdown?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "My_balls_touch_water",
            "body": "The standard of customer service in the UK is dropping drastically",
            "score": 1,
            "replies": []
        },
        {
            "author": "DannyBrownsDoritos",
            "body": "If you don't want crap food, don't eat at chains. Seems pretty simple to me.",
            "score": 1,
            "replies": []
        },
        {
            "author": "oPlayer2o",
            "body": "Assuming they had standards in the first place is bold, but yea they are definitely getting worse.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Puzzleheaded_Ant_265",
            "body": "TGI was rubbish for a long time! I went there for new years in 2019 and they served me plain pasta with no seasoning or toppings for around 10 quid .. I was shocked at how ridiculous it was for them to serve that, it must have cost them 10p to make 😡. I also swore to never to go back to TGI after that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Specialist-Cake-9919",
            "body": "Used to go to Frankie and Benny's in Mcr on the occasional Sunday before the cinema mid 90's...\n\nFood was delicious, pizzas huge and the pasta was lovely. It definitely was a cut above anywhere else for Italian food.\n\nThat actual restaurant has now shut and they've opened up on the retail park nr me and the food and overall experience isn't a patch on what it used to be.",
            "score": 1,
            "replies": []
        },
        {
            "author": "macrowe777",
            "body": "When you've achieved market saturation, which given the large amounts of generic shite chains is more than the case, the only way to increase profits is to lower standards and the product quality.\n\nThat is why, and in answer to the question \"are they\", the answer is absolutely yes. Standard drop practically immediately from launch window. Chains will typically have a separate team for launch, who offer a high standard, will win custom, and then they'll be switched out for the local team on minimum wage.\n\nIf you pay minimum wage, you get minimum effort, as it should be - speaking as a director of a business.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cinematic_novel",
            "body": "In my experience, it hasn't changed much overall, maybe slightly improved in some and slightly worsened in others. But there are a lot of chains that I never go to. TGI and Franky & Benny's are notoriously bad and I think both will close down within a few years",
            "score": 1,
            "replies": []
        },
        {
            "author": "BronnOP",
            "body": "Enshitification",
            "score": 1,
            "replies": []
        },
        {
            "author": "rmc1211",
            "body": "Chain restaurants have always been shite",
            "score": 1,
            "replies": []
        },
        {
            "author": "Caspera99",
            "body": "Yes. They’re scaled up at small margins that over the past 5 years have been battered by increases in energy costs, food costs and dwindling visitor numbers due to the rise in the cost of living for most. Add in next months national insurance rise and they’re fucked unless they increase prices or reduce costs (the easiest being food).\n\nAnd if you think that’s bad, imagine now owning an independent restaurant. How anyone is making money in restaurants is beyond me, but the small guy deserves your support or they’re gone, leaving us with whoever is left out of Chiquitos. Frankie & Bennies and Prezo",
            "score": 1,
            "replies": []
        },
        {
            "author": "itsheadfelloff",
            "body": "Yes they are and they can because so many people are ok with that level. Same reason why there's so many terrible chicken and kebab shops.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RedPlasticDog",
            "body": "Yes. \n\nSo many chains seem to have decided to slash any maintenance of the restaurant, cut staffing and quality of food and jack up prices. \n\nTo be fair TGI was gash a decade ago so can’t imagine it’s really changed.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DontTellHimPike1234",
            "body": "IMO, yes. Food quality standards have dropped in many of the larger chain restaurants, particularly those that are shareholder owned. \n\nThe drive to increase shareholder returns has led to cost cutting and industrialisation, which has led to a sort of standardised, industrialised food and a reduction in overall quality standards.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RealMrIncredible",
            "body": "We are in late-stage capitalism; every single company is being milked dry to line shareholder pockets. If not for modern globalisation, we'd already be in a Great Depression.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AcanthopterygiiSad51",
            "body": "It's not that they're more expensive and standards have dropped, it's called being poorer.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AcanthopterygiiSad51",
            "body": "It's not that they're more expensive and standards have dropped, it's called being poorer.\n\nYour pound is worth less and that affects everything.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Joinourclub",
            "body": "I don’t go to masses of chains, but I have noticed a deterioration in the quality of pizza express and Wagamamas over the years and I wouldn’t chose to go\nTo either any more, though I used to go fairly frequently when my kids were small. I’ve been to TGIs once and that was enough.",
            "score": 1,
            "replies": []
        },
        {
            "author": "cgknight1",
            "body": ">still expensive\n\n\nNandos? For a sit down meal in 2025 - no. \n\n\nIt's just that reddit users want lobster for jam butty money. ",
            "score": 0,
            "replies": [
                {
                    "author": "EstatePinguino",
                    "body": "You’re looking at almost £20 for a meal and a drink, in a place with Wetherspoons level of service (order at bar, pick up your own cutlery and condiments). \n\nIf not expensive, I’d consider it very poor value for money. You could go to plenty of great restaurants for that price, and receive proper service. ",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Tight_Cheesecake5247",
                    "body": "£30 platter for the mrs and I. £15 each for a meal is very cheap IMO",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Critical-Abroad-682",
            "body": "Nandos is consistently awful now. I mean it’s probably never been great but the price is increasing whilst the quality is decreasing rapidly. It’s awful.",
            "score": 1,
            "replies": []
        },
        {
            "author": "neverarriving",
            "body": "Yep, noticed this with Pizza Express (wouldn't go there myself but the kids love it), even in the last year the quality has noticeably dipped - last time we went the onion & peppers on my pizza had been chucked on cold rather than cooked & there was no discernable flavour to anything.\n\nGenerally in recent years with chains there's a noticeable lack of anyone front of house taking charge, the floor & the kitchen aren't talking to each other so starters & mains arrive together or get forgotten about etc, guessing that staff training is seen as an unnecessary expense.",
            "score": 0,
            "replies": [
                {
                    "author": "volunteerplumber",
                    "body": "I went for the first time in years a week ago and had the vegan pizza. It was amazing and the service was great too.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Outside_Yellow5002",
            "body": "Eating out is ALWAYS disapointing.\n\nPay a small fortune for a tiny portion of disgusting 'food' then come home and raid the fridge and cupboards fior something to eat.",
            "score": 0,
            "replies": []
        }
    ]
}