{
    "title": "Why do people buy branded painkillers?",
    "author": "Sideways_Underscore",
    "subreddit": "AskUK",
    "rank": 5,
    "score": 287,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 397,
    "url": "https://www.reddit.com/r/AskUK/comments/1je2e9k/why_do_people_buy_branded_painkillers/",
    "id": "1je2e9k",
    "selftext": "Other than going to a pharmacy and getting Paramol etc with Codeine OTC, why do people spend extra on Nurofen and other brands?\n\nThey are just paracetamol or ibuprofen sometimes with some caffeine if it’s ‘cold and flu’. A pack of standard painkillers is like 40p but I’m sure if seen Nurofen near a fiver.\n\nPlaudits to their marketing team, seems insane though.\n\n",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "**Please help keep AskUK welcoming!**\n\n- When repling to submission/post please **make genuine efforts to answer the question given**. Please no jokes, judgements,  etc.\n\n- **Don't be a dick** to each other. If getting heated, just block and move on.\n\n- This is a strictly **no-politics** subreddit!\n        \nPlease help us by reporting comments that break these rules.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskUK) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "ParkingMachine3534",
            "body": "Saved a fortune when I looked at the active ingredients of £6 Feminax and 99p ibuprofen lysene.\n\nThey're exactly the same.",
            "score": 277,
            "replies": [
                {
                    "author": "Blueberrym_",
                    "body": "I picked a pack up of feminax which is £6 or whatever, you can get those numbers on the back of the packet and someone once told me if two packs have the same numbers, they’re the exact same painkillers.\n\nI saw ibuprofen express which is £2.50 and feminax that is more expensive, looked at the codes and they’re both the same.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "ParkingMachine3534",
                            "body": "They all are.\n\nHome Bargains has some in a silver pack for about £1.70, but they also have some tucked away in a smaller white pack for cheaper.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "NeilDeWheel",
                            "body": "That’s right. It’s the ‘PL’ code that you look for.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Cyber_Connor",
                    "body": "The most effective part of most off-the-shelf painkillers is the placebo effect. If you think one is better than the other it probably is",
                    "score": 65,
                    "replies": [
                        {
                            "author": "ParkingMachine3534",
                            "body": "Well, the 99p one seems to work just as well for the wife and 2 daughters.\n\nThe price difference makes me feel all warm and fuzzy, so the cheaper one is 25% more effective as it makes 4 people happier.",
                            "score": 68,
                            "replies": [
                                {
                                    "author": "VOODOO285",
                                    "body": "Extra points if you buy 1 box of Feminax and put the cheap pills in the box and keep reusing it.\n\nPlacebo effect and cheap!",
                                    "score": 22,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "ooh_bit_of_bush",
                            "body": "The cheap ones are better because all their costs have gone into the production of the medicine and not on the marketing...... That's what I tell myself to make the placebo effect cheap.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Impressive-Chart-483",
                            "body": "Sometimes the branded ones come in a higher dose than the generic ones which can make them seem better, or include other things like decongestants etc (which do appear to be snakeoil).\n\nI do tend to go for the non-branded stuff, but it's worth comparing dosages. If you can only buy a pack at a time, that might be a reason not to, but you are paying over the odds for it.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Evil_Genius_1",
                    "body": "Feminax used to have codeine in it. But then people were taking it when they didn't need it. So they took the good stuff out. But you can still buy co-codamol over the counter - go figure.",
                    "score": 22,
                    "replies": [
                        {
                            "author": "phoebsmon",
                            "body": "It had codeine, paracetamol, an anti-spasmodic and I think caffeine. That was the really old one though, must be 15 years or so since it went off the market.\n\n\nSo if you want it, you just pop to the chemists, buy co-codamol and some Kwells (same thing as the old Feminax and magical). Take two co-codamol, ⅔ of a Kwells (admittedly awkward, I'm sure a full one is fine), sink a double espresso and you're golden. Bonus points if you can get a powernap in there somewhere. \n\n\nWhich all feels awfully like they just wanted to make things more awkward. I can't remember when they got the rights to sell naproxen OTC under their brand, but maybe that influenced the decision too.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Lox_Ox",
                            "body": "Anyone know if you can buy a cheaper/off-brand version of Paramol? (paracetamol + dihydrocodiene). Sadly codiene doesn't work for me.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "pencilrain99",
                            "body": "Co-codamol is just too addictive,  you end up taking them just for the endorphin hit of swallowing them as you get no buzz.",
                            "score": -2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "CurvePuzzleheaded361",
                    "body": "Feminax was changed about 12 years ago, used to be really good and has something different in. They removed that. Thats when the chemist told me to buy off brand painkillers as they were the same now.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "k-boots",
                    "body": "Came here to say the same thing! Saw a TikTok of some guy showing how these are the exact same product just in different packaging",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Potatusha",
                    "body": "I'm a guy but just commented the same thing basically, it's ridiculous the amount of people who don't read the ingredients or do 2 minutes research!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "jia_ryu",
                    "body": "Where do you get 99p ibuprofen with lysine? I’ve never seen it under £2.50ish so would love to know! ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ParkingMachine3534",
                            "body": "Home bargains.\n\nMay have gone up a bit now.\n\nThey have the Galpharm in a big silver Neurofen style box for less than £2 and one in a small white box that was 99p.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "jia_ryu",
                                    "body": "Thanks for the tip!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "anabsentfriend",
                    "body": "Where do you get 99p ibuprofen lysine? I buy generic supermarket versions (Suoerdrug, Morrissons, Sainsbury's) and haven't found it cheaper than £2.99 for 12.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "NeilDeWheel",
                    "body": "I was in Boots and saw a couple of women looking at Feminax and saying how expensive it was. I, after apologising for being a man listening to them, told them there is a cheaper alternative that works just the same. I then showed them the ‘PL’ number on the box and found them a cheaper product with the same number. Explaining if it has the same ‘PL’ number it has the same active ingredients. I then explained that Feminax is so expensive only because it’s marketed at women, for period pain. The markup on Feminax is criminal.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ParkingMachine3534",
                            "body": "The pink tax is real. \n\nSame with anything aimed at the elderly.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Next-Project-1450",
                    "body": "I used to work for the company that discovered Ibuprofen.\n\nWhile it was still on-patent, they charged the NHS a fortune (all intended to recoup the research costs and so on).\n\nWhen the patent expired, competing companies had their own products on the shelves almost next day. My company persisted in trying to argue its own product was superior. However, the unfortunate truth was that it was a terrible formulation - vastly over-complicated and problematic in the end product - and the competitor products were far better in almost all cases (I was responsible for testing them to try and produce evidence for the claims).\n\nBy 'better', I mean that ours often didn't disintegrate properly, whereas the competitor ones did. And ours would sometimes rupture or fall apart during processing due to the poor formulation.\n\nFor some/many years, the NHS continued to buy our branded stuff at the high prices.\n\nBut in the end, branding has a bigger overhead it has to cover, so it charges premium prices most of the time.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "WowSuchName21",
            "body": "I’ve heard Rory Sutherland (Marketing bloke) speak about this a few times, he cites research into this specifically but the gist is, it’s the combined power of marketing and placebo. \n\nPersonally, I used to buy Imodium, never questioned why I would always reach for it, looked at the ingredients next to the supermarket own brand (£1 vs £6 for 6 tablets) and outside the difference of Imodium dissolving on your tongue, they contain the same ingredients for doing what they are meant to. \n\nI guess I associated the dissolving as a feature I considered helped, be it subconsciously feeling the fizz reaction in my mouth or just finding them more convenient, I’d never stopped to ask if that worth the £5 difference? Not really.",
            "score": 95,
            "replies": [
                {
                    "author": "kenhutson",
                    "body": "If you’re vomiting while shitting yourself, and gastric absorption is therefore compromised, then sublingual absorption is beneficial so yeah probably worth the extra money in that situation.",
                    "score": 76,
                    "replies": [
                        {
                            "author": "superpandapear",
                            "body": "There's an off brand dissolving version too now",
                            "score": 18,
                            "replies": []
                        },
                        {
                            "author": "badgerfishnew",
                            "body": "I love the structure of this sentence. You start off with a vulgar description , swiftly glide into nuanced medical language, and finish it like a mate in the pub. 10/10 would read your biography on the train",
                            "score": 14,
                            "replies": [
                                {
                                    "author": "kenhutson",
                                    "body": "Fuckin’ ay. I too was appreciative of the juxtaposition of the gastroenterological lexicon with ostentatious scatological locution. Cheers mate.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "frankie_baby",
                                            "body": "Love the reply!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "WowSuchName21",
                            "body": "Very true, it’s still a great product, as somebody else mentioned they are also a lot smaller. Easier to discreetly carry, there are still “benefits” to Imodium, but my point is - from the perspective of their main purpose, they are identical.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Icy-Tear4613",
                            "body": "Is there a more scientific word for shitting yourself?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "JennyW93",
                                    "body": "I’m a clinical scientist: no",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "SecurityStock2170",
                                            "body": "Fecal / bowel incontinence ?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "JennyW93",
                                                    "body": "Sounds a lot like shitting yourself, doesn’t it?",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "TinyDemon000",
                    "body": "I prefer the convince of the sublingual Imodium, in that I don't need to carry a blister pack around with me but one single dissolvable tab. I still pay for the brand there but the ibuprofen etc yep, pointless.",
                    "score": 23,
                    "replies": [
                        {
                            "author": "WowSuchName21",
                            "body": "Ye, there are still benefits to it in that way. I can store a few of them in something as flat as my wallet, but my point it - the benefits to a lot of these branded things are limited.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ChocCherryCheesecake",
                    "body": "Immodium is the only one we _do_ stick to branded. Not because the active ingredients are any different but because all the locally available off brand alternatives contain lactose, so if you have milk intolerance induced diarrhoea they really don't help the situation!",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "ChickyChickyNugget",
                    "body": "What’s the non name brand of Imodium even called? When you have diarrhea you get “Imodium,” the other options don’t even register as a thing that exists - that’s their marketing, and that’s why people buy it",
                    "score": 4,
                    "replies": [
                        {
                            "author": "MattySingo37",
                            "body": "Loperamide Hydrochloride is the full name, just ask for Loperamide to fulfil your anti poo needs.",
                            "score": 16,
                            "replies": []
                        },
                        {
                            "author": "WowSuchName21",
                            "body": "The one I most recently bought was beautifully labelled “Anti-Diarrhoea Capsules”, catchy, right?",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Lavidius",
                    "body": "For anyone reading this down the line, the active ingredient in Imodium is Loperamide and most supermarkets have their own off brand versions",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Ngumo",
                    "body": "And you can buy supermarket versions that dissolve now too. Newmark make one that is widely available.",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "2xw",
                    "body": "You can buy them in bulk even cheaper on Amazon",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Adventurous_Week_698",
                    "body": "Immodium (loperamide) is actually a synthetic opiate which doesn't cross the blood brain barrier. Works on your gut the same way morphine does.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Dry-Magician1415",
                    "body": "But doesn’t the placebo effect go away the minute you have the real information? \n\nI mean, when they do a double blind trial for some new cancer drug - they don’t tell the 50% participants who are getting the sugar pill placebo “hey, btw so what’s really in it is….” . \n\nYou have to maintain the illusion it’s better medically than it really is so surely this effect only works on people too dumb to realise the branded and generic are the same.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "AuRon_The_Grey",
            "body": "Sometimes people do it for the format. E.g. soluble or chewable tablets that aren't available in generic.",
            "score": 84,
            "replies": [
                {
                    "author": "C0nnectionTerminat3d",
                    "body": "this is it for me. i buy the “fast acting” red nurofen capsules because i can’t swallow any other type of pill. Usually we’ll try to get own-brand but sometimes they’ll be out of stock or a shop won’t have their own brand of that type of pill.",
                    "score": 30,
                    "replies": [
                        {
                            "author": "Divewinds",
                            "body": "Just FYI, Tesco now do their own-brand version of the neurofen fast acting liquid capsules. Haven't seen an equivalent at any of my other local supermarkets though",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "maelie",
                    "body": "Also (although I'm in camp generic myself), some tablets definitely have a nicer coating and/or a different shape that makes taking them feel more comfortable.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "possumcounty",
                            "body": "Sugar coated ibuprofen is the best ibuprofen and I’ll die on that hill (with minimal inflammation). I’m so happy there’s a generic.",
                            "score": 4,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "50_61S-----165_97E",
                    "body": "Yeah a lot of chewable / under the tongue tablets will get the drugs into your system much faster than digesting a pill, so it's worth the extra money if you want fast relief.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Big_Mad_Al",
            "body": "the placebo effect is well documented",
            "score": 690,
            "replies": [
                {
                    "author": "RTB897",
                    "body": "Even when patients are aware that they are taking placebos, there is still a placebo effect. Just the act of taking something is enough to improve symptoms.",
                    "score": 22,
                    "replies": [
                        {
                            "author": "mattcannon2",
                            "body": "There is the secondary placebo effect of \"I have a £5 headache not a 49p headache\"",
                            "score": 23,
                            "replies": [
                                {
                                    "author": "RTB897",
                                    "body": "There have been studies done showing that the colour of a tablet influences its efficacy. A £5 headache treated with a red liquid capsule will be cured much quicker......\n\nThe flip side of placebo effect is that you also have plecobo adverse events. I work in clinical studies and even placebo study arms generate a huge number of reportable events.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Sideways_Underscore",
                    "body": "For sure. The ads are funny though too - “Nurofen targets the pain” - No it doesn’t, your brain does.",
                    "score": 208,
                    "replies": [
                        {
                            "author": "blahblahscience1",
                            "body": "How does your brain target the pain?",
                            "score": 42,
                            "replies": [
                                {
                                    "author": "Scarred_fish",
                                    "body": "Advert/packaging has told you \"this product is special, it will target your pain\".\n\nIt doesn't,  obviously,  but your brain thinks (if you are suggestive/stupid enough) that it can, so it works.\n\nThe trick, if you can call it that, is knowing the placebo effect and applying it yourself.",
                                    "score": 42,
                                    "replies": [
                                        {
                                            "author": "GreatBigBagOfNope",
                                            "body": "Placebo effect is wild\n\n- it works \n- it works even if you're told it's a placebo\n- how well it works actually correlates with the seriousness of the performance: for westerners, a sugar pill is more effective than a flavoured corn starch oral suspension, a saline injection is more effective than both, and an IV saline drip delivered in a hospital bed is more effective than all of them, even if the patient is informed. For non-westerners, local traditional medicines will also exhibit placebo effects\n- it also works in reverse, if someone tells you that a completely neutral intervention will hurt you or make you feel worse, you will feel it\n\nHowever, it is important to note that placebo is all about perception. No placebo will *solve* an issue like cancer or MND or arthritis, but it absolutely can help manage symptoms like pain on an acute basis.\n\nI think it's also related to the phenomenon that gymrats sometimes experience where they don't realise that their bar has extra weight on it and accidentally bench for reps 10lbs over their previous 1-rep max because they thought it was 20lbs under – the connection between the mind and the body is not omnipotent, but it is interesting, and it is quite potent in some areas.",
                                            "score": 71,
                                            "replies": [
                                                {
                                                    "author": "Hippopotamus_Critic",
                                                    "body": "Add to that:\n\n* Brand-name drugs work better than identical off-brand ones\n* Expensive drugs work better than cheap ones\n* Medicine works better if it tastes bad\n* Large pills work better than small ones of an equal dose\n* Certain colours of pills work better than others, even if their contents is identical",
                                                    "score": 1,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Scarred_fish",
                                                    "body": "I'm a huge believer and while it will never cure anything, it can definitely aid recovery.\n\nWhat I alluded to above was taught to me at school and has served me well through life. When you understand the effect is caused by your brain, you just have to train yourself to do it. There is no need for the physical act of taking a dummy pill or whatever.\n\nOnce you have that in your mental skillset, it is an incredibly powerful thing.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "UnpredictiveList",
                                                            "body": "Why is it more powerful if you’re so amazing you can do it yourself. It’s the same.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "Scarred_fish",
                                                                    "body": "Because you can target it any way yo want any time you want without needing fake pills or anything else.\n\nDoesn't make anyone amazing, it's just something I didn't know you could do until I was told.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "author": "UnpredictiveList",
                                                                            "body": "I don’t think this is the flex you think it is.",
                                                                            "score": -2,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "Scarred_fish",
                                                                                    "body": "I'm going to have to write this off as something I don't understand lol",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "author": "FlawlessC0wboy",
                                                            "body": "Placebo can, and does, cure ailments. Maybe not cancer, but it does relieve things like ulcers and IBS, even some cases of arthritis.",
                                                            "score": -2,
                                                            "replies": [
                                                                {
                                                                    "author": "ReySpacefighter",
                                                                    "body": "Still waiting on both of those to happen. Can't wait to see a sugar pill magically fix ulcers (which for mouth ulcers have a lifespan about as long as it takes your mouth to refresh its cells).",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "author": "FlawlessC0wboy",
                                                                            "body": "There are actually loads of studies into this. It’s pretty amazing because it’s a visible condition that we can see getting better under placebo \n\nhttps://bpspubs.onlinelibrary.wiley.com/doi/full/10.1046/j.1365-2125.1999.00094.x\n\nAnd here’s one for arthritis:\nhttps://pubmed.ncbi.nlm.nih.gov/31621561/",
                                                                            "score": 2,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "Responsible-Sail6878",
                                                    "body": "Does it work as a placebo if you make it and tell yourself it’s a placebo? Like if a friend I know makes pill for penis enlargement and tells himself its a placebo will it give me a huge dick?",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "GreatBigBagOfNope",
                                                            "body": "Does you having a large penis operate on perception? No. What it might do is help you last longer in bed if you're told you have been given last longer in bed pills. The whole point of placebo is it doesn't have physiological effects, it changes your perceptions. That's why it's good for things like low level pain, low level nausea, low level nervousness etc etc. Not even pretending to take you in for surgery will be able to give you an extra inch, only a physiologically... *impactful* thing like surgical intervention or losing a lot of weight can do that",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "V65Pilot",
                                                    "body": "I'm currently in a clinical trial. I was told going in that the medication would make me sick, and drowsy. I've been fine.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "GreatBigBagOfNope",
                                                            "body": "Works *on average, compared to a baseline of non-intervention. For a clinical trial, I wouldn't think about it too much at all before it's over, you don't want to ruin your data point if it's for a possibly really good medicine",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Jack_Kegan",
                                            "body": "I do not believe that it is if you are suggestive/ stupid enough.\n\nFor example, I remember they did placebo tests where they told subjects that what they were taking WAS the placebo and it still worked! \n\nSo I don’t think it’s indicative of being easily persuaded ",
                                            "score": 38,
                                            "replies": []
                                        },
                                        {
                                            "author": "blahblahscience1",
                                            "body": "You're right in that it doesn't target your leg specifically, essentially you get pain relief everywhere as it travels through your blood supply, you only notice where you used to have pain before.\n\nAgree that it is a placebo effect.",
                                            "score": 15,
                                            "replies": [
                                                {
                                                    "author": "sch80",
                                                    "body": "Relevant ibuprofen short. \n\nhttps://youtube.com/shorts/Fmdm0xpis1I?si=eSodKzIyhZu67YO0",
                                                    "score": 5,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "feetflatontheground",
                                                    "body": "Anti-inflammatories target the site of inflammation. Ibuprofen/Asprin/Naproxen are non-steroidal anti-inflammatory (NSAID) and so are somewhat targeted.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "blahblahscience1",
                                                            "body": "No. They affect the inflammation. But it is still distributed throughout your body by your blood stream and you see the effect only in the inflamed areas.\n\nTarget implies it gets swallowed, absorbed and then travels directly and only to the problem area. It doesnt.",
                                                            "score": 21,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Suspicious-Red-Fox",
                                            "body": "I guess that's why painkillers just don't work well for me? Because I've never really believed they work, and they don't",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "Numerous_Age_4455",
                                            "body": "Problem is, if you’re too aware of the placebo effect, painkillers (even getting into some of the stronger ones) become less effective",
                                            "score": 0,
                                            "replies": []
                                        },
                                        {
                                            "author": "sayleanenlarge",
                                            "body": "Hate to kick you off that high horse, but even when you're fully aware of the placebo, it still influences you.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Scarred_fish",
                                                    "body": "Um, that is exactly what I just said.\n\nBeing fully aware but still making the most of it is exactly what I was taught and my point.\n\nOnce you are aware and understand, you no longer need a \"dummy pill\" or anything else, just go with the placebo as if you had one.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "RugbyEdd",
                                    "body": "6-12X scope with built-in laser sight.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "jusfukoff",
                            "body": "The placebo effect has a measurable positive effect though, so it will work better than non branded if they believe so.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "BeeDry2896",
                            "body": "I assume you mean that a person is tricked into believing that a pain killer can somehow know where in your body is hurting & go directly to that site only. This is nonsense of course.\n\nI think that people buy the originator (more expensive)  brand for one of two reasons: \n\n- they don’t understand/believe that the generic brand  is just as effective \n\n- they like the snob value of paying more for the more expensive product",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "StopTheTrickle",
                    "body": "The youtube algorithm put a guy in front of me for a while saying its amplified by paying more for medication. \n\nHe spoke specifically of neurofen for women's period pains being more expensive, but the exact same chemical. And people reporting increased effects compared to regular neurofen \n\nFound it fascinating",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Evening-Tomatillo-47",
                    "body": "Exactly. Tesco stuff is fine if I have a 30p headache, but what if I have a £3 headache?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Basso_69",
                    "body": "Proven studies on painkillers are \"I've got a really bad headache so I want the expensive painkiller for it\"",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ElectricalActivity",
                    "body": "Doesn't this only work on people who literally think they're buying a better product though? If someone knows they're buying the same thing for more money does the placebo still work?",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Timely-Sea5743",
                    "body": "I like to call it stupidity",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Breaking-Dad-",
            "body": "My wife insists Cuprofen works better for her than anything else. When my wife has a headache I would rather she could take Cuprofen than me explain to her that the Galpharm ibuprofen I bought for 50p are the same.\n\nYou cannot underestimate the placebo effect. If she feels it works quicker, then it works quicker.",
            "score": 146,
            "replies": [
                {
                    "author": "Fluffy_Juggernaut_",
                    "body": "Ibuprofen is an interesting one. It has a chiral centre so, in most tablets, it exists as a racemic mixture. You have to wait for racimase enzymes to convert half of it into the active isomer. \n\nMore expensive ibuprofens (I don't know if this includes Cuprofen) sometimes separate the two so that your tablet has all of the active isomer and therefore acts more powerfully and quickly. *Some* brands of ibuprofen may work more quickly than generic brands",
                    "score": 37,
                    "replies": [
                        {
                            "author": "Infinite_Crow_3706",
                            "body": "Awesome, I was going to post about chirality but glad you got there first and without sounding like a know-it-all (I know I would have done)",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "Breaking-Dad-",
                            "body": "Thanks. That is interesting.",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "dismantlemars",
                            "body": "It looks like [Dexibuprofen](https://en.wikipedia.org/wiki/Dexibuprofen) (the active isomer) is a [prescription only medicine](https://www.medicines.org.uk/emc/product/14357/smpc) in the UK.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "pencilrain99",
                            "body": "Bog standard ibuprofen is fast acting anyway any difference would be negligible. Only injection or smoking it would be faster and smoking it tastes fucking horrible.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Unprounounceable",
                                    "body": "You've smoked ibuprofen?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "pencilrain99",
                                            "body": "Yeah used to experiment with loads of stuff to see if it gave you a buzz when I was young and stupid, top tip don't snort Paracetamol  it clumps up in your nose and burns like a bastard and putting blood pressure pills in a pipe and smoking them makes you shake.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "WastedSapience",
                    "body": "The really interesting thing about the placebo effect is that it still works even if you know it's a placebo.",
                    "score": 62,
                    "replies": [
                        {
                            "author": "Breaking-Dad-",
                            "body": "Yeah, it is very interesting.\n\nI guess this is why homeopathy works too (and praying), as long as you believe something is heling then it will help (to a degree). Certainly helps for pain.\n\nI read something about how swearing helps reduce pain after an injury too. Bang your thumb with a hammer? Swear until the pain recedes. Science baby!",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "newfor2023",
                                    "body": "I knew this however shouting fuck while assembling a furniture with children around didn't go down very well lol.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "ooh_bit_of_bush",
                                            "body": "Calling a hinge a prick makes them line up easier.",
                                            "score": 15,
                                            "replies": [
                                                {
                                                    "author": "newfor2023",
                                                    "body": "Doesn't work with email tho or id be done for the year.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "author": "krisminime",
                                    "body": "Sometimes praying is simply an act of meditation and it has the same curative effects.",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "Blueskiesbrowneyes",
                                    "body": "Years and years ago I remember reading about a boy who destroyed his brain tumour with a video game. I can't remember the full ins and outs and am probably going to scramble it but it was something like space invaders and blowing them up and he imagined it was his tumour and it actually worked on shrinking his tumour. Something like that. The power of the mind is impressive.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "vario_",
                    "body": "Is she definitely taking the same dose? My friend said the same but she didn't realize that Cuprofen was double strength and was still taking two of them.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Breaking-Dad-",
                            "body": "Ha ha, yes. I took two the first time though.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "DameKumquat",
                    "body": "I have to admit the bright pink Cuprofen 400mg do seem to work better than your typical 2x200mg ibuprofen, but my local chemist does it practically the same price if you buy in bulk over the counter, so I might as well.\n\nAlso no shop near me sells paracetamol or ibuprofen for under 55p any more - if you ask over the counter it's often cheaper that way.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "gaco79",
                    "body": "Placebo effect is stronger for higher priced medication too. We associate more expensive with better.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Coffchill",
                            "body": "What works better than 1 placebo tablet? 2 placebo tablets. [Research](https://www.sciencedirect.com/science/article/abs/pii/S0074774218300436) has shown that bigger placebo tablets or a placebo injection have a bigger perceived effect.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "GrandAsOwt",
                            "body": "There seems to be something about colour too. Red and yellow pills are seen as stimulants. Blue and green ones are tranquillisers.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Ecstatic_Food1982",
                                    "body": ">Blue and green ones are tranquillisers.\n\nI dunno, one particular blue pill can be seen as the opposite of a tranquiliser!",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "CurvePuzzleheaded361",
                    "body": "Yes the same for me. I know the liquid nurofen is the same as cheap liquid painkillers but it does work quicker for me. And with my pain i am happy to pay for that. Even though i know it is a placebo. Wild how the brain works!",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "roloem91",
                    "body": "You’re a good husband for prioritising her feeling better over being right",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Breaking-Dad-",
                            "body": "I’m a pragmatic husband",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "International-Ad5705",
            "body": "Some people think that branded products are better than generic, or that the more expensive brands  are better than cheaper. This is a good example. It's the same with baby formula. Some parents insist on buying an expensive brand like aptamil instead  of a cheaper brand like cow and gate or a supermarket brand even though all brands have to meet the same standard. They just think something is better because it costs more, and you can't tell them otherwise.",
            "score": 18,
            "replies": [
                {
                    "author": "DameKumquat",
                    "body": "Everyone wants to think they're doing the 'best' for their baby. I believe Calpol is the number one med where the most people buy it rather than the generic. Possibly because people buy it in emergencies when travelling or late at night from the petrol station, too.\n\nInfant paracetamol has the other advantage of being white so not staining clothes, and sometimes is free (pharmacists have begged me to sign here so I get it free and they can prove there's demand so the scheme continues for the parents who really need it).",
                    "score": 13,
                    "replies": [
                        {
                            "author": "bopeepsheep",
                            "body": "You can chuck Calpol in your basket at the supermarket, which helps a good deal if you're pressed for time. And you can send someone else out for it, which can be trickier with 'explaining where to find the pharmacy to Grandad who doesn't live here'. He can find Tesco or the non-dispensing Boots branch.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "teerbigear",
                                    "body": "Tbf Tesco and Boots do non-branded infant paracetamol right there on the shelf next to the calpol",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "MauritianOnAMission",
                                            "body": "Thank you so much! I never knew this, have been giving my daughter calpol for 2+ years now. Going to buy non-branded next time.",
                                            "score": 1,
                                            "replies": []
                                        },
                                        {
                                            "author": "bopeepsheep",
                                            "body": "Well, depends how big the store is, but yes, often an option.",
                                            "score": 0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "CherryLeafy101",
            "body": "I'll buy them if there's not a non-branded gel capsule version of ibuprofen available. I find the gel capsules get to work quicker.",
            "score": 16,
            "replies": []
        },
        {
            "author": "RTB897",
            "body": "Companies don't spend millions on marketing because they have a soft-spot for advertising executives, but because it works. \n\nhttps://www.bbc.co.uk/news/magazine-35091242",
            "score": 34,
            "replies": []
        },
        {
            "author": "blahblahscience1",
            "body": "They cant have different formulas or coatings that might make them easier to take, faster acting etc.\n\nIf the PL number is the same on different packets though, always get the cheapest. The PL number means they were make with the same ingredients, same coatings, probably same factory so will work exactly the same as each other.",
            "score": 22,
            "replies": []
        },
        {
            "author": "shutterswipe",
            "body": "Look for the PL code on the box. It's a unique code given to a particular drug made by a particular manufacturer. If you find the same PL code on 2 different boxes, it's the same medicine inside.",
            "score": 7,
            "replies": [
                {
                    "author": "Commercial-Repair301",
                    "body": "Isn't it just the active ingredient that's the same but the inactive ingredients can be different?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "hungryhippo53",
                            "body": "No, the PL number shows it's the exact same product. If its different PL numbers but both are \"200mg ibuprofen\", then that's the same active ingredients but the inactive could be different",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Phineas_Gagey",
                    "body": "Came here to see this.... Having a drug approved and passing all the relevant legislation is costly. Checking the code on the box in Lidl and Aldi will reveal it's EXACTLY the same as the branded ones sold next to it",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "8Ace8Ace",
            "body": "Drives me mad this. See also people buying the extra strength ibuprofen tablets. Each tablet is 400mg but apparently this is a completely different 400mg that you'd get from 2 x normal 200mg tablets.",
            "score": 8,
            "replies": [
                {
                    "author": "waftgray67",
                    "body": "Reminds me of the TV series Dope Sick. Great series about a real event in US history.",
                    "score": 4,
                    "replies": [
                        {
                            "author": "8Ace8Ace",
                            "body": "Dope Sick is some of the best TV in the last decade. It is astonishingly good.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "autobulb",
                    "body": "Are the pills the same size? For people that have difficulty swallowing pills it could be enough of a reason to choose them, especially if the price is the same or similar when comparing dosage.\n\nI would actually pay a little extra for smaller pills. Are the pills in the UK made bigger with fillers to deter people from swallowing a lot for suicide attempts? They seem awfully big for just 200mg of paracetamol. The last time I bought some in the US they were very small capsules that contained 500g and were not bigger than the ones here. I've also seen 1000mg ones which are not significantly larger, if at all.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "tinglybiscuits",
            "body": "I buy Nurofen because they make meltlets. I struggle with swallowing tablets and they are relatively pleasant. If I was able to find a cheap version I wouldn’t hesitate to buy it!",
            "score": 5,
            "replies": [
                {
                    "author": "Sideways_Underscore",
                    "body": "That’s fair enough, my friend when I was a teen couldn’t swallow even the tiniest tablet even with loads of liquid to wash it down. \n\nKept him off a lot of illegal drugs in hindsight 😂",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ill_Temporary_9509",
            "body": "It’s down to the placebo effect. I think it was Nurofen who got into trouble in Australia for selling pain meds that were “targeted” at certain conditions; period pain, migraines etc and marking up the prices on those meds even though they were the exact same as the regular ones. But the mad thing is, those ones work better for the thing their marketed for",
            "score": 10,
            "replies": [
                {
                    "author": "melinoya",
                    "body": "Neurofen is genuinely better than anything else imo. I get a lot of headaches and have some weird nerve stuff in my hands, Neurofen express is the only thing that completely makes it stop hurting. Anything else is only dulls it to varying degrees—including regular Neurofen. God knows what that’s about.\n\nI promise I don’t work for Neurofen lol, genuinely don’t know what I’d do if they went out of business.",
                    "score": -5,
                    "replies": [
                        {
                            "author": "el-destroya",
                            "body": "I doubt you are imagining it, the composition of the inactive ingredients and also the chirality - the physical shape - of the molecule of the active ingredient(s) can have significant impact. \n\nI don't know off hand whether neurofen express is ibuprofen or ibuprofen lysine but either way the concentration of S-ibuprofen will absolutely affect how quickly it works (bioavailability), cheaper/generic versions often use a racemic, or 50:50 split, of each type but only ~60% (iirc) of R-ibuprofen is converted into S-ibuprofen by the body and it's S-ibuprofen that has the anti-inflammatory effects. The ibuprofen lysine is a salt, largely this just means that it dissolves really well and whilst still chiral (has two ways of having a physical shape) because it's absorbed faster it's less noticeable if there's a mix. \n\nOn the other hand paracetamol doesn't have this physical property so all paracetamol is pretty much equivalent so any difference between producers is going to be about how well it dissolves.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "CherryLeafy101",
                                    "body": "Nurofen Express is ibuprofen sodium according to the packet I just grabbed out of my desk.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "el-destroya",
                                            "body": "Huh, I don't think I've ever had it but with it being a salt of ibuprofen I would reckon that it's similar to the lysine salt in terms of rate of absorption. I would imagine the ibuprofen sodium is probably a tad more effective/quicker to act if it's in a gel or liquid tab just based on what I know of delivery mechanisms.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "MrBiscuits16",
            "body": "I stopped buying branded medicine after I worked at a pharmacy for a few months at 16. We used to advise everyone to buy the cheaper alternative as it is exactly the same",
            "score": 5,
            "replies": []
        },
        {
            "author": "tmstms",
            "body": "1) The placebo effect is real for MANY things in medicine. and so is the sort of sceptical anti-placebo effect, if you like, where you don't \"believe in\" the unbranded and so it doesn't work.\n\n2) If X works in relieving pain, whether or not it has anything to do with the medication, or whether it is placebo, a lot of people will think that the extra cost of X is worth it.\n\n3) I have been brainwashed by the Anadin ads which say nothing works faster. I keep a few, and they do work instantly. It is because I am brain-washed, I'm sure, but as it works, I do not care.",
            "score": 6,
            "replies": [
                {
                    "author": "turtleship_2006",
                    "body": "I wonder how well the placebo works if you're aware if it  \n\nLike if I give you a boots painkiller and tell you it's a really fancy expensive one, and after it's done it's thing I tell you I got it from boots, would it still be as effective next time",
                    "score": 3,
                    "replies": [
                        {
                            "author": "tmstms",
                            "body": "Apparently it does!",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ApprehensiveChest662",
            "body": "Honestly most antihistamine is the same. I’m more surprised we don’t have things like nyquil tbh.",
            "score": 8,
            "replies": [
                {
                    "author": "Sideways_Underscore",
                    "body": "I got hay fever baaaad, and you’re right I just buy Boots own brand Loratadine lol, although I will admit the nasal sprays can be helpful.",
                    "score": 5,
                    "replies": [
                        {
                            "author": "VagueNostalgicRamble",
                            "body": "I buy online. 6 month supply of loratadine for about a fiver, and £15-ish on 2 months of fexofenadine for when it's at its peak during the summer.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "miniangelgirl",
                                    "body": "Please share details. I have it bad and also use these two.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "possumcounty",
                                            "body": "Savers has the cheapest I’ve seen!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "knotatwist",
                            "body": "Home bargains/b&m usually stock galpharm branded antihistamines ( Loratidine or Cetirizine) which I've always found cheaper than boots/superdrug/supermarket own brands by the way!",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Crayons42",
            "body": "I never buy the branded versions, but wonder if people somehow feel reassured by a well known brand name, and maybe erroneously think the product is “better” than the cheap generic versions?",
            "score": 4,
            "replies": [
                {
                    "author": "carcassonne27",
                    "body": "That’s interesting actually, because while I always buy the supermarket-brand painkillers for myself, it would never occur to me to buy anything other than branded Calpol for my children. I think in my mind I have it down as the one that works the best, even though I’ve done no research into it.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "MadWifeUK",
                    "body": "The fact is that the brand name products do work better, but only if the patient knows (or thinks) it's the brand name and not the generic version.  Because they believe the brand name will work better it actually does for them.  If you give them the brand name and tell them it's the generic version then it doesn't work as well.\n\nIt's such a fascinating thing about how the mind works and how strong the power of suggestion is, even if you feel you don't give in to it.  \n\nWe are weird little creatures.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "ByEthanFox",
                    "body": "I had always been told that it had to do with quality-control; like, if a 40p painkiller says it has 40mg of an active ingredient, it means it has *up to* 40mg and could have less, and that might mean you end up taking 2 tablets where the QC was poor and it's not so effective... Whereas branded ones have better QC.\n\nTo be clear, though, I never believed this. Like... I believed it's probably true but I always felt that the variance between the cheap and branded pills is actually pretty small.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Raneynickel4",
                            "body": "I work in pharma (in drug development specifically) and what you've been told about the QC thing is so wrong it hurts my soul lol. If products were that variable in quality, that would literally shut down companies and make headline news. i mean, when we file an application to sell new medicines, we have to ensure that the purity is very high (generally >99%) and we need to explain what impurities make up the 1% and justify that the levels present are safe for humans. For specific nasties like nitrosamines, we have to ensure that there is no more than 0.000001 gram per dose (value depends on the nitrosamine itself as some more potent so may need to be controlled to a lower level). \n\nThe health authorities do NOT fuck around at all when it comes to quality. My industry is very complex but it is a bit concerning how misinformation like that circulates in the general public...",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "8Ace8Ace",
                                    "body": "Thanks for the detailed reply. I have pharma experience too and the misinformation you note is just everywhere. See also such bollocks as \"they have a cure for cancer (all of them apparently) but they don't want people to know\"",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "gyroda",
                            "body": "When it comes to medication I think the regulations are pretty stringent",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "JumpyJustice",
            "body": "Because they have better marketing team",
            "score": 5,
            "replies": []
        },
        {
            "author": "JoeDaStudd",
            "body": "I can't swallow pills so if I want something on the go the only offering is branded meltlets or off brand dissolvable and a bottle of water.\\\nThe branded are expensive but still cheaper once you factor in a bottle of water.",
            "score": 16,
            "replies": [
                {
                    "author": "expectantpatronus",
                    "body": "Exactly the same for me.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Mrs_B-",
                    "body": "Is there any alternative to calpol meltlets? My teenager can't swallow pills either. She has regular pain due to a lifelong medical condition and it's not practical to have soluble paracetamol in school. Costing me a fortune.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "CheekyYoghurts",
                    "body": "You can swallow food but not pills? 🫤\n\nSurely the gulps of food are significantly larger than the pills.",
                    "score": -21,
                    "replies": [
                        {
                            "author": "ImTooHigh95",
                            "body": "A lot of people struggle to swallow pills and can still eat food. Get your head out of your ass😂",
                            "score": 21,
                            "replies": [
                                {
                                    "author": "CheekyYoghurts",
                                    "body": "What a bizarre response to my comment.\n\nYou're also making no effort to address the reason why, so my original comment still stands.",
                                    "score": -11,
                                    "replies": [
                                        {
                                            "author": "Mikon_Youji",
                                            "body": "Some people just struggle to swallow pills. There's not always a clear reason why.",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "txteva",
                                            "body": "Some people can chug water/shots and others can't, but most people can swallow liquids. \n\nAlso, if you have a genuine question then don't make sarcastic comments about it. It's a very frustrating issue to have and frankly an expensive one too. \n\nIf I try and swallow a pill (or a smartie for that matter) whole then I'd end up gagging.\n\nA lot of pills are not designed to be chewed then swallowed so the meltlet style (oral dispersible) are needed.",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "ldn-ldn",
                            "body": "Pills are very hard with sharp edges. Swallowing them is hard for me to. I usually just chew them.",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "ProfessorChaos213",
                                    "body": "You chew paracetamol?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "WilkoCEO",
                                            "body": "You can get chewable pills - I think they're more guided towards children and the elderly who may have difficulty swallowing, but no reason an adult can't",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "ProfessorChaos213",
                                                    "body": "This person is suggesting they chew pills that are meant to be swallowed not that they take chewable childrens paracetamol",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "WilkoCEO",
                                                            "body": "Oh...gross",
                                                            "score": 2,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "FynFord",
                                            "body": "Not really chew. I have a serious mental block on swallowing pills. It's easier to trick my brain by breaking the pill into two or three pieces with my incisors. Don't use the molars because that just pulverises them, and then I have the entire ibuprofen stuck to my molars. Then my brain is happy that I'm consuming a safe material and lets me swallow, rather than panicking that I'm trying to ingest a scary solid inedible object.",
                                            "score": 5,
                                            "replies": []
                                        },
                                        {
                                            "author": "ldn-ldn",
                                            "body": "Yeah, why not?",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "newfor2023",
                                                    "body": "The counterindication would be that if its designed to be swallowed whole then uptake would be faster than expected. Whether this is actually a problem or not would depend on the particular medicine. \nThere are some long lasting tablets that are designed to be absorbed over 24 hours instead of having to take multiple short lasting tablets. If this is a strong painkiller or something with CNS effects for example this could have some problematic results",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "ldn-ldn",
                                                            "body": "Neither aspirin nor paracetamol are such pills.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "newfor2023",
                                                                    "body": "And many other things are. What's your point.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "ldn-ldn",
                                                                            "body": "What's YOUR point?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "author": "newfor2023",
                                                                                    "body": "You asked a question. I answered.",
                                                                                    "score": 1,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "author": "ProfessorChaos213",
                                                    "body": "Because it's nasty as fuck, they are not meant to be chewed and they taste absolutely revolting, like pure chemicals, you're doing it wrong",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "ldn-ldn",
                                                            "body": "They taste fine. Aspirin is quite tasty.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "txteva",
                            "body": "It's very different to swallow pills whole compared to tablets.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "InquisitorVawn",
                            "body": "I significantly struggle to swallow capsules, sometimes to the point where I actually can't swallow them at all, and I also struggle with pills depending on the size and shape. If I'm properly ill, I can't swallow medication full stop and have to be put on IV medication, or at the very least dissolvable/liquid formulations. Regardless of how well I'm able to eat food, for some reason medication causes issues with me and has for my entire life.\n\nFor some people, trying to take medication - even with water - can trigger [globus](https://www.nhsinform.scot/illnesses-and-conditions/ears-nose-and-throat/feeling-of-something-in-your-throat-globus/). No matter how much you drink and try to wash it down, there's a constant sensation of something stuck in your throat for *hours*. Why this happens? Doctors aren't sure. They *think* the root cause is psychological, but it's not a very well understood thing. For some people, trying to bypass the chewing instinct and swallowing the item whole can cause it. For others, they have no idea.\n\n[Dysphagia](https://www.nhs.uk/conditions/swallowing-problems-dysphagia/) can happen for a lot of reasons. Some psychological. Some caused by other conditions like GERD, ADHD or Autism, cancer, or some medications.\n\nMost pills are a pretty different texture than a mouthful of food that you've spent time chewing and tasting. Many medications also have a disagreeable taste, designed to stop children from eating them like lollies, but this can also have a psychological impact on adults as well.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Zealousideal-Cap-383",
                    "body": "Just how much are you paying for a bottle of water!!!",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "jugsmacguyver",
            "body": "I have pain issues and use ibuprofen regularly. Sometimes I've had to buy the branded stuff in a pinch. The bog standard ones. No difference at all. Does what it says on the tin.\n\nThen you have the long lasting slow release neurofen which I find is better for back pain so when I need it, I'll pay the extra. \n\nIbuprofen lysine works faster if that's what you need. Generics are available but still pricier than the cheap stuff.\n\nBut for daily use I pick up the cheap ones when I see them and just use those. I couldn't afford to use neurofen every day!",
            "score": 3,
            "replies": []
        },
        {
            "author": "Own-Lecture251",
            "body": "I never do, I get the cheapest. Also, if I understand right, they have to have the same (at least active) ingredients by law.",
            "score": 3,
            "replies": []
        },
        {
            "author": "RaspberryJammm",
            "body": "I find the liquid capsule ibuprofen doesn't damage my stomach as much as the regular ones. So I end up often buying nurofen because unbranded liquid capsules can be hard to find (although sometimes Tesco stock them) \n\nDoes mean I'm paying 10X more than cheap tablets but it's worth it to not be woken up at 4am feeling like my stomach is on fire",
            "score": 3,
            "replies": [
                {
                    "author": "random_banana_bloke",
                    "body": "just fyi lidl sell the liquid ones, i prefer these and they are cheap in lidl!",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "newfor2023",
                    "body": "If this is a very regular thing it might be worth checking with your gp about a proton pump inhibitor to help reduce the chance of stomach ulcers. I was on a strong anti inflammatory and it took me mentioning it for them to then provide this. Which apparently should have been from the beginning.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "RaspberryJammm",
                            "body": "Thank you. I'm already on two medications to limit stomach acid. My body is just silly. I'm not allowed Naproxen anymore 😮‍💨",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "newfor2023",
                                    "body": "Naproxen that's the one they gave me, couldn't remember it at all. 2 years i had its fine to take every day then the next doctor saying 2 weeks only. Then I was on a back pain forum and many people were having omeprazole too so I asked and tada oh yes we should have given you this before..... \n\nSO has now been banned from all NSAIDs so can't even have ibuprofen. That's no fun with peri starting.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Possiblyreef",
                            "body": "Or just get a prescription for Omeperazole, that's literally it's job. \n\nYou can even buy it OTC it's just expensive, much more sensible to get a ton of it on prescription",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "newfor2023",
                                    "body": "Yeh that's what I got. It did take me mentioning it for them to actually do anything tho. Despite multiple doctors giving me conflicting advice on the NSAID I was taking. Don't do more than two weeks, yes it's fine to take indefinitely etc is not helpful and if you aren't informed and just buying loads of ibuprofen OTC then it can cause issues.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "8Ace8Ace",
                    "body": "The liquid ones are more easily absorbed but still have the same impact on your stomach. Ibuprofen works by inhibiting prostaglandin synthesis, and prostaglandins (amongst other things) help your gastric wall to produce mucus. This mucus stops the acid dissolving the stomach wall, so having less of it can lead to an ulcer.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "jemmary",
                    "body": "Are you taking them with food? Because you really need to be, no matter what format they're in. If you're waking up feeling like this it could be because you've already given yourself a stomach ulcer",
                    "score": 1,
                    "replies": [
                        {
                            "author": "RaspberryJammm",
                            "body": "Yes I do take them with food, thank you for pointing that out though. They should really tell you on the packet to do so it's ridiculous. I didn't find out until my mid 20s and my parents still don't believe me you should have them with food. \nI've stopped taking ibuprofen at the moment which is a bummer because I have chronic pain.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "mattamz",
            "body": "The more expensive ones taste better and have a better texture in your mouth i would say that's worth the extra money though.",
            "score": 3,
            "replies": []
        },
        {
            "author": "ceb1995",
            "body": "Used to work in pharmacy, there's studies into placebo effect to the point that even colour makes a difference so there d be patients you d have to do detective work for to find a certain colour for their prescriptions even though it's the exact same thing.",
            "score": 3,
            "replies": [
                {
                    "author": "newfor2023",
                    "body": "Yeh saw the same for method of application. Injections of a placebo being more effective than a pill for example.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "North-Village3968",
                    "body": "Blue pills work better for sleep, red pills work better for pain, regardless of the active ingredients",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "becomingShay",
            "body": "It’s not that I think cheaper brands are less effective or that they don’t do the same job. \n\nHonest answer is, sometimes I can be anxious about taking medication. So I go for the option I know, rather than an unknown. It’s not a placebo effect in that I don’t believe it works better. I just would rather my anxious brain not pull itself apart and scream at me for 4 hours until the painkillers wear off. About how we don’t know this particular brand etc. \n\nI have really severe ocd. Mostly it’s well controlled. But when I’m ill I don’t always have the energy to maintain all my mental health and I’d rather just take a known brand. Rather than risk setting off my anxiety or ocd for the difference in price.",
            "score": 3,
            "replies": []
        },
        {
            "author": "twopeasandapear",
            "body": "I've worked in pharmacy since 2016 and it's just a simple thing of marketing and people swearing by certain brands that work for them. I try my best to promote the cheaper brands and say constantly \"it's the exact same thing, just cheaper\", but alas, they don't want it.",
            "score": 3,
            "replies": []
        },
        {
            "author": "kelleehh",
            "body": "Most are exactly the same. You’re paying for the fancy colourful packaging a lot of the time.",
            "score": 7,
            "replies": []
        },
        {
            "author": "StereotypicallBarbie",
            "body": "Home bargains for the ibuprofen and lysine.. £1.49\n\nAnd that’s because it’s 342mg in a tablet instead of the standard 200mg. \n\nI popped to my local nisa for painkillers recently… £4.69 for nurofen! And I had to buy them because that’s all they had! Even 16 standard paracetamol that are 99p in most places was over £3!",
            "score": 5,
            "replies": [
                {
                    "author": "8Ace8Ace",
                    "body": "342mg of Ibuprofen Lysine gives exactly the same dose of Ibuprofen as a 200mg tablet of generic Tesco / Asda Ibuprofen\n\nThe Lysine (an amino acid) is bonded to the Ibuprofen and helps it dissolve / get absorbed more quickly, but it's only the ibuprofen that reduces pain.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "StereotypicallBarbie",
                            "body": "Well “absorbed more quickly” has me sold on the extra 49p",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "8Ace8Ace",
                                    "body": "Yes, absolutely. I wasn't trying to seem like you were wrong for buying it, more to just be aware of the dose. If you normally take 2 x 342mg Ibuprofen lysine but can only get the standard tablets, then trying to get an equivalent dose (684mg) by taking 3-4 normal tablets would be too much.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Available_Remove452",
            "body": "The power of advertising.  \n\nhttps://youtu.be/9h9wStdPkQY?si=_z22v8Ihqk7AVZZn",
            "score": 2,
            "replies": []
        },
        {
            "author": "Disgruntled__Goat",
            "body": "Totally agree. I get migraines and the only thing that stops them is ibuprofen. I used to get Neurofen thinking it was better but when I saw the standard supermarket ibuprofen is only 40p, I got those and they work exactly the same. ",
            "score": 2,
            "replies": []
        },
        {
            "author": "HeverAfter",
            "body": "Wife is a pharmacist.  Plenty of people state they can ONLY take branded medication when she knows full well that most generic is the same. Just gives the people what they want. If they choose to spend more money then that's on them.",
            "score": 2,
            "replies": []
        },
        {
            "author": "New_Expectations5808",
            "body": "Why do people buy branded anything? Because they're suckers.",
            "score": 2,
            "replies": []
        },
        {
            "author": "BigDumbGreenMong",
            "body": "Same reason people buy branded anything - if you don't have specific knowledge of the product category, a recognisable brand is your shortcut to choosing a good quality item. \n\nSometimes it's useful - don't know much about cars, TVs, lawnmowers, whatever, and don't want to research? Pick a popular brand you can afford, and it'll probably be decent. \n\nAs for painkillers - a lot of people don't realise that the supermarket own-brands are IDENTICAL in every meaningful way to the more expensive branded ones. Just take a quick look at the active ingredients to see what you're actually buying. You're not getting better quality by paying extra.",
            "score": 2,
            "replies": []
        },
        {
            "author": "el-destroya",
            "body": "There can be genuine reasons to buy branded painkillers, the placebo effect is not nothing for one and by far the most common reason I've seen here but there's also interesting chemistry at play, especially with ibuprofen formulations. \n\nWhether a given painkiller has either ibuprofen or ibuprofen lysine in it the concentration of S-ibuprofen will absolutely affect how quickly it works (bioavailability), cheaper/generic versions often use a racemic, or 50:50 split, of each type but only ~60% (iirc) of R-ibuprofen is converted into S-ibuprofen by the body and it's S-ibuprofen that has the anti-inflammatory effects. The ibuprofen lysine is a salt, largely this just means that it dissolves really well and whilst still chiral (has two ways of having a physical shape) because it's absorbed faster it's less noticeable if there's a mix. \n\nOn the other hand paracetamol doesn't have this physical property so all paracetamol is pretty much equivalent so any difference between producers is going to be about how well it dissolves. Same for naproxen and aspirin, though with aspirin some folks prefer to buy ones with gastro resistant coatings to minimise stomach irritation and different manufacturers will work better for different people. \n\nDisclaimer: I'm not a pharmacist but I did study organic chemistry at uni. If you have any particular health concerns around GI issues please ask a pharmacist which they'd recommend with your specific physiology, they do know a lot about these things (infinitely more than most doctors).",
            "score": 2,
            "replies": []
        },
        {
            "author": "AndrexOxybox",
            "body": "Higher quality molecules.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Stuspawton",
            "body": "I buy anadin extra, just to save the hassle of buying two packs of paracetamol plus and a second transaction of two packs of aspirin 300mg. It also means I’m only taking two pills instead of 4, which is infinitely easier if I have a migraine",
            "score": 2,
            "replies": []
        },
        {
            "author": "Marble-Boy",
            "body": "Some people might have an adverse reaction to the inactive ingredients in cheaper paracetamol.",
            "score": 2,
            "replies": []
        },
        {
            "author": "CoatDelicious9289",
            "body": "I love the sugar coating on nurofen compared to other non branded options 😃",
            "score": 2,
            "replies": []
        },
        {
            "author": "__globalcitizen__",
            "body": "Always ask for generics\n\nSigned,\n\nSomeone who works in pharmaceutical manufacturing",
            "score": 2,
            "replies": []
        },
        {
            "author": "zonked282",
            "body": "It's just knowledge, untill people know that a pack of 29p Asda ibuprofen has exactly the same ingredients as a pack of nerofen that is 10x more expensive than you would rightfully assume that it's justifying that price somehow",
            "score": 5,
            "replies": []
        },
        {
            "author": "rev-fr-john",
            "body": "Because people are stupid, the fact that the stupidity is well documented and explained doesn't make it less stupid, the opposite is more likely.  a recent example of this is via my wife's mother (yes I know, Ironically I'm in denial about that) she was prescribed a version of omeprazole with an extra but important in her case ingredient, but because she's an expert in all things fucking retarded she didn't take it and instead bought something like rennies indigestion tablets \"because they're better than the cheap stuff from the doctor \" obviously the cheap stuff is free so clearly not worth having.\n\n\nWithin a few weeks she's in hospital with ~~serious issues and almost dead~~ breathing difficulties  so we have to rush up there in case we miss the last pointless breath she consumes (don't judge me here, this woman has been at deaths door almost every week for 30 years there's not a disease she hasn't had yet made a full recovery brought about by expensive remedies from various crackpots at markets) on our arrival at the hospital it does in fact look quite serious,  I gather intel from various family members,  then read her notes, the mention of burned lungs tells me everything I need to know,  so I wander off to find a nurse and explain the situation regarding rennies and how I don't need him to part with any information this is a one way conversation,  he rings for a doctor to come and talk to me who then gets a consultant in on the conversation I explain everything I've seen and about the various conversations I've had with her and they all look horrified,  they changed the drug administration system and she recovered within a week,  unfortunately in that week she'd constantly adjust the oxygen so that she'd be addicted to the high content on leaving, this meant taking oxygen bottles home and having a backpack with oxygen kit in it, as it was heavy it never got used once she was home, but she'd show it to everyone that visited.",
            "score": 3,
            "replies": []
        },
        {
            "author": "QueefInMyKisser",
            "body": "Still working my way through a bottle of 1000 ibuprofen tablets I bought at a branch of CVS in California in early 2020 for $26. Couldn’t be arsed getting them 16 at a time any more.\n\nThey’ve technically expired now but I don’t think they really go off, maybe lose a tiny bit of potency but not that I’ve noticed.",
            "score": 2,
            "replies": []
        },
        {
            "author": "BastardsCryinInnit",
            "body": "Some do work quicker, they wouldn't be able to claim fast acting if there wasn't some truth it it, but ultimately it's like everything - some people don't baulk at spending £5 on painkillers. \n\nValue is different to everyone. Why do some people drive a £5000 Fiesta and others have a £60,000 Mercedes? They both get you from A to B, etc.\n\nSome people... Just have enough money that they don't have to watch pennies over something like painkillers.",
            "score": 2,
            "replies": [
                {
                    "author": "slimboyslim9",
                    "body": "The car analogy isn’t really fair. A 60k Merc will have a lot of nicer luxury features for a more comfortable ride than the Fiesta and you can also sell it on within a few years for some of your outlay.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "bumbleb33-",
                    "body": "That's also a marketing ploy. Yes they're fast acting(not a lie)but generic of same formulation is *just* as fast acting as brand name. Ibuprofen vs Ibuprofen lysine is one example; they're not technically lying but they've certainly not got an edge over the exact same generic formula. That's why they can't claim fast*er* acting than the generics. That would need to be provable and they'd likely be reported for false advertising.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Consistent-Towel5763",
                            "body": "it's usually the delivery mechanism rather than the drugs itself that is the fast acting bit.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "FunPie4305",
            "body": "The really cheap ones are uncoated so they are harder to swallow, and taste god fucking awful if you don't manage to do it right quick in a hurry.",
            "score": 1,
            "replies": [
                {
                    "author": "Kiss_It_Goodbyeee",
                    "body": "This. Uncoated paracetamol repeats on me for hours.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "WarpedInGrey",
            "body": "I don't, but I have noticed they can be easier to swallow sometimes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "tallbutshy",
            "body": "Some branded medications have a different coating on the pill compared to generics that make them easier to swallow.",
            "score": 1,
            "replies": []
        },
        {
            "author": "saanij",
            "body": "I was taking a cheaper one until this time I felt they weren't relieving. I switched to a mid range ones (still not the branded) that I had bought during a travel and that one actually relieved, on the same dose. I would still go for a cheaper pack of paracetamol but will have the other one in spare as well.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Puzzleheaded-Yak9722",
            "body": "Sometimes I buy branded pills because I find it hard to swallow. I hate that the cheap paracetamol pills dissolve in my mouth too quickly, then I can taste them. They tend to be better shaped and easier to swallow too. \nIt’s definitely a small luxury. But if I’m in pain or sick, I’d like taking pills to be a smoother experience",
            "score": 1,
            "replies": []
        },
        {
            "author": "Whulad",
            "body": "It’s beyond me",
            "score": 1,
            "replies": []
        },
        {
            "author": "Realistic_Welcome213",
            "body": "Trust is important in healthcare and people would rather pay more for a trusted well-known brand. Paying a 10x markup for the same thing is also very stupid though (sorry).",
            "score": 1,
            "replies": []
        },
        {
            "author": "Blackintosh",
            "body": "I like the way anadin extra tablets slide down my throat easily.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Milky_Finger",
            "body": "I bought it because they had ran out of their store brand ones. People know that they are the same so they sell faster.",
            "score": 1,
            "replies": []
        },
        {
            "author": "trustmeimabuilder",
            "body": "The only time I buy branded ones is if I get them from my local shop, sometimes you need them there and then, without the hassle of going into town, and you get whatever is available.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CrispoClumbo",
            "body": "I dunno but alka seltzer is all I buy, because it works faster for me than anything else. I always assumed it was because the fizzing meant I was inhaling some of it. Maybe it’s placebo, but I suppose it’s irrelevant if it’s works. ",
            "score": 1,
            "replies": [
                {
                    "author": "NaniFarRoad",
                    "body": "Once you've got used to the effervescent/soluble tabs (big tabs in a sachet, typically 25-30p a tablet), you can't go back. Add a tab to a glass of hot vimto and you get placebo+, as well! \n\nThey do come in generic forms at 15-17p a tablet, but they are often sold out...\n\nI used to have to go through a pack of solubles every month, but then found out I had fibroids. Once they were treated (surgically removed), I have barely needed painkillers. The last pack we bought expired, iirc.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "sylvestris1",
            "body": "Because people don’t have the sense to read ingredients. Or the knowledge to understand that the ibuprofen in nurofen is exactly the same as the generic ibuprofen. Or they’ve fallen for the marketing and trust the brand they know.\nHousehold cleaning products are exactly the same. Eg the active ingredient in zoflora or dettol surface cleaner is bezalkonium chloride. Exactly the same as the £1, concentrated, cheaper brands that make several litres. But people pay a huge markup, relatively, for the branded product.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MYCIAEL",
            "body": "I believe it's true that most brand and generic drugs are the same but I've read that sometimes there's exceptions like Adderall XR, which is better than the generic version.\n\nThere's a book called Bottle of Lies that talks about this, it warned about the dangers of moving generic drug manufacturer companies offshore to places like Brazil, India and China, where regulations are laxer.",
            "score": 1,
            "replies": []
        },
        {
            "author": "quixoticduck",
            "body": "I can't find unbranded dissolvable ibuprofen :( I didn't buy branded back when I could swallow pills",
            "score": 1,
            "replies": []
        },
        {
            "author": "Slow_Channel_2028",
            "body": "Only time I’ve done this is when they’re the only option available. Usually if I forget my painkillers and am stricken by menstrual cramps on a long-haul journey with limited access to shops.",
            "score": 1,
            "replies": []
        },
        {
            "author": "breakfast90210",
            "body": "I do always find Nurufen Liquid Capsules do the job, wouldn’t risk swapping",
            "score": 1,
            "replies": []
        },
        {
            "author": "fleurmadelaine",
            "body": "I buy fast acting nurofen if I’m out and about. Own brand fast acting ibuprofen is rare.",
            "score": 1,
            "replies": []
        },
        {
            "author": "annedroiid",
            "body": "I’ve seen too many instances where two drugs that are meant to be the same don’t work the same for a particular person to judge people who choose brand name medicines.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NecktieNomad",
            "body": "I had this just yesterday. I’m not paying £3 for branded Imodium or even £2.75 for Boots/Superdrug own brand diarrhoea remedy when generic Loperamide is 79p. When you’ve got gastro issues this shit (pun maybe intended) all adds up!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Life_in_China",
            "body": "Ignorance",
            "score": 1,
            "replies": []
        },
        {
            "author": "puchikoro",
            "body": "When I was a teen I used to have really bad period cramps and genuinely the only painkillers that would help were the period pain nurofen. It made no sense as it was just exactly the same as other pain killers and even other ‘period’ branded ones wouldnt help. I know it’s just a placebo but it genuinely did help it was annoying so I always had to get those even though they cost a lot more",
            "score": 1,
            "replies": []
        },
        {
            "author": "SarkyMs",
            "body": "Because you often only have a choice of 2 branded and dirt cheap. The branded are coated in some thing that makes them easy to swallow. The dirt cheap sticks to my tongue and won't shift .",
            "score": 1,
            "replies": []
        },
        {
            "author": "socksthatdontsmell",
            "body": "Not painkillers, but my co-op is selling piritine antihistamines for £7 a box lmao",
            "score": 1,
            "replies": []
        },
        {
            "author": "PsychologicalNote612",
            "body": "I suspect it comes down to free will and living in a capitalist society. It appears that people make different decisions to others and those decisions don't have to make sense to everyone. Some people might even buy certain things without thinking that much, possibly due to influence in the media, family, friends, or differences in education, attainment, or social norms.",
            "score": 1,
            "replies": []
        },
        {
            "author": "UKForensictox_expert",
            "body": "Branded painkillers typically use slightly different delivery methods to try and get the drug into your blood faster. For example, the gel tablets, or other faster dissolving packing materials. Or salt forms of the drug that permeate faster. It's really just to skip some of the the 30 mins to 1 hr time it normally takes to dissolve. The actual benefit is questionable. \n\nCheaper brands contain the same drug, usually the same amount but they use very basic pill binding agents like cellulose, starch etc. It could potentially take longer to dissolve and hit the blood. Again, it's debatable if it does. \n\nAlso some contain caffeine, which acts as a booster for some drugs like paracetamol. \n\nSo more expensive painkillers can be slightly more effective, but they largely do the same thing. You definitely can't target the pill to a specific area of the body.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BornBluejay7921",
            "body": "A few years ago, I hurt my back and went to the doctors. He prescribed some fancy sounding tablets for me.  I hobbled along to Boots to get the prescription.  The pharmacist came out and asked me if I knew what these tablets were, I didn't, turned out they were paracetamol, nothing special, and I was having to pay for the prescription.\n\nHe recommended ibuprofen instead, and it worked.  I still use ibuprofen today, but only the cheaper versions.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TotallyUniqueMoniker",
            "body": "I don’t buy branded tablets but I remember once having a rather gnarly cold - not flu, hate it when people say they have flu and don’t I once had flu and would have taken a bullet to the head (side rant over) - and when buying lemsip the checkout lady started going on about how non branded paracetamol is cheaper I was like yeah I know but I really want a nice warm lemsip, so in some circumstances get it yeah.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Boonz-Lee",
            "body": "Some people are just chumps for marketing",
            "score": 1,
            "replies": []
        },
        {
            "author": "kitjen",
            "body": "Clever marketing. They can say \"nothing works faster\" which makes you think this is the fastest working painkiller when really it works just as fast as the cheaper alternative and nothing is faster thanany of them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Honest-Vacation-8883",
            "body": "Shiny packaging will make you feel better.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MissKatbow",
            "body": "The only time I have is when we were all sick and were out of medicine so I went to the small shop 5 mins from my flat. The ~£4 price point was painful, but so was everything else at the time and it was the only option there.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Otherwise_Cut_8542",
            "body": "I buy branded paracetamol occasionally. \n\nThe kind that comes in the handy plastic packaging. Not because I expect it to be any different but because I want that package option as less gets wasted by being crushed in my bag. \n\nI buy branded co-codamol because although I get them prescribed for in-effect free, the round tablets suck to swallow when I’m already feeling my worst so occasionally I “treat myself” to an easier option the same way people buy convenience food when they could cook it themselves for less. \n\nPeople who think they’re actually getting a better drug rather than just the experience? That I don’t understand.",
            "score": 1,
            "replies": []
        },
        {
            "author": "IcyPuffin",
            "body": "Sometimes it is the only option. \n\nFor example i can't swallow tablets easily. I will only do so if I absolutely have to. Some non branded dont have the soluble or melt able form, so I buy the branded. \n\nI will buy non branded soluble paracetamol where possible, but it all depends on where I'm buying. I've had some non branded soluble paracetamol that tastes so bad I opted to suffer the pain instead. If im not sure then I buy the branded version. \n\nUltimately it doesn't matter. Non branded works just as well as branded.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fragile_reddit_mods",
            "body": "Not a clue. I buy whatever has the active ingredient in it. I have 3 boxes of painkillers in my room right now. The codeine is in a white box. No markings.",
            "score": 1,
            "replies": []
        },
        {
            "author": "unsureaboutthis21",
            "body": "I don’t necessarily buy branded but will always go for capsules over caplets even if they cost more. Those caplets do not go down easy and are horrifying to taste",
            "score": 1,
            "replies": []
        },
        {
            "author": "m-two24",
            "body": "Sadly I had a reaction to the 'cheaper' paracetamol but not the midrange or branded paracetamol. Asked the GP about it and they flagged the cheaper ones could have had a different mixture to them. \n\nOther than that, asda ibruprofen lysine is the same tablet as feminax. They have the same product licence number.\n\nI think watchdog did a whole thing about product licence numbers.",
            "score": 1,
            "replies": []
        },
        {
            "author": "blizeH",
            "body": "Sometimes I buy Nurofen because the cheaper unbranded stuff usually has lactase in which I’d like to avoid \n\nThat being said, it’s a medicine so I’m not super picky about it and would very happily have the unbranded ibruprofen too",
            "score": 1,
            "replies": []
        },
        {
            "author": "Teaofthetime",
            "body": "Ignorance in most cases I would think.",
            "score": 1,
            "replies": []
        },
        {
            "author": "icemonsoon",
            "body": "Fuck knows, i have an ongoing battle with my fiance, alka seltzer is good but me buying the aspirin and electrolytes separately for a fraction of the cost doesn't and the extra strong womens issue painkillers that i wasn't surprised to read the only ingredient is ibuprofen",
            "score": 1,
            "replies": []
        },
        {
            "author": "BusMajestic5835",
            "body": "I always buy the cheapest versions but I have a recurrent issue with my shoulder and painkillers never help much. I was staying with my parents and my decided to take a couple to take the edge off. Dad gave me a couple and half an hour later my shoulder felt so much better. I said I was surprised it worked so well as it doesn’t usually and he said it was Nurofen. I’ve heard the quality of what’s in them is better but no idea if that’s true.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mikon_Youji",
            "body": "Some people just don't trust that off brand products can be as good, if not better, than branded products.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Repulsive-Sign3900",
            "body": "Although the active ingredient is the same, the non  active ingredient isn't always. Plus the tablets can be different - I can't stand buying t cheap ones that are huge round pills. \nAlthough I will always ignore the brand name as it makes no difference overall.",
            "score": 1,
            "replies": []
        },
        {
            "author": "widnesmiek",
            "body": "Marketing\n\n  \nThat's all - just marketing\n\nand very clever people employed to make the marketing work",
            "score": 1,
            "replies": []
        },
        {
            "author": "Onetap1",
            "body": "Advertising. \n\nThe people who don't buy the expensive branded ones are health care workers.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AKAGreyArea",
            "body": "Because shiny and glossy packaging has been shown to aid in the placebo effect making people feel better.",
            "score": 1,
            "replies": []
        },
        {
            "author": "downlau",
            "body": "There isn't a generic version of the formulation I can tolerate, unfortunately.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Blueberrym_",
            "body": "I’ve always wondered this. A pack of cheap Ibrufoen costs 45p roughly but you get people buying the expensive brand, I want to know why.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SilentDrapeRunner11",
            "body": "I get horrific cramps, and find that store brand painkillers don't work well at all for them. I feel much more effective relief when I take a Nurofen instead. I find I have to take much less of them as well.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Suspicious_End130",
            "body": "If I buy just regular paracetamol or ibuprofen then I buy the cheapest ones available but I will buy anadin extra to keep on hand as they’re good for migraines and I’ve never found anyone else that does a cheaper version of them",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sharks_and_Bones",
            "body": "I can only take paracetamol and I carry it with me all the time. When I can find them, I buy the Panadol plastic packets that open like a book. The only reason is the box survives being in my bag.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RoleAlternative1553",
            "body": "Same with hayfever tablets. Same ingredients, fraction of the price.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheNickedKnockwurst",
            "body": "Because they work better\n\n\nDuh ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Additional-Guard-211",
            "body": "The placebo affect works, even when you knows its placebo!",
            "score": 1,
            "replies": []
        },
        {
            "author": "lil_tram",
            "body": "It's worth noting that, while it is likely largely placebo effect, it's well documented that the interaction of different fillers etc with the active can have an effect. Anyone who has been on different brands of the same birth control drug can attest to that in relation to side effects etc!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Efficient-Lab",
            "body": "I’m a nurse. I know the active ingredient is all the same blah blah blah but I WAY prefer the nurofen gel capsules. They’re like a dream. Love that for me. Little treat for my knee pain.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fred776",
            "body": ">Other than going to a pharmacy and getting Paramol etc with Codeine OTC, why do people spend extra on Nurofen and other brands?\n\nIt's been a while since I got any but I'm sure I used to be able to buy generic co-codamol OTC.",
            "score": 1,
            "replies": []
        },
        {
            "author": "bumpywigs",
            "body": "It’s a trade secret but I used to work in a Pharma plant but the unbranded stuff is all the left overs from batch’s mixed together that’s nearly timed our ie sat in a warehouse for years and and less affective or one of the ingredients was under dispensed  or a reaction happened too hot and the big brand don’t want it as it’s not as effective.",
            "score": 1,
            "replies": []
        },
        {
            "author": "trev2234",
            "body": "Some genuinely don’t know it’s the same drug. They see cheap and think it’s a cheap knock off.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rejectedbyReddit666",
            "body": "I will buy Nurofen Plus if it’s the only option but it contains caffeine & the own brand Boots or Almus don’t. I need my sleep.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CodeToManagement",
            "body": "Sometimes il go buy neurofen. Sometimes just plain ibuprofen. \n\nThe neurofen I know is mostly just the same as the plain stuff. But it’s better experience with the liquid gel things or the sugar coated ones rather than chalky tablets",
            "score": 1,
            "replies": []
        },
        {
            "author": "carlostapas",
            "body": "Only when off brand is not available and I need it then. \n\nI will then be upset for a while until the offending packet is empty.",
            "score": 1,
            "replies": []
        },
        {
            "author": "-TheHumorousOne-",
            "body": "Same with toothpaste, they're all pretty much the same, apart from Sensodyne which is special toothpaste for people with sensitive teeth.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Royal-Principle6138",
            "body": "I used to but after watching a documentary no more",
            "score": 1,
            "replies": []
        },
        {
            "author": "Royal-Principle6138",
            "body": "If you look at the ingredients they are all the same same for food shit ain’t it",
            "score": 1,
            "replies": []
        },
        {
            "author": "TEFAlpha9",
            "body": "The cold and flu ones are like £1 and have Phenylephrine",
            "score": 1,
            "replies": []
        },
        {
            "author": "CurvePuzzleheaded361",
            "body": "The placebo works - even when you know it is a placebo! Many studies been done on this. So even when you know it is the same stuff, it works better if you buy branded and think they will work better. For me, i buy liquid nurofen as the liquid ones do actually work quicker and they are easily available at my local store. Sure chemists will sell liquid own brand but i am happy with nurofen",
            "score": 1,
            "replies": []
        },
        {
            "author": "HVS1963",
            "body": "Rory Sutherland, mentions Nurofen were hauled up in court for price discrimination when they marketed two different types of Nurofen.... one targeting 'period pain' and another targeting something else... BOTH had exactly the same active ingredients, but a very different price... I don't remember the outcome, but Rory said they didn't go far enough, they should have developed more specific versions, like \n\n\n'Nurofen for people whose neighbours like reggae' and \n\n\n'I can't find my car keys Nurofen' 😂 ",
            "score": 1,
            "replies": []
        },
        {
            "author": "HVS1963",
            "body": "I don't have a 40p headache... I have a £3.50 headache! 😂 ",
            "score": 1,
            "replies": []
        },
        {
            "author": "mad-un",
            "body": "It's proof that marketing works.\n\nGood marketing creates trust, trust that the product works, because they say so on the TV / radio / print / packaging.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RudePragmatist",
            "body": "Remember folks always check that serial code on the back of the packs.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gloomfilter",
            "body": "People find the brand name easier to remember than the drug name. \n\nNot helped of course when the same brand name is used for different drugs (e.g. sudofed).\n\nAlso not helped by pharmacists who dislike the medication name. I went into Boots a couple of weeks ago and asked for pseudoephedrine, and the pharmacist said, \"why don't you just say decongestant\"? Well... because I want the one that works.",
            "score": 1,
            "replies": [
                {
                    "author": "shadowplaywaiting",
                    "body": "That would annoy me so much because they are meant to have that job for a reason!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Matt_Moto_93",
            "body": "If abroad, I will buy branded. \n\n  \nIf in Tesco, I'll get tesco branded. But for my kid, it's Calpol all the way.",
            "score": 1,
            "replies": []
        },
        {
            "author": "toonlass91",
            "body": "Placebo effect probably. But I always buy the cheap stuff as it’s the same drug",
            "score": 1,
            "replies": []
        },
        {
            "author": "BeersTeddy",
            "body": "Actually I know a person who does it.\nShe explained that branded paracetamol will be better.\nProbably she meant the same logic as Coke /Pepsi have unique taste, others just aren't the same. No idea. \n\nTried to explain that medications are well regulated and 500mg of paracetamol is 500mg of paracetamol, but achieved just nothing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rrrkos",
            "body": "If you think placebo is wierd, google 'nocebo'. \n\n(Useful to add  -film -movie)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Remote-Pool7787",
            "body": "I keep panadol in my handbag for emergencies because the packet doesn’t get damaged. But at home we just have 50p paracetamol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Benjammin123",
            "body": "Trust. My gf won’t buy the 50p paracetamol from anywhere because she doesn’t trust them. She’ll spend £4 on Neurofen no matter how many times I tell her it’s the same thing, maybe slightly different. Why does she trust them? Adverts on the tele I suppose so you could say it’s down to marketing and spending lots on it.",
            "score": 1,
            "replies": [
                {
                    "author": "pm_me_your_amphibian",
                    "body": "Paracetamol and ibuprofen are completely different to be fair.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Potatusha",
            "body": "I was at the chemist waiting for a prescription the other day and I noticed the normal ibuprofen lysine on the shelf and then the ibuprofen lysine in pink packaging marketed at women for period pain, a lot more expsensive but exactly the same thing...",
            "score": 1,
            "replies": []
        },
        {
            "author": "Perception_4992",
            "body": "Beats me, but not my problem.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MediumAutomatic2307",
            "body": "Often it’s a trust thing.  People trust a well known brand.  After that it’s marketing.\n\nOne of the “best” marketing strategies I’ve seen in a while is the Benylin cough syrup range.  You can buy a syrup for just a every differ coughing, and yet when you read the back of the box, the same ingredient at the same concentration.  As an aside it is *much* cheaper to buy bog standard paracetamol and generic phenylephrine than it is to buy Lemsip (or even a supermarket generic)\n\nI find it odd that some pharmacies are twitchy about providing generics, or the pharmacy assistants aren’t familiar with the generic or ingredient names of the branded products.  Asking for co-dydramol resulted in a lot of blank stares, until I asked for Paramol.\n\nThere are some drugs which recipients can be extremely sensitive to, even though they all need bioequivalence certification, e.g. antiepileptics so some people will prefer to stay with a well known brand.  I’ve had awful adverse reactions to off-brand salbutamol, so I asked my Dr if I could just stick with Ventolin, and they agreed; but Ventolin vs off-brand salbutamol isn’t going to break the NHS budget.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SoggyWotsits",
            "body": "I buy whatever is easiest to swallow. If it’s a choice between cheap, powdery paracetamol tablets and expensive but slippery ones… it’s the expensive ones! I also buy Nurofen meltlets because they dissolve on the tongue without a drink. They also taste of lemon and there’s no cheap alternative to those.",
            "score": 1,
            "replies": []
        },
        {
            "author": "IAmRoloTomasi",
            "body": "I hate headaches, it's the one pain I cannot manage at all, when a headache comes I want it gone immediately and whether it's the placebo effect or something in the formulation/delivery system I don't care, I always have branded painkillers on hand because if nothing else they feel like they work quicker and for longer.\nI'm well aware it's ridiculous but if I feel better I feel better",
            "score": 1,
            "replies": []
        },
        {
            "author": "Jumbo_Mills",
            "body": "Apply this to nearly every other product. Same shit different names.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NoSummer1345",
            "body": "Some are easier of my stomach.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ItsSuperDefective",
            "body": "Sometimes I go into a shop and my options are a no brand painkiller for 20p that for some fucking reason they've decided to shape in a horrible giant flat disc that is uncomfortable to swallow, or a branded one in sensibly shaped tablet for just 80p more.",
            "score": 1,
            "replies": []
        },
        {
            "author": "IPoisonedThePizza",
            "body": "Panadol Advance apparently works better and faster on my wife in comparison with regular Paracetamol.\n\n\nShe has migraines when on her period and this helps a lot",
            "score": 1,
            "replies": [
                {
                    "author": "pm_me_your_amphibian",
                    "body": "The green boxed panadol effervescent are one of the only things that give me some TMJ relief. The red box ones, while in theory are better, do not do the same. Not sure if it’s placebo or what but I don’t really care.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Ready0811",
            "body": "You try calpol then Boots own brand and come back to me!",
            "score": 1,
            "replies": []
        },
        {
            "author": "FEMXIII",
            "body": "Because they are the only ones available when I need them. Otherwise I go white label wherever possible ",
            "score": 1,
            "replies": []
        },
        {
            "author": "Formal-Cucumber-1138",
            "body": "Shop brand painkillers don’t work for me… I tried. Only Anadine works for me",
            "score": 1,
            "replies": []
        },
        {
            "author": "electronicmath",
            "body": "I buy Nurofen fast acting liquid ibuprofen pills - I’m allergic to Paracetamol and regular ibuprofen gives me terrible heartburn. \n\nThe liquid Nurofen ibuprofen pills (red) massively reduce the amount of acid reflux I get after taking them. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "GrandDuty3792",
            "body": "Google Rory Sutherland on this. Interesting listen/ watch",
            "score": 1,
            "replies": []
        },
        {
            "author": "InquisitorVawn",
            "body": "For me, sometimes it's about the size, shape and texture of the pills.\n\nI struggle to swallow medications. I cannot take capsules unless they're literally the only option available to me, and if I do I'll end up feeling like the damn thing is stuck in my throat for hours, no matter how much I eat and drink in the meantime.\n\nI also have texture issues, and while I know pills are only in your mouth for a moment, some textures I physically can't force myself to swallow. Branded tablets tend to be coated, and in many cases (not all) are smaller, or a better shape for me. Coated long pills are better than coated round, both are better than uncoated long and absolutely a million times better than uncoated round. And those liquid caplets can get the fuck in the bin.\n\nI will preferentially get the own-brand/unbranded version where possible, but if I'm very ill and struggling to keep anything down the one that gives me the least chance of gagging is the one I'll get, and sometimes that's the Nurofen.\n\nI have no delusions about them working any better once they're actually in my stomach, but it's getting them there in the first place that's the struggle sometimes.",
            "score": 1,
            "replies": []
        },
        {
            "author": "adezlanderpalm69",
            "body": "Nurofen is better.   I believe the ads 🤣🤣🤣",
            "score": 1,
            "replies": []
        },
        {
            "author": "adezlanderpalm69",
            "body": "Same with Covid vaccines.   Proven to have zero effect",
            "score": 1,
            "replies": []
        },
        {
            "author": "txteva",
            "body": "Sometimes there's no other options - I use Meltlets and the only option is the Nurofen ones.",
            "score": 1,
            "replies": []
        },
        {
            "author": "NoInvestment9829",
            "body": "Panadol for the caffeine, nurofen with the strong dose for effectiveness (the one that costs £10 and you only take one).",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheHeianPrincess",
            "body": "Placebo effect with branded products, plus maybe a bit of snobbery? My American friend needed painkillers so I directed them to a Poundland, saying “It’s like Dollar Tree” and they went “Ew, I’m not buying painkillers from a Dollar Tree! Where’s the nearest drugstore?” Dude, it’s the exact same shit, just branded and 3x the price.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SwordTaster",
            "body": "The advertising worked",
            "score": 1,
            "replies": []
        },
        {
            "author": "RugbyEdd",
            "body": "Personally, I get Anadin extra because it’s a couple of quid more than paracetamol (I think the last pack I got was just under £2.50 from boots), but also contains Aspirin and caffeine and I get through probably a pack a year, so why not just get the all-in-one and call it a day? \n\nThere's probably a cheaper alternative if I took the time to look, or I maybe don't need the caffeine and Aspirin, but I'm not going to miss a couple of quid a year, there are other things I could save money on before this particular expense is a concern and honestly, I never really put much thought into it.",
            "score": 1,
            "replies": []
        },
        {
            "author": "pm_me_your_amphibian",
            "body": "Well I buy the panadol effervescent paracetamol because the Sainsbury’s own ones have got so much fucking sweetener in I can’t stand them.",
            "score": 1,
            "replies": []
        },
        {
            "author": "notouttolunch",
            "body": "There’s a lot of talk about the placebo effect but it can be nonsense. \n\nWith pain killers I’m not sure I’ve experienced it. But there are three types of inhaler and one of them demonstrably performs worse with me than the other 2 (since they’re prescription drugs they’re all unbranded to me!). Additionally, I have tried a whole variety of unbranded antihistamines. Some work better than others. Some don’t work at all in fact!  \n\nWhen there was a shortage of epilepsy drugs, there was a demonstrable number of people who returned to fits despite taking drugs with the same active ingredients but manufactured by a different companies. \n\nSo that would be why. Some may work better for some people.",
            "score": 1,
            "replies": []
        },
        {
            "author": "tigerjack84",
            "body": "I always buy the cheaper one. The numbers are the same.\n\nHowever, for 30/500 co codamol, two of the brands, solpadol and kapake, I find one works better than the other.. and they both work better than the generic 30/500.. \n\nAlso, I don’t find paracetamol drips effective for some reason.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Miserable-Ad7835",
            "body": "Because, they're fucking idiots.",
            "score": 1,
            "replies": []
        },
        {
            "author": "charlottedoo",
            "body": "Once others start making the red smooth blobs like nurofen I will take them. I hate taking tablets but they seem to go down fine",
            "score": 1,
            "replies": []
        },
        {
            "author": "PassionFruitJam",
            "body": "I had the same conversation with my dad recently when I had a nasty cold? Virus? Dunno - chills, cough, aches, headache, bunged up anyway. I was taking echinacea, but also generic paracetamol, lemon, honey and hot water, drinking coffee and dosing on pseudoephedrine tabs. He was adamant I needed Lemsip. Had to be Lemsip. I wasn't apparently taking my symptoms seriously.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrMrsPotts",
            "body": "Because it’s not that much money and people don’t want to take the risk.",
            "score": 1,
            "replies": []
        },
        {
            "author": "gibgod",
            "body": "I always buy own brand as I know it’s the same strength as branded and works just as well.\n\nHowever… If the branded were on offer and the same price - I’d likely buy the branded ones. So there must be something going on in the back of my mind thinking that there *must* be some reason they’re more expensive and that they *must* be a bit better, even if slightly.",
            "score": 1,
            "replies": []
        },
        {
            "author": "shadowplaywaiting",
            "body": "I swear the placebo works even if you fully know it’s placebo. When I came out of hospital with pulmonary embolism I needed some ibuprofen, and for some reason my mum bought me the extra expensive nurofen stuff. The fact it was sugar coated and had ‘nurofen’ wrote on each tablet in tiny letters was so charming I think it actually fully helped a bit. This is me who is chemistry-minded and fully knows the generic is the same.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Thesladenator",
            "body": "Idk what it is but anadin is the only stuff that stops headaches turning into migraines",
            "score": 1,
            "replies": []
        },
        {
            "author": "cat_among_wolves",
            "body": "i cant take normal cold remmedues as i max out on prescription co cocodamol. nurophen cold and flu is thr only remedy that doesnt contain paracetsmol do i do buy this when i need something. otherwise generic alll the wsy",
            "score": 1,
            "replies": []
        },
        {
            "author": "auto98",
            "body": "Once a product has gone generic, the active ingredient is exactly the same between tablets.\n\nHowever, the claims like \"faster acting\" and suchlike are often true because the delivery mechanism is better - either it dissolves quicker, absorbed quicker or sometimes just more efficiently (ie more of the active ingredient is effectual and you don't just piss it straight out) or often just that it tastes better!",
            "score": 1,
            "replies": []
        },
        {
            "author": "MassiveRegret7268",
            "body": "Paramol is paracetamol & dihydrocodeine, there isn't (i think) a generic option.",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Shine_4707",
            "body": "Because the advertising and branding makes them believe that the brand is better. Shouldnt be allowed. They should only be able to make claims about the active ingrediants.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Longjumping-Basil-74",
            "body": "There is a difference between generic and brand meds, usually in terms of side effects and effect that varies per person. If you won’t see the difference for yourself, then it’s great news, enjoy the saving",
            "score": 1,
            "replies": []
        },
        {
            "author": "God_Lover77",
            "body": "I can tell the difference tbh.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ninjabadmann",
            "body": "Marketing. And ignorance.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Zubi_Q",
            "body": "I get Neurofen express, headache is gone within 30 mins. Can't get that with regular cheap paracetamol",
            "score": 1,
            "replies": []
        },
        {
            "author": "comedydave1978",
            "body": "If you think it’s going to work better, it will. Simple.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sasspishus",
            "body": "Sometimes I'm in an airport or train station and all they have is the branded ones",
            "score": 1,
            "replies": []
        },
        {
            "author": "ScottishSquiggy",
            "body": "You know who does a good paracetamol?",
            "score": 1,
            "replies": []
        },
        {
            "author": "CharmingAd3678",
            "body": "No idea, ketamine is ketamine right?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Low-Maintenance-2668",
            "body": "Because they work better. I'm not claiming they're in any way chemically different to cheaper brands but the placebo effect shows that the more money people spend on painkillers the more effective they claim they are. The wild thing is the placebo effect still works even if you know about it. So why not buy more expensive painkillers, your mind will tell you they're more effective which means they're more effective",
            "score": 1,
            "replies": []
        },
        {
            "author": "Suspicious-B33",
            "body": "We used to buy nurofen for an elderly relative who would cough and throw up taking own brand tablets because she couldn't swallow them very well and would end up with all the horrible coating in her mouth. Nurofen were tiny in comparison to regular ibuprofen and if she couldn't swallow them for a few seconds they tasted sweet.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Latte-Addict",
            "body": "So theres no proof to suggest the £2.50 16:pack of Anadin Extra (aspirin) work any differently/better than the supermarket branded equivalent at a third of the price?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Sardinesarethebest",
            "body": "To he fair there are fillers in different generics and some people are sensitive to them in either the generic or branded. I mean there are so many generics it's kind of a big generalization. I have noticed when my son was younger generic motrin did not work nearly as well as the name brand one",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheDawiWhisperer",
            "body": "100% a placebo effect. but it works so i'll carry on",
            "score": 1,
            "replies": []
        },
        {
            "author": "wearezombie",
            "body": "I do like that Panadol comes in a solid little book, which holds a lot sturdier in a little pocket in my work bag vs a 40p pack where the cardboard and tablets inside just flatten and crush from where I throw it about and overfill it and such.\n\nMy fiancé likes the taste of the Nurofen ibuprofen and prefers to get that because he struggles to swallow the powdery ones before they start to dissolve and the powder fills your mouth.\n\nI still buy the cheap ones with both of these preferences in mind because the markup is so stark, but I know that if I was feeling like splurging they’re practical options.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 0,
            "replies": [
                {
                    "author": "WowSuchName21",
                    "body": "Beyond features such as different coating, dissolving etc these tablets are often exactly the same. The biggest thing you’ll usually notice is branded having bright colours and fancier packaging, your brain does the rest.\n\nNext time you are in a supermarket, grab a branded pack and unbranded pack side by side. Aside from any “filler” the ingredients listed are identical.\n\nI’m not saying it’s not worth it, if you find a noticeable improvement between the two its probably worth the difference you are paying, but there have been plenty of studies into this - two identical tablets can have differing effects based on factors such as packaging, marketing or method of delivery.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Commercial-Repair301",
                    "body": "They do. The inactive ingredients are better in branded, which improves the efficacy of the active ingredient (which is the same between branded and non-branded).",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "yearsofpractice",
            "body": "I’ll thank you to keep you incorrect opinions to yourself - everybody knows that branded pharmaceuticals work much better than generics and if you don’t believe me, please rewatch the adverts and read the marketing. It’s all correct and true. \n\nIn a completely unrelated matter, I must check on the pension scheme I have from working for a pharmaceutical company a few years back. Nothing to see here. Shhhhh, shhhhh",
            "score": 1,
            "replies": []
        },
        {
            "author": "WaveyDaveyGravy",
            "body": "I have a colleague who paid another colleague holidaying in Florida to bring her back some Tylenol.\n\nI tried to explain that Tylenol is a brand name for Paracetamol but she wouldn't have it\n\nSo I just laughed in her stupid fucking face and went back to work",
            "score": 1,
            "replies": []
        },
        {
            "author": "wayneio",
            "body": "If you can find me a basic brand of the lemsip powder for hot drinks I’ll take it",
            "score": 1,
            "replies": [
                {
                    "author": "Sideways_Underscore",
                    "body": "Nah this isn’t shade at Lemsip I understand taste/comfort elements. This is spending a fiver on a tablet that still taste/feel like shit.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "LoveBeBrave",
                    "body": "You’ll find generics in every supermarket.\n\nThey’re normally called something like “Cold and Flu Sachets”.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Forsaken_Hat5481",
            "body": "So I worked in general practice for a long time as a manager. Every time the local team tried to get us to help switch patients off branded products and on to generic products, it always didn't work. Patients are educated (brainwashed) through advertising to believe a big name works better (it doesn't). Despite funding the switches, patient education wasn't funded, and this applies to so many things in the NHS, not just medicines",
            "score": 1,
            "replies": []
        },
        {
            "author": "AggregatedParadigm",
            "body": "Neurofen has other stuff besides the standard stuff that works so much better for flu.\n\nThen the branded cocodamol was 12 coedine/500 paracetamol vs the otc 8/500. For higher bmi people with chronic pain this extra 50% is noticable.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Vertigo_uk123",
            "body": "it may be placebo but i find ibuprofen doesnt work for me but neurofen does. weird i know",
            "score": 0,
            "replies": [
                {
                    "author": "C_Sharp_Standard",
                    "body": "Yep the placebo is real, heard about the studies.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "Own-Lecture251",
                            "body": "The placebo effect is absolutely real. A few years ago, I took part in a study to test anti-depressants. I had to do separate weeks on two anti-depressants and a placebo. I got the side-effects on all 3 pills. Extreme drowsiness and dry mouth. I'm a researcher so I knew exactly what the placebo effect was but I was still affected.",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "C_Sharp_Standard",
                                    "body": "Yep there's some crazy stuff. The podcast bros love to bring this one up, but there's the one where they tell the room full of gluten-free folk that they have consumed gluten, and they are all moaning about feeling ill (and maybe even physically getting the shits), when they in fact didn't consume any gluten at all.\n\nSomething along those lines.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Own-Lecture251",
                                            "body": "I bet you could get people to act drunk by giving them fake alcoholic drinks.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "C_Sharp_Standard",
                                                    "body": "That's also been done I think!",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Kiss_It_Goodbyeee",
                            "body": "Not only is it real, but it can be used to increase effects. Look up \"nocebo\". Very cool.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Johnny-Alucard",
                    "body": "A placebo relies on you not knowing though surely? You do know that the active ingredient is exactly the same? I think there might be some other psychological explanation for this one.\n\nEDIT: Also it is incorrect to say \"ibuprofen doesnt work for me but neurofen does\". Neurofen is Ibuprofen..",
                    "score": 2,
                    "replies": [
                        {
                            "author": "spLint3r990",
                            "body": "Nope. Placebo is so powerful it appears to still have an effect even if you know it. \n\nReally weird psychology.",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "Kiss_It_Goodbyeee",
                            "body": "Nope. Even being aware of the possibility of placebo doesn't stop you being affected by it.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ImTooHigh95",
            "body": "Nurofen ibuprofen is the only thing that suppresses toothache for me. No other painkillers seem to touch it even ones slightly stronger than the nurofen ibuprofen! More than likely placebo but if it gets rid of the pain I’m happy to pay like £6 for 24 tablets that I know will work rather than cheaper alternatives that would end up being a complete waste if they don’t work!",
            "score": 0,
            "replies": []
        },
        {
            "author": "Puzzled-Leading861",
            "body": "Because they work better.\n\nYes, the ingredients are exactly the same. But the placebo effect is so powerful that it works even when you know it's placebo.\n\nGenerics are for 80p headaches. Neurofen is for £5 headaches.",
            "score": 0,
            "replies": [
                {
                    "author": "traditionalcauli",
                    "body": "Nurofen is ibuprofen for people who can't face reality.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "LEANiscrack",
            "body": "As someone who worked in pharma.\nThere is a difference. Some people are more sensitive than other overall sideeffects are more common in the secondary makers. \nDoes it matter for the vast population? No.\nBut if its a med you need to take regularly than yeah, you will QUICKLY notice that it matters.\nAlso matters which specific meds etc.\nThe ppl who keep harping on about it the most are usually pharmacist. Their knowledge is very specific and idk why so many of them keep talking ablut the manufacturing side, stuff they do not seem to understand most of the time.\nNobody knows everything.\nIf you want to know how meds interact, ask a pharmacist.",
            "score": 0,
            "replies": [
                {
                    "author": "Littleloula",
                    "body": "Yeah if you're reliant on something everyday there can be a difference. Anti epileptic brands vs generic (or different manufacturers of generic) are a notable example",
                    "score": 3,
                    "replies": [
                        {
                            "author": "LEANiscrack",
                            "body": "Yeah the only thing that needs to be the same is the active substance and altho that is obviously the main part of a med the other substances are still present, sometimes in such quantities or forms that can be significant. ",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "OneNormalBloke",
            "body": "I'm guessing but it's just a personal choice.",
            "score": -1,
            "replies": []
        },
        {
            "author": "ldn-ldn",
            "body": "It really depends on a specific generic. Active ingredient is just one of many inside the pill and, usually, the smallest part of the pill. Additional ingredients can make painkillers work faster or better. Some generics are good, some are bad. I usually avoid generics from ASDA and Super Drug - they don't work on me at all. Boots and Sainsbury's generics are good for me. But if there's no Boots around and I need a painkiller in urgency, I will buy branded.",
            "score": 0,
            "replies": [
                {
                    "author": "nolinearbanana",
                    "body": "Nope - you're referring to the \"filler\" which makes no difference to the speed of action, nor any other aspect of the medication apart from perhaps ease of swallowing.\n\nBut effectiveness of painkillers varies depending on what the problem is. One day you try a pill from x and it doesn't work. In your head from now on, pills from x are ineffective. Many snake oils \"work\" based on the opposing principle - one day you have y problem and take z for it. Y goes away of its own natural accord, but now you associate that with z and believe it to be a cure for y and tell all your friends.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Littleloula",
                            "body": "Filler can make a difference with some prescription medication though. People on certain anti epileptic drugs are advised to always have the same brand for example. That's not a placebo effect thing",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "nolinearbanana",
                                    "body": "Well yes and no.\n\nThe guidance states that in some cases consistency of supply is important “where the consequence of therapeutic failure or toxicity might have serious clinical consequences”. This means there is a risk that switching between different versions might mean that the drugs don’t work to control seizures, or they cause toxic side effects, and this would have a serious impact on the individual.\n\nThe guidance also says that in some cases consistency of supply is important when there are “specific concerns such as patient anxiety, and risk of confusion or dosing errors”. This means that when someone is very worried about switching between ASMs, or switching might cause confusion or result in someone not taking the right dose, their doctor might want to ensure consistency of supply.\n\nThis is basically the precautionary principle. In cases where something being different could have catastrophic consequences, one applies this principle. It doesn't mean that there IS a difference - it simply means that there isn't evidence to prove that a difference doesn't exist. \n\nNone of this applies to painkillers.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 0,
                    "replies": [
                        {
                            "author": "ldn-ldn",
                            "body": "Did you even read my comment?",
                            "score": 0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Jijimuge8",
            "body": "I suffer from severe migraines. Liquid ibuprofen and Ibuprofen lysine work much better than others forms of ibuprofen for me.  There are 'own' brand versions of both liquid and ibuprofen lysine and shops like Poundland also sell a 16 pack of liquid ibuprofen for £1 which is the best value I've found other than Savers. Many people will tell you there's no difference from standard ibuprofen but there definitely is, and people who suffer from chronic pain tend to work out these differences. Even pharmacists will tell you that some brands of generic drugs just don't work for some people and they don't know why. I had it happen once and thought I was crazy until I went back to the pharmacy and they told me I wasn't the first person and that some people get on with some brands more than others so it's worth changing the brand and seeing the difference. My mum had a similar thing with side effects on HRT, switched back to the other brand and the side effects went away. Anyway  I found out what brand I had before and have never had any problems since then. The point is sometimes the brand will make a difference for some people and 'generic' doesn't mean exactly the same chemically.",
            "score": 0,
            "replies": [
                {
                    "author": "Disgruntled__Goat",
                    "body": "I’ve suffered from migraines for 20 years and there is no difference between any of the different ibuprofen for me. ",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "blowin96",
            "body": "[https://www.youtube.com/watch?v=hU9-DDFkaDk](https://www.youtube.com/watch?v=hU9-DDFkaDk)",
            "score": 0,
            "replies": []
        },
        {
            "author": "c0tch",
            "body": "The cold and flu ones also have hydrogen or some chemical compound that sounds like that which is what you get in decongestion tablets.\n\nSo they’re not just placebo or just added caffeine.",
            "score": 0,
            "replies": []
        },
        {
            "author": "BanditKing99",
            "body": "Same reason people buy branded anything. Why do Lacoste sell polo shirts for £100 when Primark do them for £7",
            "score": 0,
            "replies": []
        },
        {
            "author": "Critical-Abroad-682",
            "body": "From my personal experience, I’ll buy branded painkillers because they work quicker. Never necessarily better just simply quicker",
            "score": -5,
            "replies": []
        },
        {
            "author": "bloqed",
            "body": "this is a really weird and immature way to signal superiority over other people due to recently having gained better insight. \n\nthey buy them because of familiarity and not knowing any better, of course. If you had a shred of empathy that would be immediately clear.",
            "score": -1,
            "replies": [
                {
                    "author": "Sideways_Underscore",
                    "body": "I started typing a reply to this but no need, holy shit you’re a dramatic person. Take a breath.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "bloqed",
                            "body": "You took the time out of your busy schedule to make a post on askUK which was literally a rhetorical question for (presumably) dramatic effect. A tad hypocritical",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "Sideways_Underscore",
                                    "body": "Had shoulder reconstruction couple months ago so my schedules pretty open right now. \n\nAlso, the reason I thought of the question was after buying Paramol (which has codeine in, thus making it actually worthwhile due to the dopamine easing the pain on top of the analgesic relief)",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}