{
    "title": "What should care home be like ?",
    "author": "Behavingdark",
    "subreddit": "AskUK",
    "rank": 13,
    "score": 38,
    "upvote_ratio": 0.88,
    "num_comments (reported by reddit)": 59,
    "url": "https://www.reddit.com/r/AskUK/comments/1je39on/what_should_care_home_be_like/",
    "id": "1je39on",
    "selftext": "I'm in despair at the care home my dad is in ,I'm disabled and unable to have him with me ,he has Parkinson's disease and Alzheimer's he is only 72 , I'm here now ,there is no stimulation I can't even see carers although when I do they are sitting in chairs on phone , 2 ladies have been at the table since breakfast time it is now 12pm ,TV too loud ,when I say anything they shrug , my dad is a great knowledgeable man who is telling me to smother him and get him out of this nightmare , my heart 💔 wtf do I do? ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "**Please help keep AskUK welcoming!**\n\n- When repling to submission/post please **make genuine efforts to answer the question given**. Please no jokes, judgements,  etc.\n\n- **Don't be a dick** to each other. If getting heated, just block and move on.\n\n- This is a strictly **no-politics** subreddit!\n        \nPlease help us by reporting comments that break these rules.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskUK) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Leading_Exercise3155",
            "body": "I work in a care home… we are severely understaffed, underfunded, over crowded. Their physical needs are met but emotional needs sit in the back burner unfortunately because there’s so much to do in such a short time with limited staff. \n\nAt our home there’s entertainment but it’s just basic crap like bingo, cards, music, drawing. Very very very rare they are taken out, some aren’t taken out at all if they’re deemed too difficult or their behaviour is challenging. I know for a solid fact a lot of care homes are the same, some worse. \n\nThere’s a lot of dark shit about care homes you don’t know, it’s all about money not people. ",
            "score": 71,
            "replies": [
                {
                    "author": "mumwifealcoholic",
                    "body": "In the UK.\n\nMy mum is in a carehome abroad and it's wonderful. They have a fucking petting zoo..lol\n\nThere is a playground on the site, so when families visit the kids have somewhere to play. There are regular concerts, art exhibits, etc...it's a fucking paradise..\n\nIt costs 8k per month, but the staff are all well paid professionals. The building is new. There is a full time chef. A recent cleaner retried after 35 years. \n\nSome folks self pay, those that can. My mum can't, so the state pays. \n\nANd guess what? The company that runs the place, still makes a good profit. \n\nIt's a lie that care homes can't make money and not be decent. It's a choice bu the owners and the companies that run these places to extract the maximum amount of profit. \n\nI'll jump off a bridge before I 'll agree to go into a care home in the UK.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Scorpiodancer123",
                            "body": "Sounds incredible. Where is this?",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Leading_Exercise3155",
                            "body": "That sounds absolutely amazing. What country is this? My husband is Jamaican the care home there looked lovely, seen them all out in the sun enjoying themselves looking very relaxed. Uk care homes are like actual prisons ",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Ranger_1302",
                            "body": "Petting zoos aren’t wonderful. Now they’re exploiting other animals…",
                            "score": -2,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "namtabmai",
                    "body": "> There’s a lot of dark shit about care homes you don’t know, it’s all about money not people.\n\nIt's also not a modern problem. My mum worked in care homes in the late 90s, all sounds very similar.\n\nUnder staffed, especially experienced staff. Seemed to be a constant rotation of younger people who thought it was an easy gig but gone once they realised the real work involved.",
                    "score": 30,
                    "replies": [
                        {
                            "author": "inmyfeelingsx",
                            "body": "I don’t think it’s so much about expecting an easy gig and realising it’s hard work, it’s more about realising it’s such hard work and they’re severely underpaid",
                            "score": 20,
                            "replies": []
                        },
                        {
                            "author": "Historical_Owl_1635",
                            "body": "> It’s also not a modern problem. My mum worked in care homes in the late 90s, all sounds very similar.\n\nModern problems obviously aren’t ideal still but are probably a lot better than what it used to be in the 90s.\n\nStories of actual abuse and neglect were way too common for care homes in the 90s. Unfortunately those things will still occur sometimes today but it wouldn’t be called commonplace.",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Sudden-Possible3263",
                    "body": "\nManagers don't care as long as money is coming in, they also don't care about the quality of carers they employ as long as they don't disrupt things or complain, any carer that does complain about neglect gets pushed out, they'll pretend to look into it but it still happens. \nYou're right that lots of dark shit goes on there, I'd fight to keep any of my loved ones out of a care home, they're great at pretending things are fine when visitors are there.\nCare homes are all about money now, not about caring.\nThose carers shouldn't have been on their phones, they should have been interacting with the residents at the table, that's an example of management standards, they turn a blind eye as long as someone is there if needed.\nI've seen negative reviews get removed so it appears they're 5 star, the best of care\nI worked briefly in one where the majority of the carers at night couldn't speak the same language as the residents, yet they were expected to meet their needs.\nI don't say that to be racist as some did their best, to others it's just a wage. \nThe government should be ashamed at how our old folks are treated in care homes.",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "monotreme_experience",
                    "body": "Hear hear. I worked for a while as an activity leader in a care home (and then a care assistant) and can back up everything you just said. Activities are very hard- there's no money, and also you've got all these different people with different levels of engagement & comprehension. I tried painting, chair yoga, tie dye, button mosaics, reminiscence. Never really felt that I got a handle on how to do the job, was delighted to leave it. It's ROUGH being a care assistant, and often dangerous for you & the ressies because there's not enough staff, equipment or time, but at least you know what you're supposed to be doing. Activities mostly felt like making a tit of myself in front of 15 blank faces.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "Behavingdark",
                    "body": "I worked in a home 30 years ago and I realised it was the strictness of the boss that kept us on our toes it's too lapse here .",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Stamagar",
                            "body": "The boss can be strict, but then the employees will just quit -- they're on minimum wage after all. And good luck doing new hiring for more minimum wage workers. It's all money, if they paid more, they'd be able to have better employees and keep them, etc",
                            "score": 6,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Bulbasaurus__Rex",
            "body": "So sorry he's being treated like that. Check Age UK on how to report your concerns https://www.ageuk.org.uk/information-advice/care/arranging-care/care-homes/problems-with-a-care-home/ but I'd recommend speaking to management at the home as the first course of action.",
            "score": 23,
            "replies": []
        },
        {
            "author": "coreybob5422",
            "body": "Just to say that most homes have digital systems now so the phones they are on may be what they use to update care plans etc",
            "score": 14,
            "replies": [
                {
                    "author": "Behavingdark",
                    "body": "Yes I've seen that ,the TV has just had the movie Grease on and 2 of the staff and just watched it all the way through ,I don't think it takes that long to update care on the phone ?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "goffshroom",
                            "body": "It can take a little while, depending on what you need to document. I work in a care home, in fact I'm at work right now (but I'm only on Reddit because everyone is in bed and I'm on a sleep in shift, so I will be going to bed soon too - please don't think I'm a lazy or uncaring care worker!) and it's just taken me a good half hour to make sure all the documentation is done for the day, which is a bit more than usual as we've had a small incident. That's just for 3 residents, so it can be more depending on how many people and their needs (fluid charts, bowel charts, activities, food; different people will have different levels of documentation.)\n\nThere is a LOT of admin in care nowadays, which is good in the sense of more accountability and safeguarding, but it is very time consuming.\n\nHOWEVER, these staff seem like they're just taking the piss if they're sat about watching a whole film (not even with the residents?!) Hope you see improvements or find somewhere better for your dad.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "PidginPigeonHole",
            "body": "Speak to your local authority social worker. This was how I moved my father into another carehome. I'm about to move him into a 3rd one in a year so I shall be speaking once again to social services. Carehomes are just dire.",
            "score": 18,
            "replies": [
                {
                    "author": "Behavingdark",
                    "body": "Thank you for the advice I've never felt so much despair in my life ,I wish I could get a bus and steal all the residents and go to the seaside ,sadly I'm unable to walk well I can't do much for him and watching the others is awful a lady has been crying for her mum for 2 hours and I'm the only one holding and parting her hand .",
                    "score": 13,
                    "replies": [
                        {
                            "author": "PidginPigeonHole",
                            "body": "I do pretty much the same when I'm visiting my dad. Other patients come in his room asking me to help or I can hear two other patients shouting for help. It's horrific. My heart goes out to you. Make sure you get a proper response from the social workers.. keep at it! I've got an appointment at the weekend to view another carehome.. dad's a self funder and it's not as if these places don't charge thousands per month for bad levels of care. Good luck!",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Icy_Reply_7830",
                                    "body": "May I ask why social services are involved if your dad is self funding. Usually you do not need their involvement in a change of placement if self funding.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "PidginPigeonHole",
                                            "body": "He's only been at his latest placement six months so they're still to review him. It's complicated because the home are reporting that he doesn't want to be there so the DOLS team & safeguarding are involved.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Icy_Reply_7830",
                                                    "body": "I see. It will likely go to a section 21a to ultimately determine whether he is indeed better off/safer in 24 hr care. Good luck, I know it can be very upsetting for families.",
                                                    "score": 2,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "BackgroundGate3",
            "body": "My FIL went into a care home on end of life care. I have to say, whilst the premises were tired and dated, the staff were amazing. They made sure he was washed and dressed, even though he was mostly in bed, and got his haircut. They encouraged him into a wheelchair to sit in the lounge where there were various activities. He mostly didn't want to do anything but did agree when a couple of dogs were brought in to meet the residents as he'd always had a dog. Unfortunately, he was very reluctant to do anything other than stare at the TV, but that was a choice he made, not one imposed upon him. I took him a newspaper every day, but he didn't look at it, despite having always read one at home. Although he was dying, he didn't consider himself to be like the other old people who didn't have their faculties as he was still of sound mind, so he didn't want to spend time with them.",
            "score": 8,
            "replies": [
                {
                    "author": "Behavingdark",
                    "body": "I understand obviously it's down to the persons interests , dad is in the lowest floor of the home with I guess the worst of patients ,now the place is spotless and the food amazing but it's the activities or lack of that bothers me , no exercises or chatting ,it's TV the whole time , activities are on a different floor , there are 2 carers in here just chatting about their lives ,I come alot and not many others visit tbh but my god it's boring ,everyone just sleeps .",
                    "score": 3,
                    "replies": [
                        {
                            "author": "trysca",
                            "body": "My mum (76) has a reasonable fear of care homes and very much wants to be in her own home. She doesn't want to go out  and spends most of her day sleeping, looking at her tablet, watching TV and eating junk. I'm afraid a large part of it is just elderly people have no more energy or interest in life.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "trysca",
                            "body": "My mum (76) has a reasonable fear of care homes and very much wants to be in her own home. She doesn't want to go out  and spends most of her day sleeping, looking at her tablet, watching TV and eating junk. I'm afraid a large part of it is just elderly people have no more energy or interest in life.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Longlostneverland",
            "body": "I worked night shift in a care home and went in once on a day shift as I had left my charger. There was 6 call bells buzzing so I went to find staff (I expected there was 6 call bells because there was an emergency that required all staff ect) anyway I went to find out what was happening and then I found all the staff sat in the lounge including the manager. They had tables of McDonald’s, pizza and kfc and was alls at the tables, eating and on their phones. There was residents in chairs slipping half out of them or their head in a funny position and they had no food or drinks while staff was eating in front of them. As soon as they saw me a few of them jumped up to get the call bells. There are a few good ones but most work there because you need no qualifications or training and they will have anyone just to fill the shortages.",
            "score": 7,
            "replies": [
                {
                    "author": "Behavingdark",
                    "body": "My God what's humanity come to? I've never felt so low in my life ,every time I leave I'm filled up with tears , how awful to wish your parents would die quickly? But that's how I feel .",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "lesloid",
            "body": "Are you in England or Scotland? You can make a complaint to the CQC in England or CI in Scotland they are the bodies responsible for monitoring the quality of care and support in care homes",
            "score": 6,
            "replies": []
        },
        {
            "author": "Traditional_Sky_6358",
            "body": "Detail everything and contact the manager directly by email so that you have a paper trail. in addition to that contact CQC.",
            "score": 4,
            "replies": [
                {
                    "author": "Behavingdark",
                    "body": "That's great advice thank you so much .",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Traditional_Sky_6358",
                            "body": "I work in that field and so it's very important to document everything. Check via the CQC website when they were last inspected and what the results were and the overall grading. Speak with the nurse on duty next time you're in or the manager and ask them very direct questions with regards to entertainment, activities and the expectation of residents being supported to move around the home. If you are NOK/have legal authority etc ask to see the notes written about your Father.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "sweetvioletapril",
            "body": "This is awful. Is it also a nursing home, or care only( there is a difference)?\nIs he able to pay for his own care? Have you had a proper assessment by a social worker, and nursing staff ( if he was previously in a hospital)? Does he qualify for nursing care? That can make a difference in getting financial help.\nSadly, too many homes are poor, but, there are some good ones around, so don't give up hope. \nNo decent home will have carers sitting doing nothing like this. Who manages the home? It is not an easy job, but, there are caring carers out there, even if they are poorly-paid and not always treated well. \nNo home will ever replace what he had, and it is a sad fact of life that dementia care especially, is particularly challenging requiring additional staff and measures. It is usual for home managers to assess the patient to see if their needs can be met.\nIt can be hard to recruit and maintain staff, as it is a hard job, and the best homes often have a waiting list, but don't be put off. Speak to his social worker. I wish you luck.",
            "score": 5,
            "replies": [
                {
                    "author": "Behavingdark",
                    "body": "Thank you so much for your reply ,I feel so ashamed I'm not caring for dad ,he wants to die ,it's clean here and food is good but they have 2 TVs on that are not in sync and staff just sit watching it  ,it's dinner time now and 2 of the ladies are still there since breakfast,there are no exercises or chatting , activities are upstairs with more able residents ,at £1200 a week I would at least hope that someone sits and chats with him , he just got given a roasting hot cup of tea and nearly covered himself with it ,I've had to get more milk ,surely that's just common sense ?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "sweetvioletapril",
                            "body": "The hot tea is careless to say the least. Carers are supposed to have a minimum of training. Is this a care or nursing home? Nursing homes are required to have a registered nurse on the premises, who is professionally accountable.\n\nDo not feel guilty about not being able to care for your dad. Dementia, especially as it worsens, is terribly hard for family to cope with, and it will make you ill. I say that as a retired nurse.\n\nSpeak to the manager about your concerns, and gauge their reactions. Unfortunately, the best homes often have a waiting list. If you are really unhappy with the home ( and self-funding), try visiting others to see how they compare. Not all homes will accept any patient though, they generally carry out an assessment to see if they think they will be able to meet their needs. There are good homes out there, though of course they are pretty expensive, and tend to retain the better carers. Nowhere is ever going to be as good as home, but, if the carers are treated reasonably, they tend to stay and build a rapport with patients. Caring is everything.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Behavingdark",
                                    "body": "Thank you for replying ,it's part care part nursing home but dad's section is on the ground floor ,,it's not the floor they show you when you look around put it that way , they aren't cruel or hurt him it's the part you can't pretend or buy ,people who are great carers are a special kind of someone ,they have empathy and treat the person like family ,sadly I have yet to find a single carer like it.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "kinellm8",
            "body": "Hey OP, I’m sorry you are having these issues. We had to put my mum in care, she also had Parkinson’s, Alzheimer’s and vascular dementia.\n\nThe first home was a dementia home, it was outstanding rated. Within the first week mum had a fall (she had many actually) and was left on the floor for 9 hours while they waited for an ambulance. Mum was very agitated and confused in this home, she didn’t understand why she was there and she really didn’t enjoy it. She started wandering into other rooms and poking people with her stick (😅), and within a week the care home had declared they weren’t able to care for her (she really wasn’t that aggressive, so fuck knows what they do when they get someone who is). \n\nSo we moved her to another one, also ‘outstanding’, but not a specific dementia care home. We explained fully the current situation, we were extremely worried that the exact same thing would happen again. They reassured us that they’d be able to cope. 2 weeks later we moved her again for the same reasons (by this point my sister and I were getting very annoyed at the care homes). \n\nFinally we found another one, 25 miles away but the only outstanding rated one left that looked decent. This one turned out to be a lifesaver. The staff were lovely, and a few of them really took a shine to mum. There was outside space, they organised activities and they’d regularly take the residents on walks and trips. Food was ok, staff levels were adequate. She was there for a couple of years before she had a stroke and passed away a week later, in the care home. \n\nSo I guess one answer is be prepared to move him to another home. This is probably easier if self-funding (although all of these homes did accept council funding). It’s incredibly stressful and not something to take lightly, but I’m so pleased we moved mum. She had as dignified a time as possible in the circumstances and the carers were lovely. \n\nI don’t know where you are but this was in Rugby. \n\nI would say also though that it does take some getting used to these places. They’re not exactly the Ritz in general, and there are some very frail people there (obviously!). They tend to be understaffed (with underpaid workers), and they have a very difficult job to do. Maybe visit a couple more and compare them now that you’ve got some experience of what one looks like. \n\nGood luck, it’s not easy.",
            "score": 3,
            "replies": [
                {
                    "author": "Behavingdark",
                    "body": "Thank you for replying,I'm in Northamptonshire , this is the second home actually ,the first one they put him in was after a stay in hospital,they didn't even tell us they'd put him in a home ,when me and my mum went to visit his bed was empty and we thought he had died , for a whole year it's been a living nightmare , I look at my dad and just think I've absolutely let him down , I'm there nearly every day as I don't feel I can trust them when I'm not there ,he's had 6 falls this month and tells me he feels bullied , I do feel abit duped ,when they showed me round I was told what now appears to be some lies ,it looks great but alot of the \"activities\" foot care ,hair care etc does not appear to be there ,I will do all the talking to management and then decide what to do next , it's funny isn't it health care does everything to help us live longer but then when you get old alot of help kind of disappears.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "kinellm8",
                            "body": "I know how you feel, it’s so difficult but try not to feel guilty — it’s not your fault any of this (although I know exactly what you mean). \n\nThe falls are so difficult to handle, my mum was the same. Issue is they don’t understand that it’s dangerous to get up and walk about, they get bored or want something doing, so they try to do it and… 🫠\n\nThey gave her a chair but she’d just get out of it all the time. In a perfect world there’d be someone with them 24/7, but it’s just not financially possible. That sort of care costs extortionate amounts, so they just have to do their best. I had all the same concerns about trusting the carers etc, but to be totally fair I never once saw anything I found questionable (and I was there a lot, when they weren’t expecting me sometimes as well). \n\nIt’s hard to know what’s ’normal’ (I guess the point of your post really?) when you’ve never dealt with it before, but looking back I’d say you get a feeling when things aren’t right. The first 2 homes mum was in were totally inadequate, but it’s only with hindsight that it’s so obvious.\n\nThey might struggle to provide all of the activities etc, and we found we had to keep on at them about things like toe nails and hair cuts (shouldn’t be the case, but advocating for them really helps), but other than moving them to a different home or doing what you’re doing now (visiting as much as you can) I don’t know what else you can do.\n\nIt was undoubtedly one of the hardest things I’ve had to deal with, and the final 2 weeks after the stroke were brutal and I hope I never have to do anything like it again, but it showed me that the care home staff did actually care (we all cried together more than once), and two of them even came to the funeral. \n\nIs the manager any good? We found the manager to be very helpful and approachable in our case. If we had issues she was happy to listen and try to address them. Makes a huge difference. If you’re not happy with the care, they might be the person to talk to initially.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Future_mrseurope151",
            "body": "Unfortunately they're run for profit and a lot of the people doing the actual care are on minimum wage.",
            "score": 2,
            "replies": [
                {
                    "author": "Behavingdark",
                    "body": "Minimum wage shouldn't mean you can sit by and watch elderly people waste away in front of your eyes though surely .",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TonyBlairsDildo",
            "body": "Care ought to be professionalised in the same vein as midwifery and nursing. It won't though, because to pay £45,000 to a professional carer, and increase staffing ratios such that they offer actual decent care would essentially bankrupt the country.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Otherwise-Extreme-68",
            "body": "Understaffed, the staff that are there are underpaid and the heating is always turned up too high",
            "score": 1,
            "replies": [
                {
                    "author": "Behavingdark",
                    "body": "True but the place is perfect it's clean ,nice temp ,staff can get drinks and toast etc when they want sit and watch TV , it's the little extras they can't seem to do , there is a craft room but I've never seen it used , residents are bored to tears .",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "IndelibleIguana",
            "body": "Care homes are a disgrace. Run for maximum profit, minimum outlay. It shouldn't be allowed.",
            "score": 1,
            "replies": [
                {
                    "author": "Behavingdark",
                    "body": "I could cry ,I feel guilty and a let down , the place is clean but my god it's boring ,dad just wants to die .",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Sudden-Possible3263",
            "body": "Get  cameras and secretly record them, gather as much evidence as you can and send it to your MP publicly.\nIt shouldn't be like this\nComplaining through the official channels won't do much, it'll all be noted then covered up and swept under the carpet.",
            "score": 1,
            "replies": [
                {
                    "author": "Icy_Reply_7830",
                    "body": "As much evidence of what exactly? While I sympathize with OP, what they have seen is no activities- they could be doing an activity elsewhere in the home/out on a trip. Two ladies sat at the breakfast table for a few hours- we don’t know whether this is their choice. The TV is too loud- too loud for who? \n\nStaff shrugging isn’t great but advising hidden cameras and cqc notifications? Why not speak to the manager first.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Sudden-Possible3263",
                            "body": "If this home is like this in front of visitors what's going on when they're not there?\n\nCameras should be in all homes and even audio recordings when cameras wouldn't be appropriate. \nAny carer with nothing to hide would have no problems with cameras being there, not to watch them, to protect the resident.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Icy_Reply_7830",
                                    "body": "You didn’t answer the question, if the home is like what? I don’t see what would make you assume that a cqc notification and recording devices would be necessary in response to what OP observed. A conversation with the nurse/person in charge or manager would suffice in this instance. \n\nI disagree with the “if you’ve got nothing to hide” argument. It’s an infringement on everyone’s privacy. Do you think this would attract more people to the role of a care worker? They are on minimum wage, work 12 hour shifts of backbreaking, often mentally challenging work, now you want them recorded 24/7 because you seem to think that they are all abusers.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Sudden-Possible3263",
                                            "body": "If you read my comments you'll see exactly why I said record, I've worked in homes, witnessed abuse, reported that abuse and management don't care, I've seen residents moved without the sheets causing bruises on the residents. \nPeople dying alone and carers on their phones, not during a break, residents forced to do things for the carers convenience, and certainly not person centred care as advertised, buzzers ignored, some terrible attitudes. Infection control was non existent\n\nThis was all in a highly rated home too, they'd fight to have any negative reviews deleted. \n\nCQC aren't any better, Inspections are very rarely unannounced, I'd say I've seen 2 in all the years I worked in this one and we'd know in advance when they'd be happening because they warned you, management would go all out to prepare for them. \nI've seen so many  terrible things go on, managemt would  send out email reminders to remind carers to follow policy when reported. \nWithout video proof it's your word against the abusers, there is no proof of what goes on. \nWhat I've seen is so bad I refused to have my mother in one when she was dying of cancer. I've helped look after uncles and aunts in their last year's at home rather than trust local care homes. \n\nYes some carers are amazing, I said that in my reply, not once did I say they're all abusers, plenty of them are not, some are just there for the wage, and it's a choice between work in a care home for minimum wage or in the local factory for minimum wage where I live. \nI could say so much more but don't want to be identified as investigations are still going on. \nThe carers where I worked at were not all there because they care, some places don't have many job options. \n\nI know there's a shortage I'm still in a similar role, thankfully it's way more transparent. \nYou're right that something needs done, care homes went downhill back when they removed  the matrons and nurses and put in pen pushers who are more concerned about profit",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Icy_Reply_7830",
                                                    "body": "You say everything in your first paragraph happened in a highly rated home, do you mean this all happened in the same home? I’m asking because you sound as though you have had a bad experience and now think every home is like this. They’re not. \n\nThe LA announce their inspections, CQC do not, unless it is a follow up visit. \n\nCQC and management don’t care? So who is conducting these investigations that you say are still going on? Did you go to the police?",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Behavingdark",
                    "body": "I got a camera for his bedroom as he's had 5 falls in a month ,they found it and confiscated it ,said I need permission ,which I will get but it's caused a vibe around me if you get what I mean.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Sudden-Possible3263",
                            "body": "Sounds like they're hiding something, as long as it's not in his bathroom or where there's personal care they can't really touch it, you should try and get another one but hide it better, look into laws where you are, see what they say about it. \nI'd be very worried because they confiscated it. What are they hiding",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Behavingdark",
                                    "body": "Dad says they bully him at night and laugh at him , but I do have to be honest dad isn't keen on alot of foreign people especially if he doesn't understand them and thinks they must be talking about him if he can't understand and there is an awful lot of foreigners there good and bad ,sigh I feel so tired .",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Sudden-Possible3263",
                                            "body": "You should try and get some evidence, I've seen residents tell families before and they put it down to dementia and how they're imagining it, nothing untoward would be happened in front of nurses or management, the bad ones knew it was wrong. \nThat place I worked there were a few amazing carers but the bad ones were awful, all of them were related, they shouldn't even have been on the same shifts but we're due to staffing being low,  they'd treat some of the residents awful, not always physical, more mocking and impatient with them, ignoring their wishes, speaking their own language at the resident even though they weren't supposed to. \nIgnoring buzzers because it was a certain resident. \nWhen I complained or reported it, they'd all deny it, it was their word against mine. \nI left as it was a terrible place to work, but I went to the families before I did as the management didn't care when it was reported, they'd pretend they did, they'd take notes and they'd send emails reminding all staff of the policies and procedures that needed followed, none of them got warnings or disciplined over anything. \nThey'd be moving residents without the sheets and the resident would have bruises, \nI'd seen a resident have 2 carers dragging their clothes off and showering them even when they were refusing, there would have been no harm in the resident missing one shower, they were able to wash with prompts, but things were done to make the carers life easier. \nEverything was covered up or minimised till the family caught it on camera. \n\nHopefully your dad isn't  being abused as the majority of carers are good,, but take it serious, just incase there is any truth in it. You can get cameras that look like light bulbs or photo frames or whatever cheap online\nIt infuriates me how anybody can hurt somebody vulnerable.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}