{
    "title": "Those adverts in the 80s suggesting you will immediately die if you touch a light switch with wet hands. Did anyone ever get a shock from doing this?",
    "author": "GabberZZ",
    "subreddit": "AskUK",
    "rank": 6,
    "score": 85,
    "upvote_ratio": 0.91,
    "num_comments (reported by reddit)": 137,
    "url": "https://www.reddit.com/r/AskUK/comments/1jeapi1/those_adverts_in_the_80s_suggesting_you_will/",
    "id": "1jeapi1",
    "selftext": "OK they didn't say you would immediately die but as a kid it put the fear of god in me so I don't do it even to this day, 40 years later. ",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "**Please help keep AskUK welcoming!**\n\n- When repling to submission/post please **make genuine efforts to answer the question given**. Please no jokes, judgements,  etc.\n\n- **Don't be a dick** to each other. If getting heated, just block and move on.\n\n- This is a strictly **no-politics** subreddit!\n        \nPlease help us by reporting comments that break these rules.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskUK) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Unfair_Original_2536",
            "body": "I died getting a kite off a pylon, wish I had listened to those films.\n\nI got better though.",
            "score": 173,
            "replies": [
                {
                    "author": "Bobrock99",
                    "body": "I don’t even want to get into that time I got into a van to see some puppies…",
                    "score": 22,
                    "replies": [
                        {
                            "author": "moofacemoo",
                            "body": "I died because I smoked a fag that a stranger offered me. I had the opportunity to say no bit instead said yes. Before you know it was at the Whitehouse smoking sone weed on the roof and was promptly arrested. Some people eh?",
                            "score": 9,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Acrylic_Starshine",
                    "body": "I died being careless around deep water.",
                    "score": 37,
                    "replies": [
                        {
                            "author": "StingerAE",
                            "body": "And now you've reminded me how many kids might have been protected if he hadn't managed to somehow scrabble to the bank.",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "OrganizationOk5418",
                            "body": "Kids love it",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "SidneySmut",
                            "body": "I boiled a kettle on a boat.",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "369_Clive",
                            "body": "The hooded / cloaked death figure that accompanied those ads was, as a kid, terrifying 🙈",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Soapy212",
                    "body": "I died carrying my 30ft fishing rod upright under a power cable.. i definitely won’t make that mistake again!",
                    "score": 13,
                    "replies": []
                },
                {
                    "author": "TravellingChefAmy",
                    "body": "I died playing on the railway tracks",
                    "score": 12,
                    "replies": [
                        {
                            "author": "Traditional_Rice_660",
                            "body": "Nah, you lose your feet playing on rail way lines, and have to spend the rest of your life staring forlornly at your old football boots",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "crucible",
                            "body": "Sports Day or regular “lost your football boots” ?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "spinachjuggler",
                    "body": "Were you turned into a newt?",
                    "score": 9,
                    "replies": []
                },
                {
                    "author": "nineJohnjohn",
                    "body": "I died cause I got sucked into quicksand",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Artistic_Train9725",
                            "body": "I kicked a football onto an electricity transformer station.\nStraight up brown bread.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "Munchkinpea",
                            "body": "I was eaten my piranhas in the bath.",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Aburlypad",
                            "body": "I always thought quicksand was going to be a lot more problematic growing up than it actually is.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Royal_View9815",
                    "body": "I died cos I told the green cross code man to shit off!! I never saw that bus coming!!",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "GabberZZ",
                    "body": "Was that shortly after going fishing near power lines?",
                    "score": 6,
                    "replies": []
                },
                {
                    "author": "tilt",
                    "body": "I died because I went off somewhere without telling my mummy.",
                    "score": 6,
                    "replies": [
                        {
                            "author": "crucible",
                            "body": "Ignored the fucking cat, yes?",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Suspicious_Field_429",
                    "body": "I died after being stuck in a fridge",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "accio_ballbag",
                    "body": "Those adverts scared the bejusus out of me\n\nhttps://youtu.be/7-qRbUrz4nw?si=ZfKuEKV8-YvwOlKo",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Professional_Base708",
                    "body": "I lived on a farm. I died in several different ways.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Bigluce",
                    "body": "I tripped and fell into a building site hole, slicing my scalp off on the corrugated piling, and dying at the bottom.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "crucible",
                            "body": "I get that reference",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Bigluce",
                                    "body": "That video still gives me the heebeejeebees to this day.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Active-Strawberry-37",
            "body": "Those who did are not here to tell the tale",
            "score": 36,
            "replies": [
                {
                    "author": "rev-fr-john",
                    "body": "Yes I am, you don't aways die from an electric shock which is just as well because I'm getting to double figures in that department,  I once managed twice in the space of 10 minutes.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "GabberZZ",
                            "body": "If you're not an electrician maybe you need to go rewatch those electrical safety adverts I referred to!",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "CodeToManagement",
                                    "body": "I mean if he is an electrician maybe time to think of a career change too",
                                    "score": 30,
                                    "replies": []
                                },
                                {
                                    "author": "rev-fr-john",
                                    "body": "In my role as an electrician I've never had a shock,  the common one is wet hands and electrical equipment,  the two in ten minutes was while laying under a digger welding it, I grabbed the machine a got a full whack, I assumed it was from the welding lead so rearranged that  and went to move and it happened again,  but now I knew it was from the machine. In the work shop an angle grinder lead was resting on the ground connector for the welder,  it's uninsulated but had got hot and melted the grinder lead which livened up the digger.  It was while looking at that when I remembered by passing the RCD that covers the workshop and the breaker for the welder many years ago, I finished the work on the digger then ordered a new RCD and a couple of breakers for the workshop,  hopefully just having them will be enough because I don't remember actually fitting them.\n\nThe more recent one was work related,  a friend brought an oven over because it kept shocking them, I rewired it despite it not showing any  serious faults and it tested better but I wasn't convinced,  so I took it back to them and they cooked in it without issue,  later in the evening it shocked his wife, without anyone touching it it showed 150 volts that dropped to 70 immediately when you touched it and gradually dropped to 50ish,  then it suddenly went to nothing and stayed there, testing regularly over the next few hours showed nothing,  it was as I was leaving that as I hugged his wife we both got a massive shock at the front door!\n\nWe then spent a couple of hours theorising and testing all sorts of random things, it turned out to be cracked worn insulation on a central heating pump making the electrical bonding live, unfortunately the electrical bonding wasn't connected to the incoming earth but the earth rod was. Network power sorted the earth situation but did advise on the bakerlite switch gear and fuse holders.",
                                    "score": 9,
                                    "replies": []
                                },
                                {
                                    "author": "CodeToManagement",
                                    "body": "I mean if he is an electrician maybe time to think of a career change too",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "GabberZZ",
                    "body": "But their friends and family are.. Unless ignoring dire TV warnings runs in the family.",
                    "score": 15,
                    "replies": []
                }
            ]
        },
        {
            "author": "crgoodw",
            "body": "Never got a shock but remember the adverts. \n\nWe had an electrician come to mend our fuse box one morning last year, who cheerfully informed us that our house was not earthed properly and if we'd have plugged anything in that caused the socket to spark we would have been dead instantly. \n\nUK Power Networks were out the same day to fix it. \n\nIt took me a while to go anywhere near the plug sockets for a bit, even with dry hands.",
            "score": 32,
            "replies": [
                {
                    "author": "GabberZZ",
                    "body": "There was a pub in my town years ago that if you touched the fruity and the radiator at the same time you got a pleasant tingle through the arms. Guess they weren't properly earthed either!",
                    "score": 22,
                    "replies": []
                }
            ]
        },
        {
            "author": "_Planemad_",
            "body": "I still avoid doing it, just in case.",
            "score": 16,
            "replies": [
                {
                    "author": "baechesbebeachin",
                    "body": "Me too, and anytime I've accidentally done it, I genuinely think I've had a lucky escape.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "GabberZZ",
                    "body": "Effective campaign...",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Individual_Wallaby25",
            "body": "I did actually get a shock like this once.\n\nIt's not as bad as the time I put my head out of the train window though.\n\nMade a real mess.",
            "score": 17,
            "replies": [
                {
                    "author": "stevielfc76",
                    "body": "Did you make University challenge though?",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Individual_Wallaby25",
                            "body": "Scumbag College!!",
                            "score": 6,
                            "replies": [
                                {
                                    "author": "stevielfc76",
                                    "body": "A man of culture!",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "Individual_Wallaby25",
                                            "body": "Lol, probably just my age tbh!",
                                            "score": 2,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "PepperOld8037",
                    "body": "Bambi?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Individual_Wallaby25",
                            "body": "I honestly didn't have this in mind when I wrote that comment!\n\nI was thinking of the horrific videos they showed us in school in the late 80s.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "PepperOld8037",
                                    "body": "I was born in 92 and legit thought you were referencing that haha",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Individual_Wallaby25",
                                            "body": "Haha!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ok_Monitor_7897",
            "body": "Yes I did. Not enough to do anything bad but enough for me to go \"shit, that was stupid. Not doing that again!\"\n\nEdit: to confirm, I did not die!",
            "score": 27,
            "replies": [
                {
                    "author": "Aprilprinces",
                    "body": "Are you sure? Maybe you need to see your GP?",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Ok_Monitor_7897",
                            "body": "I'm fairly sure I didn't die 😃 (unless all this is purgatory!)\n\nIt was about 15 years ago, I think my GP might give me side eye if I asked for a check now!",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Aprilprinces",
                                    "body": "Better safe than sorry, you never know with these things",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "adezlanderpalm69",
            "body": "I knew someone who almost died cutting their toenails with a scythe",
            "score": 9,
            "replies": [
                {
                    "author": "Tonythepillow",
                    "body": "The passengers on their bus were pretty terrified too!",
                    "score": 7,
                    "replies": [
                        {
                            "author": "adezlanderpalm69",
                            "body": "You were there too Tony.    👍",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "adezlanderpalm69",
                            "body": "You were there too Tony.    👍",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "adezlanderpalm69",
                            "body": "You were there too Tony.    👍",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Dedward5",
            "body": "I’m Never going to mix cross ply and radial tyres and then drive over a rug on a polished floor that’s for sure.",
            "score": 5,
            "replies": [
                {
                    "author": "Muffinshire",
                    "body": "You might as well set a man-trap!",
                    "score": 3,
                    "replies": [
                        {
                            "author": "nwr999",
                            "body": "I remember the man trap one well, creeped me out as a child:\n\n[man trap!](https://youtu.be/iIoL0PDaxtQ?feature=shared)\n\nSo weird someone actually thought it was a worthy investment to make such an advert.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "dogegg55",
            "body": "A swan never broke my arm",
            "score": 5,
            "replies": [
                {
                    "author": "GabberZZ",
                    "body": "Yet!",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "nick--2023",
            "body": "Yes, I was shocked and flung out of an open window before bouncing of an electric sub station, hitting an over head power line on the train track and then drowning in a canal before being enticed into a car by a stranger who forced me to smoke ten B&H.",
            "score": 6,
            "replies": [
                {
                    "author": "GabberZZ",
                    "body": "But did you look left and right as you bounced across the road as advised by a tall man or a small squirrel?",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "x0xDaddyx0x",
            "body": "I've done it before but I shouldn't have bothered as drying my hands would have been less effort than changing my pants.",
            "score": 5,
            "replies": []
        },
        {
            "author": "nolinearbanana",
            "body": "Yes - which surprised me as there's quite a gap between the plastic of the switch and anything actually live, but I guess my hands were wetter than i expected. RCD in operation meant it was a very light shock.\n\nI've had worse - two 240V shocks from an old fused system when I was a kid. (Fuses react a LOT slower than MCB's never mind RCD's). First was when we had the new bathroom fitted - fitters had removed the old light switches and replaced with a hang cord, but they hadn't disconnected the original wires. Feeling up the wall for the usual switch, not knowing they'd been removed I jabbed my finger on the end of the live wire which both broke the skin and then threw me across the room. Second time was unplugging a particularly stiff plug and my fingers went underneath it while it was still live - days before they coated the pins to prevent this from occurring.",
            "score": 4,
            "replies": []
        },
        {
            "author": "TheCannyLad",
            "body": "Someone at my school got a zap off a light swtich this way, ended up in hospital, they were OK though. This was nearly 40 years ago, though.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Martipar",
            "body": "No. I did get a shock with dry hands though, due to a wiring fault the screws in a couple of light switches at work were live at 115V, so half cycle related or something. I don't know, i can't recall exactly, it's what the electrician said the next day. \n\nEither way it gave a bit of a tingle but nothing deadly which is why i went touching the other screws (not a joke) to see which others were affected. There was only one other with the same effect.",
            "score": 3,
            "replies": [
                {
                    "author": "coldestclock",
                    "body": "I was just thinking that light switches probably wouldn’t carry the voltage to do any damage. Not like they have to serve variable appliance demand like the proper plug sockets do.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Martipar",
                            "body": "They switch 240V, the only reason the screw was live at 115V was due to the nature of the fault. Had it been a different fault it totally could've been 240V.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Conscious-Ball8373",
                            "body": "Light switches carry the same voltage as everything else in a domestic installation (at least in this country; in the United States you get some things at 120V and some at 240V).  A light circuit will usually be rated for a lower current than a circuit with sockets on it, but it is stil ample to kill you.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "richdrich",
                                    "body": "Yeah, people worry about cooker cables and not about a USB adaptor, but it's 240v just the same.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "concretebeagle",
            "body": "I’m still stuck in that dumped fridge.",
            "score": 3,
            "replies": [
                {
                    "author": "GabberZZ",
                    "body": "At least you'll survive the impending nuclear war.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "CalligrapherTop2202",
            "body": "Not from wet hands in a light switch, but I certainly got a nasty one when I tried to clean a plug socket with a wet sponge (commercial kitchen, sous chef assured me it wasn't wired into anything. He was incorrect on this 😬)",
            "score": 3,
            "replies": []
        },
        {
            "author": "difficult_Person_666",
            "body": "“Ey Brian, I can smell gas!” Was one of my faves…\n\nhttps://m.youtube.com/watch?v=yRTo8j9203I&pp=ygUdR2FzIGFkdmVydCB1ayBicmlhbiBleHBsb3Npb27SBwkJUQkBhyohjO8%3D",
            "score": 3,
            "replies": [
                {
                    "author": "crucible",
                    "body": "Lad from Allo Allo. Betorelli?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "tango101-official",
            "body": "Had a leak in the bathroom l, which ran down the wall into the switch. Which I didn’t know until went to turn the light off (which only had a weird glow). Then realised why it was half on after getting a good jolt off the mains…. Was about 18 at the time.",
            "score": 2,
            "replies": [
                {
                    "author": "GabberZZ",
                    "body": "You do know when you take a leak you're supposed to do it in the toilet... Or shower.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "tango101-official",
                            "body": "Weird… but does that explain the weird looks I get??",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "clizzle19",
            "body": "I went fishing once but never got electrocuted as I didn't have an 80ft rod",
            "score": 2,
            "replies": []
        },
        {
            "author": "Crafty_Birdie",
            "body": "Yes. It was just enough to remind me not to do that again!",
            "score": 2,
            "replies": []
        },
        {
            "author": "ClearWhiteLightPt2",
            "body": "I got a full on 240v mains shock once. Everything went white for a second and i was thrown clear of the plug and socket so the charge halted.",
            "score": 2,
            "replies": []
        },
        {
            "author": "your_monkeys",
            "body": "I died after I told Charlie that he was an annoying ruddy cat",
            "score": 2,
            "replies": []
        },
        {
            "author": "crumpetsandteaforme",
            "body": "I died playing in quick sand once.",
            "score": 2,
            "replies": []
        },
        {
            "author": "creamcrackerchap",
            "body": "There were adverts? It wasn't just a phobia I conjured up? TIL",
            "score": 2,
            "replies": []
        },
        {
            "author": "Conscious-Ball8373",
            "body": "I think it's worth saying that on any modern electrical installation, the earth leakage detector will trip long before you're aware that you've been shocked, much less dead, and also that modern light switches make this type of hazard much, much less likely.  There are still plenty of older installations around though.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Jolly-Raspberry-9842",
            "body": "G",
            "score": 1,
            "replies": []
        },
        {
            "author": "Smeeble09",
            "body": "I've been electrocuted three times via mains supply, so imagine it'd hurt but wouldn't kill you.",
            "score": 1,
            "replies": [
                {
                    "author": "_FreddieLovesDelilah",
                    "body": "I think electrocuted means executed with electricity? Are you a zombie lol",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "WeeNell",
            "body": "I did. When I was 14 (1984), I put an electric heater on after a bath and got stuck to it, blacking out and shaking about from the shocks. \n\nSomehow, I managed to survive, although I've no idea how!",
            "score": 1,
            "replies": []
        },
        {
            "author": "WeeNell",
            "body": "I did. \n\nWhen I was 14 (1984), I put an electric heater on after a bath and got stuck to it, blacking out and shaking about from the shocks. \n\nSomehow, I managed to survive, although I've no idea how!",
            "score": 1,
            "replies": []
        },
        {
            "author": "huxberry73",
            "body": "No, but 5 year old me is happy to confirm that you do get thrown across the room if you put a corned beef key into a wall outlet. (It was 1978 and I'm probably the reason you can't shove stuff into them anymore...you're welcome)",
            "score": 1,
            "replies": []
        },
        {
            "author": "rumade",
            "body": "Our art teacher had us make safety posters for class as our first assignment in year 7, and this was one of the hazards she had us illustrate. To be fair, it was a 1960s building, so quite possibly had dodgy wiring.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mysterious-Stay-3393",
            "body": "Too busy trying to get out of quicksand.",
            "score": 1,
            "replies": [
                {
                    "author": "sega20",
                    "body": "I remember those adverts. Beware all of that quicksand in the town centre.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Greetin_Wean",
            "body": "I went swimming in a reservoir and drowned, not doing that again",
            "score": 1,
            "replies": []
        },
        {
            "author": "need_a_poopoo",
            "body": "I'm pretty sure I remember an episode of Brookside where this happened. I'm still very careful to this day to not touch light switches with wet hands.",
            "score": 1,
            "replies": []
        },
        {
            "author": "nick--2023",
            "body": "Yes, I was shocked and flung out of an open window before bouncing of an electric sub station, hitting an over head power line on the train track and then drowning in a canal before being enticed into a car by a stranger who forced me to smoke ten B&H.",
            "score": 1,
            "replies": []
        },
        {
            "author": "nolinearbanana",
            "body": "Yes - which surprised me as there's quite a gap between the plastic of the switch and anything actually live, but I guess my hands were wetter than i expected. RCD in operation meant it was a very light shock.\n\nI've had worse - two 240V shocks from an old fused system when I was a kid. (Fuses react a LOT slower than MCB's never mind RCD's). First was when we had the new bathroom fitted - fitters had removed the old light switches and replaced with a hang cord, but they hadn't disconnected the original wires. Feeling up the wall for the usual switch, not knowing they'd been removed I jabbed my finger on the end of the live wire which both broke the skin and then threw me across the room. Second time was unplugging a particularly stiff plug and my fingers went underneath it while it was still live - days before they coated the pins to prevent this from occurring.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheRealDanSch",
            "body": "I wasn't shocked. Totally expected it based on the TV ads.",
            "score": 1,
            "replies": []
        },
        {
            "author": "em_press",
            "body": "Yes! A very steamy kitchen (Christmas pudding day), and I got a little pop off the light when turning it off. Made me sufficiently careful about hot and damp rooms now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Screaming_lambs",
            "body": "Nope. But I still try to no touch light switches with damp hands.",
            "score": 1,
            "replies": []
        },
        {
            "author": "The_Salty_Red_Head",
            "body": "I didn't die, but I did get flung backwards and couldn't use my right arm for the next 24 hours or so. \n\nI was scrubbing the walls of the old wallpaper paste with water and a wooden scrubbing brush in my parents' 1940s home when I was 13/14 (I'm 47 now, so it was a while ago.)\n\nAs I got to a corner, I noticed an empty plug socket was switched on and thought, 'I'd better switch that off. It could be dangerous!' But knew that I shouldn't touch it with my hands because that was silly. So, to be safe, I used the soaking wet wooden scrubbing brush I had my hand. \n\nIt literally launched me backwards with a loud popping sound. Luckily breaking the connection. I think my brain switched off for a second. As I came to, I was on my back looking at the ceiling with my arm flung straight out like I was pointing up above my head behind me. It hurt. A lot. I twisted myself upright and had to kind of grab my right arm with my left arm and pull it up and over. I promptly burst into tears. \n\nNeedless to say, I have been a whole lot more respectful of electricity ever since.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Houseofsun5",
            "body": "I got out the shower, and leaned down to turn up the electric radiator in the hall, the Labrador had smashed the cover off the switches with it's meaty Labrador tail ...that sent me across the floor and against the wall with two holes burnt in the end of my fingers.",
            "score": 1,
            "replies": []
        },
        {
            "author": "IsWasMaybeAMefi",
            "body": "It was a long storyline in Brookside..",
            "score": 1,
            "replies": []
        },
        {
            "author": "Anfa34",
            "body": "Did charlie say...",
            "score": 1,
            "replies": []
        },
        {
            "author": "reallydeleted",
            "body": "I have been shocked by my bedroom light switch with dry hands",
            "score": 1,
            "replies": [
                {
                    "author": "GabberZZ",
                    "body": "You might want to get that checked out unless you're one of the X-Men",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "55caesar23",
            "body": "Yep. Got a belt from the switch in the garage at my mum and dad’s old house. Hurt quite a bit, felt like all the muscles in my arm tensed up at once, tips if my fingers were numb for a good minutes",
            "score": 1,
            "replies": []
        },
        {
            "author": "Thestolenone",
            "body": "My mother did back in the 70's, flicked a switch with wet hands. I don't think it was worse than touching an electric stock fence. She didn't get thrown across the room or anything.\n\nEdit I remember I did too. My kids were little shits and thought it would be fun to flush a used nappy down the toilet. There was water flowing out of the ceiling and down the walls and out of a light socket. I went to mop it up without thinking. Again just like touching a stock fence, nothing more serious.",
            "score": 1,
            "replies": []
        },
        {
            "author": "letsalldropvitamins",
            "body": "Short answer, yes. Wearing wet gloves on a building site, was assured all power was off, turned a light switch off as I left a room in the house we were remodelling out of habit and got zapped. Don’t feel lethal tho",
            "score": 1,
            "replies": []
        },
        {
            "author": "VastYogurtcloset8009",
            "body": "I remember as a very small child playing with a wall socket in my bedroom. It was circular so not sure what it was, remember prodding my finger into it continuously. Next thing I felt like I'd been sucked into it, everything felt fuzzy and I woke up on the other side of the room. I thought it had sucked me in and spat me out of another socket at the other side of the bedroom. Neither parent bothered to come upstairs to check on me. I never put my fingers in it again.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Kirinis",
            "body": "Sparky here (US)... the only and I mean ONLY way you'll get shocked from that... is if the switch is missing (or severely broken and pieces missing) and you're touching bare contacts to turn it on or off. Switches are designed to be safe in normal operations. Hell, we put them in our bathrooms. US code doesn't have a requirement (other than using common sense) on how close a switch can be placed to a water source. \n\nSo no, you shouldn't EVER get shocked by one unless it's bad. In that case, you'd be shocked either way.",
            "score": 1,
            "replies": [
                {
                    "author": "GabberZZ",
                    "body": "Aren't your voltages half ours though? So feeble you can't boil a kettle?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Kirinis",
                            "body": "Higher amperage... volts don't kill.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "StillDrunk_Cx",
            "body": "Not by a light switch but 21 years ago i got shocked trying to turn my ps2 off by the wall plug after washing my hands was similar to a farmers electric fence shock",
            "score": 1,
            "replies": []
        },
        {
            "author": "Antique_Historian_74",
            "body": "I don't remember wet hands being an issue, but I do remember super dramatic STOP! adverts telling you never to touch the light switch if there was a gas leak.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OrganizationOk5418",
            "body": "Im currently locked in a fridge.",
            "score": 1,
            "replies": []
        },
        {
            "author": "APiousCultist",
            "body": "I think I actually might have had some minor one. Though I also think the switch in general might just have been prone to shocks. Hit it with my sleeve for years.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DiligentCockroach700",
            "body": "Almost every other country in the world allows light switches and power outlets in the bathroom. Nobody seems to die. My friend who lives in Austria has her washing machine in the bathroom. Apparently this is quite normal there.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Leicsbob",
            "body": "No but I did get a shock trying to get my stuck toast out of the toaster using a knife.",
            "score": 1,
            "replies": []
        },
        {
            "author": "oldskoolplayaR1",
            "body": "Penis in the waste disposal unit is the one that got me - don’t remember an ad for that",
            "score": 1,
            "replies": []
        },
        {
            "author": "Feggy",
            "body": "I too have a fear of switches though I do t remember the ad so perhaps it entered my sub-conscious. \n\nI did shock myself once when I switched on a lamp, but it didn’t come on. So I reached up under the shade to feel if there was a bulb in it - finger went right inside the lamp socket. Hurt a lot, like double the French electric fences I used to mess around with as a kid.",
            "score": 1,
            "replies": []
        },
        {
            "author": "purpleflavouredfrog",
            "body": "I did once.  It works best if you are barefoot on a well grounded floor surface.",
            "score": 1,
            "replies": []
        },
        {
            "author": "GregoireLeFrog",
            "body": "Light and sockets in bathroom is a surprise when moving to the UK. It’s not like the rest of the world dies in bathrooms all the time",
            "score": 1,
            "replies": []
        },
        {
            "author": "ClevelandWomble",
            "body": "As a student, I once went into our shared kitchen and went to turn the electric  kettle on at the wall switch (it was a long time ago). Some clown had previously left the kettle boiling with the spout pointing towards the switch. I only realised this after bouncing off the far wall. \n\nIt hurt like being kicked in the shoulder. Fortunately I never found out who left the switch full of water or I'd still be inside now.",
            "score": 1,
            "replies": []
        },
        {
            "author": "kevkevverson",
            "body": "This scared the shit out of me back in the day https://youtu.be/PoL3MjllVSs?si=pKMw8u3H1MxJLh8O",
            "score": 1,
            "replies": []
        },
        {
            "author": "ovine_aviation",
            "body": "As a 10 year old (1980) I had a train set. This had a transformer/controller that plugged into the mains. I'd kicked it somehow so the fixed power cable came out of the controller. Now I have a plug connected to a socket, a wire coming from the plug and 2 smaller wires on the end of shiny copper. I popped the 2 wires into my mouth and turned the plug on. I remember seeing just bright white and then opening my eyes to the most panicked and the loudest I'd ever seen my mother.\n\nI of course do not recommend trying this at all but on the back of it I'm a little less worried about damp hands and light switches. The irony may be that I had in my mind a Charlie Says advert about overloading sockets.",
            "score": 1,
            "replies": []
        },
        {
            "author": "_FreddieLovesDelilah",
            "body": "Yes I’ve had a few shocks from doing this. Just makes your hand go zap for a split second.",
            "score": 1,
            "replies": []
        },
        {
            "author": "capulet2kx",
            "body": "I died slipping on a rug on a freshly polished floor.  They might as well have laid a man trap.\n\nI had a ciggie and jogged it off though.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JoeyJoeC",
            "body": "I got a shock from a lamp with wet hands. Although it fell apart as I touched it. Didn't hurt, my hand just gripped it and I couldn't let go for what felt like several seconds but it was probably quicker than that.",
            "score": 1,
            "replies": []
        },
        {
            "author": "clizzle19",
            "body": "I went fishing once but never got electrocuted as I didn't have an 80ft rod",
            "score": 0,
            "replies": []
        },
        {
            "author": "clizzle19",
            "body": "I went fishing once but never got electrocuted as I didn't have an 80ft rod",
            "score": 0,
            "replies": []
        }
    ]
}