{
    "title": "I turned 32 today... ",
    "author": "LookHorror3105",
    "subreddit": "wholesomememes",
    "rank": 339,
    "score": 4489,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 211,
    "url": "https://i.redd.it/j1qie3e1aled1.jpeg",
    "id": "1eblkvt",
    "selftext": "",
    "comments": [
        {
            "author": "NoistMipples",
            "body": "How do people still think their 30s makes them old lmao. I think you qualify as old when you get the senior discount bruh not just cuz you got to 30.",
            "score": 219,
            "replies": [
                {
                    "author": "LookHorror3105",
                    "body": "Look, I agree with your comment, but I can't stop laughing at your u/ 😂",
                    "score": 88,
                    "replies": [
                        {
                            "author": "staytsmokin",
                            "body": "You'll be 70 and still laugh at shit like that and so will I. 😭",
                            "score": 35,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "CommodoreAxis",
                    "body": "I just watched a video where the climber Magnus Midtbø makes the insightful point of “when I’m 50 I’ll look back at 36 and say wow, I really wasn’t old yet”.",
                    "score": 26,
                    "replies": [
                        {
                            "author": "Sausage_fingies",
                            "body": "You're the youngest you'll ever be right now.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "ShrewLlama",
                    "body": "I'm 25 and I feel old sometimes. Old is relative.",
                    "score": 11,
                    "replies": [
                        {
                            "author": "sweetwolf86",
                            "body": "I remember when Windows came out and we had to learn how to use a mouse. Am I old yet?",
                            "score": 4,
                            "replies": []
                        },
                        {
                            "author": "staytsmokin",
                            "body": "Gtfoh 🤣",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "ShrewLlama",
                                    "body": "I mean, I'm obviously not *old*... but when I see kids these days using words I've never heard of, it hits me in the feels a bit lol",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "author": "Doxodius",
                                            "body": "Skibidi is all I've got to say to that. \n\nClosing in on 50, and not feeling old yet. (Gym time helps)",
                                            "score": 4,
                                            "replies": []
                                        },
                                        {
                                            "author": "staytsmokin",
                                            "body": "Been there done that i gave up awhile ago. 😭",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Naomi-san35",
                            "body": "I'm 24 i have bad joints and everything so i get tired quickly and alot of pain. I hear the older generation say i cannot complain bc im \"young\" 🤣",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "jayraan",
                    "body": "Yeah, like most people these days make it to around 80, so you haven't even reached the halfway point. Even 60 isn't really old to me, more like 70-80.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "staytsmokin",
                    "body": "To be fair my back hurts and need knee sleeves when i hoop. 39 and still feel like i'm in my 20s but my body says otherwise. 😐",
                    "score": 2,
                    "replies": [
                        {
                            "author": "NecessaryUnited9505",
                            "body": "That happened to me at 12 years old....so uhh. (Minus the knee sleeves. Never heard of them in my life)",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "staytsmokin",
                                    "body": "Knee sleeves? How do you not know what knee sleeves are? 🤔",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "NecessaryUnited9505",
                                            "body": "I really don't know",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "staytsmokin",
                                                    "body": "Compression sleeves that protect the knees and calf.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "father-fluffybottom",
                    "body": "I think it because I'm older than my dad was when he had me. I remember looking at him and thinking he was old, a lifetime of age and experience and knowledge and wisdom. And now my kids looking at me. *and I'm older than that*",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Fissminister",
                    "body": "I felt old when I turned 18. Now that I am 28,i feel ancient. The dinosaurs fossils feels like my age group.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "BigBootyBuff",
                    "body": "It's odd to me. We have this tight friend group, friends for almost 30 years since we were kids. Grew up together. Yet so vastly different. Half of us are energetic, still go out to clubs or bars, concerts, festivals, very outdoors-y. \n\nThe other half acts like they are nearing retirement age since their late 20s. Any time we are like \"oh we went to this concert\" they are like \"where you got that energy from? Way too old to do this.\"",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Historical_Usual5828",
                    "body": "It's when you start to feel old. I had an injury in my hip and lower spine area since 21 and was largely able to ignore it until I hit 30. Now I'm 32  and I hurt my shoulder by sleeping on it wrong. Please send help.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Marjoreal05",
                    "body": "OKAY I HEAR YOU THANK YOU HAHAHAHAHAH okay calming down. Only 30, only 30",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "narielthetrue",
                    "body": "It’s the back pain",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "ButteSects",
                    "body": "I think it's because we finally start to understand what old people always said about their knees and how they don't bounce back like they used to. I hurt my wrist 3 weeks ago doing some light housework and it still isn't back to normal lol.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "OfficialGarwood",
                    "body": "My dad died at 49, his dad in his 60s, his dad in his 50s. For all I know, i am already past the halfway point and I’m only 31. That shit scares me.",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "tourmalineforest",
            "body": "Man I’m 32 and people say this to me when I say I’m old. I’m just fucking happy to not be young anymore, it sucked lol. My perspective is - why is being old bad? Maybe old can be dope as fuck and a joyous part of life that people desperately want to be a part of? So much to love about it! Few fucks given, wisdom, butter pecan ice cream.",
            "score": 114,
            "replies": [
                {
                    "author": "justASlothyGiraffe",
                    "body": "I feel old now that I'm tired and jaded. It happened a few months ago. Being an adult felt amazing until it turned into feeling old. But I can't stop being an adult, so I guess I'll keep being old until being an adult isn't so hard.",
                    "score": 19,
                    "replies": []
                },
                {
                    "author": "evestraw",
                    "body": "old is when you get hurt sleeping in your bed wrong",
                    "score": 8,
                    "replies": [
                        {
                            "author": "itsbreadneybitch",
                            "body": "Well…then old = dehydrated, vitamin deficient, sedentary, and possibly genetic predisposition. ùThose are big reasons why younger people get hurt sleeping and other types of muscle pains out of the blue. \n\nI’m a strong believer in “use it or you’ll lose it”, if you don’t stay active and keep your muscles, joints, body strong then you will feel old really fast. \n\nSource: Used to work out and felt really strong and capable, became depressed and sedentary and hello health problems. Also diagnosed with myofascial pain syndrome which gets much better when I work out consistently and take vitamins",
                            "score": 5,
                            "replies": []
                        },
                        {
                            "author": "nooit_gedacht",
                            "body": "I've always had this, was i born old?",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "evestraw",
                                    "body": "Ja",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "tourmalineforest",
                            "body": "Old is also when you can finally afford a good mattress lol",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "evestraw",
                                    "body": "Or when you get the wisdom to invest in a mattress",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "I'm 36 and do not feel old at all",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Infinity3101",
                    "body": "True. As much as I sometimes miss being in my 20's, there were so many things about it that realistically sucked. I was so fragile and sensitive back then, I would let every little thing get to me. As a woman, I was constantly subjected to unwanted male attention that could turn dangerous in a second. I was insecure about my abilities and knowledge and went through so much unnecessary stress in my education and subsequent first steps in the job market. Sometimes something happens that puts me back into that headspace and I remember that I've been looking at my 20's through rose-colored glasses and that I actually do have so much going for me in my 30's, regardless of all the flaws.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Imp3riaLL",
                    "body": "Its because 32 is young as fuck says my 72 year old mom",
                    "score": 5,
                    "replies": [
                        {
                            "author": "tourmalineforest",
                            "body": "Your mom sounds like a baller",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Wise_Caterpillar5881",
                    "body": "Being old is a privilege not everyone gets to have. Being old and happy is my aim in life. And all I need to do to get there is practice being happy now and time will will eventually get me to being old too. Then I can die fulfilled.",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "wellisntthatjustshit",
                    "body": "30s just isnt old is all. aging isnt bad, but 30s isnt old. you’re not even half done yet.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Lost-N-Thot",
            "body": "Turned 32 yesterday, and age is just a number. It’s the wear and tear you’ve put on your body in that time. I’ve been an amateur boxer, bouncer, farm hand, fork lift operator, welder, mechanic, and just a general manual labor worker since I was 16. Last time I was at the doctor I was told I have the joints of 60 year old man, CTE, improperly healed fractures in my hands, wrists, feet, and spine. When I was fighting and bouncing I didn't have insurance so i was my own doctor. That or I went to a family friend who was a med student turned vet. My best friend is 34 and he went into programming. He lived an active but gentle life. He's not afraid to dig in and work hard don't get me wrong. He has just lived a much easier life. Because of that he can still run, jog, swim, hike, bike, and work hard like he's 18.",
            "score": 24,
            "replies": [
                {
                    "author": "LookHorror3105",
                    "body": "I feel that. I ran a few bars at the top of a ski resort for years and lugging kegs up and down stairs at 8200 elevation takes a toll on the body. Still, I'll fuck around like I'm 22 and if I get hurt, I get hurt. It's a small price to pay for enjoying life 🤙",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Lost-N-Thot",
                            "body": "Oh don’t get me wrong I’ll still get out and have a good time. I don’t care to fight still either. It just hurts a bit more than it used to now. That and my brain is starting to really show signs of the CTE now. So I’m getting a bit nervous in fighting now days. A prime example is turning the stove on high because I want to make coffee. At the time I think I’m doing the right thing. But I’m in such a daze I don’t realize I’m at the stove and not the coffee pot. Or that I’m turning knobs and not pushing buttons. This morning I got in the garden tub to take a shower. Then got angry and confused because there wasn’t a shower head. It doesn’t happen often, but it scares the shit out of me when it does. \n\nOn a side note, how the hell did you carry kegs at 8200ft?! I’d rather take a beating with a brick stick than do that. Even if I was acclimated!",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "LookHorror3105",
                                    "body": "Damn dude, that sounds rough!! I can't imagine doing that on the daily! As for the kegs, it's literally an endurance game. It sucked for the first few months but after 7 years I could literally just pick the keg up and walk it where I needed it. Crazy to think about it now though, because there is no fucking way I could do thst today!! Hahaha",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "657896",
                    "body": "I have had success strengthening my joints. General doctors generally don't know much about this stuff. Perhaps a good physical therapist can help you restore and heal your body. It would be a shame if you had to live like a 60y old while there might be solutions to prevent that.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "LookHorror3105",
                            "body": "Thanks for the advice, I'll look into it!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "MrBlahg",
            "body": "I’m 52. I’m verging on old, but it’s relative. I’m young to my dad, ancient to my kids. To me I’m just me with wisdom and achey joints.",
            "score": 7,
            "replies": []
        },
        {
            "author": "caliqueer1992",
            "body": "Three weeks ago I crossed into the dark realms of my 32nd year. lol ",
            "score": 6,
            "replies": []
        },
        {
            "author": "Low_Medium204",
            "body": "Happy birthday, I'll be 32 in 2 weeks myself.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Outrageous_Zebra_221",
            "body": "My back begs to differ.",
            "score": 8,
            "replies": [
                {
                    "author": "LookHorror3105",
                    "body": "If you have a partner, invest in a massage gun. Its definitely a game changer.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "throwsplasticattrees",
                    "body": "If you are 32 and your back hurts, you need to exercise more. Your back doesn't hurt from age, it hurts from neglect.",
                    "score": 0,
                    "replies": [
                        {
                            "author": "Outrageous_Zebra_221",
                            "body": "It's not without direct injury. I fell through a ceiling and landed flat on my ass on the concrete. My parents refused to get me any help for it, I eventually learned to just deal with it in my daily life. I was in middle school at the time.\n\nThanks to our shitty medical system I have never addressed it directly, only things that are actually killing me, and have generally lived with the pain off and on my entire life.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "mersaultjude",
            "body": "Happy Birthday! 🎂",
            "score": 3,
            "replies": []
        },
        {
            "author": "onyx73192",
            "body": "Happy birthday dude, I turn 32 in 6 days 🙂",
            "score": 3,
            "replies": []
        },
        {
            "author": "Lobster_porn",
            "body": "Old is just a number. No wait..",
            "score": 5,
            "replies": [
                {
                    "author": "LookHorror3105",
                    "body": "So close! Old is a word 😁\n\nSorry... I couldn't help myself 😂🤷🏻‍♂️",
                    "score": 5,
                    "replies": [
                        {
                            "author": "Lobster_porn",
                            "body": "That's the one",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "I’m on the way to becoming 22, physically i feel far older and mentally the opposite… somethings wrong with me, but maybe I’m just becoming a living paradox or something.",
            "score": 3,
            "replies": [
                {
                    "author": "LookHorror3105",
                    "body": "Nah mate, that's normal! It takes between 25-28 years for the brain to fully develop, but you're physically developed by 20. It's just a game if catch up bud, you're on the right track!! 👍",
                    "score": 3,
                    "replies": [
                        {
                            "author": "None",
                            "body": "Life’s not exactly the greatest right now, but if all goes well i might actually be able to visit waterparks again after i turn 34(in about 12 years, sadly).",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "LookHorror3105",
                                    "body": "Why can't you visit Waterparks?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "None",
                                            "body": "I… don’t want to say publicly.\n\n. . . Let’s just say that it’s not pretty, admittedly a bit of puppetry involved with strings attached to me.\n\nI’m only being vague as to not bring others down/ into my mess, nothing really confidential to my knowledge.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "LookHorror3105",
                                                    "body": "I think I understand. I'm sorry that you have to go through this, but I'm genuinely excited for you to heal and experience what you're missing. I wish you quick healing and a wonderful life 🙏",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "author": "None",
                                                            "body": "Welp, it won’t be very quick but thank you for at least trying to give me hope!\n\nEdit: btw, I WILL need proper swimming lessons by the time the madness ends… i remember how to at least float rn, but that’s really it sadly.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "author": "LookHorror3105",
                                                                    "body": "I believe in you 🙏",
                                                                    "score": 3,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "i’m only 21 and i’d say 30s isn’t old, you’re barely middle aged.\n\nyes, back hurty and tired, but you’ve still got a way to go!",
            "score": 3,
            "replies": [
                {
                    "author": "LookHorror3105",
                    "body": "Lmao, I love what you're doing. I want to check back in 9 years though cuz the \"back hurty and tired\" hits differently between 21 & 32 😂",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "kidanokun",
            "body": "I've been old since 24",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "You're old from the first time you injured yourself due to a sneeze.",
            "score": 2,
            "replies": []
        },
        {
            "author": "tinu1999",
            "body": "I am 25 and i am officially old",
            "score": 2,
            "replies": []
        },
        {
            "author": "MovieFreaQ",
            "body": "I remember turning 32, it was…….. um……what decade is it again",
            "score": 2,
            "replies": [
                {
                    "author": "LookHorror3105",
                    "body": "Great question! It's the apocalypse 👍",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Agadtobote",
            "body": "30 is the new 20.",
            "score": 2,
            "replies": []
        },
        {
            "author": "mklinger23",
            "body": "30s isn't old. 40's and 50's isn't old. It's middle aged.  I don't feel like you're an \"old person\" until 60's.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Burn1ng_Spaceman",
            "body": "50's are still young to me. I think 60s is once you can claim the old title",
            "score": 2,
            "replies": []
        },
        {
            "author": "Lightless427",
            "body": "I'm 42 and I'm not old.  Old = 65+. No less.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Husky_Lover_3862",
            "body": "I’m 15 and I’ve accepted that I’ll get really old at some point, does that make me old or still young?",
            "score": 2,
            "replies": [
                {
                    "author": "LookHorror3105",
                    "body": "Depends, if you fixate on your mortality, you'll be more aware of it. I choose to not let those invasive thoughts win (if I can). Birthdays are kind of an exception for me, as I almost always use the day to analyze what I've done in the last year. Sometimes it makes me feel old, but it's also motivated me to work towards the ideal version of myself. After all, you can't make good wine without patience 😊",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "just_didi",
            "body": "I've accepted being old by now , I'm 21 (please government let me retire )",
            "score": 2,
            "replies": [
                {
                    "author": "Johnny_LP",
                    "body": "same",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "KikoSoujirou",
            "body": "37 is when you’re old. Us male life expectancy is 73.2 so when you’re 37 you’re past the halfway point/into your final half. 32 you’re still in your young half",
            "score": 4,
            "replies": [
                {
                    "author": "LookHorror3105",
                    "body": "I want to be 60 and feel young. The number doesn't matter as much as the experiences we have 😁",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "Accepting that you age is a very important step in maturing mentally and accepting yourself the way you are. \n\nPeople who promote this refusal of ageing are basically victims of advertising. They don’t realise advertising lies.",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "author": "effnad",
                    "body": "This year, I turned 39 the day after new year day. I feel old I just can't tell if the old is physical or mental.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "SimobiSirOP",
            "body": "r/unexpectedfactorial",
            "score": 1,
            "replies": [
                {
                    "author": "LookHorror3105",
                    "body": "I don't trust equations with punctuations. Also, I'm not a math major so....",
                    "score": 3,
                    "replies": [
                        {
                            "author": "ABzoker",
                            "body": "Factorials were high school mathematics for me. Different countries, different education systems.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Ikxlexcia",
            "body": "What is Middle age now a days? Is gettin into yer 40's starting to get old? Like not old, but gettiin there?",
            "score": 1,
            "replies": []
        },
        {
            "author": "V_es",
            "body": "You can be a wreck in your 20s. Physical and mental health is what makes you feel young or old. I’m 33 and never felt younger after I started working out, running and dieting properly.",
            "score": 1,
            "replies": []
        },
        {
            "author": "DanteHicks79",
            "body": "As a ~45 year old, come talk to me about being old when you hit forty.",
            "score": 1,
            "replies": []
        },
        {
            "author": "xxbronxx",
            "body": "I'm 31 and tbh I don't feel very different from 17, yeah there some little things like I appreciate much, much more my parents and what they have done and do for me, try to spend quality time with ppl that I care about, but at the end of the day I'm the same always joking, stay late night, trying to have always fun guy.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MakkusuFast",
            "body": "I accepted that I'm old since I was 23. Now I'm 32 and I still think I was right.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Good-Statement-9658",
            "body": "I'm 34. Fully embraced the fact that I'm not 'young' anymore. Because I'm also not covered in pimples, or full of self doubt, or dealing with raging insecurities like I was in my teens and 20s 🤷‍♀️I freaking love being old 🤣🤣🤣",
            "score": 1,
            "replies": []
        },
        {
            "author": "joko_ma",
            "body": "_proceeds to wear cap backwards and and weird straw shoes without socks_",
            "score": 1,
            "replies": []
        },
        {
            "author": "teamstark0",
            "body": "I'm turning 28 in 6 days and whenever I need to discuss my age I say \"I'm almost 30\". I already feel 87 anyways, it won't be that much of a difference",
            "score": 1,
            "replies": []
        },
        {
            "author": "BreadMilkToastLoaf",
            "body": "Bread",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "Happy birthday!! I just hit mid 20s and heard 30s are better than 20s!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "44 I'm not old.. I just hate more people then before.",
            "score": 1,
            "replies": []
        },
        {
            "author": "kianicaJones",
            "body": "I'm almost 40, but I've been old since I was 8",
            "score": 1,
            "replies": []
        },
        {
            "author": "lol_cool_bozo",
            "body": "ngl 2.6313084e35 is kinda old",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "I don't feel old at all with 31, but because the incels deem me as post-wall, I get waaaayyyy less sexually harassed! More peace for me :)",
            "score": 1,
            "replies": []
        },
        {
            "author": "BetaSilence",
            "body": "Happy birthday dude, enjoy this day it only comes once a year",
            "score": 1,
            "replies": []
        },
        {
            "author": "myrianreadit",
            "body": "32 is the best year. Take it from me, I've been 32 for 6 months and I've never felt better",
            "score": 1,
            "replies": []
        },
        {
            "author": "Musashi10000",
            "body": "I'm 33, I'm old, and I've been old for a few years now.\n\nI first realised I was old when I went to the supermarket, and I was genuinely *excited* to see what was on the reduced-to-clear shelf.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Shpritzer",
            "body": "… until then, you’re just delusional.",
            "score": 1,
            "replies": []
        },
        {
            "author": "The-Mandolinist",
            "body": "One of my favourite quotes in a similar vein. Not exactly the same sentiment- but takes the tough love approach with regards aging: \n\n“If you think you’re too old for rock n roll then you are”\n\nLemmy",
            "score": 1,
            "replies": []
        },
        {
            "author": "Delicious-Ad1724",
            "body": "I used to date someone who was 31 when I was 20. And he kept on complaining about his age and talking about how old he is. He told me I won't be as pretty when I'll get older. The funny thing was how he complained about being out of shape, having knee and back pain and no longer having 6 pack. He would look at his older photos from when he was a teen or in his 20s in such envy and sad nostalgia, saying he was attractive back then and now he's no longer because he's \"old\". He would talk about how in shape he was and now no longer like it's impossible to be in shape in your 30s. The funny thing was that he did absolutely everything he could possibly do in his 20s and in the present to feel \"old\". First of all, he worked in very hard physical jobs all his life and refused to ever put any sunscreen on himself because he saw it as a women and gay thing. While his legs were white as snow, his neck hands and face were brown and full of sun damage. I tried and tried but he refused to do anything about it, saying he's manly and that he doesn't care about sun cancer. Obviously he also never washed his face properly, never put on any lotions, moisturizer or soup because I guess for him taking care of yourself is too \"feminine\". And then he would proceed to cry and moan about having wrinkles. Lol. He would cry about his physical state and being in pain and moaning about not having his old teen body anymore while also stimultionasly never working out, not going to the doctors to fix problems he has from injuring himself, allowing himself to be lazy and lay down in bed with his ps and phone all day, refusing to even slightly stretch because it's too \"girly\" and real men only lift (which he didn't for the 2 years of dating him). He would drink beer like crazy and say it's the only thing that helps his mental state (refused to go to a psychologist which he needed very much). He would drink like 20 half litter bottles of beer every single day. He also smoked like a madman and he had a poor diet, barely any vegetables. He literally also never drank water and he didn't brush his teeth at night, only morning. Never cleaned his tongue or something like that. Only when he got a heartattack did he quit cigarettes and alcohol. He was always a skinny guy, but that didn't mean he was healthy.\nSo yeah obviously he felt old in his late 20s and early 30s lol.\nYet he would project those feelings on me, making me feel like it's obvious that with age I won't be as attractive as I'm now.\nMy advice, never date someone with this mentality, they are so bitter. I was trying to be positive, active and healthy and it was very very hard because I kept putting all my energy on trying to lift him up. Because I loved him and wanted to spend time with him I would give up on going to the gym and going for a run because he wanted to just lay in bed for days, so I did it with him.",
            "score": 1,
            "replies": [
                {
                    "author": "Delicious-Ad1724",
                    "body": "Being in a relationship with him definitely made me feel very \"old\". Even though I was just 18 when we started dating.\nIt's all the about the mindset guys. Stop using the im old excuse and start taking responsibility about your body and mental health",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "sheesh1111111",
            "body": "I'm 19 with a lot white hair popping off my head, i accepted my fate as being old.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Crime-of-the-century",
            "body": "Your body will tell you when you are old don’t think it won’t. But at what age depends on how much you suffered.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Timidhobgoblin",
            "body": "I'm 39 right now and the prospect of turning 40 in 8 months has been wearing pretty hard on me lately. I don't feel different in my head than I did when I was 25 except for being considerably wiser and calmer all round and the only real physical difference I notice in myself is I nap a bit more, have a few more grey hairs and feel a little more stiff in the joints occasionally. \n\nBut then I recently realised I'm not actually upset about turning 40, on the contrary I'm actually enjoying the man I'm turning into and wish 20 year old me could see how well everything was going to turn out. What I'm actually upset about is the notion of everyone else thinking of me as old and mocking me for it. In the grand scheme of things I know I'm still relatively young and have plenty of years left but I hate the idea that suddenly people think I shouldn't be able to go do certain things like let my hair down in a bar, play in my band or play video games and stream etc at home because I happen to have lived a little longer than they have.\n\nI guess this is a roundabout way of saying we shouldn't be bothered about how old we are and we should just try to stop caring so much about what others think about it, because we're all heading the same way and I know when the time comes for me to slip off the Earth I don't wanna spend any of those final moments thinking \"I wish I had done what I loved to do instead of what others think I should have done\"",
            "score": 1,
            "replies": []
        },
        {
            "author": "Razdain",
            "body": "Hahaha I accepted I'm old since I was 28. I'm turning 36 today, good old 8 years being old.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FacetiousInvective",
            "body": "Today and for another 2 weeks: I am 32, my dad is 64, my grandpa is 96 :> unfortunately I will not have a child until then so the trend has 0 chance to continue.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Eremitt-thats-hermit",
            "body": "Age, old, young; all are meaningless. What matters is that you’re happy doing what you do and that you’re working on goals you wanna work on. You’re never too old or young to do that.\n\nWork on bettering yourself life and the world and make sure you’re happy while doing so. If you’ve survived a near death situation and afterwards don’t want to change your life, you’re doing it right.",
            "score": 1,
            "replies": []
        },
        {
            "author": "QuantenMechaniker",
            "body": "you're ageing as long as you move up in the advertiser's age brackets. you're only old, when advertisers don't care about you anymore, i. e. 64+",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dont_Overthink_It_77",
            "body": "Absolutely! You’re never truly old if you’re young at heart!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pokemonfannumber2",
            "body": "Some people that think like that are the types to say \"I'm 32 years young\" unironically",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "I’m 34. Damn near in the best shape of my life. \n\nIf you put in the work and take care of yourself, it really is just a number.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "I'm 36 and still feel young. I dno if I'll ever feel like a full fledged adult lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "derorje",
            "body": "I don't get the meme. Robin says he's old and Batman slaps him and comments he's only old when he accepts it? But Robin accepted he's old.\n\nOh and happy birthday",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dear-Dream8711",
            "body": "How young you feel is how young you are.\nTake care of your health and your age will be irrelevant.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OutsideWrongdoer2691",
            "body": "32 is young..... You are still at peak physical performance.....\n\neven 40 year old is still young..",
            "score": 1,
            "replies": []
        },
        {
            "author": "WheelSecret9259",
            "body": "I'm also turning 32 this year. Time flies so fast, but at the same time, I feel like I'm not doing much despite all the struggles I faced in my 20s to get this far.",
            "score": 1,
            "replies": []
        },
        {
            "author": "andieforyou",
            "body": "Happy Birthday ! I also turned 32 in June!! Still feel like I’m 21 though 🤗🎂🥳",
            "score": 1,
            "replies": []
        },
        {
            "author": "DevelopmentValuable2",
            "body": "You know you're old when you agree with parents in disney movies.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Dambo_Unchained",
            "body": "Old is 100% relative to who you are speaking to\n\nNo one is “old”. My grandmothers are 6 years apart but the younger one sometimes acts like she isn’t an old lady herself trying to do things for the elder one hahaha",
            "score": 1,
            "replies": []
        },
        {
            "author": "KiKi_deKwon",
            "body": "32 is still young! 40 is still young! But if you feel old, you are old, no matter how old you are. It is all about energy… Some people die at age 25 (energetically) and that is the moment when they start to tell others how old they are. Because they reflect their own way of seeing life.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheDulin",
            "body": "You were a young adult in your twenties. Now you're just an adult - no qualifier. You can also use \"grown up\".",
            "score": 1,
            "replies": []
        },
        {
            "author": "CJPF_91",
            "body": "I have kids and my body is slowly wearing down. So ya I am getting old",
            "score": 1,
            "replies": []
        },
        {
            "author": "IboofNEP",
            "body": "If 2,63130837 x 10^35 years isn't old idk what is.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Plus_Shame_8228",
            "body": "And yet it feels like you're 18 yesterday right?🥲🥲",
            "score": 1,
            "replies": []
        },
        {
            "author": "melody5697",
            "body": "You’re not objectively old until you’re 65 (though you can be old as young as 50 if you have an old person attitude).",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tucker_the_Nerd",
            "body": "If you're only as old as you feel, that makes me....dead.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nomadic_View",
            "body": "Why would 32 be a landmark year to make you “officially” old?  I can understand something that ends in “0” or even to a lesser extent a “5.”  But a “2”?",
            "score": 1,
            "replies": [
                {
                    "author": "LookHorror3105",
                    "body": "Because I turned 32 yesterday and I've been contemplating my fleeting mortality.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "GlenEnglish1986",
            "body": "You don't stop skateboarding because you get old.\n\n\nYou get old because you stop skateboarding.",
            "score": 1,
            "replies": []
        },
        {
            "author": "diescheide",
            "body": "I'll be 32 in 2 weeks. People ~10 years younger than me act like I'm a dinosaur, people ~15 years older than me call me a baby. IDK, man, I'm just in my 30s.... Happy birthday, OP!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Own_Instance_357",
            "body": "This looks like Batman smacking the ever-loving shit out of Tom Sandoval",
            "score": 1,
            "replies": []
        },
        {
            "author": "Whiteswan01",
            "body": "Nevrr thought much about aging, but now I’m turning 50 next week and the thoughts begin to come…",
            "score": 1,
            "replies": []
        },
        {
            "author": "FrozenShadow_007",
            "body": "How the hell are you older than the universe?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Irongiant350",
            "body": "I'm 40 tho lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "SettingAcceptable230",
            "body": "Can someone make this for 40 please, been hearing that I'm old alot lately 😁",
            "score": 1,
            "replies": []
        },
        {
            "author": "SirenOfMorning13",
            "body": "I'm 32 too but I feel like a kid still",
            "score": 1,
            "replies": []
        },
        {
            "author": "Shoddy-Wallaby6870",
            "body": "It's all fun and games until someone gives you a senior discount without asking.",
            "score": 1,
            "replies": []
        },
        {
            "author": "zoroddesign",
            "body": "You are old when you look at someone who has graduated from college and can unironically say “ugh, kids.”",
            "score": 1,
            "replies": []
        },
        {
            "author": "AnimorphsGeek",
            "body": "Not even an adult by hobbit standards",
            "score": 1,
            "replies": []
        },
        {
            "author": "GroovyDucko",
            "body": "Im 29 and my friends have been calling themselves old since we were 18 for fucks sake.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Raaazzle",
            "body": "Happy birthday! I hit 50 last Saturday and realized how foolish I've sounded every time that I've called myself \"old\". This is the oldest I've ever been, though.\n\nEdit: Well, now.\n\nRe-edit: A little older.",
            "score": 1,
            "replies": [
                {
                    "author": "Raaazzle",
                    "body": "This guy is definitely 50.\n\nYes, he's replying to his own comment.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "No_08",
            "body": "Happy birthday, OP! I'm 34 and I know the feeling!",
            "score": 1,
            "replies": []
        },
        {
            "author": "oldgranny3",
            "body": "youre officially half a stack years old!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "Time doesn't effect me. But an unfulfilled life scares the crap outta me",
            "score": 1,
            "replies": []
        },
        {
            "author": "Legocator",
            "body": "You are 32 years young!🥳",
            "score": 1,
            "replies": []
        },
        {
            "author": "muterabbit84",
            "body": "I’m Batman slapping Robin whenever I hear kids use the word “old” for anyone below retirement age.",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "It’s funny how as the human lifespan gets longer, the age for ‘old’ seems to get lower and lower lol",
            "score": 1,
            "replies": []
        },
        {
            "author": "Charred_Steak",
            "body": "I turned 41 today and earlier this week I almost threw out my back by sneezing.",
            "score": 1,
            "replies": []
        },
        {
            "author": "orphanage_robber",
            "body": "r/unexpectedfactorial",
            "score": 1,
            "replies": []
        },
        {
            "author": "Free_Photograph8890",
            "body": "Happy birthday 🎂",
            "score": 1,
            "replies": []
        },
        {
            "author": "Rizor98",
            "body": "Saw a guy wearing à shirt that read ''I'm not getting old, I'm becoming a legend\"\nMade me smile",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pedalhead511",
            "body": "Young is a state of mind more than anything. I've met old people in their twenties and young people in their sixties.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Varis0",
            "body": "32 factorial is pretty old",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pretend-Safety-7435",
            "body": "My dad is almost 62, i compare him to others and he looks young af...",
            "score": 1,
            "replies": []
        },
        {
            "author": "the-fr0g",
            "body": "32! ? \nYou are really old r/unexpectedfactorial",
            "score": 1,
            "replies": []
        },
        {
            "author": "TurboZ31",
            "body": "Well, you certainly aren't in your prime any more.",
            "score": -1,
            "replies": [
                {
                    "author": "LookHorror3105",
                    "body": "Speak for yourself, I might not be in my physical prime, but my mental game has never been sharper 😉",
                    "score": 4,
                    "replies": [
                        {
                            "author": "TurboZ31",
                            "body": "31 is a prime number 😂\n\nSorry, Dad joke\n\nHappy birthday!",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "CloudyStrokes",
            "body": "Old age starts at 25, when your excuses dwindle and you have to start acting like an adult for real. It is the age where your physical and mental health start degrading unless you put some effort into them, when you’re expected to take responsibility and have a job and sum up your life experiences and lessons learned into something useful and practical, when your identity is fully formed and you need to become independent",
            "score": 0,
            "replies": []
        },
        {
            "author": "Firegem0342",
            "body": "35 is literally middle aged. Life expectancy is 70. 30s is old.\n\nSource: I'm over 30 and everything hurts",
            "score": 0,
            "replies": []
        },
        {
            "author": "maritjuuuuu",
            "body": "I life in a retirement home\n\nDo I qualify as old yet?\n\n(I'm 23)",
            "score": 0,
            "replies": []
        },
        {
            "author": "Elegant-Emphasis-867",
            "body": "Nah you are old at 30 am sorry. Young people is -28, if you have 29 you have 30. And if you have 30+ you are old, get over it people. Embrace life.\n#\n#\n#\nThe good thing is that, before 30 you have no permission to give advice to No one. You shut the fuck up and listen other people. After 30 you have permission to give advice to Younger people.\n#",
            "score": 0,
            "replies": [
                {
                    "author": "LookHorror3105",
                    "body": "That's a lot of words to say \"I'm an entitled a-hole.\" can't wait for you to hit 30, I'm betting that your uninformed and asinine opinion will change. Sit down sweetheart, the adults are having a conversation here.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Elegant-Emphasis-867",
                            "body": "But what's the fucking wrong with you my boy? 🤣 First you take it too personal, son. What the fuck? you are not even Z gen! Why the skin so thin? \n#\nCome on, say it right, with balls you are a grown man! Say: Asshole! You are an asshole!. Jesus... Grow up, you have the hair in the balls already my child.\n#\nSecond, you don't know how old I am or who the fuck are you talking to. The 90's where crazy, Charlie, I could be your dad 😉",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}