{
    "title": "The artist updated this comic and it fits here now",
    "author": "CoMaestro",
    "subreddit": "wholesomememes",
    "rank": 261,
    "score": 9283,
    "upvote_ratio": 0.99,
    "num_comments (reported by reddit)": 40,
    "url": "https://i.redd.it/w8f97018k6kd1.jpeg",
    "id": "1eyeju4",
    "selftext": "",
    "comments": [
        {
            "author": "doortju",
            "body": "The whole line of people supportig him, woah",
            "score": 463,
            "replies": [
                {
                    "author": "endertribe",
                    "body": "You know the phrase \"It takes a village to raise a child.\"\n \nIt doesn't stop when you become a teen. You need a community around you, a fandom, family, friend group, etc. if you think you don't, you are simply wrong.",
                    "score": 193,
                    "replies": [
                        {
                            "author": "How2GetGud",
                            "body": "What of those who never had it to this day?",
                            "score": 20,
                            "replies": [
                                {
                                    "author": "endertribe",
                                    "body": "What are you waiting for? \n \nMy first community outside of school (IRL. Online I already had a community) came because I went into my local game store, bought some magic the gathering card because I wanted to learn how to play and I showed up on Thursday. I learned with people who liked to play. It's even easier today since they sell premade deck that you can then customize.\n \nTake something you want to learn and odds are there are people who will teach it to you. \n \nYeah it takes work and I had to shuffle my schedule a bit around my activities but every boss will accommodate you. If they don't, change job ASAP. I got hired eventually into that game store",
                                    "score": 41,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "CoMaestro",
            "body": "The original post that I couldn't link here: https://www.reddit.com/r/ExtraFabulousComics/s/XbrkcPbMRE\n\nEspecially the message under it, saying how it's been updated to reflect the changes in his life seemed so fucking cute",
            "score": 323,
            "replies": []
        },
        {
            "author": "kfijatass",
            "body": "Hey, at least they give him a choice.",
            "score": 72,
            "replies": [
                {
                    "author": "Z_zk",
                    "body": "Hahahaha",
                    "score": 9,
                    "replies": []
                }
            ]
        },
        {
            "author": "livin_la_vida_mama",
            "body": "This guy's walking down a street when he falls in a hole. The walls are so steep, he can't get out. A doctor passes by, and the guy shouts up, \"Hey you, can you help me out?\" The doctor writes a prescription, throws it down in the hole and moves on. Then a priest comes along, and the guy shouts up \"Father, I'm down in this hole, can you help me out?\" The priest writes out a prayer, throws it down in the hole and moves on. Then a friend walks by. \"Hey Joe, it's me, can you help me out?\" And the friend jumps in the hole. Our guy says, \"Are you stupid? Now we're both down here.\" The friend says, \"Yeah, but I've been down here before, and I know the way out.\"",
            "score": 65,
            "replies": [
                {
                    "author": "catcherofsun",
                    "body": "Why did this make my eyes water?",
                    "score": 3,
                    "replies": [
                        {
                            "author": "livin_la_vida_mama",
                            "body": "It's from the West Wing. Aaron Sorkin has a habit of doing that to people....",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "catcherofsun",
                                    "body": "Oof, indeed!",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "murderous help ",
            "score": 46,
            "replies": []
        },
        {
            "author": "jamesr1005",
            "body": "That knot is not good for that purpose. You gotta use a knot that's not a slipknot.",
            "score": 11,
            "replies": [
                {
                    "author": "dAnKsFourTheMemes",
                    "body": "Yeah, boutta lose his lower half.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "pueri_delicati",
            "body": "At least they didn't throw him a pickaxe so he can go even deeper",
            "score": 17,
            "replies": [
                {
                    "author": "benkenobi5",
                    "body": "Nah, Minecraft taught me you just make steps in the wall",
                    "score": 22,
                    "replies": [
                        {
                            "author": "El_Nathan_",
                            "body": "Throw him some cobblestone",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Sihgilanu",
            "body": "Missed opportunity for the crew to be above the panel, the rope going over the line... But I like the ending anyway ☺️",
            "score": 2,
            "replies": []
        },
        {
            "author": "No-Tangerine3356",
            "body": "Omg I just got it 🥺🥺🥺",
            "score": 2,
            "replies": []
        },
        {
            "author": "nchert",
            "body": "Damn I almost cried",
            "score": 2,
            "replies": []
        },
        {
            "author": "BAGStudios",
            "body": "So now they’re all pulling him up to heaven, yeah?",
            "score": 2,
            "replies": []
        },
        {
            "author": "Ramental",
            "body": "I wouldn't sit into that loop like that. It might cut the blood flow and cause a numbness in the legs. Also restricts them. Better to insert just your feet.",
            "score": 4,
            "replies": []
        },
        {
            "author": "Badytheprogram",
            "body": "Silly, innocent artist, people won't pull it,  if you sit on like that. /s",
            "score": 1,
            "replies": []
        },
        {
            "author": "Actaeon_II",
            "body": "The reality would be more of a $1299 per person per foot pullup. Sad reality",
            "score": 1,
            "replies": []
        },
        {
            "author": "BillionStyx",
            "body": "Forbidden tug of war",
            "score": 1,
            "replies": []
        },
        {
            "author": "Neither-Tonight-8217",
            "body": "🤔",
            "score": 1,
            "replies": []
        },
        {
            "author": "swashbuckler78",
            "body": "Noose would be the worst Knot to lower to someone. It slips, so as soon as you try to pull them up it will close tight around them. And it takes a lot of rope to tie so you have less to use to help. Bowline is a non slipping loop that uses minimal rope. It's also easier to tie than a noose.",
            "score": -12,
            "replies": [
                {
                    "author": "CoMaestro",
                    "body": "The point is that the original comic didn't have the 5th panel, and the author added it in to represent positive changes in his own life.",
                    "score": 50,
                    "replies": []
                },
                {
                    "author": "No_Departure_582",
                    "body": "Don‘t know why you’re getting downvoted, but thanks for your knot expertise",
                    "score": 9,
                    "replies": [
                        {
                            "author": "swashbuckler78",
                            "body": "A lot of people here never even got to Tenderfoot and it shows. 😂",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "ciccio_bello",
                                    "body": "As a former Boy Scout I literally came here to say exactly what you did lol",
                                    "score": 5,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "seitan_bandit",
            "body": "It's sweet, not enough cum for me though. ",
            "score": -9,
            "replies": []
        },
        {
            "author": "Deus0123",
            "body": "r/yesnoyesno",
            "score": -2,
            "replies": []
        }
    ]
}