{
    "title": "r/WholesomeMemes will only allow original content (OC)",
    "author": "AutoModerator",
    "subreddit": "wholesomememes",
    "rank": 1,
    "score": 2673,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 59,
    "url": "https://www.reddit.com/r/wholesomememes/comments/1f5v7cw/rwholesomememes_will_only_allow_original_content/",
    "id": "1f5v7cw",
    "selftext": "Hey friendos! \n\nThe best way for us to take back our community from spam and bots is to be very selective of the content we allow here. \n\nHere are the main things we are looking for:\n\n* Is it wholesome?\n   * Uplifting, life-affirming, kind.\n   * This is subjective at the discretion of moderators. \n* Is it a meme?\n   * A meme is an image or video/gif with text included in or on the image.\n   * Screenshots of social media or news are not memes.\n   * OC Comics are allowed as long as they are wholesome.\n* Is it original content (OC)?\n   * If you did not personally make the meme, do not post it!\n   * Edited comics are also allowed as long as you are the one that edited it.\n   * No reposts are allowed! It doesn’t matter if it has not been posted in the community before. If you did not make it, it is considered a repost. The only exception being that you personally made a meme and did not share it in our community EVER. We only want original content.\n\nPlease be sure to read all of our rules on the sidebar. Make sure that your comments are wholesome too as we do not tolerate hatred or bigotry of any kind. If you see a post or comment that breaks our rules, please report it so mods can take action. All posts for the time being will need to be approved by a moderator, so please allow up to a 24 hours for us approve your meme or follow up with any reports. Moderators are humans too, so if we make a mistake or if you have any feedback, please send us a modmail so we can take action.\n\nhttps://preview.redd.it/njde91t5u1md1.jpg?width=1000&format=pjpg&auto=webp&s=31d6937c22f7c26a0b3ddb1edcda44deaf3001ab",
    "comments": [
        {
            "author": "Ufiking",
            "body": "Nice, this will finally get rid of all the karma farming bots reposting posts ive seen 100 times",
            "score": 612,
            "replies": [
                {
                    "author": "mitchMurdra",
                    "body": "What is worse is how many users gobble those posts up.\n\nPlus the extra bots part of the same network as the bot OP which steal top comments from previous times the post was made too.\n\nIt's a pandemic and Reddit seems to be losing. I do not see many of them get banned after months of doing this. But I make sure to keep reporting them just in case Reddit wins.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "JediTigger",
            "body": "The number of bots here is truly staggering. Let’s hope this helps.",
            "score": 342,
            "replies": [
                {
                    "author": "None",
                    "body": "Had to leave all the cat subreddits because it’s all bots and people somehow don’t realize. There was a phase where bots were naming titles shit like “the ponytail (as in cat… lmao) is happy” and people didn’t question it like wtf homies",
                    "score": 75,
                    "replies": [
                        {
                            "author": "cragbabe",
                            "body": "I run some cat subreddits and it seriously is a lot of work to try and keep up with, the problem is that reddit gives us almost no tools to work with, I have filters set for new accounts but there's no reddit moderator options for preventing reposts themselves",
                            "score": 33,
                            "replies": []
                        },
                        {
                            "author": "mitchMurdra",
                            "body": "> it’s all bots and people somehow don’t realize\n\nI had to do the same thing with my animal subreddits. Everybody was gobbling those posts up in the comments too.\n\nAnd the moderators of at least eight different communities were just asleep on the matter. But wholesomememes here is making the best move I have seen so far.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "BrainBurnFallouti",
                    "body": "What bothers me how WILD those bot posts get. \n\n* \"Look at this Orphan that raised money to save its sibling from being crushed by the Orphan Crushing mashine\"\n* Look at this random comic I basically stole\n* Look at this Tweet...that's the same level of  Pinterest philosophy\n* Look at this Tumblr post. Seriously: How tf is a clever comback à la \"What doesn't kill you doesn't make you stronger -it gives you trauma\" wholesome? It's depressing!\n* Pictures of animals *(like they're cute, but it's not meme)*\n\n...and more. I honestly feel mostly bad in some way if I come here. Very happy that this is pulled up differently",
                    "score": 19,
                    "replies": []
                }
            ]
        },
        {
            "author": "The_CreativeName",
            "body": "Finally, a sub actually taking reposts seriously. Thanks alot.",
            "score": 115,
            "replies": [
                {
                    "author": "PizzaSalamino",
                    "body": "Not just reposts, but also posts that are not wholesome or memes that get upvoted all the time. At least i hope.",
                    "score": 10,
                    "replies": []
                }
            ]
        },
        {
            "author": "hroaks",
            "body": "\nI wish this was addressed by reddit and not subreddit mods\n\nI'm not totally against reposting I've been guilty of reposting myself. but when a bot reposts and crosspost something a thousand times, it ruins the site.",
            "score": 71,
            "replies": [
                {
                    "author": "TrenchSquire",
                    "body": "If reddit added captchas for making accounts and posting itd be a start.",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Soft-Community-8627",
                            "body": "That'd do almost nothing. There's been free chrome extensions that can solve captchas since 2017, and can even solve the image captchas (by using the accessibility \"listening\" mode for visually impaired people). Current technology is very behind for stopping bots \n\n\nAnd I know I look like a bot because of my username lmfao, but I've just been making a new reddit burner almost weekly ever since their API changes when I deleted my main",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Corporate-Shill406",
                    "body": "Reddit won't crack down because then they'd have fewer active users and their stock price would go down.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "wretchedharridan",
            "body": "💗",
            "score": 36,
            "replies": []
        },
        {
            "author": "NtGermanBtKnow1WhoIs",
            "body": "Thank goodness!! Truly appreciate the mods for taking a step towards getting rid of the bots. \n\nAnd thanks very much for that Mr. Rogers quote, i've been searching for it!! 😭",
            "score": 14,
            "replies": []
        },
        {
            "author": "spicycupcakes-",
            "body": "I feel like it'd be better to just go back to the subs roots and be a place for memes that are revised to become wholesome, rather than just like inspirational quotes or the like",
            "score": 23,
            "replies": []
        },
        {
            "author": "Romulox69420",
            "body": "I wish this were a site wide rule. I will never understand people who copy paste other posts for karma",
            "score": 7,
            "replies": []
        },
        {
            "author": "Repulsive-Durian4800",
            "body": "Oh no what will I do without the hamster telling me bad mood is not allowed several times a day.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Shmarfle47",
            "body": "W mods\n\nSometimes we even got stuff that wasn’t exactly wholesome or a meme",
            "score": 4,
            "replies": []
        },
        {
            "author": "None",
            "body": "Good!  Maybe this will finally make this sub bearable and I can unmute it!",
            "score": 9,
            "replies": []
        },
        {
            "author": "Which-Bag2509",
            "body": "Nice! Thanks for your hard work mod team!",
            "score": 3,
            "replies": []
        },
        {
            "author": "K4m30",
            "body": "Oh boy, the quality of OCM is going to improve so much.",
            "score": 3,
            "replies": []
        },
        {
            "author": "LeonidasVaarwater",
            "body": "Yay! I'll try to help by exposing bots 👍",
            "score": 3,
            "replies": []
        },
        {
            "author": "Cevinkrayon",
            "body": "Thank god!",
            "score": 5,
            "replies": []
        },
        {
            "author": "EcchiOli",
            "body": "Hear, hear!\n\nThank you mods, and good work in the future :)",
            "score": 2,
            "replies": []
        },
        {
            "author": "bogguslol",
            "body": "Hopefully we don't have to see that \"act quirky if bullied\" comic again.",
            "score": 2,
            "replies": [
                {
                    "author": "That0neGuy96",
                    "body": "Dare I ask?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "bogguslol",
                            "body": "https://www.reddit.com/r/wholesomememes/comments/fsdhph/how_to_deal_with_bullies/",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "That0neGuy96",
                                    "body": "Thank you",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "BullTerrierMomm",
            "body": "Bummer. I find stuff in the wild that I could never dream up myself.",
            "score": 10,
            "replies": [
                {
                    "author": "2th",
                    "body": "We know it's not a great solution, but it's the best we can do right now. \n\nAnd to give you some perspective, I've been a mod for a little more than two months and I've banned so many bots and spammers that I stopped counting after 500. And I hit that number in like my first 3 weeks.\n\nReddit is really infested with bots, and the meme subs are some of the absolute worst. We are tired of this so we are trying to draw a line in the sand for the sake of providing what this sub was founded for, wholesome memes. And bots and spammers are not wholesome.",
                    "score": 21,
                    "replies": [
                        {
                            "author": "BullTerrierMomm",
                            "body": "I definitely don't envy you and i can only imagine the work that goes into moderating",
                            "score": 7,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "gnomon_knows",
                    "body": "Luckily there is every other meme sub on reddit, plus Facebook.",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "alurimperium",
                    "body": "Yeah that bit is a little harsh. There's tons of people who don't post their stuff to reddit, or at least this sub, that would be appropriate here.",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "MrIrrelevantsHypeMan",
            "body": "![gif](giphy|LxPsfUhFxwRRC)",
            "score": 2,
            "replies": []
        },
        {
            "author": "nobody0163",
            "body": "Yet you banned u/RepostSleuthBot",
            "score": 4,
            "replies": [
                {
                    "author": "2th",
                    "body": "Actually, it was unbanned last week.\n\nThe mod that banned it is no longer part of the team, and hasn't been for some time. I understand why it was done, but we think the value it provides is more than the annoyance of it being used constantly.",
                    "score": 26,
                    "replies": [
                        {
                            "author": "nobody0163",
                            "body": "Good.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "Honestly I never see that bot be correct, usually it just says “I don’t know” lol",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "BasilyLeave",
            "body": "Finally",
            "score": 1,
            "replies": []
        },
        {
            "author": "TimePlankton3171",
            "body": "THANK YOU! This needed to be done",
            "score": 1,
            "replies": []
        },
        {
            "author": "dee-0094",
            "body": "I have been wanting to watch the movie where Tom Hanks played Fred Rogers.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Independent-Ad5852",
            "body": "Thanks guys. Just please make sure to enforce it well and fairly!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Valkouze",
            "body": "Finally some action lmao",
            "score": 1,
            "replies": []
        },
        {
            "author": "GumSL",
            "body": "Cool!! Can you also please remove all the inactive mods? No, seriously.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tenelia",
            "body": "Love it. I had just got back to reddit after the Apollo blackout... Any other subs that are like this?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Outrageous-Laugh1363",
            "body": "aaaaaaaand you killed the subreddit\n\ngreat job, as always, reddit mods",
            "score": 1,
            "replies": []
        },
        {
            "author": "mitchMurdra",
            "body": "Hey wholesomememes moderators\n\nThanks for your stance on this. So many communities have been effectively \"killed\" by endlessly front paging bot posts. Especially small ones. This is the first effort I have seen on this website where moderators are taking it back. Very impressive effort and thank you for making it instead of letting another community die to bots.\n\nSeriously. Thanks.",
            "score": 1,
            "replies": []
        },
        {
            "author": "thrashvanilla",
            "body": " 7u6",
            "score": 1,
            "replies": []
        },
        {
            "author": "PaintBrushBirdie",
            "body": "Quick question! just wondering why my affirmation art post were deleted when it fits the criteria? \\~",
            "score": 1,
            "replies": []
        },
        {
            "author": "KillsWithDucks",
            "body": "bots = traffic = more ads = more money.  \n\n  \nif you're looking for justice, you've come to the wrong place.",
            "score": 1,
            "replies": [
                {
                    "author": "ZuluRed5",
                    "body": "Indeed. Let's never ever change anything and just continue doing what we do. Spoiler, not all of us only care about money, mate.",
                    "score": 3,
                    "replies": [
                        {
                            "author": "KillsWithDucks",
                            "body": "i dont give a shit about money. Reddit / TenCent / google / whoever owns reddit cares a LOT about money.. so much so that they need more and more and more !  \nSo the bots stay to keep the traffic up so advertisers think they are reaching X amount of users.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}