{
    "title": "this deserves to be here as a reminder for artits/writters that it's ok if it's not perfect already in first try😊",
    "author": "girl_of_manyfaces",
    "subreddit": "wholesomememes",
    "rank": 146,
    "score": 9789,
    "upvote_ratio": 1.0,
    "num_comments (reported by reddit)": 83,
    "url": "https://i.redd.it/4gmgphr81lsd1.jpeg",
    "id": "1fve8c6",
    "selftext": "",
    "comments": [
        {
            "author": "AutoModerator",
            "body": "Hey /u/girl_of_manyfaces! Thank you for your submission!    \n\nYour post submission to r/wholesomememes has been sent to the queue pending mod review and approval. Please do not message the mods regarding your post or delete your post while it is in the queue for review.\n\nThanks for understanding! Stay wholesome. <3\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wholesomememes) if you have any questions or concerns.*",
            "score": 1,
            "replies": []
        },
        {
            "author": "Gyveliano",
            "body": "I am not trying to be mean... but the typo on the title was funny enough to me.",
            "score": 203,
            "replies": [
                {
                    "author": "LollyBonz",
                    "body": "“writters” sounds like an infection",
                    "score": 75,
                    "replies": [
                        {
                            "author": "BirbInTF2",
                            "body": "Artits",
                            "score": 57,
                            "replies": [
                                {
                                    "author": "fluffy_munster",
                                    "body": "Arttits, the art of combining bodypainting with finger painting.",
                                    "score": 18,
                                    "replies": []
                                },
                                {
                                    "author": "WingedSalim",
                                    "body": "The plural form is Artities.",
                                    "score": 6,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "HarveysBackupAccount",
                            "body": "or a food\n\nconch writters",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PomussyEnjoyer",
                    "body": "Them artits do be looking good...",
                    "score": 22,
                    "replies": [
                        {
                            "author": "Albert_goes_brrr",
                            "body": "Artistic tits ✨",
                            "score": 5,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "doortju",
                    "body": "I didn't even notice until you mentioned and I reread xD",
                    "score": 7,
                    "replies": []
                },
                {
                    "author": "Callsign_Crush",
                    "body": "I didn't notice until you said so and started snickering like a 7 year old 😄",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "mysSerrax",
                    "body": "i didn't even notice that. but now my day is made",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 34,
            "replies": [
                {
                    "author": "drgreen2001",
                    "body": "If you knew the amount of songs I wrote and scrapped over the years. A good one can take months at a time to make...",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "SchoolSupernintendo",
            "body": "“Nobody tells this to people who are beginners, I wish someone told me. All of us who do creative work, we get into it because we have good taste. But there is this gap. For the first couple years you make stuff, it’s just not that good. It’s trying to be good, it has potential, but it’s not. But your taste, the thing that got you into the game, is still killer. And your taste is why your work disappoints you. A lot of people never get past this phase, they quit. Most people I know who do interesting, creative work went through years of this. We know our work doesn’t have this special thing that we want it to have. We all go through this. And if you are just starting out or you are still in this phase, you gotta know its normal and the most important thing you can do is do a lot of work. Put yourself on a deadline so that every week you will finish one story. It is only by going through a volume of work that you will close that gap, and your work will be as good as your ambitions. And I took longer to figure out how to do this than anyone I’ve ever met. It’s gonna take awhile. It’s normal to take awhile. You’ve just gotta fight your way through.”\n― Ira Glass",
            "score": 13,
            "replies": []
        },
        {
            "author": "Funny-Performance845",
            "body": "Why only writers and artists?",
            "score": 12,
            "replies": [
                {
                    "author": "girl_of_manyfaces",
                    "body": "it applies to anyone, but mostly them bcuz we often want it to be perfect in the first try and then we can't",
                    "score": 38,
                    "replies": [
                        {
                            "author": "Mautos",
                            "body": "Yknow, in art I already realized that, but for writing I still had that feeling. I should try it again sometime. ",
                            "score": 5,
                            "replies": [
                                {
                                    "author": "MisterTimbers",
                                    "body": "The art of writing is in the editing.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "HarveysBackupAccount",
                    "body": "because it doesn't need to apply to cynical pedants",
                    "score": 12,
                    "replies": []
                },
                {
                    "author": "Remarkable_Step_6177",
                    "body": "It's visually obvious and therefore it can be objectively judged as technically lacking.\n\nIn art we assume talent, in mathematics we assume intellect. The notion that everything can be art, and therefore subjective is one of the damning problems if the pursuit is mastery.\n\nYou can look at any work of art and come to a reasonable conclusion. You cannot, or should not, do that with mathematics for instance. Because of that, artists assume they should know things that took masters **decades** to learn.\n\nIn mathematics you can easily acknowledge you don't know. That makes it emotionally and rationally relateable. In art you're left feeling incompetent, talentless, etcetera because you assume you understand. That type of ignorance is especially problematic.\n\nThe arts suffer from poor access to a good education due to its perception that it is not a hard field to succeed in.",
                    "score": 11,
                    "replies": []
                }
            ]
        },
        {
            "author": "andrybak",
            "body": "[Practice](https://www.webtoons.com/en/canvas/sarahs-scribbles/practice/viewer) and then more [practice](https://tapas.io/episode/923459).",
            "score": 11,
            "replies": []
        },
        {
            "author": "Muderous_Teapot548",
            "body": "I have a paper due at midnight that I haven't started because I keep getting imposter syndrome. Thank you for this.",
            "score": 5,
            "replies": []
        },
        {
            "author": "GachaVoyagerYuna",
            "body": "First draft? More like *practice round*! 🖌️✍️ Reminder: masterpieces aren’t born, they’re built. So go ahead and make that glorious mess—no one cares if it's not perfect yet! 😎💪",
            "score": 4,
            "replies": []
        },
        {
            "author": "Smallwater",
            "body": "But *I* care.\n\nI am my own worst critic.",
            "score": 4,
            "replies": []
        },
        {
            "author": "None",
            "body": "[removed]",
            "score": 3,
            "replies": [
                {
                    "author": "None",
                    "body": "nice!",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "gaminguage",
            "body": "If my friend did this it would end up being the one time a guy comes up and makes fun of me lol",
            "score": 3,
            "replies": []
        },
        {
            "author": "Luna_And_Fandom",
            "body": "As both an artist and a writer, I can safely speak for a lot of people that we know that people won't care about it. IT'S US WHO CARE-",
            "score": 3,
            "replies": []
        },
        {
            "author": "SyrusDrake",
            "body": "I care though.",
            "score": 2,
            "replies": []
        },
        {
            "author": "SunnyStargirl",
            "body": "As an artist myself I can confirm this. Just make whatever it is you want to make even if it's not perfect. You can't learn or improve by doing nothing.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Antique-Break-8412",
            "body": "Hellloooo Newman",
            "score": 2,
            "replies": [
                {
                    "author": "TifaBetterThanAerith",
                    "body": "Hello Jerry.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "BayouTy",
            "body": "Nobody cares because no one is looking",
            "score": 2,
            "replies": [
                {
                    "author": "girl_of_manyfaces",
                    "body": "that's the spirit",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "mirincool",
                    "body": "You have a point! No one's gonna know 👀",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "mysSerrax",
            "body": "I love that this applies to everything. it's very reassuring",
            "score": 2,
            "replies": []
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 2,
            "replies": [
                {
                    "author": "Independent_Let8198",
                    "body": "So true! 🥹",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Wrong-Tutor-9309",
            "body": "My drawings aren't as perfect as professional artists even after all a lot of erasures, I still love drawing because I know I will succeed. Stay passionate and patient artists!",
            "score": 2,
            "replies": []
        },
        {
            "author": "Firegem0342",
            "body": "I'm pretty sure there was at least 1 German that cared",
            "score": 1,
            "replies": [
                {
                    "author": "girl_of_manyfaces",
                    "body": "he wasn't german. and even tho that art professor was a jerk, mister non german boy can go and suck an egg. should've tried harder or somewhere else idc",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "N00nameyet",
            "body": "Don't mind me, I just bookmark it. This meme used for wholesome reasons is cool to see",
            "score": 1,
            "replies": []
        },
        {
            "author": "doortju",
            "body": "This also goes for dancing\nI'm a dance teacher and children always think that they should be able to do a perfect move the first time they try. Heck, I've been training for many years and there are times I still mess it up.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Radiant-Locksmith-39",
            "body": "Thank you. If only my professors had understood.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ScorchclawXP",
            "body": "I appreciate this meme",
            "score": 1,
            "replies": []
        },
        {
            "author": "NecessaryUnited9505",
            "body": "as a writer of books and songwriter , i needed this. THANK YOU",
            "score": 1,
            "replies": [
                {
                    "author": "NecessaryUnited9505",
                    "body": "![gif](giphy|26gsjCZpPolPr3sBy|downsized)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Stunning_Season_6370",
            "body": "I know how this is meant to be taken, but honestly this just demotivates me. I want people to care about what I made and if it's not perfect even critisize it. The reason it became so hard for me to draw and write is because nobody ever cared.",
            "score": 1,
            "replies": [
                {
                    "author": "girl_of_manyfaces",
                    "body": "you, of everybody, should be the very first person to care about what you do. everybody else comes afterwards",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "dear_crow11",
            "body": "This SO much 💯%!!!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Educational_Permit38",
            "body": "It’s never perfect on the first try. Always needs revision. Ask any author or writing teacher or painter.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Cheeseydolphinz",
            "body": "Yeah but you should still feel a little bad, otherwise you end of the road of modern art, and the last thing the world needs is more of that low effort garbage",
            "score": 1,
            "replies": []
        },
        {
            "author": "Senshue",
            "body": "Thank you",
            "score": 1,
            "replies": []
        },
        {
            "author": "only-on",
            "body": "I care. (I'm horrible at writing and art, but if I see something wrong that might have been an oversight I bring it up. Because if I can see it, then it's something they need to work on and I hope they can improve for next time)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Alloy_Dreemurr_A7",
            "body": "im still scared, internet man. this just makes me doubt",
            "score": 1,
            "replies": []
        },
        {
            "author": "3HaDeS3",
            "body": "Writers haven’t been doing great lately, especially when it comes to movies and tv series. It’s like they used ChatGPT to make a script but forgot to change it to their own words.",
            "score": 1,
            "replies": []
        },
        {
            "author": "mirincool",
            "body": "artits. \n\nJokes apart, really appreciate this!",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "Mines gets deleted",
            "score": 1,
            "replies": []
        },
        {
            "author": "questioningreality16",
            "body": "As both an aspiring artist and aspiring writer? ~~double feature lol~~ but seriously? I felt this! It's a bit inspiring =3",
            "score": 1,
            "replies": []
        },
        {
            "author": "None",
            "body": "I mean I make perfect stuff all the time but you do you",
            "score": 1,
            "replies": []
        },
        {
            "author": "fuckaduck009",
            "body": "hi",
            "score": 1,
            "replies": []
        },
        {
            "author": "aadirulez8",
            "body": "this is the motivation some needs sometimes",
            "score": 1,
            "replies": []
        },
        {
            "author": "lillaelilla",
            "body": "I'm laughing. A bit offended. A bit relieved. Now I'm laughing again, thanks XD",
            "score": 1,
            "replies": []
        }
    ]
}