{
    "title": "[loot] Was about to call it quits, but decided on one more scav run, damn I'm glad I did.",
    "author": "Teacher_99",
    "subreddit": "EscapefromTarkov",
    "rank": 9,
    "score": 296,
    "upvote_ratio": 0.95,
    "num_comments (reported by reddit)": 48,
    "url": "https://i.redd.it/syda10m0ldpe1.png",
    "id": "1jdwz8z",
    "selftext": "",
    "comments": [
        {
            "author": "Teacher_99",
            "body": "had a fair bit more, but only took a pic of the \"good\" stuff after sorting it all. not sure what fire clean is but seen a lot of talk about it!",
            "score": 40,
            "replies": [
                {
                    "author": "Joie116",
                    "body": "Fireclean just doesn't show up often, not expensive but I think it'll gatekeep hideout upgrades",
                    "score": 27,
                    "replies": [
                        {
                            "author": "TheBrokenSnake",
                            "body": "Incorrect, fireclean shows up in an abundance but only when you don't need it for hideout, and only becomes scarce the second you do...",
                            "score": 27,
                            "replies": [
                                {
                                    "author": "LunorVoHarden",
                                    "body": "Ah, I see your fireklean and my elite pliers share the same spawn rates",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "author": "TheBrokenSnake",
                                            "body": "Oh god I couldn't find elite pliers for so long... I swear this game has some dynamic loot to make you less likely to find the items you need.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "author": "JinterIsComing",
                                                    "body": "Took me a month to find a single measuring tape. I feel ya.",
                                                    "score": 3,
                                                    "replies": []
                                                },
                                                {
                                                    "author": "Central740hio",
                                                    "body": "You know there is a trade in one of the traders level 2 that you can get the elite pliers for some really easy found loot",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "author": "TheBrokenSnake",
                                                            "body": "The barters aren't FIR?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Central740hio",
                                                                    "body": "Damn really? That sucks I had just seen it yesterday but hadn't tried it yet",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "author": "Seasickman",
                                                                            "body": "They never been fir",
                                                                            "score": 1,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "subarupilot",
                                            "body": "Fucking drain cleaner for me. Stuck on Nutrition Level two because the only one I have found has been on a PMC I killed as a Scav.",
                                            "score": 3,
                                            "replies": []
                                        },
                                        {
                                            "author": "e-katt",
                                            "body": "Shoreline Outpost, ive literally found 20+ elite there…. On the scav and PMC",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "galvanic_bytes",
                                    "body": "Totally agree. Can't find basic common items the second they become the next needed item for upgrading. After upgrade, you're literally selling them at the rate you're finding that item bc it's not needed and you have too many. I had trouble late game finding compact fluorescents??!? Really I was making room by selling them earlier for motor, gfx cards, etc..needing storage then it's dry again and you find one per 3 raids.. super weird. Seems dynamic like comment below.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "MrXoTiCEaS",
                    "body": "My last raid last night I found rb-bk on an ai scav i killed shit was nice cus i was broke 😅",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "NuttinInYoHoe",
                    "body": "Fireklean is my last kappa item and I’ve been looking for 6 days 😑",
                    "score": 1,
                    "replies": [
                        {
                            "author": "ProcyonHabilis",
                            "body": "Just hit file cabinets, it comes up all the time",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Seasickman",
                                    "body": "Crazy how people think they have an answer its called rng when someone people claim they can't find there items its probably because the game won't spawn it for them in their raids",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "ProcyonHabilis",
                                            "body": "I have idea what you're saying dude lol. Read that sentence out loud and you'll see why. \n\nIn any case, it is indeed just RNG. That's why my proposed solution is to hit a container that commonly spawns the item in question and appears in large clusters. The only trick is to select the right dice, and then roll them over and over. In this case, file cabinets are the optimal strategy for that goal.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Seasickman",
                                                    "body": "Another thing is i found My fireclean day 2 of wipe haven't seen it since so glad I horde everything I had trouble finding power drills and thermite that too eons to find spent days looting not doing quest and never found it makes sense this wipe has the lowest player count yet",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "ProcyonHabilis",
                                                            "body": "Ok never mind, I guess that's just how you communicate. Have you considered punctuation? \n\nSeriously mate, actually try reading your comment out loud as written without adding in the pauses that you left out in the text. See how it's really hard to understand, and sounds like insane ranting? The way the rest of us avoid that is by breaking your thoughts up into sentences.",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Manslentt",
            "body": "Nice one, whered you find a keycard as a scav? Shame its only worth 200k. And I dont know what talk you have heard but fireklean is just an ordinary streamer item worth like 30k hah",
            "score": 25,
            "replies": [
                {
                    "author": "Toasted_Flowers",
                    "body": "It’s used for some decent batters iirc. I hoard kappa items for daily turn in bc lazy marine.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "GavinRayDev",
                    "body": "I think Shoreline is the only place where Yellow spawns in a non-locked area",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "fuckoffweirdoo",
                    "body": "Woods has a violet key card spawn in the SUV at USEC checkpoint ",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Sevantt",
                    "body": "Its also used for workspace upgrade in hideout",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "Asscreamsandwiche",
            "body": "Nikita knows.",
            "score": 5,
            "replies": []
        },
        {
            "author": "alesia123456",
            "body": "How did you find a yellow as Scav",
            "score": 5,
            "replies": [
                {
                    "author": "G3n3sis1988",
                    "body": "You have to know the spots where they can spawn and always have a look or be just extremly lucky to spot it randomly. I found two red and a yellow card shoreline resort: one red  gym in the blue drawers, one red in between bed and nightstand in one of closed rooms, one yellow on the desk in the small office of admin building.",
                    "score": 8,
                    "replies": [
                        {
                            "author": "alesia123456",
                            "body": "Damn I totally forgot they spawn more on shoreline now wtf am prestige 2 not having played casual shoreline at all \n\nThank you so much for the reminder. Wish BSG would finally fix the loot so all maps are equally interesting again",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "garriej",
                                    "body": "You’re prestige 2. You havent played anything casually.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "alesia123456",
                                            "body": "Honestly coming from csgo, every minute playing Tarkov feels casual. But I was more referring to loading into a raid without a goal except survive",
                                            "score": -3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "nerd_ginger",
            "body": "Where have people been finding the mtubes? I've been hitting the regular spots with no luck.",
            "score": 3,
            "replies": [
                {
                    "author": "MaximumMysterious194",
                    "body": "Reserve and lighthouse duffle bags and tech spawns/crates i found more on lighthouse than reserve, it's easier on PMC but possible with a scav as well",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "anklebytr",
            "body": "What map",
            "score": 2,
            "replies": [
                {
                    "author": "Teacher_99",
                    "body": "Shoreline",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "Psychotic_Doctor64",
            "body": "I love that tarkov can give you one last hurrah or give you a raid so you'll never come back",
            "score": 2,
            "replies": []
        },
        {
            "author": "Puzzleheaded-File677",
            "body": "Also here to ask where you found yellow as a scav",
            "score": 1,
            "replies": [
                {
                    "author": "Teacher_99",
                    "body": "On a pmc, he was leaving resort on shoreline and I head eyes’d him with the m700 my scav got.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "jean707",
                            "body": "Lol, madman not even container it",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "StraightEmployees",
            "body": "Too bad SSA is borderline useless. Great for penetrating armor but it has disgusting stats and will bankrupt you to fill up 5 mags with it. 995 is better in every way",
            "score": 1,
            "replies": [
                {
                    "author": "horriblehorriblepuns",
                    "body": "True but honestly i find lots more ssa than 995 on labs",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MindGroundbreaking51",
            "body": "Where?",
            "score": 1,
            "replies": [
                {
                    "author": "Teacher_99",
                    "body": "Shoreline",
                    "score": 2,
                    "replies": [
                        {
                            "author": "MindGroundbreaking51",
                            "body": "Aaah, health resort?",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Teacher_99",
                                    "body": "Pmc, he was leaving the resort and I had an M700 scav.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "MindGroundbreaking51",
                                            "body": "Damn, you lucky duck!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "the_GOAT_44",
            "body": "Military tube...*gimme dat*",
            "score": 1,
            "replies": []
        },
        {
            "author": "the_GOAT_44",
            "body": "Military tube...*gimme dat*",
            "score": 1,
            "replies": []
        }
    ]
}