{
    "title": "[New Player] i have 130 hours in the game and all that happens is i die",
    "author": "Smooth_Lake_2020",
    "subreddit": "EscapefromTarkov",
    "rank": 17,
    "score": 81,
    "upvote_ratio": 0.86,
    "num_comments (reported by reddit)": 101,
    "url": "https://www.reddit.com/r/EscapefromTarkov/comments/1jdwit2/new_player_i_have_130_hours_in_the_game_and_all/",
    "id": "1jdwit2",
    "selftext": "All of my runs end up with me dying over and over again against players with what I can only assume is end game gear. I have 700 roubles and no guns in stash and when I do scav runs I get sniped from nowhere. I feel like I should have never touch this game.",
    "comments": [
        {
            "author": "KratostheGamerrr",
            "body": "That’s how everyone starts out, it gets better. Focus on moving slow in cover and fast out in the open. Don’t loot until you’re sure it’s clear. Sounds is more important than sight, works both ways. Find some people to play with, that’s always a major help. Using the in game party up function is almost a guarantee they’ll kill you on spawn though.",
            "score": 78,
            "replies": [
                {
                    "author": "Smooth_Lake_2020",
                    "body": "I will try to move slower and got it don't trust in game party up",
                    "score": 5,
                    "replies": [
                        {
                            "author": "LunchComprehensive80",
                            "body": "One thing to note that happens enough is if a player scav tells you to hit their arm with a knife, don't do it. Getting hurt by another player scav will give you fence rep if you kill them (they are called traitor scavs for hurting other scavs), so some players will VOIP and try to get that to happen.",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Retroficient",
            "body": "I've got 1300 hours and all I do is die. Welcome to the club :)",
            "score": 57,
            "replies": [
                {
                    "author": "SparkGamess",
                    "body": "1000 hours here, I have a 42% survival rate overall. It'll get better bro. Just a little, but it will improve",
                    "score": 10,
                    "replies": [
                        {
                            "author": "Smooth_Lake_2020",
                            "body": "Okay I hope I have a 11% survival rate right now",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "BaziJoeWHL",
                            "body": "3k hours and i had 46% while doing early wipe tasks",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "justanothersmoker92",
                    "body": "Honestly I got 3000 hours and all i do is dying tooo ....  :)",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Smooth_Lake_2020",
                            "body": "yay :')",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Sad-Emu6142",
                                    "body": "Only 6k more hours to go and you move from dying non-stop to killing 1 and then his boy rushing you while you serv up.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Smooth_Lake_2020",
                    "body": "thank :(",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mr_MakeItHail",
            "body": "Put in another 900-1000 and you’ll start to get the hang of it!!",
            "score": 19,
            "replies": [
                {
                    "author": "Smooth_Lake_2020",
                    "body": "That will take a while for me",
                    "score": 4,
                    "replies": [
                        {
                            "author": "Annonimbus",
                            "body": "Two things to help you along the way:\n\n\n\n\n1) find a Sherpa. Play the game with someone who can help and teach you. \n\n\n\n\n2) Scav runs, just load into factory and immediately run to the underground bunker exit. You survive 90% of those runs and they are done in 2 minutes. A fast way to get money, equipment and items\n\n\n\n\n\n\nThe first wipe is nothing but a tutorial. Don't get discouraged.",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "Smooth_Lake_2020",
                                    "body": "got it, thanks",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Temporary-Deep",
                                            "body": "It should also be mentioned to join the EFT discord. There is a link on the eft main website. There is almost always a group to join up with and get sherpa help. (And unlike the random join, you don't get killed, and if they do, you have their discord name and in-game name, and they will get banned when you report)\n\nThen, if you have a second monitor or your phone, it's easier, but pull up the EFT wiki page and use the maps and quests pages for locations and sometimes tips.",
                                            "score": 2,
                                            "replies": []
                                        },
                                        {
                                            "author": "PricklyPricklyPear",
                                            "body": "You can kinda just loot factory as you see fit most of the time as a scav. Just watch out for tagilla and don’t go in the office area if you hear shots. But I’ve found with scav karma these days, most people won’t shoot. Then you can try some pmc raids with the gear and money you get.\n\nJust focus on a few maps  at a time to learn. Customs and woods are good ones because lots of early quests are there. You can do some scav raids to try those out, but for me jamming a factory scav quickly and then doing a pmc raid is a quick way to get some money.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "ConsequenceRepublic",
            "body": "Play PVE until you know the maps pretty well. A large part of staying alive is knowing the map well enough to anticipate ambushes",
            "score": 20,
            "replies": [
                {
                    "author": "Smooth_Lake_2020",
                    "body": "I might do that",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Sad-Emu6142",
                            "body": "Or. Play during off-peak hours.\n\nWeekends and 6-9pm is a death trap.\n\nAfter midnight and during the weekdays is chill af",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "Unlucky-Dirt9523",
                            "body": "Don't play pve. Learn how to survive against humans.  A bunch of people have already said this but 90% of being successful is positioning and movement. You can't just sprint around, the raids are 50 minutes long for a reason.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Thisismy3account",
                    "body": "PvE is just as bad lol at least on normal you have a chance of people missing shots vs the aimbot the ai has.",
                    "score": -5,
                    "replies": [
                        {
                            "author": "ZeekBen",
                            "body": "Either PvE is way easier than you think it is or PvP is way harder than you think it is. Most PvP players have like 70%+ survival rates which would be insanely high for PvP",
                            "score": 8,
                            "replies": []
                        },
                        {
                            "author": "ConsequenceRepublic",
                            "body": "lol no. My survival rate is like 20% higher on pve. Once you figure out how the AI behaves it becomes a cakewalk.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "None",
            "body": "[deleted]",
            "score": 28,
            "replies": [
                {
                    "author": "Smooth_Lake_2020",
                    "body": "I do and he is a timmy as well",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "egneverthrows",
            "body": "Try pve mode. As a beginner I enjoy it a lot. Learned all the maps this way.",
            "score": 25,
            "replies": [
                {
                    "author": "Smooth_Lake_2020",
                    "body": "I’m thinking about it",
                    "score": 7,
                    "replies": [
                        {
                            "author": "TheAngryCrusader",
                            "body": "PVE reinvigorated my love for the game honestly. I get to try guns and builds I never could achieve in PVP.",
                            "score": 18,
                            "replies": [
                                {
                                    "author": "woodzopwns",
                                    "body": "I feel you there, I often get a sick decked out mutant in PVP that I can't even consider bringing in when I could sell it for like 400k amd bring 5 UMP kits. Every time I do bring it in I die instantly.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Joie116",
                            "body": "Everyone's going to tell you not too, because they've got something against the idea. But these are the same people who also recommended using offline raids to learn before pve.",
                            "score": 4,
                            "replies": [
                                {
                                    "author": "Billib2002",
                                    "body": "If he wants to get it then great but the fact that half the comments are like \"yeah bro just spend 20 more bucks to play against the AI in this game you're not even sure you like yet\" is kinda insane",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Joie116",
                                            "body": "130 hours is a lot of time to put into a video game you're not sure about, I had 0 hours when I bought eod years ago -shrugs- it's worth the 20 dollars to make progression while learning the maps, if op doesn't already own it. And these \"half the comments\" are giving the suggestion just for that, to learn the game because ops not having fun being stomped and frustrated.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Gold-Ad-3877",
                            "body": "Try watching streamers too if you have the time, they often give you a lot of information if you ask, and shows you how to play efficiently, the paths to take on the maps etc. If you have arena might as well play it, it'll give you some baseline for close range pvp, and you can use any gun you want",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "drewts86",
                            "body": "I know it’s rough now, but I’d say don’t give in to PVE just yet. This game is baptism by fire and it’s absolutely punishing on new players. Most players are considered “new” until they’re close to 1000 hrs because Tarkov is really a game of knowledge. The best thing to do is find someone to play with that can help show you the ropes to accelerate your learning. The official EFT Discord is one place to look, or most of the streamers have Discords as well. Absolutely under no circumstance should you ever match with randoms in the game lobby. Those people WILL kill you as soon as you spawn in.\n\nPVE won’t give you the same highs and lows that you get in PVP, but you’re welcome to try.\n\nScav every chance you get, it gives you an opportunity to explore without being harassed by AI and you don’t take a financial hit if you die. Also, try to pick one map and learn it fairly well before moving on. Also use your scav to learn loot runs. File cabinets and tool boxes are going to be your best friend for upgrading hideout and for quest items. When you have about 1.4M rubles it’s probably a safe time to consider buying a junk box to put all your barter items in. You’re eventually going to want multiple junk boxes to hoard all the items you’re going to need. There are charts on the wiki and elsewhere that have a full list of all the hideout and quest items you’re going to need. Only prioritize initial hideout module and quest items at first, otherwise you’re going to be overwhelmed with shit you don’t need.\n\nAmmo and armor are of absolute importance. At this point in the wipe everyone is running a minimum of Tier 4 armor, and you want to be running ammo that has at least 40 pen to defeat that armor. Use eft-ammo.com to get an understanding of what ammo to run.\n\nDon’t re-peek scavs from the same angle, that’s a good way to end up dead. Try to peek them from different cover.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Smooth_Lake_2020",
                                    "body": "Thank you this one has been very informative",
                                    "score": 1,
                                    "replies": []
                                },
                                {
                                    "author": "SpacM",
                                    "body": "The pen values are literally in game now",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "drewts86",
                                            "body": "Sure, but it a whole lot easier to see all the different ammos at once that can have the pen value you're looking for, or for comparing other data about the ammo that isn't available to view in game. And that also requires you picking up at ammo to look at its stats. If you can remember which ammo is good from looking at eft-ammo.com it will save you time from picking up ammo that's shit.",
                                            "score": 4,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "SoupKitchenHero",
                            "body": "If you think you would like the game but are having trouble with the PvP aspect of it, i would try PvE. It is fun, and much more mellow. The PvP is hard to get used to, and PvE can help you learn mechanics and map knowledge, which are both hard to get used to",
                            "score": 1,
                            "replies": []
                        },
                        {
                            "author": "Reddit_slayer123",
                            "body": "If you do get pve. Send me a message on here and I'll sherpa you. I don't do pvp anymore cause I was tired of the wipes.",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "TheBigTreezy",
                                    "body": "I thought pve does not have wipes?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "Reddit_slayer123",
                                            "body": "Ahh I mistyped. I was tired. You are correct. Thanks for pointing that out to me!!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Smooth_Lake_2020",
                                    "body": "will do",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Dabox720",
                            "body": "Lol idk why you wouldn't. Pvp is competition. You're getting upset at losing. You are a novice in a high complexity decade old game. You're getting upset at the inevitable. \n\nPvE also has it's issues but it is far more beginner friendly.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TheBigTreezy",
                    "body": "This.  Especially if you don’t start right after a wipe with everyone, you’ll probably be way out geared",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MrPwrEng",
            "body": "The game has a warning when you start a wipe - You will die a lot.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Godeshus",
            "body": "It took me a shift in perspective coming off mostly playing CS for 20 years. Start thinking about what's happening in your raid more. Take every death as something to learn from.\n\nWhat could you have done different? And not just the 10 seconds leading up to your death. The entire raid. Where did you spawn? Where did you go? What were you doing? Could anyone else be doing the same thing as you? Where did they spawn? How long will it take them to get there? Are you likely to will you get there before them? Will you cross paths first?\n\nThese are the kinds of questions you can only answer once you've experienced the game enough to start putting together how a raid will likely play out as soon as you spawn. In the mean time, kit up and get back in. Scav between raids mad keep trying to figure out how to beat the challenges you're presented with.",
            "score": 3,
            "replies": []
        },
        {
            "author": "animal1988",
            "body": "I'm a Timmy but I'm close to 1000 hours. I'd be happy to partner with you. Tarkov is scary, and maybe we can work together to make it less so .",
            "score": 3,
            "replies": [
                {
                    "author": "GroundbreakingWork22",
                    "body": "Let’s run some raids boss",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheBudMan101",
            "body": "Scav streets it’s pretty chill there for scavs",
            "score": 4,
            "replies": []
        },
        {
            "author": "overseaslink",
            "body": "You’ll have bad days and good days, if you invest any time at all into trying to learn things through youtube and social media it will go a long way, find a playstyle and stick to it and you’ll find good moments that will make playing worth it. If not then just put the game down, its no big deal, you can try again another time",
            "score": 2,
            "replies": []
        },
        {
            "author": "0xPeggCity",
            "body": "Focus on learning a few maps (customs, woods, factory). Get to know spawns, hot spots, loot routes. Move slow at first, being weary of close spawns. Move slow near hot spots so you can hear and be unheard. \n\nOnce you've had enough and aren't having fun, drop the game for the time being, and then when the next wipe occurs you will have gathered all that knowledge and can apply it to a fresh start. <- This is the most rewarding part about playing Tarkov imo. There's is so much depth to the mechanics, maps, guns, questing, etc. So long as you can handle the initial beating it's an extremely rewarding experience. \n\nThat being said, if you're not the type to suffer alone, you can seek a sherpa on Discord that will guide you through some matches and teach you about the game.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Falaflewaffle",
            "body": "It's ok I'm almost on 7k hours I still have death streaks  I have a 58% survival rate and still think I'm dog shit at the game you are just going to die in game but every death should be a learning opportunity but sometimes the cards are just not in your favour.\n\nSince this is late wipe now and everyone is quite geared. I would recommend pve to get the feel of the game first then come back to pvp when you feel up to it.",
            "score": 2,
            "replies": []
        },
        {
            "author": "mren92",
            "body": "Remember this is a game you'll die a lot, I reckon I had a 30-40% survival rate when I first started. Took me about 500 hours to hold 50% pretty consistent, close to 1000 before I was hitting 60%. What that basically means is for 1000 hours I died half the time I played. Dying is learning, you need to die to understand where and how you can die. Next raid you'll be more cautious through that section or check that window or door. As long as you treat every death as a lesson you'll learn. As people have said learn the maps, hell even if you just play one or two maps over and over and learn them inside out, you'll get better at PVP and will be able to take that knowledge into different maps. Don't give up, Tarkov isnt for everyone but it's one of my favorites for a reason.",
            "score": 2,
            "replies": [
                {
                    "author": "Smooth_Lake_2020",
                    "body": "I guess i got bad luck because 11% survive rate and the maps i know i get shit on",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Neat_Concert_4138",
            "body": "When I first started I would run around with a pistol learning the map and doing loot runs. Once I got some roubles I would start running gear until I went broke and then went back to pistol runs.",
            "score": 2,
            "replies": []
        },
        {
            "author": "SurfinSocks",
            "body": "\\[Old Player\\] I have 3200 hours and all that happens is I *mostly* die",
            "score": 2,
            "replies": []
        },
        {
            "author": "LemmeTellU420",
            "body": "I have 4000 hours in the game and survive 1 raid out of 3",
            "score": 2,
            "replies": []
        },
        {
            "author": "AnIdioticPigeon",
            "body": "Thats the fun of it, this game wouldn’t be anywhere near as exhilarating if it were easy",
            "score": 2,
            "replies": []
        },
        {
            "author": "Smooth_Possible6343",
            "body": "What’s your discord? I got you with some tips !",
            "score": 1,
            "replies": []
        },
        {
            "author": "Franklin_le_Tanklin",
            "body": "Keep going little Timmie!!\n\nScav In between every pmc run\n\nUse cheap guns that come back in insurance like the kedrb and .336 gornasty \n\nAlways insure \n\nYou’ll get there. Treat every death as a learning opportunity",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheSwordOfCheesus",
            "body": "You need to try playing with someone who’s got more time and learn from them. Check out the official discord",
            "score": 1,
            "replies": []
        },
        {
            "author": "iedy2345",
            "body": "I have 8000 hours and all that happens.....is i also die , sometimes i simply have those kind of days. It's part of the game and the learning curve, you will improve but it requires time invested , sadly.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Oknamehere_4980",
            "body": "I think this game and community need to understand that shirpas are a necessity, literally everyone I have brought in (if I like them of not after a few days) have said they enjoy the game ten fold because they played with my squad, this game is brutal and teaches you the necessity of teamwork. I can play sole, I have 9500 hours to back up understanding of movement and basic military knowledge to maneuver in situations but the regular person does not. Their is no shame at all to asking for help, I think that is a subtle teaching point in this game is needing support and comrodery. Use the discord and ask for help, their are tons of people like me who want this game to thrive and to teach, explore my friend and in time you will never want to escape tarkov",
            "score": 1,
            "replies": []
        },
        {
            "author": "TheMediumEagle",
            "body": "When I first started I sucked so bad. I decided to run Factory, pistol only (the TT was my pistol of choice). I did that for about 50 raids. It made me become way more patient with my footsteps and my aiming. Once you improve on your fundamentals, things get much easier.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ok-Chart-7441",
            "body": "Game has a very steep learning curve. Are you learning anything from your deaths? Perhaps better positioning or identifying ways you could have approached the situation better?   \nTrust the process, but most important thing is to have fun. It's a video game afterall.",
            "score": 1,
            "replies": [
                {
                    "author": "Smooth_Lake_2020",
                    "body": "yes don't move because i am mostly getting sniped from somewhere",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "puFFelz",
            "body": "Im an 2000+ h player. But I even know how I started to learn tarkov. In the beginning, I didnt care about any quest. I just wanted to learn the maps. I think my first 200h as an PMC was on customs. No other map. I joined only other maps as an SCAV or when i played with some friends who had far more hours than me.  I thinkthe follow things are imprtant. \n\n\\- Where are the spwans for PMC's?\n\nBecause of this u know the way of other PMC's for their extract / Which is the fastes way for them for Hotspots. like Dorms. \n\n\\- As u said in experience as an scav - Where can I snipe? \n\n\\- Which buildung and and windows are available for players \n\n\\- How many ways are there for an extract? Like ZB-1011\n\n  \nAs u can see, everything is map knowledge. \n\nIf u are really interested in the game - Go to the wiki, (https://escapefromtarkov.fandom.com/wiki/Customs?) for example. Open the map on the secend screen and die a bunch of time. Tarkov is bad for beginners, but u will have so damn good feeligs for good round. Maybe u killed 2 PMC. Or ur first extraction of an LEDX. Stay on!",
            "score": 1,
            "replies": []
        },
        {
            "author": "WebDad1",
            "body": "I had about 1500 hours before I really started to \"get\" Tarkov.\n\nI'm just under 2k hours now, and my KD sits around 12-15.\n\nBest tip I ever heard was \"Run if you're more likely to be seen, walk if you're more likely to be heard\". Run across open spaces with no cover, walk when you're in cover. Sound is EVERYTHING in this game. If you've got good awareness and a decent sound setup, that can carry you very far alone.\n\nIf you have a second monitor, pull up interactive maps on it. If you don't, get one.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Nexus_Roy",
            "body": "First 2000 hours are tutorial. Welcome.",
            "score": 1,
            "replies": [
                {
                    "author": "Smooth_Lake_2020",
                    "body": "that is ridiculous",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Norbet01",
            "body": "Focus on movement, don't be in one place too long.\nTake cover, think that every second out of cover is a dice roll where you might die, sniper, camper, random scav, doesn't matter. In the beginning imo avoid PMC to PMC fights as you don't need to fight for 80% of the quests.\nImo PMC raid then SCAV, PMC then scav again...etc this helpedw get a handle on it",
            "score": 1,
            "replies": []
        },
        {
            "author": "ilovegunskalash",
            "body": "being broke is better than not playing like me. i have 55mil and im still scared.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MiserableWriting1",
            "body": "Scav factory straight to extract. There are 3 main scav extracts, use the office window and the camera door, door 3 is a pmc extract you might find some there. When you're feeling more comfortable look at the timer if it's 10m+ there may be a lot of pmcs there, under 8m is generally fine to go loot stuff. ",
            "score": 1,
            "replies": []
        },
        {
            "author": "hopesendsirus",
            "body": "The beatings will continue until morale improves! 2000 hrs and I still can't play Reserve or Labs. You just have to learn from experience (dying) the rotations of the maps and where spawns are etc. You learn where and where not to go. Move from cover to cover and know your exit at all moments. You learn the chokepoints and PvP hot zones. Some places you can't linger long or it's over. Watching map guides could help you. Or just keep playing, and it'll all just click.",
            "score": 1,
            "replies": []
        },
        {
            "author": "TroutsHunter",
            "body": "You need a good squad to teach you the ropes.  This game is very very difficult if you don’t have some Sherpas in the beginning.",
            "score": 1,
            "replies": []
        },
        {
            "author": "RocklinSockling",
            "body": "Sounds like you're trying to loot when you should pvp. If you constantly keep getting shot in the head while looting, it means you aren't using the movement system to make yourself a difficult to kill target.",
            "score": 1,
            "replies": [
                {
                    "author": "Smooth_Lake_2020",
                    "body": "no i will run across a road and then hear a single bullet and then die",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "No-Cicada-7128",
            "body": "First wipe just expect to run out of money and rely on scav gear as you get a feel for it, do quests when you can *wipe is in like 2 months) 2nd wipe you will have more stable footing will do better",
            "score": 1,
            "replies": []
        },
        {
            "author": "lucastreet",
            "body": "As other said, it's absolutely normal.\n\nIn particular if you started alone and not with someone that explained you the basics or helps you early to know the maps, the spawn points, when to move... it's normal.\n\n  \nI hope you'll keep going cause, when you start to get the hang ot if it becomes very rewarding. Even if for every 5 death you do 1 kill, that kill feels immensly satisfactory.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Frientlies",
            "body": "Took me about 200 hours to start winning 1/3 of my pmc gun fights while still playing like a rat.",
            "score": 1,
            "replies": []
        },
        {
            "author": "MaezinGaming",
            "body": "Pve until you learn",
            "score": 1,
            "replies": []
        },
        {
            "author": "errorsniper",
            "body": "1300 hours all i do is die too bud.",
            "score": 1,
            "replies": []
        },
        {
            "author": "BountyBoard",
            "body": "SCAV SCAV SCAV SCAV. You can learn the maps without much resource drain, you can find a bunch of quest items for your PMC, and you can build your bankroll. Until you know the maps like the back of your hand you're always gonna be at a disadvantage. Only way to fix that is to play and hopefully not die.",
            "score": 1,
            "replies": [
                {
                    "author": "Smooth_Lake_2020",
                    "body": "It's hard to scav when i have to wait half a hour for it. Then die in like 10 minutes",
                    "score": 1,
                    "replies": [
                        {
                            "author": "BountyBoard",
                            "body": "Vehicle extracts build your Fence rep rather quickly, a good way to build up is run Woods. Another thing I'd honestly recommend is Arena. You build pvp character levels, passive skills and weapon mastery, as well as 1.5mill a day transfer. If you're really into Tarkov, they made Arena a great tool to help ease the early life pains.\n\nEDIT - PVE as well, another great new player tool",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Youreallythinksoeh",
            "body": "where are you located? I’m happy to help you learn. I’m NAE.",
            "score": 1,
            "replies": []
        },
        {
            "author": "SprayTanKaren",
            "body": "Bud I’m floating around 3,500 hours and still have nights where I die 10 raids in a row and log out ",
            "score": 1,
            "replies": []
        },
        {
            "author": "melawfu",
            "body": "Scav factory. Loot or kill on the way to extract, or hide and loot the leftovers. Use that loadout with your PMC on factory again and gear up until you die. \n\nDo that until you have a couple of million rubels and confidence in PvP.",
            "score": 1,
            "replies": []
        },
        {
            "author": "jrfurr",
            "body": "Shoot me your discord and I can show you some SCAV routes that are pretty chill not sure if its good but my scav survival is 74% with 240 total.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Eldgrim",
            "body": "One simple tip. Walk. Everyone is running around making loud noise. Walk and you will hear them before they hear you and then you can surprise them or avoid the fight.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Xphil911",
            "body": "Yeah 130 hours is still the tutorial. At 1000 ingame hours you begin to get good",
            "score": 1,
            "replies": []
        },
        {
            "author": "No_Set_5982",
            "body": "This is pretty much my experience with Tarkov as well. I should have nearly as much hours as you have now and it just do be like that. I nearly never see players before they see me and 95% of them spotting me first results in my death. And even the few times I saw a player first I really struggled to get rid of em'.  I don't even play that much anymore cause it's just hard to keep up, cause using good loadouts to keep up with more experienced players will be lost because you still die and you go broke and cheap Loadouts can't keep up, resulting in losing it aswell. It just feels like a Hamster Wheel atm.",
            "score": 1,
            "replies": []
        },
        {
            "author": "EmaMacca5",
            "body": "U can try selecting only one server (the one with the higest matching time) u will have a long queue time (like 10 min to enter the game) but u will be i an almost empty server, only u and maybe 1 or 2 players. U will run into less people and u can build up some money. I suggest u to do this only when u need it the most cause waiting time is very annoing and u won’t learn to pvp if u never pvp. But it can be an easy way to farm some money",
            "score": 1,
            "replies": []
        },
        {
            "author": "MadMikeDisease",
            "body": "Sherpas my friend, people online who will help you learn how to play the game in a sustainable way.\nYou can find them in the BSG discord, and also in many streamers discords.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Inevitable-Stage-490",
            "body": "A large majority of new players go through a similar struggle.\n\nFind one or two good friends that kno how to play.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Poofterman",
            "body": " A few options.\n\n1. Go play PVE like a pussy, and probably still complain about AI being too good.\n\n2. Pour yourself a glass of cement and harden the fuck up. 130hrs is nothing in Tarkov. You will get better. Map knowledge, spawn knowledge and map flow are the single most important factor in winning fights and not dying. This takes time. Lots of time.\n\n3. Give up. Realise you just aren’t cut out for the pain which is Tarkov.",
            "score": -12,
            "replies": [
                {
                    "author": "Menschenpyramide",
                    "body": "Tough guy over here",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "goldjunge_",
                    "body": "You could have expressed it a bit more gentle, but you are basically spot on.\n\nTo OP, sure you can play some PVE or offline mode to learn the maps a bit more and get used to some mechanics, but it will never prepare you for the madness, adrenaline, pain and satisfaction of PVP.  \nSteepest learning curve of all games i've ever encountered.",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "lite6ite",
            "body": "I'm on 200h hours rn I've played mostly PVE. While I don't think dying will ever go away, I've found PVE useful to learn maps, loot spots, quest locations, hideout loot, etc.\n\nIt's still challenging for me to play against aimbot PMCs, but it teaches me stuff like rotating, not re-peeking the same angle, controlling the spray of the guns, deciding when to heal or loot or run away etc. In no way is it authentic to the experience of the PVP mode, but playing PVE has been very helpful as a new player.",
            "score": 0,
            "replies": []
        }
    ]
}