{
    "title": "Daredevil: Born Again - Spoiler Free FAQ",
    "author": "steve32767",
    "subreddit": "marvelstudios",
    "rank": 1,
    "score": 154,
    "upvote_ratio": 0.96,
    "num_comments (reported by reddit)": 0,
    "url": "https://www.reddit.com/r/marvelstudios/comments/1j4ksmy/daredevil_born_again_spoiler_free_faq/",
    "id": "1j4ksmy",
    "selftext": "**Hey everyone!**\n--\n\nWe've been seeing a lot of repeat questions come through the posts and queue so we are going to put some of the common ones here for reference. This thread will be locked so there will be no chance of Daredevil: Born Again spoilers below.\n\nIf you come up with anything you'd like to see added to this, feel free to message us in the modmail!\n\nLet's get started...\n\n--\n\n---------------------------------------\n\n**What do I need to watch before Daredevil: Born Again?**\n--\n\nMost MCU entries try to give you enough context within the feature so you can pretty much go in ... blind. This one is a bit different, since there are three seasons of Netflix's Daredevil that precede it.\n\nDDBA is mostly set up to be a continuation of these stories, so you will get the most out of the show if you have seen all three seasons of Netflix's Daredevil + the Defenders.\n\nIf you don't have time to do that, here are some options.\n\n**Least Time Investment:**\n\n> [Daredevil RECAP Before Born Again](https://www.youtube.com/watch?v=JozNvkFfuD4)\n\n> Man of Recaps covers everything from DDS1, DDS2, Defenders, DDS3, Punisher S1-S2, Hawkeye and Echo that you might need to know before watching Daredevil: Born Again.\n\n**Medium Time Investment:**\n> Watch Daredevil Season 3 on Disney+. If you have time, DDS1, DDS2, a Defenders recap video, and DDS3 are the quintessential Daredevil stories.\n\n**Most Time Investment:**\n> - Daredevil Season 1\n\n> - Daredevil Season 2\n\n> - The Defenders\n\n> - Daredevil Season 3\n\n> - Punisher Season 1\n\n> - Punisher Season 2\n\n> - Hawkeye Disney+ Series\n\n> - Echo Disney+ Series\n\n> Spider-Man: No Way Home and She-Hulk both feature Daredevil cameos, but don't really have enough story-wise for him to make them essential to this list.\n\n--\n\n---------------------------\n\n**What powers does Daredevil have? What powers does Wilson Fisk/ Kingpin have?**\n--\n\nMatt Murdock fell victim to a chemical spill as a young boy, which he suffered after saving a stranger's life from on oncoming car. The unidentified chemicals got into his eyes and rendered him blind-- but as an unexpected effect, he received superhuman heightened senses. His remaining heightened senses combine to give him a \"radar sense\", similar to echolocation, which he uses to \"see\" without seeing. In season one he says it's similar to viewing \"a world on fire.\"\n\nIt is not a pre-cognitive danger sense like Spidey's Peter Tingle.\n\nOther than his super-senses, he is a master in hand-to-hand combat and acrobatics. In She-Hulk and Daredevil: Born Again, they seem to play this up a bit more into super-territory, leaving this aspect of Netflix's *groundedness* of the character behind.\n\n--\n\nWilson Fisk is an un-enhanced individual but has always been shown to be VERY strong. This also seems to have been dialed up a bit in the Marvel Studios versions of his character-- as in Hawkeye he >!takes arrows to the chest, unphased!< and is shown ripping a car door off its hinges with his bare hands.\n\n--\n\n______________________\n\n**Are the Defender-Verse series (Daredevil, Punisher, etc) from Netflix canon to the MCU?**\n--\n\nIn short, yes. They have been canonised by Brad Winderbaum (current Head of the Marvel Television branch of Marvel Studios and one of Marvel Studios' oldest producers) and the shows have been added to the official MCU timeline on Disney+ and Marvel.com.\n\nThough not produced under the \"Marvel Studios\" banner, they were created with the intent of sharing the same universe as the rest of our heroes from the MCU. You will see indirect references to the Avengers throughout the shows as well as characters referring to the Battle of New York as 'The Incident'.\n\nHowever, these characters never crossed over onscreen into Marvel Studios \"proper\" territory until the inclusion of Matt Murdock in Spider-Man: No Way Home, and Wilson Fisk in Hawkeye. Since then, the backstories we saw on Netflix for Kingpin and Daredevil have been solidified as canon. DDBA is pretty much Daredevil Season 4.\n\nAs of now, we would assume the other Defenders are mostly in the same boat, though not officially confirmed to be returning, besides Jon Bernthal's Punisher.\n\n\n--\n\n------------------\n\n**What is the timeline between Daredevil S3 and Daredevil: Born Again? Where does it fit chronologically in the MCU?**\n--\n\n[This post answers these questions to the best of our knowledge, but CAUTION it contains **Daredevil: Born Again SPOILERS** for the first 2 episodes](https://www.reddit.com/r/marvelstudios/comments/1j4h9eq/summarizing_the_events_between_dds3_and_born/)",
    "comments": []
}