{
    "title": "Mike Colter Addresses a Potential Return as Luke Cage in the MCU: “I still have hopes for it…I don't think it's impossible. Anything can happen.\"",
    "author": "MarvelsGrantMan136",
    "subreddit": "marvelstudios",
    "rank": 19,
    "score": 1183,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 98,
    "url": "https://collider.com/luke-cage-mike-colter-return/",
    "id": "1jdmh55",
    "selftext": "",
    "comments": [
        {
            "author": "Expensive_King_4849",
            "body": "Man they all coming back, they all keep saying the same thing.",
            "score": 317,
            "replies": [
                {
                    "author": "d_wib",
                    "body": "PR intern accidentally gave them all the same pre-cooked answer instead of switching it up.",
                    "score": 106,
                    "replies": [
                        {
                            "author": "Markus2822",
                            "body": "Legit might think there’s a defenders revival coming post DDBA S2. I don’t think we’ll get all separate shows or even JJ and heroes for hire. I’d love to be wrong tho",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "kierg10",
                                    "body": "Other than daredevil as the flagship of the defenders, i dont think we really need individual titles anymore. For all the criticism the defenders got, i definitely felt like every member worked much better playing off each other.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "Markus2822",
                                            "body": "I think that’s a totally fair take. Personally I’d love both. A cycle of Jessica Jones > Heroes for hire > Daughters of the Dragon (maybe, this one is definitely not required) > defenders (or other team up equivalent) would be my ideal scenario. I’d love for them to have time on their own and know each other and ask each other stuff but still have a main focus on what’s going on in their lives. \n\nI just rewatched defenders and I gotta say I really loved it but Karen, Trish and to a lesser extent Misty just kinda felt half assed and not well done. I think it would be hard to have any focus on their personal lives if they only existed in a team up show",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "kierg10",
                                                    "body": "There's definitely less space for the non super powered characters in a defenders show. Personally i would love a jessica jones/daredevil show, as well as a danny rand/luke cage show. \n\nI felt like both those pairings had great synergy and chemistry in defenders.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Maultaschenman",
                    "body": "Sweet Christmas",
                    "score": 22,
                    "replies": []
                },
                {
                    "author": "docpagliacci",
                    "body": "Right? Hasn't this all been confirmed 1000x already?",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Kingpin1232",
            "body": "Well there’s a Harlem’s Paradise poster in the first episode of Born Again, so they’re definitely acknowledging Luke Cage’s presence in the universe. The Defenders have to be impacted by Fisk putting a ban on vigilantes, they just can’t ignore that. Plus I’d like to see how Luke would interact with Fisk. Fisk could even try and get him on his side, considering he left off taking over Harlem’s paradise and crime in Harlem.",
            "score": 125,
            "replies": [
                {
                    "author": "AndreskXurenejaud",
                    "body": "When did the Harlem's Paradise poster show up?",
                    "score": 8,
                    "replies": [
                        {
                            "author": "Kingpin1232",
                            "body": "Oh no it was the second episode actually, it was during Fisk’s speech as Mayor in Times Square. It’s more of an easter egg, but there’s a Harlems Paradise poster advertised on one of the buildings.",
                            "score": 13,
                            "replies": []
                        },
                        {
                            "author": "SnooPineapples7317",
                            "body": "During the New Year scene at Times Square.",
                            "score": 7,
                            "replies": []
                        },
                        {
                            "author": "your_mind_aches",
                            "body": "It's not just a poster, it's a big billboard with a ton of text, so the club has to be doing well to be able to afford all that screen time",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "JumpingCoconutMonkey",
                    "body": "Was it Harlem's Paradise before he took over?",
                    "score": 16,
                    "replies": [
                        {
                            "author": "Ornery-Concern4104",
                            "body": "Yep\n\nBut before you say what I think you're gonna say, Luke Cage is also canon to the MCU so it's canon that Luke was in charge of it",
                            "score": 35,
                            "replies": [
                                {
                                    "author": "JumpingCoconutMonkey",
                                    "body": "Where was it established?",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "author": "Particular_Drop_9905",
                                            "body": "They reconfirmed it's canon when they added all the shows on the MCU timeline on their website and D+.",
                                            "score": 30,
                                            "replies": []
                                        },
                                        {
                                            "author": "Nateddog21",
                                            "body": "When Matt showed up in NWH. plus all the press releases saying all the Netflix shows were canon",
                                            "score": 24,
                                            "replies": []
                                        },
                                        {
                                            "author": "weehawkenabstract",
                                            "body": "the born again reshoots canonized the netflix shows. before that, it was ambiguous and implied that matt in NWH and fisk in hawkeye were the same people playing MCU variants of the netflix characters with similar histories",
                                            "score": 8,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Cardinal_and_Plum",
                    "body": "Jessica getting caught up in this new outlawing of vigilantes even though she probably wouldn't consider herself one sounds just like something that would happen to her.",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "Vector1013",
            "body": "I hope he comes back to be mayor at the end of born again season 2.",
            "score": 51,
            "replies": [
                {
                    "author": "GoldenKuriza",
                    "body": "First give him a special presentation that will show what happened after season 2 and we can talk",
                    "score": 33,
                    "replies": [
                        {
                            "author": "Kingofdrats",
                            "body": "We need a godfatheresque special presentation for Luke Cage to see what hes been up to as crime boss of Harlem.",
                            "score": 15,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Wooden_Passage_2612",
            "body": "We need him back.\n\n![gif](giphy|3o7TKzOUkmDeUsKi1G|downsized)",
            "score": 20,
            "replies": [
                {
                    "author": "Caledor152",
                    "body": "DO IT COWARDS",
                    "score": 3,
                    "replies": [
                        {
                            "author": "Wooden_Passage_2612",
                            "body": "![gif](giphy|XHY2T36pOUta33hf0L|downsized)",
                            "score": 2,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "fillupjfly",
            "body": "Lol he’s giving me Tobey Andrew vibes of passiveness here. Wouldn’t be surprised if him Krysten and Finn are in talks as we speak.",
            "score": 42,
            "replies": [
                {
                    "author": "Kingpin1232",
                    "body": "They have to give Iron Fist the costume. I doubt they wouldn’t tbh, especially when they gave Wolverine his iconic costume and mask. I don’t put the blame on Finn Jones for not having enough time to train but it all could have been avoided had they even giving him a damn mask. It’s literally just a yellow version of Daredevil’s black mask. Why did Marvel TV cheap out on Iron Fist, he deserves better than that.",
                    "score": 25,
                    "replies": [
                        {
                            "author": "Riley__64",
                            "body": "All the Netflix shows seemed rather against giving the heroes their costumes as to not come off as less serious.\n\nDaredevil and punisher the only two who really got their costumes spent a lot of their time giving up the costumes and not wearing them. Luke never really got to wear his iconic yellow shirt the times we do get to see it he had a hoodie on over it",
                            "score": 16,
                            "replies": [
                                {
                                    "author": "Realistic_Analyst_26",
                                    "body": "Daredevil got his costume at the very end of S1, wore it for S2 and Defenders, then lost it at the start of S3. So he wore a suit for what, 23/47 of the total Defenders Saga episodes he appeared in? I'm sure I overcounted some where so just under 50%?",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "your_mind_aches",
                                            "body": "I mean he never got the suit back at all in Season 3. He was in the Devil of Hell's Kitchen getup the entire season",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "Realistic_Analyst_26",
                                                    "body": "He had it in the first episode when they showed him in the water.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "author": "your_mind_aches",
                                                            "body": "Right so I'm not sure how you got the 23 number. It'd be 13 in Season 2, 1 in Season 3, and 1 in Defenders. That's 15. \n\nAnd you can count Born Again for 16",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "author": "Realistic_Analyst_26",
                                                                    "body": "I counted 8 for Defenders. I may be misremembering how long he had the suit on. I also counted 1 for the S1 finale",
                                                                    "score": 1,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "author": "Infinity0044",
                                            "body": "Which tbf had nothing to do with the “seriousness”\nof the show since Bullseye was running around in the costume for all of season 3",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "Ubergoober166",
                                    "body": "They even made jokes about their original costumes in some cases. The only one that really embraced it was Daredevil.",
                                    "score": 6,
                                    "replies": []
                                },
                                {
                                    "author": "thesanmich",
                                    "body": "I really wish they would embrace it. The time is now. Have them in costumes, and then fulfill our Marvel dreams of seeing the Netflix heroes fight side-by-side with the rest of the MCU heroes.",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Stephenrudolf",
                            "body": "Oh man. I respect the comic costumes, but ironfists is really not the best.",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "Kingpin1232",
                                    "body": "Not the full jumpsuit look, but the yellow mask with a more refined green suit would look good. Basically Daredevil’s first black suit, but green and yellow.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "Antrikshy",
                    "body": "Brad Winderbaum and Sana Amanat have [outright acknowledged](https://ew.com/jessica-jones-luke-cage-iron-fist-returns-explored-marvel-exclusive-11680967) thinking about it.",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Caledor152",
                    "body": "Agreed and I'll go one further. It wouldn't shock me if he and Krysten already have contracts signed lol. Their responses are almost identical lol as if they are already NDA'd",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Infinity0044",
                    "body": "Krysten seems practically confirmed since she’s currently in New York which just so happens to be where they’re filming season 2",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "RusTheCrow",
                    "body": "Has Finn kept up with ANY kind of martial arts training since the show got cancelled? I feel like if he had, he'd actually be good enough to credibly play Iron Fist by now, but I suspect he has not.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Stephenrudolf",
                            "body": "As much as i would love Krysten Ritter and Mike Colter i just think there is one glaring weakpoint in the defenders main cast by the name of Finn jones that could be recast easily.",
                            "score": -1,
                            "replies": [
                                {
                                    "author": "your_mind_aches",
                                    "body": "I didn't watch Iron Fist except for the first episode but isn't Colleen Wing the Iron Fist now?  They can just get her.",
                                    "score": 5,
                                    "replies": []
                                },
                                {
                                    "author": "TwevOWNED",
                                    "body": "They could just keep Danny with the Chi guns ",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Naked_Snake_2",
            "body": "With the time that's passed, he and Jessica should be a couple by now,  baby even I guess...",
            "score": 11,
            "replies": [
                {
                    "author": "Dell0c0",
                    "body": "Their daughter, Danielle, should be in school by now.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ViralGameover",
            "body": "My dream is that him and Finn Jones return in a loose adaptation of Daredevil #178 to reintroduce the characters and give them a more comic accurate look/personality.",
            "score": 21,
            "replies": [
                {
                    "author": "Ubergoober166",
                    "body": "I think that would be the best decision, for Danny specifically. So many people have this very negative view of Finn's portrayal in his own show but really liked his interactions with Luke.",
                    "score": 15,
                    "replies": [
                        {
                            "author": "DJZbad93",
                            "body": "Yeah give them one episode in DDBA S2 and then spin them off",
                            "score": 3,
                            "replies": []
                        },
                        {
                            "author": "Stephenrudolf",
                            "body": "It very well COUalD be a writing problem in ironfist, but i really just wasnt a fan of him in his own show. Never gave defenders a watch unfortunately, what do you think is the difference having seen both?",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Ubergoober166",
                                    "body": "It was definitely a writing issue IMO. Finn's portrayal of Danny felt much more natural and organic in his other appearances outside his own show. Finn showed he *is* capable of playing the character, he just needs a better script and/or direction. His interactions with Luke felt very genuine, like they were actually buddies and even though they weren't wearing their comic costumes I was like \"yea, that's Luke and Danny\".",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "DavidZ2844",
                    "body": "What’s DD #178 about?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "ViralGameover",
                            "body": "Matt is being threatened so Foggy hires the Heroes for Hire to be his bodyguards. They don’t know he’s Daredevil so hijinks ensue. Very fun comic.",
                            "score": 8,
                            "replies": [
                                {
                                    "author": "DavidZ2844",
                                    "body": "Sounds great, I’m in. Hopefully they can adapt it somehow.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "ViralGameover",
                                            "body": "Me too. You can do a similar plot even. Only difference is they know he’s Daredevil, but maybe who hires them doesn’t. Or Matt has to hire them because he knows he’ll be targeted in public.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "author": "DavidZ2844",
                                                    "body": "Anything to bring them back and I’m all for it honestly. Even if it’s a bit different that still sounds like a good overall storyline for them to return for. \n\nI’m watching all the Defenders shows right now to get caught up before starting Born Again, and I loved all of them, even Iron Fist who most people don’t like. The Defenders crossover was an absolute blast, so awesome seeing them interact with each other. \n\nIf Charlie can come back, I hope they can consider eventually getting Kristen, Mike, and Finn back too.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "author": "Abraham_Issus",
                                                            "body": "Once maybe people used to say the defenders saga was not worthy of being a part of MCU. Glad you are enjoying it. It’s my favorite thing in MCU with AOS",
                                                            "score": 1,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "wut_eva_bish",
                    "body": "HELL NO TO FINN JONES.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "One-Armed-Krycek",
            "body": "Please let him come back, FFS. He is Luke Cage.\n\nHe is also Lemond Bishop, but we will let that slide\n\n![gif](giphy|BoOGOVfqeeJ6WWkWcu|downsized)",
            "score": 11,
            "replies": []
        },
        {
            "author": "Uncanny_Doom",
            "body": "I’d love to see him back.",
            "score": 5,
            "replies": []
        },
        {
            "author": "The-Old-American",
            "body": "I'd be all in on this. Luke Cage was a very close 2nd to DD for me.",
            "score": 5,
            "replies": []
        },
        {
            "author": "upfromashes",
            "body": "Yes! He was TERRIFIC as Luke Cage. I am keeping my fingers crossed for his return.",
            "score": 8,
            "replies": []
        },
        {
            "author": "NormanDoor",
            "body": "One of the best casting jobs in the MCU.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Lost-Cow-1126",
            "body": "Nelson, Murdock, & Page, Heroes for Hire, Inc, Goodman, Lieber, Kurtzberg, & Holliway, and Alias Investigations should all have offices in the same building on the same floor.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Belaerim",
            "body": "My dream scenario is that Daredevil is such a hit (and it’s trending that way) that we got a yearly series about street level heroes. \n\nCall it Defenders for continuity, but Marvel Knights or Heroes for hire works too. \n\n9-12 episodes a year. Maybe do 6 and 6 and spread it out across 2 storylines. \n\nThe trick is that it isn’t a Luke Cage revival for 1 season, or Jessica Jones, etc. \n\nIt’s all of them, but not everyone is in every story or even every season. \n\nMake each season 2-3 stories, kinda like an anthology series. \n\nIt lets them have a Danny & Luke story as the main plot in Eps 1-3, and then in EPS 4-6 they are a B-plot. Vice versa Daughters of the Dragon, etc\n\nMaybe Luke shows up in Eps 7-9 as part of a Jessica story, but not Danny, etc\n\nThere are enough street level heroes from the Netflix shows, and then sprinkle in appearances or even whole story arcs with Blade, Moon Knight, She-Hulk, Spidey characters (probably not Spidey himself because of Sony), Echo, either Hawkeye, etc\n\nThere are tons of actors who say they’d love to come back, but with the directive to pare back the Disney+ shows, they aren’t all going to get individual shows. \n\nBut bring back Colter to play Cage in 6 episodes a year, etc seems much more doable.",
            "score": 3,
            "replies": []
        },
        {
            "author": "anthonystrader18",
            "body": "Let Luke   and Jessica should be a couple by raising an daughter named Danielle",
            "score": 3,
            "replies": []
        },
        {
            "author": "NotLozerish",
            "body": "Didn’t he just say he’d be fine passing it on to someone else?",
            "score": 2,
            "replies": [
                {
                    "author": "MoneyMo88",
                    "body": "Yeah, but that was when he was still a series regular as a lead on the Evil series on Paramount+.\n\nNow that Evil has ended, Mike Colter doesn’t have that as a commitment that he’s regularly tied down to.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Myhtological",
            "body": "Didn’t he say last year “no thanks”?",
            "score": 2,
            "replies": [
                {
                    "author": "mrhelmand",
                    "body": "Yeah, but then the show he was a lead in got cancelled.\n\nRIP Evil, too weird for this Earth",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "Twpkmc123",
            "body": "I hope we bring Mike and Krysten back. I hope we one day get to see their characters get married like in the comics.",
            "score": 2,
            "replies": []
        },
        {
            "author": "darcmosch",
            "body": "Extra! Extra! Read all about it! Actor looks for work!\n\n\nBut seriously I'd love all the Defenders to come back",
            "score": 2,
            "replies": []
        },
        {
            "author": "Sad_Juggernaut_5103",
            "body": "I want all the defenders to come back. And I would love to see spidey added but not counting in it with sony.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CondomHummus",
            "body": "Not happening.",
            "score": 1,
            "replies": []
        },
        {
            "author": "anthonystrader18",
            "body": "Mike Colter as Luke Cage is soo good \n\nLet Luke Cage to be mayor for Season 2 of Born again.  \n\nand do an special presentation of heroes for hire   \n\n![gif](giphy|1ppufCz5h5WfNanX6G)",
            "score": 1,
            "replies": []
        },
        {
            "author": "kjweitz1",
            "body": "Kristen shows up.\n\nMike is 50/50.",
            "score": 1,
            "replies": []
        },
        {
            "author": "JRHThreeFour",
            "body": "Yes I’d love for Luke Cage to come back.",
            "score": 1,
            "replies": []
        },
        {
            "author": "EightBiscuit01",
            "body": "He used to say he was over it. Huge tune change. He’s coming back",
            "score": 1,
            "replies": []
        },
        {
            "author": "AntillesWedgie",
            "body": "I hope in the 8sh years since we’ve seen him he got real religious, studied to become a priest, started investigating possessions for the church, became a priest, fell in love with his coworker, moved to Rome, and then came back to NYC to join the Midnight Suns.",
            "score": 1,
            "replies": []
        },
        {
            "author": "indianajoes",
            "body": "That's good to hear. I was a bit worried about him because he was the only main actor that didn't participate in the [video](https://youtu.be/Zr2nlqL4mT8?si=xXacru3gRcUwFCtG) they put out when the Netflix and ABC shows came to Disney+",
            "score": 1,
            "replies": []
        },
        {
            "author": "13WillieBeaman",
            "body": "![gif](giphy|UpvAgsFsw0M02f66Ra|downsized)",
            "score": 1,
            "replies": []
        },
        {
            "author": "TelephoneCertain5344",
            "body": "I hope Krysten, Mike and Finn are back.",
            "score": 1,
            "replies": []
        },
        {
            "author": "FeralPsychopath",
            "body": "I honestly think he is in Daredevil, maybe running for mayor post Kingpin at the end of S2.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Former-Media-2891",
            "body": "Hero’s for Hire would be lit rn",
            "score": 1,
            "replies": []
        },
        {
            "author": "InfamousExotic",
            "body": "![gif](giphy|3D4786qmFdo867qxJ4)\n\nAlong with Luke and Jessica, please bring these two back 🙏",
            "score": 1,
            "replies": []
        },
        {
            "author": "crispy_attic",
            "body": "Luke Cage and Jessica Jones are two of my favorite characters and I wish this would happen yesterday.",
            "score": 1,
            "replies": []
        },
        {
            "author": "ArchDucky",
            "body": "Well the plot of Season 2 has leaked now and its a doozy...  \n  \n>!Daredevil forms a group of heroes to take on Fisk's Anti-Vigilante task force.  We are getting Jessica, shes in New York right now filming.  More than Likely Luke Cage and Iron Fist will appear.  I wouldn't even rule out Moon Knight, honestly.!<",
            "score": 1,
            "replies": []
        },
        {
            "author": "Accomplished-Duck606",
            "body": "Last time the answer was less optimistic... he know something",
            "score": 1,
            "replies": []
        },
        {
            "author": "MickCollins",
            "body": "I'd only want it if he received scripts worth a fuck.\n\nFirst half of Season 1 rocked.\n\nSecond half of Season 2 is like a writer died and they went outside and pulled someone off the street who heard the Luke part and thought they needed some Star Wars villains.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mike-Hunt-Amos-Prime",
            "body": "I really liked him as Luke. He was utterly fucking compelling as a strong silent type. \n\nAnd I like that he never really learned how to fight because he didn’t need to being invulnerable and all. He just sort of bapped people on the head or tossed them through a wall. \n\nI think it would be fun to see Luke join West Coast Avengers and then go up against a super villain and lose, so that we see him come to terms with not being OP in every situation and needing to learn strategy/team work/fighting technique from someone in the avengers (or gasp, from Iron Fist).",
            "score": 1,
            "replies": []
        },
        {
            "author": "comicgopher",
            "body": "Oh, another actor open to paid work post",
            "score": -5,
            "replies": []
        },
        {
            "author": "Geoffthecatlosaurus",
            "body": "Really hope he comes back as was fantastic as Luke Cage and that is before you listen to that amazing soundtrack.",
            "score": 0,
            "replies": []
        },
        {
            "author": "Mickeyjj27",
            "body": "Are they all doing things or busy? I know Mike had some paranormal show on tv but I recall hearing there was a series finale. I saw Ritter in Sonic 3 but unsure if she’s in a lot of things. Finn probably does the least amount cuz last I heard some project he was working on was canned",
            "score": 0,
            "replies": []
        },
        {
            "author": "sigbinItom",
            "body": "I am probably of the minority but i hated netflix luke cage he was so weak. I am all for rebooting cage honestly.",
            "score": -1,
            "replies": []
        },
        {
            "author": "OmegaHunterEchoTech",
            "body": "These people need to stop begging, it's pathetic. ",
            "score": -3,
            "replies": [
                {
                    "author": "frogskin92",
                    "body": "An actor answering a question they’ve been asked = begging?",
                    "score": 3,
                    "replies": []
                }
            ]
        }
    ]
}