{
    "title": "Should daredevil show up in the next avengers movies?",
    "author": "elinicholas95",
    "subreddit": "marvelstudios",
    "rank": 15,
    "score": 242,
    "upvote_ratio": 0.93,
    "num_comments (reported by reddit)": 89,
    "url": "https://i.redd.it/dw5ne81wfepe1.jpeg",
    "id": "1jdzdla",
    "selftext": "Having a debate with friends on if he should now he is fully cannon, or if he should stay “street level” and curious on people’s thoughts on this?",
    "comments": [
        {
            "author": "Uncanny_Doom",
            "body": "Yes.\n\nHe's too popular not to include in some form.",
            "score": 108,
            "replies": [
                {
                    "author": "elinicholas95",
                    "body": "I’m actually surprised how well born again is doing and how popular it is. As know so little people who watched the Netflix series",
                    "score": 14,
                    "replies": [
                        {
                            "author": "ecstacy1706",
                            "body": "? many people watched the netflix series. It's their most popular MCU show",
                            "score": 27,
                            "replies": [
                                {
                                    "author": "elinicholas95",
                                    "body": "I don’t say it as slander, Netflix series is my favourite show ever! I just feel like in real life I don’t know many people who have watched it",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "author": "ecstacy1706",
                                            "body": "It's chill bro, tbf it's an almost 10 year old show.",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "author": "elinicholas95",
                                                    "body": "Yeah that’s fair, and I’m seeing a lot of people go back and watch it now with all the hype born again has",
                                                    "score": 5,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Hotstuff5991",
                            "body": "Think that’s just your bubble , like I know very few people who’ve seen The rise of Skywalker, movie still made 1 billion lol. ",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "SeekerVash",
                            "body": "Um...\n\n\n\nhttps://www.gamesradar.com/entertainment/marvel-tv-shows/daredevil-born-again-had-disney-plus-biggest-premiere-of-2025-but-its-viewership-is-lower-than-agatha-all-along-and-the-acolyte/",
                            "score": -3,
                            "replies": [
                                {
                                    "author": "Hotstuff5991",
                                    "body": "Like to remind you that they’re comparing Daredevil 5 day viewership total (7.5 million), to Agatha(9.3 million) and Acolyte(11 million) 7 day viewership totals. Also acolyte first week was a good number lol, it’s what happened the weeks after episode 1 that got them cancelled, that and the budget.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "author": "SeekerVash",
                                            "body": "Not really going to make much of a difference.  \n\nThe number of people who didn't watch the first two episodes in the first 5 days, but watch on day 6 or 7 isn't going to bump it up even a decimal point.\n\nClaiming that it was two days less is just grasping at straws, the bottom line is that so far, Daredevil is continuing to show that the audience is now checked out of the MCU.  The only hope is that there's a massive unprecedented wave of viewers after the finale drops.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "Hotstuff5991",
                                                    "body": "Uhh it definitely does count , for example acolyte did 4.8 million on its first day and Agatha got 4.2 million on its first day , the numbers increased the more days they added until they got to the 7 day total.  the 7 day window does count because the streaming charts include TOTAL MINUTES WATCHED after a period of time. Thats why Nielsen, Variety and Luminate reported DD made the top ten (number ten to be exact lol) days later because they got all the data. ",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "PlatoDrago",
                    "body": "Honestly, I think it would be best if he didn’t appear as a hero until big climactic battles. Most of the time he should be the lawyer representing lots of the heroes.",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "TheBrickHog",
            "body": "Absolutely! Not just because he’s my favourite character. I think he’s one of the most popular current MCU characters left and seeing him interact with the team would be a lot of fun. He can have a role similar to widow and Hawkeye",
            "score": 161,
            "replies": [
                {
                    "author": "elinicholas95",
                    "body": "He’s mine to and so far born again is my favourite Disney plus show (with the Netflix show being my outright favourite show) so I would  be so hyped to even see him have a smaller role. I’m still not over him appearing in no way home for that cameo 😂",
                    "score": 20,
                    "replies": [
                        {
                            "author": "TheBrickHog",
                            "body": "Haha, I was more excited when he showed up than the other Spider-Man. Yeah I think he deserves to have a role no matter if it’s just a small cameo and fight scene. Mainly hoping he’s with spidey in it",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "elinicholas95",
                                    "body": "Same, and atleast for me him appearing wasn’t leaked so it was genuine surprise 😂. Honestly however much I get his shows are meant to be more grounded and whatever. I just want to feel like it’s made a difference now he’s in the MCU you know 😂",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "newbrevity",
                    "body": "Agreed, his cameo in NWH was great despite being short",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "Hotstuff5991",
                    "body": "Yeah he can fill that Widow and Hawkeye role really well.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "horc00",
            "body": "What's the backstory for this image? Seems like Spider-Man is swinging in the wrong direction?",
            "score": 10,
            "replies": [
                {
                    "author": "ThatVideoGameGuy_tv",
                    "body": "I believe it's from Devil's Reign where the avengers went up against Purple Man, Doc Ock and the other superior Doc Ocks he got from Reed Richards' lab when Fisk seized it",
                    "score": 6,
                    "replies": [
                        {
                            "author": "horc00",
                            "body": "Thanks! Will check it out",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "elinicholas95",
                    "body": "My guess is one of the civil war comics",
                    "score": 1,
                    "replies": [
                        {
                            "author": "horc00",
                            "body": "I'm thinking it's the Avengers vs the New Fantastic Four seeing how Wolverine, Hulk and Ghost Rider are 3/4 of the New FF team, the last one being Spider-Man except he's swinging towards them instead. Would love to read a comic on the New FF.",
                            "score": 7,
                            "replies": [
                                {
                                    "author": "JohnnyNineFingers",
                                    "body": "It's Devil's Reign.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "author": "horc00",
                                            "body": "Thanks!",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "author": "elinicholas95",
                                    "body": "I thought the same thing! Spider-Man’s throwing me off 😂",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "mr_steal_ur_food",
            "body": "Yes",
            "score": 5,
            "replies": []
        },
        {
            "author": "mukisan",
            "body": "Yes, even Spider-Man will be there and he’s street level",
            "score": 10,
            "replies": [
                {
                    "author": "Gremlin303",
                    "body": "As if MCU Spidey is street level",
                    "score": 15,
                    "replies": [
                        {
                            "author": "failure_most_of_all",
                            "body": "“Bitch, please… You’ve been to space.”",
                            "score": 6,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "PhatOofxD",
                    "body": "Even if he's street level (not MCU) he's also far more strong than DD and able to keep up with the likes of Thanos (well, at least not die)",
                    "score": 3,
                    "replies": []
                },
                {
                    "author": "Endgam",
                    "body": "Now to be fair, Spider-Man has an Avengers level superpower. He just remains street level to look out for the little guy that the Avengers overlook since they're too busy dealing with all the world-cosmic level stuff.\n\nDaredevil..... has normal human strength. He just senses things really well. You wouldn't bring him to fight Thanos.",
                    "score": 2,
                    "replies": [
                        {
                            "author": "mukisan",
                            "body": "We’ve seen plenty of regular humans in Avengers movies, that’s not a good enough excuse for me to not bring him in.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Endgam",
                                    "body": "I wasn't arguing against excluding Daredevil from the films. I'm just saying Spider-Man could move beyond street level if he really wanted to while Daredevil can't.\n\nDaredevil could fight in the battle at Wakanda. But he couldn't fight in the battle on Titan like Spider-Man did.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "author": "mukisan",
                                            "body": "Yes true of course. I’m sure the Russos will manage his screen/story time efficiently.",
                                            "score": 1,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Hotstuff5991",
                            "body": "I mean the brought Hawkeye lol. ",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "elinicholas95",
                    "body": "Vary valid point, think I forget with the last few Spider-Man movies 😂. I’m holding out hope we will see Matt in Spider-Man 4 atleast",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Plairinum_",
            "body": "Most if not everyone should show up in some capacity. Daredevil, Punisher, Moon Knight, Ms. Marvel, Shang-Chi, Werewolf by Night, etc.\n\nI doubt this will happen, but it would be fun to see if Man Thing has anything to do with the multiversal aspects of the next Avengers movies.",
            "score": 2,
            "replies": [
                {
                    "author": "elinicholas95",
                    "body": "I expect to see both Shang Chi and ms marvel have pretty big roles due to band and his rings rumoured to be super relevant to the plot",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "JazzmatazZ4",
            "body": "It would be nice if they integrated the TV shows with the movies",
            "score": 2,
            "replies": [
                {
                    "author": "elinicholas95",
                    "body": "That’s what I’m saying! I get he may not have the best power set for the big movies but now he’s able too I just want to see him interact with more of the MCU",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Justin_Sam21",
            "body": "Not only DD but all the street level heroes should be there. After all, they gonna need any help they can get!",
            "score": 2,
            "replies": [
                {
                    "author": "elinicholas95",
                    "body": "Anyone in particular you’re hoping to see?",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Justin_Sam21",
                            "body": "Sure! Punisher, moon knight and ofc daredevil.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Supersquigi",
                    "body": "> After all, they gonna need any help they can get!\n\n...for what, exactly??.......",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Justin_Sam21",
                            "body": "Doom!",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Grayx_2887",
            "body": "If Charlie Cox has a free schedule, he might show up for SecretcWars, I believe.",
            "score": 2,
            "replies": [
                {
                    "author": "elinicholas95",
                    "body": "I’m holding out for atleast a cameo tbh",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Moon_Beans1",
            "body": "Given the amount of stuff they're likely to put in the next two films I'd rather they didn't just cram him in there for the sake of it.\n\nIf they are going to attempt to pay off all the multiverse saga setups then that means they will already be working the Avengers, possibly gotg, the marvels, eternals, thunderbolts and fantastic four in.\n\nI'd rather they focus on paying off all the movie plot threads rather than piling TV characters on top too. For instance if it was a choice between Shang Chi or Daredevil turning up, then I'd prefer Shang Chi because Daredevil has had multiple appearances in the last few years whilst Shang Chi had a successful debut movie and then hasn't been seen since.",
            "score": 2,
            "replies": [
                {
                    "author": "elinicholas95",
                    "body": "That’s valid, and to be honest if I could put DD in any movies it would probably be the Spiderman ones with kingpin as the big bad. Sucks we’ve not had that on screen yet",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "VonD0OM",
            "body": "I think he should, he’s got the charisma, the acting chops and the name recognition. He’s universally loved. \n\nHe’ll sell tickets, and Marvel needs that atm.",
            "score": 2,
            "replies": []
        },
        {
            "author": "ABC_Dildos_Inc",
            "body": "The MCU just needs to do what the good comics did.\n\nJust have casusl encounters between characters from different films shows randomly happen in everything.\n\nSometimes they just walk pass each other on the street. Sometimes an alter ego is doing something in a story.\n\nThe other big thing missing in the MCU is that inbetween major plot points in each film, the heroes should stopping lower level super villains and threats casually.\n\nDon't just shoe horn in a montage early in the film that establishes super heroing. Show what their day to day lives are really like.\n\nPeter and Matt should overlap a lot and we should see more of them casually stopping crimes before they happen while out if costume.",
            "score": 2,
            "replies": [
                {
                    "author": "elinicholas95",
                    "body": "This is what I hope for! And if it wasn’t for Sony I’m so sure we would see DD and Spider-Man together all the time",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "n_mcrae_1982",
            "body": "That depends greatly on what they have him doing.  Yes, he's a \"street level\" hero and should primarily stay that way (same goes for Spider-Man, Ant-Man, Kate Bishop, and Ms. Marvel), but if you found an organic way to include him, in or out of costume (as they did in \"No Way Home\"), it would be okay.",
            "score": 2,
            "replies": [
                {
                    "author": "elinicholas95",
                    "body": "True! I wouldn’t want it feeling forced",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DWPhoenix001",
            "body": "What comic is this from?",
            "score": 1,
            "replies": [
                {
                    "author": "elinicholas95",
                    "body": "Just debating either new avengers vs new FF or one of the civil war comics",
                    "score": 0,
                    "replies": []
                }
            ]
        },
        {
            "author": "Abraham_Issus",
            "body": "100%",
            "score": 1,
            "replies": []
        },
        {
            "author": "MrNIK_1004",
            "body": "Which comic is this from?",
            "score": 1,
            "replies": []
        },
        {
            "author": "TelephoneCertain5344",
            "body": "Yes. At least one.",
            "score": 1,
            "replies": []
        },
        {
            "author": "boosta29",
            "body": "I can see him and sam talking...\n\nSam: so Matt what do you bring to the team\n\nMatt: i have  a hulk... a she hulk\n\nWould be a funny throw back to ironman \"we have a hulk\"",
            "score": 1,
            "replies": [
                {
                    "author": "elinicholas95",
                    "body": "😂😂😂",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "ToughFox4479",
            "body": "He probably will, but i don't see him running towards an army of outriders and being able to hold his own with the weapons he mostly uses. If he gets some kind of upgrade, than sure",
            "score": 1,
            "replies": []
        },
        {
            "author": "One_Sheepherder_1836",
            "body": "If he doesn’t marvel does NOT understand the assignment",
            "score": 1,
            "replies": []
        },
        {
            "author": "BMOchado",
            "body": "Luke cage was deaf?",
            "score": 1,
            "replies": [
                {
                    "author": "elinicholas95",
                    "body": "I thought the same thing I’ll what that is lol",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "curious_dead",
            "body": "Why not? If they find him something to do that makes sense, and not just include him for the sake of it. If something were to happen close to where he lives or involve someone he knows, of course he should be there. \n\nThe power level doesn't really matter, the previous Avengers team was all over the place. They still gave interesting things for everyone to do.",
            "score": 1,
            "replies": []
        },
        {
            "author": "8bit_squirtle",
            "body": "Why not both? He can join the avengers while also being “street level”.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Mickeyjj27",
            "body": "Even back in the IW and Endgame days I just said just have a small montage of the Defenders fighting in NY or something. Just a tiny cameo but it’s them on the big screen. \n\nDD is so grounded where I only makes sense if Spidey or Cap showed up and said they’ve been keeping tabs on him and want him on the team. Even then you’ll then get people complaining about how acrobatic Daredevil will be when he’s dealing with Avengers level threats. If people suddenly started questioning how Sam Cap is fighting ppl without the serum then it’ll be worse for DD",
            "score": 1,
            "replies": []
        },
        {
            "author": "AncientSith",
            "body": "Absolutely. It's time he gets to fight with the others, it's a shame it took this long.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Meizas",
            "body": "100%. He's one of the only current characters people would be as excited for as the OG Avengers",
            "score": 1,
            "replies": []
        },
        {
            "author": "R0cket_Bab00n",
            "body": "I’m for not even though he’s really not an Avenger level character in the slightest I just want more Charlie Cox.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Pupulauls9000",
            "body": "He’s almost certainly going to be in them regardless",
            "score": 1,
            "replies": []
        },
        {
            "author": "Practical-Debate1598",
            "body": "Yes",
            "score": 1,
            "replies": []
        },
        {
            "author": "fixxer_s",
            "body": "No.  Protect him from the Rusos.",
            "score": 1,
            "replies": []
        },
        {
            "author": "CaptainHawaii",
            "body": "What's going on with Luke's ear?",
            "score": 1,
            "replies": []
        },
        {
            "author": "arc07041990",
            "body": "he deserves a standalone movie",
            "score": 1,
            "replies": []
        },
        {
            "author": "lookintotheeyeris",
            "body": "Yes, include him in the beginning of doomsday when stuff is still on earth/going on in NYC (presuming that’s what happens) Have him in battleworld too since everyone else is there, give him the beard.",
            "score": 1,
            "replies": []
        },
        {
            "author": "OmegaHunterEchoTech",
            "body": "No.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Tekk333",
            "body": "Absolutely",
            "score": 1,
            "replies": []
        },
        {
            "author": "figgityjones",
            "body": "I would support him showing up, but if he doesn’t I’m not going to raise hell over it. Especially if they are going to do a street level team-up arc. But if they aren’t doing that, then yeah have him show up and do some stuff, absolutely.",
            "score": 1,
            "replies": []
        },
        {
            "author": "theLordbull",
            "body": "He is there in doomsday, check the cast on Google",
            "score": -3,
            "replies": [
                {
                    "author": "Sunshine145",
                    "body": "That means nothing ",
                    "score": 8,
                    "replies": []
                },
                {
                    "author": "AngrySupeMD",
                    "body": "\"Check on google\"\nAh yes. The most trusted library of real knowledge!",
                    "score": 2,
                    "replies": []
                },
                {
                    "author": "elinicholas95",
                    "body": "Damn I hope it’s accurate 😤 feel like I’ve been mislead a few times my googles cast",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Endgam",
                            "body": "Google thought Yondu was in Mary Poppins Returns.\n\nIt's an algorithm that puts things together based on what it detects on the internet.",
                            "score": 2,
                            "replies": []
                        },
                        {
                            "author": "theLordbull",
                            "body": "Yeah, if they are really bringing all of them , it will be huge man",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "elinicholas95",
                                    "body": "I keep seeing people talk about how little they are hyping up avengers with the movies atm, but bringing in some of their shows hero’s would bring a lot of hype I think",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}