{
    "title": "The original “Daredevil” show from Netflix saw a 153% boost in watch time following the rollout of Born Again",
    "author": "the_strange_beatle",
    "subreddit": "marvelstudios",
    "rank": 2,
    "score": 689,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 43,
    "url": "https://variety.com/vip/daredevil-born-again-disney-plus-views-marvel-1236339818/",
    "id": "1jef06q",
    "selftext": "",
    "comments": [
        {
            "author": "Toastedmetal",
            "body": "![gif](giphy|J8FZIm9VoBU6Q)",
            "score": 44,
            "replies": []
        },
        {
            "author": "kingsky123",
            "body": "The current daredevil show is really good. It made me want to watch the echo show.",
            "score": 110,
            "replies": [
                {
                    "author": "Fishyhead81",
                    "body": "Watch it with the knowledge it’s not a Daredevil or Kingpin show, it’s an Echo show, even if it does delve into more of Fisk’s past before the start of Daredevil and during the Blip. It’s an okay show. The finale’s CGI bullshit for like a second but other than that it’s whatever.",
                    "score": 48,
                    "replies": []
                },
                {
                    "author": "FallPractical1937",
                    "body": "I thought Echo was decent until the last episode where they just suddenly wrapped everything up. Could have used a few more episodes.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "walartjaegers",
                    "body": "Don't expect it to be on the same level as Born Again, you'll probably be disappointed. Echo is not terrible but it can be incredibly dull. ",
                    "score": 16,
                    "replies": [
                        {
                            "author": "Ken_Mobinson",
                            "body": "It had so much potential, too. It's disappointing. The whole way, I was just like, \"alright, that was a solid episode but mostly buildup. I'm sure it'll get better next episode.\"\n\nAnd i convinced myself of that all the way up to the final episode where I was like, \"finally, gonna get some pay off for my patience,\" and it was just so underwhelming.\n\nLike there's not a lot of points in the show I feel I can point to to explain why it was bad. But there's also very few things I can point to to explain why it was good. It was just... there.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "thewildbeej",
                    "body": "You should probably not. The last two episodes are horrid. Up until that it was mid or slightly good but the last episodes are just terrible and I think most everyone mentioned the finale being a huge let down ",
                    "score": 2,
                    "replies": [
                        {
                            "author": "DjCyric",
                            "body": "It's better than Secret Invasion if we're grading on a sliding scale into the dumpster.",
                            "score": 26,
                            "replies": [
                                {
                                    "author": "thewildbeej",
                                    "body": "I went ahead and skipped that one. Moon knight and echo really broke me. Both were good but had disappointing endings. ",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "trustprior6899",
                                            "body": "Moon Knight was more interesting front-to-back but it did suffer from a weak finale.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "author": "thewildbeej",
                                                    "body": "I agree wholeheartedly. I didn't mind the black out but it has to have a pay off. I thought we were going to get that at the end. Him blacking out but we see that version. It was kind of limped dick to not",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "Fishyhead81",
                            "body": "Episode 4’s good. I don’t know what you’re getting that from. And no, the finale’s nowhere compared to Secret Invasion. ",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "thewildbeej",
                                    "body": "I didn't say it was someone else compared it to secret invasion. Jesus, if I thought you people were going to take it personally like it was as significant as Elon Musk gutting social security I'd fucked right the hell off myself.",
                                    "score": 0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "xpacean",
                    "body": "I see you have one reply telling you it was good until the end, and one reply telling you it was boring until the end. I liked it, personally, but it's more of a small show with very little superhero stuff. I really felt like I was on a reservation in Oklahoma though, and a lot of the performances are really well done.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "sabhall12",
                    "body": "I wouldn't recommend the Echo show, it was very weak  and they basically nixed it coming into Daredevil",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "bargman",
                    "body": "Just watch the first two or three episodes.",
                    "score": -1,
                    "replies": []
                }
            ]
        },
        {
            "author": "DjCyric",
            "body": "I've seen all three seasons multiple times, but I watched them all again getting ready for Born Again.",
            "score": 17,
            "replies": []
        },
        {
            "author": "VelocityReaper",
            "body": "\nJust finished binging and getting caught up with Born Again! \n\n\nI’ve watch all of the Marvel shows in recent years and finally binged the original daredevil seasons. Definitely felt that S3 was the strongest with the most gripping plot points for me. However, I did struggle to comprehend the amount of control Fisk was able to have over so many. Maybe that felt drawn out after seeing it happen in S1. \n\nS2 was great as well. I went in completely blind, but at least knew that people generally didn’t enjoy S2. I didn’t understand why til S3. I did enjoy seeing Frank again, his last appearance was kind of strange to me though. \n\nKudos to the team who wrote the dialogue especially in moments between Matt and Stick, The Pastor, and Foggy. I also thought Dex was a great actor and fantastic casting for someone who isn’t familiar with the villains. Completely sold on his deranged villainous persona in S3.",
            "score": 6,
            "replies": []
        },
        {
            "author": "19thScorpion",
            "body": "I'm one of those people watching the old DD Netflix show.  I just started Season 3 last night. \n\n  \nI always wanted to watch it (I've seen the other netflix shows except The Punisher and I couldn't make it though a few eps of Iron Fist because it was so bad) but was always nervous about the violence.  I was always told there's a lot of bone breaking and that's the one thing that makes me cringe in movies.  But I want to see the new D+ Daredevil so I finally decided to watch it and just watch the action scenes with squinted eyes if need be.\n\nNeedless to say the bones aren't as bad as I thought and I love love LOVE the show.  The only downside was the Elektra plot.  I didn't care too much for that.",
            "score": 9,
            "replies": []
        },
        {
            "author": "Sorry_Sorry_Im_Sorry",
            "body": "that doesn't seem like a huge spike for a show that released a decade ago and probably has limited viewership already right?",
            "score": 11,
            "replies": [
                {
                    "author": "Brees504",
                    "body": "Yeah these numbers are always completely meaningless. If the base number isn’t given, who cares what the % increase is. 2 is 100% more than 1.",
                    "score": 15,
                    "replies": []
                },
                {
                    "author": "Uncanny_Doom",
                    "body": "It’s impossible to say but worth considering that there were likely already people watching/rewatching prior to Born Again’s release.",
                    "score": 5,
                    "replies": []
                },
                {
                    "author": "MrWedge18",
                    "body": "I'd imagine most people would be watching on d+",
                    "score": 2,
                    "replies": [
                        {
                            "author": "Joshdabozz",
                            "body": "That’s the only place you can watch it. It hasn’t been on Netflix in over 3 years. They officially have been been on D+ for 3 years (3 years happened on Sunday)",
                            "score": 1,
                            "replies": [
                                {
                                    "author": "MrWedge18",
                                    "body": "Gotcha, that makes sense. I misread the title, so thought it was talking about viewership on Netflix.",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Sorry_Sorry_Im_Sorry",
                            "body": "does D+ have the original series of Daredevil? And is this combining viewership from both platforms if so?",
                            "score": 0,
                            "replies": [
                                {
                                    "author": "MrWedge18",
                                    "body": "Yeah, that's where I'm watching it. \n\nI had thought the title was talking about Netflix numbers, but after rereading it it's just saying the show was originally from Netflix. Article is paywalled so no idea.",
                                    "score": 7,
                                    "replies": []
                                },
                                {
                                    "author": "Joshdabozz",
                                    "body": "The defenders shows have been on D+ for 3 years now. They haven’t been on Netflix since 2022",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "IronMike275",
                    "body": "Well my wife and I have been watching all 3 seasons plus the defenders leading up to born again so I’d imagine it’s a 153% spike from a already inflated number",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "SeekerVash",
                    "body": "Yeah, given that it's Variety I can't call it clickbait, so my guess it PR.  \n\nDaredevil Born Again isn't pulling good numbers so far, so I'm guessing Variety's running articles to try and pull people in for Disney.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "dallasmav40",
            "body": "If it wasn’t for Echo and She-Hulk I would have no interest in Dare Devil. I’m loving it though",
            "score": 2,
            "replies": []
        },
        {
            "author": "NervousAd3202",
            "body": "I still think they should’ve done a special release & hyped it up on Disney+ for the ppl who haven’t seen it. \n\nDrop each season like a week apart so ppl have a chance to binge it for the first time in preparation for BA.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Ashamed_Statement347",
            "body": "Ok for someone who stopped the Netflix shows after DD S2, how much is required viewing for DD Born Again?",
            "score": 1,
            "replies": [
                {
                    "author": "Hot_Let7611",
                    "body": "The defenders, daredevil season 3  is essential\n\nIf u want a complete rundown of daredevil and Fisk you need to watch she hulk ep 8 , Hawkeye, spiderman nwh , echo but these aren't completely necessary and are just each characters appearances in the mcu before this series",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Lordsokka",
                    "body": "You need to finish Daredevil and the Defenders, their really important to where Matt is in Born Again.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "xpacean",
                    "body": "Literally nothing. My experience with Daredevil is No Way Home and She-Hulk (and I guess Ben Affleck), and I can follow it just fine. You do have to be able to figure out difficult plot points though like \"Matt and Fisk have a history\" and \"Matt and Foggy are friends.\"",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "RainbowTardigrade",
            "body": "It's almost like when people watch TV shows they like it when there's more of said show to watch instead of a handful of episodes that never get touched on again. Who could've guessed!\n\nHere's hoping Marvel TV sees the success of this and learns the right lesson. Let movies be movies and let tv shows be (good) tv shows!",
            "score": 1,
            "replies": []
        },
        {
            "author": "LegendaryOutlaw",
            "body": "Currently rewatching the netflix Daredevil (and Punisher) series before I start on Born Again. They are definitely worth the rewatch and I since I enjoy a binge, this is giving me something to watch while I wait for Born Again to release in full.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Bricktop72",
            "body": "I'm part of a movement!",
            "score": 1,
            "replies": []
        },
        {
            "author": "Callow98989",
            "body": "Yeah I mean that’s not really impressive. The show has been over for almost a decade now. The show wouldn’t be having high views, but when a new season comes on that’s a continuation of it people A want to rewatch it or B never saw the OG but want to watch it now because of Born again.",
            "score": -1,
            "replies": []
        },
        {
            "author": "Rejectbango",
            "body": "Does Netflix get any money from this?",
            "score": 0,
            "replies": []
        },
        {
            "author": "BlackMall83",
            "body": "Don’t believe everything you see and read on the internet 💯",
            "score": -1,
            "replies": []
        }
    ]
}