{
    "title": "3 years on and I'm still not sick of looking at this thing",
    "author": "Venture334455",
    "subreddit": "pcmasterrace",
    "rank": 19,
    "score": 104,
    "upvote_ratio": 0.94,
    "num_comments (reported by reddit)": 14,
    "url": "https://www.reddit.com/gallery/1je5x2z",
    "id": "1je5x2z",
    "selftext": "My first venture away from console and my first ever PC, built 100% by me.\n\n Back when scalpers had gotten the prices of ps5s up to over $1200aud I thought to myself, that's way too expensive for me to even consider. \n\nSo instead I spent $5k building this PC instead. Make that make sense\n\nRyzen 5600X\nAsus Strix B550-E\n4x 8gb Corsair Vengeance DDR4\nMSI Gaming Z Trio RTX 3080\nEK 360 AIO \nSamsung 980 Pro 500gb SSD\nWD 1T SSD\nLian Li case\n10x Lian Li Uni fans\nLian Li strimmer cable",
    "comments": [
        {
            "author": "Physical-Bed-8458",
            "body": "$1200: no way I'm spending that.\n\n$5000: LET'S GO BABYYY 💸💸💸",
            "score": 25,
            "replies": [
                {
                    "author": "DrKrFfXx",
                    "body": "You never half ass stupidity, you either go full stupid, or stay grounded.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "SQL215",
            "body": "3 years on?! You haven’t rebooted your PC in 3 years?!",
            "score": 4,
            "replies": [
                {
                    "author": "Venture334455",
                    "body": "With the amount of dust i just excavated out of inside the case you'd be forgiven for thinking that 😤",
                    "score": 3,
                    "replies": []
                }
            ]
        },
        {
            "author": "dead-serious",
            "body": "would say the same thing if I was stuck living in the Grid TRON style",
            "score": 2,
            "replies": []
        },
        {
            "author": "Rreizero",
            "body": "Just what I was looking for yesterday! :D\n\nAny lights died/fade on you yet? Any fancy parts that you've needed to replace over 3 years?",
            "score": 1,
            "replies": [
                {
                    "author": "Venture334455",
                    "body": "Nothing! Have had a couple bouts of software quirks but they seem to have resided some time ago.\n\nSometimes out of nowhere id try to boot it up and it would get stuck in a boot loop or be attempting automatic recovery mode on itself lol. Sometimes automatic recovery would work within 3 reboots, Sometimes it was a week or two until out of the blue it could pull its shit together and boot up properly",
                    "score": 2,
                    "replies": []
                }
            ]
        },
        {
            "author": "notebooksbilliger",
            "body": "Looks rad! Also this hardware should serve you well for most games even in the future. :D",
            "score": 1,
            "replies": [
                {
                    "author": "Venture334455",
                    "body": "Yes it still is! I'm playing all my games at 1440p all on maximum graphic settings and my fps is never below 100.\n\nForza 5 runs on 130-140\nCall of Dutys are about the same\nFar Cry 6- 100\nDoom- 280 (I know that doesn't count)",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "XiOpko",
            "body": "Great looking PC, funny how everyone have diffeerent priority. At that time i build 12700k with 6800XT no RGB but huge case PHANTEKS Enthoo Pro 2 for good airflow without glass sidepanel, it cost about 2000 Euros . Now upgraded to 9800x3d + 4080S",
            "score": 1,
            "replies": []
        },
        {
            "author": "Eyeronick",
            "body": "You need 6 reverse blade fans so you don't see the ugly fan cage on your bottom and and right side fans.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Crunchy1254",
            "body": "I am more impressed on how your lianli fans had been lit up  for this long. Mine started dying after a year and a half.",
            "score": 1,
            "replies": [
                {
                    "author": "Venture334455",
                    "body": "For the price of them they shouldn't be dieing at all imo lol",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "darkchaos916",
            "body": "Sick of looking at it? It’s looks amazing. I really need to get strimmers still.",
            "score": 1,
            "replies": []
        }
    ]
}