{
    "title": "Supreme Court weighs criminalizing unhoused people sleeping outside",
    "author": "__The__Anomaly__",
    "subreddit": "progressive",
    "rank": 184,
    "score": 190,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 53,
    "url": "https://www.npr.org/2024/04/22/1245575331/supreme-court-weighs-whether-cities-can-punish-unhoused-people-for-sleeping-outs",
    "id": "1cacw7v",
    "selftext": "",
    "comments": [
        {
            "author": "Mephiz",
            "body": "I have yet to have a sensible discussion with someone who supports these laws as to what they expect homeless people to do.\n\nSome believe churches magically take care of everyone. Others believe their taxes pay for some sort of homeless shelter that families can go to.  Still others think that people can instantly get a job. Don't even get me started on the number of people who have no idea that people have mental illness. \n\nThen after, you dig in, you understand that they don't care about anyone.  If you have someone like this in your life think carefully about their lack of empathy for the person sleeping on the ground.  They don't give a shit about anyone other than themselves and one day you may find yourself on the other side of their \"empathy.\"\n\nLaws like these and the people that support them have convinced me that these people don't care, as long as the homeless disappear from their sight, how this occurs.  They would be just as happy if we allow them to die as long as they are not inconvenienced and, of course, it's out of their sight.",
            "score": 113,
            "replies": [
                {
                    "author": "stos313",
                    "body": "But they can get a job!\n\nThey just need to strap on their job helmets and squeeze down into a job cannon and fire off into Jobland where jobs grow on jobbies!",
                    "score": 40,
                    "replies": [
                        {
                            "author": "__The__Anomaly__",
                            "body": "But they tuk er jerbs!",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "stos313",
                                    "body": "DEY DIT DERRRRR",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Nuclear_rabbit",
                            "body": "And even if that were true, having a job doesn't immediately grant housing.\n\nIn fact, some homeless are employed homeless for the whole duration of their homelessness.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "None",
                    "body": "Charity is not nearly enough. This is firmly established.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "corporaterebel",
                    "body": "So can people just go live in Yellowstone or Point Dune then?\n\n\nEmpathy is not the same as sympathy. I think you mean the latter.",
                    "score": 1,
                    "replies": []
                },
                {
                    "author": "Law_Student",
                    "body": "On the flip side, what do you expect communities and municipalities to do? We can't just let people camp out on the sidewalks using drugs, leaving human waste everywhere, stealing, smashing windows, and harassing and sometimes assaulting people. That's not okay. Nobody has a right to do those things regardless of what their personal situation is, and it's not tenable for communities to endure forever.\n\nIdeally we would have some kind of solution that solves both the concerns of local residents and addresses the needs of the unhoused themselves, but it seems like there are a multitude of challenges there.",
                    "score": -11,
                    "replies": [
                        {
                            "author": "cadium",
                            "body": "If you have housing with services people can access you can start the hard work of getting them to get clean by themselves. If you have the ability to lock up people using drugs for some period of time so they can get clean that probably will work too. And not in a prison but in a place they go into mandatory detox for a couple of days under medical supervision with proper support to try and get them to get clean. That would probably require having a well-functioning court and a law being passed to force a mandatory 7-day detox",
                            "score": 11,
                            "replies": [
                                {
                                    "author": "Pollymath",
                                    "body": "The problem is, because of our laws about involuntary commitment, it's either we charge people with a crime, or we let them do whatever it is they are doing until they commit a crime. \n\nSo, if we do reform the legality of involuntary commitment, we'll basically need a prison that isn't quite a prison, but more of a half-way house. That's fine, but that's only going to house people who are very obviously having mental health troubles. \n\nAs someone who worked getting people into low/no cost mental health programs, it's not those who seek help are the problem. \n\nWhat about people who want to sleep on the street because of counter culture anti-government \"I dont wanna join the system, man\" types? Do we just let them do that? If we offer them free housing, it's going to require that they sit still for a few minutes while we get some information from them, which for some is going to be very difficult, because they are going to let their paranoia get the best of them. We're going to offer employment counselling, which they will turn down, addiction counselling which they'll also turn down, and mental health services, which they'll turn down as well. They may live for free in public housing, but they'll still be on the street panhandling, and honestly I'm ok with that, as long as they aren't littering or harassing people. \n\nIn the end, that's what the vast majority of Americans want - they don't want people panhandling, they don't want people littering or defecating in public, they don't want people harassing them while on drugs or otherwise, and they don't want street/vehicular living to be so comfortable that rich people decide to park their huge RVs on public streets to avoid property taxes.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "author": "cadium",
                                            "body": "Sadly the people don't want their taxes to go up to pay for more prisons or mental hospitals. They also don't want to spend any on housing -- even though housing + services would be cheaper than prisons and long-term would be better for the health of everyone.",
                                            "score": 3,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "greyjungle",
                            "body": "We’ve known the answers to this for a long time. Social programs, better education, a better safety net, mental health treatment, etc.\n\nThis is 100% the result of systemic failure. People need to be face to face with the mess they made, otherwise there is less incentive to fix it. Sweeping it under the rug is not fixing it and only exacerbates the problems.",
                            "score": 3,
                            "replies": [
                                {
                                    "author": "Law_Student",
                                    "body": "Systemic problems are difficult, slow, and potentially ruinously expensive to fix, and I'm not confident you're ever going to help everyone. Have you known many chronically homeless? Many do not want to be helped because that would mean they would have to stop using drugs, and they like using drugs. Others suffer from mental illness and are hostile to anything resembling help. Do you support forcing people into treatment?",
                                    "score": 1,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "red-cloud",
                            "body": "I have no problem with people sleeping or doing drugs in public places. Why does that bother you?\n\nStealing, harassment and assault are already illegal and criminalizing homelessness will do nothing to stop it.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "Law_Student",
                                    "body": "Homeless encampments absolutely attract and produce a whole lot of crime for a neighborhood. \n\nAnd it's entirely reasonable for people to want public places to be safe and available for regular use. That's what they're for. Not for camping out on.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "author": "red-cloud",
                                            "body": "In what world is sleeping not a regular use of a public space?",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "author": "Law_Student",
                                                    "body": "Sidewalks and city parks aren't camping grounds. It's not what those spaces are for.",
                                                    "score": 1,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "author": "AgentCHAOS1967",
                            "body": "If they can house and give money to immigrants they can  do better to provide and help our citizens!",
                            "score": -12,
                            "replies": [
                                {
                                    "author": "CliftonForce",
                                    "body": "We generally don't do that, either. Just the immigrants we incarcerate.",
                                    "score": 4,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Jedi_Ninja",
            "body": "I would not be surprised if the for profit prison system was behind this whole thing.",
            "score": 54,
            "replies": [
                {
                    "author": "None",
                    "body": "[deleted]",
                    "score": 11,
                    "replies": [
                        {
                            "author": "smeggysmeg",
                            "body": "Slave labor. Slavery is still permitted in the Constitution for imprisoned people.",
                            "score": 16,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "feltsandwich",
            "body": "Right wing ideology has been pulling America down the drain for many years. Right wing ideologues attack the weak and vulnerable first because right wing voters are weak.\n\nI fully expect the Supreme Court to rule that criminalizing homelessness is acceptable.\n\nThe further that right wing ideology proliferates in American life, the further that Americans will be forced to suffer the right wing foolishness.",
            "score": 29,
            "replies": []
        },
        {
            "author": "Alon945",
            "body": "lol what the fuck man",
            "score": 4,
            "replies": []
        },
        {
            "author": "rickythepilot",
            "body": "I don't understand why these people choose to be homeless.  All they have to do is have their billionaire friends pay for their home./s",
            "score": 2,
            "replies": [
                {
                    "author": "__The__Anomaly__",
                    "body": "Exactly. Why do they love the Junky Lifestyle so much?",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "greyjungle",
            "body": "Imagine having to explain this to an alien.",
            "score": 2,
            "replies": [
                {
                    "author": "__The__Anomaly__",
                    "body": "I know...",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Pollymath",
            "body": "I have no issue with public sleeping or even camping.\n\nMy biggest issue with homelessness and street living is litter, unsanitary waste disposal, and potential for public harm due to untreated mental health illness.\n\nIf someone can sleep on a park bench without any of those infractions? Great! Sweet dreams!\n\nBut I don't think we should give me people a free pass at trashing society just because they are poor/rich. If your mental health has you taking a dump on a street corner in broad daylight, you should probably get forced into treatment. If your mental health has you hoarding so much that it's spilling out of your RV onto a public street and you just don't seem to give a damn, you should be forcibly removed from that situation. And if you're harassing folks on the street, you should probably be asked to stay in your free public housing until you can refrain from doing that.\n\nI don't want to criminalize being poor, but I also don't want to incentivize being lazy, ignorant, or unaware of the damage someone is doing to society. Both at the bottom and top of the class ladder.",
            "score": -7,
            "replies": [
                {
                    "author": "bonafidebob",
                    "body": "There are laws agains defecating or urinating or even littering in public.\n\nCriminalizing sleeping in order to stop littering is … idiotic.",
                    "score": 16,
                    "replies": []
                }
            ]
        }
    ]
}