{
    "title": "Get Ready Now: Republicans Will Refuse to Certify a Harris Win",
    "author": "Kunphen",
    "subreddit": "progressive",
    "rank": 77,
    "score": 400,
    "upvote_ratio": 0.98,
    "num_comments (reported by reddit)": 35,
    "url": "https://www.thebulwark.com/p/republicans-will-refuse-certify-harris-election?r=1emko&utm_campaign=post&utm_medium=web",
    "id": "1eoidkt",
    "selftext": "",
    "comments": [
        {
            "author": "NightMgr",
            "body": "As an official act, it would seem the sitting president could order the seizure of all voting equipment and the interogation of all election officials in the entire country to sort it all out with complete immunity.",
            "score": 52,
            "replies": []
        },
        {
            "author": "SeekerSpock32",
            "body": "Of the seven swing states, five of them have Democratic secretaries of state. \n\n(NC, NV, AZ, WI, MI)\n\nAs for Pennsylvania and Georgia, their secretaries of state have already refused to cooperate with this exact thing 4 years ago.",
            "score": 52,
            "replies": [
                {
                    "author": "iJuddles",
                    "body": "Dem SoS, mostly (?) Dem Govs, Dem POTUS. It won’t go the way they think or hope it will. They can delay it but in the end they’ll have to certify especially if the margins show clear wins in those states. Sow all the distrust they want, they’ll look like fascist toadies and I think, overall, people are sick of it.",
                    "score": 14,
                    "replies": []
                },
                {
                    "author": "who_likes_chicken",
                    "body": "I've been hearing a lot of chatter that the problem is a ton of MAGA peeps that have been put in at county level elections offices. The idea supposedly is that counties themselves won't certify the real results that would then pass to state level officials.\n\nIt seems to decentralized to be effective enough ino though. Hopefully I'm not wrong",
                    "score": 1,
                    "replies": [
                        {
                            "author": "SeekerSpock32",
                            "body": "They tried this in Wayne County, MI last time and it didn’t work.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Dubsland12",
            "body": "Ok, so Biden won’t leave while they litigate it for 5 years like Trumps crimes and if he dies the VP will take over",
            "score": 87,
            "replies": []
        },
        {
            "author": "zerwind",
            "body": "That will be very difficult is she wins by a landslide. The data is looking like that is posible.\n\nAlso us knowing their game takes a lot of the ability to do it.",
            "score": 61,
            "replies": [
                {
                    "author": "Dyolf_Knip",
                    "body": "Biden won by 7 million votes and they still tried to play games. The more states she wins, the more the magats will convince themselves it's fraud.",
                    "score": 39,
                    "replies": [
                        {
                            "author": "zerwind",
                            "body": "Have you listen to the magas? Listen to their reasons supporting fraud?\n\nIn their heads the size of the crowds, how many political hats, flags, pin, and noise dictated voters. I know it's weird but listening to them proves their mind set on that. \n\nHarris is now blowing that mind set out of the water. Try and say these energetic people didn't vote and see the pushback.",
                            "score": 9,
                            "replies": [
                                {
                                    "author": "Dyolf_Knip",
                                    "body": "But Orange Leader himself said his crowds are way bigger!  Therefore he wins!",
                                    "score": 2,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "aggie1391",
                            "body": "Unfortunately we still have the electoral college, which means Biden won by like 50,000 votes in a few states. It just takes a few states playing BS games to throw everything into chaos",
                            "score": 3,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "TheGreenAlchemist",
                    "body": "Why would that be difficult if she wins by a landslide. What makes it more or less difficult is whose ahead in the senate. She could still win by 100 million votes and if Republicans control the Senate they can still block her. What's the plan B when that happens?",
                    "score": 2,
                    "replies": [
                        {
                            "author": "zerwind",
                            "body": "A louder out cry.\nRepublicans fear pushback and they would get one hell of a push back. Plan B is not for public view.",
                            "score": 2,
                            "replies": [
                                {
                                    "author": "TheGreenAlchemist",
                                    "body": "I'm just not sure about that at this point. If they say they'll pardon the Jan 6ers, I'm not sure there's anything they won't do.",
                                    "score": 3,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "aRoseforUS",
            "body": "Make sure there’s no chance Trump can claim he almost won. We need to work to make it a landslide victory. Volunteer and canvass people!",
            "score": 17,
            "replies": []
        },
        {
            "author": "Opinionsare",
            "body": "The counter move: Biden resigns in December, and Harris is sworn in. Stall certification of Kamala's win if you want, but still she would be president. ",
            "score": 11,
            "replies": []
        },
        {
            "author": "amerett0",
            "body": "Let them reveal themselves to be the fascists they so desperately wish to be.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Han_Ominous",
            "body": "Dems should plan a giant january 6th march on the capital.   Peacefully of course, they will dwarf whatever crowd trump can encourage to attend.\nTake back January 6th.  4 years ago Republicans used it to subvert democracy, this time dems can use it to stand up for democraxy.",
            "score": 8,
            "replies": []
        },
        {
            "author": "BossJackWhitman",
            "body": "He owns SCOTUS, which is all he needs. So, while many of the comments here make light of what may happen after the election, I hope that actual leaders are taking it seriously and making plans for how to respond.",
            "score": 5,
            "replies": []
        },
        {
            "author": "Armenoid",
            "body": "I’m ready",
            "score": 3,
            "replies": []
        }
    ]
}