{
    "title": "Opinion: The presidential election isn’t playing out how I thought it would ",
    "author": "None",
    "subreddit": "progressive",
    "rank": 162,
    "score": 10,
    "upvote_ratio": 0.67,
    "num_comments (reported by reddit)": 24,
    "url": "https://www.cnn.com/2024/05/10/opinions/us-election-isnt-playing-out-how-i-thought-zakaria/index.html",
    "id": "1cq82zo",
    "selftext": "",
    "comments": [
        {
            "author": "StatusKoi",
            "body": "VOTE",
            "score": 12,
            "replies": []
        },
        {
            "author": "None",
            "body": "I don’t think poll results are in synch with the actual voting public - especially in November. Something about polling is very broken. Trump leading Biden by 25 points on who’s more “competent”, is not a believable number. I believe Biden is going to win easily and pollsters are going to need to reassess their methodologies after November.",
            "score": 22,
            "replies": [
                {
                    "author": "fookidookidoo",
                    "body": "My God I hope so. I'm so sick of this shit every 4 years. I miss Republican candidates like McCain and Romney - which feels insane to say.",
                    "score": 11,
                    "replies": []
                },
                {
                    "author": "DosMangos",
                    "body": "Why is it so hard to believe? Like it or not, Biden’s image is more of an older, frail, weak man. Trump is still yelling at his rallies and, since he hasn’t been convicted of anything since his presidency, gives the appearance of being a victim. That’s going to rile up his base.\n\nDon’t forget; [Everyone thought Hillary had the presidency in the bag…](https://youtu.be/-nQGBZQrtT0?si=eyn9srbOk0WUpIRZ&t=3m)",
                    "score": 3,
                    "replies": [
                        {
                            "author": "None",
                            "body": "I’m well aware of what happened with Hillary. She also won the popular vote. Trump was far less known and disliked then.\n\nTrump has openly been deteriorating for the past year. He’s been charged with something like 90 felonies. He’s failed to expand his base of support at all. It’s clear he has a high floor of support as always. But to think he’d grow his support by being out of power, charged with many crimes, found liable for rape? There is no way he has grown his appeal with the overall electorate.\n\nBiden’s got all the challenges of incumbency plus old age. Those always drag a candidate down, he’s not unusual in that regard so it’s possible he’ll lose some support. On the other hand, Trump has a unique effect of rallying independent to vote AGAINST him. Nobody loves Biden (never did-he’s a compromise candidate) but people don’t have reason to hate him.\n\nThe best version of Trump we’ve ever seen lost the popular vote to Hillary, who was a terrible candidate that animated a huge number of voters to dislike her. Biden beat Trump by a wider margin in the popular vote and easily win the EC. I do not see any universe where that trend reverses in 2024. Biden is Biden. He has a strong record to run on. Trump is the worst version of himself we’ve ever seen. It makes no sense to think the electorate is changing direction in this way.\n\nPolling is also worse now. It’s become common to see low-value polls get blasted into headlines to keep the horse race coverage going, but they are often divergent or wildly off. It’s clear that the parties are even promoting obscure polls just to keep their narratives going.\n\nFinally, polls have misjudged the electorate a lot in recent years, especially since the Dobbs decision. Unlike in 2020, half the population has a massive personal reason to vote against republican politicians both locally and nationally. There is a large and growing gender gap that favors Democrats and they’ve been cashing in on it in every election for a couple years now.\n\nThat’s why I think these polls are way off. Biden will expand his margin of victory this time around.",
                            "score": 0,
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Sherman88",
                    "body": "They should have done that over the last 6 cycles, but here we are.",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Jownsye",
            "body": "I think there's a good chance Biden can lose. I don't like him, but I'm still voting for him. He needs the youth vote. I'm not sure he will get it.",
            "score": 10,
            "replies": [
                {
                    "author": "fookidookidoo",
                    "body": "That's my biggest worry. Every young person I know seems to hate Biden. I kinda get it, but I'm also not afraid of Biden so he's getting my vote.",
                    "score": 5,
                    "replies": []
                }
            ]
        },
        {
            "author": "SBY-ScioN",
            "body": "What's a president anyways? Trump has proven that even OBL would be allowed to run as long as he parrots the idiocy of the republican party.",
            "score": 1,
            "replies": []
        }
    ]
}