{
    "title": "Well, I acquired a (replica) Herman Miller Meme lounge chair for $75 on FB Marketplace.",
    "author": "Tybalt_214",
    "subreddit": "malelivingspace",
    "rank": 2,
    "score": 613,
    "upvote_ratio": 0.97,
    "num_comments (reported by reddit)": 58,
    "url": "https://i.redd.it/h5kqfqqs9ipe1.jpeg",
    "id": "1jeemg4",
    "selftext": "I was never going to purchase one because I have cats, but for $75 I won't mind if they put a few scratches on it. ",
    "comments": [
        {
            "author": "vi_sucks",
            "body": "Damn, even for a replica, $75 is a steal.",
            "score": 200,
            "replies": [
                {
                    "author": "Tybalt_214",
                    "body": "Yeah, it's got some scratches on the back panels and I'll probably eventually fill/blend those in. Definitely was a great deal. ",
                    "score": 35,
                    "replies": [
                        {
                            "author": "iamacynic37",
                            "body": "Great find! Absolute mintly picked up - could be a lot worse for that price!",
                            "score": 6,
                            "replies": []
                        },
                        {
                            "author": "FalmerEldritch",
                            "body": "Man, I love buying scratch/dent goods. I'm going to scratch and dent them anyway. No sweating it and half off? Sold.\n\nI bought a *computer* once that was 50% off because it had a big scratch down one side. Almost bought a used car that was around 30% off expected asking because the seller'd scraped it against a wall and it had big paintwork scuffs on the rear passenger door and quarter panel, but someone else got to it first.\n\nUrsula Vernon (one of my favorite authors) has a procedure when she gets a new vehicle of \"taking the curse off\" by taking a hammer and dinging a couple of body panels, so she doesn't have to sweat scratching it up driving on overgrown country roads.",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "PipBoy19",
            "body": "Looks like that’s not your chair anymore",
            "score": 50,
            "replies": [
                {
                    "author": "Tybalt_214",
                    "body": "You are correct. ",
                    "score": 19,
                    "replies": []
                }
            ]
        },
        {
            "author": "bebe_laroux",
            "body": "I paid way more than that fore a replica. Good steal.",
            "score": 48,
            "replies": [
                {
                    "author": "Tybalt_214",
                    "body": "Honestly, I was never going to buy one because of how much they are and I'd be worried about the cats tearing it up.\n\n\nSo this was a win-win. Great deal and I won't stress if they poke some holes in the leather. ",
                    "score": 12,
                    "replies": []
                }
            ]
        },
        {
            "author": "speedygonwhat22",
            "body": "man what!!! 75 for that is a steal. great job staying vigilant.",
            "score": 12,
            "replies": [
                {
                    "author": "Tybalt_214",
                    "body": "I messaged the seller within 4 mins of him posting. Glad he was willing to hold it for me because he said he was blown up not long after. ",
                    "score": 6,
                    "replies": [
                        {
                            "author": "speedygonwhat22",
                            "body": "thats the best. shoutout to the sellers who hold items for the people who show true intent to pick it up.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Pelican_meat",
            "body": "Herman miller meme chair. lol.",
            "score": 16,
            "replies": [
                {
                    "author": "Tybalt_214",
                    "body": "Felt appropriate, lol",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "pizzaparty84",
            "body": "Cats going to destroy the chair like it did that couch",
            "score": 7,
            "replies": [
                {
                    "author": "Tybalt_214",
                    "body": "That chair came pre-destroyed when I bought it off FB Marketplace TBH. ",
                    "score": 4,
                    "replies": []
                },
                {
                    "author": "Jespy",
                    "body": "Lol yup. It’s why I bought 5 year insurance that converts pet wear and tear. Totally worth it IMP",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "ttownfeen",
            "body": "$75 chair for ze kitteh",
            "score": 22,
            "replies": [
                {
                    "author": "Tybalt_214",
                    "body": "Yeah, she's claimed it as her throne and won't let her brother near it. ",
                    "score": 4,
                    "replies": []
                }
            ]
        },
        {
            "author": "PlagueBirdZachariah",
            "body": "So I have a real Herman Miller chair and a replica, because I wanted two, I genuinely can't tell the difference, looks awesome",
            "score": 4,
            "replies": [
                {
                    "author": "Bigheaded_1",
                    "body": "Which replica? There are countless replicas and reviews are all over the place.",
                    "score": 1,
                    "replies": [
                        {
                            "author": "PlagueBirdZachariah",
                            "body": "That is the issue, so many replicas out there, only one original, but the thing is dupes are getting so good, a lot of them are undistinguishable. And due to copyright, a lot of dupe businesses are pop-ups, I swear my Herman Miller Aeron dupe ,  was around for like a week, no brand. \n\nAnd that's in the office chair world, especially when covid hit and everybody wanted the Aeron, when it comes to like house furniture, there are warehouses full of dupes you can go into, especially in the furniture liquidation.\n\n I'm kind of speaking outside of the question at this point, but if you want a genuine Herman Miller anything for really cheap, That is the place to go because so many offices stop functioning during covid and they couldn't get back up, and there's an undescribable amount of furniture in large quantities being piecemealed. My real Aeron was $35, I just had to go pick it up, it was actually cheaper than the dupe itself",
                            "score": 3,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "TimLikesPi",
            "body": "Every now and then put some leather conditioner on it. Also do not be afraid to use black shoe polich on any scratches. I use both on my Eames replica and my Natuzzi leather sofa. \n\nYour couch could use conditioner and brown shoe polish. It won't look brand new but it will look much better.\n\nGet a scratching post!",
            "score": 4,
            "replies": [
                {
                    "author": "Tybalt_214",
                    "body": "Thanks for the advice! ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "MAJ0RMAJOR",
            "body": "That’s a nice kitty right there.",
            "score": 3,
            "replies": []
        },
        {
            "author": "Pumpkinp0calypse",
            "body": "I think 75$ for a cat chair is a little too much. They'll sleep in cardboard boxes you know. /s\n\n(Nice find. I just couldn't help myself when I saw the cat, it reminds me of when I found a papasan chair with cushion in perfect condition down my street, for free and was so happy!!! I had been wanting to buy one for years. But I sat in it like, 3 times so far. My cat is ALWAYS in it and won't budge if I try to scoot her to the side to sit in, too)",
            "score": 3,
            "replies": [
                {
                    "author": "Tybalt_214",
                    "body": "Haha, I worry that's the experience I'm about to have. ",
                    "score": 1,
                    "replies": [
                        {
                            "author": "Pumpkinp0calypse",
                            "body": "I really hope you put a blanket all over it asap, as saddening it is to hide this beauty! 😬 Cats loooove leather and imitation...doubt yours will resist long before making a pan of biscuits in there.",
                            "score": 1,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Annual-Club5510",
            "body": "You mean your cat acquired it",
            "score": 3,
            "replies": []
        },
        {
            "author": "PistolofPete",
            "body": "This is dope",
            "score": 2,
            "replies": []
        },
        {
            "author": "sortofdamaged",
            "body": "Absolute steal, congrats and enjoy",
            "score": 2,
            "replies": []
        },
        {
            "author": "No_Examination_8878",
            "body": "Damn what a steal. Congrats!",
            "score": 2,
            "replies": []
        },
        {
            "author": "CelebrationLiving535",
            "body": "damn, Nice find!",
            "score": 2,
            "replies": []
        },
        {
            "author": "DionFW",
            "body": "Well, your cat did.",
            "score": 2,
            "replies": []
        },
        {
            "author": "Big___TTT",
            "body": "Score",
            "score": 2,
            "replies": []
        },
        {
            "author": "karmagirl314",
            "body": "You’ve made your cat very happy. Excellent purchase.",
            "score": 2,
            "replies": []
        },
        {
            "author": "madpeanut1",
            "body": "Kitty likes it, it’s all that matters.",
            "score": 2,
            "replies": []
        },
        {
            "author": "bananabastard",
            "body": "Your cat finds it adequate.",
            "score": 2,
            "replies": []
        },
        {
            "author": "GSEDAN",
            "body": "Herman meow-er",
            "score": 2,
            "replies": [
                {
                    "author": "Tybalt_214",
                    "body": "Purrfect Pun",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "abarr021",
            "body": "You mean there's a chair for memes?",
            "score": 2,
            "replies": [
                {
                    "author": "Tybalt_214",
                    "body": "Don't let your memes be dreams! ",
                    "score": 1,
                    "replies": []
                }
            ]
        },
        {
            "author": "Mikemtb09",
            "body": "Your pillow made me think the picture was buffering",
            "score": 2,
            "replies": []
        },
        {
            "author": "nokarmawhore",
            "body": "I rented an Airbnb with one of these lounge chairs and my god, it was so comfortable.",
            "score": 2,
            "replies": []
        },
        {
            "author": "X3nox3s",
            "body": "I always thought this is the Eames Lounge Chair and not from Hermann Miller?",
            "score": 3,
            "replies": [
                {
                    "author": "_HanTyumi",
                    "body": "It was designed by Charles and Ray Eames for Herman Miller",
                    "score": 6,
                    "replies": []
                }
            ]
        },
        {
            "author": "Swimming-Swimmer4591",
            "body": "Dang I’m jealous",
            "score": 1,
            "replies": []
        },
        {
            "author": "presterjohn7171",
            "body": "Nice.",
            "score": 1,
            "replies": []
        },
        {
            "author": "a_cat_named_larry",
            "body": "Very cool. Also, it looks like there’s something happening behind your cat that you’ve censored.",
            "score": 1,
            "replies": []
        },
        {
            "author": "rohm418",
            "body": "I had a replica that was really nice, but I just never found it comfortable.",
            "score": 1,
            "replies": []
        },
        {
            "author": "AppealConsistent6749",
            "body": "Great deal! Great shape! But will your cat ever let you sit in it? He/she looks quite comfortable.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Clean-Motor7363",
            "body": "this is one of the nicer replicas I've seen.  I don't see any visible screws.",
            "score": 1,
            "replies": []
        },
        {
            "author": "Clean-Motor7363",
            "body": "this is one of the nicer replicas I've seen.  I don't see any visible screws, and the feet are right.",
            "score": 1,
            "replies": []
        },
        {
            "author": "henare",
            "body": "man. we don't get this sort of goods locally on fb marketplace :(",
            "score": 1,
            "replies": []
        },
        {
            "author": "2shado2",
            "body": "Is that real leather?  Sweet!! :)",
            "score": 1,
            "replies": []
        },
        {
            "author": "Fit_Permission_6187",
            "body": "Congrats on having no originality, I guess ?",
            "score": 1,
            "replies": []
        },
        {
            "author": "Total_Anaconda",
            "body": "Toss the cat in the garbage disposal. They’re a gross invasive species anyway. Its insane how anyone keeps them in their homes let alone on their furniture 🤢",
            "score": -7,
            "replies": [
                {
                    "author": "Wide-attic-6009",
                    "body": "Not cool dude, even if that comment was sarcastic it’s a terrible read.",
                    "score": 2,
                    "replies": []
                }
            ]
        }
    ]
}